
#Область ПеренесеноСДоработками

// Задает типы предметов взаимодействий, например: заказы, вакансии и т.п.
// Используется, если в конфигурации определен хотя бы один предмет взаимодействий. 
//
// Параметры:
//  ТипыПредметов  - Массив - предметы взаимодействий (Строка),
//                            например, "ДокументСсылка.ЗаказПокупателя" и т.п.
//
&После("ПриОпределенииВозможныхПредметов")
Процедура смарт_ПриОпределенииВозможныхПредметов(ТипыПредметов)
	
	//Каратеев ++ //Переписано после обновления на 11.4.6.166
	// Фролов+ исправление ошибки удаления из массива было ТипыПредметов.Удалить("СправочникСсылка.МаркетинговыеМероприятия")
	Индекс=ТипыПредметов.Найти("СправочникСсылка.МаркетинговыеМероприятия");
	Если Не Индекс=Неопределено Тогда 
		ТипыПредметов.Удалить(Индекс);  
	КонецЕсли;
	// Фролов-
	ТипыПредметов.Добавить("ДокументСсылка.МаркетинговыеМероприятияДокумент");
	ТипыПредметов.Добавить("СправочникСсылка.смартИсточникиРекламногоВоздействия");
	//Каратеев --
	
КонецПроцедуры

#КонецОбласти
