#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "Партнер");
	смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛид(Команда)
	
	СоздатьЛидНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БизнесРегионПриИзменении(Элемент)
	
	ЭтаФорма.БизнесРегион = НайтиРегионВерхнегоУровня(ЭтаФорма.БизнесРегион);
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура СоздатьЛидНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция НайтиРегионВерхнегоУровня(Регион)
	
	РегионПоиска=Регион;
	
	Пока ЗначениеЗаполнено(РегионПоиска.Родитель) Цикл
		
		РегионПоиска=НайтиРегионВерхнегоУровня(РегионПоиска.Родитель);
		
	КонецЦикла;
	
	Возврат РегионПоиска;
	
КонецФункции

#КонецОбласти