#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработкамиСмарт 

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура смарт_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;

	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);

	// Сформируем отчет
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();

	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ВыручкаИСебестоимостьПродаж.Запрос;

	#Вставка
	//++ #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов
	Если НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоДатеЗакрытияЗаказов")).Значение Тогда
		
		СхемаКомпоновкиДанных.Параметры.НачалоПериода.Выражение = "";
		СхемаКомпоновкиДанных.Параметры.ОкончаниеПериода.Выражение = "";
		
		СтандартныйПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение; 
		
		НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериодаДатаЗакрытияЗаказов", СтандартныйПериод.ДатаНачала);
		НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериодаДатаЗакрытияЗаказов", СтандартныйПериод.ДатаОкончания);
		
		НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 
				смартОбщегоНазначенияСКэш.КонвертироватьПериодЗакрытияЗаказовВПериодРегистраВиСП(СтандартныйПериод.ДатаНачала, "НачалоПериода"));		
				
		НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода", 
				смартОбщегоНазначенияСКэш.КонвертироватьПериодЗакрытияЗаказовВПериодРегистраВиСП(СтандартныйПериод.ДатаОкончания, "ОкончаниеПериода")); 
				
	КонецЕсли;
	//-- #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов
	
	//++ #Б-6344 смарт: Фролов 03.04.2026 //Добавление в отчет по валовой прибыли возможности учета продаж с ДИЦ.
	СписокСерий = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("СписокСерий").Значение;
	
	СписокСерий.ЗагрузитьЗначения(Справочники.смартПредопределенныеЗначения.Настройки.СерийныеНомераДляРаспродажи.ВыгрузитьКолонку("СерияНоменклатуры"));
	//-- #Б-6344 смарт: Фролов 03.04.2026
	#КонецВставки
	
	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса, 
	"&ТекстЗапросаВесНоменклатуры1", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура"));

	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса, 
	"&ТекстЗапросаОбъемНоменклатуры1", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура"));

	СхемаКомпоновкиДанных.НаборыДанных.ВыручкаИСебестоимостьПродаж.Запрос = ТекстЗапроса;	

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);

	// Проверим, что хотя бы одна группировка отчета включена
	Если МакетКомпоновки.НаборыДанных.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru= 'Отчет не сформирован. Включите хотя бы одну группировку в ""Элементы оформления и группировки"".'") ;
	КонецЕсли;

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("Поставщик");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьПредупреждениеОбОсобенностяхФормированияОтчета(ДокументРезультат, КомпоновщикНастроек, ПроверяемыеПоля);

	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	КомпоновкаДанныхСервер.ОформитьДиаграммыОтчета(КомпоновщикНастроек, ДокументРезультат);
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());

	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов
Функция смартПолучитьТекстЗапроса()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Партнер КАК Партнер,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментПартнеров,
	|	Сегменты.Партнер.* КАК Партнер}

	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	ИспользуетсяОтборПоСегментуПартнеров
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Номенклатура КАК Номенклатура,
	|	Сегменты.Характеристика КАК Характеристика,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
	|ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментНоменклатуры,
	|	Сегменты.Номенклатура.* КАК Номенклатура,
	|	Сегменты.Характеристика.* КАК Характеристика}

	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ИспользуетсяОтборПоСегментуНоменклатуры
	|;
	
	//++ #4454 смарт: Тимофеева 25.09.2025 / Отчет Валовая прибыль предприятия. Исключить из оборотов ВГО (опционально)
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ КонтрагентыВГО
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО (Контрагенты.ИНН = Организации.ИНН)
	|ГДЕ
	|	НЕ Контрагенты.ИНН = """"
	|; 
	//-- #4454 смарт: Тимофеева 25.09.2025
	
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
  	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Организация.ИНН КАК ИННОрганизации,
	|	НАЧАЛОПЕРИОДА(СчетФактураВыданный.Дата, ДЕНЬ) КАК ДатаСФ,
	|	СОКРЛП(СчетФактураВыданный.ПредставлениеНомера) КАК НомерСФ,
	|	СчетФактураВыданный.ДокументОснование КАК ДокументРеализацииВГО
	|ПОМЕСТИТЬ ВТ_ДокументыВГО
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	 &КорректироватьСебестоимостьПриВГО И НЕ СчетФактураВыданный.Контрагент.ИНН = """" И СчетФактураВыданный.Контрагент.ИНН В
	|			(ВЫБРАТЬ Организации.ИНН КАК ИНН ИЗ Справочник.Организации КАК Организации)
	|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиВГО.Регистратор КАК ДокументРеализацииВГО,
	|	ПродажиВГО.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ПродажиВГО.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА СУММА(ВЫБОР
	|						КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|								И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|							ТОГДА ВЫБОР
	|									КОГДА СтоимостьНоменклатуры.Стоимость = СтоимостьНоменклатуры.СтоимостьБезНДС
	|											И НЕ ПродажиВГО.Партия ССЫЛКА Документ.СборкаТоваров
	|										ТОГДА ЕСТЬNULL(СтоимостьНоменклатуры.Стоимость, 0) / 1.2
	|									ИНАЧЕ ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0)
	|								КОНЕЦ
	|						ИНАЧЕ ЕСТЬNULL(СтоимостьНоменклатуры.Стоимость, 0)
	|					КОНЕЦ)
	|		ИНАЧЕ СУММА(ВЫБОР
	|					КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|							И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|						ТОГДА ВЫБОР
	|								КОГДА ПродажиВГО.Стоимость = ПродажиВГО.СтоимостьБезНДС
	|										И НЕ ПродажиВГО.Партия ССЫЛКА Документ.СборкаТоваров
	|									ТОГДА ПродажиВГО.Стоимость / 1.2
	|								ИНАЧЕ ПродажиВГО.СтоимостьБезНДС
	|							КОНЕЦ
	|					ИНАЧЕ ПродажиВГО.Стоимость
	|				КОНЕЦ) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА СУММА(ВЫБОР
	|						КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|								И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|							ТОГДА ВЫБОР
	|									КОГДА СтоимостьНоменклатуры.Стоимость = СтоимостьНоменклатуры.СтоимостьБезНДС
	|											И НЕ ПродажиВГО.Партия ССЫЛКА Документ.СборкаТоваров
	|										ТОГДА ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0) / 1.2
	|									ИНАЧЕ ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0)
	|								КОНЕЦ
	|						ИНАЧЕ ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0)
	|					КОНЕЦ)
	|		ИНАЧЕ СУММА(ВЫБОР
	|					КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|							И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|						ТОГДА ВЫБОР
	|								КОГДА ПродажиВГО.Стоимость = ПродажиВГО.СтоимостьБезНДС
	|										И НЕ ПродажиВГО.Партия ССЫЛКА Документ.СборкаТоваров
	|									ТОГДА ПродажиВГО.СтоимостьБезНДС / 1.2
	|								ИНАЧЕ ПродажиВГО.СтоимостьБезНДС
	|							КОНЕЦ
	|					ИНАЧЕ ПродажиВГО.СтоимостьБезНДС
	|				КОНЕЦ) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК СтоимостьБезНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА СУММА(ВЫБОР
	|						КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|								И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|							ТОГДА ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходыБезНДС, 0)
	|						ИНАЧЕ ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходы, 0)
	|					КОНЕЦ)
	|		ИНАЧЕ СУММА(ВЫБОР
	|					КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|							И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|						ТОГДА ПродажиВГО.ДопРасходыБезНДС
	|					ИНАЧЕ ПродажиВГО.ДопРасходы
	|				КОНЕЦ) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК ДопРасходы,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА МАКСИМУМ(ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходыБезНДС, 0))
	|		ИНАЧЕ СУММА(ПродажиВГО.ДопРасходыБезНДС) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК ДопРасходыБезНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА МАКСИМУМ(ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьУпр, 0))
	|		ИНАЧЕ СУММА(ПродажиВГО.СтоимостьУпр) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК СтоимостьУпр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА МАКСИМУМ(ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьРегл, 0))
	|		ИНАЧЕ СУММА(ПродажиВГО.СтоимостьРегл) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА МАКСИМУМ(ЕСТЬNULL(СтоимостьНоменклатуры.ДопРасходыУпр, 0))
	|		ИНАЧЕ СУММА(ПродажиВГО.ДопРасходыУпр) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК ДопРасходыУпр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			ТОГДА МАКСИМУМ(ЕСТЬNULL(СтоимостьНоменклатуры.ДопРасходыРегл, 0))
	|		ИНАЧЕ СУММА(ПродажиВГО.ДопРасходыРегл) / СУММА(ПродажиВГО.Количество)
	|	КОНЕЦ КАК ДопРасходыРегл
	|ПОМЕСТИТЬ ВТ_ПродажиВГО
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ПродажиВГО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыВГО КАК ВТ_ДокументыВГО
	|		ПО (ПродажиВГО.Регистратор = ВТ_ДокументыВГО.ДокументРеализацииВГО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимостиОрганизации
	|		ПО (НАЧАЛОПЕРИОДА(ПродажиВГО.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетСебестоимостиОрганизации.Ссылка.Дата, МЕСЯЦ))
	|			И (ПродажиВГО.АналитикаУчетаПоПартнерам.Организация = РасчетСебестоимостиОрганизации.Организация)
	|			И (РасчетСебестоимостиОрганизации.Ссылка.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьНоменклатуры
	|		ПО (ПродажиВГО.АналитикаУчетаНоменклатуры = СтоимостьНоменклатуры.АналитикаУчетаНоменклатуры)
	|			И (ПродажиВГО.АналитикаУчетаПоПартнерам.Организация = СтоимостьНоменклатуры.Организация)
	|			И (ПродажиВГО.ВидЗапасов = СтоимостьНоменклатуры.ВидЗапасов)
	|			И (СтоимостьНоменклатуры.Период = НАЧАЛОПЕРИОДА(ПродажиВГО.Период, МЕСЯЦ))
	|			И (ПродажиВГО.РазделУчета = СтоимостьНоменклатуры.РазделУчета)
	|			И (ЕСТЬNULL(РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет, ЛОЖЬ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО (ПродажиВГО.Регистратор = НДССостояниеРеализации0.Регистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних({(&ОкончаниеПериода)}, ) КАК УчетнаяПолитикаОрганизаций
	|		ПО (ПродажиВГО.АналитикаУчетаПоПартнерам.Организация = УчетнаяПолитикаОрганизаций.Организация)
	
	|СГРУППИРОВАТЬ ПО
	|	ПродажиВГО.Регистратор,
	|	ПродажиВГО.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ПродажиВГО.АналитикаУчетаНоменклатуры.Характеристика,
	|	РасчетСебестоимостиОрганизации.Ссылка.ПредварительныйРасчет
	|;	  	
	//--#4508 смарт: Тимофеева 03.10.2025
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.Регистратор,
	|	
	|	Таблица.ПериодСекунда,
	|	Таблица.ПериодДень,
	|	Таблица.ПериодНеделя,
	|	Таблица.ПериодДекада,
	|	Таблица.ПериодМесяц,
	|	Таблица.ПериодКвартал,
	|	Таблица.ПериодПолугодие,
	|	Таблица.ПериодГод,
	|	
	|	СУММА(Таблица.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.Выручка)
	|		КОГДА &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.ВыручкаРегл)
	|		ИНАЧЕ СУММА(Таблица.ВыручкаБезНДС)
	|	КОНЕЦ КАК Выручка,
	|	СУММА(Таблица.Выручка) - СУММА(Таблица.ВыручкаБезНДС) КАК ВыручкаНДС,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.СуммаРучнойСкидкиОборот)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРучнойСкидки,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.СуммаАвтоматическойСкидкиОборот)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.СуммаРучнойСкидкиОборот)
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.СуммаАвтоматическойСкидкиОборот)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВсегоСкидок,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.Себестоимость)
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.СебестоимостьБезНДС)
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.СебестоимостьУпр)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.СебестоимостьРегл)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				СУММА(Таблица.СебестоимостьБезНДС)
	|			ИНАЧЕ
	|				СУММА(Таблица.СебестоимостьУпр)
	|			КОНЕЦ
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.ДопРасходы)
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.ДопРасходыБезНДС)
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.ДопРасходыУпр)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.ДопРасходыРегл)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				СУММА(Таблица.ДопРасходыБезНДС)
	|			ИНАЧЕ
	|				СУММА(Таблица.ДопРасходыУпр)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДопРасходы,
	|	
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.Трудозатраты)
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.Трудозатраты)
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.ТрудозатратыУпр)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.ТрудозатратыРегл)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				СУММА(Таблица.Трудозатраты)
	|			ИНАЧЕ
	|				СУММА(Таблица.ТрудозатратыУпр)
	|			КОНЕЦ
	|	КОНЕЦ КАК Трудозатраты,
	|	
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеСНДС)
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеУпр)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеРегл)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
	|			ИНАЧЕ
	|				СУММА(Таблица.ПостатейныеПостоянныеУпр)
	|			КОНЕЦ
	|	КОНЕЦ КАК ПостатейныеПостоянные,
	|	
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеСНДС)
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеБезНДС)
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеУпр)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеРегл)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				СУММА(Таблица.ПостатейныеПеременныеБезНДС)
	|			ИНАЧЕ
	|				СУММА(Таблица.ПостатейныеПеременныеУпр)
	|			КОНЕЦ
	|	КОНЕЦ КАК ПостатейныеПеременные,
	|	
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СУММА(Таблица.Выручка)
	|			- СУММА(Таблица.Себестоимость)
	|			- СУММА(Таблица.ДопРасходы)
	|			- СУММА(Таблица.Трудозатраты)
	|			- СУММА(Таблица.ПостатейныеПостоянныеСНДС)
	|			- СУММА(Таблица.ПостатейныеПеременныеСНДС)
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|			- СУММА(Таблица.СебестоимостьБезНДС)
	|			- СУММА(Таблица.ДопРасходыБезНДС)
	|			- СУММА(Таблица.Трудозатраты)
	|			- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
	|			- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|			- СУММА(Таблица.СебестоимостьУпр)
	|			- СУММА(Таблица.ДопРасходыУпр)
	|			- СУММА(Таблица.ТрудозатратыУпр)
	|			- СУММА(Таблица.ПостатейныеПостоянныеУпр)
	|			- СУММА(Таблица.ПостатейныеПеременныеУпр)
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СУММА(Таблица.ВыручкаРегл)
	|			- СУММА(Таблица.СебестоимостьРегл)
	|			- СУММА(Таблица.ДопРасходыРегл)
	|			- СУММА(Таблица.ТрудозатратыРегл)
	|			- СУММА(Таблица.ПостатейныеПостоянныеРегл)
	|			- СУММА(Таблица.ПостатейныеПеременныеРегл)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				СУММА(Таблица.ВыручкаБезНДС)
	|				- СУММА(Таблица.СебестоимостьБезНДС)
	|				- СУММА(Таблица.ДопРасходыБезНДС)
	|				- СУММА(Таблица.Трудозатраты)
	|				- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
	|				- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
	|			ИНАЧЕ
	|				СУММА(Таблица.ВыручкаБезНДС)
	|				- СУММА(Таблица.СебестоимостьУпр)
	|				- СУММА(Таблица.ДопРасходыУпр)
	|				- СУММА(Таблица.ТрудозатратыУпр)
	|				- СУММА(Таблица.ПостатейныеПостоянныеУпр)
	|				- СУММА(Таблица.ПостатейныеПеременныеУпр)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВаловаяПрибыль,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА СУММА(Таблица.Выручка) <> 0
	|						ТОГДА (СУММА(Таблица.Выручка)
	|							- СУММА(Таблица.Себестоимость)
	|							- СУММА(Таблица.ДопРасходы)
	|							- СУММА(Таблица.Трудозатраты)
	|							- СУММА(Таблица.ПостатейныеПостоянныеСНДС)
	|							- СУММА(Таблица.ПостатейныеПеременныеСНДС)
	|						) / ВЫБОР КОГДА СУММА(Таблица.Выручка) > 0
	|								ТОГДА СУММА(Таблица.Выручка)
	|								ИНАЧЕ -1*СУММА(Таблица.Выручка)
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ * 100 КАК ЧИСЛО(15, 2))
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
	|						ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
	|							- СУММА(Таблица.СебестоимостьБезНДС)
	|							- СУММА(Таблица.ДопРасходыБезНДС)
	|							- СУММА(Таблица.Трудозатраты)
	|							- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
	|							- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
	|						) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
	|								ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|								ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ * 100 КАК ЧИСЛО(15, 2))
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
	|						ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
	|							- СУММА(Таблица.СебестоимостьУпр)
	|							- СУММА(Таблица.ДопРасходыУпр)
	|							- СУММА(Таблица.ТрудозатратыУпр)
	|							- СУММА(Таблица.ПостатейныеПостоянныеУпр)
	|							- СУММА(Таблица.ПостатейныеПеременныеУпр)
	|						) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
	|								ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|								ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ * 100 КАК ЧИСЛО(15, 2))
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА СУММА(Таблица.ВыручкаРегл) <> 0
	|						ТОГДА (СУММА(Таблица.ВыручкаРегл)
	|							- СУММА(Таблица.СебестоимостьРегл)
	|							- СУММА(Таблица.ДопРасходыРегл)
	|							- СУММА(Таблица.ТрудозатратыРегл)
	|							- СУММА(Таблица.ПостатейныеПостоянныеРегл)
	|							- СУММА(Таблица.ПостатейныеПеременныеРегл)
	|						) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаРегл) > 0
	|								ТОГДА СУММА(Таблица.ВыручкаРегл)
	|								ИНАЧЕ -1*СУММА(Таблица.ВыручкаРегл)
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ * 100 КАК ЧИСЛО(15, 2)) 
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
	|				ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
	|							ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
	|								- СУММА(Таблица.СебестоимостьБезНДС)
	|								- СУММА(Таблица.ДопРасходыБезНДС)
	|								- СУММА(Таблица.Трудозатраты)
	|								- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
	|								- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
	|							) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
	|									ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|									ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ * 100 КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
	|							ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
	|								- СУММА(Таблица.СебестоимостьУпр)
	|								- СУММА(Таблица.ДопРасходыУпр)
	|								- СУММА(Таблица.ТрудозатратыУпр)
	|								- СУММА(Таблица.ПостатейныеПостоянныеУпр)
	|								- СУММА(Таблица.ПостатейныеПеременныеУпр)
	|							) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
	|									ТОГДА СУММА(Таблица.ВыручкаБезНДС)
	|									ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ * 100 КАК ЧИСЛО(15, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Рентабельность,
	|	ВЫБОР
	|		КОГДА Таблица.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПродажиМеждуОрганизациями,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	Таблица.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	Таблица.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	&ТекстЗапросаВесНоменклатуры1 КАК НоменклатураВес,
	|	&ТекстЗапросаОбъемНоменклатуры1 КАК НоменклатураОбъем,
	|	Таблица.Номенклатура.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Серия КАК Серия,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Продавец КАК Продавец,
	|	Таблица.Партнер КАК Партнер,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Таблица.ЗаказКлиента КАК ЗаказКлиента,
	|	Таблица.Подразделение КАК Подразделение,
	|	Таблица.Склад КАК Склад,
	|	Таблица.Контрагент КАК Контрагент,
	|	Таблица.Покупатель КАК Покупатель,
	|	Таблица.Поставщик КАК Поставщик,
	|	Таблица.Менеджер КАК Менеджер,
	|	Таблица.Сделка КАК Сделка,
	|	Таблица.МенеджерСделки КАК МенеджерСделки,
	|	Таблица.ВидЗапасов КАК ВидЗапасов,
	|	Таблица.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Таблица.ВидСделки,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.ДатаЗакрытияЗаказа,
	|	Таблица.СтатусЗаказаКлиента,
	|	Таблица.БизнесРегионКлиента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Продажи.Регистратор = НЕОПРЕДЕЛЕНО
	|				ТОГДА NULL
	|			ИНАЧЕ Продажи.Регистратор
	|		КОНЕЦ КАК Регистратор,
	|		
	//++ #Б4194 смарт: Шляпников 16.09.2025 / Проверить корректность отчета Динамика продаж по условию "по дате закрытия заказов" 
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА Продажи.смартДатаЗакрытияЗаказа
	|			ИНАЧЕ Продажи.ПериодСекунда КОНЕЦ КАК ПериодСекунда,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, ДЕНЬ)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодДень, ДЕНЬ) КОНЕЦ КАК ПериодДень,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, НЕДЕЛЯ)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодНеделя, НЕДЕЛЯ) КОНЕЦ КАК ПериодНеделя,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, ДЕКАДА)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодДекада, ДЕКАДА) КОНЕЦ КАК ПериодДекада,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, МЕСЯЦ)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодМесяц, МЕСЯЦ) КОНЕЦ КАК ПериодМесяц,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, КВАРТАЛ)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодКвартал, КВАРТАЛ) КОНЕЦ КАК ПериодКвартал,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, ПОЛУГОДИЕ)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодПолугодие, ПОЛУГОДИЕ) КОНЕЦ КАК ПериодПолугодие,
	|		ВЫБОР КОГДА &ПоДатеЗакрытияЗаказов ТОГДА НачалоПериода(Продажи.смартДатаЗакрытияЗаказа, ГОД)
	|			ИНАЧЕ НачалоПериода(Продажи.ПериодГод, ГОД) КОНЕЦ КАК ПериодГод,
	//-- #Б4194 смарт: Шляпников 16.09.2025
	|		
	|		ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)) КАК Сделка,
	|		ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК МенеджерСделки,
	|		ВЫБОР
	|			КОГДА Продажи.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|				ТОГДА ЕСТЬNULL(Продажи.ЗаказКлиента.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|			ИНАЧЕ Продажи.Менеджер
	|		КОНЕЦ КАК Менеджер,
	|		Продажи.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		Продажи.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		Продажи.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|		Продажи.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|		Продажи.АналитикаУчетаПоПартнерам.Организация КАК Продавец,
	|		Продажи.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,  
	|		Продажи.АналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Продажи.ВидЗапасов КАК ВидЗапасов,
	|		Продажи.ВидЗапасов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		Продажи.Подразделение КАК Подразделение,
	|		Продажи.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|		ВЫБОР
	|			КОГДА Продажи.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|				ТОГДА Продажи.ВидЗапасов.ВладелецТовара
	|		ИНАЧЕ
	|			Продажи.АналитикаУчетаПартий.Поставщик
	|		КОНЕЦ КАК Поставщик,
	|		Продажи.ЗаказКлиента КАК ЗаказКлиента,
	|		ВЫБОР
	|			КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Контрагенты
	|				ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК Контрагент,
	|		ВЫБОР
	|			КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК Покупатель,
	|		ВЫБОР
	|			КОГДА НЕ Продажи.ЗаказКлиента.Сделка.ВидСделки ЕСТЬ NULL 
	|				ТОГДА Продажи.ЗаказКлиента.Сделка.ВидСделки.Наименование
	|			КОГДА Продажи.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|					ИЛИ Продажи.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
	|				ТОГДА &СтрокаПродажиПоЗаказам
	|			ИНАЧЕ &СтрокаПродажиБезЗаказов
	|		КОНЕЦ КАК ВидСделки,
	|		Продажи.КоличествоОборот КАК Количество,
	|		Продажи.СуммаВыручкиОборот КАК Выручка,
	|		Продажи.СуммаВыручкиРеглОборот КАК ВыручкаРегл,
	|		Продажи.СуммаВыручкиБезНДСОборот КАК ВыручкаБезНДС,
	|		ВЫБОР
	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|				ТОГДА Продажи.СуммаВыручкиОборот
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.Стоимость, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			//++#1829 смарт: Лопато 14.06.2024 //Доработать отчет Валовая прибыль (прод. 1544)
	|			//	ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.Стоимость, 0) КАК ЧИСЛО(15, 2))
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * 
	|						  ВЫБОР 
	|						  	  КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|									И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения 
	|									  = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|							  ТОГДА
	|						 	  	  ВЫБОР 
	|									  КОГДА СтоимостьНоменклатуры.Стоимость = СтоимостьНоменклатуры.СтоимостьБезНДС
	|                    		                И НЕ Продажи.Партия ССЫЛКА Документ.СборкаТоваров
	|									  ТОГДА
	|									      ВЫРАЗИТЬ((ЕСТЬNULL(СтоимостьНоменклатуры.Стоимость, 0) / 1.2) КАК ЧИСЛО(15, 2))
	|								  	  ИНАЧЕ
	|								  	  	  ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0)
	|								  КОНЕЦ	  
	|						      ИНАЧЕ
	|							  	  ЕСТЬNULL(СтоимостьНоменклатуры.Стоимость, 0)
	|						  КОНЕЦ
	|					      КАК ЧИСЛО(15, 2))
	|			//ИНАЧЕ Продажи.СтоимостьОборот
	|			ИНАЧЕ ВЫБОР 
	|					  КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|					  	    И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения 
	|							  = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая) 
	|					  ТОГДА
	|						  ВЫБОР 
	|							  КОГДА Продажи.СтоимостьОборот = Продажи.СтоимостьБезНДСОборот
	|                           		И НЕ Продажи.Партия ССЫЛКА Документ.СборкаТоваров
	|							  ТОГДА
	|						  	  	  ВЫРАЗИТЬ((ЕСТЬNULL(Продажи.СтоимостьОборот, 0) / 1.2) КАК ЧИСЛО(15, 2))
	|						  	  ИНАЧЕ
	|							  	  ЕСТЬNULL(Продажи.СтоимостьБезНДСОборот, 0)
	|						  КОНЕЦ	  
	|				  	  ИНАЧЕ
	|					   	  Продажи.СтоимостьОборот
	|				  КОНЕЦ	
	|			//--#1829 смарт: Лопато 14.06.2024 //Доработать отчет Валовая прибыль (прод. 1544)
	|		КОНЕЦ КАК Себестоимость,
	|		ВЫБОР
	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|				ТОГДА Продажи.СуммаВыручкиБезНДСОборот
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.СтоимостьБезНДС, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			//++#1829 смарт: Лопато 14.06.2024 //Доработать отчет Валовая прибыль (прод. 1544)
	|			//	ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0) КАК ЧИСЛО(15, 2))
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * 
	|						  ВЫБОР 
	|						  	  КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|									И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения 
	|									  = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая) 
	|							  ТОГДА
	|						 	  	  ВЫБОР 
	|									  КОГДА СтоимостьНоменклатуры.Стоимость = СтоимостьНоменклатуры.СтоимостьБезНДС
	|                                   		И НЕ Продажи.Партия ССЫЛКА Документ.СборкаТоваров
	|									  ТОГДА
	|									      ВЫРАЗИТЬ((ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0) / 1.2) КАК ЧИСЛО(15, 2))
	|								  	  ИНАЧЕ
	|								  	  	  ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0)
	|								  КОНЕЦ	  
	|						      ИНАЧЕ
	|							  	  ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0)
	|						  КОНЕЦ
	|					      КАК ЧИСЛО(15, 2))
	|			//ИНАЧЕ Продажи.СтоимостьБезНДСОборот
	|			ИНАЧЕ ВЫБОР 
	|					  КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|					  	    И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения 
	|							  = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая) 
	|					  ТОГДА
	|						  ВЫБОР 
	|							  КОГДА Продажи.СтоимостьОборот = Продажи.СтоимостьБезНДСОборот
	|                           		И НЕ Продажи.Партия ССЫЛКА Документ.СборкаТоваров
	|							  ТОГДА
	|						  	  	  ВЫРАЗИТЬ((ЕСТЬNULL(Продажи.СтоимостьБезНДСОборот, 0) / 1.2) КАК ЧИСЛО(15, 2))
	|						  	  ИНАЧЕ
	|							  	  ЕСТЬNULL(Продажи.СтоимостьБезНДСОборот, 0)
	|						  КОНЕЦ	  
	|				  	  ИНАЧЕ
	|					   	  Продажи.СтоимостьБезНДСОборот
	|				  КОНЕЦ	
	|			//--#1829 смарт: Лопато 14.06.2024 //Доработать отчет Валовая прибыль (прод. 1544)
	|		КОНЕЦ КАК СебестоимостьБезНДС,
	|		ВЫБОР
	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|				ТОГДА Продажи.СуммаВыручкиРеглОборот
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.СтоимостьРегл, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьРегл, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.СтоимостьРеглОборот
	|		КОНЕЦ КАК СебестоимостьРегл,
	|		ВЫБОР
	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|				ТОГДА Продажи.СуммаВыручкиБезНДСОборот
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.СтоимостьУпр, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьУпр, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.СтоимостьУпрОборот
	|		КОНЕЦ КАК СебестоимостьУпр,
	|		
	|		// Доп. расходы
	|		ВЫБОР
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.ДопРасходы, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			//++#Б-2592 смарт: Лопато 06.03.2025 //Отчет Валовая прибыль. Некорректно рассчитывается экспортный НДС.
	|			//	ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходы, 0) КАК ЧИСЛО(15, 2))
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * 
	|						  ВЫБОР 
	|						  	  КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|									И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения 
	|									  = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая) 
	|							  ТОГДА
	|						  	  	  ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходыБезНДС, 0)
	|						      ИНАЧЕ
	|							  	  ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходы, 0)
	|						  КОНЕЦ
	|					      КАК ЧИСЛО(15, 2))
	|			//ИНАЧЕ Продажи.ДопРасходыОборот
	|			ИНАЧЕ ВЫБОР 
	|					  КОГДА НЕ НДССостояниеРеализации0.Состояние ЕСТЬ NULL
	|					  	    И УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения 
	|							  = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая) 
	|					  ТОГДА
	|					  	  ЕСТЬNULL(Продажи.ДопРасходыБезНДСОборот, 0)
	|				  	  ИНАЧЕ
	|					   	  Продажи.ДопРасходыОборот
	|				  КОНЕЦ	
	|			//--#Б-2592 смарт: Лопато 06.03.2025 //Отчет Валовая прибыль. Некорректно рассчитывается экспортный НДС.
	|		КОНЕЦ КАК ДопРасходы,
	|		ВЫБОР
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.ДопРасходыУпр, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ДопРасходыУпр, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ДопРасходыУпрОборот
	|		КОНЕЦ КАК ДопРасходыУпр,
	|		ВЫБОР
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.ДопРасходыБезНДС, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ДопРасходыБезНДСОборот
	|		КОНЕЦ КАК ДопРасходыБезНДС,
	|		ВЫБОР
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        КОГДА НЕ ВТ_ДокументыВГО.ДокументРеализацииВГО ЕСТЬ NULL ТОГДА
	|			      ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(ВТ_ПродажиВГО.ДопРасходыРегл, 0) КАК ЧИСЛО(15, 2))	
	//-- #4508 смарт: Тимофеева 03.10.2025
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ДопРасходыРегл, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ДопРасходыРеглОборот
	|		КОНЕЦ КАК ДопРасходыРегл,
	|		
	|		// Трудозатраты
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.Трудозатраты, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ТрудозатратыОборот
	|		КОНЕЦ КАК Трудозатраты,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ТрудозатратыУпр, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ТрудозатратыУпрОборот
	|		КОНЕЦ КАК ТрудозатратыУпр,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ТрудозатратыРегл, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ТрудозатратыРеглОборот
	|		КОНЕЦ КАК ТрудозатратыРегл,
	|		
	|		// Постоянные постательные
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеСНДСОборот
	|		КОНЕЦ КАК ПостатейныеПостоянныеСНДС,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеБезНДСОборот
	|		КОНЕЦ КАК ПостатейныеПостоянныеБезНДС,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеУпрОборот
	|		КОНЕЦ КАК ПостатейныеПостоянныеУпр,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеРеглОборот
	|		КОНЕЦ КАК ПостатейныеПостоянныеРегл,
	|		
	|		// Переменные постательные
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПеременныеСНДСОборот
	|		КОНЕЦ КАК ПостатейныеПеременныеСНДС,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПеременныеБезНДСОборот
	|		КОНЕЦ КАК ПостатейныеПеременныеБезНДС,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПеременныеУпрОборот
	|		КОНЕЦ КАК ПостатейныеПеременныеУпр,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ Продажи.ПостатейныеПеременныеРеглОборот
	|		КОНЕЦ КАК ПостатейныеПеременныеРегл,
	|		
	|		Продажи.СуммаРучнойСкидкиОборот КАК СуммаРучнойСкидкиОборот,
	|		Продажи.СуммаАвтоматическойСкидкиОборот КАК СуммаАвтоматическойСкидкиОборот,
	|		Продажи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	
	|		Продажи.смартДатаЗакрытияЗаказа КАК ДатаЗакрытияЗаказа,
	|		Продажи.смартСтатусЗаказаКлиента КАК СтатусЗаказаКлиента,
	|		Продажи.смартБизнесРегионКлиента КАК БизнесРегионКлиента
	|
	|	{ВЫБРАТЬ
	|		ЗаказКлиента.*,
	|		Сделка.*,
	|		МенеджерСделки,
	|		Подразделение.*,
	|		Номенклатура.*,
	|		Характеристика.*,
	|		Склад.*,
	|		Организация.*,
	|		Продавец.*,
	|		Партнер.*,
	|		Контрагент.*,
	|		Покупатель.*,
	|		Поставщик.*,
	|		Менеджер.*,
	|		ВидЗапасов.*,
	|		ГруппаФинансовогоУчета.*,
	|		Регистратор,
	|		ПериодСекунда,
	|		ПериодДень,
	|		ПериодНеделя,
	|		ПериодДекада,
	|		ПериодМесяц,
	|		ПериодКвартал,
	|		ПериодПолугодие,
	|		ПериодГод,
	|		ВидСделки,
	|		ХозяйственнаяОперация.*}
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			{(&НачалоПериода)}, {(&ОкончаниеПериода)},
	|			 Авто,
	|			  {	
	|				(АналитикаУчетаПоПартнерам.Организация).* КАК Организация,
	|				(АналитикаУчетаПоПартнерам.Партнер).* КАК Партнер,
	|				(ЕСТЬNULL(ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка))).* КАК Сделка,
	|			 	(ЕСТЬNULL(ЗаказКлиента.Сделка.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))).* КАК МенеджерСделки, 
	|				(ВЫБОР
	|				    КОГДА Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|				        ТОГДА ЕСТЬNULL(ЗаказКлиента.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|				    ИНАЧЕ Менеджер
	|				КОНЕЦ).* КАК Менеджер,
	|				(ВЫБОР
	|					КОГДА ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ВидЗапасов.ВладелецТовара
	|					ИНАЧЕ
	|						АналитикаУчетаПартий.Поставщик
	|				КОНЕЦ).* КАК Поставщик,
	|				(ВидЗапасов.ГруппаФинансовогоУчета).* КАК ГруппаФинансовогоУчета,
	|				(ВЫБОР
	|				    КОГДА НЕ ЗаказКлиента.Сделка.ВидСделки ЕСТЬ NULL 
	|				        ТОГДА ЗаказКлиента.Сделка.ВидСделки.Наименование
	|				    КОГДА ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				            ИЛИ ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
	|				        ТОГДА &СтрокаПродажиПоЗаказам
	|				    ИНАЧЕ &СтрокаПродажиБезЗаказов
	|				КОНЕЦ) КАК ВидСделки,
	|
	|				(Подразделение).* КАК Подразделение
	|			 }  
	|				
	|			 ВЫБОР 
	|			 	КОГДА &ПоДатеЗакрытияЗаказов
	|			 	ТОГДА смартДатаЗакрытияЗаказа МЕЖДУ &НачалоПериодаДатаЗакрытияЗаказов И &ОкончаниеПериодаДатаЗакрытияЗаказов
	|			 	ИНАЧЕ ИСТИНА
	|			 КОНЕЦ
	//++ #Б-6344 смарт: Фролов 06.04.2026 //Добавление в отчет по валовой прибыли возможности учета продаж с ДИЦ.
	|			 и ВЫБОР
	|			 	КОГДА &ОтобратьПоСериям
	|			 	ТОГДА АналитикаУчетаНоменклатуры.Серия В (&СписокСерий)
	|			 	ИНАЧЕ ИСТИНА
	|			 КОНЕЦ
	//-- #Б-6344 смарт: Фролов 06.04.2026
	//++ #4454 смарт: Тимофеева 25.09.2025 / Отчет Валовая прибыль предприятия. Исключить из оборотов ВГО (опционально)
	|			 И	(НЕ &ИсключитьИзОборотовВГО ИЛИ НЕ АналитикаУчетаПоПартнерам.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ.Контрагент КАК Контрагент
	|				ИЗ
	|				КонтрагентыВГО КАК ВТ)) 
	//-- #4454 смарт: Тимофеева 25.09.2025

	|				
	|		) КАК Продажи
	|			{ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимости
	|			ПО (НАЧАЛОПЕРИОДА(Продажи.ПериодМесяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетСебестоимости.Ссылка.Дата, МЕСЯЦ))
	|				И (Продажи.АналитикаУчетаПоПартнерам.Организация = РасчетСебестоимости.Организация)
	|				И (РасчетСебестоимости.Ссылка.Проведен)}
	|			{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьНоменклатуры
	|			ПО Продажи.АналитикаУчетаНоменклатуры = СтоимостьНоменклатуры.АналитикаУчетаНоменклатуры
	|				И (Продажи.АналитикаУчетаПоПартнерам.Организация = СтоимостьНоменклатуры.Организация)
	|				И Продажи.ВидЗапасов = СтоимостьНоменклатуры.ВидЗапасов
	|				И (СтоимостьНоменклатуры.Период = НАЧАЛОПЕРИОДА(Продажи.ПериодМесяц, МЕСЯЦ))
	|				И Продажи.РазделУчета = СтоимостьНоменклатуры.РазделУчета
	|				И ЕСТЬNULL(РасчетСебестоимости.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
	|			}
	|			//++#1829 смарт: Лопато 14.06.2024 //Доработать отчет Валовая прибыль (прод. 1544)
	|			{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|			//ПО Продажи.ЗаказКлиента = НДССостояниеРеализации0.ДокументРеализации.ЗаказКлиента}
	|			ПО ВЫБОР
	|				КОГДА Продажи.Регистратор = НЕОПРЕДЕЛЕНО
	|				ТОГДА ЛОЖЬ
	|				ИНАЧЕ Продажи.Регистратор = НДССостояниеРеализации0.Регистратор
	|			КОНЕЦ}
	|			{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних({(&ОкончаниеПериода)}, ) КАК УчетнаяПолитикаОрганизаций
	|			ПО Продажи.АналитикаУчетаПоПартнерам.Организация = УчетнаяПолитикаОрганизаций.Организация}
	|			//--#1829 смарт: Лопато 14.06.2024 //Доработать отчет Валовая прибыль (прод. 1544)
		
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО
	|	        {ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыВГО КАК ВТ_ДокументыВГО
	|				ПО (НАЧАЛОПЕРИОДА(Продажи.Партия.ДатаВходящегоДокумента, ДЕНЬ) = ВТ_ДокументыВГО.ДатаСФ)
	|				И (СОКРЛП(Продажи.Партия.НомерВходящегоДокумента) = ВТ_ДокументыВГО.НомерСФ)
	|				И (Продажи.Партия.Контрагент.ИНН = ВТ_ДокументыВГО.ИННОрганизации)} 
	|	        {ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродажиВГО КАК ВТ_ПродажиВГО
	|				ПО ВТ_ДокументыВГО.ДокументРеализацииВГО = ВТ_ПродажиВГО.ДокументРеализацииВГО
	|					И Продажи.АналитикаУчетаНоменклатуры.Номенклатура = ВТ_ПродажиВГО.Номенклатура
	|					И Продажи.АналитикаУчетаНоменклатуры.Характеристика = ВТ_ПродажиВГО.Характеристика}
	|	
	//-- #4508 смарт: Тимофеева 03.10.2025
	
	|	ГДЕ
	|		(&ПоказыватьПродажи = 1
	|					И Продажи.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				ИЛИ &ПоказыватьПродажи = 2
	|					И Продажи.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				ИЛИ &ПоказыватьПродажи = 0)
	|	{ГДЕ
	|		Продажи.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|		Продажи.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|		Продажи.АналитикаУчетаНоменклатуры.МестоХранения.* КАК Склад,
	|		((Продажи.АналитикаУчетаНоменклатуры.Номенклатура, Продажи.АналитикаУчетаНоменклатуры.Характеристика) В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуНоменклатуры.Номенклатура,
	|					ОтборПоСегментуНоменклатуры.Характеристика
	|				ИЗ
	|					ОтборПоСегментуНоменклатуры
	|				ГДЕ
	|					ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|		(Продажи.АналитикаУчетаПоПартнерам.Партнер В
	|				(ВЫБРАТЬ
	|					ОтборПоСегментуПартнеров.Партнер
	|				ИЗ
	|					ОтборПоСегментуПартнеров
	|				ГДЕ
	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)),
	|		(ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка))).* КАК Сделка,
	|		Продажи.Договор.* КАК Договор,
	|		(ВЫБОР
	|				КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Контрагенты
	|					ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
	|				ИНАЧЕ NULL
	|			КОНЕЦ).* КАК Контрагент,
	|		(ВЫБОР
	|				КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|					ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
	|				ИНАЧЕ NULL
	|			КОНЕЦ).* КАК Покупатель,
	|		Продажи.ХозяйственнаяОперация.*}) КАК Таблица

	|СГРУППИРОВАТЬ ПО
	|	Таблица.Сделка,
	|	Таблица.МенеджерСделки,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.Серия,
	|	Таблица.Организация,
	|	Таблица.Продавец,
	|	Таблица.Партнер,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Регистратор,
	|	Таблица.ПериодСекунда,
	|	Таблица.ПериодДень,
	|	Таблица.ПериодНеделя,
	|	Таблица.ПериодДекада,
	|	Таблица.ПериодМесяц,
	|	Таблица.ПериодКвартал,
	|	Таблица.ПериодПолугодие,
	|	Таблица.ПериодГод,
	|	Таблица.ЗаказКлиента,
	|	Таблица.Подразделение,
	|	Таблица.Склад,
	|	Таблица.Контрагент,
	|	Таблица.Покупатель,
	|	Таблица.Поставщик,
	|	Таблица.Менеджер,
	|	Таблица.ВидЗапасов,
	|	Таблица.ГруппаФинансовогоУчета,
	|	Таблица.ВидСделки,
	|	Таблица.Номенклатура.ЕдиницаИзмерения,
	|	Таблица.Номенклатура.ЕдиницаДляОтчетов,
	|	Таблица.Номенклатура.КоэффициентЕдиницыДляОтчетов,
	|	&ТекстЗапросаВесНоменклатуры1,
	|	&ТекстЗапросаОбъемНоменклатуры1,
	|	Таблица.СуммаРучнойСкидкиОборот,
	|	Таблица.СуммаАвтоматическойСкидкиОборот,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.ДатаЗакрытияЗаказа,
	|	Таблица.СтатусЗаказаКлиента,
	|	Таблица.БизнесРегионКлиента	

	|ИМЕЮЩИЕ
	|	(СУММА(Таблица.Количество) <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА &ДанныеОтчета = 1
	|				ТОГДА СУММА(Таблица.Выручка)
	|			КОГДА &ДанныеОтчета = 3
	|				ТОГДА СУММА(Таблица.ВыручкаРегл)
	|			ИНАЧЕ СУММА(Таблица.ВыручкаБезНДС)
	|		КОНЕЦ <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА &ДанныеОтчета = 1
	|				ТОГДА СУММА(Таблица.Себестоимость)
	|			КОГДА &ДанныеОтчета = 3
	|				ТОГДА СУММА(Таблица.СебестоимостьРегл)
	|			ИНАЧЕ СУММА(Таблица.СебестоимостьБезНДС)
	|		КОНЕЦ <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА &ДанныеОтчета = 1
	|				ТОГДА СУММА(Таблица.ДопРасходы)
	|			КОГДА &ДанныеОтчета = 3
	|				ТОГДА 0
	|			ИНАЧЕ СУММА(Таблица.ДопРасходыБезНДС)
	|		КОНЕЦ <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА &ДанныеОтчета = 1
	|				ТОГДА СУММА(Таблица.Выручка) - СУММА(Таблица.Себестоимость) - СУММА(Таблица.ДопРасходы)
	|			КОГДА &ДанныеОтчета = 3
	|				ТОГДА СУММА(Таблица.ВыручкаРегл) - СУММА(Таблица.СебестоимостьРегл)
	|			ИНАЧЕ СУММА(Таблица.ВыручкаБезНДС) - СУММА(Таблица.СебестоимостьБезНДС) - СУММА(Таблица.ДопРасходыБезНДС)
	|		КОНЕЦ <> 0)";	
	
КонецФункции //-- #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов

//++ #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов
Процедура смартПрименитьПараметры()
	
	СхемаКомпоновкиДанных.НаборыДанных.ВыручкаИСебестоимостьПродаж.Запрос = смартПолучитьТекстЗапроса();
	
	//++ #Б3890 смарт: Шляпников 12.08.2025 / Доработать отчет Динамика продаж
	Набор = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.Имя = "СегментыПартнеров";
	Набор.ИсточникДанных = "ИсточникДанных1";
	Набор.Запрос =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Партнер КАК Партнер,
	|	Сегменты.Сегмент КАК смартСегментПартнеров,
	|	Сегменты.Сегмент КАК смартСегментПартнеровРесурс
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК Сегменты";
	
	Поле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Партнер";
	Поле.ПутьКДанным = "Партнер";
	Поле.Заголовок = "Партнер";
	
	Поле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "смартСегментПартнеров";
	Поле.ПутьКДанным = "смартСегментПартнеров";
	Поле.Заголовок = "Сегмент партнеров";
	
	Поле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "смартСегментПартнеровРесурс";
	Поле.ПутьКДанным = "смартСегментПартнеровРесурс";
	Поле.Заголовок = "Сегмент партнеров(ресурс)";
	
	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.НаборДанныхИсточник = "ВыручкаИСебестоимостьПродаж";
	Связь.НаборДанныхПриемник = "СегментыПартнеров";
	Связь.ВыражениеИсточник = "Партнер";
	Связь.ВыражениеПриемник = "Партнер";
	
	Итог = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Итог.Выражение = "Массив(смартСегментПартнеровРесурс)";
	Итог.ПутьКДанным = "смартСегментПартнеровРесурс";
	Итог.Группировки.Добавить("Партнер");
	//-- #Б3890 смарт: Шляпников 12.08.2025
	
	ПараметрПериод = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	ПараметрПериод.Имя = "ПоДатеЗакрытияЗаказов";
	ПараметрПериод.Заголовок = "По дате закрытия заказов";
	ПараметрПериод.ТипЗначения = Новый ОписаниеТипов("Булево");
	ПараметрПериод.ОграничениеИспользования = Ложь;
	ПараметрПериод.Значение = Ложь;
	ПараметрПериод.Использование =ИспользованиеПараметраКомпоновкиданных.Всегда;
	ПараметрПериод.ВключатьВДоступныеПоля = Истина;

	ПараметрПериод = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	ПараметрПериод.Имя = "НачалоПериодаДатаЗакрытияЗаказов";
	ПараметрПериод.Заголовок = "НачалоПериодаДатаЗакрытияЗаказов";
	ПараметрПериод.ТипЗначения = Новый ОписаниеТипов("Дата");
	ПараметрПериод.ОграничениеИспользования = Истина;
	ПараметрПериод.Значение = Дата(1, 1, 1);
	ПараметрПериод.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
	ПараметрПериод.ВключатьВДоступныеПоля = Ложь;

	ПараметрПериод = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	ПараметрПериод.Имя = "ОкончаниеПериодаДатаЗакрытияЗаказов";
	ПараметрПериод.Заголовок = "ОкончаниеПериодаДатаЗакрытияЗаказов";
	ПараметрПериод.ТипЗначения = Новый ОписаниеТипов("Дата");
	ПараметрПериод.ОграничениеИспользования = Истина;
	ПараметрПериод.Значение = Дата(1, 1, 1);
	ПараметрПериод.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
	ПараметрПериод.ВключатьВДоступныеПоля = Ложь;

	Параметр = "ПоДатеЗакрытияЗаказов";
	Для Каждого Вариант ИЗ СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		ПараметрПериод = Вариант.Настройки.ПараметрыДанных.Элементы.Добавить();
		ПараметрПериод.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		ПараметрПериод.Значение = Ложь;
		ПараметрПериод.Параметр = Новый ПараметрКомпоновкиДанных(Параметр);
		ПараметрПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ПараметрПериод.Использование = Истина;
		
	КонецЦикла;
	
	Параметр = "НачалоПериодаДатаЗакрытияЗаказов";
	Для Каждого Вариант ИЗ СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		ПараметрПериод = Вариант.Настройки.ПараметрыДанных.Элементы.Добавить();
		ПараметрПериод.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		ПараметрПериод.Значение = Дата(1, 1, 1);
		ПараметрПериод.Параметр = Новый ПараметрКомпоновкиДанных(Параметр);
		ПараметрПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ПараметрПериод.Использование = Истина;

	КонецЦикла;
	
	Параметр = "ОкончаниеПериодаДатаЗакрытияЗаказов";
	Для Каждого Вариант ИЗ СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		ПараметрПериод = Вариант.Настройки.ПараметрыДанных.Элементы.Добавить();
		ПараметрПериод.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		ПараметрПериод.Значение = Дата(1, 1, 1);
		ПараметрПериод.Параметр = Новый ПараметрКомпоновкиДанных(Параметр);
		ПараметрПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ПараметрПериод.Использование = Истина;

	КонецЦикла; 

	//++ #4454 смарт: Тимофеева 25.09.2025 / Отчет Валовая прибыль предприятия. Исключить из оборотов ВГО (опционально)
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	НовыйПараметр.Имя = "ИсключитьИзОборотовВГО";
	НовыйПараметр.Заголовок = "Исключить из оборотов ВГО";
	НовыйПараметр.ТипЗначения = Новый ОписаниеТипов("Булево");
	НовыйПараметр.ОграничениеИспользования = Ложь;
	НовыйПараметр.Значение = Ложь;
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
	НовыйПараметр.ВключатьВДоступныеПоля = Истина; 
	
	Для Каждого Вариант ИЗ СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		НовыйПараметр = Вариант.Настройки.ПараметрыДанных.Элементы.Добавить();
		НовыйПараметр.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		НовыйПараметр.Значение = Ложь;
		НовыйПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ИсключитьИзОборотовВГО");
		НовыйПараметр.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйПараметр.Использование = Истина;
		
	КонецЦикла;
	//-- #4454 смарт: Тимофеева 25.09.2025
	
	//++ #Б-6344 смарт: Фролов 06.04.2026 //Добавление в отчет по валовой прибыли возможности учета продаж с ДИЦ.
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	НовыйПараметр.Имя = "ОтобратьПоСериям";
	НовыйПараметр.Заголовок = "Отобрать по сериям";
	НовыйПараметр.ТипЗначения = Новый ОписаниеТипов("Булево");
	НовыйПараметр.ОграничениеИспользования = Ложь;
	НовыйПараметр.Значение = Ложь;
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
	НовыйПараметр.ВключатьВДоступныеПоля = Истина; 
	
	Для Каждого Вариант ИЗ СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		НовыйПараметр = Вариант.Настройки.ПараметрыДанных.Элементы.Добавить();
		НовыйПараметр.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		НовыйПараметр.Значение = Ложь;
		НовыйПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ОтобратьПоСериям");
		НовыйПараметр.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйПараметр.Использование = Истина;
		
	КонецЦикла;
	
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	НовыйПараметр.Имя = "СписокСерий";
	НовыйПараметр.Заголовок = "Список серий";
	НовыйПараметр.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры");
	НовыйПараметр.ДоступенСписокЗначений = Истина;
	НовыйПараметр.ОграничениеИспользования = Истина;
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
	НовыйПараметр.ВключатьВДоступныеПоля = Истина; 
	//-- #Б-6344 смарт: Фролов 06.04.2026
	
	//++ #4508 смарт: Тимофеева 03.10.2025 / Отчет Валовая прибыль. Подбор себестоимости по ВГО 
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить(); 
	НовыйПараметр.Имя = "КорректироватьСебестоимостьПриВГО";
	НовыйПараметр.Заголовок = "Корректировать себестоимость при ВГО";
	НовыйПараметр.ТипЗначения = Новый ОписаниеТипов("Булево");
	НовыйПараметр.ОграничениеИспользования = Ложь;
	НовыйПараметр.Значение = Истина;
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиданных.Всегда;
	НовыйПараметр.ВключатьВДоступныеПоля = Истина; 
	
	Для Каждого Вариант ИЗ СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		НовыйПараметр = Вариант.Настройки.ПараметрыДанных.Элементы.Добавить();
		НовыйПараметр.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		НовыйПараметр.Значение = Истина;
		НовыйПараметр.Параметр = Новый ПараметрКомпоновкиДанных("КорректироватьСебестоимостьПриВГО");
		НовыйПараметр.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйПараметр.Использование = Истина;
		
	КонецЦикла;
	//-- #4508 смарт: Тимофеева 03.10.2025
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиданных(СхемаКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);

КонецПроцедуры //-- #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов

//++ #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов
смартПрименитьПараметры(); 
//-- #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов
#КонецОбласти    

#КонецЕсли