
&ИзменениеИКонтроль("СформироватьТекстТемыИСодержанияОповещения")
Функция смарт_СформироватьТекстТемыИСодержанияОповещения(ПараметрыОповещения) Экспорт
	
	ТекстТемы		= "";
	ТекстСодержания	= "";
	
	// Оповещение участников события о новом/измененном событии.
	Если ПараметрыОповещения.ВидОповещения = "ОповещениеУчастниковСобытия" Тогда
		
		ТемаТекстСодержания = СформироватьТекстОповещенияПоСобытию(ПараметрыОповещения);
		
		ТекстТемы		= ТемаТекстСодержания.Тема;
		ТекстСодержания	= ТемаТекстСодержания.Содержание;
		
	ИначеЕсли ПараметрыОповещения.ВидОповещения = "ПоступлениеОплаты" Тогда
		
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			ТекстТемы				= НСтр("ru='Поступила оплата от клиента'");
			
			ПредставлениеПартнера	= СокрЛП(?(ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Партнер.НаименованиеПолное),ПараметрыОповещения.Предмет.Партнер.НаименованиеПолное,ПараметрыОповещения.Предмет.Партнер.Наименование));
			ПредставлениеСчета		= НСтр("ru=' по документу Счет №'") + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ=dd.MM.yyyy");
			ПредставлениеСуммы		= НСтр("ru=' по документу Счет №';en=' by document Invoice №'") + Формат(ПараметрыОповещения.СуммаОплаты,"ЧЦ=15; ЧДЦ=2") + " " + ПараметрыОповещения.Предмет.Валюта;
			
			ТекстСодержания			= НСтр("ru='Поступила оплата от клиента '") + ПредставлениеПартнера + ПредставлениеСуммы + ПредставлениеСчета;
		Иначе
			ТекстТемы				= НСтр("ru='Поступила оплата от клиента'");
			
			ПредставлениеПартнера	= СокрЛП(?(ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Партнер.НаименованиеПолное),ПараметрыОповещения.Предмет.Партнер.НаименованиеПолное,ПараметрыОповещения.Предмет.Партнер.Наименование));
			ПредставлениеСчета		= НСтр("ru=' по документу Счет №'") + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ=dd.MM.yyyy");
			ПредставлениеСуммы		= НСтр("ru=' по документу Счет №';en=' by document Invoice №'") + Формат(ПараметрыОповещения.СуммаОплаты,"ЧЦ=15; ЧДЦ=2") + " " + ПараметрыОповещения.Предмет.Валюта;
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет.Партнер);
			ПартнерНавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеПартнера);
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			СчетНавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСчета);
				
			ТекстСодержания = "
			|<p>" + НСтр("ru='Поступила оплата от клиента '") + "%1 "+ ПредставлениеСуммы +"%2</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтрЗаменить(ТекстСодержания, "%1", ПартнерНавигационнаяСсылкаСтрокой);
			ТекстСодержания = СтрЗаменить(ТекстСодержания, "%2", СчетНавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
		
	// ИначеЕсли ПараметрыОповещения.ВидОповещения = "ПринятаЗадачаИсполнителя" ИЛИ ПараметрыОповещения.ВидОповещения =
	// "ВыполненаЗадачаИсполнителя" Тогда
	//	
	//	Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
	//		ТекстСодержания = ПараметрыОповещения.ТекстОповещения;
	//	Иначе
	//		Если НЕ ПараметрыОповещения.ТемаОповещения = "" Тогда
	//			ТекстТемы	= ПараметрыОповещения.ТемаОповещения;
	//		Иначе
	//			Если ПараметрыОповещения.ВидОповещения = "ПринятаЗадачаИсполнителя" Тогда
	//				ТекстТемы	= НСтр("ru='Принята к исполнению задача""'") + Лев(СокрЛП(ПараметрыОповещения.Предмет.Наименование),50);
	//			Иначе
	//				ТекстТемы	= НСтр("ru='Выполнена задача""'") + Лев(СокрЛП(ПараметрыОповещения.Предмет.Наименование),50);
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		ТекстСодержания = ПараметрыОповещения.ТекстОповещения;
	//	КонецЕсли;
		
	// 1. Запланированные события
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ЗапланированныеСобытия Тогда
		
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				
				Если ПараметрыОповещения.Предмет.CRM_Личная Тогда
					ТекстСодержания = НСтр("ru='Напоминание: Срок окончания задачи ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) + """ " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
				Иначе
					ТекстСодержания = НСтр("ru='Напоминание: Запланирована задача ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) + НСтр("ru='"" начало в'") + " " + Формат(ПараметрыОповещения.Предмет.ДатаНачала,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
				
				ТекстСодержания = НСтр("ru='Напоминание: Запланировано Взаимодействие ""'") + Строка(ПараметрыОповещения.Предмет.Тема) + НСтр("ru='"" начало в'") + " " + Формат(ПараметрыОповещения.Предмет.ПлановаяДата,"ДФ='дд.ММ.гг ЧЧ:мм'");
				
			КонецЕсли;
			
		Иначе
			
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				
				ТекстТемы = НСтр("ru='Напоминание: Запланирована задача ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) + НСтр("ru='"" начало в'") + " " + Формат(ПараметрыОповещения.Предмет.ДатаНачала,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
				
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					Строка(ПараметрыОповещения.Предмет.Наименование));
					
				ТекстСодержания = "
				|<p>" + НСтр("ru='Напоминание: Запланирована задача'") + "</p>
				|<p>%1" + НСтр("ru='"" начало в '") + Формат(ПараметрыОповещения.Предмет.ДатаНачала,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'")) + "</p>";
				
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
				
				ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
				ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			КонецЕсли;
			
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
				
				ТекстТемы = НСтр("ru='Напоминание: Запланировано Взаимодействие ""'") + СокрЛП(Строка(ПараметрыОповещения.Предмет.Тема)) + """";
				
				#Удаление
				ПредставлениеСобытия = Строка(ПараметрыОповещения.Предмет.Содержание) + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.ПлановаяДата,"ДФ='дд.ММ.гг ЧЧ:мм'");
				#КонецУдаления
				#Вставка
				//++ #1407 смарт: Фролов 22.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
				//ПредставлениеСобытия = Строка(ПараметрыОповещения.Предмет.Содержание) + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.ПлановаяДата,"ДФ='дд.ММ.гг ЧЧ:мм'");
				ПредставлениеСобытия = Строка(ПараметрыОповещения.Предмет.ВидВзаимодействия.Наименование);
				//-- #1407 смарт: Фролов 22.09.2023
				#КонецВставки
				
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					ПредставлениеСобытия);
					
				ИнформацияОтветственного = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъектаДляОповещений(ПараметрыОповещения.Предмет.Ответственный
																											,Новый Структура("Телефон, Почта",
																											Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя,
																											Справочники.ВидыКонтактнойИнформации.EmailПользователя));
				ТекстСодержания = "
				|<p>" + НСтр("ru='Напоминание: Запланировано событие'") + "</p>
				#Удаление
				|<p>%1</p>";
				#КонецУдаления
				#Вставка
				//++ #1407 смарт: Фролов 21.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
				|<p>%1 ("+НавигационнаяСсылка+")</p>";
				
				Если ТипЗнч(ПараметрыОповещения.Предмет.ДокументОснование)=Тип("ДокументСсылка.CRM_Интерес") ТОгда
					ПредставлениеИнтереса=Символы.ПС+"По интересу № "+ПараметрыОповещения.Предмет.ДокументОснование.Номер+" от "+ПараметрыОповещения.Предмет.ДокументОснование.Дата+"";
					НавигационнаяСсылкаИнтерес = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет.ДокументОснование);
					НавигационнаяСсылкаИнтересСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"<a href=%1>%2</a>",
						КодироватьСтроку(НавигационнаяСсылкаИнтерес, СпособКодированияСтроки.URLВКодировкеURL),
						ПредставлениеИнтереса);
				КонецЕсли;
				
				ТекстСодержания = ТекстСодержания + "
				|<p>%2 ("+НавигационнаяСсылкаИнтерес+")</p>";
				//-- #1407 смарт: Фролов 21.09.2023	
				#КонецВставки
				
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Партнер) Тогда
				ТекстСодержания = ТекстСодержания + "
				|<p>" + НСтр("ru='Клиент: '") + СокрЛП(Строка(ПараметрыОповещения.Предмет.Партнер)) + "</p>";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.КонтактноеЛицо) Тогда
				ТекстСодержания = ТекстСодержания + "
				|<p>" + НСтр("ru='Контактное лицо: '") + СокрЛП(Строка(ПараметрыОповещения.Предмет.КонтактноеЛицо)) + "</p>";
				КонецЕсли;
				
				#Вставка
				//++ #1407 смарт: Фролов 21.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.КонтактноеЛицо) ТОгда
					ЭлектроннаяПочтаКЛ=CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(ПараметрыОповещения.Предмет.КонтактноеЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Если ЭлектроннаяПочтаКЛ.Количество()>0 Тогда
						ПредставлениеЭлектроннаяПочтаКЛ=ЭлектроннаяПочтаКЛ[0].Представление;
					Иначе	
						ПредставлениеЭлектроннаяПочтаКЛ="не указана";
					КонецЕсли;	
					ТелкфонКЛ=CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(ПараметрыОповещения.Предмет.КонтактноеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон);
					Если ТелкфонКЛ.Количество()>0 Тогда
						ПредставлениеТелкфонКЛ=ТелкфонКЛ[0].Представление;
					Иначе	
						ПредставлениеТелкфонКЛ="не указан";
					КонецЕсли;
					ТекстСодержания = ТекстСодержания + "
					|<p style='margin-left: 20pt'>E-mail: " + СокрЛП(ПредставлениеЭлектроннаяПочтаКЛ) + "</p>";
					ТекстСодержания = ТекстСодержания + "
					|<p style='margin-left: 20pt'>Телефон: " + СокрЛП(ПредставлениеТелкфонКЛ) + "</p>";
				КонецЕсли;	
				//-- #1407 смарт: Фролов 21.09.2023
				#КонецВставки
				ТекстСодержания = ТекстСодержания + "
				|<p>" + НСтр("ru='Когда: '") + Формат(ПараметрыОповещения.Предмет.ПлановаяДата,"ДФ='дд ММММ'") + НСтр("ru=' с '") +
											  Формат(ПараметрыОповещения.Предмет.ПлановаяДата,"ДФ='ЧЧ-мм'") + НСтр("ru=' до '") + 
											  Формат(ПараметрыОповещения.Предмет.ПлановаяДатаЗавершение,"ДФ='ЧЧ-мм'") + 
											  ?(НачалоДня(ПараметрыОповещения.Предмет.Дата)=НачалоДня(ПараметрыОповещения.Предмет.ПлановаяДатаЗавершение),""," " + Формат(ПараметрыОповещения.Предмет.ПлановаяДатаЗавершение,"ДФ='дд ММММ'; ДЛФ=DD")) + "</p>";
				
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Содержание) Тогда
				МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыОповещения.Предмет.Содержание,Символы.ПС);
				
				ПерваяСтрока = Истина;
				Для Каждого СтрокаИзМассива Из МассивСтрок Цикл
				Если ПерваяСтрока Тогда
				ТекстСодержания = ТекстСодержания + "
				|<p>" + НСтр("ru='Описание: '") + СтрокаИзМассива + "</p>";
				ПерваяСтрока = Ложь;
				Иначе
				ТекстСодержания = ТекстСодержания + "
				|<p style='margin-left: 80pt'>" + СтрокаИзМассива + "</p>";
				КонецЕсли;
				КонецЦикла;
				
				Иначе
				ТекстСодержания = ТекстСодержания + "
				|<p>" + НСтр("ru='Описание: '") + НСтр("ru='не указано'") + "</p>";
				КонецЕсли;
				
				ТекстСодержания = ТекстСодержания + "
				|<p>" + НСтр("ru='Ответственный: '") + ПараметрыОповещения.Предмет.Ответственный + "</p>";
				
				Если ЗначениеЗаполнено(ИнформацияОтветственного.Почта) Тогда
				ТекстСодержания = ТекстСодержания + "
				|<p style='margin-left: 20pt'>E-mail: " + СокрЛП(ИнформацияОтветственного.Почта) + "</p>";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИнформацияОтветственного.Телефон) Тогда
				ТекстСодержания = ТекстСодержания + "
				|<p style='margin-left: 20pt'>Телефон: " + СокрЛП(ИнформацияОтветственного.Телефон) + "</p>";
				КонецЕсли;
				
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
				
				#Вставка
				//++ #1407 смарт: Фролов 21.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
				ТекстСодержания = СтрЗаменить(ТекстСодержания, "%2", НавигационнаяСсылкаИнтересСтрокой); 
				ТекстСодержания = ТекстСодержания + "<p> <br / </p>"+"<p> <br / </p>"+"<p> <br / </p>"+"
				|<p style='font-size: 8pt'> Вы получили это письмо, так как установили напоминание во взаимодействии с клиентом.
				|Письмо отправлено автоматически из базы 1С Коммерческая СМАРТ-Т и не требует ответа.
				|Если у вас есть вопросы по действующей рассылке, пожалуйста обратитесь в поддержку 1С: help1c@smart-t.ru; +7(495)663-91-11 (доб. 222) </p>";
				//-- #1407 смарт: Фролов 21.09.2023
				#КонецВставки
				ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
				ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
				
			КонецЕсли;
			
		КонецЕсли;
	// 2. Переадресация ответственного.
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОПереадресованныхДокументахЗадачах Тогда
		
		ТипОбъекта = ПараметрыОповещения.Предмет.Метаданные().Синоним;
		
		Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
			ТемаНаименование = ПараметрыОповещения.Предмет.Тема;
		ИначеЕсли ТипЗнч(ПараметрыОповещения.Предмет) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
			ТемаНаименование = ПараметрыОповещения.Предмет.Наименование;
		ИначеЕсли ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			ТемаНаименование = ПараметрыОповещения.Предмет.Наименование;
		Иначе
			ТемаНаименование = "";
		КонецЕсли;
		
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			ТекстСодержания = ТекстСодержания + НСтр("ru='Переадресован'") + " " + ТипОбъекта + ?(ТемаНаименование="",""," """+ТемаНаименование+"""") + НСтр("ru=' от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
		Иначе
			Если ТемаНаименование = "" Тогда
				ТемаНаименование = ТипОбъекта;
			КонецЕсли;
			
			ПредставлениеСсылки = ТемаНаименование + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
			
			ТекстТемы = ТекстСодержания + НСтр("ru='Переадресован'") + " " + ТипОбъекта + ?(ТемаНаименование="",""," """+ТемаНаименование+"""") + НСтр("ru=' от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Переадресован '") + ТипОбъекта + "</p>
			|<p>%1</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
	// 3. Новые задачи
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОНовыхЗадачах Тогда
		
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.БизнесПроцесс)
				И ПараметрыОповещения.Предмет.БизнесПроцесс.КартаМаршрута = Справочники.CRM_КартыМаршрутов.Поручение Тогда
					ТекстСодержания = НСтр("ru='Новое поручение ""'");
				Иначе
					ТекстСодержания = НСтр("ru='Новая задача ""'");
				КонецЕсли;
				
				ТекстСодержания = ТекстСодержания + ПараметрыОповещения.Предмет.Наименование;
				ТекстСодержания = ТекстСодержания + НСтр("ru='"" срок:'") + " " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,"ДФ='дд.ММ.гг ЧЧ:мм'");
				ТекстСодержания = ТекстСодержания + НСтр("ru='"" срок:';en='"" term:'") + " " + ПараметрыОповещения.Предмет.Автор;
			ИначеЕсли ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда
				Если ПараметрыОповещения.Предмет.ТипЭтапа = Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка Тогда
					ТекстСодержания = НСтр("ru='Новая контрольная точка ""'");
				Иначе
					ТекстСодержания = НСтр("ru='Новая задача ""'");
				КонецЕсли;
				
				ТекстСодержания = ТекстСодержания + ПараметрыОповещения.Предмет.Тема + """" + Символы.ПС;
				ТекстСодержания = ТекстСодержания + НСтр("ru='дата начала:'") + " " + Формат(ПараметрыОповещения.Предмет.ПлановаяДатаНачала,"ДФ=дд.ММ.гггг")
					 + НСтр("ru=', дата окончания:'") + " " + Формат(ПараметрыОповещения.Предмет.ПлановаяДатаОкончания,"ДФ=дд.ММ.гггг") + Символы.ПС;
				ТекстСодержания = ТекстСодержания + НСтр("ru='проект:'") + " " + ПараметрыОповещения.Предмет.Проект + Символы.ПС;
				ТекстСодержания = ТекстСодержания + НСтр("ru='проект:';en='project:'") + " " + ПараметрыОповещения.Предмет.ОтветственныйИсполнитель;
			КонецЕсли;
			
		Иначе
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.БизнесПроцесс)
				И ПараметрыОповещения.Предмет.БизнесПроцесс.КартаМаршрута = Справочники.CRM_КартыМаршрутов.Поручение Тогда
					ТекстТемы	= НСтр("ru='Новое поручение ""'");
					Стр			= "<P>" + НСтр("ru='Новое поручение ""'");
				Иначе
					ТекстТемы	= НСтр("ru='Новая задача ""'");
					Стр			= "<P>" + НСтр("ru='Новая задача ""'");
				КонецЕсли;
				
				ТекстТемы		= ТекстТемы + ПараметрыОповещения.Предмет.Наименование + """";
				ПредставлениеСсылки =  ПараметрыОповещения.Предмет.Наименование;
				
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					ПредставлениеСсылки);
					
				Стр = Стр + НавигационнаяСсылкаСтрокой+ """</P></BR>";
				
				// Стр	= Стр + СокрЛП(ПараметрыОповещения.Предмет.Наименование) + """</P></BR>";
				Стр = Стр + "<P>" + НСтр("ru='"" срок:'") + " " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,"ДФ='дд.ММ.гг ЧЧ:мм'");
				Стр = Стр + НСтр("ru=' Автор:'") + " " + ПараметрыОповещения.Предмет.Автор;
				Стр = Стр + НСтр("ru=' Автор:';en=' Author:'") + " " + ПараметрыОповещения.Предмет.БизнесПроцесс.Ответственный + """</P></BR>";
				
				Стр_1 = "<P><span style='font-size: 10pt;'><span style='font-size: 10pt;'><EM><STRONG>" + НСтр("ru='Задача'")+"</STRONG></EM></span></P>";
				
				ТекстСодержания = "
				|<html>
				|<head>
				|<meta http-equiv=Content-Type content=" + """" + "text/html; charset=utf-8"">
				|<title></title>
				|</head>
				|<body>
				|" + Стр + "<P></BR>" + CRM_БизнесПроцессыПереопределяемый.СформироватьОписаниеБизнесПроцесса(ПараметрыОповещения.Предмет) + Стр_1 + CRM_БизнесПроцессыПереопределяемый.СформироватьИсториюБизнесПроцесса(ПараметрыОповещения.Предмет) + "
				|</body>
				|</html>";
				
			ИначеЕсли ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда
				
				Если ПараметрыОповещения.Предмет.ТипЭтапа = Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка Тогда
					ТекстТемы	= НСтр("ru='Новая контрольная точка ""'");
					Стр			= "<P>" + НСтр("ru='Новая контрольная точка ""'");
				Иначе
					ТекстТемы	= НСтр("ru='Новая задача ""'");
					Стр			= "<P>" + НСтр("ru='Новая задача ""'");
				КонецЕсли;
				
				ТекстТемы		= ТекстТемы + ПараметрыОповещения.Предмет.Тема + """";
				ПредставлениеСсылки =  ПараметрыОповещения.Предмет.Тема;
				
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					ПредставлениеСсылки);
					
				Стр = Стр + НавигационнаяСсылкаСтрокой+ """</P>";
				
				Стр = Стр + "<P>" + НСтр("ru='Дата начала:';en='Start Date:'") + " " + Формат(ПараметрыОповещения.Предмет.ПлановаяДатаНачала,"ДФ='дд.ММ.гггг'");
				Стр = Стр + "<P>" + НСтр("ru='Дата окончания:';en='End Date:'") + " " + Формат(ПараметрыОповещения.Предмет.ПлановаяДатаОкончания,"ДФ='дд.ММ.гггг'");
				Стр = Стр + "<P>" + НСтр("ru='Проект:';en='Project:'") + " " + ПараметрыОповещения.Предмет.Проект;
				
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Этап) Тогда
					Стр = Стр + "<P>" + НСтр("ru='Этап:'") + " " + ПараметрыОповещения.Предмет.Этап + "</P>";
				КонецЕсли;
				
				Стр = Стр + "<P>" + НСтр("ru='Ответственный:'") + " " + ПараметрыОповещения.Предмет.ОтветственныйИсполнитель;
				
				Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Описание) Тогда
					Стр = Стр + "<P>" + НСтр("ru='Описание:'") + "</P><P>" + СтрЗаменить(ПараметрыОповещения.Предмет.Описание, Символы.ПС, "</BR>") + "</P>";
				КонецЕсли;
				
				Стр_1 = "<P><span style='font-size: 10pt;'><span style='font-size: 10pt;'><EM><STRONG>" + НСтр("ru='Задача'")+"</STRONG></EM></span></P>";
				
				ТекстСодержания = "
				|<html>
				|<head>
				|<meta http-equiv=Content-Type content=" + """" + "text/html; charset=utf-8"">
				|<title></title>
				|</head>
				|<body>
				|" + Стр + "<P></BR>
				|</body>
				|</html>";
			КонецЕсли;
		КонецЕсли;
		
	// 4. Завершение бизнес-процесса.
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ЗавершениеБизнесПроцесса Тогда
		
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			ТекстСодержания = НСтр("ru='Завершен бизнес-процесс ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) +
			НСтр("ru='"" от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
		Иначе
			ПредставлениеСсылки = Строка(ПараметрыОповещения.Предмет.Наименование) + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
			
			ТекстТемы = НСтр("ru='Завершен бизнес-процесс ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) +
			НСтр("ru='"" от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Завершен бизнес-процесс '") + "</p>
			|<p>%1</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
	// 5. Просрочено событие/задача.
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ПросроченныеНеЗавершенныеСобытияЗадачи Тогда
	
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				ТекстСодержания = НСтр("ru='Истек срок выполнения задачи ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) + НСтр("ru='"" срок:'") + " " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
			КонецЕсли;
			
		Иначе
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				ТемаНаименование = ПараметрыОповещения.Предмет.Наименование;
			Иначе
				ТемаНаименование = "";
			КонецЕсли;
			
			ПредставлениеСсылки = ТемаНаименование + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
				
			Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				ТекстТемы = НСтр("ru='Истек срок выполнения задачи ""'") + ТемаНаименование + НСтр("ru='"" срок:'") + " " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
				
				ТекстСодержания = "
				|<p>" + НСтр("ru='Истек срок выполнения задачи '") + "</p>
				|<p>%1</p>
				|<p>" + НСтр("ru='Срок: '") + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'")) + "</p>";
			КонецЕсли;
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
		
	// 6. Дни рождения
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещенияОДняхРождения Тогда
		
		ДатаРожденияВТекущемГоду = ДобавитьМесяц(ПараметрыОповещения.Предмет.ДатаРождения,(Год(ТекущаяДатаСеанса()) - Год(ПараметрыОповещения.Предмет.ДатаРождения))*12);
		
		Если ДатаРожденияВТекущемГоду < ТекущаяДатаСеанса() Тогда
			ДатаРожденияВТекущемГоду = ДобавитьМесяц(ДатаРожденияВТекущемГоду,12);
		КонецЕсли;
		
		СтрокаДаты = Формат(ДатаРожденияВТекущемГоду,"ДЛФ=DD");
		УдаляемыеЗнаки = Прав(СтрокаДаты, 7);
		СтрокаДаты = СтрЗаменить(СтрокаДаты, УдаляемыеЗнаки, "");
		
		// Исполняется = Строка(Окр((ТекущаяДатаСеанса() - ПараметрыОповещения.Предмет.ДатаРождения)/(60*60*24*365)));
		
// ************************************************************************
		// ТемаНапоминания = НСтр("ru='Поздравить с днем рождения: '") + Строка(Выборка.Ссылка) + ?(Выборка.ВидСправочника =
		// "КЛ"," ("
		//	+ Строка(Выборка.Владелец) + ")","");
		//	
		//	
		// ОписаниеНапоминания = ?(Выборка.ВидСправочника = "КЛ", ?(НЕ ЗначениеЗаполнено(Выборка.РольКонтактногоЛица),
		// "","Роль: " + Выборка.РольКонтактногоЛица + Символы.ПС) + ?(НЕ ЗначениеЗаполнено(Выборка.Должность), "",
		// "Должность: "+ Выборка.Должность + Символы.ПС),"");
		//
		//
		//
		// ОписаниеНапоминания =ТемаНапоминания + Символы.ПС+ ОписаниеНапоминания + НСтр("ru='Дата рождения: '")
		//	+ Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy") +Символы.ПС + НСтр("ru='Исполняется лет: '") + Исполняется;
// ************************************************************************
		
		Если ТипЗнч(ПараметрыОповещения.Предмет) = Тип("СправочникСсылка.Партнеры") Тогда
			
			Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
				
				ТекстСодержания = СтрокаДаты + НСтр("ru='  у партнера:'") + " " + ПараметрыОповещения.Предмет.Наименование + НСтр("ru='  День Рождения.'");
				
			Иначе
				ТекстТемы = НСтр("ru='День рождения партнера'");
				
				ПредставлениеСсылки = ПараметрыОповещения.Предмет.Наименование;
				
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					ПредставлениеСсылки);
					
				ТекстСодержания = "
				|<p>" + НСтр("ru='День Рождения у партнера: '") + "</p>
				|<p>%1</p>";
					
				
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
				
				ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
				ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ПараметрыОповещения.Предмет) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			
			Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
				
				ТекстСодержания = СтрокаДаты + НСтр("ru='  у :'") + " " + ПараметрыОповещения.Предмет.Наименование + "(" + ПараметрыОповещения.Предмет.Владелец.Наименование + ")" +НСтр("ru='  День Рождения.'");
				
			Иначе
				ТекстТемы = НСтр("ru='День рождения контактного лица партнера'");
				ТекстСодержания = СтрокаДаты + НСтр("ru='  у :'") + " " + ПараметрыОповещения.Предмет.Наименование + "(" + ПараметрыОповещения.Предмет.Владелец.Наименование + ")" +НСтр("ru='  День Рождения.'");
			КонецЕсли;
			
		КонецЕсли;
	// 7. Просроченная контрольная точка.
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ПросроченныеКонтрольныеТочки Тогда
		
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			ТекстСодержания = НСтр("ru='Истек срок проведения контрольной точки ""'") + Строка(ПараметрыОповещения.Предмет.Тема) + НСтр("ru='"" дата начала:'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
		Иначе
			ПредставлениеСсылки = Строка(ПараметрыОповещения.Предмет.Тема) + НСтр("ru=' дата начала: '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
			
			ТекстТемы = НСтр("ru='Истек срок проведения контрольной точки ""'") + Строка(ПараметрыОповещения.Предмет.Тема) + НСтр("ru='"" дата начала:'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Истек срок проведения контрольной точки '") + "</p>
			|<p>%1</p>";
			
			УчастникиКТ = СформироватьСписокУчастниковКонтрольнойТочкиСтрокой(ПараметрыОповещения.Предмет);
			
			Если ЗначениеЗаполнено(ПараметрыОповещения.Предмет.Описание) Тогда
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыОповещения.Предмет.Описание,Символы.ПС);
			
			ПерваяСтрока = Истина;
			Для Каждого СтрокаИзМассива Из МассивСтрок Цикл
			Если ПерваяСтрока Тогда
			ТекстСодержания = ТекстСодержания + "
			|<p>" + НСтр("ru='Описание: '") + СтрокаИзМассива + "</p>";
			ПерваяСтрока = Ложь;
			Иначе
			ТекстСодержания = ТекстСодержания + "
			|<p style='margin-left: 80pt'>" + СтрокаИзМассива + "</p>";
			КонецЕсли;
			КонецЦикла;
			Иначе
			ТекстСодержания = ТекстСодержания + "
			|<p>" + НСтр("ru='Описание: '") + НСтр("ru='не указано'") + "</p>";
			КонецЕсли;
			
			ТекстСодержания = ТекстСодержания + "
			|<p>" + НСтр("ru='Когда: '") + Формат(ПараметрыОповещения.Предмет.ПлановаяДатаНачала,"ДФ='дд.ММ.гг ЧЧ:мм'") + " - " +
											 Формат(ПараметрыОповещения.Предмет.ПлановаяДатаОкончания,"ДФ='дд.ММ.гг ЧЧ:мм'") + "</p>";
			
			Если НЕ УчастникиКТ.СписокУчастников = "" Тогда
			ТекстСодержания = ТекстСодержания + "
			|<p>" + НСтр("ru='Участники:'") + "</p>
			|<p>" + УчастникиКТ.СписокУчастников + "</p>";
			КонецЕсли;
			
			ТекстСодержания = ТекстСодержания + "
			|<p>" + НСтр("ru='Ответственный: '") + УчастникиКТ.Ответственный + "</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
	// 8. Действия по партнерам
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ДействияПоПартнерам Тогда
		Если ПараметрыОповещения.Свойство("Партнеры") Тогда
			Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
				ПартнерыСтрокой = "";
				ПартнерыСтрокойСПереносом = "";
				Для Каждого ПартнерСсылка Из ПараметрыОповещения.Партнеры Цикл
					ПартнерыСтрокой = ПартнерыСтрокой + ?(ЗначениеЗаполнено(ПартнерыСтрокой), ", ", "") + """" + Строка(ПартнерСсылка) + """";
					ПартнерыСтрокойСПереносом = ПартнерыСтрокойСПереносом + ?(ЗначениеЗаполнено(ПартнерыСтрокойСПереносом), Символы.ПС, "") + """" + Строка(ПартнерСсылка) + """";
				КонецЦикла;
				
				ПредставлениеПредмета = ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет);
				
				ТекстСодержания = ТекстСодержания
				+ НСтр("ru='Новый документ ""'")
				+ ПредставлениеПредмета
				+ НСтр("ru='"" по'") + " "
				+ ?(ПараметрыОповещения.Партнеры.Количество() = 1, НСтр("ru='партнеру'"), НСтр("ru='партнерам'"));
				//
				Если ПараметрыОповещения.Партнеры.Количество() > 3 Тогда
					ТекстСодержания = ТекстСодержания + ":" + Символы.ПС;
					ТекстСодержания = ТекстСодержания + ПартнерыСтрокойСПереносом;
				Иначе
					ТекстСодержания = ТекстСодержания + " " + ПартнерыСтрокой;
				КонецЕсли;
				
				ТекстСодержания = ТекстСодержания
				+ ?(ЗначениеЗаполнено(ТекстСодержания), Символы.ПС, "")
				+ ?(ПараметрыОповещения.Свойство("ТекстОповещения"),ПараметрыОповещения.ТекстОповещения + Символы.ПС,"")
				+ СформироватьТекстСодержанияДляОповещения(ПараметрыОповещения.Предмет);
				//
			Иначе
				СписокСсылок = Новый СписокЗначений;
				
				ПредставлениеСсылки = ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет);
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
				
				СписокСсылок.Добавить(НавигационнаяСсылкаСтрокой);
				
				Ном = 1;
				ТекстСодержания = "
				|<p>" + НСтр("ru='Новый документ '") + "</p>
				|<p>%"+Строка(Ном)+"</p>
				|<p>" + НСтр("ru='по '") + ?(ПараметрыОповещения.Партнеры.Количество() = 1,НСтр("ru='партнеру'"),НСтр("ru='партнерам'")) + "</p>";
				
				ПартнерыСтрокой = "";
				Для Каждого ПартнерСсылка Из ПараметрыОповещения.Партнеры Цикл
					ПартнерыСтрокой = ПартнерыСтрокой + ?(ЗначениеЗаполнено(ПартнерыСтрокой), ", ", "") + """" + Строка(ПартнерСсылка) + """";
					
					Ном = Ном + 1;
					
					ПредставлениеСсылки = ПартнерСсылка.Наименование;
					НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПартнерСсылка);
					НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					ПредставлениеСсылки);
					
					СписокСсылок.Добавить(НавигационнаяСсылкаСтрокой);
					
					ТекстСодержания = ТекстСодержания + "
					|<p>%"+Строка(Ном)+"</p>";
				КонецЦикла;
				
				ТекстТемы = ТекстТемы + НСтр("ru='Новый документ ""'")
				+ ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет, Истина)
				+ НСтр("ru='"" по'") + " "
				+ ?(ПараметрыОповещения.Партнеры.Количество() = 1, НСтр("ru='партнеру'"), НСтр("ru='партнерам'"))
				+ ": " + ПартнерыСтрокой;
				
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
				
				Ном = 0;
				Для Каждого ЭлементСписка Из СписокСсылок Цикл
					Ном = Ном + 1;
					
					ТекстСодержания = СтрЗаменить(ТекстСодержания, "%"+Строка(Ном), ЭлементСписка.Значение);
				КонецЦикла;
				
				ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
				ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			КонецЕсли;
		КонецЕсли;
		
	// 9. Действия по проектам
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ДействияПоПроектам Тогда
		Если ПараметрыОповещения.Свойство("Проекты") Тогда
			Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
				ПроектыСтрокой = "";
				ПроектыСтрокойСПереносом = "";
				Для Каждого ПроектСсылка Из ПараметрыОповещения.Проекты Цикл
					ПроектыСтрокой = ПроектыСтрокой + ?(ЗначениеЗаполнено(ПроектыСтрокой), ", ", "") + """" + Строка(ПроектСсылка) + """";
					ПроектыСтрокойСПереносом = ПроектыСтрокойСПереносом + ?(ЗначениеЗаполнено(ПроектыСтрокойСПереносом), Символы.ПС, "") + """" + Строка(ПроектСсылка) + """";
				КонецЦикла;
				
				ПредставлениеПредмета = ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет);
				
				ТекстСодержания = ТекстСодержания
				+ НСтр("ru='Новый документ ""'")
				+ ПредставлениеПредмета
				+ НСтр("ru='"" по'") + " "
				+ ?(ПараметрыОповещения.Проекты.Количество() = 1, НСтр("ru='проекту'"), НСтр("ru='проектам'"));
				//
				Если ПараметрыОповещения.Проекты.Количество() > 3 Тогда
					ТекстСодержания = ТекстСодержания + ":" + Символы.ПС;
					ТекстСодержания = ТекстСодержания + ПроектыСтрокойСПереносом;
				Иначе
					ТекстСодержания = ТекстСодержания + " " + ПроектыСтрокой;
				КонецЕсли;
				
				
				ТекстСодержания = ТекстСодержания
				+ ?(ЗначениеЗаполнено(ТекстСодержания), Символы.ПС, "")
				+ ?(ПараметрыОповещения.Свойство("ТекстОповещения"),ПараметрыОповещения.ТекстОповещения + Символы.ПС,"")
				+ СформироватьТекстСодержанияДляОповещения(ПараметрыОповещения.Предмет);
				//
			Иначе
				ТекстТемы = ТекстТемы + НСтр("ru='Новый документ ""'")
				+ ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет, Истина)
				+ НСтр("ru='"" по'") + " "
				+ ?(ПараметрыОповещения.Проекты.Количество() = 1, НСтр("ru='проекту'"), НСтр("ru='проектам'"))
				+ ": " + ПроектыСтрокой;
				
				СписокСсылок = Новый СписокЗначений;
				
				ПредставлениеСсылки = ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет);
				НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
				НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
				
				СписокСсылок.Добавить(НавигационнаяСсылкаСтрокой);
				
				Ном = 1;
				ТекстСодержания = "
				|<p>" + НСтр("ru='Новый документ '") + "</p>
				|<p>%"+Строка(Ном)+"</p>
				|<p>" + НСтр("ru='по '") + ?(ПараметрыОповещения.Партнеры.Количество() = 1,НСтр("ru='проекту'"),НСтр("ru='проектам'")) + "</p>";
				
				ПроектыСтрокой = "";
				Для Каждого ПартнерСсылка Из ПараметрыОповещения.Проекты Цикл
					ПроектыСтрокой = ПроектыСтрокой + ?(ЗначениеЗаполнено(ПроектыСтрокой), ", ", "") + """" + Строка(ПроектСсылка) + """";
					
					Ном = Ном + 1;
					
					ПредставлениеСсылки = Строка(ПроектСсылка);
					НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПроектСсылка);
					НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"<a href=%1>%2</a>",
					КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
					ПредставлениеСсылки);
					
					СписокСсылок.Добавить(НавигационнаяСсылкаСтрокой);
					
					ТекстСодержания = ТекстСодержания + "
					|<p>%"+Строка(Ном)+"</p>";
				КонецЦикла;
				
				ТекстТемы = ТекстТемы + НСтр("ru='Новый документ ""'")
				+ ПолучитьПредставлениеПредметаДляОповещения(ПараметрыОповещения.Предмет, Истина)
				+ НСтр("ru='"" по'") + " "
				+ ?(ПараметрыОповещения.Проекты.Количество() = 1, НСтр("ru='проекту'"), НСтр("ru='проектам'"))
				+ ": " + ПроектыСтрокой;
				
				ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
				
				Ном = 0;
				Для Каждого ЭлементСписка Из СписокСсылок Цикл
					Ном = Ном + 1;
					
					ТекстСодержания = СтрЗаменить(ТекстСодержания, "%"+Строка(Ном), ЭлементСписка.Значение);
				КонецЦикла;
				
				ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
				ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			КонецЕсли;
		КонецЕсли;
		
	// 10. Коммерческое предложение на сумму.
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.КоммерческоеПредложениеСумма Тогда
		
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ИмяРеквизитаПартнер = "Партнер";	
		Иначе
			ИмяРеквизитаПартнер = "Клиент";
		КонецЕсли;				
		Если ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.Напоминание Тогда
			
			ТекстСодержания = НСтр("ru='Зафиксировано Коммерческое предложение с суммой более'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета) + Символы.ПС +
			"№" + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'") + НСтр("ru=' Сумма:'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Предмет.СуммаДокумента,ПараметрыОповещения.Предмет.Валюта) + Символы.ПС +
			НСтр("ru=' Организация:'") + " " + ПараметрыОповещения.Предмет.Организация + Символы.ПС +
			НСтр("ru=' Организация:';en=' Company:'") + " " + ПараметрыОповещения.Предмет[ИмяРеквизитаПартнер] + Символы.ПС;
			
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				ТекстСодержания = ТекстСодержания + НСтр("ru=' Договор:'") + " " + ПараметрыОповещения.Предмет.Договор;
			КонецЕсли;	
			
		ИначеЕсли ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.СМС Тогда
			
			ТекстСодержания = НСтр("ru='Зафиксировано Коммерческое предложение с суммой более'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета) + Символы.ПС +
			"№" + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'") + НСтр("ru=' Сумма:'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Предмет.СуммаДокумента,ПараметрыОповещения.Предмет.Валюта);
			
		ИначеЕсли ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			ПредставлениеСсылки = "№" + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от '") + 
								  Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'") +
								  НСтр("ru=' Сумма: '") + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Предмет.СуммаДокумента,ПараметрыОповещения.Предмет.Валюта);
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
			
			ТекстТемы = НСтр("ru='Зафиксировано Коммерческое предложение с суммой более'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета);
			
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				ТекстДоговор = НСтр("ru=' Договор: '") + ПараметрыОповещения.Предмет.Договор;
			КонецЕсли;	
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Зафиксировано Коммерческое предложение с суммой более '") + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета)  + "</p>
			|<p>%1</p>
			|<p>" + НСтр("ru=' Организация: '") + ПараметрыОповещения.Предмет.Организация + "</p>
			|<p>" + НСтр("ru=' Организация: ';en=' Company: '") + ПараметрыОповещения.Предмет[ИмяРеквизитаПартнер] + "</p>
			|<p>" + ТекстДоговор + "</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
		
	// 11. Счет на сумму
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.СчетСумма Тогда
		
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
		Если ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.Напоминание Тогда
			
			ТекстСодержания = НСтр("ru='Зафиксирован Счет на оплату покупателю с суммой более'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета) + Символы.ПС +
			"№" + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'") + НСтр("ru=' Сумма:'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Предмет.СуммаДокумента,ПараметрыОповещения.Предмет.Валюта) + Символы.ПС +
			НСтр("ru=' Организация:'") + " " + ПараметрыОповещения.Предмет.Организация + Символы.ПС +
			НСтр("ru=' Организация:';en=' Company:'") + " " + ПараметрыОповещения.Предмет.Партнер + Символы.ПС +
			НСтр("ru=' Клиент:';en=' Customer:'") + " " + ПараметрыОповещения.Предмет.Договор;
			
		ИначеЕсли ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.СМС Тогда
			
			ТекстСодержания = НСтр("ru='Зафиксирован Счет на оплату покупателю с суммой более'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета) + Символы.ПС +
			"№" + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от'") + " " + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'") + НСтр("ru=' Сумма:'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Предмет.СуммаДокумента,ПараметрыОповещения.Предмет.Валюта);
			
		ИначеЕсли ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			ПредставлениеСсылки = "№" + ПараметрыОповещения.Предмет.Номер + НСтр("ru=' от '") + 
								  Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'") +
								  НСтр("ru=' Сумма: '") + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Предмет.СуммаДокумента,ПараметрыОповещения.Предмет.Валюта);
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
			
			ТекстТемы = НСтр("ru='Зафиксирован Счет на оплату покупателю с суммой более'") + " " + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета);
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Зафиксирован Счет на оплату покупателю с суммой более '") + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ПараметрыОповещения.Сумма,ВалютаУправленческогоУчета)  + "</p>
			|<p>%1</p>
			|<p>" + НСтр("ru=' Организация: '") + ПараметрыОповещения.Предмет.Организация + "</p>
			|<p>" + НСтр("ru=' Организация: ';en=' Company: '") + ПараметрыОповещения.Предмет.Партнер + "</p>
			|<p>" + НСтр("ru=' Клиент: ';en=' Customer: '") + ПараметрыОповещения.Предмет.Договор + "</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
		
	// 12. 
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОбОкончанииСрокаЗадач Тогда
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			ТекстСодержания = НСтр("ru='Истекает срок выполнения задачи ""'") + Строка(ПараметрыОповещения.Предмет.Наименование) + НСтр("ru='"" срок:'") + " " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
			
		Иначе
			ТемаНаименование = ПараметрыОповещения.Предмет.Наименование;
			
			ПредставлениеСсылки = ТемаНаименование + НСтр("ru=' от '") + Формат(ПараметрыОповещения.Предмет.Дата,"ДФ='дд.ММ.гг ЧЧ:мм'");
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ПредставлениеСсылки);
				
			ТекстТемы = НСтр("ru='Истекает срок выполнения задачи ""'") + ТемаНаименование + НСтр("ru='"" срок:'") + " " + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'"));
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Истекает срок выполнения задачи '") + "</p>
			|<p>%1</p>
			|<p>" + НСтр("ru='Срок: '") + Формат(ПараметрыОповещения.Предмет.СрокИсполнения,?(ПараметрыОповещения.ИспользоватьДатуИВремяВСрокахЗадач,"ДФ='дд.ММ.гг ЧЧ:мм'","ДФ='дд.ММ.гг'")) + "</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСодержания,НавигационнаяСсылкаСтрокой);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
	// 13. 
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ОшибкаСрабатыванияТриггера Тогда
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			ТекстСодержания = НСтр("ru='Ошибка выполнения триггера'") + " """ + Строка(ПараметрыОповещения.Предмет.Наименование) + """";
			
		Иначе
			ТемаНаименование = ПараметрыОповещения.Предмет.Наименование;
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ТемаНаименование);
				
			ТекстТемы = НСтр("ru='Ошибка выполнения триггера'") + " """ + ТемаНаименование + """";
			
			ТекстСодержания = "
			|<p>" + НСтр("ru='Ошибка выполнения триггера '") + "</p>
			|<p>"+НавигационнаяСсылкаСтрокой+"</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
	// 14. 
	ИначеЕсли ПараметрыОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.CRM_ОповещенияОКлючевыхСобытиях Тогда
	
		ФИО = СклонениеПредставленийОбъектов.ПросклонятьФИО(ПараметрыОповещения.Предмет.Наименование, 2, ПараметрыОповещения.Предмет,
			?(ПараметрыОповещения.Предмет.Пол = Перечисления.ПолФизическогоЛица.Мужской, 1, 2)); 
		Если НЕ ПараметрыОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
			
			ТекстСодержания = Формат(ПараметрыОповещения.ДатаСобытия, "ДФ=dd.MM.yyyy") + " "
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='у %1 (%2) важное событие'"), ФИО, ПараметрыОповещения.Предмет.Владелец)
				+" - " + ПараметрыОповещения.ВидСобытия;
			
		Иначе
			
			НавигационнаяСсылка = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьНавигационнуюСсылкуНаОбъект(ПараметрыОповещения.Предмет);
			НавигационнаяСсылкаСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=%1>%2</a>",
				КодироватьСтроку(НавигационнаяСсылка, СпособКодированияСтроки.URLВКодировкеURL),
				ФИО);
				
			ТекстТемы = Формат(ПараметрыОповещения.ДатаСобытия, "ДФ=dd.MM.yyyy") + " " 
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='у %1 (%2) важное событие'"), ФИО, ПараметрыОповещения.Предмет.Владелец)
				+" - " + ПараметрыОповещения.ВидСобытия;
			
			ТекстСодержания = "
			|<p>"+Формат(ПараметрыОповещения.ДатаСобытия, "ДФ=dd.MM.yyyy") + " " 
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='у %1 (%2) важное событие'"), НавигационнаяСсылкаСтрокой, ПараметрыОповещения.Предмет.Владелец)
				+" - " + ПараметрыОповещения.ВидСобытия+"</p>";
			
			ТекстСодержания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолучитьТелоТекстаПисьма(),ТекстСодержания);
			
			ДокументHTML	= Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстСодержания);
			ТекстСодержания	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Тема,Содержание",ТекстТемы,ТекстСодержания);
	
КонецФункции

&ИзменениеИКонтроль("ДобавитьОповещение")
Процедура смарт_ДобавитьОповещение(ПараметрыОповещения, ПроверятьВозможныеПовторыИзмерений = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьДатуИВремяВСрокахЗадач = Константы.ИспользоватьДатуИВремяВСрокахЗадач.Получить();
	ОповещенияПараметрыНастроек = ПолучитьПараметрыНастроекОповещений();
	
	Для Каждого СтруктураОповещения Из ПараметрыОповещения Цикл
		СтруктураОповещения.Вставить("ИспользоватьДатуИВремяВСрокахЗадач",ИспользоватьДатуИВремяВСрокахЗадач);
		ТемаИСодержание				= СформироватьТекстТемыИСодержанияОповещения(СтруктураОповещения);
		ДатаОповещения				= ПолучитьДатуОповещения(СтруктураОповещения);
		ДатаАктуальностиОповещения	= ПолучитьАктуальностиДатуОповещения(СтруктураОповещения);
		Если (СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ЗапланированныеСобытия) И (ДатаОповещения <= ТекущаяДатаСеанса())
			И (СтруктураОповещения.Получатель = Пользователи.ТекущийПользователь()) Тогда
			Продолжить;
		КонецЕсли;
		Если СтруктураОповещения.ВидОповещения = "ОповещениеУчастниковСобытия" Тогда
			СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ЗапланированныеСобытия;
		КонецЕсли;
		Если ((СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.КоммерческоеПредложениеСумма)
			ИЛИ (СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.СчетСумма))
			И (СтруктураОповещения.Получатель = Пользователи.ТекущийПользователь()) Тогда
			Продолжить;
		КонецЕсли;
		Если СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ПросроченныеНеЗавершенныеСобытияЗадачи
			И ТипЗнч(СтруктураОповещения.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
			И ЗначениеЗаполнено(СтруктураОповещения.Предмет.БизнесПроцесс)
			И ТипЗнч(СтруктураОповещения.Предмет.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") 
			И СтруктураОповещения.Предмет.БизнесПроцесс.КартаМаршрута = Справочники.CRM_КартыМаршрутов.Поручение
			И СтруктураОповещения.Предмет.БизнесПроцесс.ОповещатьАвтора Тогда
			ОповеститьАвтораПорученияОВыполненииЗадачи(СтруктураОповещения.Предмет, Истина);
		КонецЕсли;
		Если СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.Напоминание И ОповещенияПараметрыНастроек.CRM_ИспользоватьНапоминания Тогда
			ПараметрыНапоминания = Новый Структура;
			ПараметрыНапоминания.Вставить("Пользователь"	,СтруктураОповещения.Получатель);
			ПараметрыНапоминания.Вставить("ДатаОповещения"	,ДатаОповещения);
			ПараметрыНапоминания.Вставить("СрокОповещения"	,СтруктураОповещения.СрокОповещения);
			ПараметрыНапоминания.Вставить("Периодичность"	,СтруктураОповещения.Периодичность);
			ПараметрыНапоминания.Вставить("ВидОповещения"	,СтруктураОповещения.ВидОповещения);
			ПараметрыНапоминания.Вставить("ДатаАктуальности",ДатаАктуальностиОповещения);
			Если ПроверятьВозможныеПовторыИзмерений
				И (СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ДействияПоПартнерам
				ИЛИ	СтруктураОповещения.ВидОповещения = Справочники.CRM_ВидыОповещений.ДействияПоПроектам) Тогда
				ПараметрыНапоминания.Вставить("ПроверятьВозможныеПовторыИзмерений");
			КонецЕсли;
			CRM_НапоминанияСервер.ДобавитьНапоминание(СтруктураОповещения.Предмет, ТемаИСодержание.Содержание, ПараметрыНапоминания);
		#Удаление
		КонецЕсли;
		Если (СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта И ОповещенияПараметрыНастроек.CRM_ИспользоватьОповещенияЭлектроннаяПочта )
		#КонецУдаления
		#Вставка
		//++ #1407 смарт: Фролов 07.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
		ИначеЕсли СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.Напоминание Тогда
			
			//++ #1906 смарт: Фролов 08.07.2024 //При постановке задачи из 1С ставить напоминание не автору а получателю задачи.
			
			//НапоминанияПользователя.УстановитьНапоминание(ТемаИСодержание.Содержание,ДатаОповещения,,СтруктураОповещения.Предмет,);
			НапоминанияПользователяСлужебный.смарт_ПодключитьПроизвольноеНапоминаниеПользователю(ТемаИСодержание.Содержание, ДатаОповещения, 
				СтруктураОповещения.СрокОповещения, СтруктураОповещения.Предмет, ТемаИСодержание.Тема, СтруктураОповещения.Получатель);
				
			//-- #1906 смарт: Фролов 08.07.2024
			
		//-- #1407 смарт: Фролов 07.09.2023	
		КонецЕсли;
		//++ #1407 смарт: Фролов 18.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
		//Если (СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта И ОповещенияПараметрыНастроек.CRM_ИспользоватьОповещенияЭлектроннаяПочта ) 
		Если (СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта )  
		//-- #1407 смарт: Фролов 18.09.2023	
		#КонецВставки
			ИЛИ (СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.СМС И ОповещенияПараметрыНастроек.CRM_ИспользоватьОповещенияСМС ) И НЕ СтруктураОповещения.Получатель.CRM_ОтписалсяОтEmailРассылок Тогда
			Менеджер = РегистрыСведений.CRM_Оповещения.СоздатьМенеджерЗаписи();
			Менеджер.Получатель			= СтруктураОповещения.Получатель;
			Менеджер.Предмет			= СтруктураОповещения.Предмет;
			Менеджер.ДатаОповещения		= ДатаОповещения;
			Менеджер.ДатаАктуальности	= ДатаАктуальностиОповещения;
			Если СтруктураОповещения.ВидОповещения = "ПринятаЗадачаИсполнителя"
			ИЛИ СтруктураОповещения.ВидОповещения = "ВыполненаЗадачаИсполнителя"
			ИЛИ СтруктураОповещения.ВидОповещения = "СозданаЗадачаИсполнителя" Тогда
				Менеджер.ВидОповещения	= Справочники.CRM_ВидыОповещений.ЗначимыеСобытия;
				Менеджер.Шаблон			= СтруктураОповещения.Шаблон;
				Если СтруктураОповещения.Свойство("Взаимодействие") Тогда
					Менеджер.Взаимодействие = СтруктураОповещения.Взаимодействие;
				КонецЕсли;
			Иначе
				Менеджер.ВидОповещения	= СтруктураОповещения.ВидОповещения;
				Менеджер.Тема			= ТемаИСодержание.Тема;
				Менеджер.Содержание		= ТемаИСодержание.Содержание;
			КонецЕсли;
			Менеджер.Канал				= СтруктураОповещения.Канал;
			Менеджер.СрокОповещения		= СтруктураОповещения.СрокОповещения;
			Менеджер.Периодичность		= СтруктураОповещения.Периодичность;
			Если СтруктураОповещения.Канал = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта Тогда
				Если CRM_MSExchangeВызовСервера.ВыполненОбменСMSExchange(СтруктураОповещения.Предмет) Тогда
					Менеджер.Удалить();
				Иначе	
					Менеджер.Записать();
				КонецЕсли;	
			Иначе	
				Менеджер.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

