
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 	
	
	ТекущийОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();	
	ТекущийОбъект.Данные = Новый ХранилищеЗначения(СтруктураШаблона);  		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("СтруктураШаблона", СтруктураШаблона) Тогда
		
		Отказ = Истина;;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтаФорма.Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
