
#Область ОбработчикиСобытийФормыИЭлементов


&НаСервере
Процедура ПриСозданииНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// ++ 21.02.2021
	ОсновнойСкладДляЗапчастейПодЗаказ = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ, Ложь);
	// --
		
	//++ смарт:ММ 25.10.2020
	Если ЗначениеЗаполнено(Параметры.Основание) 
		И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаказНаПеремещение") 
		И Параметры.Основание.СкладПолучатель <> Справочники.смартПредопределенныеЗначения.СкладГарантийныхЗапчастейПоУмолчанию.Значение Тогда
		НеОткрывать = Истина;
	КонецЕсли;
	
	//-- смарт:ММ 25.10.2020
	//++ #1287 смарт: Фролов 03.04.2023 //Работа с гарантийными и коммерческими запасными частями  
	Если Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Параметры.Основание) 
		
		//++ #Б-1498 смарт: Фролов 11.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
		//И НЕ РольДоступна("смартСпециалистПоПретензиям") Тогда
		И НЕ Пользователи.РолиДоступны("смартСпециалистПоПретензиям") Тогда
		//-- #Б-1498 смарт: Фролов 11.12.2024
		
		Сообщить("Заявка на гарантийный ремонт может быть создана только на основании другого документа!");
		НеОткрывать = Истина;
	КонецЕсли;	
	//-- #1287 смарт: Фролов 03.04.2023
	
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не Параметры.Ключ.Пустая() Тогда
			
		УстановитьДоступностьДатыНомера(Истина);
				
		// ++ 29.08.2020
		Если Объект.Статус = Перечисления.СтатусыКассовойСмены.Закрыта 
			И НЕ ЕстьПолныеПрава()
			И НЕ УправлениеДоступом.ЕстьРоль("смартСпециалистПоПретензиям")
			И УправлениеДоступом.ЕстьРоль("смартИнженер") Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Номер) Тогда
		// Разбить стандартный номер на префикс и цифровой внешний номер заявки
		СтруктураПрефиксНомер = смартОбщегоНазначения.РазбитьСтрокуНаПрефиксИНомер(Объект.Номер);
		Префикс 		= СтруктураПрефиксНомер.Префикс;
		ВнешнийНомер 	= СтруктураПрефиксНомер.Номер;
	Иначе
		Если ЗначениеЗаполнено(Объект.Поставщик) Тогда
			Префикс = ПолучитьПрефиксНаСервере(Объект.Поставщик);
		КонецЕсли;
	КонецЕсли;
	
	// 31.03.2020
	ДополнительныеСтатусы.Параметры.УстановитьЗначениеПараметра("НомерЗаявки", Объект.Номер);
	ДополнительныеСтатусы.Параметры.УстановитьЗначениеПараметра("Артикул", "");
	
	НастроитьВидимостьДоступность();
	
	ОбновитьРешенияПоставщика();
	
	// 25.04.2020
	ОбновитьКолонкуНоменклатурыРавны();
	
	// 15.12.2020
	ЗаполнитьКолонкуПредыдущееКоличество();  
	
    //++ #1287 смарт: Фролов 14.03.2023 //Работа с гарантийными и коммерческими запасными частями  
	УстановитьВидимостьОтчетМимаки();
    //-- #1287 смарт: Фролов 14.03.2023  
	
	//++ #2033 смарт: Мосолов 06.09.2024 //Доработка гарантийного блока / Добавить Организацию продавца оборудования (заявка на гарантийный ремонт)
    ОпределитьВывестиОрганизациюПродавца();
	//-- #2033 смарт: Мосолов 06.09.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "Партнер");
	смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Клиент);
	//-- #Б3960 смарт: Шляпников 16.09.2025

КонецПроцедуры

//++ #2033 смарт: Мосолов 06.09.2024 //Доработка гарантийного блока / Добавить Организацию продавца оборудования (заявка на гарантийный ремонт)
&НаСервере
Процедура ОпределитьВывестиОрганизациюПродавца() 
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Номенклатура", Объект.Оборудование);
	Запрос.УстановитьПараметр("Серия", Объект.Серия);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыручкаИСебестоимостьПродажОбороты.ВидЗапасов.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
	|				И АналитикаУчетаНоменклатуры.Серия = &Серия) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.Период УБЫВ"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОрганизацияПродавец = Выборка.Организация;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОрганизацияПродавец) И ОрганизацияПродавец <> Объект.Организация Тогда
		
		Элементы.ОрганизацияПродавец.Видимость = Истина;
		
	КонецЕсли;
		
КонецПроцедуры //-- #2033 смарт: Мосолов 06.09.2024

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//++ #1348 смарт: Фролов 02.05.2023 //Добавить предупреждение при создании Гар. заявки на основании Заявки на ремонт  
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.ДокументОснование) ТОгда
		РезультатПроверки=ПроверитьНаличиеГарантийныхЗаявок(); 
		Если НЕ РезультатПроверки=Неопределено ТОгда
			СпсКнопок=Новый СписокЗначений;
			СпсКнопок.Добавить("Отмена");
			Если РезультатПроверки.Количество()=1 Тогда
				СпсКнопок.Добавить("ПерейтиКЗаявке","Перейти к заявке");
			КонецЕсли;
			СпсКнопок.Добавить("ВсеРавноСоздатьНовую","Все равно создать новую");
			ДопПараметры=Новый Структура("Заявка",РезультатПроверки[0]);
			Оповещение = Новый ОписаниеОповещения("ПриСозданииНовогоДокументаЗавершение", ЭтотОбъект,ДопПараметры);
			Если РезультатПроверки.Количество()=1 Тогда 
				СтруктураРеквизитов=ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(РезультатПроверки[0],"Номер");
				ТекстВопроса = НСтр("ru = 'Внимание! По данной заявке уже есть Заявка на гарантийный ремонт №"+СтруктураРеквизитов.Номер+"?'");
			Иначе
				ТекстНомера=""+Символы.ПС;
				Для Каждого Стр Из РезультатПроверки Цикл  
					СтруктураРеквизитов=ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Стр,"Номер");
					ТекстНомера=ТекстНомера+СтруктураРеквизитов.Номер+Символы.ПС;			
				КонецЦикла;	
			    ТекстВопроса = НСтр("ru = 'Внимание! По данной заявке уже есть следующие Заявки на гарантийный ремонт "+ТекстНомера+"'");
			КонецЕсли;
			ПоказатьВопрос(Оповещение, ТекстВопроса, СпсКнопок, , "Отмена");
		КонецЕсли;  
	КонецЕсли;
	//-- #1348 смарт: Фролов 02.05.2023
	
	//++ смарт:ММ 25.10.2020
	Если НеОткрывать Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	//-- смарт:ММ 25.10.2020
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	// Если есть хоть одна строка со статусом компенсация, то колонки сумма и валюта видны
	НастроитьВидимостьКолонокКомпенсации();
	
КонецПроцедуры 

// ++ 10.04.2020
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	ОбновитьРешенияПоставщика();
	ОбновитьКолонкуНоменклатурыРавны();
	УстановитьДоступностьДатыНомера(Истина);
	
	// ++ 28.06.2020
	Оповестить("смартИзменениеЗаявкиНаГарантийныйРемонт");
	
	// ++ 16.12.2020
	СтрокиИнженераГдеМенялосьКоличество.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	//++ #1287 смарт: Фролов 16.03.2023 //Работа с гарантийными и коммерческими запасными частями  
	УстановитьВидимостьОтчетМимаки();
    //-- #1287 смарт: Фролов 16.03.2023 
	
КонецПроцедуры

// ++ 24.04.2020
&НаКлиенте
Процедура СерияПриИзменении(Элемент) 
	
	ЗаполнитьПоСерийномуНомеру(); 
	
	//++ #1963 смарт: Мосолов 26.08.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт
	ОбработатьИзменениеНоменклатурыСерии();
	//-- #1963 смарт: Мосолов 26.08.2024    
	
КонецПроцедуры

// ++ 06.04.2020
&НаКлиенте
Процедура НайтиПоСерийномуНомеру(Команда)	
	ЗаполнитьПоСерийномуНомеру();		
КонецПроцедуры

// ++ 06.04.2020
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Контрагент)
		// ++ 04.11.2020
		И ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты")
		// --
		Тогда
		Объект.Клиент = ПолучитьПартнераКонтрагента(Объект.Контрагент);
	КонецЕсли;
КонецПроцедуры

// ++ 10.08.2020
&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НастроитьСвязиПараметровВыбораНаСервере();
		
КонецПроцедуры

// ++ 10.08.2020
&НаСервере
Процедура НастроитьСвязиПараметровВыбораНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Элементы.Контрагент.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
	Иначе
		Если Элементы.Контрагент.СвязиПараметровВыбора.Количество() = 0 Тогда

			НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Партнер", "Объект.Клиент");
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НоваяСвязь);
			НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
			Элементы.Контрагент.СвязиПараметровВыбора = НовыеСвязи;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// ++ 06.04.2020
&НаСервереБезКонтекста
Функция ПолучитьПартнераКонтрагента(Контрагент)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер", Истина);
КонецФункции

&НаКлиенте
Процедура ОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//закомментировано, т.к. оборудование может быть куплено не у нас или давно (в базе не будет реализации)
	//СтандартнаяОбработка = Ложь;
	//	
	//СписокНоменклатурыКлиента = ПолучитьНоменклатуруКлиента(Объект.Клиент);
	//
	//Отбор = Новый Структура;
	//Отбор.Вставить("Ссылка", СписокНоменклатурыКлиента);
	//
	//ПараметрыФормыВыбораНоменклатуры = Новый Структура;
	//ПараметрыФормыВыбораНоменклатуры.Вставить("Отбор", Отбор);
	//ПараметрыФормыВыбораНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);

	//
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормыВыбораНоменклатуры, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТоварыПоСкладуИнженера(Команда)
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'заявку на гарантийный ремонт'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", 		Объект.СкладИнженера);
	ПараметрыФормы.Вставить("Заголовок", 	ПараметрЗаголовок);
	ПараметрыФормы.Вставить("Дата", 		Объект.Дата);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	ПараметрыФормы.Вставить("Документ", 	Объект.Ссылка);
	//ПараметрыФормы.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
	
	// ++ 29.02.2020
	// ++ 08.04.2020 - пока что убрана доработка от 29.02.2020
	//Если Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() = 0 Тогда
		ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	//Иначе
	//	
	//	// Если таб. часть специалиста по претензиям не пустая, то инженер может в свою таб. часть заполнить только номенклатуру, 
	//	// указанную специалистом по претензиям, причем если в строке у специалиста заполнен аналог, то инженер может указать именно аналог
	//	
	//	МассивДоступнойНоменклатуры = ПолучитьМассивДоступнойИнженеруНоменклатуры();		
	//	
	//	ФормаПодбора = ПолучитьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	//	
	//	Элемент = ФормаПодбора.СписокНоменклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	Элемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
	//	Элемент.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
	//	Элемент.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//	Элемент.Использование 		= Истина;
	//	Элемент.ПравоеЗначение 		= МассивДоступнойНоменклатуры;
	//	
	//	Элемент.ИдентификаторПользовательскойНастройки = "Ссылка";
	//	
	//	ФормаПодбора.Открыть();
	//КонецЕсли;
	// --
	
КонецПроцедуры

// ++ 26.01.2021
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// 16.02.2021 - т.к. склад теперь может заполняться при проведении приходного ордера, то возможны строки без заказа на перемещение, но со складом
	
	//ЕстьСрокиСоСкладомИБезЗаказаНаПеремещение = Ложь;
	//
	//Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(СтрокаИнженер.Склад) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если НЕ ЗначениеЗаполнено(СтрокаИнженер.ДокументПолученияЗапчасти) Тогда
	//		ЕстьСрокиСоСкладомИБезЗаказаНаПеремещение = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если ЕстьСрокиСоСкладомИБезЗаказаНаПеремещение Тогда
	//	Отказ = Истина;
	//	Оповещение = Новый ОписаниеОповещения("ВопросПередЗаписьюДокументаЗавершение", ЭтотОбъект);
	//	ТекстВопроса = НСтр("ru = 'На вкладке ""Заполняется инженером"" имеются строки с заполненным складом, по которым не созданы заказы на перемещение. При записи заявки склады будут очищены. Продолжить?'");
	//	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	//КонецЕсли;
	
КонецПроцедуры

// ++ 26.01.2021
&НаКлиенте
Процедура ВопросПередЗаписьюДокументаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаИнженер.Склад) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаИнженер.ДокументПолученияЗапчасти) Тогда
				СтрокаИнженер.Склад = Неопределено;	
			КонецЕсли;
		КонецЦикла;
		
		Записать();
 		
	Иначе

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Префикс) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен префикс Поставщика!", Объект.Ссылка, "Префикс");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВнешнийНомер) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен номер документа!", Объект.Ссылка, "ВнешнийНомер");
	КонецЕсли;
	
	//++ смарт:ММ #044 224 16.11.2020 - Заявка на гарантийный ремонт
	Если НЕ Отказ И ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПроверитьЗаполнение();
	КонецЕсли;
	//-- смарт:ММ 16.11.2020
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.Номер = Префикс + ВнешнийНомер;
	
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		
		Отказ = ДокументНеобходимоПровести();
		
		// 03.06.2020
		//Если Отказ Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ необходимо провести, т.к. в табличной части присутствует статус ""Отправлено поставщику""!");
		//КонецЕсли;

	КонецЕсли;
	//++ #Б-6932 смарт: Фролов 25.05.2026 //Заявка на гарантийный ремонт. Права доступа к отчету Мимаки.
	//++ #1287 смарт: Фролов 24.04.2023 //Работа с гарантийными и коммерческими запасными частями  
	//++ #1287 смарт: Лопато 20.06.2023 //Работа с гарантийными и коммерческими запасными частями 	
	//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
	// Закомментировал ниже
	// Если НЕ РольДоступна("ПолныеПрава") И НЕ НеПроверятьРеквизиты И ПоставщикМимаки() Тогда
	// Добавил ниже
	Если НЕ Пользователи.РолиДоступны("смартСпециалистПоПретензиям") И НЕ НеПроверятьРеквизиты И Мимаки_УсловияОбъектаВыполнены() Тогда
	//Если НЕ РольДоступна("ПолныеПрава") И НЕ НеПроверятьРеквизиты И Мимаки_УсловияОбъектаВыполнены() Тогда
	//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
	//-- #1287 смарт: Лопато 20.06.2023
	//-- #Б-6932 смарт: Фролов 25.05.2026
		Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	смартОтчетПоГарантииМимаки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартОтчетПоГарантииМимаки КАК смартОтчетПоГарантииМимаки
		|ГДЕ
		|	смартОтчетПоГарантииМимаки.ДокументОснование = &ДокументОснование 
		//++ #1287 смарт: Лопато 20.06.2023 //Работа с гарантийными и коммерческими запасными частями  
		|	И НЕ смартОтчетПоГарантииМимаки.ДокументОснование = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка)
		//-- #1287 смарт: Лопато 20.06.2023
		|	И НЕ смартОтчетПоГарантииМимаки.ПометкаУдаления"); 
		Запрос.УстановитьПараметр("ДокументОснование",Объект.ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() ТОгда                                     
			ДокументОтчет=Выборка.ссылка;  
			Если (ДокументОтчет.ПричинаПоломки=ПредопределенноеЗначение("Перечисление.смартПричиныПоломки.HeadNozzle") 
				ИЛИ ДокументОтчет.ПричинаПоломки=ПредопределенноеЗначение("Перечисление.смартПричиныПоломки.PrintQuality")) И ДокументОтчет.Чернила.Количество()=0 Тогда
				Сообщить("Необходимо заполнить чернила в отчете МИМАКИ!");
				Отказ=Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДокументОтчет.ДатаПроблемы) Тогда
				Сообщить("Необходимо заполнить дату проблемы в отчете МИМАКИ!");
				Отказ=Истина;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДокументОтчет.Оборудование) Тогда
				Сообщить("Необходимо заполнить оборудование в отчете МИМАКИ!");
				Отказ=Истина;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДокументОтчет.ОписаниеПроблемы) Тогда
				Сообщить("Необходимо заполнить описание проблемы в отчете МИМАКИ!");
				Отказ=Истина;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДокументОтчет.ОписаниеУстраненияПроблемы) Тогда
				Сообщить("Необходимо заполнить описание устранения проблемы в отчете МИМАКИ!");
				Отказ=Истина;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДокументОтчет.Серия) Тогда
				Сообщить("Необходимо заполнить серию в отчете МИМАКИ!");
				Отказ=Истина;
			КонецЕсли;
			НетФайлов=Ложь;
			Если НЕ ЗначениеЗаполнено(ДокументОтчет.ФотоОборудования) 
				ИЛИ НЕ ЗначениеЗаполнено(ДокументОтчет.ФотоШильдаОборудования) 
				ИЛИ НЕ ЗначениеЗаполнено(ДокументОтчет.ParametersПослеИнсталяции) Тогда 
				НетФайлов=Истина;
				Отказ=Истина;	
			КонецЕсли;	
			Если НЕ Лев(ДокументОтчет.Серия.Номер,2)="CG" Тогда
				Если НЕ ЗначениеЗаполнено(ДокументОтчет.LogПослеИнсталяции) Тогда 
					НетФайлов=Истина;
					Отказ=Истина;	
				КонецЕсли;
			КонецЕсли;
			Если НетФайлов ТОгда
				Сообщить("Не заполнены файлы в отчете МИМАКИ!");
			КонецЕсли;	
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
		//++ #4410 смарт: Тимофеева 29.09.2025 / Заявка на гарантийный ремонт. Issue report.
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен отчет Мимаки", Объект.Ссылка, "ОтчетМимаки",, Отказ);	
		//-- #4410 смарт: Тимофеева 29.09.2025	
		КонецЕсли;
	КонецЕсли;
	//-- #1287 смарт: Фролов 24.04.2023
	
	//++ #Б-1498 смарт: Фролов 13.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
	Если Объект.Дата > Дата("20241219") Тогда
		
		Если НЕ Объект.Ссылка.Пустая() Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Ссылка КАК Ссылка,
			|	Наименование КАК Наименование
			|ИЗ
			|	Справочник.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы
			|ГДЕ
			|	ВладелецФайла = &ВладелецФайла
			|	И НазначениеФайла = ЗНАЧЕНИЕ(Перечисление.смартНазначенияФайлов.ПустаяСсылка)
			|	И НЕ ПометкаУдаления");
			Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОбщегоНазначения.СообщитьПользователю("У приложенного файла " + Выборка.Наименование + " не заполнено Назначение файла, запись документа не возможна!");
				Отказ = Истина;
				
			КонецЦикла;	
			
		КонецЕсли;
	
	КонецЕсли;
	//-- #Б-1498 смарт: Фролов 13.12.2024

	// ++ 16.12.2020
	Если НЕ Отказ Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СтрокиИнженераГдеМенялосьКоличество", СтрокиИнженераГдеМенялосьКоличество);
	КонецЕсли;
	
	//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
	Если НЕ Отказ Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СписатьТовар", СписатьТовар);
	КонецЕсли;
	//-- #Б1610 смарт: Шляпников 09.12.2024
	
КонецПроцедуры

&НаКлиенте
Процедура СдатьНаСклад(Команда)
       
    Если НЕ ЗначениеЗаполнено(Объект.СкладГарантийныхЗапчастей) Тогда
    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан склад гарантийных запчастей. Документ ""Заказ на перемещение"" не создан!", Объект.Ссылка, "СкладГарантийныхЗапчастей");
    	Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(Объект.СкладИнженера) Тогда
    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан склад инженера. Документ ""Заказ на перемещение"" не создан!", Объект.Ссылка, "СкладИнженера",);
    	Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана организация. Документ ""Заказ на перемещение"" не создан!", Объект.Ссылка, "Организация");
    	Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(Префикс) Тогда
    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен префикс Поставщика!", Объект.Ссылка, "Префикс");
    	Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ВнешнийНомер) Тогда
    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен номер документа!", Объект.Ссылка, "ВнешнийНомер");
    	Возврат;
    КонецЕсли;
    
      //++ смарт:ПА #874 27.01.2022 14:20:22
    Если ЗначениеЗаполнено(Объект.СкладИнженера) И ЗначениеЗаполнено(Объект.Ответственный) И Строка(Объект.СкладИнженера)<>Строка(Объект.Ответственный) Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Т.к. Ответственный не соотвествует Складу инженера, возможно нет доступа к созданию документов Заказ на перемещение!", Объект.Ссылка, "СкладИнженера");
    КонецЕсли; 
    //-- смарт:ПА #874 27.01.2022 14:20:22

    // ++ 31.03.2021
    //// 10.08.2020
    //// Вопрос перед созданием ввода начальных остатков
    //НеобходимВводНачальныхОстатков = Ложь;
    //
    //Для Каждого ТекСтрока Из Объект.ЗаполняетсяИнженером Цикл
    //	
    //	//rnp+ 18.02.2021 добавлена проверка на заполненность, иначе получалась ситуация, когда документы перемещения и ввода остатков создавались, а заявка не записывалась из-за ошибки заполнения
    //	Если ЗначениеЗаполнено(ТекСтрока.НоменклатураУстановленнаяКлиенту) И Не ЗначениеЗаполнено(ТекСтрока.ДокументПолученияЗапчасти) Тогда
    //		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + (ТекСтрока.НомерСтроки) + " таблицы ""Заполняется инженером"" не заполнен документ получения запчасти");
    //		Возврат;
    //	КонецЕсли;
    //	//rnp- 18.02.2021
    //	
    //	Если ЗначениеЗаполнено(ТекСтрока.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
    //		Продолжить;
    //	КонецЕсли;
    //	
    //	Если ЗначениеЗаполнено(ТекСтрока.НоменклатураУстановленнаяКлиенту) Тогда
    //		Продолжить;
    //	КонецЕсли;
    //	
    //	// 02.11.2020
    //	Если НЕ ТекСтрока.ЗапчастьОтКлиентаПринял Тогда
    //		Продолжить;
    //	КонецЕсли;
    //	// --
    //	
    //	НеобходимВводНачальныхОстатков = Истина;
    //	//Прервать; //rnp закомментировала, т.к. добавлена проверка на заполненность, надо чтобы обработалась вся табл.часть
    //	
    //КонецЦикла;
    // --
    
    // ++ 22.03.2021 - Убрать предупреждение
    //Если НеобходимВводНачальныхОстатков Тогда
    //	
    //	Оповещение = Новый ОписаниеОповещения("ВопросПередВводомОстатковЗавершение", ЭтотОбъект, );
    //	ТекстВопроса = НСтр("ru = 'Убедитесь, что заполнение запчастей произведено корректно: "
    //	+ "запчасть не устанавливалась клиенту, но была принята от него на ремонт. " 
    //	+ "При нажатии ОК запчасть будет оприходована на инженера и перемещена на склад гарантийных запчастей. "
    //	+ "Если Вы ошиблись - нажмите Отмена.'");
    //	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК);

    //Иначе
    // --
    	ПродолжитьСдатьНаСкладКлиент();
    // ++ 22.03.2021	
    //КонецЕсли;
    //
    		
КонецПроцедуры

// ++ 10.08.2020
&НаКлиенте
Процедура ПродолжитьСдатьНаСкладКлиент()  
    
	//++ смарт:Подкин #939 24.03.2022 12:47:41
    Если Параметры.Ключ.Пустая() ИЛИ ЭтотОбъект.Модифицированность Тогда
	//-- смарт:Подкин #939 24.03.2022 12:47:41	
    
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаписьюЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Перед созданием ""Заказа на перемещение"" необходимо записать текущий документ. Записать?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
    						
    Иначе
    	//СдатьНаСкладСервер();
    	СдатьНаСкладКлиент();
    КонецЕсли;
    

КонецПроцедуры
   
// ++ 10.08.2020
&НаКлиенте
Процедура ВопросПередВводомОстатковЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда	
		
		//СдатьНаСкладСервер();
		СдатьНаСкладКлиент();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаписьюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		//СдатьНаСкладСервер();
		СдатьНаСкладКлиент();
	
	КонецЕсли;
	
КонецПроцедуры

// ++ 21.11.2020
&НаКлиенте
Процедура СдатьНаСкладКлиент() 
	
	ЗаказНаПеремещение = СдатьНаСкладСервер();
	
	Если ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
		ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпециалистПоПретензиям(Команда)
	
	// ++ 13.06.2020
	Возврат;
	// --
	
	// ++ 08.04.2020
	//Если Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() > 0 Тогда
	//	ПоказатьПредупреждение(, "Табличная часть не пустая. Заполнение невозможно.");
	//	Возврат;
	//КонецЕсли;
	
	Если Объект.ЗаполняетсяИнженером.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Предварительно необходимо заполнить данные от инженера. Заполнение невозможно.");
		Возврат;
	КонецЕсли;
	
	// ++ 08.04.2020
	//Если НЕ ЗначениеЗаполнено(Объект.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
	//	ПоказатьПредупреждение(, "По данной заявке еще не создан документ ""Заказ на перемещение"". Заполнение невозможно.");
	//	Возврат;
	//КонецЕсли;

	// Проверка наличия документав "Заказ на перемещение" по запчастям со страницы инженера
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗаказНаПеремещениеЗапчастейСИнженера", ПредопределенноеЗначение("Документ.ЗаказНаПеремещение.ПустаяСсылка"));
	
	НайденныеСтроки = Объект.ЗаполняетсяИнженером.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		// Есть строки с незаполненными Заказами на перемещение
		ПоказатьПредупреждение(, "По данной заявке еще не создан документ(ы) ""Заказ на перемещение"". Заполнение невозможно.");
		Возврат;
	КонецЕсли;	
	// --
	
	ДокументОприходования = Неопределено;
	//
	//СтатусОприходованияЗапчастейНаСкладГарантия = ПолучитьСтатусОприходования(Объект.ЗаказНаПеремещениеЗапчастейСИнженера, ДокументОприходования);
	НеОбработанныйЗаказНаПеремещениеЗапчастейСИнженера = ПолучитьНеОбработанныйЗаказНаПеремещениеЗапчастейСИнженера();
	
	Если НЕ ЗначениеЗаполнено(НеОбработанныйЗаказНаПеремещениеЗапчастейСИнженера) Тогда
		// Что-то пошло не так - сюда попадать не должно (не сработали проверки ранее)
		СтатусОприходованияЗапчастейНаСкладГарантия = "НеОприходованы";
	Иначе
		СтатусОприходованияЗапчастейНаСкладГарантия = ПолучитьСтатусОприходования(НеОбработанныйЗаказНаПеремещениеЗапчастейСИнженера, ДокументОприходования);	
	КонецЕсли;

	Если СтатусОприходованияЗапчастейНаСкладГарантия = "Оприходованы" Тогда
		
		ЗаполнитьТаблицуСпециалистаПоПретензиям(ДокументОприходования);
		
		Модифицированность = Истина;
		
		Если Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() > 0 Тогда
			
			Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущаяСтрока = Объект.ЗаполняетсяСпециалистомПоПретензиям[0].ПолучитьИдентификатор();
			
		КонецЕсли;
				
	Иначе
		
		Если СтатусОприходованияЗапчастейНаСкладГарантия = "ОприходованыЧастично" Тогда
			ТекстСообщения = "По данной заявке не все товары оприходованы на склад " + Объект.СкладГарантийныхЗапчастей + ". Заполнение невозможно.";
		ИначеЕсли СтатусОприходованияЗапчастейНаСкладГарантия = "НеОприходованы" Тогда
			ТекстСообщения = "По данной заявке товары не оприходованы на склад " + Объект.СкладГарантийныхЗапчастей + ". Заполнение невозможно.";			
		КонецЕсли;
		
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

// ++ 08.04.2020
&НаСервере
Функция ПолучитьНеОбработанныйЗаказНаПеремещениеЗапчастейСИнженера()
	
	МассивОбработанныхСтрокИнженера = Новый Массив;
	
	Для Каждого Строка Из Объект.ЗаполняетсяСпециалистомПоПретензиям Цикл
		Если МассивОбработанныхСтрокИнженера.Найти(Строка.ИДСтрокиЗаполняетсяИнженером) = Неопределено  Тогда
			МассивОбработанныхСтрокИнженера.Добавить(Строка.ИДСтрокиЗаполняетсяИнженером);
		КонецЕсли;
	КонецЦикла;
	
	// Подразумевается, что необработанный заказ на перемещение всегда один (первый подходящий по ИД строки)
	Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
		Если МассивОбработанныхСтрокИнженера.Найти(СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером) = Неопределено Тогда
			Возврат СтрокаИнженер.ЗаказНаПеремещениеЗапчастейСИнженера;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Документы.ЗаказНаПеремещение.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	СтатусОжидаютсяДействия = Неопределено;
	// 08.04.2020
	//ОбновитьСтатусНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.НомерПозиции, СтатусОжидаютсяДействия);
	ОбновитьСтатусНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.НомерПозиции, СтатусОжидаютсяДействия, ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером);
	
	Если ЗначениеЗаполнено(СтатусОжидаютсяДействия) Тогда
		ТекущиеДанные.Статус = СтатусОжидаютсяДействия;
		НастроитьВидимостьДоступностьЭлементовПоСтатусу(ТекущиеДанные.Статус, ТекущиеДанные.НомерПозиции);
		
		// 06.04.2020
		ЗаполнитьЗависимыеОтСтатусаКолонки(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	//++ #1852 смарт: Шляпников 15.01.2025 / Подбор документа поступления в Заявку на гарантийный ремонт. Доработка алгоритма.
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ПоступлениеТоваровНаСклад.Форма.ФормаВыбора" Тогда
		
		Объект.ДокументПриобретения = ВыбранноеЗначение; 
		
		НастроитьВидимостьДоступность();
	//-- #1852 смарт: Шляпников 15.01.2025
		
		//++ #1963 смарт: Мосолов 26.08.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаВыбора" Тогда
		
		Объект.ДокументПриобретения = ВыбранноеЗначение; 
		
		НастроитьВидимостьДоступность();
		//-- #1963 смарт: Мосолов 26.08.2024   
 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямСтатусПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	// ++ 29.08.2020
	Отказ = Ложь;
	ПроверитьВозможностьУстановкиСтатуса(ТекущиеДанные.Статус, ТекущиеДанные.НомерПозиции, ТекущиеДанные.Номенклатура, Отказ);
	Если Отказ Тогда
		ТекущиеДанные.Статус = ПредыдущийСтатусОтправкиПоСтроке;
		Возврат;
	КонецЕсли;
	
	НомерПозиции = ТекущиеДанные.НомерПозиции;
	
	ДобавитьСтрокуСоСтатусомНаСервере(НомерПозиции, ТекущиеДанные.Статус);	
	
	НастроитьВидимостьДоступностьЭлементовПоСтатусу(ТекущиеДанные.Статус, НомерПозиции);
	НастроитьВидимостьКолонокКомпенсации();
	ЗаполнитьЗависимыеОтСтатусаКолонки(ТекущиеДанные);
	
	УстановитьСтатусЗакрытаЕслиВозможно(ТекущиеДанные.Статус);
	
КонецПроцедуры

// ++ 30.10.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямСтатусПолученияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	НомерПозиции = ТекущиеДанные.НомерПозиции;
	
	//++ #Б-2672 смарт: Лопато 14.03.2025 //Неверный статус в информационном поле, при ручном изменении статуса в табличной части ГЗ  
	ДобавитьСтрокуСоСтатусомНаСервере(НомерПозиции, ТекущиеДанные.СтатусПолучения);
	//-- #Б-2672 смарт: Лопато 14.03.2025
	
КонецПроцедуры

// 29.08.2020
&НаКлиенте
Процедура ПроверитьВозможностьУстановкиСтатуса(Статус, НомерПозиции, Запчасть, Отказ)
	
	Отказ = Ложь;
	
	// 29.10.2020
	Если НЕ РольДоступнаСервер("ПолныеПрава") Тогда
		Если ПредыдущийСтатусОтправкиПоСтроке = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.НечемЗаменить") Тогда // Не отправлена
			МассивЗапрещенныхСтатусов = Новый Массив;
			МассивЗапрещенныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтгрузкаНеТребуется")); // Отгрузка не требуется, списать
			МассивЗапрещенныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ВГарантииОтказано"));  // Списать по служебной записке 
			МассивЗапрещенныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Списано"));
			МассивЗапрещенныхСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Отправлено"));
			
			Если МассивЗапрещенныхСтатусов.Найти(Статус) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запчасть " + Запчасть + " еще не принята на склад");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	//--
	
	// ++ 22.03.2021
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтатусовСписано = Новый Массив;
	МассивСтатусовСписано.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтгрузкаНеТребуется")); // Отгрузка не требуется, списать
	МассивСтатусовСписано.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтгрузкаНеТребуетсяНедовложение")); // ОтгрузкаНеТребуетсяНедовложение
	МассивСтатусовСписано.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ВГарантииОтказано")); // Списать по служебной записке
	МассивСтатусовСписано.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Списано"));
	
	Если МассивСтатусовСписано.Найти(ПредыдущийСтатусОтправкиПоСтроке) <> Неопределено 
		И Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка") Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запчасть " + Запчасть + " уже списана!" );
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	Если (ПредыдущийСтатусОтправкиПоСтроке = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка")
		ИЛИ ПредыдущийСтатусОтправкиПоСтроке = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтправленоПоставщику")) // Передано со склада для отправки
		И МассивСтатусовСписано.Найти(Статус) <> Неопределено		
		Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для изменения статуса следует сначала отменить отправку, используйте кнопку ""Отменить отправку"" в заявке");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// --
	
	Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОплаченоКлиентомИнженером") Тогда
		
		// Проверка, что по запчасти нет статусов списания - ОтгрузкаНеТребуется или ВГарантииОтказано, 
		// не разрешать выбирать статус "Оплачено"
		
		МассивСтатусовДляПроверки = Новый Массив;
		МассивСтатусовДляПроверки.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтгрузкаНеТребуется"));
		МассивСтатусовДляПроверки.Добавить(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ВГарантииОтказано"));
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", НомерПозиции);
		СтрокиСтатусыПоЗапчасти = Объект.Статусы.НайтиСтроки(Отбор);
		
		СинонимСтатуса = "";
		ВИсторииЕстьСтатусИзПроверямых = Ложь;
		
		Для Каждого СтрокаСтатус Из СтрокиСтатусыПоЗапчасти Цикл
			Если МассивСтатусовДляПроверки.Найти(СтрокаСтатус.Статус) <> Неопределено Тогда
				ВИсторииЕстьСтатусИзПроверямых = Истина;
				СинонимСтатуса = СтрокаСтатус.Статус;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВИсторииЕстьСтатусИзПроверямых Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По запчасти " + Запчасть + " уже был установлен статус списания " + СинонимСтатуса);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ++ 26.12.2020 
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямВозвратНеиспользованнойЗапчастиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ВозвратНеиспользованнойЗапчасти Тогда
			ТекстОстатокНаСкладах = СформироватьТекстОстатокНаСкладах(ТекущиеДанные.Номенклатура);
			ПоказатьПредупреждение(, "Укажите нужный склад в колонке ""со склада""!" + Символы.ПС + ТекстОстатокНаСкладах);		
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры 

// ++ 26.12.2020 
&НаСервере
Функция СформироватьТекстОстатокНаСкладах(Номенклатура, МассивСкладов = Неопределено, КоличествоДляВключенияВСписокСкладов = 1, ОтборСкладовПоРЛС = Ложь)
	
	Если МассивСкладов = Неопределено Тогда
		МассивСкладов = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		|	Таблица.смартВНаличииГарантийныеОстаток КАК ВНаличии,
		|	Таблица.смартВРезервеСоСкладаГарантийныеОстаток КАК ВРезервеСоСклада,
		|	Таблица.смартВРезервеПодЗаказГарантийныеОстаток КАК ВРезервеПодЗаказ,
		//-- #Б1610 смарт: Шляпников 09.12.2024
		|	0 КАК КОтгрузке
		|ПОМЕСТИТЬ ВТ_Набор
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(, Номенклатура = &Номенклатура) КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Склад,
		|	Таблица.КОтгрузкеОстаток,
		|	0,
		|	0,
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		|	Таблица.смартКОтгрузкеГарантийныеОстаток
		//-- #Б1610 смарт: Шляпников 09.12.2024
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Номенклатура = &Номенклатура) КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Набор.Номенклатура КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад КАК Склад,
		|	СУММА(Набор.ВНаличии) КАК ВНаличии,
		|	СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
		|	СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
		|	СУММА(Набор.КОтгрузке) КАК КОтгрузке
		|ПОМЕСТИТЬ ВтСвободныеОстатки
		|ИЗ
		|	ВТ_Набор КАК Набор
		|
		|СГРУППИРОВАТЬ ПО
		|	Набор.Номенклатура,
		|	Набор.Характеристика,
		|	Набор.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.ВНаличии КАК ВНаличии,
		|	0 КАК ПриходОсновной,
		|	Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
		|	Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
		|	0 КАК ВРезервеГрафика,
		|	Таблица.КОтгрузке КАК КОтгрузке,
		|	Таблица.ВРезервеСоСклада КАК ВРезервеСоСклада,
		|	Таблица.ВРезервеПодЗаказ КАК ВРезервеПодЗаказ
		|ПОМЕСТИТЬ ВТ_Набор2
		|ИЗ
		|	ВтСвободныеОстатки КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Склад,
		|	0,
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		|	Таблица.смартКоличествоИзЗаказовГарантийныеОстаток,
		//-- #Б1610 смарт: Шляпников 09.12.2024
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, Номенклатура = &Номенклатура) КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Склад,
		|	0,
		|	0,
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		|	Таблица.смартКоличествоИзЗаказовГарантийныеОстаток,
		//-- #Б1610 смарт: Шляпников 09.12.2024
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(, Номенклатура = &Номенклатура) КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Склад,
		|	0,
		|	0,
		|	0,
		|	0,
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		|	- Таблица.смартКоличествоГарантийные,
		//-- #Б1610 смарт: Шляпников 09.12.2024
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Таблица
		|ГДЕ
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		|	( Таблица.смартКоличествоГарантийные < 0 )
		//-- #Б1610 смарт: Шляпников 09.12.2024
		|	И Таблица.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
		|	И Таблица.Номенклатура = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Набор.Номенклатура КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад КАК Склад,
		|	МАКСИМУМ(Набор.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаХранения,
		|	МАКСИМУМ(Набор.Номенклатура.ЕдиницаДляОтчетов) КАК ЕдиницаДляОтчетов,
		|	МАКСИМУМ(Набор.Номенклатура.КоэффициентЕдиницыДляОтчетов) КАК КоэффициентЕдиницыДляОтчетов,
		|	СУММА(Набор.ВНаличии) КАК ВНаличии,
		|	СУММА(Набор.ПриходОсновной) КАК ПриходОсновной,
		|	СУММА(Набор.РасходОсновной) КАК РасходОсновной,
		|	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) КАК ВРезервеСоСкладаИПодЗаказ,
		|	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика) КАК ВРезерве,
		|	СУММА(Набор.КОтгрузке) КАК Котгрузке,
		|	СУММА(Набор.ВНаличии) - СУММА(Набор.КОтгрузке) - СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) - СУММА(Набор.ВРезервеГрафика) КАК Доступно,
		|	Набор.Номенклатура.ЕдиницаДляОтчетов КАК НоменклатураЕдиницаДляОтчетов,
		|	Набор.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	Набор.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	Набор.Склад.Наименование КАК СкладНаименование,
		|	Набор.Характеристика.Наименование КАК ХарактеристикаНаименование,
		|	СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
		|	СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
		|	СУММА(Набор.ВРезервеГрафика) КАК ВРезервеГрафика
		|ПОМЕСТИТЬ ВТ_ОстаткиПоСкладам
		|ИЗ
		|	ВТ_Набор2 КАК Набор
		|
		|СГРУППИРОВАТЬ ПО
		|	Набор.Номенклатура,
		|	Набор.Характеристика,
		|	Набор.Склад,
		|	Набор.Номенклатура.ЕдиницаДляОтчетов,
		|	Набор.Номенклатура.ЕдиницаИзмерения,
		|	Набор.Номенклатура.Наименование,
		|	Набор.Склад.Наименование,
		|	Набор.Характеристика.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиПоСкладам.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_ОстаткиПоСкладам.Доступно) КАК Доступно,
		|	СУММА(ВТ_ОстаткиПоСкладам.ВРезерве) КАК ВРезерве,
		|	СУММА(ВТ_ОстаткиПоСкладам.ВРезервеСоСклада) КАК ВРезервеСоСклада,
		|	СУММА(ВТ_ОстаткиПоСкладам.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
		|	СУММА(ВТ_ОстаткиПоСкладам.ВРезервеГрафика) КАК ВРезервеГрафика,
		|	СУММА(ВТ_ОстаткиПоСкладам.ПриходОсновной) КАК ПриходОсновной,
		|	ВТ_ОстаткиПоСкладам.НоменклатураЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	ВТ_ОстаткиПоСкладам.Склад КАК Склад
		|ИЗ
		|	ВТ_ОстаткиПоСкладам КАК ВТ_ОстаткиПоСкладам
		// ++ 23.02.2021
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборСкладовПоРЛС
		|				ТОГДА ВТ_ОстаткиПоСкладам.Склад В (&ДоступныеСклады)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		// --
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиПоСкладам.Номенклатура,
		|	ВТ_ОстаткиПоСкладам.НоменклатураЕдиницаИзмерения,
		|	ВТ_ОстаткиПоСкладам.Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	// ++ 23.02.2021
	Если РольДоступна("ПолныеПрава") Тогда
		ОтборСкладовПоРЛС = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОтборСкладовПоРЛС", ОтборСкладовПоРЛС);
	МассивДоступныхПоРЛССкладов = Новый Массив;
	Если ОтборСкладовПоРЛС Тогда
		Если РольДоступна("смартИнженер") 
			И НЕ РольДоступна("ПолныеПрава") Тогда
			МассивДоступныхПоРЛССкладов = ПолучитьМассивДоступныхСкладов();
			//rnp 16.06.2021
			ИндексСвоегоСклада = МассивДоступныхПоРЛССкладов.Найти(Объект.СкладИнженера);
			Если Не ИндексСвоегоСклада = Неопределено  Тогда 
				МассивДоступныхПоРЛССкладов.Удалить(ИндексСвоегоСклада);
			КонецЕсли;
			//
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДоступныеСклады", МассивДоступныхПоРЛССкладов);
	// --
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстИтог = "Остаток на складах:";
	Пока Выборка.Следующий() Цикл
		
		Доступно =  Выборка.Доступно; 
		
		Если Доступно <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстИтог = ТекстИтог + Символы.ПС + Выборка.Склад + ": " + Доступно;
		
		//++ смарт:ММ #044 224 12.01.2021 - Заявка на гарантийный ремонт 
		Если Доступно >= КоличествоДляВключенияВСписокСкладов Тогда
			Если МассивСкладов.Найти(Выборка.Склад) = Неопределено Тогда
				МассивСкладов.Добавить(Выборка.Склад);
			КонецЕсли;
		КонецЕсли;		
		//-- смарт:ММ 12.01.2021
		
	КонецЦикла;
	
	Возврат ТекстИтог;
	
КонецФункции 

// ++ 23.02.20221
&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхСкладов()
	
	МассивРезультат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
	|ПОМЕСТИТЬ ВТ_ГруппаДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь
	|	И ГруппыДоступаПользователи.Ссылка.Профиль = &Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппаДоступа.ГруппаДоступа КАК ГруппаДоступа,
	|	ГруппыДоступаВидыДоступа.ВсеРазрешены КАК ВсеРазрешены,
	|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа КАК ЗначениеДоступа
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ВТ_ГруппаДоступа КАК ВТ_ГруппаДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ВидыДоступа КАК ГруппыДоступаВидыДоступа
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	|			ПО ГруппыДоступаВидыДоступа.Ссылка = ГруппыДоступаЗначенияДоступа.Ссылка
	|				И ГруппыДоступаВидыДоступа.ВидДоступа = ГруппыДоступаЗначенияДоступа.ВидДоступа
	|		ПО ВТ_ГруппаДоступа.ГруппаДоступа = ГруппыДоступаВидыДоступа.Ссылка
	|			И (ГруппыДоступаВидыДоступа.ВидДоступа ССЫЛКА Справочник.Склады)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ЗначениеДоступа КАК ЗначениеДоступа
	|ПОМЕСТИТЬ ВТ_ДоступныеСклады
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	ВременнаяТаблица.ВсеРазрешены = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ЗначениеДоступа КАК ЗначениеДоступа
	|ПОМЕСТИТЬ ВТ_ЗапрещенныеСклады
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	ВременнаяТаблица.ВсеРазрешены = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоступныеСклады.ЗначениеДоступа КАК Ссылка
	|ИЗ
	|	ВТ_ДоступныеСклады КАК ВТ_ДоступныеСклады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Склады.Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапрещенныеСклады КАК ВТ_ЗапрещенныеСклады
	|		ПО (ВТ_ЗапрещенныеСклады.ЗначениеДоступа = Склады.Ссылка)
	|ГДЕ
	|	ВТ_ЗапрещенныеСклады.ЗначениеДоступа ЕСТЬ NULL
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1
	|			ИЗ
	|				ВТ_ЗапрещенныеСклады КАК ВТ_ЗапрещенныеСклады)";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Настройка = Справочники.смартПредопределенныеЗначения.ПрофильГруппыДоступаПраваИнженераСвойСклад;
	ПрофильПраваИнженераСвойСклад = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
	
	Если НЕ ЗначениеЗаполнено(ПрофильПраваИнженераСвойСклад) Тогда
		Возврат МассивРезультат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Профиль", ПрофильПраваИнженераСвойСклад);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
		
	МассивРезультат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивРезультат;
	
КонецФункции

// ++ 29.10.2020
&НаСервереБезКонтекста
Функция РольДоступнаСервер(ИмяРоли)
	Возврат РольДоступна(ИмяРоли);	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуСоСтатусомНаСервере(НомерПозиции, Статус)
	
	//++ смарт:ММ #025 137 24.03.2020 
	// Если в последней строке по НомеруПозиции не заполнен документ, то новая строка не добавляется, а меняется статус в последней
	// Исключение: если последняя строка со статусом "Нечем заменить", то документ всегда не заполнен и добвляется новая строка для нового статуса
	
	//++ 30.10.2020
	// Если последний статус ПолученоОтПоставщика и при этом в текущей строке установлен флаг ПрямаяПоставка,
	// то ДокументДвижения тоже может быть не заполнен и необхоидмо добавлять новую строку
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерПозиции", НомерПозиции);	
	НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
	
	ДобавитьНовуюСтроку = Истина;
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ПоследняяСтрока = НайденныеСтроки[НайденныеСтроки.Количество() - 1];
		Если ПоследняяСтрока.Статус <> Перечисления.смартСтатусыПоГарантии.НечемЗаменить Тогда
			
			//++ смарт:ММ 31.10.2020
			ПроверятьНаличиеДокументаДвижения = Истина;
			Если ПоследняяСтрока.Статус = Перечисления.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика Тогда
				НайденныеСтрокиСпециалист = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
				Если НайденныеСтрокиСпециалист[0].ПрямаяПоставка Тогда
					ПроверятьНаличиеДокументаДвижения = Ложь;
				КонецЕсли;				
			КонецЕсли;
			
			Если ПроверятьНаличиеДокументаДвижения Тогда
			//-- смарт:ММ 31.10.2020
			
			Если НЕ ЗначениеЗаполнено(ПоследняяСтрока.ДокументДвижения) Тогда
				ДобавитьНовуюСтроку = Ложь;
				НоваяСтрокаСтатус = ПоследняяСтрока;
			КонецЕсли;
			
			//++ смарт:ММ 31.10.2020
			КонецЕсли;
			//-- смарт:ММ 31.10.2020
		КонецЕсли;
	КонецЕсли;	
	
	// ++ 16.08.2020
	// Если уже есть один из статусов ОтгрузкаНеТребуется ИЛИ ВГарантииОтказано, 
	// то просто заменить статус, новую строку со статусом не добавлять
	
	МассивСтатусовСписания = Новый Массив;
	МассивСтатусовСписания.Добавить(Перечисления.смартСтатусыПоГарантии.ОтгрузкаНеТребуется);
	МассивСтатусовСписания.Добавить(Перечисления.смартСтатусыПоГарантии.ВГарантииОтказано);
	
	Если МассивСтатусовСписания.Найти(Статус) <> Неопределено Тогда
		Для Каждого Строка Из НайденныеСтроки Цикл
			Если МассивСтатусовСписания.Найти(Строка.Статус) <> Неопределено Тогда
				ДобавитьНовуюСтроку = Ложь;
				НоваяСтрокаСтатус = Строка;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	// --
	
	Если ДобавитьНовуюСтроку Тогда	
		НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(Объект, НомерПозиции, Статус); 
	КонецЕсли;
	
	НоваяСтрокаСтатус.НомерПозиции 			= НомерПозиции;
	НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ТекущаяДата();
	НоваяСтрокаСтатус.Статус 					= Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ ЕстьПолныеПрава() Тогда
		
		// ++ 05.11.2020
		ДокументДвижения = Неопределено;
		
		Если Поле.Имя = "СтатусыДокументДвиженияДоп" Тогда
			ДокументДвижения = Элемент.ТекущиеДанные.ДокументДвиженияДоп;
		Иначе
		// --
		ДокументДвижения = Элемент.ТекущиеДанные.ДокументДвижения;
		
		// ++ 05.11.2020
		КонецЕсли;
		// --
		Если ЗначениеЗаполнено(ДокументДвижения) Тогда
			ПоказатьЗначение(, ДокументДвижения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// ++ 29.08.2020
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	ПредыдущийСтатусОтправкиПоСтроке = ТекущиеДанные.Статус;
	// --
	
	// 30.05.2021
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// ++ 08.04.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

// ++ 08.04.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекСтрока = Элемент.ТекущиеДанные; 
		// ++ 27.01.2021
		Если ТекСтрока.ИДСтрокиЗаполняетсяИнженером = 0 ИЛИ Копирование Тогда
		// --
			ТекСтрока.ИДСтрокиЗаполняетсяИнженером = ПолучитьСледующийИДСтроки(); 
		КонецЕсли;
		
		//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
		Если Копирование Тогда

			Если ТекСтрока <> Неопределено Тогда
				ТекСтрока.ЗаказНаПеремещениеЗапчастейСИнженера = Неопределено;
				ТекСтрока.ДокументРазборки = Неопределено;
				ТекСтрока.ДокументПолученияЗапчасти = Неопределено;
				ТекСтрока.ДокументВводОстатков = Неопределено;
				ТекСтрока.ДокументЗаказНаВнутреннееПотребление = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		//-- смарт:ММ 08.08.2021
	
	КонецЕсли;
		
КонецПроцедуры

// ++ 26.04.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Отказ = Истина;
	
КонецПроцедуры

// ++ 25.10.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаполняетсяИнженеромНоменклатура" Тогда 
		Если Элементы.ЗаполняетсяИнженеромНоменклатура.ТолькоПросмотр = Ложь Тогда
			ТекущиеДанные = Элемент.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				Если НЕ ЗапчастьЕщеНеОтправлялась(ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером) Тогда
					СтандартнаяОбработка = Ложь;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запчасть уже отправлена, изменение невозможно");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	// ++ 28.10.2020
	ИначеЕсли Поле.Имя = "ЗаполняетсяИнженеромЗаказНаПеремещениеЗапчастейСИнженера" Тогда 
		Если Элементы.ЗаполняетсяИнженеромЗаказНаПеремещениеЗапчастейСИнженера.ТолькоПросмотр = Истина Тогда		
			ТекущиеДанные = Элемент.ТекущиеДанные;
			Если ЗначениеЗаполнено(ТекущиеДанные.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
				ПоказатьЗначение(,ТекущиеДанные.ЗаказНаПеремещениеЗапчастейСИнженера);
			КонецЕсли;
		КонецЕсли;
	// --
	// ++ 28.01.2021
	ИначеЕсли Поле.Имя = "ЗаполняетсяИнженеромСклад" Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		// ++ 16.02.2021
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
			Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Истина;
		ИначеЕсли НЕ ТекущиеДанные.ЗаполняетсяСписокСкладов Тогда
			Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Истина;
		Иначе
			Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		Если ТекущиеДанные.СписокСкладовПУстой Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нет доступных складов для выбора");	
		КонецЕсли;
		
		//// ++ 10.02.2021
		//Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
		//	Если ТекущиеДанные.ЗаполняетсяСписокСкладов Тогда 
		//		//НастроитьКолонкуСкладНаКлиенте(ТекущиеДанные);
		//	Иначе
		//		Если ЗначениеЗаполнено(ТекущиеДанные.Склад) И ЕстьПолныеПрава() Тогда
		//			Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Ложь;
		//		Иначе
		//			// ++ 09.02.2021
		//			Если ТекущиеДанные.СписокСкладовПустой Тогда
		//				ОбщегоНазначенияКлиент.СообщитьПользователю("Нет доступных складов для выбора");
		//				Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Истина;
		//			Иначе
		//				Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Истина;
		//				// --
		//				
		//				ОбщегоНазначенияКлиент.СообщитьПользователю("Склад доступен для выбора только после нажатия на кнопку ""Взять на складе"" в случае, если на складе ""Гарантийные запчасти - не для продажи"" нет нужного количества, но оно есть на других складах");				
		//				// ++ 09.02.2021
		//			КонецЕсли;
		//			// --
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

// ++ 12.01.2021
&НаКлиенте
Процедура ЗаполняетсяИнженеромПриАктивизацииПоля(Элемент)
	
	//Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Истина;
	
	//ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	//
	//Если ТекущиеДанные <> Неопределено Тогда	
	//	// ++ 28.01.2021
	//	Если ТекущиеДанные.ЗаполняетсяСписокСкладов Тогда 
	//		НастроитьКолонкуСкладНаКлиенте(ТекущиеДанные);
	//	КонецЕсли;
	//	
	//	// ЗаполнитьСписокВыбораСкладВТаблицеИнженера(ТекущиеДанные.НоменклатураПринятаяОтКлиента, ТекущиеДанные.Количество, ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером);		
	//КонецЕсли;

КонецПроцедуры

// ++ 28.01.2021
&НаКлиенте
Процедура НастроитьКолонкуСкладНаКлиенте(ТекущиеДанные)
	
	//Если ТекущиеДанные.СкладыСОстатками.Количество() = 0 Тогда
	//	// Запрет тыкать		
	//Иначе
	//	Элементы.ЗаполняетсяИнженеромСклад.СписокВыбора.ЗагрузитьЗначения(ТекущиеДанные.СкладыСОстатками.ВыгрузитьЗначения());
	//	Элементы.ЗаполняетсяИнженеромСклад.ТолькоПросмотр = Ложь;
	//КонецЕсли;

КонецПроцедуры

// ++ 08.04.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямНомерОтправленияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ТекущаяСтрока = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерОтправления = ТекущаяСтрока.НомерОтправления;
	// 28.06.2020 - Каталог открывается и без заполненного номера отправления
	//Если НЕ ЗначениеЗаполнено(НомерОтправления) Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.КаталогФайлов) Тогда
		КаталогПоНомеру = ТекущаяСтрока.КаталогФайлов;
	Иначе
		// 28.06.2020
		Если ЗначениеЗаполнено(НомерОтправления) Тогда
		//
			КаталогПоНомеру = смартОбщегоНазначения.СформироватьПутьККаталогуГарантийныхЗапчастей(НомерОтправления, Объект.Дата);
			ТекущаяСтрока.КаталогФайлов = КаталогПоНомеру;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КаталогПоНомеру) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлКлиента = Новый Файл(КаталогПоНомеру);
	Если ФайлКлиента.Существует() Тогда	
		ЗапуститьПриложение(КаталогПоНомеру);
	Иначе 
		// 28.06.2020
		//ТекстСообщения = "Создайте каталог " + КаталогПоНомеру + " и разместите в нем необходимые файлы. После этого файлы будут доступны на просмотр";
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// ++ 08.04.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаполняетсяСпециалистомПоПретензиямНомерОтправления" Тогда
		
		ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			
			Статус = ТекущиеДанные.Статус;			
			Если Статус <> ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтправленоПоставщику") 
				// ++ 15.04.2020
				И Статус <> ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка") Тогда
				// --
				
				НомерОтправления = ТекущиеДанные.НомерОтправления;
				// 28.06.2020 - Каталог открывается и без заполненного номера отправления
				//Если НЕ ЗначениеЗаполнено(НомерОтправления) Тогда
				//	Возврат;
				//КонецЕсли;
				//
				
				Если ЗначениеЗаполнено(ТекущиеДанные.КаталогФайлов) Тогда
					КаталогПоНомеру = ТекущиеДанные.КаталогФайлов;
				Иначе
					// 28.06.2020
					Если ЗначениеЗаполнено(НомерОтправления) Тогда
					//
						КаталогПоНомеру = смартОбщегоНазначения.СформироватьПутьККаталогуГарантийныхЗапчастей(НомерОтправления, Объект.Дата);
						ТекущиеДанные.КаталогФайлов = КаталогПоНомеру;
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(КаталогПоНомеру) Тогда
					Возврат;
				КонецЕсли;
				
				ФайлКлиента = Новый Файл(КаталогПоНомеру);
				Если ФайлКлиента.Существует() Тогда	
					ЗапуститьПриложение(КаталогПоНомеру);
				// 28.06.2020
				//Иначе 
				//	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден каталог " + КаталогПоНомеру);
				//	ТекстСообщения = "Создайте каталог " + КаталогПоНомеру + " и разместите в нем необходимые файлы. После этого файлы будут доступны на просмотр";
				//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	// ++ 17.07.2020
	ИначеЕсли Поле.Имя = "ЗаполняетсяСпециалистомПоПретензиямДатаОтправления"
		ИЛИ Поле.Имя = "ЗаполняетсяСпециалистомПоПретензиямКаталогФайлов" Тогда
		
		ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено 
			И ЗначениеЗаполнено(ТекущиеДанные.ДатаОтправления) 
			И ЗначениеЗаполнено(ТекущиеДанные.КаталогФайлов) Тогда
			
			КаталогПоНомеру = ТекущиеДанные.КаталогФайлов;
			ФайлКлиента = Новый Файл(КаталогПоНомеру);
			Если ФайлКлиента.Существует() Тогда	
				ЗапуститьПриложение(КаталогПоНомеру);
			КонецЕсли;
				
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ЗаполняетсяСпециалистомПоПретензиямПримечание" Тогда
		
		ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, );
			ПоказатьВводСтроки(Оповещение, ТекущиеДанные.Примечание, "Примечание",, Истина);
		КонецЕсли;
	//
	КонецЕсли;
	
КонецПроцедуры

// ++ 17.07.2020
&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
	Если НЕ Строка = Неопределено Тогда
		
		ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			ТекущиеДанные.Примечание = Строка;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ++ 02.05.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямКаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
		
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	
	ДиалогВыбора.Заголовок 					= "Выбор каталога";
	ДиалогВыбора.ПредварительныйПросмотр	= Ложь;
	
	РезультатВыбора = ДиалогВыбора.Выбрать();
	
	Если РезультатВыбора Тогда
			
		ТекущиеДанные.КаталогФайлов = СокрЛП(ДиалогВыбора.Каталог);
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

// ++ 02.05.2020
&НаКлиенте
Процедура ПоказатьПутьКФайлам(Команда)
	
	Элементы.ЗаполняетсяСпециалистомПоПретензиямПоказатьПутьКФайлам.Пометка = НЕ Элементы.ЗаполняетсяСпециалистомПоПретензиямПоказатьПутьКФайлам.Пометка;
	Элементы.ЗаполняетсяСпециалистомПоПретензиямКаталогФайлов.Видимость = Элементы.ЗаполняетсяСпециалистомПоПретензиямПоказатьПутьКФайлам.Пометка; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтравитьПисьмо(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать документ");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать контрагента");
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВключитьВРассылку", Истина);
	НайденныеСтроки = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать запчасти для рассылки на закладке ""Заполняется специалистом по претензиям""");
		Возврат;
	Иначе
		МассивНомеровПозиций = Новый Массив;
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			МассивНомеровПозиций.Добавить(ТекСтрока.НомерПозиции);
		КонецЦикла;
		
		ОтравитьПисьмоНаСервере(МассивНомеровПозиций);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтравитьПисьмоНаСервере(МассивНомеровПозиций)
	
	ПараметрыСоответствие = Новый Соответствие;
	ПараметрыСоответствие.Вставить(Объект.Ссылка, МассивНомеровПозиций);
	МассивСообщений = Новый Массив;
	
	Успех = Документы.смартЗаявкаНаГарантийныйРемонт.ОтправитьПисьма(ПараметрыСоответствие, МассивСообщений);
	
	Для Каждого ТекСообщение Из МассивСообщений Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекСообщение);	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняетсяИнженеромНоменклатураУстановленнаяКлиентуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИдентификаторРедактируемойСтроки = Элементы.ЗаполняетсяИнженером.ТекущиеДанные.ПолучитьИдентификатор();
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'заявку на гарантийный ремонт'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", 		Объект.СкладИнженера);
	ПараметрыФормы.Вставить("Заголовок", 	ПараметрЗаголовок); 
    //++ смарт:ПА #832 п.14 24.12.2021 14:36:39
	ПараметрыФормы.Вставить("Дата", 		ТекущаяДата()); 
    //-- смарт:ПА #832 п.14 24.12.2021 14:36:39
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	ПараметрыФормы.Вставить("Документ", 	Объект.Ссылка);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

// ++ 16.02.2021
&НаКлиенте
Процедура ЗаполняетсяИнженеромСкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные.ЗаполняетсяСписокСкладов Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("смартСписокСкладов", ТекущиеДанные.СкладыСОстатками.ВыгрузитьЗначения());
		ФормаВыбора = ПолучитьФорму("Справочник.Склады.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ЗаполняетсяИнженеромСклад);
		ФормаВыбора.Открыть();
	КонецЕсли;
	
КонецПроцедуры


// ++ 28.06.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямДатаПолученияПоставщикомПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ДоставленоПоставщику");
		ДобавитьСтрокуСтатусаНаСервере(ТекущиеДанные.НомерПозиции, ТекущаяДата(), ТекущиеДанные.Статус);
	КонецЕсли;
	
КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямДатаПодтвержденияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ПоставщикПодтвердилПолучение");
		ДобавитьСтрокуСтатусаНаСервере(ТекущиеДанные.НомерПозиции, ТекущаяДата(), ТекущиеДанные.Статус);
	КонецЕсли;
	
КонецПроцедуры

// ++ 24.11.2020
&НаКлиенте
Процедура РазбитьСтрокуИнженер(Команда)
	
	ТаблицаФормы  = Элементы.ЗаполняетсяИнженером;
	ДанныеТаблицы = Объект.ЗаполняетсяИнженером;
	
	ПараметрыРазбиенияСтроки = Новый Структура;
	ПараметрыРазбиенияСтроки.Вставить("ИмяПоляКоличество", "Количество");
	ПараметрыРазбиенияСтроки.Вставить("Заголовок", НСтр("ru = 'Введите количество запчастей в новой строке'"));
	ПараметрыРазбиенияСтроки.Вставить("РазрешитьНулевоеКоличество", Истина);
	ПараметрыРазбиенияСтроки.Вставить("Количество", Неопределено);
	
	ДополнительныеПараметры = Новый Структура;
	
	ОбщегоНазначенияУТКлиент.РазбитьСтрокуТЧ(
		ДанныеТаблицы,
		ТаблицаФормы,
		Новый ОписаниеОповещения("РазбитьСтрокуИнженераЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		ПараметрыРазбиенияСтроки);
		
КонецПроцедуры

// ++ 24.11.2020
&НаКлиенте
Процедура РазбитьСтрокуИнженераЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
	
	ТекущаяСтрока = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если НоваяСтрока <> Неопределено Тогда
		
		НоваяСтрока.ИДСтрокиЗаполняетсяИнженером = ПолучитьСледующийИДСтроки(); 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекущаяСтрока.ИДСтрокиЗаполняетсяИнженером);
		
		// ++ 15.12.2020
		СтрокиДопДействия = Объект.ДополнительныеДействияИнженер.НайтиСтроки(Отбор);
		Для Каждого СтрокаДД Из СтрокиДопДействия Цикл
			НоваяСтрокаДопДействия = Объект.ДополнительныеДействияИнженер.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДД);
			НоваяСтрокаДопДействия.ИДСтрокиЗаполняетсяИнженером = НоваяСтрока.ИДСтрокиЗаполняетсяИнженером;	
		КонецЦикла;		
		// --
		
		НайденныеСтрокиСпециалист = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
		
		// Разбить строку специалиста с последующим разбиением строк во всех зависимых таблицах
		Если НайденныеСтрокиСпециалист.Количество() > 0 Тогда
			
			СтрокаСпециалист = НайденныеСтрокиСпециалист[0];
			СтрокаСпециалист.Количество = ТекущаяСтрока.Количество;
			
			НоваяСтрокаСпециалист = Объект.ЗаполняетсяСпециалистомПоПретензиям.Вставить(СтрокаСпециалист.НомерСтроки);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСпециалист, СтрокаСпециалист);
			НоваяСтрокаСпециалист.ИДСтрокиЗаполняетсяИнженером = НоваяСтрока.ИДСтрокиЗаполняетсяИнженером; // 17.12.2020 - исправление
			НоваяСтрокаСпециалист.НомерПозиции = ПолучитьСледующийНомерПозиции();
			НоваяСтрокаСпециалист.Количество = НоваяСтрока.Количество;
			// ++ 20.12.2020
			НоваяСтрокаСпециалист.ДатаДобавления = ТекущаяДата();
			// --
			
			Отбор = Новый Структура;
			Отбор.Вставить("НомерПозиции", СтрокаСпециалист.НомерПозиции);
			
			НайденныеСтрокиСтатус = Объект.Статусы.НайтиСтроки(Отбор);		
			Для Каждого СтрокаСтатус Из НайденныеСтрокиСтатус Цикл
				НоваяСтрокаСтатус = Объект.Статусы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСтатус, СтрокаСтатус);
				НоваяСтрокаСтатус.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
			КонецЦикла;
			
			НайденныеСтрокиИсторияРешений = Объект.ИсторияРешенийПоставщика.НайтиСтроки(Отбор);
			Для Каждого СтрокаИстория Из НайденныеСтрокиИсторияРешений Цикл
				НоваяСтрокаИстория = Объект.ИсторияРешенийПоставщика.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория, СтрокаИстория);
				НоваяСтрокаИстория.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
			КонецЦикла;
			
			НайденныеСтрокиДопДействия = Объект.ДополнительныеДействия.НайтиСтроки(Отбор);
			Для Каждого СтрокаДопДействия Из НайденныеСтрокиДопДействия Цикл
				НоваяСтрокаДопДействия = Объект.ДополнительныеДействия.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДопДействия);
				НоваяСтрокаДопДействия.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
			КонецЦикла;
			
		КонецЕсли;			
						
	КонецЕсли;

КонецПроцедуры

// ++ 16.08.2020
&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ТаблицаФормы  = Элементы.ЗаполняетсяСпециалистомПоПретензиям;
	ДанныеТаблицы = Объект.ЗаполняетсяСпециалистомПоПретензиям;
	
	ПараметрыРазбиенияСтроки = Новый Структура;
	ПараметрыРазбиенияСтроки.Вставить("ИмяПоляКоличество", "Количество");
	ПараметрыРазбиенияСтроки.Вставить("Заголовок", НСтр("ru = 'Введите количество запчастей в новой строке'"));
	ПараметрыРазбиенияСтроки.Вставить("РазрешитьНулевоеКоличество", Истина);
	ПараметрыРазбиенияСтроки.Вставить("Количество", Неопределено);
	
	ДополнительныеПараметры = Новый Структура;
	
	ОбщегоНазначенияУТКлиент.РазбитьСтрокуТЧ(
		ДанныеТаблицы,
		ТаблицаФормы,
		Новый ОписаниеОповещения("РазбитьСтрокуЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		ПараметрыРазбиенияСтроки);
	
КонецПроцедуры

// ++ 16.08.2020
&НаКлиенте
Процедура РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
	
	ТекущаяСтрока = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	Если НоваяСтрока <> Неопределено Тогда
		
		// ++ 20.12.2020
		// Строку инженера тоже требуется разделить, чтобы они соответствовали строкам специалиста
		Отбор = Новый Структура;
		Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", НоваяСтрока.ИДСтрокиЗаполняетсяИнженером);
		СтрокиИнженера = Объект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
		Если СтрокиИнженера.Количество() > 0 Тогда
			СтрокаИнженер = СтрокиИнженера[0];
			
			НоваяСтрокаИнженер = Объект.ЗаполняетсяИнженером.Вставить(СтрокаИнженер.НомерСтроки);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнженер, СтрокаИнженер);
			НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером = ПолучитьСледующийИДСтроки();
			НоваяСтрокаИнженер.Количество = НоваяСтрока.Количество; 
			СтрокаИнженер.Количество = СтрокаИнженер.Количество - НоваяСтрока.Количество;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером);
			
			СтрокиДопДействия = Объект.ДополнительныеДействияИнженер.НайтиСтроки(Отбор);
			Для Каждого СтрокаДД Из СтрокиДопДействия Цикл
				НоваяСтрокаДопДействия = Объект.ДополнительныеДействияИнженер.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДД);
				НоваяСтрокаДопДействия.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;	
			КонецЦикла;	
			
			НоваяСтрока.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;
			НоваяСтрока.ДатаДобавления = ТекущаяДата();
		КонецЕсли;		
		// --
		
		НоваяСтрока.НомерПозиции = ПолучитьСледующийНомерПозиции();
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", ТекущаяСтрока.НомерПозиции);
		
		НайденныеСтрокиСтатус = Объект.Статусы.НайтиСтроки(Отбор);		
		Для Каждого СтрокаСтатус Из НайденныеСтрокиСтатус Цикл
			НоваяСтрокаСтатус = Объект.Статусы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтатус, СтрокаСтатус);
			НоваяСтрокаСтатус.НомерПозиции = НоваяСтрока.НомерПозиции;
		КонецЦикла;
		
		НайденныеСтрокиИсторияРешений = Объект.ИсторияРешенийПоставщика.НайтиСтроки(Отбор);
		Для Каждого СтрокаИстория Из НайденныеСтрокиИсторияРешений Цикл
			НоваяСтрокаИстория = Объект.ИсторияРешенийПоставщика.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория, СтрокаИстория);
			НоваяСтрокаИстория.НомерПозиции = НоваяСтрока.НомерПозиции;
		КонецЦикла;
		
		НайденныеСтрокиДопДействия = Объект.ДополнительныеДействия.НайтиСтроки(Отбор);
		Для Каждого СтрокаДопДействия Из НайденныеСтрокиДопДействия Цикл
			НоваяСтрокаДопДействия = Объект.ДополнительныеДействия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДопДействия);
			НоваяСтрокаДопДействия.НомерПозиции = НоваяСтрока.НомерПозиции;
		КонецЦикла;
				
	КонецЕсли;

КонецПроцедуры

// ++ 25.10.2020
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаЗаполняетсяИнженером Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ЗаполняетсяИнженером.КоманднаяПанель;
	КонецЕсли;
	
КонецПроцедуры

// ++ 14.10.2020
&НаКлиенте
Процедура ВзятьНаСкладе(Команда)
		
	Если НЕ ЗначениеЗаполнено(Объект.СкладИнженера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан склад инженера. Документ ""Заказ на перемещение"" не создан!", Объект.Ссылка, "СкладИнженера",);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана организация. Документ ""Заказ на перемещение"" не создан!", Объект.Ссылка, "Организация");
		Возврат;
	КонецЕсли;

	//// ++ 28.01.2021
	//Для Каждого Строка Из Объект.ЗаполняетсяИнженером Цикл
	//	Строка.СкладыСОстатками.Очистить();
	//	Строка.ЗаполняетсяСписокСкладов = Ложь;
	//	Строка.СписокСкладовПустой = Ложь;
	//КонецЦикла;
	//// --
	
	// ++ 12.01.2021
	//ЗаказНаПеремещение = ВзятьНаСкладеНаСервере();
	
	// ++ 26.01.2021
	//МассивСтрокДляОбработки = Новый Массив;
	
	МассивИспользуемыхСкладов = ПолучитьСкладыИзТаблицыИнженера();
	
	// ++ 16.02.2021
	//// Сначала берутся запчасти с предопределенного склада
	//ТекСклад = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ"), Ложь);
	//ЗаказНаПеремещение = ВзятьНаСкладеНаСервере(ТекСклад, МассивСтрокДляОбработки);
	////ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение); // 09.02.2021 - перенесено ниже
		
	//НомераСтрок = "";
	//Для Каждого ИДСтрока Из МассивСтрокДляОбработки Цикл
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрока);
	//	Строки = Объект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
	//	Если Строки.Количество() = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Строка = Строки[0];
	//	
	//	// ++ 09.02.2021
	//	Строка.СкладыСОстатками.Очистить();
	//	Строка.ЗаполняетсяСписокСкладов = Ложь;
	//	Строка.СписокСкладовПустой = Ложь;
	//	// --
	//	
	//	// Заполнить список доступных складов
	//	МассивСкладов = ПолучитьМассивСкладовСДоступнымиОстатками(Строка.НоменклатураПринятаяОтКлиента, Строка.Количество, Строка.ИДСтрокиЗаполняетсяИнженером);
	//			
	//	Если МассивСкладов.Количество() > 0 Тогда
	//		Строка.СкладыСОстатками.ЗагрузитьЗначения(МассивСкладов);
	//		Строка.ЗаполняетсяСписокСкладов = Истина; // 09.02.2021
	//	Иначе
	//		Строка.СписокСкладовПустой = Истина;
	//	КонецЕсли;
	//	
	//	НомераСтрок = НомераСтрок + ?(ЗначениеЗаполнено(НомераСтрок), ", ", "") + Строка.НомерСтроки	
	//КонецЦикла;
	//
	//Если ЗначениеЗаполнено(НомераСтрок) Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Для строк " + НомераСтрок + " укажите склад и нажмите ""Взять на складе"" повторно");
	//КонецЕсли;
	//
	//// ++ 09.02.2021 - перенесено ниже, чтобы сообщение выше выводилось не в окне печатной формы, а в окне документа
	//ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение);
	//// --
	
	// -- 16.02.2021

	
	Для Каждого ТекСклад Из МассивИспользуемыхСкладов Цикл
        
        //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.12.2021 10:37:25  проверка остатков по регистру Товары организации задача 801
        Если НЕ ПроверкаОстатков(ТекСклад) Тогда
            Продолжить;
        КонецЕсли; 
        //Смарт }Подкин Алексей Иванович 06.12.2021 10:37:25

        ЗаказНаПеремещение = ВзятьНаСкладеНаСервере(ТекСклад);
        
        //++ смарт:ПА #832 16.12.2021 10:19:48
        Если ЗаказНаПеремещение<>Неопределено Тогда
            УстановитьСтатусыВТЧПретензии(ЗаказНаПеремещение);
        КонецЕсли; 
        //-- смарт:ПА #832 16.12.2021 10:19:48

		// ++ 21.11.2020
		ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение);
		// --
		//++rnp 16.06.2021 - отправка уведомления на склад, если перемещение из Москвы в регионы 
		ОтправитьУведомлениеПоЗаказуНаПеремещение(ЗаказНаПеремещение);
		//
		
	КонецЦикла;
	
	// -- 12.01.2021
	
КонецПроцедуры

//++ смарт:ПА #832 16.12.2021 10:29:04
&НаСервере
Процедура УстановитьСтатусыВТЧПретензии(ЗаказНаПеремещение)
    
    Если ЗаказНаПеремещение.Проведен И УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
        
        // Для неполных прав код по изменению статуса в заявке на гар. ремонт находится в обработчиках кнопок ВернутьЗапчастьНаPRE и ВзятьЗапчастьСPRE формы списка 
        
        //Если ДополнительныеСвойства.Свойство("смартНеДобавлятьСтрокуСтатусаВЗаявкуНаГарантийныйРемонт") = Ложь 
        //    ИЛИ ДополнительныеСвойства.смартНеДобавлятьСтрокуСтатусаВЗаявкуНаГарантийныйРемонт = Ложь Тогда
        
        ОсновнойСкладДляЗапчастейПодЗаказ = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ОсновнойСкладДляЗапчастейПодЗаказ", Ложь);
        
        Если ЗаказНаПеремещение.СкладОтправитель = ОсновнойСкладДляЗапчастейПодЗаказ 
            ИЛИ ЗаказНаПеремещение.СкладПолучатель = ОсновнойСкладДляЗапчастейПодЗаказ Тогда
            
            Запрос = Новый Запрос;
            Запрос.Текст =
			//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
			//"ВЫБРАТЬ
			//|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
			//|	ЗаказНаПеремещениеТовары.Количество КАК Количество,
			//|	ЗаказНаПеремещениеТовары.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт
			//|ПОМЕСТИТЬ ВТ_Товары
			//|ИЗ
			//|	&Товары КАК ЗаказНаПеремещениеТовары
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка КАК Ссылка,
			//|	МАКСИМУМ(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции) КАК НомерПозиции,
			////++ смарт:ММ 702 15.11.2021 
			//|	КОЛИЧЕСТВО(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции) КАК КоличествоСтрокВЗаявке,
			////-- смарт:ММ 15.11.2021
			//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК Номенклатура
			//|ИЗ
			//|	ВТ_Товары КАК ВТ_Товары
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
			//|		ПО ВТ_Товары.Номенклатура = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура
			//// Как еще связать кроме номенклатуры?
			////|			И ВТ_Товары.Количество = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество
			//|			И ВТ_Товары.смартНомерЗаявкиНаГарантийныйРемонт = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка.Номер
			//|ГДЕ
			//|	ВТ_Товары.смартНомерЗаявкиНаГарантийныйРемонт <> """"
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура,
			//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка
			//|ИТОГИ ПО
			//|	Ссылка";
			"ВЫБРАТЬ
            |	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
            |	ЗаказНаПеремещениеТовары.Количество КАК Количество,
            |	ЗаказНаПеремещениеТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка КАК смартНомерЗаявкиНаГарантийныйРемонтСсылка
            |ПОМЕСТИТЬ ВТ_Товары
            |ИЗ
            |	&Товары КАК ЗаказНаПеремещениеТовары
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |ВЫБРАТЬ
            |	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка КАК Ссылка,
            |	МАКСИМУМ(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции) КАК НомерПозиции,
            |	КОЛИЧЕСТВО(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции) КАК КоличествоСтрокВЗаявке,
            |	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК Номенклатура
            |ИЗ
            |	ВТ_Товары КАК ВТ_Товары
            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
            |		ПО ВТ_Товары.Номенклатура = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура
            // Как еще связать кроме номенклатуры?
            //|			И ВТ_Товары.Количество = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество
            |			И ВТ_Товары.смартНомерЗаявкиНаГарантийныйРемонтСсылка = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка
            |ГДЕ
            |	ВТ_Товары.смартНомерЗаявкиНаГарантийныйРемонтСсылка <> ЗНАЧЕНИЕ(Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка)
            |
            |СГРУППИРОВАТЬ ПО
            |	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура,
            |	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка
            |ИТОГИ ПО
            |	Ссылка";
			//-- #Б1132 смарт: Шляпников 01.11.2024
            
            Запрос.УстановитьПараметр("Товары", ЗаказНаПеремещение.Товары.Выгрузить());
            
            ВыборкаЗаявка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
            
            УстанавливаемыйСтатус = Неопределено;
            
            Если ЗаказНаПеремещение.СкладОтправитель = ОсновнойСкладДляЗапчастейПодЗаказ Тогда
                УстанавливаемыйСтатус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ПеремещеноНаДругиеЦели");			
            ИначеЕсли ЗаказНаПеремещение.СкладПолучатель = ОсновнойСкладДляЗапчастейПодЗаказ Тогда			
                УстанавливаемыйСтатус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ВозвращеноПоНазначению");
            КонецЕсли;	
            
            Пока ВыборкаЗаявка.Следующий() Цикл 
                Если Объект.Ссылка=ВыборкаЗаявка.Ссылка Тогда
                   // ЗаявкаОбъект = ВыборкаЗаявка.Ссылка.ПолучитьОбъект();
                  //  ДокОбъект = РеквизитФормыВЗначение("Объект");
                    Выборка = ВыборкаЗаявка.Выбрать();
                    
                    БылиИзменения = Ложь;
                    
                    Пока Выборка.Следующий() Цикл
                        
                        Отбор = Новый Структура;
                        Отбор.Вставить("НомерПозиции", Выборка.НомерПозиции);
                        Отбор.Вставить("Статус", УстанавливаемыйСтатус);
                        Отбор.Вставить("ДокументДвижения", ЗаказНаПеремещение);
                        
                        НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
                        
                        Если НайденныеСтроки.Количество() > 0 Тогда
                            Продолжить;
                        КонецЕсли;
                        
                        НоваяСтрока = Объект.Статусы.Добавить();
                        НоваяСтрока.НомерПозиции = Выборка.НомерПозиции;
                        НоваяСтрока.ДатаИзмененияСтатуса = ТекущаяДата();
                        НоваяСтрока.Статус = УстанавливаемыйСтатус;
                        НоваяСтрока.ДокументДвижения = ЗаказНаПеремещение;
                        
                        //++ смарт:ММ 702 15.11.2021 
                        Если Выборка.КоличествоСтрокВЗаявке > 1 Тогда
                            ОбщегоНазначения.СообщитьПользователю("В заявке на гарантийный ремонт №" + Объект.Номер  + " несколько строк с одинаковой номенклатурой " + Выборка.Номенклатура + ". Проверьте правильность изменения статуса " + УстанавливаемыйСтатус, Объект.Ссылка);
                        КонецЕсли;
                        //-- смарт:ММ 15.11.2021
                        
                        //БылиИзменения = Истина;
                    КонецЦикла;
                    
                    //Если БылиИзменения Тогда
                        //Попытка
                        //    ЗаявкаОбъект.Записать();
                        //Исключение
                        //    
                        //КонецПопытки;
                    //КонецЕсли;
                  //      ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

                КонецЕсли; 
                
            КонецЦикла;
            
        КонецЕсли;
        // КонецЕсли;
    КонецЕсли;
    //-- смарт:ММ 14.11.2021
    
КонецПроцедуры
//-- смарт:ПА #832 16.12.2021 10:29:04

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.12.2021 10:38:26 задача 801
&НаСервере
Функция ПроверкаОстатков(ТекСклад)
    
    Если ЗначениеЗаполнено(ТекСклад) И Объект.ЗаполняетсяИнженером.Количество() Тогда
      
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   Ном.НоменклатураПринятаяОтКлиента КАК Номенклатура,
        |   Ном.Количество КАК Количество,
        |   Ном.Склад КАК Склад
        |ПОМЕСТИТЬ ВременнаяТаблица
        |ИЗ
        |   &ТЗЗаполняетсяИнженером КАК Ном
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ВременнаяТаблица.Номенклатура КАК Номенклатура,
        |   ВременнаяТаблица.Склад КАК Склад,
        |   ВременнаяТаблица.Количество КАК Количество,
        |   ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
        |   ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВременнаяТаблица.Количество КАК Дельта
        |ИЗ
        |   ВременнаяТаблица КАК ВременнаяТаблица
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(, Организация = &Организация) КАК ТоварыОрганизацийОстатки
        |       ПО ВременнаяТаблица.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
        |           И (ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения = ВременнаяТаблица.Склад)
        |ГДЕ
        |   ВременнаяТаблица.Номенклатура ЕСТЬ НЕ NULL 
        |   И ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВременнаяТаблица.Количество < 0";
        
        Запрос.УстановитьПараметр("Организация", Объект.Организация);
        СтруктураОтбора=Новый Структура;
        СтруктураОтбора.Вставить("Склад",ТекСклад); 
		//++ #1967 смарт: Лопато 06.08.2024 //Доработка гарантийного блока / создание документов перемещения по кнопке Взять на складе  
		СтруктураОтбора.Вставить("ДокументПолученияЗапчасти", Документы.ЗаказНаПеремещение.ПустаяСсылка()); 
		//-- #1967 смарт: Лопато 06.08.2024
        
        //++ смарт:Подкин #910 11.04.2022 17:25:15
        ТзЗаполняетсяИнженером=Объект.ЗаполняетсяИнженером.Выгрузить(СтруктураОтбора,"ИДСтрокиЗаполняетсяИнженером,НоменклатураПринятаяОтКлиента,Количество,Склад"); 
        Для каждого СтрЗИ Из ТзЗаполняетсяИнженером Цикл
            МассивСтрокСП=Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Новый Структура("ИДСтрокиЗаполняетсяИнженером",СтрЗИ.ИДСтрокиЗаполняетсяИнженером));
            Если МассивСтрокСП.Количество()=1 И ЗначениеЗаполнено(МассивСтрокСП[0].АналогОтПоставщика) Тогда
                СтрЗИ.НоменклатураПринятаяОтКлиента=МассивСтрокСП[0].АналогОтПоставщика; 
            КонецЕсли;
        КонецЦикла;
        Запрос.УстановитьПараметр("ТЗЗаполняетсяИнженером",ТзЗаполняетсяИнженером); 
        //-- смарт:Подкин #910 11.04.2022 17:25:15
        
        РезультатЗапроса = Запрос.Выполнить();
        Если НЕ РезультатЗапроса.Пустой() Тогда
            ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
            
            Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
                ОбщегоНазначения.СообщитьПользователю("По организации "+Объект.Организация.Наименование+" не хватает "+ВыборкаДетальныеЗаписи.Дельта*-1+" шт. товара "+ВыборкаДетальныеЗаписи.Номенклатура+" на складе "+ВыборкаДетальныеЗаписи.Склад);    
            КонецЦикла;
            
            Возврат Ложь;
            
        КонецЕсли; 
    КонецЕсли; 
    
    Возврат Истина;
 
КонецФункции

// ++ 16.06.2021
&НаСервере
Процедура ОтправитьУведомлениеПоЗаказуНаПеремещение(ЗаказНаПеремещение)
	Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
		Возврат;
	КонецЕсли;
	Представительство = ЗаказНаПеремещение.СкладПолучатель.Подразделение; 
	Если Представительство <> Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение
		И ЗаказНаПеремещение.СкладОтправитель.Подразделение <> Представительство Тогда
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой);
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
		МассивАдресовСервисногоЦентраВРегионеПолучения = смартОбщегоНазначения.ПолучитьАдресРуководителяПредставительства(Представительство, АдресаДляОтправкиСтрокой);
		Для Каждого Адрес Из МассивАдресовСервисногоЦентраВРегионеПолучения Цикл
			МассивАдресовДляОтправки.Добавить(Адрес);
		КонецЦикла;
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
		ТестовыеАдресаСтрока = "";
		ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
		ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
		
		Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			//-- смарт:ММ 03.03.2021
			
			Номер = Объект.Номер;
			
			ТемаПисьма = "Перемещение запчастей по заявке на гарантийный ремонт №" + Номер;
			
			ТекстПисьма = "По заявке на гарантийный ремонт №" + Номер + " необходима отправка запчастей в региональное представительство " +  Представительство.Наименование + ". Необходимо обработать Заказ на перемещение №" 
			+ ЗаказНаПеремещение.Номер + " от " + Формат(ЗаказНаПеремещение.Дата, "ДФ='dd.MM.yyyy ""г.""'");
			
			ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			//-- смарт:ММ 03.03.2021
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
				//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
				Если ПараметрыПисьма.ТестоваяБаза Тогда
					ТекстСообщения = "Отправлено уведомление о перемещении гарантийных запчастей НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
				Иначе
					//-- смарт:ММ 03.03.2021
					
					ТекстСообщения = "Отправлено уведомление о перемещении гарантийных запчастей на почту " +  АдресаДляОтправкиСтрокой;		
					
					//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
				КонецЕсли;
				//-- смарт:ММ 03.03.2021
				
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Исключение 
				//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
				смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказНаПеремещение,ТекстПисьма);
				//-- #1416 смарт: Фролов 30.08.2023
				ТекстСообщения = "Не удалось отправить уведомление о перемещении гарантийных запчастей" + Символы.ПС + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


// ++ 13.12.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромДатаУстановкиЗапчастиКлиентуПриИзменении(Элемент)	
	//++ #Б-3168 смарт: Лопато 06.05.2025 //Заявка на гарантийный ремонт. Дата установки запчасти клиенту.  
	// Отключил код
	//ОбщегоНазначенияКлиент.СообщитьПользователю("Обязательно прикрепите скан акта на вкладку Файлы!");
	//-- #Б-3168 смарт: Лопато 06.05.2025
КонецПроцедуры

// ++ 16.02.2021
&НаКлиенте
Процедура ПроверитьОстаткиНаСкладах(Команда)
	
	ПроверитьОстаткиНаСкладахСервер();
			
КонецПроцедуры

// ++ 16.02.2021
&НаСервере
Процедура ПроверитьОстаткиНаСкладахСервер()
		
	// Заполнить список доступных складов
	
	ОсновнойСклад = Справочники.смартПредопределенныеЗначения.ОсновнойСклад.Значение;
	ОсновнойСкладДляЗапчастейПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	
	Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
		
		СтрокаИнженер.СкладыСОстатками.Очистить();
		
		//Если ЗначениеЗаполнено(СтрокаИнженер.НоменклатураУстановленнаяКлиенту) Тогда
		//	Продолжить;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(СтрокаИнженер.Склад) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИнженер.ДокументПолученияЗапчасти) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСкладов = ПолучитьМассивСкладовСДоступнымиОстатками(СтрокаИнженер.НоменклатураПринятаяОтКлиента, СтрокаИнженер.Количество, СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером);
				
		Если МассивСкладов.Найти(ОсновнойСклад) <> Неопределено и СтрокаИнженер.Склад <> ОсновнойСкладДляЗапчастейПодЗаказ Тогда
			СтрокаИнженер.Склад = ОсновнойСклад;
		КонецЕсли;
		
		Если МассивСкладов.Количество() > 0 Тогда
			СтрокаИнженер.СкладыСОстатками.ЗагрузитьЗначения(МассивСкладов);
			СтрокаИнженер.ЗаполняетсяСписокСкладов = Истина; 
		Иначе
			СтрокаИнженер.СписокСкладовПустой = Истина;
			
			//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
			ОбщегоНазначения.СообщитьПользователю("Нет доступных гарантийных деталей.
												 |Сформируйте отчет ""Остатки и доступность"" для получения информации о доступных коммерческих деталей.");
			//-- #Б1376 смарт: Шляпников 19.11.2024
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// ++ 20.02.2021
&НаСервере
Функция БылоПоступлениеНаСкладДляГарантийныхЗапчастейПодЗаказ(ИДСтрокиЗаполняетсяИнженером)
	
	// лучше пока ориентироваться, есть ли заказ на перемещение в табл.части статусов на вкладке специалиста; 
	// когда нормализуются остатки по новому регистру, можно будет по нему проверять
	
	мРезультат = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
	НайденныеСтрокиСпециалист = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаСпециалист Из НайденныеСтрокиСпециалист Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", СтрокаСпециалист.НомерПозиции);
		
		НайденныеСтрокиСтатус = Объект.Статусы.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаСтатус Из НайденныеСтрокиСтатус Цикл
			Если ЗначениеЗаполнено(СтрокаСтатус.ДокументДвиженияДоп) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат мРезультат;
		
КонецФункции

//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
&НаКлиенте
Процедура СписатьДеталь(Команда)
	
	СписатьТовар = Истина;
	Попытка
		Записать();
	Исключение
		Сообщить(СтрШаблон("Не удалось выполнить операцию по причине %1%2", ОписаниеОшибки()));
	КонецПопытки;
	СписатьТовар = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//++ #Б-2904 смарт: Фролов 14.04.2025 //Заявка на гарантийный ремонт. Доработка. Форма документа.
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

//++ #Б-2904 смарт: Фролов 14.04.2025 //Заявка на гарантийный ремонт. Доработка. Форма документа.
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //-- #Б-2904 смарт: Фролов 14.04.2025

//++ #Б-2904 смарт: Фролов 14.04.2025 //Заявка на гарантийный ремонт. Доработка. Форма документа.
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //-- #Б-2904 смарт: Фролов 14.04.2025 

//++ #Б-2904 смарт: Фролов 14.04.2025 //Заявка на гарантийный ремонт. Доработка. Форма документа.
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //-- #Б-2904 смарт: Фролов 14.04.2025

#КонецОбласти 

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьПолныеПрава()
	Возврат УправлениеДоступом.ЕстьРоль("ПолныеПрава");
КонецФункции

&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	Элементы.ЗаполняетсяСпециалистомПоПретензиямОбновитьСтатус.Доступность = Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() <> 0;
	//++ смарт:Минаева #1076 22.06.2022 18:08:17 Добавлена временно роль для видимости ЗаполняетсяИнженеромДокументВводОстатков ЗаполняетсяИнженеромДокументЗаказНаВнутреннееПотребление  
	
	Если НЕ ЕстьПолныеПрава() И НЕ Пользователи.РолиДоступны("смартРазрешитьРедактироватьЗаказВнутрПотрИВводНачОстатков") Тогда
		
	//-- смарт:Минаева #1076 22.06.2022 18:08:17
	
		//24.08.2020 закомментировано, специалист хочет иметь доступ к вкладке инженера		
		//Если НЕ УправлениеДоступом.ЕстьРоль("смартИнженер") 
		//	// 08.04.2020
		//	//ИЛИ ЗначениеЗаполнено(Объект.ЗаказНаПеремещениеЗапчастейСИнженера) 
		//	Тогда
		//	Элементы.ГруппаЗаполняетсяИнженером.ТолькоПросмотр = Истина;
		//	Элементы.ЗаполняетсяИнженеромПодобратьТоварыПоСкладуИнженера.Доступность = Ложь;
		//	Элементы.ЗаполняетсяИнженеромСдатьНаСклад.Доступность = Ложь;
		//КонецЕсли;
		
		Если НЕ УправлениеДоступом.ЕстьРоль("смартСпециалистПоПретензиям") Тогда
			Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТолькоПросмотр = Истина;
			//Элементы.ЗаполняетсяСпециалистомПоПретензиямЗаполнитьСпециалистПоПретензиям.Доступность = Ложь;
			Элементы.ЗаполняетсяСпециалистомПоПретензиямОбновитьСтатус.Доступность = Ложь;
			//Элементы.ЗаполняетсяСпециалистомПоПретензиямДобавить.Доступность = Ложь;
			
			// ++ 29.08.2020 - закрыть доступ для роли смартИнженер к полю со статусом заявки на первой вкладке 
			Если УправлениеДоступом.ЕстьРоль("смартИнженер") Тогда
				Элементы.Статус.ТолькоПросмотр = Истина;	
			КонецЕсли;
			
		//++ #5824 смарт: Тимофеева 05.03.26 / Заявка на гарантийный ремонт. Расширение доступа для Специалиста по претензиям
		Иначе
		    Элементы.Статусы.ТолькоПросмотр = Ложь;
			Элементы.ЗаполняетсяСпециалистомПоПретензиям.ИзменятьСоставСтрок = Истина;
		//-- #5824 смарт: Тимофеева 05.03.26
		КонецЕсли;
		
		// ++ 13.06.2020
		Элементы.ЗаполняетсяСпециалистомПоПретензиямКоличество.ТолькоПросмотр = Истина;
		
		// ++ 21.06.2020
		Элементы.ЗаполняетсяИнженеромЗаказНаПеремещениеЗапчастейСИнженера.ТолькоПросмотр = Истина;

		//++ #Б-2024 смарт: Лопато 30.01.2025 //Заявка на гарантийный ремонт. Доработки.  
		Элементы.ЗаполняетсяИнженеромДокументЗаказНаВнутреннееПотребление.Видимость = Истина;
		Элементы.ЗаполняетсяИнженеромДокументЗаказНаВнутреннееПотребление.ТолькоПросмотр = Истина;
		//-- #Б-2024 смарт: Лопато 30.01.2025
		
	Иначе
		
		Элементы.Статусы.ТолькоПросмотр = Ложь;
		Элементы.ЗаполняетсяСпециалистомПоПретензиям.ИзменятьСоставСтрок = Истина;

		// ++ 21.11.2020
		Элементы.ЗаполняетсяИнженеромДокументВводОстатков.Видимость = Истина;
		Элементы.ЗаполняетсяИнженеромДокументЗаказНаВнутреннееПотребление.Видимость = Истина;
		
	КонецЕсли;
	
	//++ #5824 смарт: Тимофеева 05.03.26 / Заявка на гарантийный ремонт. Расширение доступа для Специалиста по претензиям
	//ВидимостьКолонкиАналогОтПоставщика = Ложь;
	//
	//Для Каждого Строка Из Объект.ЗаполняетсяСпециалистомПоПретензиям Цикл
	//	Если ЗначениеЗаполнено(Строка.АналогОтПоставщика) Тогда
	//		ВидимостьКолонкиАналогОтПоставщика = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Элементы.ЗаполняетсяСпециалистомПоПретензиямАналогОтПоставщика.Видимость = ВидимостьКолонкиАналогОтПоставщика;	
	//-- #5824 смарт: Тимофеева 05.03.26
	
	// 08.04.2020
	// Доступность команды "Сдать на склад" - доступна, если есть пустые значения Заказ на перемещение в таблице инженера
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗаказНаПеремещениеЗапчастейСИнженера", Документы.ЗаказНаПеремещение.ПустаяСсылка());
	// 02.11.2020
	ПараметрыОтбора.Вставить("ЗапчастьОтКлиентаПринял", Истина);
	
	НайденныеСтроки = Объект.ЗаполняетсяИнженером.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Элементы.ЗаполняетсяИнженеромСдатьНаСклад.Доступность = Ложь;
	Иначе
		Элементы.ЗаполняетсяИнженеромСдатьНаСклад.Доступность = Истина;
	КонецЕсли;
	
	// ++ 14.10.2020
	// Доступность команды "Взять на складе" - доступна, если есть пустые значения НоменклатураУстановленнаяКлиенту
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НоменклатураУстановленнаяКлиенту", Справочники.Номенклатура.ПустаяСсылка());
	
	НайденныеСтроки = Объект.ЗаполняетсяИнженером.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Элементы.ЗаполняетсяИнженеромВзятьНаСкладе.Доступность = Ложь;
	Иначе
		Элементы.ЗаполняетсяИнженеромВзятьНаСкладе.Доступность = Истина;
	КонецЕсли;
	//
	//06.11.2020
	//Элементы.Оборудование.Видимость = Не Объект.DOA;
	//Элементы.Серия.Видимость = Не Объект.DOA;
	
	// ++ 30.05.2021
	//Видимость = Ложь;
	//Если ЕстьПолныеПрава() ИЛИ РольДоступна("смартИзменениеДатыУстановкиЗапчастиКлиенту") Тогда //rnp 02.07.2021, пока что отказались от заполнения даты ответственным
		Видимость = Истина;
	//КонецЕсли;
	
	//++ #Б-3168 смарт: Лопато 06.05.2025 //Заявка на гарантийный ремонт. Дата установки запчасти клиенту.  
	// Отключил код
	//Элементы.ЗаполняетсяИнженеромДатаУстановкиЗапчастиКлиенту.Видимость = Видимость;
	//-- #Б-3168 смарт: Лопато 06.05.2025
	// --
	
	// ++ 30.06.2021
	// Если в левой части вкладки инженера заполнен документ получения запчасти (заказ на перемещение) во всех строках, то кнопка Проверить остатки должна быть не доступна
	ДоступностьПроверки = Ложь;

	Для Каждого ТекСтрока Из Объект.ЗаполняетсяИнженером Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДокументПолученияЗапчасти) Тогда
			ДоступностьПроверки = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Элементы.ЗаполняетсяИнженеромПроверитьОстаткиНаСкладах.Доступность = ДоступностьПроверки;
	// --
	
	//++ #1596 смарт: Мосолов 17.01.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт 
	Элементы.Поставщик.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ДокументПриобретения);
	Элементы.ДокументПриобретения.Видимость = ЗначениеЗаполнено(Объект.ДокументПриобретения);
	//-- #1596 смарт: Мосолов 17.01.2024 
	
	//++ #1603 смарт: Мосолов 18.01.2024 //Доработка гарантийного блока / Изменить логику DOA
	Если Объект.DOA Тогда 
		
		Элементы.DOA.Видимость = Истина;
		Элементы.ЗаполняетсяИнженеромТипDOA.Видимость = Ложь;
		Элементы.ДекорацияDOA.Видимость = Ложь;  
		
	Иначе
		
		Элементы.DOA.Видимость = Ложь;
		Элементы.ЗаполняетсяИнженеромТипDOA.Видимость = Истина;
		Элементы.ДекорацияDOA.Видимость = Истина;
		
	КонецЕсли;  
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаполняетсяИнженеромЗапчастьОтКлиентаПринял.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполняетсяИнженером.ТипDOA");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.смартТипыDOA.Недостача;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	КонецЕсли;
	
	//-- #1603 смарт: Мосолов 18.01.2024 
	
	//++ #1963 смарт: Мосолов 26.08.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт 
	Элементы.Поставщик.ТолькоПросмотр = Истина;
	Элементы.Префикс.ТолькоПросмотр = Истина;
	//++ #1852 смарт: Шляпников 15.01.2025 / Подбор документа поступления в Заявку на гарантийный ремонт. Доработка алгоритма.
	Элементы.ГруппаИзменениеДокументаПриобретения.Видимость = Ложь;
	//-- #1852 смарт: Шляпников 15.01.2025

	Если (Пользователи.ЭтоПолноправныйПользователь() 
		ИЛИ РольДоступна("смартСпециалистПоПретензиям")) 
		И (Объект.ЗаполняетсяИнженером.Количество() = 0
			И Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() = 0) Тогда
			
		Элементы.Поставщик.ТолькоПросмотр = Ложь;
		Элементы.Префикс.ТолькоПросмотр = Ложь;
		//++ #1852 смарт: Шляпников 15.01.2025 / Подбор документа поступления в Заявку на гарантийный ремонт. Доработка алгоритма.
		Элементы.ГруппаИзменениеДокументаПриобретения.Видимость = Истина;
		//-- #1852 смарт: Шляпников 15.01.2025
			
	КонецЕсли;
	//-- #1963 смарт: Мосолов 26.08.2024 
	
	//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
	Элементы.ЗаполняетсяИнженеромСписатьДеталь.Доступность = Ложь;
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартСпециалистПоПретензиям") ИЛИ РольДоступна("смартИнженер") Тогда
		
		//++ #Б-2024 смарт: Лопато 30.01.2025 //Заявка на гарантийный ремонт. Доработки.  
		ЕстьСтрокаДляСписания = Ложь;
		//-- #Б-2024 смарт: Лопато 30.01.2025
		
		Для каждого стрИнженер Из Объект.ЗаполняетсяИнженером Цикл
			
			Если ЗначениеЗаполнено(стрИнженер.НоменклатураУстановленнаяКлиенту)
				И ЗначениеЗаполнено(стрИнженер.Склад)
				И ( ЗначениеЗаполнено(стрИнженер.ДокументРазборки) ИЛИ ЗначениеЗаполнено(стрИнженер.ДокументПолученияЗапчасти) )
				И НЕ ЗначениеЗаполнено(стрИнженер.ДокументЗаказНаВнутреннееПотребление) Тогда
				
				//++ #Б-2024 смарт: Лопато 30.01.2025 //Заявка на гарантийный ремонт. Доработки.  
				ЕстьСтрокаДляСписания = Истина;
				//-- #Б-2024 смарт: Лопато 30.01.2025
				
			КонецЕсли;
			
		КонецЦикла;
		
		//++ #Б-2024 смарт: Лопато 30.01.2025 //Заявка на гарантийный ремонт. Доработки.  
		Если ЕстьСтрокаДляСписания Тогда
			Элементы.ЗаполняетсяИнженеромСписатьДеталь.Доступность = Истина;
		КонецЕсли;	
		//-- #Б-2024 смарт: Лопато 30.01.2025
		
	КонецЕсли;
	//-- #Б1610 смарт: Шляпников 09.12.2024
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруКлиента(Клиент)
	
	МассивНоменклатуры = Новый Массив;
		
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Возврат МассивНоменклатуры;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиАналитикиУчетаПоПартнерам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_КлючиАналитикиПартнеры
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|ГДЕ
	|	КлючиАналитикиУчетаПоПартнерам.Партнер = &Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					ВТ_КлючиАналитикиПартнеры.Ссылка
	|				ИЗ
	|					ВТ_КлючиАналитикиПартнеры КАК ВТ_КлючиАналитикиПартнеры)) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = НоменклатураСпр.Ссылка
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|ГДЕ
	|	НоменклатураСпр.ВидНоменклатуры = &ТоварПлоттерыСерии";
	
	ТоварПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТоварПлоттерыСерии", ТоварПлоттерыСерии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивНоменклатуры;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
КонецФункции

&НаСервере
// ++ 21.11.2020
//Процедура СдатьНаСкладСервер()
Функция СдатьНаСкладСервер()
	
	ЗаказНаПеремещение = Неопределено;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	// 08.04.2020
	//Объект.ЗаказНаПеремещениеЗапчастейСИнженера = СоздатьДокументЗаказНаПеремещение();
	
	//Если ЗначениеЗаполнено(Объект.ЗаказНаПеремещениеЗапчастейСИнженера) И Объект.ЗаказНаПеремещениеЗапчастейСИнженера.Проведен Тогда
	//	СоздатьДокументПеремещениеТоваров();
	//КонецЕсли;
		
	// ++ 30.06.2021
	НачатьТранзакцию();
	Успех = Истина;
	// --
	
	// ++ 21.06.2020
	// Создание Ввода начальных остатков для строк, в которых не заполнена номенклатура, установленная клиенту
	НеобходимДокументВводОстатков = Ложь;
	ВводНачальныхОстатков = СоздатьДокументВводНачальныхОстатков(НеобходимДокументВводОстатков);
	
	// ++ 30.06.2021	
	Если Объект.СкладИнженера <> Объект.СкладГарантийныхЗапчастей Тогда
	// --
	Если (Не НеобходимДокументВводОстатков)
		ИЛИ (НеобходимДокументВводОстатков И ЗначениеЗаполнено(ВводНачальныхОстатков)) Тогда
	// --
		
		ЗаказНаПеремещение = СоздатьДокументЗаказНаПеремещение();
		Если ЗначениеЗаполнено(ЗаказНаПеремещение) И ЗаказНаПеремещение.Проведен Тогда
			ПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ЗаказНаПеремещение);
		КонецЕсли;
		
		// ++ 30.06.2021
		Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) ИЛИ НЕ ЗначениеЗаполнено(ПеремещениеТоваров) 
			ИЛИ (ЗначениеЗаполнено(ЗаказНаПеремещение) И НЕ ЗаказНаПеремещение.Проведен)
			ИЛИ (ЗначениеЗаполнено(ПеремещениеТоваров) И НЕ ПеремещениеТоваров.Проведен)
			Тогда
			Успех = Ложь;
		Иначе
		// --
		Записать();
		// ++ 30.06.2021
		КонецЕсли;
		// --
		
	// ++ 21.06.2020
	КонецЕсли;
	// --

	// ++ 30.06.2021
	Иначе
		
		Если ЗначениеЗаполнено(ВводНачальныхОстатков) Тогда
			СтатусОжидаютсяДействия = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаютсяДействия");
			
			Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
				
				Если СтрокаИнженер.ДокументВводОстатков <> ВводНачальныхОстатков Тогда
					Продолжить;
				КонецЕсли;
				
				ИДСтрокиЗаполняетсяИнженером = СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;
				Отбор = Новый Структура;
				Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
				НайденныеСтроки = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаСпециалист = НайденныеСтроки[0];
				НомерПозиции = СтрокаСпециалист.НомерПозиции;
				СтрокаСпециалист.Статус = СтатусОжидаютсяДействия;
				
				ДатаИзмененияСтатуса = ТекущаяДата();
				ДокументОприходования = ВводНачальныхОстатков;
				ДобавитьСтрокуСтатусаНаСервере(НомерПозиции, ДатаИзмененияСтатуса, СтатусОжидаютсяДействия, ДокументОприходования);
				
				Модифицированность = Истина;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Если Успех Тогда
		ЗафиксироватьТранзакцию();
	Иначе 
		ОтменитьТранзакцию();
	КонецЕсли;
	// --
	
	НастроитьВидимостьДоступность();

	// ++ 21.11.2020
	Возврат ЗаказНаПеремещение;
	
КонецФункции

// ++ 21.06.2020
&НаСервере
Функция СоздатьДокументВводНачальныхОстатков(НеобходимДокументВводОстатков)
	
	// ++ 31.03.2021
	Если Объект.DOA И ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Склады") Тогда
		НеобходимДокументВводОстатков = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	// --
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументВводОстатков = Документы.ВводОстатков.СоздатьДокумент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыЗапасов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	НЕ ВидыЗапасов.ПометкаУдаления
	|	И ВидыЗапасов.Организация = &Организация
	|	И ВидыЗапасов.ТипЗапасов = &ТипЗапасов";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТипЗапасов", Перечисления.ТипыЗапасов.Товар);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВидЗапасов = Неопределено;
	Если Выборка.Следующий() Тогда
		ВидЗапасов = Выборка.Ссылка;
	КонецЕсли;
	
	// ++ 21.11.2020
	МассивСтрокДляКоторыхВведенВводОстатков = Новый Массив;
	// --
	
	// ++ 31.03.2021
	НастройкаВидЦены = Справочники.смартПредопределенныеЗначения.ВидЦеныДляОприходованияЗапчастейПринятыхОтКлиента;
	ВидЦеныДляОприходования = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(НастройкаВидЦены, Ложь);
	// --
	
	Для Каждого ТекСтрока Из Объект.ЗаполняетсяИнженером Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
			Продолжить;
		КонецЕсли;
		
		// ++ 31.03.2021
		//Если ЗначениеЗаполнено(ТекСтрока.НоменклатураУстановленнаяКлиенту) Тогда
		//	Продолжить;
		//КонецЕсли;
		// -- 31.03.2021
		
		Если НЕ ТекСтрока.ЗапчастьОтКлиентаПринял Тогда
			Продолжить;
		КонецЕсли;
		
		НеобходимДокументВводОстатков = Истина;
		
		НоваяСтрока = ДокументВводОстатков.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТекСтрока.НоменклатураПринятаяОтКлиента;
		НоваяСтрока.Количество = ТекСтрока.Количество;
		НоваяСтрока.КоличествоУпаковок = ТекСтрока.Количество;
		НоваяСтрока.ВидЗапасов = ВидЗапасов;		
		//НоваяСтрока.АналитикаУчетаНоменклатуры = Справочники.КлючиАналитикиУчетаНоменклатуры.НайтиПоНаименованию();
		
		//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
		НоваяСтрока.НомерГТД = Справочники.НомераГТД.смартГарантийнаяЗапчасть;
		//-- #Б1610 смарт: Шляпников 09.12.2024

		// ++ 21.11.2020
		МассивСтрокДляКоторыхВведенВводОстатков.Добавить(ТекСтрока);
		// --
		
		//// ОТЛАДКА
		//ДокументВводОстатковДата = ТекСтрока.ДатаУстановкиЗапчастиКлиенту;
		//// --
	КонецЦикла;
	
	Если ДокументВводОстатков.Товары.Количество() = 0 Тогда
		ДокументВводОстатков = Неопределено;
		Возврат Неопределено;
	КонецЕсли;
		
	ДокументВводОстатков.Партия = СоздатьПервичныйДокумент(ТекущаяДата());
	Если НЕ ЗначениеЗаполнено(ДокументВводОстатков.Партия) Тогда
		ДокументВводОстатков = Неопределено;
		ВОзврат Неопределено;
	КонецЕсли;
	
	ДокументВводОстатков.Организация 	= Объект.Организация;
	ДокументВводОстатков.ТипОперации 	= Перечисления.ТипыОперацийВводаОстатков.ОстаткиСобственныхТоваров;
	ДокументВводОстатков.Склад 			= Объект.СкладИнженера;
	ДокументВводОстатков.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	ДокументВводОстатков.Подразделение 	= Справочники.смартПредопределенныеЗначения.ПодразделениеПоЗаявкамНаГарантийныйРемонт.Значение;
	ДокументВводОстатков.ЦенаВключаетНДС 			= Истина;
	ДокументВводОстатков.ОтражатьВОперативномУчете 	= Истина;
	// ++ 02.12.2020
	//ДокументВводОстатков.ОтражатьСебестоимость 		= Ложь;
	ДокументВводОстатков.ОтражатьСебестоимость 		= Истина;
	// --
	ДокументВводОстатков.ВидДеятельностиНДС 		= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		
	ДокументВводОстатков.Комментарий 	= ПолучитьТекстКомментарияКДокументу();

	ДокументВводОстатков.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДатаПроверки = ТекущаяДатаСеанса();
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии21(ДатаПроверки) Тогда
		ДокументВводОстатков.ВводОстатков22 = Истина;
	КонецЕсли;
    //++ #1287 смарт: Фролов 10.03.2023 //Работа с гарантийными и коммерческими запасными частями  
	ДокументВводОстатков.Основание=Объект.Ссылка;
	//-- #1287 смарт: Фролов 10.03.2023
	ДокументВводОстатков.Дата = ТекущаяДата();

	//++ #6294 смарт: Тимофеева 30.03.2026 /  Перевод запчастей на серийный учет. ЗГР. Не отображается серия в документе Ввод начальных остатков.
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокументВводОстатков, Документы.ВводОстатков));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументВводОстатков, ПараметрыУказанияСерий);
	
	СерииПоУмолчаниюСоответствие = смартСервер.ПолучитьСерииПоУмолчаниюСоответствие();
	Для Каждого ТекСтрока Из ДокументВводОстатков.Товары Цикл
		Если ТекСтрока.СтатусУказанияСерий = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура, "ВидНоменклатуры");
		СерияПоУмолчанию = СерииПоУмолчаниюСоответствие.Получить(ВидНоменклатуры);    
		
		Если НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(ТекСтрока.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда
			ТекСтрока.Серия = СерияПоУмолчанию;	
		ИначеЕсли НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧСерии(ТекСтрока.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда
			НоваяСтрокаСерии = ДокументВводОстатков.Серии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСерии, ТекСтрока);
			НоваяСтрокаСерии.Серия = СерияПоУмолчанию;
		КонецЕсли;
	КонецЦикла; 
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументВводОстатков, ПараметрыУказанияСерий);
	//-- #6294 смарт: Тимофеева 30.03.2026

	//// ОТЛАДКА
	//ДокументВводОстатков.Дата = ДокументВводОстатковДата;
	//
	////
	
	
	// ++ 31.03.2021
	СтавкаНДС_20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	ЦеныНоменклатуры = ПолучитьЦеныНоменклатуры(ДокументВводОстатков.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"), ВидЦеныДляОприходования, ТекущаяДата());
	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	КоэффициентПересчетаИзВалютыУпрВРегл = КоэффициентПересчета(ВалютаУправленческогоУчета, ВалютаРегламентированногоУчета, ДокументВводОстатков.Дата);
	
	Для Каждого ТекСтрока Из ДокументВводОстатков.Товары Цикл
		
		//++ #6294 смарт: Тимофеева 30.03.2026 /  Перевод запчастей на серийный учет. ЗГР. Не отображается серия в документе Ввод начальных остатков.
		//ТекСтрока.СтавкаНДС = СтавкаНДС_20;
		СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура, "СтавкаНДС");
		ТекСтрока.СтавкаНДС = ?(ЗначениеЗаполнено(СтавкаНДС), СтавкаНДС, Перечисления.СтавкиНДС.НДС22);
		//-- #6294 смарт: Тимофеева 30.03.2026
		ТекСтрока.Цена = ЦеныНоменклатуры.Получить(ТекСтрока.Номенклатура);
		
		Если ЗначениеЗаполнено(ТекСтрока.Цена) Тогда
			
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументВводОстатков);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);		
			СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуРегл", КоэффициентПересчетаИзВалютыУпрВРегл);
			СтруктураДействий.Вставить("ПересчитатьНДСРегл", СтруктураПересчетаСуммы);
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекСтрока, СтруктураДействий, Неопределено);
			
		КонецЕсли;			
	КонецЦикла;	
	// -- 31.03.2021

	Попытка
		ДокументВводОстатков.Записать(РежимЗаписиДокумента.Проведение);
		
		// ++ 21.11.2020
		Для Каждого СтрокаИнженер Из МассивСтрокДляКоторыхВведенВводОстатков Цикл
			СтрокаИнженер.ДокументВводОстатков = ДокументВводОстатков.Ссылка;
		КонецЦикла;		
		// --

	Исключение
		СинонимДокумента = ДокументВводОстатков.Метаданные().Синоним;
		//ДокументВводОстатков.Записать(РежимЗаписиДокумента.Запись);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		//|" + ОписаниеОшибки() + "
		//|Документ записан без проведения.");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ не создан.");
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументВводОстатков.Ссылка;
	
КонецФункции

// ++ 31.03.2021
&НаСервере
Функция ПолучитьЦеныНоменклатуры(МассивНоменклатуры, ВидЦеныДляОприходования, ДатаСведений)
	
	СоответствиеРезультат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаСреза,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В (&МассивНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", 			ВидЦеныДляОприходования);
	Запрос.УстановитьПараметр("ДатаСреза", 			ДатаСведений);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеРезультат.Вставить(Выборка.Номенклатура, Выборка.Цена);
	КонецЦикла;

	Возврат СоответствиеРезультат;
	
КонецФункции

// ++ 21.06.2020
&НаСервере
Функция СоздатьПервичныйДокумент(ДатаДокумента)
	
	ДокументПервичныйДокумент = Документы.ПервичныйДокумент.СоздатьДокумент();
	
	ДокументПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ВнутренняяНакладная;
	ДокументПервичныйДокумент.Дата 			= ДатаДокумента;
	ДокументПервичныйДокумент.Номер 			= Объект.Номер;
	ДокументПервичныйДокумент.Организация 	= Объект.Организация;
	ДокументПервичныйДокумент.Комментарий  	= ПолучитьТекстКомментарияКДокументу();
	//ДокументПервичныйДокумент.Валюта 		= ДанныеСтроки.Валюта;
	//ДокументПервичныйДокумент.СуммаДокумента = ДанныеСтроки.Сумма;
	//ДокументПервичныйДокумент.СуммаРегл 		= ДанныеСтроки.СуммаРегл;
	ДокументПервичныйДокумент.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
	
	СинонимДокумента = ДокументПервичныйДокумент.Метаданные().Синоним;

	
	
	Попытка
		ДокументПервичныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ДокументПервичныйДокумент.Ссылка;
	Исключение
		СинонимДокумента = ДокументПервичныйДокумент.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ не создан.");
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// ++ 27.02.2020
&НаСервере
Функция СоздатьДокументЗаказНаСборкуТоваров(Номенклатура, АналогНоменклатуры, КоличествоН)
	УстановитьПривилегированныйРежим(Истина);
	ДокументЗаказ = Документы.ЗаказНаСборку.СоздатьДокумент();
	
	ТекДата = ТекущаяДата();
	
	ДокументЗаказ.Дата 				= ТекДата;
	ДокументЗаказ.Организация 		= Объект.Организация;
	ДокументЗаказ.Склад 			= Объект.СкладИнженера;
	ДокументЗаказ.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	//ДокументЗаказ.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументЗаказ.Статус 					= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокументЗаказ.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СборкаТоваров;
	ДокументЗаказ.Номенклатура 				= Номенклатура;
	ДокументЗаказ.Количество 				= КоличествоН;
	ДокументЗаказ.КоличествоУпаковок		= КоличествоН;
	ДокументЗаказ.НачалоСборкиРазборки 		= ТекДата;
	ДокументЗаказ.ОкончаниеСборкиРазборки 	= ТекДата;
	ДокументЗаказ.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Требуется;
	ДокументЗаказ.СборкаПодДеятельность 	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокументЗаказ.ВариантПриемкиТоваров 	= Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	//++ #1287 смарт: Фролов 10.03.2023 //Работа с гарантийными и коммерческими запасными частями  
	ДокументЗаказ.ДокументОснование			= Объект.Ссылка;
	//-- #1287 смарт: Фролов 10.03.2023
	Комментарий = ПолучитьТекстКомментарияКДокументу();
	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		Комментарий = Объект.Номер;
	КонецЕсли;
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументЗаказ.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	ДокументЗаказ.Комментарий = "" + Комментарий + Символы.ПС + "отправляли " + Номенклатура.Артикул 
			+ Символы.ПС + "фактически получили " + АналогНоменклатуры.Артикул
			+ Символы.ПС + АналогНоменклатуры.Артикул + " переделана в " + Номенклатура.Артикул + " путем сборки";

	НоваяСтрока = ДокументЗаказ.Товары.Добавить();
	НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	НоваяСтрока.Количество = КоличествоН;
	НоваяСтрока.КоличествоУпаковок = КоличествоН;
	НоваяСтрока.Номенклатура = АналогНоменклатуры;
		
	Попытка
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СинонимДокумента = ДокументЗаказ.Метаданные().Синоним;
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.");
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ДокументЗаказ.Ссылка;
		
КонецФункции

// ++ 27.02.2020
&НаСервере
Функция СоздатьДокументСборкаТоваров(ЗаказНаСборку)
	
	Если НЕ ЗаказНаСборку.Проведен Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументСборка = Документы.СборкаТоваров.СоздатьДокумент();
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказНаСборку);

	ДанныеЗаполнения = Новый Структура;
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивЗаказов, "СборкаТоваров");
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	ДокументСборка.Заполнить(ДанныеЗаполнения);

	ДокументСборка.Дата = ТекущаяДата();
	ДокументСборка.Ответственный = Пользователи.ТекущийПользователь();
	ДокументСборка.Комментарий = ЗаказНаСборку.Комментарий;
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументСборка.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	Попытка
		ДокументСборка.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СинонимДокумента = ДокументСборка.Метаданные().Синоним;
		ДокументСборка.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.");
	КонецПопытки;
	
	Возврат ДокументСборка.Ссылка;
	
КонецФункции

&НаСервере
Функция СоздатьДокументЗаказНаПеремещение()
		
	ДокументЗаказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ДокументЗаказ.Организация 		= Объект.Организация;
	ДокументЗаказ.СкладОтправитель 	= Объект.СкладИнженера;
	ДокументЗаказ.СкладПолучатель 	= Объект.СкладГарантийныхЗапчастей;
	ДокументЗаказ.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	ДокументЗаказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументЗаказ.Статус 			= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокументЗаказ.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
	ДокументЗаказ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	ДокументЗаказ.Комментарий 		= ПолучитьТекстКомментарияКДокументу();
	//++ #1287 смарт: Фролов 10.03.2023 //Работа с гарантийными и коммерческими запасными частями
	ДокументЗаказ.ДокументОснование=Объект.Ссылка;
	//-- #1287 смарт: Фролов 10.03.2023
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументЗаказ.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
		
	СтрокиПоКоторымСоздалсяЗаказНаПеремещение = Новый Массив;
	
	Для Каждого ТекСтрока Из Объект.ЗаполняетсяИнженером Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
			Продолжить;
		КонецЕсли;
			
		// ++ 13.06.2020
		Если НЕ ТекСтрока.ЗапчастьОтКлиентаПринял
			// ++ 21.11.2020
			//// ++ 22.06.2020
			//И ЗначениеЗаполнено(ТекСтрока.НоменклатураУстановленнаяКлиенту)
			////
			Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиПоКоторымСоздалсяЗаказНаПеремещение.Добавить(ТекСтрока);
		
		// ++ 25.04.2020 - аналог из таблицы специалиста пока игнорируется
		
		//// ++ 27.02.2020
		//// Проверка, не является ли деталь аналогом. 
		//// Если да, то перемещать необходимо исходную деталь клиента (созданную сборкой), а не полученный от поставщика аналог
		
		// Номенклатура = ТекСтрока.Номенклатура; // Возможный аналог
		//ИсходнаяНоменклатура = ПолучитьИсходнуюНоменклатуру(Номенклатура);
		//
		//Если Номенклатура <> ИсходнаяНоменклатура Тогда // В табличной части Инженера сейчас аналог, из которого необходимо собрать исходную деталь 
		
		
		// ++ 21.06.2020
		Если НЕ ЗначениеЗаполнено(ТекСтрока.НоменклатураУстановленнаяКлиенту) Тогда 
			ЧтоСдаетсяНаСклад = ТекСтрока.НоменклатураПринятаяОтКлиента;
		Иначе
		// --
		//++
		// Если при нажатии Сдать на склад в строке отличаются запчасть, установленная клиенту, и запчасть, принятая от клиента, 
		// то делается документ сборки – из детали, установленной клиенту, собирается деталь, принятая от клиента
		ЧтоУстановленоУКлиента = ТекСтрока.НоменклатураУстановленнаяКлиенту; // Из чего собирается
		ЧтоСдаетсяНаСклад = ТекСтрока.НоменклатураПринятаяОтКлиента; // Что собирается

		// ++ 31.03.2021
		//Если ТекСтрока.НоменклатураПринятаяОтКлиента <> ТекСтрока.НоменклатураУстановленнаяКлиенту Тогда
		//	
		//// -- 25.04.2020
		//
		//	//ЗаказНаСборку = СоздатьДокументЗаказНаСборкуТоваров(ИсходнаяНоменклатура, Номенклатура);
		//	//ЗаказНаСборку = СоздатьДокументЗаказНаСборкуТоваров(ЧтоСдаетсяНаСклад, ЧтоУстановленоУКлиента); //закомментировано rnp 25.03.2021
		//	ЗаказНаСборку = СоздатьДокументЗаказНаСборкуТоваров(ЧтоСдаетсяНаСклад, ЧтоУстановленоУКлиента,ТекСтрока.Количество);//rnp 25.03.2021
		//	
		//	Если ЗаказНаСборку.Проведен Тогда
		//		
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + ЗаказНаСборку, ЗаказНаСборку);

		//		УстановитьПривилегированныйРежим(Истина);
		//		Сборка = СоздатьДокументСборкаТоваров(ЗаказНаСборку);
		//		УстановитьПривилегированныйРежим(Ложь);
		//		
		//		Если Сборка.Проведен Тогда
		//			//Номенклатура = ИсходнаяНоменклатура;
		//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + Сборка, Сборка);
		//		Иначе
		//			// Сборку создать не удалось, ничего не перемещается
		//			Продолжить;
		//		КонецЕсли;
		//	Иначе
		//		// Сборку создать не удалось, ничего не перемещается
		//		Продолжить;
		//	КонецЕсли;		
		//КонецЕсли;	
		// --	
		
		// ++ 21.06.2020
		КонецЕсли;
		// --
		НоваяСтрока = ДокументЗаказ.Товары.Добавить();
		НоваяСтрока.Количество 			= ТекСтрока.Количество;
		НоваяСтрока.КоличествоУпаковок	= ТекСтрока.Количество;
		//НоваяСтрока.Номенклатура 		= Номенклатура;
		НоваяСтрока.Номенклатура 		= ЧтоСдаетсяНаСклад;
		НоваяСтрока.НачалоОтгрузки 		= ТекущаяДата();
		НоваяСтрока.ОкончаниеПоступления 	= НоваяСтрока.НачалоОтгрузки;
		НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонт = Объект.Номер;
		НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Объект.Ссылка;
		//-- #Б1132 смарт: Шляпников 14.10.2024

	КонецЦикла;
		
	// ++ 27.02.2020
	Если ДокументЗаказ.Товары.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена номенклатура для перемещения");
		Возврат Неопределено;
	КонецЕсли;
	// --
	
	ДокументЗаказ.Дата = ТекущаяДата();
	
	//++ #6294 смарт: Тимофеева 30.03.2026 /  Перевод запчастей на серийный учет. ЗГР. Не отображается серия в документе Ввод начальных остатков.
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокументЗаказ, Документы.ЗаказНаПеремещение));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументЗаказ, ПараметрыУказанияСерий);
	
	СерииПоУмолчаниюСоответствие = смартСервер.ПолучитьСерииПоУмолчаниюСоответствие();
	Для Каждого ТекСтрока Из ДокументЗаказ.Товары Цикл
		Если ТекСтрока.СтатусУказанияСерий = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура, "ВидНоменклатуры");
		СерияПоУмолчанию = СерииПоУмолчаниюСоответствие.Получить(ВидНоменклатуры);    
		
		Если НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(ТекСтрока.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда
			ТекСтрока.Серия = СерияПоУмолчанию;	
		КонецЕсли;
	КонецЦикла;
	//-- #6294 смарт: Тимофеева 30.03.2026 
	
	Попытка
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СинонимДокумента = ДокументЗаказ.Метаданные().Синоним;
		 //++ смарт:ПА #874 27.01.2022 10:46:31
        Попытка                                          
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
            |" + ОписаниеОшибки() + "
            |Документ записан без проведения.");
            ДокументЗаказ.Записать(РежимЗаписиДокумента.Запись);
        Исключение
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ """ + СинонимДокумента + """ по причине
            |" + ОписаниеОшибки() + "
            |Документ не записан."); 
        КонецПопытки;  
        //-- смарт:ПА #874 27.01.2022 10:46:31
	КонецПопытки;
	
	// 08.04.2020
	Для Каждого Строка Из СтрокиПоКоторымСоздалсяЗаказНаПеремещение Цикл
		Строка.ЗаказНаПеремещениеЗапчастейСИнженера = ДокументЗаказ.Ссылка;
	КонецЦикла;
	
	Возврат ДокументЗаказ.Ссылка;
	
КонецФункции

// ++ 27.02.2020
&НаСервере
Функция ПолучитьИсходнуюНоменклатуру(ПроверяемаяНоменклатура)
	
	Для Каждого Строка Из Объект.ЗаполняетсяСпециалистомПоПретензиям Цикл
		Если ПроверяемаяНоменклатура = Строка.АналогОтПоставщика Тогда
			Возврат Строка.Номенклатура;
		КонецЕсли;	
	КонецЦикла;
	
	// Аналогов не было, поставщик прислал исходную номенклатуру
	Возврат ПроверяемаяНоменклатура;
	
КонецФункции

&НаСервере
Функция СоздатьДокументПеремещениеТоваров(ЗаказНаПеремещение, ВзятьНаСкладе = Ложь)
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказНаПеремещение);

	ДанныеЗаполнения = Новый Структура;
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивЗаказов, "ПеремещениеТоваров");
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	ДокументПеремещение.Заполнить(ДанныеЗаполнения);
	
	ДокументПеремещение.Дата = ЗаказНаПеремещение.Дата;
	
	ДокументПеремещение.Комментарий = ПолучитьТекстКомментарияКДокументу();
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументПеремещение.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	Для Каждого Строка Из ДокументПеремещение.Товары Цикл
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//Строка.смартНомерЗаявкиНаГарантийныйРемонт = Объект.Номер;
		Строка.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Объект.Ссылка;
		//-- #Б1132 смарт: Шляпников 14.10.2024
	КонецЦикла;
	
	Попытка
		ДокументПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + ДокументПеремещение.Ссылка, ДокументПеремещение.Ссылка);
	Исключение
		// ++ 18.10.2020
		Если ВзятьНаСкладе Тогда
			// ++ 28.01.2021
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На складе " + ДокументПеремещение.СкладОтправитель + " не хватает товаров для перемещения. Обратитесь на help1C@smart-t.ru.");								
			// --
			Возврат Неопределено;
		Иначе
			
            СинонимДокумента = ДокументПеремещение.Метаданные().Синоним;
            //++ смарт:ПА #874 27.01.2022 10:45:46
            Попытка                                                 
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
                |" + ОписаниеОшибки() + "
                |Документ будет записан без проведения.", ДокументПеремещение.Ссылка);
                ДокументПеремещение.Записать(РежимЗаписиДокумента.Запись);     
            исключение
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать документ """ + СинонимДокумента + """ по причине
                |" + ОписаниеОшибки() + "
                |Документ не записан.", ДокументПеремещение.Ссылка);
            КонецПопытки;   
            //-- смарт:ПА #874 27.01.2022 10:45:46
		КонецЕсли;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументПеремещение.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатусОприходования(ЗаказНаПеремещение, ДокументОприходования, Номенклатура = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеТоваров.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДвижениеТоваров.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|				ТОГДА ДвижениеТоваров.Регистратор
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.ПриходныйОрдерНаТовары.ПустаяСсылка)
	|		КОНЕЦ) КАК ПриходныйОрдер,
	|	СУММА(ДвижениеТоваров.ПланируемоеПоступление) КАК ПланируемоеПоступление,
	|	СУММА(ВЫБОР
	|			КОГДА ДвижениеТоваров.Регистратор ССЫЛКА Документ.ЗаказНаПеремещение
	|				ТОГДА ДвижениеТоваров.ПланируемоеПоступление
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВЗаказе,
	|	СУММА(ВЫБОР
	|			КОГДА ДвижениеТоваров.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|				ТОГДА -ДвижениеТоваров.ПланируемоеПоступление
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВПриходныхОрдерах
	|ИЗ
	|	РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
	|ГДЕ
	|	(ВЫРАЗИТЬ(ДвижениеТоваров.Распоряжение КАК Документ.ЗаказНаПеремещение)) = &ЗаказНаПеремещение
	|	И ВЫБОР
	|			КОГДА ДвижениеТоваров.Регистратор ССЫЛКА Документ.ЗаказНаПеремещение
	|				ТОГДА ИСТИНА
	|			КОГДА ДвижениеТоваров.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоНоменклатуре
	|				ТОГДА ДвижениеТоваров.Номенклатура = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвижениеТоваров.Номенклатура";
	
	Запрос.УстановитьПараметр("ЗаказНаПеремещение", 	ЗаказНаПеремещение);
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре", 	?(ЗначениеЗаполнено(Номенклатура), Истина, Ложь));
	Запрос.УстановитьПараметр("Номенклатура", 			Номенклатура);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ДокументОприходования = Выборка.ПриходныйОрдер;
	
	Если Выборка.ПланируемоеПоступление = 0 Тогда
		Возврат "Оприходованы";
	КонецЕсли;
	
	Если Выборка.КоличествоВПриходныхОрдерах <> Неопределено И Выборка.КоличествоВПриходныхОрдерах <> 0 Тогда
		Возврат "ОприходованыЧастично";
	Иначе
		Возврат "НеОприходованы";
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСпециалистаПоПретензиям(ДокументОприходования)
	
	СтатусОжидаютсяДействия = Перечисления.смартСтатусыПоГарантии.ОжидаютсяДействия;
	
	// 08.04.2020
	//ДатаИзмененияСтатуса = Дата("00010101");
	//
	//Если ЗначениеЗаполнено(Объект.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
	//	ДатаИзмененияСтатуса = Объект.ЗаказНаПеремещениеЗапчастейСИнженера.Дата;
	//КонецЕсли;
	
	//Объект.Статусы.Очистить();
	//--
	
	// ++ 13.12.2020
	Об = РеквизитФормыВЗначение("Объект");
	// --
	
	НомерСтроки = Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() + 1;
	
	УжеОбработанныеСтроки = Объект.ЗаполняетсяСпециалистомПоПретензиям.Выгрузить().ВыгрузитьКолонку("ИДСтрокиЗаполняетсяИнженером");
	Если Объект.ЗаполняетсяСпециалистомПоПретензиям.Количество() < Объект.ЗаполняетсяИнженером.Количество() Тогда //временно для обновления реквизитов

	Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
		
		Если УжеОбработанныеСтроки.Найти(СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		

		Для Сч = 1 По СтрокаИнженер.Количество Цикл
			
			СтрокаПретензия = Объект.ЗаполняетсяСпециалистомПоПретензиям.Добавить();
			//СтрокаПретензия.Номенклатура 	= СтрокаИнженер.Номенклатура;
			СтрокаПретензия.Номенклатура 	= СтрокаИнженер.НоменклатураПринятаяОтКлиента;
			СтрокаПретензия.Количество 		= 1;
			СтрокаПретензия.Статус 			= СтатусОжидаютсяДействия;
			СтрокаПретензия.НомерПозиции 	= НомерСтроки;
			
			// 08.04.2020
			ДатаИзмененияСтатуса = СтрокаИнженер.ЗаказНаПеремещениеЗапчастейСИнженера.Дата;
			СтрокаПретензия.ИДСтрокиЗаполняетсяИнженером = СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;
			//--
			// 07.06.2020
			СтрокаПретензия.ДатаДобавления = ТекущаяДата();
			
			// ++ 13.12.2020
			СтрокаПретензия.Контрагент = Об.ПолучитьКонтрагентаДляТЧСпециалиста();
			// --
		
			ДобавитьСтрокуСтатусаНаСервере(НомерСтроки, ДатаИзмененияСтатуса, СтатусОжидаютсяДействия, ДокументОприходования);
						
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
	
		
		
	КонецЦикла;
	КонецЕсли;//временно для обновления реквизитов
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	Сч = 1;
	ИДСтроки = 0;
	//Если ТаблицаТоваров.Количество() > 0 Тогда
	//	СтрокаТовара = ТаблицаТоваров[0];
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл	
		
		ДобавляетсяНоваяСтрока = Ложь;
		
		Если Сч = 1 Тогда			
			ТекущаяСтрока = Объект.ЗаполняетсяИнженером.НайтиПоИдентификатору(ИдентификаторРедактируемойСтроки);
			//ИДСтроки = ИдентификаторРедактируемойСтроки
		ИначеЕсли Сч = 2 Тогда
			ИДСтроки = ПолучитьСледующийИДСтроки();
			ДобавляетсяНоваяСтрока = Истина;
		Иначе
			ИДСтроки = ИДСтроки + 1;			
			ДобавляетсяНоваяСтрока = Истина;
		КонецЕсли;
		
		Если ДобавляетсяНоваяСтрока Тогда
			ТекущаяСтрока = Объект.ЗаполняетсяИнженером.Добавить();
			ТекущаяСтрока.ИДСтрокиЗаполняетсяИнженером = ИДСтроки;	
		КонецЕсли;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.НоменклатураУстановленнаяКлиенту = СтрокаТовара.Номенклатура;
			
			// ++ 27.11.2020
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
			// --
			ТекущаяСтрока.Количество = СтрокаТовара.Количество;
			// ++ 15.12.2020
			ТекущаяСтрока.ПредыдущееКоличество = СтрокаТовара.Количество;
			
			// ++ 27.11.2020
			КонецЕсли;
			// --
			// ++ 13.10.2020
			ТекущаяСтрока.ДокументПолученияЗапчасти = НайтиДокументЗаказНаПеремещение(ТекущаяСтрока.НоменклатураУстановленнаяКлиенту);
			// ++ 30.06.2021
			Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументПолученияЗапчасти) 
				И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Склад) Тогда
				ТекущаяСтрока.Склад = ТекущаяСтрока.ДокументПолученияЗапчасти.СкладОтправитель;
			КонецЕсли;
			// --
		КонецЕсли;		
				
		Сч = Сч + 1;
		
	КонецЦикла;

	// ++ 29.02.2020
	Если ТаблицаТоваров.Количество() > 0 Тогда
		ЭтаФорма.Модифицированность = Истина;
		//НастроитьВидимостьДоступность();
	КонецЕсли;
	// --
	// ++ 30.06.2021
	НастроитьВидимостьДоступность();
	// --
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		НомерТекущейСтроки = ТекущиеДанные.НомерПозиции;	
		Элементы.Статусы.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерПозиции", НомерТекущейСтроки);
		
		// 30.04.2020
		Элементы.ИсторияРешенийПоставщика.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерПозиции", НомерТекущейСтроки);
		Элементы.ДополнительныеДействия.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерПозиции", НомерТекущейСтроки);
		//
		
		НастроитьВидимостьДоступностьЭлементовПоСтатусу(ТекущиеДанные.Статус, НомерТекущейСтроки);
		
		// ++ 26.04.2020 - очищалась дата отправки при активизации строки
		//// 06.04.2020
		//ЗаполнитьЗависимыеОтСтатусаКолонки(ТекущиеДанные, Истина);
		
		// 31.03.2020
		ДополнительныеСтатусы.Параметры.УстановитьЗначениеПараметра("Артикул", ПолучитьАртикул(ТекущиеДанные.Номенклатура));

		// ++ 27.11.2020
		НастроитьВидимостьДоступностьЭлементовСпециалист(ТекущиеДанные);
		// --
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАртикул(Номенклатура)
	
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Номенклатура.Артикул;
	
КонецФункции

&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		НечемЗаменить = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.НечемЗаменить");
		ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
		ТекущиеДанные.Статус = НечемЗаменить;
		ТекущиеДанные.НомерПозиции = ПолучитьСледующийНомерПозиции();
		// 07.06.2020
		ТекущиеДанные.ДатаДобавления = ТекущаяДата();
		
		ДобавитьСтрокуСтатусаНаСервере(ТекущиеДанные.НомерПозиции, ТекущаяДата(), НечемЗаменить);

		Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущаяСтрока = ТекущиеДанные.НомерСтроки;

	КонецЕсли;
	
КонецПроцедуры

// ++ 27.01.2021
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Если Копирование Тогда
	//	ТекСтрока = Элемент.ТекущиеДанные; 
	//	ТекСтрока.НомерПозиции = ПолучитьСледующийНомерПозиции(); 
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямПередУдалением(Элемент, Отказ)
	
	НомерПозиции = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные.НомерПозиции;
	
	УдалитьСтрокиСтатусаНаСервере(НомерПозиции);
	
	//++ #5824 смарт: Тимофеева 05.03.26 / Заявка на гарантийный ремонт. Расширение доступа для Специалиста по претензиям
	ИнформироватьОНеобходимостиУдаленияСтрокиВТаблице(Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером, "ЗаполняетсяИнженером");						
	//-- #5824 смарт: Тимофеева 05.03.26

КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиСтатусаНаСервере(НомерПозиции)
		
	Сч = Объект.Статусы.Количество() - 1;

	Пока Сч >= 0 Цикл
		
		СтрокаСтатус = Объект.Статусы[Сч];
		Если СтрокаСтатус.НомерПозиции = НомерПозиции Тогда
			Объект.Статусы.Удалить(СтрокаСтатус);
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ДокументНеобходимоПровести()
	
	ДокументНеобходимоПровести = Ложь;
	
	Запрос = Новый Запрос;
	// 03.06.2020
	// если по детали с текущим статусом ОжидаетсяПоступление нет статуса ОтправленоПоставщику в таблице статусов, то можно не проводить,
	// т.е. обязательно проведение только если текущий статус ОжидаетсяПоступление и в истории есть статус ОтправленоПоставщику или текущий статус ОтправленоПоставщику
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаполняетсяСпециалистомПоПретензиям.Статус КАК Статус
	//|ПОМЕСТИТЬ ВТ_ТЧ
	//|ИЗ
	//|	&ТЧ КАК ЗаполняетсяСпециалистомПоПретензиям
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ТЧ.Статус КАК Статус
	//|ИЗ
	//|	ВТ_ТЧ КАК ВТ_ТЧ
	//|ГДЕ
	//|	ВТ_ТЧ.Статус В(&Статусы)";
	
	//МассивСтатусы = Новый Массив;
	//МассивСтатусы.Добавить(Перечисления.смартСтатусыПоГарантии.ОтправленоПоставщику);
	//МассивСтатусы.Добавить(Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление);
	
	//Запрос.УстановитьПараметр("ТЧ", 		Объект.ЗаполняетсяСпециалистомПоПретензиям.Выгрузить());
	//Запрос.УстановитьПараметр("Статусы", 	МассивСтатусы);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	ДокументНеобходимоПровести = Истина;
	//КонецЕсли;


	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартЗаявкаНаГарантийныйРемонтСтатусы.НомерПозиции КАК НомерПозиции,
	|	смартЗаявкаНаГарантийныйРемонтСтатусы.Статус КАК Статус
	|ПОМЕСТИТЬ ВТ_Сатусы
	|ИЗ
	|	&ТЧСтатусы КАК смартЗаявкаНаГарантийныйРемонтСтатусы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаполняетсяСпециалистомПоПретензиям.НомерСтроки КАК НомерСтроки,
	|	ЗаполняетсяСпециалистомПоПретензиям.НомерПозиции КАК НомерПозиции,
	|	ЗаполняетсяСпециалистомПоПретензиям.Статус КАК Статус
	|ПОМЕСТИТЬ ВТ_ЗаполняетсяСпециалистомПоПретензиям
	|ИЗ
	|	&ТЧЗаполняетсяСпециалистом  КАК ЗаполняетсяСпециалистомПоПретензиям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаполняетсяСпециалистомПоПретензиям.НомерСтроки,
	|	ВТ_ЗаполняетсяСпециалистомПоПретензиям.НомерПозиции КАК НомерПозиции,
	|	ВТ_ЗаполняетсяСпециалистомПоПретензиям.Статус КАК Статус
	|ПОМЕСТИТЬ ВТ_СтрокиДляПроверки
	|ИЗ
	|	ВТ_ЗаполняетсяСпециалистомПоПретензиям КАК ВТ_ЗаполняетсяСпециалистомПоПретензиям
	|ГДЕ
	|	ВТ_ЗаполняетсяСпециалистомПоПретензиям.Статус В(&Статусы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиДляПроверки.НомерСтроки,
	|	ВТ_СтрокиДляПроверки.НомерПозиции КАК НомерПозиции,
	|	ВТ_СтрокиДляПроверки.Статус,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_Сатусы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПоГарантии.ОтправленоПоставщику)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОтправлялосьПоставщику
	|ИЗ
	|	ВТ_СтрокиДляПроверки КАК ВТ_СтрокиДляПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сатусы КАК ВТ_Сатусы
	|	    ПО ВТ_СтрокиДляПроверки.НомерПозиции = ВТ_Сатусы.НомерПозиции 
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтрокиДляПроверки.НомерСтроки,
	|	ВТ_СтрокиДляПроверки.НомерПозиции,
	|	ВТ_СтрокиДляПроверки.Статус
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_Сатусы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПоГарантии.ОтправленоПоставщику)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА";
	
	СтатусОтправленоПоставщику = Перечисления.смартСтатусыПоГарантии.ОтправленоПоставщику;
	МассивСтатусы = Новый Массив;
	МассивСтатусы.Добавить(СтатусОтправленоПоставщику);
	//++ смарт:ММ #044 224 20.07.2020
	//МассивСтатусы.Добавить(Перечисления.смартСтатусыПоГарантии.ОжидаетсяПоступление);
	МассивСтатусы.Добавить(Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление);
	//-- смарт:ММ 20.07.2020

	Запрос.УстановитьПараметр("Статусы", 	МассивСтатусы);
	Запрос.УстановитьПараметр("ТЧСтатусы", 	Объект.Статусы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧЗаполняетсяСпециалистом", Объект.ЗаполняетсяСпециалистомПоПретензиям.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДокументНеобходимоПровести = ?(Выборка.Количество() = 0, Ложь, Истина);
	
	Если ДокументНеобходимоПровести Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ необходимо провести, т.к." + Символы.ПС);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Статус = СтатусОтправленоПоставщику Тогда
			ТекстСообщения = "	в строке " + Выборка.НомерСтроки + " установлен статус ""Отправлено поставщику"""; 
		Иначе
			ТекстСообщения = "	в строке " + Выборка.НомерСтроки + " в истории был статус ""Отправлено поставщику""";
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Возврат ДокументНеобходимоПровести;
	
КонецФункции

&НаКлиенте
Процедура НастроитьВидимостьДоступностьЭлементовПоСтатусу(Статус, НомерПозиции)
	
	Если НЕ ДоступенСпециалистПоПретензиям() Тогда
		Возврат;
	КонецЕсли;
		
	//Элементы.ЗаполняетсяСпециалистомПоПретензиямКонтрагент.ТолькоПросмотр = Истина;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтправленоПоставщику") 
		// ++ 15.04.2020
		ИЛИ Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка") Тогда
		// --
		Элементы.ЗаполняетсяСпециалистомПоПретензиямГруппаДатаНомерОтправления.ТолькоПросмотр = Ложь;
		//Элементы.ЗаполняетсяСпециалистомПоПретензиямКонтрагент.ТолькоПросмотр = Ложь;
	Иначе		
		Элементы.ЗаполняетсяСпециалистомПоПретензиямГруппаДатаНомерОтправления.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//++ смарт:ММ #044 224 20.07.2020
	//Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Компенсация") Тогда
	Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.Компенсация") Тогда
	//-- смарт:ММ 20.07.2020
		Элементы.ЗаполняетсяСпециалистомПоПретензиямГруппаКомпенсация.ТолькоПросмотр = Ложь;
		//Элементы.ЗаполняетсяСпециалистомПоПретензиямКонтрагент.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ЗаполняетсяСпециалистомПоПретензиямГруппаКомпенсация.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//// ++ 27.02.2020
	//Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтгрузкаНеТребуется") Тогда
	//	Элементы.ЗаполняетсяСпециалистомПоПретензиямКонтрагент.ТолькоПросмотр = Ложь;
	//КонецЕсли; 
	//// --
	
	// ++ 21.06.2020
	//Элементы.ЗаполняетсяСпециалистомПоПретензиямОбновитьСтатус.Доступность = Ложь;
	//
	//Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика")
	//	И ЕстьВИсторииСтрокиСтатус(ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.НечемЗаменить"), НомерПозиции) Тогда
	//	
	//	Элементы.ЗаполняетсяСпециалистомПоПретензиямОбновитьСтатус.Доступность = Истина;
	//	
	//КонецЕсли;
	// --
	
	// 25.04.2020
	// Доступность кнопки ОтменитьОтправку
	// Доступна только если в текущей строке статус «ожидается отправка» и в таблице статусов заполнен документ возврата поставщику
	
	Элементы.ЗаполняетсяСпециалистомПоПретензиямОтменитьОтправку.Доступность = Ложь;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка") 
		// ++ 08.10.2020
		ИЛИ Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Отправлено")
		// --
		Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", НомерПозиции);
		Отбор.Вставить("Статус", Статус);
		
		НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(НайденныеСтроки[0].ДокументДвижения) 
				// ++ 08.10.2020
				ИЛИ Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Отправлено") // Этому статусу никакой документ не соответствует
				// --
				Тогда  // Статусу ОжидаетсяОтправка соответствует документ движения Возврат товаров поставщику
				Элементы.ЗаполняетсяСпециалистомПоПретензиямОтменитьОтправку.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

// ++ 06.04.2020
&НаКлиенте
Процедура ЗаполнитьЗависимыеОтСтатусаКолонки(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статус = ТекущиеДанные.Статус;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОтправленоПоставщику") Тогда
		ТекущиеДанные.ДатаОтправления = ТекущаяДата();
	//Иначе
	//	ТекущиеДанные.ДатаОтправления = Дата(1, 1, 1);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКолонокКомпенсации()
	
	//++ смарт:ММ #044 224 20.07.2020
	//СтатусКомпенсация = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.Компенсация");
	СтатусКомпенсация = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.Компенсация");
	//-- смарт:ММ 20.07.2020
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Статус", СтатусКомпенсация);
	НайденныеСтроки = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.ЗаполняетсяСпециалистомПоПретензиямГруппаКомпенсация.Видимость = Истина;
	Иначе
		Элементы.ЗаполняетсяСпециалистомПоПретензиямГруппаКомпенсация.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрефиксНаСервере(текПоставщик)
	Возврат смартОбщегоНазначения.ПолучитьПрефиксКонтрагентаПартнера(текПоставщик);
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуСтатусаНаСервере(НомерПозиции, ДатаСтатуса, Статус, ДокументОприходования = Неопределено)
	
	СтрокаСтатус = Объект.Статусы.Добавить();
	СтрокаСтатус.НомерПозиции 			= НомерПозиции;
	СтрокаСтатус.ДатаИзмененияСтатуса 	= ДатаСтатуса;
	СтрокаСтатус.Статус 				= Статус;
	СтрокаСтатус.ДокументДвижения 		= ДокументОприходования;

КонецПроцедуры

Функция ПолучитьТекстКомментарияКДокументу()
	
	Возврат Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(, Объект.Номер);
	
КонецФункции

Функция ПолучитьСледующийНомерПозиции()
	
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.ПолучитьСледующийНомерПозиции();
	
	//МаксимальныйСуществующийНомерПозиции = 0;
	//
	//Для Каждого Строка Из Объект.ЗаполняетсяСпециалистомПоПретензиям Цикл
	//	
	//	Если Строка.НомерПозиции > МаксимальныйСуществующийНомерПозиции Тогда
	//		МаксимальныйСуществующийНомерПозиции = Строка.НомерПозиции;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Возврат МаксимальныйСуществующийНомерПозиции + 1;
	
КонецФункции

&НаСервере
Процедура УстановитьСтатусЗакрытаЕслиВозможно(СтатусПоСтроке)
	
	// ++ 29.02.2020
	Возврат;
	
	//Если СтатусПоСтроке = Перечисления.смартСтатусыПоГарантии.ВГарантииОтказано
	//	// ++ 27.02.2020
	//	//ИЛИ СтатусПоСтроке = Перечисления.смартСтатусыПоГарантии.ОтгрузкаНеТребуется
	//	// --
	//	ИЛИ СтатусПоСтроке = Перечисления.смартСтатусыПоГарантии.Компенсация Тогда
	//	
	//	Об = РеквизитФормыВЗначение("Объект");
	//	ЗаявкуМожноЗакрыть = Об.ЗаявкуМожноЗакрыть(,);
	//	
	//	Если ЗаявкуМожноЗакрыть Тогда
	//		Объект.Статус = Перечисления.СтатусыКассовойСмены.Закрыта;
	//	КонецЕсли;
	//	
	//КонецЕсли;
		
КонецПроцедуры

&НаСервере
//Процедура ОбновитьСтатусНаСервере(Номенклатура, НомерПозиции, СтатусОжидаютсяДействия)
Процедура ОбновитьСтатусНаСервере(Номенклатура, НомерПозиции, СтатусОжидаютсяДействия, ИДСтрокиЗаполняетсяИнженером)
	
	ДокументОприходования = Неопределено;
	
	// ++ 08.04.2020
	//ЗаказНаПеремещение = Объект.ЗаказНаПеремещениеЗапчастейСИнженера;
	ЗаказНаПеремещение = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
	
	НайденныеСтроки = Объект.ЗаполняетсяИнженером.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ЗаказНаПеремещение = НайденныеСтроки[0].ЗаказНаПеремещениеЗапчастейСИнженера;
	КонецЕсли;
		
	СтатусОприходованияЗапчастиНаСкладГарантия = ПолучитьСтатусОприходования(ЗаказНаПеремещение, ДокументОприходования, Номенклатура);
			
	Если СтатусОприходованияЗапчастиНаСкладГарантия = "Оприходованы" Тогда
		
		Если ДокументОприходования <> Неопределено Тогда
            
            Если ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
                ДатаИзмененияСтатуса = ЗаказНаПеремещение.Дата;
            Иначе
                ДатаИзмененияСтатуса = ДокументОприходования.Дата;
            КонецЕсли;
            
            //++ смарт:Подкин #933 31.03.2022 15:07:58
            НайденСтатус=Объект.Статусы.НайтиСтроки(Новый Структура("НомерПозиции,Статус,ДокументДвижения",НомерПозиции,ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаютсяДействия"),ДокументОприходования)); 
            Если НЕ НайденСтатус.Количество() Тогда  
                СтатусОжидаютсяДействия = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантии.ОжидаютсяДействия");
                ДобавитьСтрокуСтатусаНаСервере(НомерПозиции, ДатаИзмененияСтатуса, СтатусОжидаютсяДействия, ДокументОприходования);
                Модифицированность = Истина;
            КонецЕсли;  
            //-- смарт:Подкин #933 31.03.2022 15:07:58 
            
        КонецЕсли;
        
	ИначеЕсли СтатусОприходованияЗапчастиНаСкладГарантия = "ОприходованыЧастично" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запчасть """ + Номенклатура + """ оприходована на склад частично. Статус не обновлен."); 
		
	ИначеЕсли СтатусОприходованияЗапчастиНаСкладГарантия = "НеОприходованы" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запчасть """ + Номенклатура + """ не оприходована на склад. Статус не обновлен."); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьВИсторииСтрокиСтатус(Статус, НомерПозиции)
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерПозиции", НомерПозиции);
	Отбор.Вставить("Статус", Статус);
	
	НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступенСпециалистПоПретензиям()
	
	Если УправлениеДоступом.ЕстьРоль("ПолныеПрава") ИЛИ УправлениеДоступом.ЕстьРоль("смартСпециалистПоПретензиям") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

// ++ 29.02.2020
&НаСервере
Функция ПолучитьМассивДоступнойИнженеруНоменклатуры()
		
	МассивДоступнойНоменклатуры = Новый Массив;
	
	Для Каждого Строка Из Объект.ЗаполняетсяСпециалистомПоПретензиям Цикл
		Если ЗначениеЗаполнено(Строка.АналогОтПоставщика) Тогда
			МассивДоступнойНоменклатуры.Добавить(Строка.АналогОтПоставщика);
		Иначе
			МассивДоступнойНоменклатуры.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДоступнойНоменклатуры;
	
КонецФункции

// ++ 06.04.2020
&НаКлиенте
Процедура ДополнительныеСтатусыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Если НЕ Копирование Тогда
	//	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	//	Если ТекущиеДанные <> Неопределено Тогда
	//		Отказ = Истина;
	//		Номенклатура = ТекущиеДанные.Номенклатура;
	//		Количество = ТекущиеДанные.Количество;
	//		ОткрытьФорму("РегистрСведений.смартДополнительныеСтатусыГарантийныхЗапчастей.Форма.ФормаЗаписи",
	//			Новый Структура("ЗначенияЗаполнения", Новый Структура("НомерЗаявки, Номенклатура, Количество",
	//																	Объект.Номер, Номенклатура, Количество)));
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСерийномуНомеру()
	
	Если ЗначениеЗаполнено(Объект.Серия) Тогда
		
		ДанныеПоСерии = ПолучитьДанныеПоСерии(Объект.Серия);
		
		Если ЗначениеЗаполнено(ДанныеПоСерии.Номенклатура) Тогда
			Объект.Оборудование = ДанныеПоСерии.Номенклатура;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПоСерии.Контрагент) Тогда
			Объект.Контрагент = ДанныеПоСерии.Контрагент;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПоСерии.Партнер) Тогда
			Объект.Клиент = ДанныеПоСерии.Партнер;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// ++ 23.04.2020
&НаСервере
Функция ПолучитьДанныеПоСерии(мСерия)
	
	// 28.02.2021
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.ПолучитьДанныеПоСерии(мСерия);
			
КонецФункции

// ++ 08.04.2020
&НаСервере
Функция ПолучитьСледующийИДСтроки()
	
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.ПолучитьСледующийИДСтроки();
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.ИДСтрокиЗаполняетсяИнженером КАК ИДСтрокиЗаполняетсяИнженером
//	|ПОМЕСТИТЬ ВТ
//	|ИЗ
//	|	&ТЗ КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(МАКСИМУМ(ВТ.ИДСтрокиЗаполняетсяИнженером), 0) КАК ИДСтрокиЗаполняетсяИнженером
//	|ИЗ
//	|	ВТ КАК ВТ";
//	
//	Запрос.УстановитьПараметр("ТЗ", Объект.ЗаполняетсяИнженером.Выгрузить());
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.ИДСтрокиЗаполняетсяИнженером + 1;
//	КонецЕсли;
//	
//	Возврат 1;
	
КонецФункции

// ++ 10.04.2020
&НаСервере
Процедура ОбновитьРешенияПоставщика()
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаполняетсяСпециалистомПоПретензиям", Объект.ЗаполняетсяСпециалистомПоПретензиям.Выгрузить());
	Запрос.УстановитьПараметр("ИсторияРешенийПоставщика", Объект.ИсторияРешенийПоставщика.Выгрузить());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартЗаявкаНаГарантийныйРемонтИсторияРешенийПоставщика.НомерСтроки КАК НомерСтроки,
	|	смартЗаявкаНаГарантийныйРемонтИсторияРешенийПоставщика.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ВТ_ИсторияРешений
	|ИЗ
	|	&ИсторияРешенийПоставщика КАК смартЗаявкаНаГарантийныйРемонтИсторияРешенийПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции КАК НомерПозиции,
	|	ВЫРАЗИТЬ(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Артикулы
	|ИЗ
	|	&ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсторияРешений.НомерСтроки КАК НомерСтроки,
	|	ВТ_Артикулы.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	ВТ_ИсторияРешений КАК ВТ_ИсторияРешений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Артикулы КАК ВТ_Артикулы
	|		ПО ВТ_ИсторияРешений.НомерПозиции = ВТ_Артикулы.НомерПозиции";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.ИсторияРешенийПоставщика[Выборка.НомерСтроки - 1].Артикул = Выборка.Артикул;	
	КонецЦикла;	
	
КонецПроцедуры

// ++ 25.04.2020
&НаКлиенте
Процедура ОтменитьОтправку(Команда)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВыбранноеЗначение = "";
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , Новый КвалификаторыСтроки(150));
		
		ПараметрыСтруктура = Новый Структура;
		ПараметрыСтруктура.Вставить("НомерПозиции", ТекущиеДанные.НомерПозиции);
		// ++ 08.10.2020
		ПараметрыСтруктура.Вставить("СтатусСтроки", ТекущиеДанные.Статус);
		// --
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект, ПараметрыСтруктура);
		ПоказатьВводЗначения(Оповещение, ВыбранноеЗначение, "Введите причину отмены отправки", ОписаниеТипов);
		
	КонецЕсли;

КонецПроцедуры

// ++ 25.04.2020
&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗнач, ПараметрыСтруктура) Экспорт
	
	Если ЗначениеЗаполнено(ВыбЗнач) Тогда
		ОбработатьОтменуОтправки(ВыбЗнач, ПараметрыСтруктура);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отмены отправки запчасти поставщику необходимо указать причину");
	КонецЕсли;
	
КонецПроцедуры

// ++ 25.04.2020
&НаСервере
Процедура ОбработатьОтменуОтправки(КомментарийОтмены, ПараметрыСтруктура)
	
	// ++ 08.10.2020
	// 0. Если статус = Отправлено, то проверяется наличие Расходного ордера на товары в истории статусов для ОтправленоПоставщику
	// Если Расходный ордер проведен, то выдается сообщение пользователю, отправляется уведомление, дальнейшая обработка не происходит
	// Если Расходный ордер не проведен, то дополнительно удалить из истории статусов строку со статусом ОтправленоПоставщику
	// --
	
	// 1. в таблице статусов удаляется статус «Ожидается отправка», помечаются на удаление документы  Возврат поставщику
	// 2. в новую табчасть «Дополнительные действия» делается запись с текущей датой и комментарием, который ввел пользователь в качестве причины
	// 3. устанавливается признак "ОтменаОтправки" у документа
	
	Если ТипЗнч(ПараметрыСтруктура) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НомерПозиции = ПараметрыСтруктура.НомерПозиции;
	
	// ++ 08.10.2020
	
	СтатусСтроки = ПараметрыСтруктура.СтатусСтроки;

	СтатусОжидаетсяОтправка 	= Перечисления.смартСтатусыПоГарантии.ОжидаетсяОтправка;
	СтатусОтправлено 			= Перечисления.смартСтатусыПоГарантии.Отправлено;
	СтатусОтправленоПоставщику 	= Перечисления.смартСтатусыПоГарантии.ОтправленоПоставщику; // "Передано со склада для отправки"
	
	Если СтатусСтроки = СтатусОтправлено Тогда
		
		// Перед удалением Возврата поставщику необходимо проверить, есть ли проведенный Расходный ордер.
		// Если есть, то поругаться, отправить уведомление, Возврат поставщику не трогать
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", НомерПозиции);
		Отбор.Вставить("Статус", СтатусОтправленоПоставщику);
				
		НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			
			СтрокаСтатус = НайденныеСтроки[0];
			ДокументРасходныйОрдер = СтрокаСтатус.ДокументДвижения;
			
			Если ДокументРасходныйОрдер.Проведен И НЕ ДокументРасходныйОрдер.ПометкаУдаления Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Предварительно необходимо, чтобы склад распровел ордер, и затем повторить отмену отправки");
				ОтправитьУведомлениеОНеобходимостиРаспровестиРасходныйОрдер(ДокументРасходныйОрдер);
				
				Возврат;
			КонецЕсли;	
		КонецЕсли;		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	// --
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерПозиции", НомерПозиции);
	Отбор.Вставить("Статус", СтатусОжидаетсяОтправка);

	НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		
		СтрокаСтатус = НайденныеСтроки[0];
		ДокументВозвратПоставщику = СтрокаСтатус.ДокументДвижения;
		
		Если ЗначениеЗаполнено(ДокументВозвратПоставщику) Тогда
			ДокументВозвратПоставщикуОбъект = ДокументВозвратПоставщику.ПолучитьОбъект();
			ДокументВозвратПоставщикуОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
		Объект.Статусы.Удалить(СтрокаСтатус);
		
		// ++ 08.10.2020
		Если СтатусСтроки = СтатусОтправлено Тогда
			
			// Удалить строку со статусом Отправлено
			Отбор = Новый Структура;
			Отбор.Вставить("НомерПозиции", НомерПозиции);
			Отбор.Вставить("Статус", СтатусОтправлено);
			
			НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() <> 0 Тогда
				СтрокаСтатус = НайденныеСтроки[0];
				Объект.Статусы.Удалить(СтрокаСтатус);
			КонецЕсли;
			
			// Удалить строку со статусом ОтправленоПоставщику
			Отбор.Вставить("Статус", СтатусОтправленоПоставщику);
			
			НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() <> 0 Тогда
				СтрокаСтатус = НайденныеСтроки[0];
				Объект.Статусы.Удалить(СтрокаСтатус);
			КонецЕсли;
			
		КонецЕсли;

		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", НомерПозиции);
		// --

		НайденныеСтрокиСпециалист = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
		Если НайденныеСтрокиСпециалист.Количество() > 0 Тогда
			// ++ 08.10.2020
			//НайденныеСтрокиСпециалист[0].Статус = Перечисления.смартСтатусыПоГарантии.ОжидаютсяДействия;
			Статус = Перечисления.смартСтатусыПоГарантии.ОжидаютсяДействия; // "Сдано на склад, ожидаются действия"

			Отбор = Новый Структура;
			Отбор.Вставить("НомерПозиции", НомерПозиции);
			Отбор.Вставить("Статус", Статус);
			НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор); 
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("НомерПозиции", НомерПозиции);
				Отбор.Вставить("Статус", СтатусОтправлено);
				НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() <> 0 Тогда
					Статус = СтатусОтправлено; 
				Иначе
					Отбор = Новый Структура;
					Отбор.Вставить("НомерПозиции", НомерПозиции);
					НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() <> 0 Тогда
						Статус = НайденныеСтроки[0].Статус; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НайденныеСтрокиСпециалист[0].Статус = Статус;
			// --
		КонецЕсли;
				
		НоваяСтрокаКомментарий = Объект.ДополнительныеДействия.Добавить();
		НоваяСтрокаКомментарий.Дата 		= ТекущаяДата();
		НоваяСтрокаКомментарий.НомерПозиции = НомерПозиции;
		НоваяСтрокаКомментарий.Комментарий 	= КомментарийОтмены;
		
		Объект.ОтменаОтправки = Истина;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	// ++ 08.10.2020		
	УстановитьПривилегированныйРежим(Ложь);
	// --
	
КонецПроцедуры

// ++ 25.04.2020
&НаКлиенте
Процедура СтатусыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда

		ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.НомерПозиции = ТекущиеДанные.НомерПозиции;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ++ 25.04.2020
&НаСервере
Процедура ОбновитьКолонкуНоменклатурыРавны()
	
	Для Каждого Строка Из Объект.ЗаполняетсяИнженером Цикл
		Если Строка.НоменклатураПринятаяОтКлиента = Строка.НоменклатураУстановленнаяКлиенту Тогда
			Строка.НоменклатурыРавны = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// ++ 25.04.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромНоменклатурыРавныПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НоменклатурыРавны Тогда
			// 02.11.2020
			Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
			// --
			ТекущиеДанные.НоменклатураПринятаяОтКлиента = ТекущиеДанные.НоменклатураУстановленнаяКлиенту;
			// 02.11.2020
			КонецЕсли;
			//--
		Иначе	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// ++ 25.04.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромНоменклатураУстановленнаяКлиентуПриИзменении(Элемент)
	
	// ++ 22.07.2021 - не используется, закомментирована
	
	//ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	//
	//Если ТекущиеДанные <> Неопределено Тогда		
	//	// ++ 01.04.2021
	//	//Если ТекущиеДанные.НоменклатурыРавны и ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
	//	Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) 
	//		И НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураПринятаяОтКлиента) 
	//		И ТекущиеДанные.ЗапчастьОтКлиентаПринял = Истина Тогда
	//	// --
	//	    //++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
	//		Если НЕ НоменклатураДоступнаДляВыбора(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
	//			ТекущиеДанные.НоменклатураПринятаяОтКлиента = ПодобратьНоменклатуруНеLOA(ТекущиеДанные.НоменклатураУстановленнаяКлиенту);
	//		Иначе
	//		//-- смарт:ММ 15.07.2021
	//			
	//		ТекущиеДанные.НоменклатураПринятаяОтКлиента = ТекущиеДанные.НоменклатураУстановленнаяКлиенту;	
	//		//++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
	//		КонецЕсли;
	//		//-- смарт:ММ 15.07.2021
	//	КонецЕсли;
	//	
	//	// ++ 01.07.2020
	//	НастроитьДоступностьКолонок(ТекущиеДанные);
	//	
	//	// ++ 13.10.2020
	//	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументПолученияЗапчасти) Тогда
	//		ТекущиеДанные.ДокументПолученияЗапчасти = НайтиДокументЗаказНаПеремещение(ТекущиеДанные.НоменклатураУстановленнаяКлиенту);
	//		// ++ 30.06.2021
	//		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументПолученияЗапчасти) 
	//			И НЕ ЗначениеЗаполнено(ТекущиеДанные.Склад) Тогда
	//			ТекущиеДанные.Склад = ТекущиеДанные.ДокументПолученияЗапчасти.СкладОтправитель;
	//		КонецЕсли;

	//		НастроитьВидимостьДоступность();
	//		// --
	//	КонецЕсли;
	//	
	//КонецЕсли;

	// -- 22.07.2021
	
	//++ #1406 смарт: Фролов 24.07.2023 //Проверка механизма "Установка не требуется"  
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;  
	Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
		ТекущиеДанные.УстановкаНеТребуется=Ложь;
	КонецЕсли;	
	//-- #1406 смарт: Фролов 24.07.2023
КонецПроцедуры

// ++ 28.01.2021
&НаСервере
Функция ПолучитьМассивСкладовСДоступнымиОстатками(НоменклатураПринятаяОтКлиента, КоличествоДляВключенияВСписокСкладов, ИДСтрокиЗаполняетсяИнженером)
	
	НоменклатураДляПроверкиОстатка = НоменклатураПринятаяОтКлиента;
	
	Если Элементы.ЗаполняетсяСпециалистомПоПретензиямАналогОтПоставщика.Видимость = Истина Тогда
		
		// Есть заполненные колонки с аналогом. Проверка, указан ли аналог для текущей строки инженера
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
		
		СтрокиСпециалиста = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
		
		Если СтрокиСпециалиста.Количество() <> 0 Тогда
			
			СтатусПолученоОтПоставщика = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика");
			
			НомерПозиции = СтрокиСпециалиста[0].НомерПозиции;
			АналогОтПоставщикаИзТаблицыСпециалиста = СтрокиСпециалиста[0].АналогОтПоставщика;
			Если ЗначениеЗаполнено(АналогОтПоставщикаИзТаблицыСпециалиста) Тогда
				НоменклатураДляПроверкиОстатка = АналогОтПоставщикаИзТаблицыСпециалиста;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;

	МассивСкладов = Новый Массив;
	
	СформироватьТекстОстатокНаСкладах(НоменклатураДляПроверкиОстатка, МассивСкладов, КоличествоДляВключенияВСписокСкладов, Истина);
	
	// ++ 16.02.2021
	//СкладПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	
	Если БылоПоступлениеНаСкладДляГарантийныхЗапчастейПодЗаказ(ИДСтрокиЗаполняетсяИнженером) Тогда
		Если МассивСкладов.Найти(ОсновнойСкладДляЗапчастейПодЗаказ) = Неопределено Тогда
			МассивСкладов.Добавить(ОсновнойСкладДляЗапчастейПодЗаказ);
		КонецЕсли;
	Иначе
		Если МассивСкладов.Найти(ОсновнойСкладДляЗапчастейПодЗаказ) <> Неопределено Тогда
			МассивСкладов.Удалить(МассивСкладов.Найти(ОсновнойСкладДляЗапчастейПодЗаказ));
		КонецЕсли;		
	КонецЕсли;
	// --
		
	Возврат МассивСкладов;
	
КонецФункции

// ++ 01.07.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромЗапчастьОтКлиентаПринялПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда		
				
		// ++ 01.04.2021
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) 
			И НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураПринятаяОтКлиента) 
			И ТекущиеДанные.ЗапчастьОтКлиентаПринял = Истина Тогда
			//++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
			Если НЕ НоменклатураДоступнаДляВыбора(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
				ТекущиеДанные.НоменклатураПринятаяОтКлиента = ПодобратьНоменклатуруНеLOA(ТекущиеДанные.НоменклатураУстановленнаяКлиенту);
			Иначе
			//-- смарт:ММ 15.07.2021
			ТекущиеДанные.НоменклатураПринятаяОтКлиента = ТекущиеДанные.НоменклатураУстановленнаяКлиенту;	
			//++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
			КонецЕсли;
			//-- смарт:ММ 15.07.2021	
		КонецЕсли;
		// --
		
		НастроитьДоступностьКолонок(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

// ++ 26.04.2020
&НаКлиенте
Процедура ДобавитьЗапчастьПринятуюОтКлиента(Команда)
	
	//НоваяСтрока = Объект.ЗаполняетсяИнженером.Добавить();
	
КонецПроцедуры

// ++ 26.04.2020
&НаКлиенте
Процедура ПерейтиВСписок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПоследниеИзменения", Истина);
	
	Форма = ОткрытьФорму("РегистрСведений.смартДополнительныеСтатусыГарантийныхЗапчастей.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.КомпоновщикНастроек.Настройки.Отбор, "НомерЗаявки",
        Объект.Номер, ВидСравненияКомпоновкиДанных.Равно, ,Истина,
        РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Новый УникальныйИдентификатор);
			
КонецПроцедуры

// ++ 02.05.2020
&НаСервере
Процедура УстановитьДоступностьДатыНомера(мТолькоПросмотр)
	
	Элементы.Дата.ТолькоПросмотр = мТолькоПросмотр;
	Элементы.ВнешнийНомер.ТолькоПросмотр = мТолькоПросмотр;
	
	// ++ 15.12.2020
	Если УправлениеДоступом.ЕстьРоль("смартСпециалистПоПретензиям") Тогда
		Элементы.ВнешнийНомер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// --

	// ++ смарт: Белоусова 551 09.10.2021
	Если ЗначениеЗаполнено(объект.Ссылка) и не ЗначениеЗаполнено(ВнешнийНомер) Тогда
		Элементы.ВнешнийНомер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// -- смарт: Белоусова 551 09.10.2021
	
КонецПроцедуры

// ++ 01.07.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		НастроитьДоступностьКолонок(ТекущиеДанные);		
		
		// ++ 15.12.2020
		Элементы.ДополнительныеДействияИнженер.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДСтрокиЗаполняетсяИнженером", ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером);
		// --
		// ++ 27.01.2021
		// Событие ПриНачалеРедактирования почему-то не отрабатывает при добавлении первой строки, например (еще иногда при копировании)
		// Поэтому доп. проверка, если ИД = 0, то заполнить его
		Если ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером = 0 
			И НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураПринятаяОтКлиента) Тогда // Строка новая, чтобы не зацепить существующие документы
			ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером = ПолучитьСледующийИДСтроки();
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
		// --
		
	КонецЕсли;	
		
КонецПроцедуры

// ++ 01.07.2020
&НаКлиенте
Процедура НастроитьДоступностьКолонок(ТекущиеДанные)
	
	Элементы.ЗаполняетсяИнженеромНоменклатурыРавны.ТолькоПросмотр = Ложь;
	Элементы.ЗаполняетсяИнженеромДокументРазборки.ТолькоПросмотр = Ложь;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
		Элементы.ЗаполняетсяИнженеромНоменклатурыРавны.ТолькоПросмотр = Истина;
		Элементы.ЗаполняетсяИнженеромДокументРазборки.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// ++ 16.08.2020
	Если ЗначениеЗаполнено(ТекущиеДанные.ЗаказНаПеремещениеЗапчастейСИнженера) Тогда
		Элементы.ЗаполняетсяИнженеромЗапчастьОтКлиентаПринял.ТолькоПросмотр = Истина;
		Элементы.ЗаполняетсяИнженеромНоменклатурыРавны.ТолькоПросмотр = Истина;
		Элементы.ЗаполняетсяИнженеромНоменклатура.ТолькоПросмотр = Истина;
		Элементы.ЗаполняетсяИнженеромКоличество.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ЗаполняетсяИнженеромЗапчастьОтКлиентаПринял.ТолькоПросмотр = Ложь;
		Элементы.ЗаполняетсяИнженеромНоменклатурыРавны.ТолькоПросмотр = Ложь;
		Элементы.ЗаполняетсяИнженеромНоменклатура.ТолькоПросмотр = Ложь;
		Элементы.ЗаполняетсяИнженеромКоличество.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// --
	
    // ++ 27.11.2020
    Если ТекущиеДанные.Количество <= 1 Тогда
        //++ смарт:Подкин #909 17.02.2022 14:11:44  
        Элементы.ЗаполняетсяИнженеромРазбитьСтрокуИнженер.Доступность = Ложь;

    ИначеЕсли (ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту)
        ИЛИ ЗначениеЗаполнено(ТекущиеДанные.Склад) 
        ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументПолученияЗапчасти)
        ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументЗаказНаВнутреннееПотребление))
        И Не РолиДоступныСервер("ПолныеПрава") 
        //-- смарт:Подкин #909 17.02.2022 14:11:44
        Тогда
        Элементы.ЗаполняетсяИнженеромРазбитьСтрокуИнженер.Доступность = Ложь;
    Иначе
        Элементы.ЗаполняетсяИнженеромРазбитьСтрокуИнженер.Доступность = Истина;
    КонецЕсли;
    // --
	
	//Элементы.ЗаполняетсяИнженеромНоменклатура.ТолькоПросмотр = НЕ ТекущиеДанные.ЗапчастьОтКлиентаПринял;
	
КонецПроцедуры

//++ смарт:Подкин #909 17.02.2022 14:58:02
&НаСервереБезКонтекста
Функция РолиДоступныСервер(ПолныеПрава)
    Возврат РольДоступна(ПолныеПрава);
КонецФункции
//-- смарт:Подкин #909 17.02.2022 14:58:02

// ++ 27.11.2020
&НаКлиенте
Процедура НастроитьВидимостьДоступностьЭлементовСпециалист(ТекущиеДанные)  
    
    //++ смарт:Подкин #909 17.02.2022 16:38:15
    СписокПользователейСДоступом = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ПользователиСДоступомКРазбиениюСтрокСпециалистПоПретензиям");
    Если (СписокПользователейСДоступом.Найти(ПользователиКлиентСервер.ТекущийПользователь()) = Неопределено И Не РолиДоступныСервер("ПолныеПрава")) ИЛИ ТекущиеДанные.Количество <= 1  Тогда
    //-- смарт:Подкин #909 17.02.2022 16:38:15
        Элементы.ЗаполняетсяСпециалистомПоПретензиямРазбитьСтроку.Доступность = Ложь;
    Иначе
        Элементы.ЗаполняетсяСпециалистомПоПретензиямРазбитьСтроку.Доступность = Истина;
    КонецЕсли;
    
    //++ смарт:Подкин #909 17.02.2022 17:07:18
    Если Не РолиДоступныСервер("ПолныеПрава") Тогда
       Элементы.ЗаполняетсяСпециалистомПоПретензиямНоменклатура.Доступность=Ложь;
    КонецЕсли;
    //-- смарт:Подкин #909 17.02.2022 17:07:18 
    
КонецПроцедуры

// ++ 21.07.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямРешениеПоставщикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.РешениеПоставщикаИзмененоВручную = Истина;
	КонецЕсли;
	
КонецПроцедуры

// ++ 16.08.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромЗаказНаПеремещениеЗапчастейСИнженераПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		НастроитьДоступностьКолонок(ТекущиеДанные);		
	КонецЕсли;

КонецПроцедуры

// ++ 27.08.2020
&НаСервере
//++ #1409 смарт: Фролов 26.07.2023 //Выбора компании - контрагента из Списка поставщиков  
Функция ЗаполнитьСписокВыбораПоставщиков()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партнеры.Ссылка КАК Партнер,
	|	Партнеры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка В
	|			(ВЫБРАТЬ
	|				смартПредопределенныеЗначенияЗначения.Значение КАК Партнер
	|			ИЗ
	|				Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|			ГДЕ
	|				смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|				И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.смартПредопределенныеЗначения.ПоставщикиПоЗаявкамНаГарантийныйРемонт);
	
	//СписокВыбора = Новый СписокЗначений;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		//Элементы.Поставщик.РежимВыбораИзСписка = Ложь;
		Возврат Новый Массив;
	Иначе
		//Элементы.Поставщик.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение"));
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Партнер");
	КонецЕсли;
	
КонецФункции  //-- #1409 смарт: Фролов 26.07.2023

// ++ 08.10.2020
&НаСервере
Процедура ОтправитьУведомлениеОНеобходимостиРаспровестиРасходныйОрдер(ДокументРасходныйОрдер)
	
	Если НЕ ЗначениеЗаполнено(ДокументРасходныйОрдер) Тогда
		Возврат;
	КонецЕсли;
	
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой);

	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
	
		Номер = Объект.Номер;
		
		ТемаПисьма = "Отмена отправки в заявке на гарантийный ремонт №" + Номер;
						
		ТекстПисьма = "По заявке на гарантийный ремонт №" + Номер + " отменяется отправка. Необходимо удалить Расходный ордер №" 
			+ ДокументРасходныйОрдер.Номер + " от " + Формат(ДокументРасходныйОрдер.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление об отмене отправки гарантийных запчастей НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
			Иначе
			//-- смарт:ММ 03.03.2021
				
			ТекстСообщения = "Отправлено уведомление об отмене отправки гарантийных запчастей на почту " +  АдресаДляОтправкиСтрокой;		
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			КонецЕсли;
			//-- смарт:ММ 03.03.2021
				
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокументРасходныйОрдер,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить уведомление об отмене отправки гарантийных запчастей" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// ++ 08.10.2020
Функция ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой = "") Экспорт
	
	// Уведомление отправляется получаетелям, которые задаются в справочнике смартПредопределенныеЗначения
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресаДляУведомленийОНеобходимостиРаспровестиРасходныйОрдерПриОтменеОтправки;
	
	// Раскомментировать, если в справочнике должны будут храниться пользователи, а не адреса эл. почты
	//Возврат смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	|	И НЕ смартПредопределенныеЗначения.СписокЗначений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений";
	
	Запрос.УстановитьПараметр("ПредопределенноеЗначение", СсылкаНаПредопределенноеЗначение);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции

// ++ 25.10.2020
&НаСервере
Функция ЗапчастьЕщеНеОтправлялась(ИДСтрокиЗаполняетсяИнженером)
	
	Результат = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
	НайденныеСтроки = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		// ++ 01.04.2021
		//Если НайденныеСтроки[0].Статус <> Перечисления.смартСтатусыПоГарантии.НечемЗаменить Тогда // Не отправлена
		Если НайденныеСтроки[0].Статус <> Перечисления.смартСтатусыПоГарантии.НечемЗаменить 
			И ЗначениеЗаполнено(НайденныеСтроки[0].Статус) Тогда // Не отправлена
		// --
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции


&НаСервере
// 14.10.2020
// ++ 21.11.2020
//Функция СоздатьДокументЗаказНаПеремещениеВзятьНаСкладе()
// ++ 12.01.2021
//Функция СоздатьДокументЗаказНаПеремещениеВзятьНаСкладе(НоменклатураДляЗаказаНаВнутреннееПотребление = Неопределено)
Функция СоздатьДокументЗаказНаПеремещениеВзятьНаСкладе(НоменклатураДляЗаказаНаВнутреннееПотребление = Неопределено, ТекСклад = Неопределено)
	// --
	УстановитьПривилегированныйРежим(Истина);
	// ++ 12.01.2021
	//ОсновнойСкладДляЗапчастейПодЗаказ = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ, Ложь);
	//Если НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В справочнике ""Предопределенные значения (смарт)"" не заполнен ""Основной склад для запчастей под заказ""");
	//	Возврат Неопределено; 
	//КонецЕсли;

	СкладОтправитель = ТекСклад;
	Если НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	// --
		
	ДокументЗаказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ДокументЗаказ.Организация 		= Объект.Организация;
	ДокументЗаказ.СкладОтправитель 	= СкладОтправитель; 
	ДокументЗаказ.СкладПолучатель 	= Объект.СкладИнженера;
	ДокументЗаказ.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	ДокументЗаказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументЗаказ.Статус 			= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокументЗаказ.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
	ДокументЗаказ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументЗаказ.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	ДокументЗаказ.Комментарий 		= ПолучитьТекстКомментарияКДокументу();
	//++ #1287 смарт: Фролов 10.03.2023 //Работа с гарантийными и коммерческими запасными частями  
	ДокументЗаказ.ДокументОснование=Объект.Ссылка;
	//-- #1287 смарт: Фролов 10.03.2023
	СтрокиПоКоторымСоздалсяЗаказНаПеремещение = Новый Массив;
	
	СтатусПолученоОтПоставщика = Перечисления.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика;
	// ++ 21.11.2020
	СтатусОжидаетсяПоступление = Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление;
	// --
	СоответствиеНомеровСтрокИЗабраннойСоСкладаНоменклатуры = Новый Соответствие;
	
	//ЗапросОстатки = Новый Запрос;
	//ЗапросОстатки.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	//|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ТекущаяДата, Склад = &Склад И Номенклатура В (&Номенклатура)) КАК ТоварыНаСкладахОстатки";
	//
	//МассивНоменклатуры = Новый Массив;
	//МассивНоменклатуры = Объект.ЗаполняетсяИнженером.Выгрузить().ВыгрузитьКолонку("НоменклатураПринятаяОтКлиента");
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНоменклатуры, Объект.ЗаполняетсяСпециалистомПоПретензиям.Выгрузить().ВыгрузитьКолонку("АналогОтПоставщика"), Истина);
	//
	//ЗапросОстатки.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	//ЗапросОстатки.УстановитьПараметр("Склад", СкладОтправитель);
	//ЗапросОстатки.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//	
	//ВыборкаОстатки = ЗапросОстатки.Выполнить().Выбрать();
	
	// ++ 21.11.2020
	НоменклатураДляЗаказаНаВнутреннееПотребление = Новый Соответствие; // ИД Строка инженера - Номенклатура для документа
	// --
	
	// ++ 09.02.2021
	СоответствиеКоличествоДляПеремещения = Новый Соответствие;
	МассивНоменклатурыДляУдаленияИзДокумента = Новый Массив;
	// --
	
	Для Каждого ТекСтрока Из Объект.ЗаполняетсяИнженером Цикл
				
		// 1. Берется вся номенклатура из вкладки инженера из колонки «запчасть клиента», 
		
		
		//rnp16.06.2021
		//Если ЗначениеЗаполнено(ТекСтрока.НоменклатураУстановленнаяКлиенту)
		Если Не ЗначениеЗаполнено(ТекСтрока.НоменклатураПринятаяОтКлиента) Тогда
			Продолжить;
		КонецЕсли;
		//++ #1406 смарт: Фролов 24.07.2023 //Проверка механизма "Установка не требуется"  
		Если ТекСтрока.УстановкаНеТребуется ТОгда
			Продолжить;
		КонецЕсли;	
		//-- #1406 смарт: Фролов 24.07.2023
		Если ЗначениеЗаполнено(ТекСтрока.ДокументПолученияЗапчасти) Тогда
			Продолжить;
		КонецЕсли;
		
		// ++ 12.01.2020
		// 1.2. Рассматриваются только строки по выбранному складу
		Если ТекСтрока.Склад <> СкладОтправитель 
			//// ++ 26.01.2021
			//И СкладОтправитель <> ОсновнойСкладДляЗапчастейПодЗаказ
			//// --
			Тогда
			Продолжить;
		КонецЕсли;
		
		//// Если в строке уже указан склад, то браться запчасть будет потом с него, предопределенный склад не участвует
		//Если СкладОтправитель = ОсновнойСкладДляЗапчастейПодЗаказ 
		//	И ЗначениеЗаполнено(ТекСтрока.Склад) 
		//	И ТекСтрока.Склад <> ОсновнойСкладДляЗапчастейПодЗаказ Тогда
		//	Продолжить;
		//КонецЕсли;
		
		// --
		
		// 2. Далее смотрится по таблице статусов на вкладке специалиста, есть ли по этой запчасти статус «получено от поставщика» -
		// берутся только те, которые получены
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекСтрока.ИДСтрокиЗаполняетсяИнженером);
		
		СтрокиСпециалиста = Объект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
		Если СтрокиСпециалиста.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЧтоБеретсяСоСкладаИнженером = ТекСтрока.НоменклатураПринятаяОтКлиента;
		
		//rnp 16.06.2021  проверки по таблице статусов еще раз продумать, нужны ли; пока добавлено условие, что делаем их только по складу "не для продажи" 
        
        //++ смарт:Подкин #910 11.04.2022 16:59:55
		Если СкладОтправитель = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение Тогда          
        //-- смарт:Подкин #910 11.04.2022 16:59:55
			НомерПозиции = СтрокиСпециалиста[0].НомерПозиции;
			АналогОтПоставщикаИзТаблицыСпециалиста = СтрокиСпециалиста[0].АналогОтПоставщика;
			Отбор = Новый Структура;
			Отбор.Вставить("НомерПозиции", НомерПозиции);
			Отбор.Вставить("Статус", СтатусПолученоОтПоставщика);
			
			ПриходныйОрдер = Неопределено;
			СтрокиСтатуса = Объект.Статусы.НайтиСтроки(Отбор);
			Если СтрокиСтатуса.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПриходныйОрдер = СтрокиСтатуса[0].ДокументДвижения;
			
			
			
			// Проверить, пришел аналог или сама запчасть
			// Если от поставщика пришла не исходная запчасть, а аналог, 
			// то забрать со склада и заполнить в таблице инженера необходимо аналог. 
			// Посмотреть, какая точно пришла запчасть, можно в самом приходном ордере в таблице статусов 
			// и для контроля – в таблице специалиста в колонке «аналог».
			
			Если ТипЗнч(ПриходныйОрдер) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
				И ЗначениеЗаполнено(ПриходныйОрдер) Тогда
				
				Отбор = Новый Структура;
				//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
				//Отбор.Вставить("смартНомерЗаявкиНаГарантийныйРемонт", Объект.Номер);
				Отбор.Вставить("смартНомерЗаявкиНаГарантийныйРемонтСсылка", Объект.Ссылка);
				//-- #Б1132 смарт: Шляпников 01.11.2024
				НайденныеСтроки = ПриходныйОрдер.Товары.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					// Смотрятся все строки в приходном ордере с номером текущей заявки.
					// Если заполнен аналог в таблице специалиста, то в отобранных строках в приходном ордере ищем аналог;
					// если аналог у специалиста не заполнен, то в отобранных строках в приходном ордере ищем саму номенклатуру;
					// Если в какой-либо строке  совпала номенклатура или аналог, то считаем, что успех.
					// Если же нет совпадений, то документы не создаем, пишем "Не найдены запчасти для перемещения. Обратитесь на help1C@smart-t.ru"
					// Если строк несколько, наверно не критично, можно считать, что успешно нашли.
					
					Если ЗначениеЗаполнено(АналогОтПоставщикаИзТаблицыСпециалиста) Тогда
						ЧтоБеретсяСоСкладаИнженером = АналогОтПоставщикаИзТаблицыСпециалиста;
					КонецЕсли;
					
					ЕстьНоменклатураВПриходномОрдере = Ложь;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Если Строка.Номенклатура = ЧтоБеретсяСоСкладаИнженером Тогда 
							ЕстьНоменклатураВПриходномОрдере = Истина;
							Прервать;
						КонецЕсли;					
					КонецЦикла;
					
					Если НЕ ЕстьНоменклатураВПриходномОрдере Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По строке " + ТекСтрока.НомерСтроки 
						+ " таблицы инженера не найдены запчасти для перемещения. Обратитесь на help1C@smart-t.ru.");					
						Продолжить;
					КонецЕсли;
					
					//++ 09.02.2021 
					//// ++ 21.11.2020
					//// Проверка наличия заказа на перемещение на склад «Гарантийные запчасти – не для продажи»								
					//ЗаказНаПеремещение = НайтиЗаказНаПеремещениеНаСкладПодЗаказ(НомерПозиции, СтатусОжидаетсяПоступление, ЧтоБеретсяСоСкладаИнженером);
					//Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
					//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По строке " + ТекСтрока.НомерСтроки 
					//	+ " таблицы инженера не найден заказ на перемещение на склад Гарантийные запчасти - не для продажи. Обратитесь на help1C@smart-t.ru.");
					//	Продолжить;
					//КонецЕсли;
					
					// --
					
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;//rnp 16.06.2021
	
		//// Проверка остатка на складе
		//ЕстьОстаток = Ложь;
		//
		//ВыборкаОстатки.Сбросить();
		//СтруктураПоиска = Новый Структура;
		//СтруктураПоиска.Вставить("Номенклатура", ЧтоБеретсяСоСкладаИнженером);
		//
		//Если ВыборкаОстатки.НайтиСледующий(СтруктураПоиска) Тогда
		//
		//	Если ВыборкаОстатки.ВНаличииОстаток >= ТекСтрока.Количество Тогда
		//		ЕстьОстаток = Истина;
		//	КонецЕсли;
		//	
		//КонецЕсли;
		//
		//Если НЕ ЕстьОстаток Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По строке " + ТекСтрока.НомерСтроки 
		//		+ " таблицы инженера на складе " + СкладОтправитель + " не хватает номенклатуры " 
		//		+ ЧтоБеретсяСоСкладаИнженером + ". Обратитесь на help1C@smart-t.ru.");					
		//	Продолжить;
		//КонецЕсли;
		
		СоответствиеНомеровСтрокИЗабраннойСоСкладаНоменклатуры.Вставить(ТекСтрока.ИДСтрокиЗаполняетсяИнженером, ЧтоБеретсяСоСкладаИнженером);
		СтрокиПоКоторымСоздалсяЗаказНаПеремещение.Добавить(ТекСтрока);
				
		
		//// ++ 09.02.2021
		//Если СкладОтправитель = ОсновнойСкладДляЗапчастейПодЗаказ Тогда
		//	УжеЗаписано = 0;
		//	Если СоответствиеКоличествоДляПеремещения.Получить(ЧтоБеретсяСоСкладаИнженером) <> Неопределено Тогда
		//		УжеЗаписано = СоответствиеКоличествоДляПеремещения.Получить(ЧтоБеретсяСоСкладаИнженером);
		//	КонецЕсли;
		//	СоответствиеКоличествоДляПеремещения.Вставить(ЧтоБеретсяСоСкладаИнженером, УжеЗаписано + ТекСтрока.Количество);
		//КонецЕсли;
		//// --
		НоваяСтрока = ДокументЗаказ.Товары.Добавить();
		НоваяСтрока.Количество 			= ТекСтрока.Количество;
		НоваяСтрока.КоличествоУпаковок	= ТекСтрока.Количество;
		НоваяСтрока.Номенклатура 		= ЧтоБеретсяСоСкладаИнженером;
		НоваяСтрока.НачалоОтгрузки 		= ТекущаяДата();
		НоваяСтрока.ОкончаниеПоступления 	= НоваяСтрока.НачалоОтгрузки;
		НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонт = Объект.Номер;
		НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Объект.Ссылка;
		//-- #Б1132 смарт: Шляпников 14.10.2024
		
		//// ++ 26.01.2021
		//МассивСтрокДляОбработки.Добавить(ТекСтрока.ИДСтрокиЗаполняетсяИнженером);
		//// --

		// ++ 21.11.2020
		Если ЗначениеЗаполнено(ТекСтрока.ДокументВводОстатков) Тогда
			НоменклатураДляЗаказаНаВнутреннееПотребление.Вставить(ТекСтрока.ИДСтрокиЗаполняетсяИнженером, ЧтоБеретсяСоСкладаИнженером);
		КонецЕсли;
		// --
	КонецЦикла;
		
	Если ДокументЗаказ.Товары.Количество() = 0 Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена номенклатура для перемещения");
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументЗаказ.Дата = ТекущаяДата();
	
	Попытка
	//	// ++ 09.02.2021
	//	Если СкладОтправитель = ОсновнойСкладДляЗапчастейПодЗаказ Тогда
	//		// Удалить строки, по которым нет доступного количества
	//		// Не очень хорошо, что запрос в цикле, но элементов должно быть немного. Пока так
	//		
	//		Для Каждого ЭлементСоответствия Из СоответствиеКоличествоДляПеремещения Цикл
	//			МассивСкладов = Новый Массив;
	//			СформироватьТекстОстатокНаСкладах(ЭлементСоответствия.Ключ, МассивСкладов, ЭлементСоответствия.Значение);
	//			Если МассивСкладов.Найти(ОсновнойСкладДляЗапчастейПодЗаказ) = Неопределено Тогда
	//				МассивНоменклатурыДляУдаленияИзДокумента.Добавить(ЭлементСоответствия.Ключ);
	//			КонецЕсли;			
	//		КонецЦикла;
	//		
	//		Если МассивНоменклатурыДляУдаленияИзДокумента.Количество() > 0 Тогда				
	//			
	//			Сч = ДокументЗаказ.Товары.Количество() - 1;
	//			Пока Сч >= 0  Цикл					
	//				ТекСтрока = ДокументЗаказ.Товары[Сч];
	//				Если МассивНоменклатурыДляУдаленияИзДокумента.Найти(ТекСтрока.Номенклатура) <> Неопределено Тогда
	//					ДокументЗаказ.Товары.Удалить(ТекСтрока);						
	//				КонецЕсли;
	//				Сч = Сч - 1;
	//			КонецЦикла;
	//			
	//			Если ДокументЗаказ.Товары.Количество() = 0 Тогда
	//				Возврат Неопределено;
	//			КонецЕсли;
	//
	//		КонецЕсли;			
	//	КонецЕсли;
	//	// --
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На складе " + СкладОтправитель + " не хватает товаров для перемещения. Обратитесь на help1C@smart-t.ru.");					

		//СинонимДокумента = ДокументЗаказ.Метаданные().Синоним;
		//ДокументЗаказ.Записать(РежимЗаписиДокумента.Запись);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		//|" + ОписаниеОшибки() + "
		//|Документ записан без проведения.");
	КонецПопытки;
	
	Для Каждого Строка Из СтрокиПоКоторымСоздалсяЗаказНаПеремещение Цикл
		
		ЧтоБеретсяСоСкладаИнженером = СоответствиеНомеровСтрокИЗабраннойСоСкладаНоменклатуры.Получить(Строка.ИДСтрокиЗаполняетсяИнженером);
		//// ++ 09.02.2021
		//Если МассивНоменклатурыДляУдаленияИзДокумента.Найти(ЧтоБеретсяСоСкладаИнженером) <> Неопределено Тогда
		//	Продолжить;
		//КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(Строка.Склад) Тогда
		//	Строка.Склад = ТекСклад;
		//КонецЕсли;
		//// --
		Строка.ДокументПолученияЗапчасти = ДокументЗаказ.Ссылка;
		Строка.НоменклатураУстановленнаяКлиенту = ЧтоБеретсяСоСкладаИнженером;
		
		// ++ 30.06.2021
		Если ЗначениеЗаполнено(Строка.ДокументПолученияЗапчасти) 
			И НЕ ЗначениеЗаполнено(Строка.Склад) Тогда
			Строка.Склад = Строка.ДокументПолученияЗапчасти.СкладОтправитель;
		КонецЕсли;

		НастроитьВидимостьДоступность();
		// --
	КонецЦикла;
		
	Возврат ДокументЗаказ.Ссылка;
	
КонецФункции

// ++ 21.11.2020
&НаСервере
Функция НайтиЗаказНаПеремещениеНаСкладПодЗаказ(НомерПозиции, СтатусОжидаетсяПоступление, Номенклатура)
	
	ЗаказНаПеремещение = Неопределено;
	
	//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
	//НомерЗаявки = Объект.Номер;
	//-- #Б1132 смарт: Шляпников 01.11.2024
	
	// Попытка найти заказ в табличной части со статусами
	
	ОтборСтатус = Новый Структура;
	ОтборСтатус.Вставить("НомерПозиции", НомерПозиции);
	ОтборСтатус.Вставить("Статус", СтатусОжидаетсяПоступление);
	СтрокиСтатус = Объект.Статусы.НайтиСтроки(ОтборСтатус);
	
	Если СтрокиСтатус.Количество() > 0 Тогда
		ЗаказНаПеремещение = СтрокиСтатус[0].ДокументДвиженияДоп;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
		
		// Попытка найти заказ среди всех документов
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		//|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка
		//|ИЗ
		//|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		//|ГДЕ
		//|	ЗаказНаПеремещениеТовары.Ссылка.Проведен
		//|	И ЗаказНаПеремещениеТовары.смартНомерЗаявкиНаГарантийныйРемонт = &смартНомерЗаявкиНаГарантийныйРемонт
		//|	И ЗаказНаПеремещениеТовары.Номенклатура = &Номенклатура
		//|	И ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель = &СкладПолучатель";
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		|ГДЕ
		|	ЗаказНаПеремещениеТовары.Ссылка.Проведен
		|	И ЗаказНаПеремещениеТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка = &смартНомерЗаявкиНаГарантийныйРемонтСсылка
		|	И ЗаказНаПеремещениеТовары.Номенклатура = &Номенклатура
		|	И ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель = &СкладПолучатель";
		//-- #Б1132 смарт: Шляпников 01.11.2024
		
		Запрос.УстановитьПараметр("СкладПолучатель", ОсновнойСкладДляЗапчастейПодЗаказ);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//Запрос.УстановитьПараметр("смартНомерЗаявкиНаГарантийныйРемонт", НомерЗаявки);
		Запрос.УстановитьПараметр("смартНомерЗаявкиНаГарантийныйРемонт", Объект.Ссылка);
		//-- #Б1132 смарт: Шляпников 01.11.2024
		
		ВыборкаЗаказ = Запрос.Выполнить().Выбрать();
		Если ВыборкаЗаказ.Следующий() Тогда
			ЗаказНаПеремещение = ВыборкаЗаказ.Ссылка;
		КонецЕсли;
		
	КонецЕсли;

	Возврат ЗаказНаПеремещение;
	
КонецФункции

// ++ 13.10.2020
&НаСервере
Функция НайтиДокументЗаказНаПеремещение(Номенклатура)
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_ОстатокНаСкладе
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКПоступлению.Регистратор КАК Регистратор,
	|	ТоварыКПоступлению.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ВсеЗаказыНаПеремещение
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстатокНаСкладе КАК ВТ_ОстатокНаСкладе
	|		ПО ТоварыКПоступлению.Номенклатура = ВТ_ОстатокНаСкладе.Номенклатура
	|			И ТоварыКПоступлению.Склад = ВТ_ОстатокНаСкладе.Склад
	|			И (&УчитыватьТекущийОстаток)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	|		ПО ((ВЫРАЗИТЬ(ТоварыКПоступлению.Регистратор КАК Документ.ЗаказНаПеремещение)) = ЗаказНаПеремещение.Ссылка)
	|ГДЕ
	|	ТоварыКПоступлению.Регистратор ССЫЛКА Документ.ЗаказНаПеремещение
	|	И ТоварыКПоступлению.Склад = &Склад
	|	И ТоварыКПоступлению.Номенклатура = &Номенклатура
	|	И ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	// ++ 13.12.2020
	//|	И НЕ ЗаказНаПеремещение.Комментарий ПОДОБНО ""%pre%""
	|	И ЗаказНаПеремещение.Комментарий ПОДОБНО &НомерЗаявки
	// --
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаказыНаПеремещение.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатаСреза
	|ИЗ
	|	ВТ_ВсеЗаказыНаПеремещение КАК ВТ_ВсеЗаказыНаПеремещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаказыНаПеремещение.Регистратор) КАК Регистратор
	|ИЗ
	|	ВТ_ВсеЗаказыНаПеремещение КАК ВТ_ВсеЗаказыНаПеремещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатаСреза КАК ВТ_ДатаСреза
	|		ПО ВТ_ВсеЗаказыНаПеремещение.Период = ВТ_ДатаСреза.Период";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Объект.СкладИнженера);
	Запрос.УстановитьПараметр("УчитыватьТекущийОстаток", Истина);	// временно
	// ++ 13.12.2020
	Запрос.УстановитьПараметр("НомерЗаявки", "%" + ВнешнийНомер + "%");
	// --
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Регистратор;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// ++ 14.10.2020
&НаСервере
// ++ 12.01.2021
//Функция ВзятьНаСкладеНаСервере()
Функция ВзятьНаСкладеНаСервере(ТекСклад)
// --
	
	// Создание документов Заказ на перемещение и Перемещение товаров
	// ++ 21.11.2020
	//ЗаказНаПеремещение = СоздатьДокументЗаказНаПеремещениеВзятьНаСкладе();
	НоменклатураДляЗаказаНаВнутреннееПотребление = Неопределено;
	// ++ 12.01.2021
	//ЗаказНаПеремещение = СоздатьДокументЗаказНаПеремещениеВзятьНаСкладе(НоменклатураДляЗаказаНаВнутреннееПотребление);
	
	// ++ 16.02.2021
	ЗаказНаПеремещение = СоздатьДокументЗаказНаПеремещениеВзятьНаСкладе(НоменклатураДляЗаказаНаВнутреннееПотребление, ТекСклад);
	
	Если ЗначениеЗаполнено(ЗаказНаПеремещение) И ЗаказНаПеремещение.Проведен Тогда
		ПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ЗаказНаПеремещение, Истина);
		
		Если ПеремещениеТоваров = Неопределено Тогда
			// Не удалось провести Перемещение. Удалить созданный заказ на перемещение
			
			Для Каждого Строка Из Объект.ЗаполняетсяИнженером Цикл
				Если Строка.ДокументПолученияЗапчасти = ЗаказНаПеремещение Тогда
					Строка.НоменклатураУстановленнаяКлиенту = Неопределено;
					Строка.ДокументПолученияЗапчасти = Неопределено;
					// ++ 10.02.2021
					Строка.Склад = Неопределено;
					// --
				КонецЕсли;			
			КонецЦикла;
			
			УстановитьПривилегированныйРежим(Истина);
			ЗаказОбъект = ЗаказНаПеремещение.ПолучитьОбъект();
			ЗаказОбъект.Удалить();
			ЗаказНаПеремещение = Неопределено;
			УстановитьПривилегированныйРежим(Ложь);
		// ++ 21.11.2020
		Иначе
			
			// Запчасти успешно перемещены на склад инженера. Можно списывать при необходимости
			// Создание Заказа на внутреннее потребление и внутреннего потребления по строкам с вводом остатков
			
			// 01.04.2021
			// Создание Заказа на внутреннее потребление и Внутреннее потребление перенесены в модуль объекта ПередЗаписью
			
			//СтрокиДляСозданияЗаказаНаВнутреннееПотребление = Новый Массив;
			//
			//Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
			//	
			//	//// ++ 26.01.2021
			//	//Если СтрокаИнженер.ДокументПолученияЗапчасти = ЗаказНаПеремещение Тогда
			//	//	ВсегоЭлементов = МассивСтрокДляОбработки.Количество();
			//	//	Счетчик = 0;
			//	//	Пока Счетчик <= ВсегоЭлементов - 1 Цикл
			//	//		ЭлементМассива = МассивСтрокДляОбработки[Счетчик];
			//	//		Если ЭлементМассива = СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером Тогда
			//	//			МассивСтрокДляОбработки.Удалить(Счетчик);
			//	//			Прервать;
			//	//		КонецЕсли;
			//	//		Счетчик = Счетчик + 1;					
			//	//	КонецЦикла;					
			//	//КонецЕсли;
			//	//// --
			//	
			//	Если СтрокаИнженер.ДокументПолученияЗапчасти = ЗаказНаПеремещение
			//		И ЗначениеЗаполнено(СтрокаИнженер.ДокументВводОстатков)
			//		Тогда
			//		
			//		СтрокиДляСозданияЗаказаНаВнутреннееПотребление.Добавить(СтрокаИнженер);
			//			
			//	КонецЕсли;
			
			//КонецЦикла;
			
			//Если СтрокиДляСозданияЗаказаНаВнутреннееПотребление.Количество() > 0 
			//	И ТипЗнч(НоменклатураДляЗаказаНаВнутреннееПотребление) = Тип("Соответствие")
			//	И НоменклатураДляЗаказаНаВнутреннееПотребление.Количество() > 0
			//	Тогда
			//	ЗаказНаВнутреннееПотребление = СоздатьЗаказНаВнутреннееПотребление(СтрокиДляСозданияЗаказаНаВнутреннееПотребление, НоменклатураДляЗаказаНаВнутреннееПотребление);
			//	
			//	Если ЗначениеЗаполнено(ЗаказНаВнутреннееПотребление) Тогда
			//		
			//		ВнутреннееПотребление = СоздатьВнутреннееПотребление(ЗаказНаВнутреннееПотребление);
			//		
			//		Для Каждого СтрокаИнженер Из СтрокиДляСозданияЗаказаНаВнутреннееПотребление Цикл
			//			СтрокаИнженер.ДокументЗаказНаВнутреннееПотребление = ЗаказНаВнутреннееПотребление;
			//		КонецЦикла;			
			//	КонецЕсли;	
			//КонецЕсли;
			// -- 01.04.2021
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьДоступность();
	
	//ЭтаФорма.Модифицированность = Истина;
	
	Если ЗаказНаПеремещение <> Неопределено Тогда		
		// ++ 10.02.2021
		// Почему-то очищаются реквизиты формы
		ТЗ = Объект.ЗаполняетсяИнженером.Выгрузить();
		// --
		ЭтаФорма.Записать();
		
		// ++ 10.02.2021
		Для Каждого Стр Из Объект.ЗаполняетсяИнженером Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", Стр.ИДСтрокиЗаполняетсяИнженером);
			НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Стр.ПредыдущееКоличество 	= НайденныеСтроки[0].ПредыдущееКоличество;
				Стр.ЗаполняетсяСписокСкладов = НайденныеСтроки[0].ЗаполняетсяСписокСкладов;
				Стр.СписокСкладовПустой 	= НайденныеСтроки[0].СписокСкладовПустой;
				Стр.СкладыСОстатками 		= НайденныеСтроки[0].СкладыСОстатками;
			КонецЕсли;
			
		КонецЦикла;
		
		ТЗ = Неопределено;
		// --
	КонецЕсли;
	
	// ++ 21.11.2020
	Возврат ЗаказНаПеремещение;
	
КонецФункции


// ++ 30.10.2020
&НаКлиенте
Процедура ЗаполняетсяСпециалистомПоПретензиямПрямаяПоставкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяСпециалистомПоПретензиям.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ПрямаяПоставка = Истина Тогда
			СтатусПолучения = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление");
			Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтатусПолучения) Тогда
				ТекущиеДанные.СтатусПолучения = СтатусПолучения;
				Отбор = Новый Структура;
				Отбор.Вставить("НомерПозиции", ТекущиеДанные.НомерПозиции);
				НайденныеСтроки = Объект.Статусы.НайтиСтроки(Отбор);
				ДобавитьСтрокуСтатусаНаСервере(ТекущиеДанные.НомерПозиции, ТекущаяДата(), СтатусПолучения);
			КонецЕсли;
		Иначе
			// ?Удалить последнюю строку, если статус Получено от поставщика и не заполнен документ движения
				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// ++ 05.11.2020 - перенесено из модуля объекта
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ЗаполняетсяИнженером = Объект.ЗаполняетсяИнженером;
	ЗаполняетсяСпециалистомПоПретензиям = Объект.ЗаполняетсяСпециалистомПоПретензиям;

	
	СтатусОтправлено = Перечисления.смартСтатусыПоГарантии.ОтправленоПоставщику;
	//++ смарт:ММ #044 224 20.07.2020
	//СтатусКомпенсация = Перечисления.смартСтатусыПоГарантии.Компенсация;
	СтатусКомпенсация = Перечисления.смартСтатусыПоГарантииПолучение.Компенсация;
	//-- смарт:ММ 20.07.2020
	СтатусОжидаетсяОтправка = Перечисления.смартСтатусыПоГарантии.ОжидаетсяОтправка;
	

	// ++ 13.10.2020
	// Проверка заполненности реквизита ДокументПолученияЗапчасти
	
	Для Индекс = 0 По ЗаполняетсяИнженером.Количество() - 1 Цикл
		
		СтрокаТовар = ЗаполняетсяИнженером.Получить(Индекс);
		
		Если ЗначениеЗаполнено(СтрокаТовар.НоменклатураУстановленнаяКлиенту) Тогда
			
			// ++ 13.12.2020
			Если РольДоступна("смартИнженер") Тогда
			// --
			Если НЕ ЗначениеЗаполнено(СтрокаТовар.ДокументПолученияЗапчасти) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс + 1) + " таблицы ""Заполняется инженером"" не заполнен документ получения запчасти";
				Сообщение.Поле = "Объект.ЗаполняетсяИнженером[" + Индекс + "].ДокументПолученияЗапчасти";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				// Пока разрешена запись
				
				Отказ = Истина; // 13.12.2020 - раскомментировано
			КонецЕсли;
			
			//++ #Б-3168 смарт: Лопато 06.05.2025 //Заявка на гарантийный ремонт. Дата установки запчасти клиенту.  
			// Отключил код
			//// ++ 13.12.2020
			//Если НЕ ЗначениеЗаполнено(СтрокаТовар.ДатаУстановкиЗапчастиКлиенту) Тогда
			//	//rnp 24.12.2020 разрешена запись, т.к. при нажатии на кнопку Взять на складе запчасть получают до выезда клиенту и дата установки клиенту еще не известна
			//	//Сообщение = Новый СообщениеПользователю();
			//	//Сообщение.Текст = "В строке " + (Индекс + 1) + " таблицы ""Заполняется инженером"" не заполнена дата установки запчасти клиенту";
			//	//Сообщение.Поле = "Объект.ЗаполняетсяИнженером[" + Индекс + "].ДатаУстановкиЗапчастиКлиенту";
			//	//Сообщение.УстановитьДанные(ЭтотОбъект);
			//	//Сообщение.Сообщить();
			//	//Отказ = Истина;
			//КонецЕсли;
			//// --	
			//-- #Б-3168 смарт: Лопато 06.05.2025
					
			КонецЕсли;
			// --
			
			////++ смарт:ММ #044 224 16.11.2020 - Заявка на гарантийный ремонт
			//Если СтрокаТовар.Количество = 0 Тогда
			//	Сообщение = Новый СообщениеПользователю();
			//	Сообщение.Текст = "В строке " + (Индекс + 1) + " таблицы ""Заполняется инженером"" не заполнено количество";
			//	Сообщение.Поле = "ЗаполняетсяИнженером[" + Индекс + "].Количество";
			//	Сообщение.УстановитьДанные(ЭтотОбъект);
			//	Сообщение.Сообщить();
			//	Отказ = Истина;
			//КонецЕсли;
			////-- смарт:ММ 16.11.2020
		КонецЕсли;
		
	КонецЦикла;
	// --

	Для Индекс = 0 По ЗаполняетсяСпециалистомПоПретензиям.Количество() - 1 Цикл
		
		СтрокаТовар = ЗаполняетсяСпециалистомПоПретензиям.Получить(Индекс);
		
		ПроверятьДатуОтправления 	= Ложь;
		ПроверятьНомерОтправления 	= Ложь;
		ПроверятьКонтрагента 	= Ложь;
		
		Если СтрокаТовар.Статус = СтатусОтправлено Тогда
			
			ПроверятьДатуОтправления 	= Истина;
			ПроверятьНомерОтправления 	= Истина;
			ПроверятьКонтрагента 		= Истина;
			
		ИначеЕсли СтрокаТовар.Статус = СтатусКомпенсация 
			ИЛИ СтрокаТовар.Статус = СтатусОжидаетсяОтправка Тогда
			
			ПроверятьКонтрагента 		= Истина;
		КонецЕсли;
		
		Если ПроверятьДатуОтправления Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТовар.ДатаОтправления) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс + 1) + " не заполнена дата отправления";
				Сообщение.Поле = "ЗаполняетсяСпециалистомПоПретензиям[" + Индекс + "].ДатаОтправления";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ПроверятьНомерОтправления Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТовар.НомерОтправления) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс + 1) + " не заполнен номер отправления";
				Сообщение.Поле = "ЗаполняетсяСпециалистомПоПретензиям[" + Индекс + "].НомерОтправления";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;			
		КонецЕсли;
		
		Если ПроверятьКонтрагента Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТовар.Контрагент) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс + 1) + " не заполнен контрагент";
				Сообщение.Поле = "ЗаполняетсяСпециалистомПоПретензиям[" + Индекс + "].Контрагент";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//06.11.2020
&НаКлиенте
Процедура DOAПриИзменении(Элемент)
	//10.11.2020 закомментировано по просьбе Акимова
	//НастроитьВидимостьДоступность();
КонецПроцедуры

// ++ 30.06.2021
&НаКлиенте
Процедура ЗаполняетсяИнженеромДокументПолученияЗапчастиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументПолученияЗапчасти) Тогда
			ТекущиеДанные.Склад = ПолучитьРеквизитОбъекта(ТекущиеДанные.ДокументПолученияЗапчасти, "СкладОтправитель");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// ++ 13.12.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромДокументПолученияЗапчастиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
			
			ЗаказыДляОтбора = ПолучитьЗаказыНаПеремещениеДляОтбора(ТекущиеДанные.НоменклатураУстановленнаяКлиенту, Объект.СкладИнженера, Объект.Организация);
			
			Если ЗаказыДляОтбора.Количество() > 0 Тогда
				
				фиксНастройки = Новый НастройкиКомпоновкиДанных;
				
				эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
				эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				эОтбор.ПравоеЗначение = ЗаказыДляОтбора;
				эОтбор.Использование = Истина;
				
				эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
				
				ОткрытьФорму("Документ.ЗаказНаПеремещение.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ЗаполняетсяИнженеромДокументПолученияЗапчасти);
				
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;		
				
	КонецЕсли;
		
КонецПроцедуры

// ++ 13.12.2020
&НаСервереБезКонтекста
Функция ПолучитьЗаказыНаПеремещениеДляОтбора(Номенклатура, СкладПолучатель, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Номенклатура = &Номенклатура
	|	И ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель = &СкладПолучатель
	|	И ЗаказНаПеремещениеТовары.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// ++ 15.12.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромПередУдалением(Элемент, Отказ)
	
	// ++ 12.01.2021
	СтрокаЗаполнена = Ложь;
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураПринятаяОтКлиента)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.Количество)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументРазборки)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ЗаказНаПеремещениеЗапчастейСИнженера)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументПолученияЗапчасти)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументВводОстатков)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДокументЗаказНаВнутреннееПотребление)
			//++ #Б-3168 смарт: Лопато 06.05.2025 //Заявка на гарантийный ремонт. Дата установки запчасти клиенту.  
			// Отключил код
			//ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ДатаУстановкиЗапчастиКлиенту)
			//-- #Б-3168 смарт: Лопато 06.05.2025
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.Склад)
			Тогда
			СтрокаЗаполнена = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
	Если СтрокаЗаполнена Тогда 
		
		//++ #5824 смарт: Тимофеева 05.03.26 / Заявка на гарантийный ремонт. Расширение доступа для Специалиста по претензиям
		Если РольДоступнаСервер("смартСпециалистПоПретензиям") Тогда
			
			Оповещение = Новый ОписаниеОповещения("ЗаполняетсяИнженеромПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", Элемент.ТекущиеДанные));
			ПоказатьВопрос(Оповещение, "В строке присутствуют заполненные поля. Все равно удалить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
            Отказ = Истина;
			Возврат;
			
		КонецЕсли;
        //-- #5824 смарт: Тимофеева 05.03.26
		
	// --
		Если НЕ РольДоступнаСервер("ПолныеПрава") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Недостаточно прав!");
			Отказ = Истина;
		КонецЕсли;
	// ++ 12.01.2021
	КонецЕсли;
	// --
	
	//++ #5824 смарт: Тимофеева 05.03.26 / Заявка на гарантийный ремонт. Расширение доступа для Специалиста по претензиям
	Если НЕ Отказ И НЕ ТекущиеДанные = Неопределено  Тогда
		ИнформироватьОНеобходимостиУдаленияСтрокиВТаблице(ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером, "ЗаполняетсяСпециалистомПоПретензиям");						
	КонецЕсли;
	//-- #5824 смарт: Тимофеева 05.03.26

КонецПроцедуры

//++ #5824 смарт: Тимофеева 05.03.26 / Заявка на гарантийный ремонт. Расширение доступа для Специалиста по претензиям
&НаКлиенте
Процедура ЗаполняетсяИнженеромПередУдалениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		ИнформироватьОНеобходимостиУдаленияСтрокиВТаблице(ДополнительныеПараметры.ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером, "ЗаполняетсяСпециалистомПоПретензиям");
		Объект.ЗаполняетсяИнженером.Удалить(ДополнительныеПараметры.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ИнформироватьОНеобходимостиУдаленияСтрокиВТаблице(ИдентификаторСтроки, ИмяТаблицы)
	
	НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(Новый Структура("ИДСтрокиЗаполняетсяИнженером", ИдентификаторСтроки));  
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		
		ТекстСообщения = СтрШаблон("В таблице ""%1"" требуется удалить строку №%2", 
							?(ИмяТаблицы = "ЗаполняетсяСпециалистомПоПретензиям", "Заполняется специалистом по претензиям", "Заполняется инженером"), 
							НайденнаяСтрока.НомерСтроки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЦикла;
	
КонецПроцедуры

//-- #5824 смарт: Тимофеева 05.03.26

// ++ 15.12.2020
&НаКлиенте
Процедура ЗаполняетсяИнженеромКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Объект.Ссылка)
			И ТекущиеДанные.ПредыдущееКоличество <> 0 
			И ТекущиеДанные.ПредыдущееКоличество <> ТекущиеДанные.Количество Тогда
			
			ВыбранноеЗначение = "";
			Массив = Новый Массив;
			Массив.Добавить(Тип("Строка"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив, , Новый КвалификаторыСтроки(150));
		
			ПараметрыСтруктура = Новый Структура;
			ПараметрыСтруктура.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекущиеДанные.ИДСтрокиЗаполняетсяИнженером);
			ПараметрыСтруктура.Вставить("Запчасть", ТекущиеДанные.НоменклатураПринятаяОтКлиента);
			
			Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияИнженер", ЭтотОбъект, ПараметрыСтруктура);
			ПоказатьВводЗначения(Оповещение, ВыбранноеЗначение, "Укажите причину изменения количества", ОписаниеТипов);
			
		Иначе
			ТекущиеДанные.ПредыдущееКоличество = ТекущиеДанные.Количество;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// ++ 15.12.2020
&НаСервере
Процедура ЗаполнитьКолонкуПредыдущееКоличество()
	
	Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
		СтрокаИнженер.ПредыдущееКоличество = СтрокаИнженер.Количество;
	КонецЦикла;
	
КонецПроцедуры

// ++ 15.12.2020
&НаКлиенте
Процедура ПослеВводаЗначенияИнженер(ВыбЗнач, ПараметрыСтруктура) Экспорт
	
	ИДСтрокиЗаполняетсяИнженером = ПараметрыСтруктура.ИДСтрокиЗаполняетсяИнженером;
	Запчасть = ПараметрыСтруктура.Запчасть;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
	НайденныеСтроки = Объект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
	
	Если ЗначениеЗаполнено(ВыбЗнач) Тогда
				
		НоваяСтрока = Объект.ДополнительныеДействияИнженер.Добавить();
		НоваяСтрока.ИДСтрокиЗаполняетсяИнженером = ИДСтрокиЗаполняетсяИнженером;
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.Комментарий = ВыбЗнач;
		
		Если СтрокиИнженераГдеМенялосьКоличество.НайтиПоЗначению(ИДСтрокиЗаполняетсяИнженером) = Неопределено Тогда
			СтрокиИнженераГдеМенялосьКоличество.Добавить(ИДСтрокиЗаполняетсяИнженером);
		КонецЕсли;
		
		//Если НЕ ЕстьПолныеПрава() Тогда
		//	ОтправитьУведомлениеОбИзмененииКоличестваВТаблицеИнженера(Запчасть);
		//КонецЕсли;
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].ПредыдущееКоличество = НайденныеСтроки[0].Количество;
		КонецЕсли;
		
	Иначе
		// Вернуть старое значение
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Количество = НайденныеСтроки[0].ПредыдущееКоличество;
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для изменения введенного ранее количества необходимо указать причину");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// ++ 21.11.2020
&НаКлиенте
Процедура ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение)
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) 
		ИЛИ ТипЗнч(ЗаказНаПеремещение) <> Тип("ДокументСсылка.ЗаказНаПеремещение")
		Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = ПолучитьТабДокНаСервере(ЗаказНаПеремещение);
	СинонимМакета = "Заказ на перемещение №" + ПолучитьРеквизитОбъекта(ЗаказНаПеремещение, "Номер");
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаказНаПеремещение");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	КоллекцияПечатныхФорм[0].ИмяФайлаПечатнойФормы = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);
	
КонецПроцедуры

// ++ 21.11.2020
&НаСервереБезКонтекста
Функция ПолучитьТабДокНаСервере(ЗаказНаПеремещение)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ЗаказНаПеремещение);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ЗаказНаПеремещение);

	КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм("ЗаказНаПеремещение");
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода(); 
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ЗаказНаПеремещение);
	
	ПараметрыПечати = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Документы.ЗаказНаПеремещение.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент; 
		
КонецФункции

// ++ 02.12.2020
Функция ПолучитьРеквизитОбъекта(СсылкаНаОбъект, Свойство)
	Возврат СсылкаНаОбъект[Свойство];
КонецФункции

// ++ 21.11.2020 - скопирована неэкспортная из общего модуля
&НаСервереБезКонтекста
Функция ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы)
	
	Результат = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		Результат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		Идентификаторы = СтрРазделить(Идентификаторы, ",");
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		ПечатнаяФорма = Результат.Найти(Идентификатор, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			ПечатнаяФорма = Результат.Добавить();
			ПечатнаяФорма.ИмяМакета = Идентификатор;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Идентификатор);
			ПечатнаяФорма.Экземпляров = 1;
		Иначе
			ПечатнаяФорма.Экземпляров = ПечатнаяФорма.Экземпляров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Индексы.Добавить("ИмяВРЕГ");
	Возврат Результат;
	
КонецФункции

// ++ 21.11.2020
&НаКлиенте
Процедура ПечатьДокументов(КоллекцияПечатныхФорм, Знач ОбъектыПечати = Неопределено, ВладелецФормы = Неопределено, ЗаголовокФормы = "")
	
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры

// ++ 12.01.2021
&НаСервере
Функция ПолучитьСкладыИзТаблицыИнженера()
	
	МассивСкладов = Новый Массив;
	
	Для Каждого СтрокаИнженер Из Объект.ЗаполняетсяИнженером Цикл
		
		Если ЗначениеЗаполнено(СтрокаИнженер.НоменклатураУстановленнаяКлиенту) Тогда
			Продолжить;
		КонецЕсли;
				
		Если НЕ ЗначениеЗаполнено(СтрокаИнженер.Склад) Тогда
			Продолжить;
		КонецЕсли;
			
		Если МассивСкладов.Найти(СтрокаИнженер.Склад) = Неопределено Тогда
			МассивСкладов.Добавить(СтрокаИнженер.Склад);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСкладов;
	
КонецФункции

// ++ 22.03.2021
&НаКлиенте
Процедура ЗаполняетсяИнженеромУстановкаНеТребуетсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТекущиеДанные.УстановкаНеТребуется Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураУстановленнаяКлиенту) Тогда
				// Вопрос не нужен. Флаг не ставить
				ТекущиеДанные.УстановкаНеТребуется = Ложь;
			Иначе
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
				Оповещение = Новый ОписаниеОповещения("ВопросПриИзмененииУстановкаНеТребуетсяЗавершение", ЭтотОбъект, ДопПараметры);
				ТекстВопроса = НСтр("ru = 'ВНИМАНИЕ!!! Запчасть будет помечена как не требующая установки. Продолжить?'");
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ++ 22.03.2021
&НаКлиенте
Процедура ВопросПриИзмененииУстановкаНеТребуетсяЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда	
		
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		ТекущиеДанные.УстановкаНеТребуется = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

// ++ 01.04.2021
&НаСервереБезКонтекста
Функция КоэффициентПересчета(ВалютаУправленческогоУчета, ВалютаРегламентированногоУчета, ДатаДокумента)
	
	Возврат РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(
											ВалютаУправленческогоУчета,
											ВалютаРегламентированногоУчета,
											?(ДатаДокумента = Дата(1,1,1), ТекущаяДатаСеанса(), ДатаДокумента));
	
КонецФункции

//++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
&НаКлиенте
Процедура ЗаполняетсяИнженеромНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаполняетсяИнженером.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ НоменклатураДоступнаДляВыбора(ТекущиеДанные.НоменклатураПринятаяОтКлиента) Тогда
			ТекущиеДанные.НоменклатураПринятаяОтКлиента = Неопределено;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите позицию не LOA!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.07.2021

//++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
&НаСервереБезКонтекста
Функция НоменклатураДоступнаДляВыбора(Номенклатура)
	
	Если ВРег(Прав(СокрЛП(Номенклатура.Артикул), 3)) = "LOA" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции //-- смарт:ММ 15.07.2021

//++ смарт:ММ #044 224 15.07.2021 - Заявка на гарантийный ремонт 
&НаСервереБезКонтекста
Функция ПодобратьНоменклатуруНеLOA(Номенклатура)
	
	ПодобранныйАртикул = СокрЛП(Номенклатура.Артикул);
	
	Артикул = Лев(ПодобранныйАртикул, СтрДлина(ПодобранныйАртикул) - 3);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|	И НЕ Номенклатура.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	2
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|	И Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_Приоритет
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Приоритет КАК ВТ_Приоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ВТ_Приоритет.Порядок = ВТ.Порядок";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
КонецФункции //-- смарт:ММ 15.07.2021

//++ смарт:ММ 591 13.08.2021
&НаКлиенте
Процедура ДокументОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ПоказатьЗначение(, Объект.ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 13.08.2021

//++ #1287 смарт: Фролов 24.04.2023 //Работа с гарантийными и коммерческими запасными частями
&НаКлиенте
Процедура ОтветЗаписатьДокументДляОтчета(Результат,ДопПараметры)Экспорт
	Если Результат=КодВозвратаДиалога.Да Тогда 
		ОтветЗаписатьДокументДляОтчетаНаСервере();
		Если ТипЗнч(ЭтаФорма.ОтчетМимаки)=Тип("СправочникСсылка.смартОтчетПоГарантииМимаки") Тогда
			ПоказатьЗначение(,ЭтаФорма.ОтчетМимаки); 
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры //-- #1287 смарт: Фролов 24.04.2023

//++ #1287 смарт: Фролов 24.04.2023 //Работа с гарантийными и коммерческими запасными частями
&НаСервере
Процедура ОтветЗаписатьДокументДляОтчетаНаСервере()

	//++ #1287 смарт: Лопато 20.06.2023 //Работа с гарантийными и коммерческими запасными частями
	//НачатьТранзакцию();
	//Попытка 
	//	ОбОтчет=Справочники.смартОтчетПоГарантииМимаки.СоздатьЭлемент();
	//	ОбОтчет.УстановитьНовыйКод(ЭтаФорма.Префикс);
	//	ОбОтчет.Наименование="Отчет по гарантии Мимаки (смарт) №"+ОбОтчет.Код+" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	//	ОбОтчет.Записать();
	//	СтруктураПрефиксНомер = смартОбщегоНазначения.РазбитьСтрокуНаПрефиксИНомер(ОбОтчет.Код);
	//	ЭтаФорма.ВнешнийНомер 	= СтруктураПрефиксНомер.Номер;
	//	ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Истина; 
	//	ЭтаФорма.ОтчетМимаки=ОбОтчет.Ссылка; 
	//	НеПроверятьРеквизиты=Истина;
	//	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	//	ОбОтчет2=ОбОтчет.Ссылка.ПолучитьОбъект();
	//	ОбОтчет2.ДокументОснование=Объект.Ссылка;                             
	//	ОбОтчет2.Серия=Объект.Серия;	
	//	ОбОтчет2.Оборудование=Объект.Оборудование;
	//	ОбОтчет2.Записать();
	//	ЗафиксироватьТранзакцию();
	//	ЭтаФорма.Модифицированность=Истина; 
	//	НеПроверятьРеквизиты=Ложь;
	//Исключение
	//	ОтменитьТранзакцию();	
	//КонецПопытки; 

	НачатьТранзакцию();
	
	РезультатЗаписиДокумента = Ложь;
    ТестОошибкиЗаписиДокумента = "Не удалось записать Заявку на гарантийный ремонт! Проверьте заполнение реквизитов!";

	ОбОтчет = Справочники.смартОтчетПоГарантииМимаки.СоздатьЭлемент();
	ОбОтчет.УстановитьНовыйКод(ЭтаФорма.Префикс);

	НовыйКодОтчета = ОбОтчет.Код;
	СтруктураПрефиксНомер = смартОбщегоНазначения.РазбитьСтрокуНаПрефиксИНомер(НовыйКодОтчета);

	ЭтаФорма.ВнешнийНомер = СтруктураПрефиксНомер.Номер;
	ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Истина; 
	
	НеПроверятьРеквизиты = Истина;
	
	Попытка
		РезультатЗаписиДокумента = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	Исключение
		Сообщить(ТестОошибкиЗаписиДокумента);
		ОтменитьТранзакцию();	
		Возврат;                                                                                       
    КонецПопытки;

	НеПроверятьРеквизиты = Ложь;
	
	Если НЕ РезультатЗаписиДокумента Тогда
		Сообщить(ТестОошибкиЗаписиДокумента);
		ОтменитьТранзакцию();	
		Возврат;
	Иначе

		ОбОтчет.Наименование 	  = "Отчет по гарантии Мимаки (смарт) №"+ОбОтчет.Код+" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		ОбОтчет.ДокументОснование = Объект.Ссылка;                             
		ОбОтчет.Серия 			  = Объект.Серия;	
		ОбОтчет.Оборудование 	  = Объект.Оборудование;
		
		Попытка		
			ОбОтчет.Записать();

			ЗафиксироватьТранзакцию();
			
			ЭтаФорма.ОтчетМимаки = ОбОтчет.Ссылка; 
		Исключение
			Сообщить("Не удалось записать ""Отчет по гарантии Мимаки"" с кодом: " + НовыйКодОтчета + "!");
			
			ОтменитьТранзакцию();	
			
			ЭтаФорма.ВнешнийНомер = ""; 
			ЭтаФорма.ОтчетМимаки = Неопределено; 
		КонецПопытки;
		
	КонецЕсли;	

	ЭтаФорма.Модифицированность = Истина; 
	//-- #1287 смарт: Лопато 20.06.2023
	
КонецПроцедуры //-- #1287 смарт: Фролов 24.04.2023	

//++ #1287 смарт: Фролов 15.03.2023 //Работа с гарантийными и коммерческими запасными частями 
&НаКлиенте
Процедура ВнешнийНомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
	// Закомментировал ниже
	// Если ПоставщикМимаки() И Не ЗначениеЗаполнено(ЭтаФорма.ВнешнийНомер) Тогда
	// Добавил ниже
	Если Мимаки_УсловияОбъектаВыполнены() И Не ЗначениеЗаполнено(ЭтаФорма.ВнешнийНомер) Тогда
	//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
		Если ТипЗнч(ЭтаФорма.ОтчетМимаки)=Тип("СправочникСсылка.смартОтчетПоГарантииМимаки") Тогда
			СтандартнаяОбработка=Ложь;
			ПоказатьЗначение(,ЭтаФорма.ОтчетМимаки);
		Иначе
			СтандартнаяОбработка=Ложь;
			ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
			ОткрытьФорму("Справочник.смартОтчетПоГарантииМимаки.Форма.ФормаЭлемента",ПараметрыФормы,ЭтаФорма);
		КонецЕсли;
	Иначе
		Если СтрДлина(СокрЛП(Текст))=6 Тогда
			ЭтаФорма.ВнешнийНомер=Текст; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры //-- #1287 смарт: Фролов 15.03.2023


//++ #1287 смарт: Фролов 04.04.2023 //Работа с гарантийными и коммерческими запасными частями 
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ЭтаФорма.ОтчетМимаки) И ТипЗнч(ЭтаФорма.ОтчетМимаки)=Тип("СправочникСсылка.смартОтчетПоГарантииМимаки") Тогда
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ОтчетМимаки.ДокументОснование) Тогда
			Об=ЭтаФорма.ОтчетМимаки.ПолучитьОбъект();
			Об.ДокументОснование=Объект.Ссылка;
			Об.Записать();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
//-- #1287 смарт: Фролов 04.04.2023

//++ #1348 смарт: Фролов 02.05.2023 //Добавить предупреждение при создании Гар. заявки на основании Заявки на ремонт  
&НаСервере
Функция ПроверитьНаличиеГарантийныхЗаявок()
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК ссылка
	                    |ИЗ
	                    |	Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	                    |ГДЕ
	                    |	смартЗаявкаНаГарантийныйРемонт.ДокументОснование = &ДокументОснование
	                    |	И НЕ смартЗаявкаНаГарантийныйРемонт.ПометкаУдаления");
	Запрос.УстановитьПараметр("ДокументОснование",Объект.ДокументОснование);
	Рез=Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество()>0 Тогда 
		МассивДокументов=Новый Массив;
		Для Каждого Стр Из Рез Цикл
			МассивДокументов.Добавить(Стр.ссылка);			
		КонецЦикла;	
		Возврат МассивДокументов;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции //-- #1348 смарт: Фролов 02.05.2023

//++ #1348 смарт: Фролов 02.05.2023 //Добавить предупреждение при создании Гар. заявки на основании Заявки на ремонт
&НаКлиенте
Процедура ПриСозданииНовогоДокументаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ="ПерейтиКЗаявке" Тогда
		ПоказатьЗначение(,ДополнительныеПараметры.Заявка);
		ЭтаФорма.Закрыть(); 
	ИначеЕсли Ответ="Отмена" Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли;	
КонецПроцедуры //-- #1348 смарт: Фролов 02.05.2023	

#КонецОбласти

#Область Мимаки

//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
&НаСервере
Функция Мимаки_УсловияОбъектаВыполнены()

	Возврат смартОбщегоНазначения.Мимаки_УсловияОбъектаВыполнены(Объект);	
	
КонецФункции
//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)

//++ #1287 смарт: Фролов 15.03.2023 //Работа с гарантийными и коммерческими запасными частями 
&НаСервере
Процедура УстановитьВидимостьОтчетМимаки()
	
	//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
	//
	// Если в документе выбрано оборудование (номенклатура) производителя Мимаки, 
	// то показываем поле со ссылкой на Отчет (Справочник), либо указываем необходимость в
	// его создании.
	
	// Добавил новый код
	Элементы.ОтчетМимаки.Видимость = Ложь;
	Элементы.ВнешнийНомер.ТолькоПросмотр = ЛожЬ;	
	
	Если Мимаки_УсловияОбъектаВыполнены() Тогда
		
		Элементы.ОтчетМимаки.Видимость = Истина;
		Элементы.ВнешнийНомер.ТолькоПросмотр = Истина;		
		
		//++#1466 смарт: Ермаков 23.10.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
		// Добавил. Исправил баг.
		ОтчетМимаки = "Issue report";
		//--#1466 смарт: Ермаков 23.10.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
		
		Если Объект.Ссылка.Пустая() Тогда
			
			//++#1466 смарт: Ермаков 23.10.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
			// Отключил. Баг.
			//ОтчетМимаки = "Issue report";
			//--#1466 смарт: Ермаков 23.10.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
			Возврат;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Справочник.смартОтчетПоГарантииМимаки
		|ГДЕ
		|	ДокументОснование = &ДокументОснование
		|	И НЕ ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОтчетМимаки = Выборка.Ссылка; 	
		КонецЕсли;
		
	КонецЕсли;
	
	// Отключил старый код
	//Если ЗначениеЗаполнено(Объект.Поставщик) Тогда
	//	ЭтоМимаки=Объект.Поставщик=Справочники.смартПредопределенныеЗначения.ПоставщикМимаки.Значение;
	//	Если НЕ Объект.Ссылка.Пустая() Тогда
	//		Если ЭтоМимаки Тогда
	//			Элементы.ОтчетМимаки.Видимость=Истина;
	//			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//			                    |	смартОтчетПоГарантииМимаки.Ссылка КАК Ссылка
	//			                    |ИЗ
	//			                    |	Справочник.смартОтчетПоГарантииМимаки КАК смартОтчетПоГарантииМимаки
	//			                    |ГДЕ
	//			                    |	смартОтчетПоГарантииМимаки.ДокументОснование = &ДокументОснование
	//			                    |	И НЕ смартОтчетПоГарантииМимаки.ПометкаУдаления"); 
	//			Запрос.УстановитьПараметр("ДокументОснование",Объект.ссылка);
	//			Выборка=Запрос.Выполнить().Выбрать();
	//			Если Выборка.Следующий() ТОгда                                     
	//				ЭтаФорма.ОтчетМимаки=Выборка.ссылка; 
	//			КонецЕсли;
	//			ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Истина;
	//		Иначе
	//			Элементы.ОтчетМимаки.Видимость=Ложь;
	//			ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Ложь;
	//		КонецЕсли;
	//	Иначе
	//		Если ЭтоМимаки Тогда
	//			Элементы.ОтчетМимаки.Видимость=Истина;
	//			ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Истина;
	//			ЭтаФорма.ОтчетМимаки="Issue report";
	//		Иначе	
	//			Элементы.ОтчетМимаки.Видимость=Ложь;
	//			ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Ложь;
	//		КонецЕсли;	
	//	КонецЕсли;
	//Иначе
	//	Элементы.ОтчетМимаки.Видимость=Ложь;
	//	ЭтаФорма.Элементы.ВнешнийНомер.ТолькоПросмотр=Ложь;
	//КонецЕсли;
	
	//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki) 
	
КонецПроцедуры //-- #1287 смарт: Фролов 15.03.2023

//++ #1287 смарт: Фролов 15.03.2023 //Работа с гарантийными и коммерческими запасными частями  
&НаКлиенте
Процедура ОтчетМимакиНажатие(Элемент, СтандартнаяОбработка)
	//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
	// Закомментировал ниже
	// Если ПоставщикМимаки() Тогда
	// Добавил ниже
	Если Мимаки_УсловияОбъектаВыполнены() Тогда
	//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
		Если ТипЗнч(ЭтаФорма.ОтчетМимаки)=Тип("СправочникСсылка.смартОтчетПоГарантииМимаки") Тогда
			СтандартнаяОбработка=Ложь;
			ПоказатьЗначение(,ЭтаФорма.ОтчетМимаки);
		Иначе
			СтандартнаяОбработка=Ложь; 
			Если Объект.Ссылка.Пустая() Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ОтветЗаписатьДокументДляОтчета",ЭтотОбъект);
				ПоказатьВопрос(Оповещение,"Для продолжения операции наобходимо записать документ. Продолжить?", Режим,,КодВозвратаДиалога.Нет,"Заявка не записана");
			Иначе
				СтандартнаяОбработка=Ложь;
				ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
				ОткрытьФорму("Справочник.смартОтчетПоГарантииМимаки.Форма.ФормаЭлемента",ПараметрыФормы,ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
	Иначе	
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры //-- #1287 смарт: Фролов 15.03.2023

//++ #1603 смарт: Мосолов 18.01.2024 //Доработка гарантийного блока / Изменить логику DOA
&НаКлиенте
Процедура смартДекорацияDOAНажатие(Элемент)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЗаполняетсяИнженером; 
	
КонецПроцедуры //-- #1603 смарт: Мосолов 18.01.2024 

//++ #1963 смарт: Мосолов 26.08.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт
&НаКлиенте
Процедура ИзменитьДокументПриобретения(Команда)

	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);

	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);  
	
КонецПроцедуры //-- #1963 смарт: Мосолов 26.08.2024

//++ #1852 смарт: Шляпников 15.01.2025 / Подбор документа поступления в Заявку на гарантийный ремонт. Доработка алгоритма.
&НаКлиенте
Процедура ИзменитьДокументПоступлениеНаСклад(Команда)
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
    ОткрытьФорму("Документ.ПоступлениеТоваровНаСклад.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

//++ #1963 смарт: Мосолов 26.08.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт
&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	
	ОбработатьИзменениеНоменклатурыСерии();
	
КонецПроцедуры //-- #1963 смарт: Мосолов 26.08.2024  

//++ #1963 смарт: Мосолов 26.08.2024 //Доработка гарантийного блока / автозаполнение полей документ Заявка на гарантийный ремонт
&НаСервере
Процедура ОбработатьИзменениеНоменклатурыСерии()  
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Объект.ДокументПриобретения = ДокументОбъект.НайтиДокументПриобретения(Объект.Оборудование, Объект.Серия);
	Объект.Поставщик = ?(ЗначениеЗаполнено(Объект.ДокументПриобретения), Объект.ДокументПриобретения.Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
	ДокументОбъект.УстановитьНовыйНомер();    
	
	СтруктураПрефиксНомер = смартОбщегоНазначения.РазбитьСтрокуНаПрефиксИНомер(ДокументОбъект.Номер);
	Префикс 		= СтруктураПрефиксНомер.Префикс;
	ВнешнийНомер 	= СтруктураПрефиксНомер.Номер;
	
КонецПроцедуры //-- #1963 смарт: Мосолов 26.08.2024

//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Клиент);
	
КонецПроцедуры

//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
// Функция нигде не используется. Отключил.
//++ #1287 смарт: Фролов 15.03.2023 //Работа с гарантийными и коммерческими запасными частями 
//&НаСервере
//Функция ПоставщикМимаки()
//	Если ЗначениеЗаполнено(Объект.Поставщик) Тогда
//		Возврат Объект.Поставщик=Справочники.смартПредопределенныеЗначения.ПоставщикМимаки.Значение;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;	
//КонецФункции //-- #1287 смарт: Фролов 15.03.2023
//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)

// -- Перенес процедуры в отдельную область
//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)

#КонецОбласти
