
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	НаименованиеОборудования = СформироватьНаименованиеОборудования();	
	
КонецПроцедуры

// ++ 19.01.2021
Процедура ПриЗаписи(Отказ)
	
	//++ #Б-2620 смарт: Лопато 12.03.2025 //Удалить Спецификации по IECHO из задач.  
	// Закомментировал код
	//Если ПометкаУдаления Тогда
	//	Попытка
	//		ВыполнитьЗадачуБизнесПроцесса();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//-- #Б-2620 смарт: Лопато 12.03.2025
	
КонецПроцедуры

Функция СформироватьНаименованиеОборудования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Комплектующие.НаименованиеКомплектующей КАК Справочник.смартIECHOКомплектующие) КАК НаименованиеКомплектующей
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК Комплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТЧ.НаименованиеКомплектующей.Наименование КАК Наименование,
	|	ВТ_ТЧ.НаименованиеКомплектующей.ОсновнаяКомплектующая КАК ОсновнаяКомплектующая
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнаяКомплектующая УБЫВ,
	|	Наименование";
	
	Запрос.УстановитьПараметр("ТЧ", Комплектующие.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = "";
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Результат + ?(ЗначениеЗаполнено(Результат), "_", "") + Выборка.Наименование;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область Печать

Функция СформироватьКоммерческоеПредложение() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	МакетКП = ПолучитьМакет("МакетКП");
	ОбластьКП = МакетКП.ПолучитьОбласть("ОбластьКП");
	ТабДок.Вывести(ОбластьКП);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

// ++ 19.01.2021
Процедура ВыполнитьЗадачуБизнесПроцесса()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.Выполнена
	|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрута
	|	И ЗадачаИсполнителя.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ПометитьСпецификациюНаУдаление); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Задача = Выборка.Ссылка.ПолучитьОбъект();		
		Задача.ВыполнитьЗадачу();
		// БП должен сам завершиться, т.к. это финальная точка
	Иначе
		
		// Завершить БП, если текущая точка маршрута любая другая
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартIECHOПродажа.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_БизнесПроцессы
		|ИЗ
		|	БизнесПроцесс.смартIECHOПродажа КАК смартIECHOПродажа
		|ГДЕ
		|	смартIECHOПродажа.Стартован
		|	И смартIECHOПродажа.Предмет = &Предмет
		|	И НЕ смартIECHOПродажа.Завершен";
		
		Запрос.УстановитьПараметр("Предмет", Ссылка);
		ВыборкаБП = Запрос.Выполнить().Выбрать();
		Пока ВыборкаБП.Следующий() Цикл
			смартОбщегоНазначения.ЗавершитьБизнесПроцессИЗадачи(ВыборкаБП.Ссылка, "Спецификация помечена на удаление. Бизнес-процесс остановлен");
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры

//++ смарт:ММ 621 30.09.2021 
Процедура СортироватьТаблицуКомплектующих() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.Цена КАК Цена,
	|	ТЗ.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Цена КАК Цена,
	|	ВТ.Стоимость КАК Стоимость,
	|	смартIECHOКомплектующие.Порядок КАК Порядок
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующие
	|		ПО ВТ.НаименованиеКомплектующей = смартIECHOКомплектующие.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартIECHOКомплектующие.Порядок";
	
	Запрос.УстановитьПараметр("ТЗ", Комплектующие.Выгрузить());
	
	Комплектующие.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры //-- смарт:ММ 30.09.2021

