
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОпределенииОписанияСвойствОбъектовДляПоиска(ТипОбъекта, ОписаниеСвойств) Экспорт
	
	// +CRM Модуль
	Если ТипОбъекта = Тип("СправочникОбъект.Контрагенты")
		Или ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда
		ОписаниеСвойств.Вставить("ИНН", Перечисления.CRM_ПоляПоискаКонтактов.ИНН);
	КонецЕсли;
	// -CRM Модуль
	
КонецПроцедуры

Процедура ПриОпределенииКонтактаДанныхПоиска(ТипОбъекта, Контакт, ОбъектПоиска) Экспорт
	
	// +CRM Модуль
	Если ТипОбъекта = Тип("СправочникОбъект.Контрагенты")
		Или ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда
		Контакт = ОбъектПоиска.Партнер;
	КонецЕсли;
	// -CRM Модуль
	
КонецПроцедуры

#КонецОбласти
