
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ФорматЭтикетки = "80x50";	
	
	Параметры.Свойство("НомерЗаказа", НомерЗаказа); 
	Параметры.Свойство("ТипПечати", ТипПечати); 
	
	Если Параметры.Свойство("ТолькоВыборФормата") Тогда
		
		ТолькоВыборФормата = Параметры.ТолькоВыборФормата;	
		
	ИначеЕсли Не (ЗначениеЗаполнено(НомерЗаказа) И ЗначениеЗаполнено(ТипПечати)) Тогда
		
		Отказ = Истина;			
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда) 
	
	Если ТолькоВыборФормата Тогда
		
		ЭтаФорма.Закрыть(ФорматЭтикетки);
		
		Возврат;
		
	КонецЕсли;
	
	МассивBase64 = ПолучитьЭтикетки(); 
	
	Если ЗначениеЗаполнено(МассивBase64) Тогда  
		
		Для Каждого ОтветBase64 Из МассивBase64 Цикл 
			
			ДвоичныеДанные = Base64Значение(ОтветBase64);
			
			ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
			
			ДвоичныеДанные.Записать(ИмяФайла);
			
			ЗапуститьПриложение(ИмяФайла); 
			
		КонецЦикла;
		
		ЭтаФорма.Закрыть();
		
	Иначе
		
		Если МассивBase64 = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Этикетка не доступна для выбранного заказа");
			
			ЭтаФорма.Закрыть();
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Во время запроса печатной формы произошла ошибка");
			
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЭтикетки()
	
	СтруктураОтвета = ДЛ_ДеловыеЛинии.ПолучитьЭтикетки(НомерЗаказа, ФорматЭтикетки, ТипПечати); 
	
	Если СтруктураОтвета["data"] <> Неопределено Тогда
		
		Если СтруктураОтвета["data"].Количество() = 0 Тогда
			
			Возврат 0;
			
		Иначе        
			
			МассивBase64 = Новый Массив;
			
			Для Каждого ЗаписьДанных Из СтруктураОтвета["data"] Цикл
				
				МассивBase64.Добавить(ЗаписьДанных["base64"]);	
				
			КонецЦикла;
		
			Возврат МассивBase64;
			
		КонецЕсли;	
		
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции
