
&Перед("ПриКомпоновкеРезультата")
Процедура смарт_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//#1293 смарт: Лопато 12.01.2023 //Необходимо добавить в отчет «Движения товаров на складах» номера PRE из документов расхода и прихода

	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();

	Если НастройкиОсновнойСхемы.Структура.Количество() = 1 
		И НастройкиОсновнойСхемы.Структура[0].ПоляГруппировки.Элементы.Количество() = 1 
		И НастройкиОсновнойСхемы.Структура[0].ПоляГруппировки.Элементы[0].Поле = Новый ПолеКомпоновкиДанных("Регистратор") Тогда
		
		Для Каждого ВыборПоле Из НастройкиОсновнойСхемы.Выбор.Элементы Цикл
			Если ВыборПоле.Поле = Новый ПолеКомпоновкиДанных("смартНомерЗаявкиНаГарантийныйРемонт")	Тогда
				ВыборПоле.Использование = Истина;
			КонецЕсли;	
		КонецЦикла;

		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОсновнойСхемы);
		
	КонецЕсли;   
	
КонецПроцедуры //--#1293 смарт: Лопато 12.01.2023
			   
