#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаСмартКоэффициентыМенеджеров(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);

	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаСмартКоэффициентыМенеджеров(Запрос, ТекстыЗапроса, Регистры) Экспорт

	ИмяРегистра = "смартКоэффициентыМенеджеров";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата КАК Период,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер КАК Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент) КАК ВидКоэффициента,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.ИтоговыйКоэффициент КАК Коэффициент
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтВыручки),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтВыручки
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКонверсии),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтКонверсии
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтПотериЛидов),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтПотериЛидов
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтКоммерческогоОтдела
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента В (ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент), ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтМаркетинговогоОтдела
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента В (ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент), ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела))";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли