#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	Менеджеры.Очистить();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
	//
	//Документы.смартКорректировкаКоэффициентовМенеджеров.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//ОтразитьСмартКоэффициентыМенеджеров(ДополнительныеСвойства, Движения, Отказ);
	//
	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОтразитьСмартКоэффициентыМенеджеров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	//Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмартКоэффициентыМенеджеров;
	//
	//Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДвиженияСмартКоэффициентыМенеджеров = Движения.смартКоэффициентыМенеджеров;
	//ДвиженияСмартКоэффициентыМенеджеров.Записывать = Истина;
	//
	//ДвиженияСмартКоэффициентыМенеджеров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Дата=ТекущаяДата();
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	ВидКоэффициента=Перечисления.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Менеджеры.Количество()=0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ не содержит строк!");
		Отказ=Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
