#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик получения формы справочника.
//
// Параметры:
//	ВидФормы					- Строка	- Вид формы справочника.
//	Параметры					- Структура	- Параметры, переданные для формы.
//	ВыбраннаяФорма				- Строка	- Имя открываемой формы справочника.
//	ДополнительнаяИнформация	- Строка	- Дополнительная информация.
//	СтандартнаяОбработка		- Булево	- Признак стандартной обработки.
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.Предопределенный Тогда
				// Запрещаем редактировать предопределенный элемент.
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлемента";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаПолученияФормы()

#КонецОбласти

#КонецЕсли