
#Область ПеренесеноСДоработкамиСмарт

&НаКлиенте
Процедура смарт_ТоварыЦенаПриИзмененииПеред(Элемент)
	//++ #1607 смарт: Фролов 18.01.2024 //Ограничения в форме интереса на установку цен
	смартПроверитьВидЦены();
	//-- #1607 смарт: Фролов 18.01.2024
КонецПроцедуры

&НаКлиенте
Процедура смарт_ТоварыСуммаПриИзмененииПеред(Элемент)
	//++ #1607 смарт: Фролов 18.01.2024 //Ограничения в форме интереса на установку цен
	смартПроверитьВидЦены();
	//-- #1607 смарт: Фролов 18.01.2024
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура смарт_ПриОткрытии(Отказ)

	ДоступностьПотенциальногоКлиента();
	ДоступностьПервичногоИнтереса();
	УстановитьДоступностьИнтереса();
	
	#Удаление //++ #1607 смарт: Фролов 22.01.2024 //Ограничения в форме интереса на установку цен
	ОбновитьЗаголовокГруппыТовары();
	#КонецУдаления //-- #1607 смарт: Фролов 22.01.2024
	
	#Вставка
	//++ #1607 смарт: Фролов 22.01.2024 //Ограничения в форме интереса на установку цен
	#Если Не ВебКлиент Тогда
		Элементы.ТоварыВерхнийУровень.Заголовок = НСтр("ru = 'Товары и услуги'; en = 'Goods and Services'") + " (" + Объект.Товары.Количество() 
		+ ?(Объект.Товары.Количество() = 0, "", НСтр("ru = ' поз'; en = 'pos'")) + ")";
	#КонецЕсли
	//-- #1607 смарт: Фролов 22.01.2024
	#КонецВставки
	
	ОформлениеИзбранного();
	УстановитьВидимостьЭлементовПоТипуОбращения();

	Если КлючОткрываемойАктивности <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ПозиционироватьНаВзаимодействие", 0.2, Истина);
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ЛентаСобытий
	БыстрыйВвод_КэшированноеВремя = 0;
	БыстрыйВвод_КэшированнаяДатаНачала = БыстрыйВвод_ДатаНачала;
	БыстрыйВвод_АктивенАвтоПодбор = Ложь;
	Лента_Прокрутить = Ложь;
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
	// Конец ЛентаСобытий

	Если РегистрироватьСвязиВИнтересах Тогда
		ПодключитьОбработчикОжидания("ОбновитьЗаголовокСвязиМеждуПартнерами", 0.3, Истина);
	КонецЕсли;

	Если УстановитьТолькоПросмотр Тогда
		ТолькоПросмотр										= Истина;
		Элементы.ГруппаКоманднаяПанель.Доступность			= Ложь;
		Элементы.ГруппаПанельСостояний.Доступность			= Ложь;
		Элементы.Лента_ПанельКоманд.Доступность				= Ложь;
		Элементы.БыстрыйВвод_ПримечаниеТема.Доступность		= Ложь;
	КонецЕсли;

	#Если ВебКлиент Тогда
		Элементы.СкрытоеПолеТегов.Видимость	= Ложь;	
		Элементы.СкрытоеПолеЛенты.Видимость	= Ложь;	
	#Иначе	
		Элементы.СкрытоеПолеТеговВеб.Видимость	= Ложь;	
	#КонецЕсли

	Если CRM_ОбщегоНазначенияКлиент.ЭтоМобильныйКлиент() Тогда
		ЗаполнитьПанельСостоянийИнтереса();
	КонецЕсли;
	
	#Вставка
	//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
	Если НЕ Объект.Партнер.Пустая() Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера",1);
	КонецЕсли;
	//-- #Б1174 смарт: Шляпников 21.10.2024
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбновитьЗаголовокГруппыТовары")
Процедура смарт_ОбновитьЗаголовокГруппыТовары()

	ИмяКолонкиИтога = "";
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИмяКолонкиИтога = "Всего";
	Иначе
		ИмяКолонкиИтога = "СуммаСНДС";
	КонецЕсли;

	ИтогВсего = Объект.Товары.Итог(ИмяКолонкиИтога);
	#Если Не ВебКлиент Тогда
		Элементы.ТоварыВерхнийУровень.Заголовок = НСтр("ru = 'Товары и услуги'; en = 'Goods and Services'") + " (" + Объект.Товары.Количество() 
		+ ?(Объект.Товары.Количество() = 0, "", НСтр("ru = ' поз'; en = 'pos'") + ", " + ИтогВсего + " " + Строка(Объект.Валюта)) + ")";
	#КонецЕсли
    #Удаление //++ #1607 смарт: Фролов 18.01.2024 //Ограничения в форме интереса на установку цен
	Элементы.ГруппаПерезаполнитьОжидаемуюВыручку.Видимость = (ИтогВсего <> Объект.ОжидаемаяВыручка);
    #КонецУдаления //-- #1607 смарт: Фролов 18.01.2024
	
	#Вставка
	//++ #1607 смарт: Фролов 18.01.2024 //Ограничения в форме интереса на установку цен
	//Удалили кусок выше и просто сразу пересчитываем сумму
	Если ИтогВсего <> Объект.ОжидаемаяВыручка Тогда
		ПерезаполнитьОжидаемуюВыручкуНаСервере();
	КонецЕсли;
	//-- #1607 смарт: Фролов 18.01.2024
	#КонецВставки
КонецПроцедуры

&НаКлиенте
Процедура смарт_СоглашениеПриИзмененииПосле(Элемент)
	//++ #1607 смарт: Фролов 19.01.2024 //Ограничения в форме интереса на установку цен
	Элементы.ГруппаПерезаполнитьОжидаемуюВыручку.Видимость = Ложь;
	Если Объект.Товары.Количество()>0 Тогда
		ОбновитьЗаголовокГруппыТовары();
	КонецЕсли;
	//-- #1607 смарт: Фролов 19.01.2024
КонецПроцедуры

&НаСервере
Процедура смарт_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//++ #1607 смарт: Фролов 24.01.2024 //Ограничения в форме интереса на установку цен
	НомСтр=1;
	БылиОшибки=Ложь;
	Для Каждого СтрТовары Из ТекущийОбъект.Товары Цикл
		Если СтрТовары.Цена=0 Тогда
			Сообщить("В строке "+НомСтр+" табличной части товары не заполнена цена!");
			БылиОшибки=Истина;
		КонецЕсли;
		Если СтрТовары.СуммаСНДС=0 Тогда
			Сообщить("В строке "+НомСтр+" табличной части товары не заполнена сумма!");
			БылиОшибки=Истина;
		КонецЕсли;
		НомСтр=НомСтр+1;
	КонецЦикла;
	Если БылиОшибки ТОгда
		Отказ=Истина;
	КонецЕсли;	
	//-- #Задача смарт: Фролов 24.01.2024
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, ПараметрыЗаписи)
	ДокументЗаписан = Ложь;
	Если Элементы.ГруппаРеквизитыКлиента.Видимость Тогда
		Если НЕ Клиент_Проверен Тогда
			Отказ = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаКлиентаПродолжение", ЭтотОбъект);
			НайтиДубли(ОписаниеОповещения);
			Возврат;
		КонецЕсли;
		СоздатьКлиентаИКонтактНаСервере();
		ДоступностьПотенциальногоКлиента();
		ПартнерПриИзменении(Неопределено);
		КонтактноеЛицоПриИзменении();
	КонецЕсли;

	Если Не Объект.Завершен Тогда
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) И CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Партнер, "ЮрФизЛицо") <> ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда
				Если ОбязательноУказыватьКЛ() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбран основной контакт клиента!';en='Incomplete contact'"));
					Отказ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
		#Удаление //++ #1679 смарт: Фролов 11.03.2024 //Убрать обязательную проверку заполнения реквизита ПотенциальныйКлиент в Интересе
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен потенциальный клиент';en='Missing potential customer'"));
			Отказ = Истина;
		#КонецУдаления
		
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Партнер) И НЕ ЭтоПоддержка Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ РазрешатьСозданиеИнтересовПоОдномуТипуУслуги И НЕ CRM_ОбщегоНазначенияКлиент.ПроверитьВозможностьЗаписиИнтереса(Объект) Тогда
				ПоказатьПредупреждение(, НСтр("ru='Обнаружен активный интерес клиента по выбранному типу услуги, запись документа отменена!';en='Active lead of customer on the chosen type of service was discovered, the document record was canceled!'"));
				Отказ = Истина;
			КонецЕсли;	
		Иначе
			// С001031210
			// Если НЕ (Объект.СостояниеИнтереса = ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ИнтересПотерян")) Тогда
			//	Если НЕ CRM_ОбщегоНазначенияКлиент.ПроверитьВозможностьЗаписиИнтересаПотенциальногоКлиента(Объект) Тогда
			//		ПоказатьПредупреждение(, НСтр("ru='Обнаружен активный интерес потенциального клиента, запись документа отменена!';en='The active lead of the potential customer is detected, the record of the document is canceled!'"));
			//		Отказ = Истина;
			//	КонецЕсли;	
			// КонецЕсли;
		КонецЕсли;	

		Если ПроверяемыеРеквизитыИнтереса.Найти("Партнер")<>Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен клиент';en='The customer is not filled in'"));
				Отказ = Истина;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) И CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Партнер, "ЮрФизЛицо") <> ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда
				Если ОбязательноУказыватьКЛ() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено контактное лицо';en='Not filled in contact person'"));
					Отказ = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;

	КонецЕсли;


	// Проверяем, что поля подразделение и офис заполнены.		
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда

		Объект.Подразделение = CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(Объект.Ответственный, "Подразделение");

		Если НЕ ЗначениеЗаполнено(Объект.Подразделение)
			И ТипЗнч(Объект.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда // в случае незаполненности реквизита при выбранной роли - не отказываемся от записи

			ТекстСообщения = Нстр("ru='У текущего пользователя не заполнено подразделение!';en='The current user does not have a department!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ответственный);
			Отказ = Истина;
			Возврат;

		КонецЕсли;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Офис) Тогда

		Объект.Офис = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Подразделение, "CRM_офис");			
		Если НЕ ЗначениеЗаполнено(Объект.Офис)
			И ТипЗнч(Объект.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда // в случае незаполненности реквизита при выбранной роли - не отказываемся от записи

			ТекстСообщения = Нстр("ru='У подразделения пользователя не заполнен офис!';en='Office is not filled in user department!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Подразделение);
			Отказ = Истина;
			Возврат;

		КонецЕсли;

	КонецЕсли;

	НовыйИнтерес = Объект.Ссылка.Пустая();

КонецПроцедуры

//++ #1615 смарт: Мосолов 25.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
&НаКлиенте
&ИзменениеИКонтроль("СоздатьКлиента")
Процедура смарт_СоздатьКлиента(Команда)
	
	#Вставка
	//++ #1683 смарт: Фролов 14.03.2024 //Быстрое создание Партнера из Интереса.
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартЛид") Тогда

		Лид = Объект.ДокументОснование;
		
		ПараметрыКИ = Новый Структура;
		СтруктураКИ = Новый Структура;
		СтруктураКИ.Вставить("Телефон", Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Лид, "Телефон"));
		СтруктураКИ.Вставить("ЭлектроннаяПочта", Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Лид, "ЭлектроннаяПочта"));
		СтруктураКИ.Вставить("Имя", Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Лид, "Имя"));
		СтруктураКИ.Вставить("БизнесРегион", Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Лид, "БизнесРегион"));
		СтруктураКИ.Вставить("ОсновнойМенеджер", Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Лид, "Ответственный"));
		ПараметрыКИ.Вставить("КонтактныеДанныеЛида", СтруктураКИ);
		
		ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового", ПараметрыКИ, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
	//-- #1683 смарт: Фролов 14.03.2024	
	#КонецВставки
		
		ИницилизироватьДанныеКлиента();
		CRM_ЗаписатьВсеТипыОтношений();
		СформироватьТипОтношенийПредставление();
		
		ВидПартнераКомпания = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания");
		ВидПартнераЧастноеЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо");
		Клиент_Объект.ОсновнойМенеджер = Объект.Ответственный;
		Если ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
			ЗаполнитьКлиентаИзПотенциального();
		КонецЕсли;
		
		Элементы.ГруппаРеквизитыКлиента.Видимость = Истина;
		Элементы.ГруппаЗаписатьОтмена.Видимость = Истина;
		Элементы.ГруппаПотенциальныйКлиент.Видимость = Ложь;
		Элементы.ГруппаКонтактыИнтереса.Видимость = Ложь;
		
		#Вставка
		//++ #1615 смарт: Мосолов 25.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
		Элементы.смартНеобходимыеРеквизитыГруппа.Видимость = Истина; 
		Элементы.Клиент_ОбъектЮрФизЛицо.Видимость = Ложь; 
		//-- #1615 смарт: Мосолов 25.01.2024
		#КонецВставки
		
		Клиент_ОбъектЮрФизЛицоПриИзменении(Неопределено);
		
	#Вставка
	//++ #1683 смарт: Фролов 14.03.2024 //Быстрое создание Партнера из Интереса.
	КонецЕсли;
	//-- #1683 смарт: Фролов 14.03.2024
	#КонецВставки
	
КонецПроцедуры  //-- #1615 смарт: Мосолов 25.01.2024

//++ #1683 смарт: Фролов 14.03.2024 //Быстрое создание Партнера из Интереса.
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаОповещения")
Процедура смарт_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ЛентаСобытий_Обновить" Тогда

		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "НовоеКонтактноеЛицоЗаписано" Тогда
		Если CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр, "Владелец") = Объект.Партнер Тогда
			Объект.КонтактноеЛицо = Параметр;
			НастроитьОбластьВвода();
			КонтактноеЛицоПриИзменении();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "КонтактноеЛицоЗаписано" Тогда
		Если CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр, "Владелец") = Объект.Партнер Тогда
			КонтактноеЛицоПриИзменении();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "НовыйПотенциальныйКлиентЗаписан" И Параметр = Объект.ПотенциальныйКлиент Тогда

		ПотенциальныйКлиентПриИзмененииНаСервере();

	ИначеЕсли ИмяСобытия = "ЗаписьПартнера" И Параметр = Объект.Партнер Тогда

		ПартнерПриИзмененииНаСервере();
		
	#Вставка	
	//++ #1683 смарт: Фролов 14.03.2024 //Быстрое создание Партнера из Интереса.	
	ИначеЕсли ИмяСобытия = "ОповещениеОНовомПартнереЛиду" ТОгда
		
		Если Источник.ВладелецФормы = ЭтаФорма Тогда
			
			Если Параметр.СозданиеВыполнено	ТОгда
				
				Объект.Партнер = Параметр.ПартнерВыбор;
				Объект.КонтактноеЛицо = Параметр.КонтактноеЛицо;
				Модифицированность = Истина;
				Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
				Элементы.СоздатьНовогоКлиента.Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
	//-- #1683 смарт: Фролов 14.03.2024	
	#КонецВставки
	
	ИначеЕсли ИмяСобытия = "Создан новый партнер" Тогда

		Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
			Попытка
				бФормаОткрытаИзФормыЭтогоСобытия = (Источник.ВладелецФормы = ЭтотОбъект ИЛИ Источник.ВладелецФормы.ВладелецФормы = ЭтотОбъект);
			Исключение
				бФормаОткрытаИзФормыЭтогоСобытия = Ложь;
			КонецПопытки;
		Иначе
			бФормаОткрытаИзФормыЭтогоСобытия = Ложь;
		КонецЕсли;
		Если бФормаОткрытаИзФормыЭтогоСобытия Тогда
			Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Партнеры") Тогда
				Объект.Партнер = Параметр;
				ПартнерПриИзменении(Неопределено);
			ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				Объект.Партнер = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр, "Владелец");
				ПартнерПриИзменении(Неопределено);
				Объект.КонтактноеЛицо	= Параметр;
				КонтактноеЛицоПриИзменении();
			КонецЕсли;
			НастроитьОбластьВвода();
			ДоступностьПотенциальногоКлиента();
			Модифицированность = Истина;
			Записать();
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ЗаписатьИнтерес" Тогда
		Если Параметр = ЭтотОбъект.УникальныйИдентификатор Тогда
			Записать();
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ИзмененОтветственныйПоИнтересу" И Источник = ЭтотОбъект Тогда
		ОтветственныйПриИзменении(Элементы.Ответственный);
	ИначеЕсли ИмяСобытия = "ОбновленыДанныеСобытия" 
		И (СтрНайти(Источник.ИмяФормы, "CRM_БизнесПроцесс") > 0 ИЛИ СтрНайти(Источник.ИмяФормы, "ЗадачаИсполнителя") > 0) Тогда
		ЗаполнитьДеревоПроцессов();
	ИначеЕсли ИмяСобытия = "СтартованНовыйНезависимыйБП" И Объект.Ссылка = Параметр Тогда
		ЗаполнитьДеревоПроцессов();
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ИзменениеСпискаПрисоединенныхФайлов" И Объект.Ссылка = Параметр Тогда
		СформироватьПредставлениеВложений();
	ИначеЕсли ИмяСобытия = "Запись_Файл" И (ТипЗнч(Источник) = Тип("СправочникСсылка.CRM_ИнтересПрисоединенныеФайлы")
		ИЛИ ТипЗнч(Источник) = Тип("Массив") И Источник.Количество() > 0  И ТипЗнч(Источник[0]) = Тип("СправочникСсылка.CRM_ИнтересПрисоединенныеФайлы")) Тогда
		СформироватьПредставлениеВложений();
		// +Софтфон
	ИначеЕсли (ИмяСобытия = "СозданКонтактДляИнтереса") И Параметр.Свойство("сфпИнтерес") И Параметр.сфпИнтерес = Строка(ЭтотОбъект.УникальныйИдентификатор) Тогда
		Если Параметр.Свойство("Контакт") Тогда
			Если ТипЗнч(Параметр.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				Объект.Партнер = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр.Контакт, "Владелец");
				ПартнерПриИзменении(Неопределено);
				Объект.КонтактноеЛицо	= Параметр.Контакт;
				КонтактноеЛицоПриИзменении();
			ИначеЕсли ТипЗнч(Параметр.Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
				Объект.Партнер			= Параметр.Контакт;
				ПартнерПриИзменении(Неопределено);
			ИначеЕсли ТипЗнч(Параметр.Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
				Объект.ПотенциальныйКлиент = Параметр.Контакт;
				ДоступностьПотенциальногоКлиента();
				Элементы.ФормасфпСоздатьКонтакт.Видимость = Ложь;
			КонецЕсли;
			Модифицированность = Истина;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СофтФон_КонецРазговора" ИЛИ ИмяСобытия = "сфпКонецРазговора" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);	
	ИначеЕсли ИмяСобытия = "ОбновитьПланировщик" Тогда

		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);

		// -Софтфон
	ИначеЕсли (ИмяСобытия = "Запись_ЗадачаИсполнителя" ИЛИ ИмяСобытия = "СохраненаЛичнаяЗадача" ИЛИ ИмяСобытия = "СохраненоПоручение" ИЛИ ИмяСобытия = "ЗадачаВыполнена") Тогда

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ЗадачаИсполнителя") 
			И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("СсылкаНаОбъект") И (Параметр.СсылкаНаОбъект = ЭтотОбъект["ЗадачаИсполнителя"]) Тогда
			ТекущаяЗадача = ЭтотОбъект["ЗадачаИсполнителя"];
			#Если ВебКлиент Тогда
				ЗаполнитьПанельСостоянийИнтереса(, Истина);
			#Иначе	
				ЗаполнитьПанельСостоянийИнтереса();
			#КонецЕсли
		КонецЕсли;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
		ЗаполнитьДеревоПроцессов();

	ИначеЕсли ИмяСобытия = "Запись_ЗаказКлиента" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ОбновитьСостояниеВзаиморасчетов" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеВзаиморасчетов", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ПереопределяемаяКоманда_ЗадачаИсполнителя_Перенаправить" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ПереопределяемаяКоманда_ЗадачаИсполнителя_ПринятаКИсполнению" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ЗаписанаСвязьМеждуПартнерами" И (Параметр=Неопределено ИЛИ Параметр.Интерес = Объект.Ссылка) Тогда
		ПодключитьОбработчикОжидания("ОбновитьЗаголовокСвязиМеждуПартнерами", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ОбновитьОблакоТегов" И (ЭтотОбъект = Параметр) Тогда
		ОбновитьОблакоТегов();
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		Если МодульУправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбновитьЭлементыДополнительныхРеквизитов();
		КонецЕсли;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ОбработкаОповещения(ЭтотОбъект, Неопределено, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры //-- #1683 смарт: Фролов 14.03.2024

&НаСервере
&ИзменениеИКонтроль("ОтветственныйПриИзмененииНаСервере")
//++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
Процедура смарт_ОтветственныйПриИзмененииНаСервере()

	#Вставка //++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
	Если НЕ смартПроверитьОтветственногоНаРаботуСCRM(Объект.Ответственный) Тогда
		
		Объект.Ответственный = Неопределено;
		ОбщегоНазначения.СообщитьПользователю("Данный пользователь не работает в CRM! Выберите другого");
		Возврат;
		
	Иначе	
		
		Объект.Подразделение = CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(Объект.Ответственный, "Подразделение");
		Объект.Офис	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Подразделение, "CRM_офис");
		ПодразделениеПриИзмененииСервере();
	
	КонецЕсли;	
	#КонецВставки
	
	#Удаление //++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
	Объект.Подразделение = CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(Объект.Ответственный, "Подразделение");
	Объект.Офис	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Подразделение, "CRM_офис");
	ПодразделениеПриИзмененииСервере();
	#КонецУдаления

КонецПроцедуры //-- #1854 смарт: Фролов 13.06.2024

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
//++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
Процедура смарт_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Если выбрали ответственного в форме выбора по типу услуги
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") 
		И (ИсточникВыбора.ИмяФормы = "ОбщаяФорма.CRM_ПодборПользователейПоТипуУслуги" ИЛИ ИсточникВыбора.ИмяФормы = "Справочник.РолиИсполнителей.Форма.ФормаВыбора") Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) 
			И (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.РолиИсполнителей")) Тогда
			Если ВыбранноеЗначение <> Объект.Ответственный Тогда
				
				#Удаление //++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
				ИзменитьОтветственногоНаСервере(ВыбранноеЗначение);
				Модифицированность = Истина;
				Записать();
				Закрыть();
				#КонецУдаления

				#Вставка //++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
				Если НЕ смартПроверитьОтветственногоНаРаботуСCRM(ВыбранноеЗначение) Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю("Данный пользователь не работает в CRM! Выберите другого");
					Возврат;
					
				Иначе
					
					ИзменитьОтветственногоНаСервере(ВыбранноеЗначение);
					Модифицированность = Истина;
					Записать();
					Закрыть();
					
				КонецЕсли;	
				#КонецВставки
				
			КонецЕсли;
		КонецЕсли;

		// +CRM_Модуль
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда

		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		ОбновитьЗаголовокГруппыТовары();

		// -CRM_Модуль

	КонецЕсли;
	
КонецПроцедуры //-- #1854 смарт: Фролов 13.06.2024

&НаСервере
&ИзменениеИКонтроль("НастроитьОбластьВводаПоСтранице")
//++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
Процедура смарт_НастроитьОбластьВводаПоСтранице(Знач ПолныйСброс)

	//Общее
	ТекущаяДата = ТекущаяДатаСеанса();
	БыстрыйВвод_ДатаНачала = ТекущаяДата;
	Если ПолныйСброс Тогда
		// При создании или отмене создания объекта.
		БыстрыйВвод_Тема = "";
		БыстрыйВвод_Содержание = "";
		Если БыстрыйВвод_Вложения.Количество() > 0 Тогда
			БыстрыйВвод_Вложения.Очистить();
			CRM_ЛентаСобытий.ОбновитьЭлементыВложений(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

	Если БыстрыйВвод_ТекущийТипОбъекта = "Примечание" Тогда

		ТемаЗаполнена = ЗначениеЗаполнено(БыстрыйВвод_Тема);
		ВысотаТемы = ?(ТемаЗаполнена, 3, 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_ПримечаниеТема", "Высота", ВысотаТемы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_КомандыПримечание", "Видимость", ТемаЗаполнена);

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Взаимодействие" Тогда

		БыстрыйВвод_Тема = СокрЛП(СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " "));

		ДанныеВидаВзаимодействия = CRM_ЛентаСобытий.ДанныеВидаВзаимодействияПоУмолчанию("ЛентаИнтереса", Объект.СостояниеИнтереса);
		БыстрыйВвод_ВзаимодействиеВид = ДанныеВидаВзаимодействия.Ссылка;
		Если БыстрыйВвод_Тема = "" Тогда
			БыстрыйВвод_Тема = ДанныеВидаВзаимодействия.Описание;
		КонецЕсли;
		
		#Вставка
		//++ #Б-2136 смарт: Фролов 11.02.2025 //Планирование взаимодействий на весь день
		БыстрыйВвод_ВзаимодействиеНаВесьДень = Истина;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Время.Видимость = Ложь;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаОкончания_Время.Видимость = Ложь;
		
		ПараметрыДня = CRM_ЛентаСобытий.ПараметрыРабочегоДня(ТекущийПользователь);
		БыстрыйВвод_ДатаНачала = НачалоДня(БыстрыйВвод_ДатаНачала) + (ПараметрыДня.ВремяНачала - Дата('00010101'));
		БыстрыйВвод_ДатаОкончания = НачалоДня(БыстрыйВвод_ДатаНачала) + (ПараметрыДня.ВремяОкончания - Дата('00010101'));
		//-- #Б-2136 смарт: Фролов 11.02.2025
		#КонецВставки
		
		#Удаление //++ #Б-2136 смарт: Фролов 11.02.2025 //Планирование взаимодействий на весь день
		БыстрыйВвод_ВзаимодействиеНаВесьДень = Ложь;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Время.Видимость = Истина;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаОкончания_Время.Видимость = Истина;
		БыстрыйВвод_ДатаНачала = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(БыстрыйВвод_ДатаНачала, 30);

		БыстрыйВвод_ДатаОкончания = БыстрыйВвод_ДатаНачала + 1800;

		Если ЗначениеЗаполнено(БыстрыйВвод_ВзаимодействиеВид.ДлительностьВстречиПоУмолчанию) Тогда
			ПлановаяДатаЗавершенияТМП = БыстрыйВвод_ДатаНачала + БыстрыйВвод_ВзаимодействиеВид.ДлительностьВстречиПоУмолчанию*60;
			Если БыстрыйВвод_ДатаОкончания < ПлановаяДатаЗавершенияТМП Тогда
				БыстрыйВвод_ДатаОкончания = ПлановаяДатаЗавершенияТМП;
			КонецЕсли;	
		КонецЕсли;
		#КонецУдаления

		БыстрыйВвод_ВзаимодействиеОтправитель = ТекущийПользователь;
		БыстрыйВвод_ВзаимодействиеПолучатель = Объект.КонтактноеЛицо;
		БыстрыйВвод_ВзаимодействиеПартнер = Объект.Партнер;

		Элементы.БыстрыйВвод_ВзаимодействиеПолучатель.Видимость = CRM_ЛентаСобытий.ЭтоПартнерСКонтактами(Объект.Партнер);
		#Вставка
		//++ #Б-1698 смарт: Фролов 05.02.2025 //Вид встречи по умолчанию при планировании взаимодействия.
		Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.Настройки.ТелефонныйЗвонокВИнтересе) Тогда
			БыстрыйВвод_ВзаимодействиеВид = Справочники.смартПредопределенныеЗначения.Настройки.ТелефонныйЗвонокВИнтересе;
			БыстрыйВвод_Тема = "Телефонный звонок клиенту";
		КонецЕсли;	
		//-- #Б-1698 смарт: Фролов 05.02.2025
		#КонецВставки

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Задача" Тогда

		БыстрыйВвод_Тема = СокрЛП(СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " "));

		БыстрыйВвод_ЗадачаВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДень;
		БыстрыйВвод_ДатаОкончания = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(ТекущаяДата, 30) + 86400;
		
		#Удаление //++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
		БыстрыйВвод_ЗадачаПолучатель = ТекущийПользователь;
		#КонецУдаления
		
		#Вставка
		//++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
		Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
			БыстрыйВвод_ЗадачаПолучатель = Объект.Ответственный;
		Иначе
			БыстрыйВвод_ЗадачаПолучатель = ТекущийПользователь;	
		КонецЕсли;
		//-- #1915 смарт: Фролов 15.07.2024
		#КонецВставки
		
		#Вставка 
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		Если Элементы.Найти("смартВидЗадачи") = Неопределено Тогда
			НовыйЭлемент = Элементы.Вставить("смартВидЗадачи", Тип("ПолеФормы"), Элементы.БыстрыйВвод_СтраницаЗадача, Элементы.БыстрыйВвод_ЗадачаПолучатель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Вид задачи";
			НовыйЭлемент.Видимость = Истина;
			НовыйЭлемент.ПутьКДанным = "БыстрыйВвод_ЗадачаСмартВидЗадачи";
		КонецЕсли;
		//-- #1929 смарт: Фролов 23.07.2024
		#КонецВставки

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Письмо" Тогда

		БыстрыйВвод_Тема = СокрЛП(СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " "));

		БыстрыйВвод_ПисьмоПолучатели.Очистить();
		БыстрыйВвод_ПисьмоПолучателиКопий.Очистить();
		БыстрыйВвод_ПисьмоПолучателиСкрытыхКопий.Очистить();
		БыстрыйВвод_ПисьмоСписокПолучателейПисьма = "";
		БыстрыйВвод_ПисьмоСписокПолучателейКопий = "";
		БыстрыйВвод_ПисьмоСписокПолучателейСкрытыхКопий = "";

		УчетныеЗаписиПочтыСписокВыбора = Элементы.БыстрыйВвод_ПисьмоОтправительПредставление.СписокВыбора;
		УчетныеЗаписиПочтыСписокВыбора.Очистить();
		CRM_УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписиДляОтправки(УчетныеЗаписиПочтыСписокВыбора,, ТекущийПользователь);
		Если УчетныеЗаписиПочтыСписокВыбора.Количество() > 0 Тогда
			УчетнаяЗаписьПоУмолчанию = CRM_ЛентаСобытий.УчетнаяЗаписьПоУмолчанию(ТекущийПользователь);
			ЭлементСписка = УчетныеЗаписиПочтыСписокВыбора.НайтиПоЗначению(УчетнаяЗаписьПоУмолчанию);
			Если ЭлементСписка = Неопределено Тогда
				ЭлементСписка = УчетныеЗаписиПочтыСписокВыбора[0];
			КонецЕсли;
			БыстрыйВвод_ПисьмоУчетнаяЗапись = ЭлементСписка.Значение;
			БыстрыйВвод_ПисьмоОтправительПредставление = ЭлементСписка.Представление;
		КонецЕсли;

		ВладельцыКонтактнойИнформации = Новый Массив;
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			ВладельцыКонтактнойИнформации.Добавить(Объект.Партнер);
			КонтактыПартнера = CRM_ЛентаСобытий.КонтактыПартнера(Объект.Партнер);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВладельцыКонтактнойИнформации, КонтактыПартнера);
		Иначе
			ВладельцыКонтактнойИнформации.Добавить(Объект.ПотенциальныйКлиент);
		КонецЕсли;

		ДанныеКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ВладельцыКонтактнойИнформации, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		БыстрыйВвод_ПисьмоИсторияАдресов.Очистить();
		Для Каждого Строка Из ДанныеКонтактнойИнформации Цикл
			ПредставлениеАдресаКонтакта = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Строка.Объект, Строка.Представление, "");
			БыстрыйВвод_ПисьмоИсторияАдресов.Добавить(ПредставлениеАдресаКонтакта);
		КонецЦикла;

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Файл" Тогда

		ЕстьВложения = (БыстрыйВвод_Вложения.Количество() > 0);
		ВысотаТемы = ?(ЗначениеЗаполнено(БыстрыйВвод_Тема), 3, 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_ФайлОписание", "Высота", ВысотаТемы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_КомандыФайл", "Видимость", ЕстьВложения);

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Чат" Тогда

		// +Рарус alexpr
		//// Если смогли переключиться на эту страницу - значит, получатели есть.
		//ПервыйПолучатель = БыстрыйВвод_ЧатПолучатели[0];
		//БыстрыйВвод_ЧатИдентификаторПолучателя = ПервыйПолучатель.Идентификатор;
		//БыстрыйВвод_ЧатАдрес = ПервыйПолучатель.Адрес;
		//БыстрыйВвод_ЧатПолучатель = ПервыйПолучатель.Контакт;
		//БыстрыйВвод_ЧатПредставлениеПолучателя = ПервыйПолучатель.Представление;
		//БыстрыйВвод_ЧатУчетнаяЗапись = ПервыйПолучатель.УчетнаяЗапись;
		//БыстрыйВвод_ЧатГруппа = ПервыйПолучатель.Группа;
		Если БыстрыйВвод_ЧатПолучатели.Количество() > 0 Тогда
			ПервыйПолучатель = БыстрыйВвод_ЧатПолучатели[0];
			БыстрыйВвод_ЧатИдентификаторПолучателя = ПервыйПолучатель.Идентификатор;
			БыстрыйВвод_ЧатАдрес = ПервыйПолучатель.Адрес;
			БыстрыйВвод_ЧатПолучатель = ПервыйПолучатель.Контакт;
			БыстрыйВвод_ЧатПредставлениеПолучателя = ПервыйПолучатель.Представление;
			// учетная запись есть в списке доступных пользователю
			Если БыстрыйВвод_ЧатУчетныеЗаписи.НайтиСтроки(Новый Структура("УчетнаяЗапись",
				ПервыйПолучатель.УчетнаяЗапись)).Количество() > 0 Тогда
				БыстрыйВвод_ЧатУчетнаяЗапись = ПервыйПолучатель.УчетнаяЗапись;
				БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи = ПервыйПолучатель.УчетнаяЗапись;
			КонецЕсли;
			БыстрыйВвод_ЧатГруппа = ПервыйПолучатель.Группа;
			БыстрыйВвод_ЧатЭтоНомерТелефона = ПервыйПолучатель.ЭтоНомерТелефона;
			БыстрыйВвод_ЧатВидКИ = ПервыйПолучатель.ВидКИ;
		КонецЕсли;
		// -Рарус alexpr

	КонецЕсли;

КонецПроцедуры //-- #1915 смарт: Фролов 15.07.2024

&НаКлиенте
&ИзменениеИКонтроль("УстановитьДоступностьИнтереса")
Процедура смарт_УстановитьДоступностьИнтереса()

	Если Объект.Автор = ТекущийПользователь Тогда
		ЕстьДоступУровняАккаунтМенеджера			= Истина;
	ИначеЕсли Объект.Ответственный = ТекущийПользователь Тогда
		ЕстьДоступУровняАккаунтМенеджера			= Истина;
		
	#Вставка
	//++ #1934 смарт: Фролов 18.07.2024 //Организовать доступ РОПов к Интересам своих менеджеров
	ИначеЕсли смартПользователи.РольДоступнаПользователю("смартРуководительCRM") Тогда
		ЕстьДоступУровняАккаунтМенеджера			= Истина;
	//-- #1934 смарт: Фролов 18.07.2024
	#КонецВставки
	
	ИначеЕсли CRM_БизнесПроцессыСервер.ПользовательУчастникРоли(ТекущийПользователь, Объект.Ответственный) Тогда
		ЕстьДоступУровняАккаунтМенеджера			= Истина;
	ИначеЕсли ЗначениеЗаполнено(Объект.Партнер) Тогда
		ЕстьДоступУровняАккаунтМенеджера			= CRM_УправлениеДоступомВызовСервера.ЕстьДоступУровняАккаунтМенеджера(Объект.Партнер);
	Иначе
		ЕстьДоступУровняАккаунтМенеджера			= Истина;
	КонецЕсли;
	Элементы.ГруппаРеквизиты.ТолькоПросмотр	= НЕ ЕстьДоступУровняАккаунтМенеджера;
	Элементы.ГруппаТовары.Доступность = ЕстьДоступУровняАккаунтМенеджера;

	Если УстановитьТолькоПросмотр Тогда
		Элементы.ГруппаПанельСостояний.Доступность	= Ложь;
	Иначе	
		Элементы.ГруппаПанельСостояний.Доступность	= ЕстьДоступУровняАккаунтМенеджера И (НЕ ЗначениеЗаполнено(ТекущаяЗадача) ИЛИ НЕ Объект.Завершен);
	КонецЕсли;	

	Для Каждого ПодчиненныйЭлемент Из КоманднаяПанель.ПодчиненныеЭлементы Цикл
		ПодчиненныйЭлемент.Видимость = ЕстьДоступУровняАккаунтМенеджера;
	КонецЦикла;
	Элементы.Перенаправить.Доступность	= ЕстьДоступУровняАккаунтМенеджера;
	Элементы.ПеренаправитьНаРоль.Доступность	= ЕстьДоступУровняАккаунтМенеджера;

	#Вставка
	//++ #Б2454 смарт: Шляпников 07.03.2025 / Заблокировать область в документе Интерес
	Если Объект.смартИтоговаяКвалификация = ПредопределенноеЗначение("Справочник.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте") Тогда
		Элементы.ГруппаПанельСостояний.Доступность	= Ложь;
	КонецЕсли;
	//-- #Б2454 смарт: Шляпников 07.03.2025
	#КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПроверитьЗапланированныеАктивности")
//++ #1943 смарт: Фролов 22.07.2024 //Не проверять наличие запланированных задач/взаимодействий
Функция смарт_ПроверитьЗапланированныеАктивности()
	
	#Вставка
	//++ #1943 смарт: Фролов 22.07.2024 //Не проверять наличие запланированных задач/взаимодействий
	Если НЕ Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь Тогда
		
		Возврат Истина;
		
	КонецЕсли;	
	//-- #1943 смарт: Фролов 22.07.2024
	#КонецВставки
	
	Если Объект.ВерсияДанных < Объект.Ссылка.ВерсияДанных Тогда
		ПроверяемоеСостояние = Объект.Ссылка.СостояниеИнтереса;
	Иначе
		ПроверяемоеСостояние = Объект.СостояниеИнтереса;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПроверяемоеСостояние.ОбязательноеПланированиеАктивности) Тогда
		Если ПроверяемоеСостояние.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИЗадача Тогда
			Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Объект.Ссылка, Перечисления.CRM_ТипыАктивности.Взаимодействие); 
			РезультатПроверки = Истина;
			Если Результат = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет запланированных взаимодействий. Перед закрытием необходимо запланировать взаимодействие!'"));
				РезультатПроверки = Ложь;
			КонецЕсли;
			Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Объект.Ссылка, Перечисления.CRM_ТипыАктивности.Задача); 
			Если Результат = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет запланированных задач. Перед закрытием необходимо запланировать задачу!'"));
				РезультатПроверки = Ложь;
			КонецЕсли;
			Возврат РезультатПроверки;
		ИначеЕсли ПроверяемоеСостояние.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.Взаимодействие Тогда
			ТипАктивности = Перечисления.CRM_ТипыАктивности.Взаимодействие;
			ТекстСообщения = НСтр("ru='Нет запланированных взаимодействий. Перед закрытием необходимо запланировать взаимодействие!'")
		ИначеЕсли ПроверяемоеСостояние.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.Задача Тогда
			ТипАктивности = Перечисления.CRM_ТипыАктивности.Задача;
			ТекстСообщения = НСтр("ru='Нет запланированных задач. Перед закрытием необходимо запланировать задачу!'")
		Иначе 
			ТипАктивности = Неопределено;
			ТекстСообщения = НСтр("ru='Нет запланированных задач или взаимодействий. Перед закрытием необходимо запланировать задачу или взаимодействие!'")
		КонецЕсли;
		Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Объект.Ссылка, ТипАктивности); 
		Если Результат = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции //-- #1943 смарт: Фролов 22.07.2024

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПанельСостоянийИнтереса")
Процедура смарт_ЗаполнитьПанельСостоянийИнтереса(Этап, ВебКлиент)

	Если ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		ОбновитьВероятностьСделки();
		Возврат;
	КонецЕсли;

	Если НЕ ВебКлиент И (КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2) Тогда
		ВебКлиент = Истина;
	КонецЕсли;
	КоличествоЭлементов = Элементы.ГруппаПанельСостояний.ПодчиненныеЭлементы.Количество();
	Для НомерЭлемента = 1 По КоличествоЭлементов Цикл
		ЭлементПанели = Элементы.ГруппаПанельСостояний.ПодчиненныеЭлементы[КоличествоЭлементов - НомерЭлемента];
		Если ЭлементПанели.Имя = "СостоянияПредыдущие" Тогда
			ЭлементПанели.Заголовок	= "Предыдущие";
			ЭлементПанели.Шрифт		= Новый Шрифт();
			ЭлементПанели.Ширина	= ПолучитьШиринуЭлемента(ЭлементПанели.Заголовок,, ВебКлиент);
			Продолжить;
		КонецЕсли;
		Если ЭлементПанели.Имя = "СтрелкаСледующие" Тогда
			ЭлементПанели.Видимость	= Истина;
			Продолжить;
		КонецЕсли;
		Если ЭлементПанели.Имя = "СостоянияСледующие" Тогда
			ЭлементПанели.Видимость	= Истина;
			Продолжить;
		КонецЕсли;
		Если ЭлементПанели.Имя = "СтрелкаЗавершение" Тогда Продолжить; КонецЕсли;
		Если ЭлементПанели.Имя = "СостоянияЗавершение" Тогда
			ЭлементПанели.Заголовок	= "Завершение";
			ЭлементПанели.Шрифт		= Новый Шрифт();
			ЭлементПанели.Ширина	= ПолучитьШиринуЭлемента(ЭлементПанели.Заголовок,, ВебКлиент);
			ЭлементПанели.Видимость	= Истина;
			Продолжить;
		КонецЕсли;
		Элементы.Удалить(ЭлементПанели);
	КонецЦикла;

	СостоянияЗавершение_Команды.Очистить();
	СостоянияПредыдущие_Команды.Очистить();
	СостоянияСледующие_Команды.Очистить();

	Если Объект.Завершен Тогда
		Если Объект.СостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
			Элементы.ГруппаПанельСостояний.ЦветФона = Новый Цвет(220, 250, 220);
		Иначе
			Элементы.ГруппаПанельСостояний.ЦветФона = Новый Цвет(250, 220, 220);
		КонецЕсли;
	Иначе
		Элементы.ГруппаПанельСостояний.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
	КонецЕсли;

	ЦветТекущегоСостояния = ЦветаСтиля.ЦветТекстаФормы;
	СтруктураДоступныхСостоянийИнтереса	= Новый Структура;
	ИндексТекущего	= -1;
	СписокСостояний	= ПолучитьСписокСостоянийСервер(Объект.СостояниеИнтереса);
	Для Каждого Состояние Из СписокСостояний Цикл
		Индекс = СписокСостояний.Индекс(Состояние);
		ТекСостояние	= Состояние.Значение;
		ИмяКомандыСостояния	= "СостояниеИнтереса" + СтрЗаменить(Строка(ТекСостояние.УникальныйИдентификатор()), "-", "");
		Если Команды.Найти(ИмяКомандыСостояния) = Неопределено Тогда
			НоваяКоманда	= Команды.Добавить(ИмяКомандыСостояния);
			НоваяКоманда.Действие	= "ПанельСостоянийИнтересаВыбор";
			НоваяКоманда.Подсказка	= Состояние.Представление;
		КонецЕсли;
		СтруктураДоступныхСостоянийИнтереса.Вставить(ИмяКомандыСостояния, Состояние.Значение);
		Если ТекСостояние.Завершено Тогда
			Если ТекСостояние = Объект.СостояниеИнтереса Тогда
				Элементы.СостоянияЗавершение.Заголовок	= Состояние.Представление;
				Элементы.СостоянияЗавершение.Шрифт		= Новый Шрифт(,, Истина);
				Элементы.СостоянияЗавершение.Ширина		= ПолучитьШиринуЭлемента(Элементы.СостоянияЗавершение.Заголовок, Истина, ВебКлиент);
				КартинкаЗавершение		= Элементы.Вставить("КартинкаСостоянияЗавершение", Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, Элементы.СостоянияЗавершение);
				КартинкаЗавершение.Вид	= ВидДекорацииФормы.Картинка;
				КартинкаЗавершение.Заголовок	= "Картинка";
				КартинкаЗавершение.РастягиватьПоГоризонтали	= Ложь;
				КартинкаЗавершение.РастягиватьПоВертикали		= Ложь;
				КартинкаЗавершение.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
				КартинкаЗавершение.Ширина	= 2;
				КартинкаЗавершение.Высота	= 1;
				Если ТекСостояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
					Элементы.СостоянияЗавершение.ЦветТекста	= Новый Цвет(50, 150, 50);
					КартинкаЗавершение.Картинка	= БиблиотекаКартинок.CRM_УспешноеЗавершение;
				ИначеЕсли ТекСостояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
					Элементы.СостоянияЗавершение.ЦветТекста	= WebЦвета.Лосось;
					КартинкаЗавершение.Картинка	= БиблиотекаКартинок.CRM_НеудачноеЗавершение;
				КонецЕсли;
			Иначе
				СостоянияЗавершение_Команды.Добавить(ИмяКомандыСостояния, Состояние.Представление,, Состояние.Картинка); 
			КонецЕсли;
		ИначеЕсли ТекСостояние = Объект.СостояниеИнтереса Тогда
			ИндексТекущего = Индекс;
			Элементы.СостоянияПредыдущие.Заголовок	= Состояние.Представление;
			Элементы.СостоянияПредыдущие.Шрифт		= Новый Шрифт(,, Истина);
			Элементы.СостоянияПредыдущие.Ширина		= ПолучитьШиринуЭлемента(Элементы.СостоянияПредыдущие.Заголовок, Истина, ВебКлиент);
			ЦветТекущегоСостояния = ЦветТекущегоСостоянияИнтереса();
			Элементы.СостоянияПредыдущие.ЦветТекста	= ЦветТекущегоСостояния;
			КартинкаПредыдущие = Элементы.Найти("КартинкаПредыдущие");
			Если КартинкаПредыдущие = Неопределено Тогда
				КартинкаПредыдущие		= Элементы.Вставить("КартинкаПредыдущие", Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, Элементы.СостоянияПредыдущие);
				КартинкаПредыдущие.Вид	= ВидДекорацииФормы.Картинка;
				КартинкаПредыдущие.Заголовок	= "Картинка";
				КартинкаПредыдущие.РастягиватьПоГоризонтали	= Ложь;
				КартинкаПредыдущие.РастягиватьПоВертикали	= Ложь;
				КартинкаПредыдущие.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
				КартинкаПредыдущие.Ширина	= 2;
				КартинкаПредыдущие.Высота	= 1;
				КартинкаПредыдущие.Картинка = БиблиотекаКартинок.CRM_Выполнено;
			КонецЕсли;
		ИначеЕсли ИндексТекущего = -1 Тогда
			СостоянияПредыдущие_Команды.Вставить(0, ИмяКомандыСостояния, Состояние.Представление,, БиблиотекаКартинок.CRM_Выполнено); 
		Иначе
			СостоянияСледующие_Команды.Добавить(ИмяКомандыСостояния, Состояние.Представление,, Состояние.Картинка); 
		КонецЕсли;
	КонецЦикла;

	Если Объект.Завершен Тогда
		Элементы.СтрелкаСледующие.Видимость		= Ложь;	
		Элементы.СостоянияСледующие.Видимость	= Ложь;	
		Если СостоянияПредыдущие_Команды.Количество() > 0 Тогда
			Состояние	= СостоянияПредыдущие_Команды[0];
			ДекорацияПанели	= Элементы.Вставить(Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, Элементы.СтрелкаЗавершение);
			ДекорацияПанели.Заголовок	= Состояние.Представление;
			ДекорацияПанели.ЦветТекста	= ЦветаСтиля.CRM_ЧерныйЦветТекста;
			ДекорацияПанели.РастягиватьПоГоризонтали	= Ложь;
			ДекорацияПанели.РастягиватьПоВертикали		= Ложь;
			ДекорацияПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияПанели.Ширина		= ПолучитьШиринуЭлемента(ДекорацияПанели.Заголовок,, ВебКлиент);
			ДекорацияПанели.Гиперссылка	= Истина;
			ДекорацияПанели.УстановитьДействие("Нажатие", "Подключаемый_ОбработкаКомандыСостояния");
			КартинкаПанели		= Элементы.Вставить("Картинка" + Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, ДекорацияПанели);
			КартинкаПанели.Вид	= ВидДекорацииФормы.Картинка;
			КартинкаПанели.Заголовок	= "Картинка";
			КартинкаПанели.РастягиватьПоГоризонтали	= Ложь;
			КартинкаПанели.РастягиватьПоВертикали	= Ложь;
			КартинкаПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			КартинкаПанели.Ширина	= 2;
			КартинкаПанели.Высота	= 1;
			КартинкаПанели.Картинка	= БиблиотекаКартинок.CRM_Выполнено;
			СтрелкаПанели		= Элементы.Вставить("Стрелка" + Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, КартинкаПанели);
			СтрелкаПанели.Вид	= ВидДекорацииФормы.Картинка;
			СтрелкаПанели.Заголовок	= "Стрелка";
			СтрелкаПанели.РастягиватьПоГоризонтали	= Ложь;
			СтрелкаПанели.РастягиватьПоВертикали	= Ложь;
			СтрелкаПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			СтрелкаПанели.Картинка	= БиблиотекаКартинок.CRM_СтрелкаВправо;
			СтрелкаПанели.Ширина	= 2;
			СтрелкаПанели.Высота	= 1;
			СостоянияПредыдущие_Команды.Удалить(Состояние);
		КонецЕсли;
	Иначе
		Элементы.СостоянияЗавершение.Видимость = Ложь;
		Пока СостоянияЗавершение_Команды.Количество() > 0 Цикл
			Состояние = СостоянияЗавершение_Команды[0]; 
			ДекорацияПанели = Элементы.Добавить(Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний);
			ДекорацияПанели.Заголовок	= Состояние.Представление;
			ДекорацияПанели.ЦветТекста	= ЦветаСтиля.CRM_ЧерныйЦветТекста;
			ДекорацияПанели.РастягиватьПоГоризонтали	= Ложь;
			ДекорацияПанели.РастягиватьПоВертикали		= Ложь;
			ДекорацияПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияПанели.Ширина = ПолучитьШиринуЭлемента(Состояние.Представление,, ВебКлиент);
			ДекорацияПанели.Гиперссылка	= Истина;
			ДекорацияПанели.УстановитьДействие("Нажатие", "Подключаемый_ОбработкаКомандыСостояния");
			КартинкаПанели		= Элементы.Вставить("Картинка" + Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, ДекорацияПанели);
			КартинкаПанели.Вид	= ВидДекорацииФормы.Картинка;
			КартинкаПанели.Заголовок	= "Картинка";
			КартинкаПанели.РастягиватьПоГоризонтали	= Ложь;
			КартинкаПанели.РастягиватьПоВертикали	= Ложь;
			КартинкаПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			КартинкаПанели.Ширина	= 2;
			КартинкаПанели.Высота	= 1;
			КартинкаПанели.Картинка	= Состояние.Картинка;
			СостоянияЗавершение_Команды.Удалить(Состояние);
		КонецЦикла;
		ШиринаПанели	= 0;
		Для Каждого ЭлементПанели Из Элементы.ГруппаПанельСостояний.ПодчиненныеЭлементы Цикл
			Если ЭлементПанели.АвтоМаксимальнаяШирина Тогда 
				ШиринаПанели	= ШиринаПанели + ЭлементПанели.Ширина;
			Иначе
				ШиринаПанели	= ШиринаПанели + ЭлементПанели.МаксимальнаяШирина;
			КонецЕсли;	
		КонецЦикла;
		Пока СостоянияСледующие_Команды.Количество() > 0 Цикл
			Состояние		= СостоянияСледующие_Команды[0];
			ШиринаЭлемента	= ПолучитьШиринуЭлемента(Состояние.Представление,, ВебКлиент);
			Если (ШиринаПанели + ШиринаЭлемента + 2) > ШиринаСостояний Тогда
				Если СостоянияСледующие_Команды.Количество() = 1 Тогда
					Если (ШиринаПанели + ШиринаЭлемента + 2 - Элементы.СостоянияСледующие.Ширина) > ШиринаСостояний Тогда
						Прервать;
					КонецЕсли;
				Иначе
					Прервать;
				КонецЕсли;	
			КонецЕсли;
			КартинкаПанели		= Элементы.Вставить("Стрелка" + Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, Элементы.СтрелкаСледующие);
			КартинкаПанели.Вид	= ВидДекорацииФормы.Картинка;
			КартинкаПанели.Заголовок	= "Стрелка";
			КартинкаПанели.РастягиватьПоГоризонтали	= Ложь;
			КартинкаПанели.РастягиватьПоВертикали	= Ложь;
			КартинкаПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			КартинкаПанели.Картинка	= БиблиотекаКартинок.CRM_СтрелкаВправо;
			КартинкаПанели.Ширина	= 2;
			КартинкаПанели.Высота	= 1;
			ДекорацияПанели	= Элементы.Вставить(Состояние.Значение, Тип("ДекорацияФормы"), Элементы.ГруппаПанельСостояний, Элементы.СтрелкаСледующие);
			ДекорацияПанели.Заголовок	= Состояние.Представление;
			ДекорацияПанели.ЦветТекста	= ЦветаСтиля.CRM_ЧерныйЦветТекста;
			ДекорацияПанели.РастягиватьПоГоризонтали	= Ложь;
			ДекорацияПанели.РастягиватьПоВертикали		= Ложь;
			ДекорацияПанели.ВертикальноеПоложениеВГруппе	= ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияПанели.Ширина	= ШиринаЭлемента;
			ДекорацияПанели.Высота	= 1;
			ДекорацияПанели.Гиперссылка	= Истина;
			ДекорацияПанели.УстановитьДействие("Нажатие", "Подключаемый_ОбработкаКомандыСостояния");
			ШиринаПанели	= ШиринаПанели + ШиринаЭлемента + 2;
			СостоянияСледующие_Команды.Удалить(Состояние);
		КонецЦикла;
		Если СостоянияСледующие_Команды.Количество() = 0 Тогда
			Элементы.СтрелкаСледующие.Видимость		= Ложь;	
			Элементы.СостоянияСледующие.Видимость	= Ложь;	
		Иначе	
			Элементы.СтрелкаСледующие.Видимость		= Истина;	
			Элементы.СостоянияСледующие.Видимость	= Истина;	
		КонецЕсли;	
	КонецЕсли;

	Если УстановитьТолькоПросмотр Тогда
		Элементы.ГруппаПанельСостояний.Доступность	= Ложь;
	Иначе
		Элементы.ГруппаПанельСостояний.Доступность = ЕстьДоступУровняАккаунтМенеджера И НЕ(ЗначениеЗаполнено(ТекущаяЗадача) И Объект.Завершен);
	КонецЕсли;

	Если Объект.Завершен ИЛИ ЗначениеЗаполнено(ТекущаяЗадача) ИЛИ ЗначениеЗаполнено(СрокНаТекущемЭтапе) Тогда
		ГруппаКонецПанели = Элементы.Добавить("ГруппаКонецПанели", Тип("ГруппаФормы"), Элементы.ГруппаПанельСостояний);
		ГруппаКонецПанели.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКонецПанели.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		ГруппаКонецПанели.ОтображатьЗаголовок = Ложь;
		Если Объект.Завершен Тогда
			ЭлементДатаЗавершения = Элементы.Добавить("ЭлементДатаЗавершения", Тип("ДекорацияФормы"), Элементы.ГруппаКонецПанели);
			ЭлементДатаЗавершения.Вид = ВидДекорацииФормы.Надпись;
			ЭлементДатаЗавершения.Заголовок = Формат(Объект.ДатаЗакрытия, "ДФ=d.MM.yyyy");
		ИначеЕсли ЗначениеЗаполнено(СрокНаТекущемЭтапе) Тогда
			ЭлементСрокНаЭтапе = Элементы.Добавить("ЭлементСрокНаЭтапе", Тип("ДекорацияФормы"), Элементы.ГруппаКонецПанели);
			ЭлементСрокНаЭтапе.Вид = ВидДекорацииФормы.Надпись;
			ШаблонСрокаНаЭтапе = НСтр("ru = 'Срок на этапе: %1 дн.'");
			ЭлементСрокНаЭтапе.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСрокаНаЭтапе, Строка(СрокНаТекущемЭтапе));
			ЭлементСрокНаЭтапе.ЦветТекста = ЦветТекущегоСостояния;
		КонецЕсли;
	КонецЕсли;

	ОбновитьВероятностьСделки();

	Элементы.ГруппаПанельСостояний.Видимость = Истина;
	
	#Вставка
	//++ #Б2454 смарт: Шляпников 07.03.2025 / Заблокировать область в документе Интерес
	Если Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте Тогда
		Элементы.ГруппаПанельСостояний.Доступность	= Ложь;
	КонецЕсли;
	//-- #Б2454 смарт: Шляпников 07.03.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаКлиенте
Процедура extCRM_ДекорацияОценкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	CRM_ОбщегоНазначенияКлиент.ПоказатьНашеПредупреждение(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

&НаКлиенте
//++ #1607 смарт: Фролов 18.01.2024 //Ограничения в форме интереса на установку цен
Процедура смартПроверитьВидЦены()
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		ТекущаяСтрока.Цена=0;
		ТекущаяСтрока.Сумма=0;
		ТекущаяСтрока.СуммаНДС=0;
		ТекущаяСтрока.СуммаСНДС=0;
		Отказ=Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните вид цены",,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", ТекущаяСтрока.НомерСтроки, "ВидЦены"),,Отказ);
		Возврат;
	КонецЕсли;	
КонецПроцедуры	//-- #1607 смарт: Фролов 18.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
		
	Если СтрДлина(СокрЛП(Текст)) >= 3 Тогда
		
		ДанныеВыбора = смартПолучитьДанныеВыбораБизнесРегиона(Текст); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьДанныеВыбораБизнесРегиона(Текст) 
	
	Возврат Справочники.БизнесРегионы.смартПолучитьДанныеВыбораБизнесРегиона(Текст);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
		
		ВыбранноеЗначение = смартСоздатьБизнесРегион(ВыбранноеЗначение);  
		
	Иначе
		
		СтруктураВозврата = смартПолучитьУровеньКодСубьектаСправочника(ВыбранноеЗначение); 
		
		Если СтруктураВозврата.Уровень = 0 ИЛИ (СтруктураВозврата.Уровень = 1 И СтруктураВозврата.КодСубъекта <> 0) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для субъектов РФ необходимо выбрать населенный пункт'"));
			
			ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.БизнесРегионы.ПустаяСсылка");  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартСоздатьБизнесРегион(ВыбранноеЗначение) 
	
	Возврат Справочники.БизнесРегионы.смартСоздатьБизнесРегион(ВыбранноеЗначение);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьУровеньКодСубьектаСправочника(ЭлементСправочника) 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Уровень", ЭлементСправочника.Уровень());
	СтруктураВозврата.Вставить("КодСубъекта", ЭлементСправочника.СмартКодСубъектаРФ);
	
	Возврат СтруктураВозврата;

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
&НаСервере
&ИзменениеИКонтроль("ИницилизироватьДанныеКлиента")
Процедура смарт_ИницилизироватьДанныеКлиента()

	Клиент_Объект.CRM_СтатусРаботы = Справочники.CRM_СтатусыРаботыСКлиентом.Работаем;

	ВыбранныеТипы = Новый Массив;

	ОсновнойТипОтношенийСКлиентом = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойТипОтношенийСКлиентом");
	Если ЗначениеЗаполнено(ОсновнойТипОтношенийСКлиентом) Тогда
		ВыбранныеТипы.Добавить(ОсновнойТипОтношенийСКлиентом);
	Иначе
		ВыбранныеТипы.Добавить(Справочники.CRM_ТипыОтношений.Покупатель);
	КонецЕсли;

	Справочники.CRM_ТипыОтношений.ЗаполнитьСписокОтношений(CRM_ВсеТипыОтношений, ВыбранныеТипы);
	
	#Вставка
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
    Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания");
	//-- #1615 смарт: Мосолов 29.01.2024
	#КонецВставки

КонецПроцедуры //-- #1615 смарт: Мосолов 29.01.2024

//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
&НаСервере
&ИзменениеИКонтроль("ПроверитьЗаполнениеКлиентаКонтакта")
Функция смарт_ПроверитьЗаполнениеКлиентаКонтакта()

	Отказ = Ложь;

	ДополнительныеПоля = Новый Массив;

	Если (Элементы.ГруппаРеквизитыКлиента.Видимость ИЛИ Элементы.ГруппаРеквизитыКонтакта.Видимость) 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ПоискДублей_НайденыДубли") 
		И НЕ РольДоступна("ПолныеПрава") Тогда

		Если ЭтотОбъект["ПоискДублей_НайденыДублиКлиенты"] 
			И Константы.CRM_ЗапретитьВводНовогоКлиентаПриНайденныхСовпадениях.Получить() Тогда

			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Найдены дубли клиента!
			|Необходимо обратиться к администратору базы для предоставления прав доступа к имеющемуся контакту. '"),,,, Отказ);
		КонецЕсли;
		Если ЭтотОбъект["ПоискДублей_НайденыДублиКонтакты"] 
			И Константы.CRM_ЗапретитьВводНовогоКонтактаПриНайденныхСовпадениях.Получить() Тогда

			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Найдены дубли контактного лица!
			|Необходимо обратиться к администратору базы для предоставления прав доступа к имеющемуся контакту. '"),,,, Отказ);
		КонецЕсли;

	КонецЕсли;

	Если Элементы.ГруппаРеквизитыКлиента.Видимость Тогда
		Если НЕ ЗначениеЗаполнено(Клиент_Объект.Наименование) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено наименование клиента'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Клиент_Объект.Наименование",, Отказ);
		КонецЕсли;
		Если Клиент_Объект.ЮрФизЛицо <> Перечисления.КомпанияЧастноеЛицо.Компания Тогда
			ДополнительныеПоля.Добавить("Клиент_Телефон");
			ДополнительныеПоля.Добавить("Клиент_Email");
			Если Элементы.Клиент_МобТелефон.Видимость Тогда
				ДополнительныеПоля.Добавить("Клиент_МобТелефон");
			КонецЕсли;
		КонецЕсли;
		Если Метаданные.ОбщиеМодули.Найти("CRM_Модуль_РаботаСКонтрагентами") <> Неопределено Тогда
			CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСКонтрагентами");
			CRM_Модуль.ПроверитьЗаполнениеКонтрагента(ЭтотОбъект, Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Элементы.ГруппаРеквизитыКонтакта.Видимость Тогда
		Если НЕ CRM_РазрешитьСозданиеИнтересаБезКЛ Тогда

			ЮрЛицо = Истина;
			Если ЗначениеЗаполнено(Объект.Партнер) Тогда
				ЮрЛицо = (Объект.Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания);
			Иначе
				ЮрЛицо = (Клиент_Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(Контакт_Объект.Наименование) И ЮрЛицо Тогда
				ТекстСообщения = НСтр("ru='Не заполнено наименование контакта'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Контакт_Объект.Наименование",, Отказ);
			КонецЕсли;

			ПроверятьЗаполнениеКИ = ЗначениеЗаполнено(Контакт_Объект.Наименование)
			ИЛИ ЮрЛицо;

			Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("CRM_РазрешитьСохранениеКЛБезКИ")
				И ПроверятьЗаполнениеКИ Тогда
				ДополнительныеПоля.Добавить("Контакт_Email");
				ДополнительныеПоля.Добавить("Контакт_Телефон");
				Если Элементы.Контакт_МобТелефон.Видимость Тогда
					ДополнительныеПоля.Добавить("Контакт_МобТелефон");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	


	Если ДополнительныеПоля <> Неопределено Тогда

		НетЗаполненных = Истина;
		Для Каждого Поле Из ДополнительныеПоля Цикл
			Если ЗначениеЗаполнено(ЭтотОбъект[Элементы[Поле].ПутьКДанным]) Тогда
				НетЗаполненных = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НетЗаполненных Тогда
			Для Каждого Поле Из ДополнительныеПоля Цикл
				Если Элементы[Поле].Видимость Тогда
					ТекстСообщения = НСтр("ru='Не заполнена контактная информация';en='Contact information not filled'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Элементы[Поле].ПутьКДанным,, Отказ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	#Вставка 
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
	
	Если Элементы.ГруппаРеквизитыКлиента.Видимость Тогда
		
		Если Не ЗначениеЗаполнено(Клиент_Объект.ОсновнойМенеджер) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать основного менеджера партнера'"),, "Клиент_Объект.ОсновнойМенеджер");
			Отказ = Истина;
			
		КонецЕсли;
		
		//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		//Если Не ЗначениеЗаполнено(Клиент_Объект.смартМенеджерПоРасходнымМатериалам) Тогда
		//	
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать менеджера по расходным материалам'"),, "Клиент_Объект.смартМенеджерПоРасходнымМатериалам");
		//	Отказ = Истина;
		//	
		//КонецЕсли;
		//--#1615 смарт: Лопато 08.02.2024
		
		Если Не ЗначениеЗаполнено(Клиент_Объект.БизнесРегион) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать бизнес-регион'"),, "Клиент_Объект.БизнесРегион");
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	//-- #1615 смарт: Мосолов 29.01.2024
	#КонецВставки

	Возврат НЕ Отказ;

КонецФункции //-- #1615 смарт: Мосолов 29.01.2024

&НаКлиенте
//++ #1656 смарт: Фролов 28.02.2024 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.
Процедура смартОписаниеЭтапаНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("Сценарий", Объект.СостояниеИнтереса);
	ОткрытьФорму("Справочник.CRM_СостоянияИнтересов.Форма.смарт_ФормаОписаниеЭтапа", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- #1656 смарт: Фролов 28.02.2024

&НаКлиенте
//++ #1665 смарт: Фролов 04.03.2024 //1C:CRM Доработки 
Процедура смартПозвонить(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.смартТелефонЛид) Тогда
		
		сфпСофтФонПроКлиент.сфпПозвонить(ЭтаФорма.смартТелефонЛид);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Телефон не заполнен!");
		
	КонецЕсли;

КонецПроцедуры //-- #1665 смарт: Фролов 04.03.2024

&НаСервере
//++ #Б-1216 смарт: Фролов 28.10.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
Функция смартНайтиКонтактПоЭлПочтеИТелефону(СтруктураПоиска)
	
	Запрос = Новый Запрос;
	
	Если СтруктураПоиска.ОтобратьИмеющиесяНаСайте Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	(КонтактныеЛицаПартнеров.смартТелефонНаСайте = &НомерТелефона
		|			ИЛИ КонтактныеЛицаПартнеров.смартЭлектроннаяПочтаНаСайте = &АдресЭП)";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ НайденныеПоПочте
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец = &Владелец
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.АдресЭП = &АдресЭП
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.смартЛогинНаСайте = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец = &Владелец
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона = &НомерТелефона
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				НайденныеПоПочте.Ссылка
		|			ИЗ
		|				НайденныеПоПочте)
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.смартЛогинНаСайте = """"";
		Запрос.УстановитьПараметр("Владелец", Объект.Партнер);
	КонецЕсли;	
	Запрос.УстановитьПараметр("АдресЭП", СтруктураПоиска.НужнаяЭлектроннаяПочта);
	Запрос.УстановитьПараметр("НомерТелефона", СтруктураПоиска.НужныйТелефон);
	
	МассиКонтактныхЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассиКонтактныхЛиц;
	
КонецФункции //-- #Б-1216 смарт: Фролов 28.10.2024

&НаСервере
//++ #Б-1214 смарт: Фролов 24.10.2024 //Регистрация в ИМ. Лид-Интерес. Проверка взаимодействия перед подтверждением
Функция смартПроверитьНаличиеВыполненнойЗадачи()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя
	|ГДЕ
	|	Предмет = &Предмет
	|	И Выполнена
	|	И смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.СозвонитьсяСКлиентом)");
	Запрос.УстановитьПараметр("Предмет", Объект.Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции //-- #Б-1214 смарт: Фролов 24.10.2024	

&НаСервере
//++ #Б-1218 смарт: Фролов 28.10.2024 //Регистрация в ИМ. Лид-Интерес. Проверка наличия контрагента
Функция смартПолучитьМассивСвязанныхПартнеров(Партнер)
	
	Пока ЗначениеЗаполнено(Партнер.Родитель) Цикл
		
		Партнер = Партнер.Родитель;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Партнеры
	|ГДЕ
	|	Ссылка В ИЕРАРХИИ(&Партнер)");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	МассивПартнеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивПартнеров;
	
КонецФункции //-- #Б-1218 смарт: Фролов 28.10.2024	

&НаКлиенте
//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте
Процедура смартПодтвердитьПользователя(Команда)

	МожноПодтвердить = Истина;
	
	//++ #Б-1216 смарт: Фролов 28.10.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
	ВыбраноКонтактноеЛицо = Истина;
	//-- #Б-1216 смарт: Фролов 28.10.2024
	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен партнер, подтверждение невозможно!", , "Объект.Партнер");
		МожноПодтвердить = Ложь;
		
	Иначе
		
		//++ #Б-1216 смарт: Фролов 28.10.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
		НужнаяЭлектроннаяПочта = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "ЭлектроннаяПочта"); 
		//++ #Б-4186 смарт: Фролов 27.08.2025 //ОШИБКА. При открытии интереса с типом - Регистрация пользователя ИМ.
		//НужныйТелефон = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Телефон");
		НужныйТелефон = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Телефон"));
		//-- #Б-4186 смарт: Фролов 27.08.2025
		
		МассивКонтактныхЛицИмеющихсяНаСайте = смартНайтиКонтактПоЭлПочтеИТелефону(Новый 
			Структура("НужнаяЭлектроннаяПочта, НужныйТелефон, ОтобратьИмеющиесяНаСайте", НужнаяЭлектроннаяПочта, НужныйТелефон, Истина));
		
		Если МассивКонтактныхЛицИмеющихсяНаСайте.Количество() = 0 Тогда
			
			МассивКонтактныхЛиц = смартНайтиКонтактПоЭлПочтеИТелефону(Новый 
				Структура("НужнаяЭлектроннаяПочта, НужныйТелефон, ОтобратьИмеющиесяНаСайте", НужнаяЭлектроннаяПочта, НужныйТелефон, Ложь));
			
			Если МассивКонтактныхЛиц.Количество() = 0 Тогда
				
				ТекстСообщения = "Не найдено ни одного контактного лица Клиента с таким телефоном " 
					+ НужныйТелефон + " и почтой " + НужнаяЭлектроннаяПочта + "Пожалуйста откройте список контактных лиц клиента и 
					|создайте новое контактное лицо, либо дополните контактную информацию в имеющемся.";
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.КонтактноеЛицо");
				
				МожноПодтвердить = Ложь;
				
			ИначеЕсли МассивКонтактныхЛиц.Количество() > 1 Тогда
				
				СписокВыборкаКонтактныхЛиц = Новый СписокЗначений;
				СписокВыборкаКонтактныхЛиц.ЗагрузитьЗначения(МассивКонтактныхЛиц);
				ТекстСообщения = "Найдено более одного контактного лица с такими телефон и почта. 
					|Пожалуйста выберите корректное контактное лицо в качестве пользователя Интернет-магазина. 
					|Либо очистите контактные данные у второго, чтобы не было одинаковых карточек с парой телефон + почта.";
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
				ВыбранноеКонтактноеЛицо = СписокВыборкаКонтактныхЛиц.ВыбратьЭлемент("Выберите контактное лицо");
				
				Если ВыбранноеКонтактноеЛицо = Неопределено Тогда
					
					ТекстСообщения = "Не найдено ни одного контактного лица Клиента с таким телефоном и почтой. 
						|Пожалуйста откройте список контактных лиц клиента и создайте новое контактное лицо,
						|либо дополните контактную информацию в имеющемся";
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
					
					ВыбраноКонтактноеЛицо = Ложь;
					
				Иначе
					
					Объект.КонтактноеЛицо = ВыбранноеКонтактноеЛицо.Значение;
					
				КонецЕсли;
				
			ИначеЕсли МассивКонтактныхЛиц.Количество() = 1 Тогда	
				
				Объект.КонтактноеЛицо = МассивКонтактныхЛиц[0];	
				
			КонецЕсли;
			
		ИначеЕсли МассивКонтактныхЛицИмеющихсяНаСайте.Количество() > 1 Тогда
			
			ТекстСообщения = "Найдены пользователи с такими регисрационными 
				|данными, которые уже присутствуют в качестве пользователей Интернет-магазина. 
				|Найдено Контактные лица:";
			Для Каждого Стр Из МассивКонтактныхЛицИмеющихсяНаСайте Цикл
				ТекстСообщения = ТекстСообщения + Стр + " у Клиента " + 
					CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Стр, "Владелец");
			КонецЦикла;
			ТекстСообщения = ТекстСообщения + "Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
			МожноПодтвердить = Ложь;
				
			Элементы.смартПодтвердить.Видимость = Ложь;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		Иначе	
			
			Если CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(МассивКонтактныхЛицИмеющихсяНаСайте[0], "Владелец") = Объект.Партнер Тогда
				
				ТекстСообщения = "Пользователь с такими регисрационными данными уже присутствует в качестве пользователя Интернет-магазина. 
					|Найдено Контактное лицо " + МассивКонтактныхЛицИмеющихсяНаСайте[0] + " у данного Клиента." + Символы.ПС + 
					"Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
				
			Иначе
				
				ТекстСообщения = "Пользователь с такими регисрационными данными уже присутствует в качестве пользователя Интернет-магазина. 
					|Найдено Контактное лицо " + МассивКонтактныхЛицИмеющихсяНаСайте[0] + " у Клиента " +
					CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(МассивКонтактныхЛицИмеющихсяНаСайте[0], "Владелец") + "." + Символы.ПС + 
					"Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
			
			КонецЕсли;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
			Элементы.смартПодтвердить.Видимость = Ложь;
			
			МожноПодтвердить = Ложь;
			
		КонецЕсли;
		//-- #Б-1216 смарт: Фролов 28.10.2024
		
		//++ #Б-1214 смарт: Фролов 24.10.2024 //Регистрация в ИМ. Лид-Интерес. Проверка взаимодействия перед подтверждением
		РезультатПроверкиЗадачи = смартПроверитьНаличиеВыполненнойЗадачи();
		
		Если НЕ РезультатПроверкиЗадачи Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдена выполненная задача ""Созвониться с клиентом"", подтверждение невозможно!");
			МожноПодтвердить = Ложь;
			
		КонецЕсли;
		//-- #Б-1214 смарт: Фролов 24.10.2024
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен контрагент, подтверждение невозможно!", , "Объект.Контрагент");
		МожноПодтвердить = Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		//++ #Б-1218 смарт: Фролов 28.10.2024 //Регистрация в ИМ. Лид-Интерес. Проверка наличия контрагента
		МассивПартнеров = смартПолучитьМассивСвязанныхПартнеров(Объект.Партнер);
		
		Если МассивПартнеров.Найти(CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "Партнер")) = Неопределено Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный контрагент не соответствует партнеру!");
			МожноПодтвердить = Ложь;
			
		КонецЕсли;	
		//-- #Б-1218 смарт: Фролов 28.10.2024
		
	КонецЕсли;	
	
	Если МожноПодтвердить И ВыбраноКонтактноеЛицо Тогда //++ #Б-1216 смарт: Фролов 28.10.2024 //Добавлена проверка
		
		ТекстJSON = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "JSON_ИМ_Регистрация");
		
		СтруктураПараметров = Новый Структура;СтруктураПараметров.Вставить("JSON", ТекстJSON);
		СтруктураПараметров.Вставить("РегистрацияПодтверждена", Истина);
		СтруктураПараметров.Вставить("ПричинаОтклоненияРегистрации", "");
		СтруктураПараметров.Вставить("КонтактноеЛицо", Объект.КонтактноеЛицо);
		СтруктураПараметров.Вставить("Партнер", Объект.Партнер);
		СтруктураПараметров.Вставить("Контрагент", Объект.Контрагент);
		СтрокаОшибки = смартИнтернетМагазин.ПодтвердитьРегистрациюПользователяНаСайте(СтруктураПараметров);
		
		Если СтрокаОшибки = "" Тогда
			
			Объект.смартСтатусРегистрацияПользователяНаСайте = 1;
			
			Записать();
			Элементы.смартПодтвердить.Видимость = Ложь;
			Элементы.смартОтклонить.Видимость = Ложь;
			
		Иначе
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-986 смарт: Фролов 23.09.2024

&НаКлиенте
//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте
Процедура смартОтклонитьПользователя(Команда)

		ТекстJSON = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "JSON_ИМ_Регистрация");
		
		СтруктураПараметров = Новый Структура;СтруктураПараметров.Вставить("JSON", ТекстJSON);
		СтруктураПараметров.Вставить("РегистрацияПодтверждена", Ложь);
		СтруктураПараметров.Вставить("ПричинаОтклоненияРегистрации", "Учетная запись НЕ подтверждена");
		//++ #Б-5728 смарт: Фролов 12.02.2026 //Исправить ошибку в Интересе. Регистрация пользователя на сайте
		СтруктураПараметров.Вставить("КонтактноеЛицо", Неопределено);
		//-- #Б-5728 смарт: Фролов 12.02.2026
		СтрокаОшибки = смартИнтернетМагазин.ПодтвердитьРегистрациюПользователяНаСайте(СтруктураПараметров);
		
		Если СтрокаОшибки = "" Тогда
			
			Объект.смартСтатусРегистрацияПользователяНаСайте = 2;
			
			Записать();
			Элементы.смартПодтвердить.Видимость = Ложь;
			Элементы.смартОтклонить.Видимость = Ложь;
			
		Иначе
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
			
		КонецЕсли;

КонецПроцедуры //-- #Б-986 смарт: Фролов 23.09.2024 
	
&НаКлиенте
//++ #Б-3588 смарт: Фролов 19.06.2025 //Реализовать инструмент для работы отдела контроля качества.
Процедура смартСохранитьРезультатыАудита(Команда)

	смартСохранитьРезультатыАудитаНаСервере();

КонецПроцедуры //-- #Б-3588 смарт: Фролов 20.06.2025 

&НаСервере
//++ #Б-3588 смарт: Фролов 20.06.2025 //Реализовать инструмент для работы отдела контроля качества.
Процедура смартСохранитьРезультатыАудитаНаСервере()

	НаборЗаписей = РегистрыСведений.смартАудитИнтересов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Интерес.Установить(Объект.Ссылка);
	НаборЗаписей.Отбор.Период.Установить(НачалоДня(ТекущаяДата()));
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Интерес = Объект.Ссылка;
	Запись.Период = ТекущаяДата();
	Запись.КвалификацияПройдена = ЭтаФорма.смартКвалификацияПройдена;
	Запись.ЗакрытСКорректногоЭтапа = ЭтаФорма.смартЗакрытСКорректногоЭтапа;
	Запись.ВозраженияОтработаны = ЭтаФорма.смартВозраженияОтработаны;
	Запись.КомментарийСоответствуетСутиЗвонка = ЭтаФорма.смартКомментарийСоответствуетСутиЗвонка;
	Запись.ПричинаПровалаКорректна = ЭтаФорма.смартПричинаПровалаКорректна;
	Запись.ВернутьНаДоработку = ЭтаФорма.смартВернутьНаДоработку;
	Запись.КвалификацияОборудования = ЭтаФорма.смартКвалификацияОборудования;
	//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
	//Запись.ЧтоСталоПричинойПровала = ЭтаФорма.смартЧтоСталоПричинойПровала;
	Запись.СледующееКасаниеЗапланировано = ЭтаФорма.смартСледующееКасаниеЗапланировано;
	Запись.КомментарийАудитораЭтапКвалификации = ЭтаФорма.смартКомментарийАудитораЭтапКвалификации;
	Запись.СделкаНаКорректномЭтапе = ЭтаФорма.смартСделкаНаКорректномЭтапе;
	Запись.ПрезентацияПроведена = ЭтаФорма.смартПрезентацияПроведена;
	Запись.ЗапланированоАктуальноеВзаимодействие = ЭтаФорма.смартЗапланированоАктуальноеВзаимодействие;
	Запись.КомментарийАудитораЭтапВедетсяРабота = ЭтаФорма.смартКомментарийАудитораЭтапВедетсяРабота; 
	Запись.ВозраженияОтработаныВедетсяРабота = ЭтаФорма.смартВозраженияОтработаныВедетсяРабота;
	//-- #Б-3718 смарт: Фролов 09.07.2025
	//++ #Б-3814 смарт: Фролов 14.07.2025 //Доработка механизма Аудита интересов.
	Запись.СделкаНаКорректномЭтапеЭтапКвалификации = ЭтаФорма.смартСделкаНаКорректномЭтапеЭтапКвалификации;
	//-- #Б-3814 смарт: Фролов 14.07.2025
	Запись.ВозраженияКлиента = ЭтаФорма.смартВозраженияКлиента;
	Запись.СКакогоЭтапаЗакрыт = ЭтаФорма.смартСКакогоЭтапаЗакрыт;
	Запись.КорректныйЭтапВоронки = ЭтаФорма.смартКорректныйЭтапВоронки;
	Запись.ВыбраннаяМенеджеромПричинаПровала = ЭтаФорма.смартВыбраннаяМенеджеромПричинаПровала;
	Запись.ВыбраннаяАудиторомПричинаПровала = ЭтаФорма.смартВыбраннаяАудиторомПричинаПровала;
	Запись.ПоследнийКоментарийИзСделки = ЭтаФорма.смартПоследнийКоментарийИзСделки;
	Запись.КомментарийАудитора = ЭтаФорма.смартКомментарийАудитора;
	//++ #Б-3826 смарт: Фролов 25.06.2025 //Создание отчета "Аудит завершенных Интересов" 
	Запись.КоличествоКасаний = ЭтаФорма.смартКоличествоКасаний;
	//-- #Б-3826 смарт: Фролов 25.06.2025
	//++ #Б-3678 смарт: Фролов 02.07.2025 //Доработка механизма Аудита Интересов.
	Запись.ЭтапАудита = Объект.СостояниеИнтереса;
	Запись.Аудитор = Пользователи.ТекущийПользователь();
	//-- #Б-3678 смарт: Фролов 02.07.2025
	НаборЗаписей.Записать(Истина);
	
	//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
	НаборЗаписей = РегистрыСведений.смартСписокНарушенийПоИнтересу.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Интерес.Установить(Объект.Ссылка); 
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НаборЗаписей.Записать(Истина); 
	
	Для Каждого СтрПричины Из ЭтаФорма.смартЧтоСталоПричинойПровала Цикл
		
		МенеджерЗаписи = РегистрыСведений.смартСписокНарушенийПоИнтересу.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Интерес = Объект.Ссылка;
		МенеджерЗаписи.ЧтоСталоПричинойПровала = СтрПричины.Значение;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	//-- #Б-3718 смарт: Фролов 09.07.2025
	
	Элементы.смартБыстрыйВвод_СтраницаАудит.Скрыть();
	
КонецПроцедуры //-- #Б-3588 смарт: Фролов 20.06.2025 

&НаКлиенте
//++ #Б-5664 смарт: Фролов 12.02.2026 //Сделать механизм контроля эффективности работы ОКК
Процедура смартОповеститьОбИнциденте(Команда)

	смартОповеститьОбИнцидентеНаСервере();

КонецПроцедуры //-- #Б-5664 смарт: Фролов 12.02.2026

&НаСервере 
//++ #Б-5664 смарт: Фролов 12.02.2026 //Сделать механизм контроля эффективности работы ОКК
Процедура смартОповеститьОбИнцидентеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.смартИнцидентКтоБудетОповещен) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено поле Кто будет оповещен!");
		Возврат;	
		
	КонецЕсли;
	
	Если СокрЛП(ЭтаФорма.смартИнцидентУточнение) = "" Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено уточнение!");
		Возврат;	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартИнцидент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартИнцидент КАК смартИнцидент
	|ГДЕ
	|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
	|	И НЕ смартИнцидент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВидыИнцидентов.Ссылка КАК Ссылка,
	|	смартВидыИнцидентов.Наименование КАК Наименование,
	|	смартВидыИнцидентов.Код КАК Код
	|ИЗ
	|	Справочник.смартВидыИнцидентов КАК смартВидыИнцидентов
	|ГДЕ
	|	смартВидыИнцидентов.Использовать
	//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
	|	И смартВидыИнцидентов.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИнцидентов.ДляИнтересов))
	//-- #Б-5762 смарт: Фролов 18.02.2026
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартВидыИнцидентов.Порядок");
	Запрос.УстановитьПараметр("ОбъектИнцидента", Объект.Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если МассивРезультатов[0].Пустой() Тогда
		
		ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаОбъект.Дата = ТекущаяДата();
		ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		ЗадачаОбъект.Исполнитель = ЭтаФорма.смартИнцидентКтоБудетОповещен;
		ЗадачаОбъект.Предмет = Объект.Ссылка;
		ЗадачаОбъект.ПредметСтрокой = Строка(Объект.Ссылка);
		ЗадачаОбъект.CRM_Личная = Истина;
		ЗадачаОбъект.CRM_Партнер = Объект.Партнер;
		ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
		ЗадачаОбъект.ДатаНачала = ТекущаяДата() + 300;
		ЗадачаОбъект.ПринятаКИсполнению = Истина;
		ЗадачаОбъект.СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
 		ЗадачаОбъект.СрокИсполнения = смартОбщегоНазначения.ПолучитьРабочуюДатуОтносительноИсходной(ТекущаяДата(), 1, "Вперед");
		
		ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.РазобратьсяСИнцидентом;
		
		ЗадачаОбъект.Описание = ЭтаФорма.смартИнцидентУточнение;
		ЗадачаОбъект.Наименование = "Необходимо разобраться с инцидентом";
		ЗадачаОбъект.Записать();
		
		ДокументИнцидент = Документы.смартИнцидент.СоздатьДокумент();
		ДокументИнцидент.ОбъектИнцидента = Объект.Ссылка;
		ДокументИнцидент.Задача = ЗадачаОбъект.Ссылка;
		ДокументИнцидент.Ответственный = Пользователи.ТекущийПользователь();
		ДокументИнцидент.Описание = ЭтаФорма.смартИнцидентУточнение;
		ДокументИнцидент.Адресат = ЭтаФорма.смартИнцидентКтоБудетОповещен;
		ДокументИнцидент.Дата = ТекущаяДата();
		
		//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		ТекстПисьма = "Интерес: " + Объект.Тема + Символы.ПС + Символы.ПС;
		ТекстПисьма = ТекстПисьма + ЭтаФорма.смартИнцидентУточнение + Символы.ПС + Символы.ПС;
		//-- #Б-5762 смарт: Фролов 20.02.2026
		
		Выборка = МассивРезультатов[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидИнцидента = Элементы.Найти("смартВидИнцидента" + Выборка.Код);
			
			Если НЕ ВидИнцидента = Неопределено Тогда
				
				Если ЭтаФорма["смартВидИнцидента" + Выборка.Код] Тогда
					
					СтрВидыИнцидентов = ДокументИнцидент.ВидыИнцидентов.Добавить();
					СтрВидыИнцидентов.ВидИнцидента = Выборка.Ссылка;
					
					//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
					ТекстПисьма = ТекстПисьма + Выборка.Наименование + Символы.ПС;
					//-- #Б-5762 смарт: Фролов 20.02.2026
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ДокументИнцидент.Записать(РежимЗаписиДокумента.Запись);
		
		//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
		
		ТестовыеАдресаСтрока = "";
		ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(ЭтаФорма.смартИнцидентКтоБудетОповещен, АдресаДляОтправкиСтрокой);
		
		//++ #Б-6630 смарт: Фролов 13.05.2026 //Сделать механизм оповещений о новых Инцидентах.
		Квалификация = ?(ЗначениеЗаполнено(Объект.смартИтоговаяКвалификация), Объект.смартИтоговаяКвалификация, Объект.смартПредварительнаяКвалификация);
		
		МассивПользователей = смартОбщегоНазначения.ПолучитьПользователейПоНастройкамОбОповещениях("Инциденты", Объект.Подразделение, Квалификация.ТипПродукта);
		
		Если НЕ МассивПользователей = Неопределено Тогда
			
			Для Каждого Пользователь Из МассивПользователей Цикл
				
				МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", Пользователь.смартРабочаяПочта, Пользователь.смартРабочаяПочта));
				АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Пользователь.смартРабочаяПочта;
				
			КонецЦикла;
		
		КонецЕсли;
		//-- #Б-6630 смарт: Фролов 13.05.2026

		НавСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка);
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Ссылка на объект инцидента: " + НавСсылка;
		
		ТемаПисьма = "Новый инцидент, требует вашего внимания!";
		
		Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			ДанныеОтправки = Новый Структура("Тема, Заголовок", ТемаПисьма, ТекстПисьма);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Исключение
				ТекстСообщения = "Не удалось отправить письмо ответственному " + ЭтаФорма.смартИнцидентКтоБудетОповещен 
					+ " по инциденту " + ДокументИнцидент.Ссылка + Символы.ПС + ОписаниеОшибки(); 
				ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
		//-- #Б-5762 смарт: Фролов 20.02.2026
		
		Элементы.смартГруппаОповеститьОбИнцидентеВертикальная.ТолькоПросмотр = Истина;
		Элементы.смартКнопкаОповеститьОбИнциденте.Доступность = Ложь;
	
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
//++ #Б-5664 смарт: Фролов 12.02.2026 //Сделать механизм контроля эффективности работы ОКК
Процедура смартОтреагироватьНаИнцидент(Команда)

	смартОтреагироватьНаИнцидентНаСервере();		
	
КонецПроцедуры //-- #Б-5664 смарт: Фролов 12.02.2026

&НаСервере
//++ #Б-5664 смарт: Фролов 13.02.2026 //Сделать механизм контроля эффективности работы ОКК
Процедура смартОтреагироватьНаИнцидентНаСервере()
	
	Если СокрЛП(ЭтаФорма.смартИнцидентПринятоеРешение) = "" Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено Принятое решение!");
		Возврат;	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартИнцидент.Ссылка КАК Ссылка,
	|	смартИнцидент.Задача КАК Задача
	|ИЗ
	|	Документ.смартИнцидент КАК смартИнцидент
	|ГДЕ
	|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
	|	И НЕ смартИнцидент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВидыРеакцийНаИнцидент.Ссылка КАК Ссылка,
	|	смартВидыРеакцийНаИнцидент.Наименование КАК Наименование,
	|	смартВидыРеакцийНаИнцидент.Код КАК Код
	|ИЗ
	|	Справочник.смартВидыРеакцийНаИнцидент КАК смартВидыРеакцийНаИнцидент
	|ГДЕ
	|	смартВидыРеакцийНаИнцидент.Использовать
	//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
	|	И смартВидыРеакцийНаИнцидент.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыРеакцийНаИнцидент.ДляИнтересов))
	//-- #Б-5762 смарт: Фролов 18.02.2026
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартВидыРеакцийНаИнцидент.Порядок");
	Запрос.УстановитьПараметр("ОбъектИнцидента", Объект.Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент = МассивРезультатов[0].Выбрать();
	
	Если ВыборкаДокумент.Следующий() Тогда
	
		ДокументИнцидент = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокументИнцидент.Решение = ЭтаФорма.смартИнцидентПринятоеРешение;
		//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
		//ДокументИнцидент.Оценка = ЭтаФорма.смартИнцидентОценкаРаботыОКК;
		//++ #Б-5762 смарт: Фролов 19.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		//ДокументИнцидент.КомментарийКОценке = ЭтаФорма.смартИнцидентКомментарийКОценке; 
		//-- #Б-5762 смарт: Фролов 19.02.2026
		//-- #Б-5928 смарт: Фролов 05.03.2026
		ДокументИнцидент.НовыйИнтерес = ЭтаФорма.смартИнцидентНовыйИнтерес;
		ДокументИнцидент.ДатаРеакции = ТекущаяДата();
		ДокументИнцидент.ЕстьРеакция = Истина;
		ДокументИнцидент.КтоОтреагировал = Пользователи.ТекущийПользователь();
		
		//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		ТекстПисьма = "Интерес: " + Объект.Тема + Символы.ПС + Символы.ПС;
		ТекстПисьма = ТекстПисьма + ЭтаФорма.смартИнцидентПринятоеРешение + Символы.ПС + Символы.ПС;
		//-- #Б-5762 смарт: Фролов 20.02.2026
		
		Выборка = МассивРезультатов[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидИнцидента = Элементы.Найти("смартВидРеакции" + Выборка.Код);
			
			Если НЕ ВидИнцидента = Неопределено Тогда
				
				Если ЭтаФорма["смартВидРеакции" + Выборка.Код] Тогда
					
					СтрВидыРеакцииНаИнцидент = ДокументИнцидент.ВидыРеакцииНаИнцидент.Добавить();
					СтрВидыРеакцииНаИнцидент.ВидРеакцииНаИнцидент = Выборка.Ссылка;
					
					//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
					ТекстПисьма = ТекстПисьма + Выборка.Наименование + Символы.ПС;
					//-- #Б-5762 смарт: Фролов 20.02.2026
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ДокументИнцидент.Записать(РежимЗаписиДокумента.Запись);
		
		//++ #Б-7740 смарт: Фролов 05.08.2026 //Задачи от ком отдела от 04.08
		//ОбъектЗадача = ВыборкаДокумент.Задача.ПолучитьОбъект();
		//ОбъектЗадача.Выполнена = Истина;
		//ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
		//ОбъектЗадача.РезультатВыполнения = ЭтаФорма.смартИнцидентПринятоеРешение;
		//ОбъектЗадача.Записать();
		//-- #Б-7740 смарт: Фролов 05.08.2026
		
		ЭтаФорма.смартИнцидентДатаРеакции = ТекущаяДата();
		ЭтаФорма.смартИнцидентКтоОтреагировал = Пользователи.ТекущийПользователь(); 
		
		//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
		
		ТестовыеАдресаСтрока = "";
		ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(ЭтаФорма.смартИнцидентКтоОповестил, АдресаДляОтправкиСтрокой);

		НавСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка); 
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Автор " + Пользователи.ТекущийПользователь() + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Оценка работы " 
			+ Лев(ЭтаФорма.смартИнцидентОценкаРаботыОКК, СтрНайти(Строка(ЭтаФорма.смартИнцидентОценкаРаботыОКК), " ") - 1) + Символы.ПС;
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Ссылка на объект инцидента: " + НавСсылка;
		
		ТемаПисьма = "Реакция на инцидент";
		
		Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			ДанныеОтправки = Новый Структура("Тема, Заголовок", ТемаПисьма, ТекстПисьма);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Исключение
				ТекстСообщения = "Не удалось отправить письмо ответственному " + ЭтаФорма.смартИнцидентКтоОповестил 
					+ " по инциденту " + ДокументИнцидент.Ссылка + Символы.ПС + ОписаниеОшибки(); 
				ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
		//-- #Б-5762 смарт: Фролов 20.02.2026
				
		Элементы.смартГруппаРеакцияНаИнцидентВертикальная.ТолькоПросмотр = Истина;
		Элементы.смартКнопкаОтреагироватьНаИнцидент.Доступность = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-5664 смарт: Фролов 13.02.2026

&НаКлиенте
//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
Процедура смартЗаписатьИтоговыйРезультат(Команда)

	смартЗаписатьИтоговыйРезультатНаСервере();
	
КонецПроцедуры //-- #Б-5928 смарт: Фролов 05.03.2026

&НаСервере
//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
Процедура смартЗаписатьИтоговыйРезультатНаСервере()

	УстановитьПривилегированныйРежим(Истина); 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартИнцидент.Ссылка КАК Ссылка,
	|	смартИнцидент.Задача КАК Задача
	|ИЗ
	|	Документ.смартИнцидент КАК смартИнцидент
	|ГДЕ
	|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
	|	И НЕ смартИнцидент.ПометкаУдаления 
	//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВидыИтоговыхРезультатовИнцидентов.Ссылка КАК Ссылка,
	|	смартВидыИтоговыхРезультатовИнцидентов.Наименование КАК Наименование,
	|	смартВидыИтоговыхРезультатовИнцидентов.Код КАК Код
	|ИЗ
	|	Справочник.смартВидыИтоговыхРезультатовИнцидентов КАК смартВидыИтоговыхРезультатовИнцидентов
	|ГДЕ
	|	смартВидыИтоговыхРезультатовИнцидентов.Использовать
	|	И смартВидыИтоговыхРезультатовИнцидентов.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИтоговыхРезультатовИнцидентов.ДляИнтересов))
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартВидыИтоговыхРезультатовИнцидентов.Порядок");
	Запрос.УстановитьПараметр("ОбъектИнцидента", Объект.Ссылка);
	
	//ВыборкаДокумент = Запрос.Выполнить().Выбрать();
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент = МассивРезультатов[0].Выбрать();
	//-- #Б-6288 смарт: Фролов 02.04.2026
	
	Если ВыборкаДокумент.Следующий() Тогда
	
		ДокументИнцидент = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокументИнцидент.ИтоговыйРезультат = ЭтаФорма.смартИнцидентИтоговыйРезультат;
		ДокументИнцидент.Оценка = ЭтаФорма.смартИнцидентОценкаРаботыОКК;
		ДокументИнцидент.КомментарийКОценке = ЭтаФорма.смартИнцидентКомментарийКОценке; 
		ДокументИнцидент.ДатаРезультата = ТекущаяДата();
		
		//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
		Выборка = МассивРезультатов[1].Выбрать();
		
		ДокументИнцидент.ВидыРезультатов.Очистить();
		
		Пока Выборка.Следующий() Цикл
			
			ВидРезультата = Элементы.Найти("смартВидРезультата" + Выборка.Код);
			
			Если НЕ ВидРезультата = Неопределено Тогда
				
				Если ЭтаФорма["смартВидРезультата" + Выборка.Код] Тогда
					
					СтрВидыРеакцииНаИнцидент = ДокументИнцидент.ВидыРезультатов.Добавить();
					СтрВидыРеакцииНаИнцидент.ВидРезультата = Выборка.Ссылка;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		//-- #Б-6288 смарт: Фролов 02.04.2026
		
		ДокументИнцидент.Записать(РежимЗаписиДокумента.Запись);
		
		//++ #Б-7740 смарт: Фролов 05.08.2026 //Задачи от ком отдела от 04.08
		ОбъектЗадача = ВыборкаДокумент.Задача.ПолучитьОбъект();
		ОбъектЗадача.Выполнена = Истина;
		ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
		ОбъектЗадача.РезультатВыполнения = ЭтаФорма.смартИнцидентПринятоеРешение;
		ОбъектЗадача.Записать();
		//-- #Б-7740 смарт: Фролов 05.08.2026
		
		ЭтаФорма.смартИнцидентДатаРезультата = ТекущаяДата();
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-5928 смарт: Фролов 05.03.2026

&НаКлиенте
//++ #Б-5664 смарт: Фролов 12.02.2026 //Сделать механизм контроля эффективности работы ОКК
Процедура смартСтраницыАудитПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "смартСтраницаАудитИнцидент" Тогда
		
		Элементы.смартДатаАудита.ТолькоПросмотр = Истина;
		Элементы.смартВернутьНаДоработку.ТолькоПросмотр = Истина;
		Элементы.смартКнопкаСохранитьРезультатыАудита.Доступность = Ложь;
		
	Иначе	
		
		Элементы.смартДатаАудита.ТолькоПросмотр = Ложь;
		Элементы.смартВернутьНаДоработку.ТолькоПросмотр = Ложь;
		Элементы.смартКнопкаСохранитьРезультатыАудита.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-5664 смарт: Фролов 12.02.2026

&НаКлиенте
//++ #1665 смарт: Фролов 04.03.2024 //1C:CRM Доработки 
Процедура смартНаписатьПисьмо(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.смартЭлектроннаяПочтаЛид) Тогда
		
		СписокАдресов = Новый СписокЗначений;
		СписокАдресов.Добавить(ЭтаФорма.смартЭлектроннаяПочтаЛид, ЭтаФорма.смартЭлектроннаяПочтаЛид);
		
		ПараметрыФормы = Новый Структура("Основание", ЭтаФорма.Объект.Ссылка);
		ПараметрыФормы.Вставить("ДанныеЗаполнения", ЭтаФорма.Объект.Ссылка);
		ПараметрыФормы.Вставить("Кому", СписокАдресов);
		
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Электронная почта не заполнена!");
		
	КонецЕсли;
	
КонецПроцедуры //-- #1665 смарт: Фролов 04.03.2024

&НаКлиенте
//++ #1788 смарт: Фролов 22.04.2024 //Доработка логики выбора Итоговой квалификации в Интересе
Процедура смартИтоговаяКвалификацияПриИзменении(Команда)

	смартИтоговаяКвалификацияПриИзмененииНаСервере();
	
КонецПроцедуры //-- #1788 смарт: Фролов 22.04.2024

&НаСервере
//++ #1788 смарт: Фролов 22.04.2024 //Доработка логики выбора Итоговой квалификации в Интересе
Процедура смартИтоговаяКвалификацияПриИзмененииНаСервере()

	Если Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.НайтиПоНаименованию("Неопределено") Тогда
		
		Объект.смартИтоговаяКвалификация = Неопределено;
		ОбщегоНазначения.СообщитьПользователю("Квалификация Неопределено не можжет быть использована в качестве итоговой");
		
	КонецЕсли;
	
	//++ #Б2454 смарт: Шляпников 07.03.2025 / Заблокировать область в документе Интерес
	Если Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте Тогда
		Элементы.ГруппаПанельСостояний.Доступность	= Ложь;
	КонецЕсли;
	//-- #Б2454 смарт: Шляпников 07.03.2025

КонецПроцедуры //-- #1788 смарт: Фролов 22.04.2024	

&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ОбновитьЛенту")
//++ #1813 смарт: Фролов 08.05.2024 //Доработки для удобства использования WhatsApp
Процедура смарт_Подключаемый_ОбновитьЛенту()

	ПараметрыЛенты = Новый Структура;
	ПараметрыЛенты.Вставить("Режим",				"ЛентаИнтереса");
	
	#Вставка //++ #1443 смарт: Фролов 01.09.2023 //Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.  
	ПараметрыЛенты.Вставить("Объект", Объект.Ссылка);
	//++ #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		ПараметрыЛенты.Вставить("Партнер", Объект.Партнер);
	КонецЕсли; 
	//-- #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.

	#КонецВставки //-- #1443 смарт: Фролов 01.09.2023
	
	ПараметрыЛенты.Вставить("АдресКартинок",		Лента_АдресКартинок);
	ПараметрыЛенты.Вставить("АдресКартинокФайлов",	Лента_АдресКартинокФайлов);
	ПараметрыЛенты.Вставить("Отбор",				Лента_Отбор);
	ПараметрыЛенты.Вставить("ОбъектовИстории",		Лента_КоличествоОбъектовИстории);
	ПараметрыЛенты.Вставить("Прокрутить",			Лента_Прокрутить);
	ПараметрыЛенты.Вставить("Пустая",				Не ЗначениеЗаполнено(Объект.Ссылка));

	ПолучателиЧата = Новый Массив;
	Лента_HTML = CRM_ЛентаСобытий.СформироватьЛенту(ПараметрыЛенты, ПолучателиЧата);

	Лента_Прокрутить = Ложь;

	// +Рарус alexpr
	//Если Лента_ЗначенияНастроек.ИспользоватьЧаты Тогда
	//	CRM_ЛентаСобытийКлиент.НастроитьОбластьВводаПослеФормированияЛенты(ПолучателиЧата, ЭтотОбъект);
	//	ВидимостьКомандыЧат = (БыстрыйВвод_ЧатПолучатели.Количество() > 0);
	//	Если БыстрыйВвод_ТекущийТипОбъекта = "Чат" И Не ВидимостьКомандыЧат Тогда
	//		ПереключитьСтраницуБыстрогоВвода("Примечание");
	//	КонецЕсли;
	//КонецЕсли;
	CRM_ЛентаСобытийКлиентСервер.ОбластьВводаНастритьВидимостьКомандПослеФормированияЛенты(ЭтотОбъект);

	Если Лента_ЗначенияНастроек.ИспользоватьЧаты Тогда

		ПараметрыДополнения = Новый Структура;
		ПараметрыДополнения.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыДополнения.Вставить("УчетнаяЗапись", БыстрыйВвод_ЧатУчетнаяЗапись);
		ПараметрыДополнения.Вставить("ПартнерыКИ", ЭтотОбъект["КонтактнаяИнформацияОбъектовОписаниеДополнительныхРеквизитов"]);

		МассивКонтактов = Новый Массив;
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			МассивКонтактов.Добавить(Объект.Партнер);
		ИначеЕсли ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
			МассивКонтактов.Добавить(Объект.ПотенциальныйКлиент);
		КонецЕсли;
		Для Каждого Строка Из Объект.Контакты Цикл
			МассивКонтактов.Добавить(Строка.Контакт);
		КонецЦикла;
		ПараметрыДополнения.Вставить("МассивКонтактов", МассивКонтактов);

		CRM_КлиентыСервер.ДополнитьПолучателейЧата(ПолучателиЧата, ПараметрыДополнения);

		УчетныеЗаписиМессенджеров = CRM_КлиентыСервер.УчетныеЗаписиМессенджеров(БыстрыйВвод_ЧатВидКИ, Объект.Ссылка);
		CRM_ЛентаСобытийКлиентСервер.НастроитьОбластьВводаУчетныеЗаписиМессенджеров(УчетныеЗаписиМессенджеров, ЭтотОбъект);

		CRM_ЛентаСобытийКлиентСервер.НастроитьОбластьВводаПослеФормированияЛенты(ПараметрыЛенты, ПолучателиЧата, ЭтотОбъект);

	КонецЕсли;
	// -Рарус alexpr
	
	#Вставка
	Если ПолучателиЧата.Количество() > 0 Тогда
		
		Элементы.смартДекорацияНетПолучателейЧата.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатСодержание.Видимость = Истина;
		Элементы.БыстрыйВвод_КомандыЧат.Видимость = Истина;
		
	Иначе
		
		Элементы.смартДекорацияНетПолучателейЧата.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатСодержание.Видимость = Ложь;
		Элементы.БыстрыйВвод_КомандыЧат.Видимость = Ложь;
		
	КонецЕсли;
	#КонецВставки
	
	#Вставка
	//++ #Б-2470 смарт: Фролов 24.02.2025 //Вывод состояния Партнера в Интересе.
	смартОтразитьСостояниеПартнера();
	//-- #Б-2470 смарт: Фролов 24.02.2025
	#КонецВставки
	
КонецПроцедуры //-- #1813 смарт: Фролов 08.05.2024

&НаКлиенте
//++ #Б-2470 смарт: Фролов 24.02.2025 //Вывод состояния Партнера в Интересе.
Процедура смартОтразитьСостояниеПартнера()
	
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда	
		
		Элементы.смартСостояниеОтветственногоЗаголовок.Видимость = Истина;
		Элементы.смартСостояниеОтветственного.Видимость = Истина;
		
		СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Партнер);
		Элементы.смартСостояниеОтветственного.Заголовок = СтруктураНовогоСостояния.Состояние;
		
		Если НЕ СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") Тогда
			
			Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Заголовок = "Станет свободным через:";
			Элементы.смартОтветственныйСтанетСвободным.Заголовок = "" + СтруктураНовогоСостояния.КоличествоДней + " " 
				+ смартОбщегоНазначения.ПолучитьДниВСклонении(СтруктураНовогоСостояния.КоличествоДней);
			
			Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Истина;
			Элементы.смартОтветственныйСтанетСвободным.Видимость = Истина;
			
		Иначе	
			
			Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Ложь;
			Элементы.смартОтветственныйСтанетСвободным.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Ложь;
		Элементы.смартОтветственныйСтанетСвободным.Видимость = Ложь;
		Элементы.смартСостояниеОтветственногоЗаголовок.Видимость = Ложь;
		Элементы.смартСостояниеОтветственного.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-2470 смарт: Фролов 24.02.2025	

&НаКлиенте
//++ #1830 смарт: Фролов 24.05.2024 //Приведение механизма Заметок в Интересе и Партнере к общему виду.
Процедура смартОткрытьЗаметки(Команда)
	
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		ПараметрыФормы = Новый Структура("Предмет",Объект.Партнер);
		ОткрытьФорму("Справочник.Заметки.Форма.ЗаметкиПоПредмету", ПараметрыФормы, ЭтаФорма, Истина, , , , РежимОткрытияОкнаФормы.Независимый);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен клиент!");
		
	КонецЕсли;

КонецПроцедуры //-- #1830 смарт: Фролов 24.05.2024

&НаСервере
//++ #1854 смарт: Фролов 13.06.2024 //В Интересе, при смене ответственного проверять, работает ли он в CRM
Функция смартПроверитьОтветственногоНаРаботуСCRM(НовыйОтветственный)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.CRM_НастройкиПользователей
	|ГДЕ
	|	Настройка = &Настройка
	|	И Значение = ИСТИНА
	|	И Пользователь = &НовыйОтветственный");
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.CRM_НастройкиПользователей.ИспользоватьCRM);
	Запрос.УстановитьПараметр("НовыйОтветственный", НовыйОтветственный);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции //-- #1854 смарт: Фролов 13.06.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		УстановитьТолькоПросмотр = Истина;
	Иначе
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ОбращениеПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	УстановитьУсловноеОформление(); // +CRM_Модуль

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "КоманднаяПанельФормы");
		ДополнительныеПараметры.Вставить("Объект", Объект);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);

		Элемент = Элементы.Найти("РедактироватьСоставДополнительныхРеквизитов");
		Если Элемент<>Неопределено Тогда
			Элемент.Видимость = Ложь;
		КонецЕсли;
		CRM_УправлениеСвойствами.ПослеОтрисовкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;

	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ТекущееПодразделение = ТекущийПользователь.Подразделение;

	НастроитьРолевуюАдресацию(Объект.СостояниеИнтереса);
	//Элементы.Ответственный.ТолькоПросмотр = Истина;
	//Элементы.Ответственный.КнопкаВыбора = Ложь;
	Элементы.Перенаправить.Видимость = Истина;

	СценарийИнтереса = Объект.СостояниеИнтереса.Родитель;
	РазрешатьСозданиеИнтересовПоОдномуТипуУслуги = Константы.CRM_РазрешатьСозданиеИнтересовПоОдномуТипуУслуги.Получить();
	ЗаполнитьПервичныйИнтерес(Параметры.Основание);
	ЗаполнятьПервичныйИнтерес = Константы.CRM_ЗаполнятьПервичныйИнтерес.Получить();

	// +CRM_Модуль
	//	ВалютаРасчетов = Объект.Договор.ВалютаРасчетов;
	// -CRM_Модуль
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", ВалютаРегламентированногоУчета));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;

	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ВыручкаВВалюте = РаботаСКурсамиВалют.ПересчитатьВВалюту(Объект.ОжидаемаяВыручка, ВалютаУправленческогоУчета, Объект.Валюта, Объект.Дата);

	Элементы.ДекорацияВыручкаВУпрВалюте.Заголовок = "(" + Строка(Объект.ОжидаемаяВыручка) + " " + ВалютаУправленческогоУчета.Наименование + ")";

	Если Объект.Валюта = ВалютаУправленческогоУчета Тогда
		Элементы.ДекорацияВыручкаВУпрВалюте.Видимость = Ложь;
	КонецЕсли;

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		Элементы.Валюта.Доступность = Ложь;
	КонецЕсли;

	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда

		CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_ОбщегоНазначенияСервер");
		Если CRM_Модуль.ОрганизацияОблагаетсяНДС(Объект.Организация) Тогда	
			Элементы["ЗапасыСтавкаНДС"].Видимость = Истина;
			Элементы["ЗапасыСуммаНДС"].Видимость = Истина;
			Элементы["ЗапасыВсего"].Видимость = Истина;
		Иначе	
			Элементы["ЗапасыСтавкаНДС"].Видимость = Ложь;
			Элементы["ЗапасыСуммаНДС"].Видимость = Ложь;
			Элементы["ЗапасыВсего"].Видимость = Ложь;
		КонецЕсли;

		// Сформируем надпись цены и валюты.
		УчетВалютныхОпераций = Константы["ФункциональнаяУчетВалютныхОпераций"].Получить();

	КонецЕсли;

	Элементы.ВалютаДекорация.Заголовок = Объект.Валюта;

	Если НЕ Объект.Ссылка.Пустая() Тогда
		НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере();

		Если Объект.Завершен Тогда
			ТекущаяЗадача = CRM_ВзаимодействияСервер.ПолучитьЗадачуЗавершенногоИнтереса(Объект.Ссылка);
		Иначе
			ОткрываемаяЗадача = Неопределено;
			Параметры.Свойство("ОткрываемаяЗадача", ОткрываемаяЗадача);
			ТекущаяЗадача = CRM_ВзаимодействияСервер.ПолучитьЗадачуБПИнтереса(Объект.Ссылка, ОткрываемаяЗадача);
		КонецЕсли;
		БизнесПроцесс = ТекущаяЗадача.БизнесПроцесс;
		Элементы.ГруппаПричинаОтказа.Видимость = (Объект.СостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		Если НЕ Объект.Завершен Тогда
			//Элементы.ГруппаЭтапБП.Видимость = Истина;
			//ТекущаяЗадачаПредставление = "Задача: "+ТекущаяЗадача.CRM_ТочкаМаршрута + ", срок: " + Формат(ТекущаяЗадача.ДатаНачала, "ДФ='dd.MM.yyyy ЧЧ:мм'");
			//ТекущаяЗадачаПредставление = Формат(ТекущаяЗадача.ДатаНачала, "ДФ='dd.MM.yyyy ЧЧ:мм'");
			ПолучитьТаблицуТипов();
		КонецЕсли;
	КонецЕсли;
	Элементы.СценарийИнтереса.ТолькоПросмотр = (ЗначениеЗаполнено(ТекущаяЗадача) ИЛИ Объект.СостояниеИнтереса.Завершено);

	Элементы.СтраницыДанныеДокумента.ТекущаяСтраница = Элементы.ГруппаРеквизиты;
	СкрытоеПолеТегов = "<HTML><BODY onResize='interactionButton.click()' onLoad='interactionButton.click()'>
	|<button id='interactionButton' style='display: none'>Кнопка взаимодействия</button></BODY></HTML>";	
	CRM_Теги.УстановитьПараметрыВыбора(Элементы);

	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Элементы.ДокументОснование.Видимость = Ложь;
	КонецЕсли;		

	Если Параметры.Свойство("ОткрытиеИзТелемаркетинга") И Параметры.ОткрытиеИзТелемаркетинга Тогда 
		ОткрытиеИзТелемаркетинга = Истина;
		Если Параметры.Свойство("СозданиеИзСтрокиТелемаркетинга") И Параметры.СозданиеИзСтрокиТелемаркетинга Тогда
			СозданиеИзСтрокиТелемаркетинга = Истина;
		КонецЕсли;			
		// Значит создаём интерес из телемаркетинга.
		Если Параметры.Свойство("Содержание") Тогда
			КаналПервичногоИнтереса = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.CRM_БезУказанияИсточника;
			СодержаниеВзаимодействия = Параметры.Содержание; 
		КонецЕсли;						
		Если Параметры.Свойство("Взаимодействие") Тогда
			ВидВзаимодействияИзТелемаркетинга = Параметры.Взаимодействие;
		КонецЕсли;			
	КонецЕсли;

	// +Софтфон
	Если Параметры.Свойство("сфпВыбранныйОбъект") Тогда
		Если Параметры.сфпВыбранныйОбъект.Свойство("ПотенциальныйКлиент") Тогда
			Объект.ПотенциальныйКлиент = Параметры.сфпВыбранныйОбъект.ПотенциальныйКлиент;
		Иначе
			Объект.Партнер = Параметры.сфпВыбранныйОбъект.Партнер;
			Объект.КонтактноеЛицо = Параметры.сфпВыбранныйОбъект.КонтактноеЛицо;
		КонецЕсли;			
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		КлючевоеФизЛицо = РегистрыСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров.ПолучитьФизЛицо(Объект.КонтактноеЛицо);
		Если КлючевоеФизЛицо = Неопределено Тогда
			Если ЗначениеЗаполнено(Объект.Партнер) И Объект.Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
				МассивКЛ = РегистрыСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров.ПолучитьКонтактныеЛица(Объект.Партнер);
				Если МассивКЛ.Количество() > 0 Тогда
					CRM_ФизЛицо = Объект.Партнер;
				КонецЕсли;					
			КонецЕсли;	
		Иначе
			CRM_ФизЛицо = КлючевоеФизЛицо;
		КонецЕсли;			
	КонецЕсли;		
	// -Софтфон

	Если ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
		Если ЗначениеЗаполнено(Объект.ПотенциальныйКлиент.Организация) Тогда
			Элементы.ДекорацияОрганизацияПК.Заголовок = "Компания: "+ Объект.ПотенциальныйКлиент.Организация;
		Иначе
			Элементы.ДекорацияОрганизацияПК.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

	СписокТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	СписокТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);

	CRM_УправлениеКонтактнойИнформацией.ИнициализацияКонтактнойИнформации(ЭтотОбъект);

	CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.Партнер, "ГруппаКИПартнера", СписокТиповКИ.ВыгрузитьЗначения());
	CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.ПотенциальныйКлиент, "ГруппаКИПК", СписокТиповКИ.ВыгрузитьЗначения());

	CRM_КлиентыСервер.ИнициализацияКонтактныхЛицПартнера(ЭтотОбъект, СписокТиповКИ.ВыгрузитьЗначения(), "Объект.КонтактноеЛицо");

	ВывестиКонтактныеЛицаИнтереса(Ложь);

	ОбновитьТаблицуНаКонтроле();	
	СформироватьПредставлениеВложений();
	СформироватьОписаниеКаналаИсточника();

	ТекущееСостояние = Объект.СостояниеИнтереса;

	// ИнтернетПоддержкаПользователей.СПАРКРиски, ПриСозданииНаСервере.
	ПараметрыПроцедуры = Новый Структура("ВариантОтображения", "Однострочный");
	КонтрПартнер = 	?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(), Объект["Партнер"], ЭтотОбъект["КонтрагентПартнера"]);

	СПАРКРиски.ПриСозданииНаСервере(ЭтотОбъект, Неопределено, КонтрПартнер, 
	Перечисления.ЮрФизЛицо.ВидКонтрагентаСПАРКРиски(КонтрПартнер), ПараметрыПроцедуры);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ПриСозданииНаСервере.

	ОбязательноВводитьРезультат = Ложь;

	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();

	//ЗаполнитьПанельСостоянийИнтереса();

	ЗаполнитьДанныеВзаиморасчетов();

	ОбновитьЗаголовокФормы();

	// ЛентаСобытий
	Элементы.СтраницыЛента.ТекущаяСтраница = Элементы.СтраницаЛента;
	СкрытоеПолеЛенты = "<HTML><BODY onResize='interactionButton.click()' onLoad='interactionButton.click()'>
	|<button id='interactionButton' style='display: none'>Кнопка взаимодействия</button></BODY></HTML>";	
	Лента_ЗначенияНастроек = CRM_ЛентаСобытий.НастройкиЛенты(ТекущийПользователь, "ЛентаИнтереса");
	CRM_ЛентаСобытий.НастроитьЛенту(ЭтотОбъект, Лента_ЗначенияНастроек);
	НастроитьОбластьВвода();
	// Конец ЛентаСобытий

	CRM_РазрешитьСозданиеИнтересаБезКЛ = (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("CRM_РазрешитьСозданиеИнтересаБезКЛ"));

	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Создан';en='Created'") + ": ", , ЦветаСтиля.CRM_ЧерныйЦветТекста));
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Строка(Объект.Автор), , ЦветаСтиля.CRM_ОсновнойГолубой, , "Автор"));
	КомпонентыФС.Добавить(" " + Формат(Объект.Дата, "ДФ=d.MM.yyyy")+" " + НСтр("ru='в';en='in'") + " " + Формат(Объект.Дата, "ДФ=HH.mm"));
	Элементы.ДекорацияАвторДата.Заголовок = Новый ФорматированнаяСтрока(КомпонентыФС, , );

	Элементы.ГруппаБизнесПроцессы.Видимость = Константы.CRM_ИспользоватьБизнесПроцессы.Получить();
	Если Элементы.ГруппаБизнесПроцессы.Видимость Тогда
		ЗаполнитьДеревоПроцессов();
	КонецЕсли;

	РегистрироватьСвязиВИнтересах = ПолучитьФункциональнуюОпцию("CRM_РегистрироватьВИнтересахВзаимосвязиКлиентов");
	Если РегистрироватьСвязиВИнтересах Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязиМеждуПартнерами, "CRM_Интерес", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	CRM_ОбщегоНазначенияПовтИсп.ЗаполнитьСписокВыбораВариантовСроков(Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Дата);
	CRM_ОбщегоНазначенияПовтИсп.ЗаполнитьСписокВыбораВариантовСроков(Элементы.БыстрыйВвод_ЗадачаДатаОкончания_Дата);

	Если Параметры.Свойство("ПозиционироватьНаВзаимодействие") Тогда
		КлючОткрываемойАктивности = Параметры.ПозиционироватьНаВзаимодействие;
	КонецЕсли;

	Если Параметры.Свойство("Модифицированность") Тогда
		Модифицированность = Параметры.Модифицированность;
	КонецЕсли;

	ПроверяемыеРеквизитыИнтереса = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПроверяемыеРеквизитыИнтересаВСостоянии(ТекущееСостояние);

	// Управление элементами на форме
	CRM_УправлениеЭлементамиНаФормах.ПриСозданииНаСервере(ЭтотОбъект,, "ГруппаДополнительно", ?(ЭтоПоддержка, "Поддержка", ""));
	// Конец Управление элементами на форме

	// Поддержка
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_ДанныеОбратнойСвязи.Оценка КАК Оценка,
	|	CRM_ДанныеОбратнойСвязи.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.CRM_ДанныеОбратнойСвязи КАК CRM_ДанныеОбратнойСвязи
	|ГДЕ
	|	CRM_ДанныеОбратнойСвязи.Обращение = &Обращение
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_ДанныеОбратнойСвязи.ДатаОценки УБЫВ";
	Запрос.УстановитьПараметр("Обращение", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Оценка = Выборка.Оценка;
		КомментарийОценки = СокрЛП(Выборка.Комментарий);
		Элементы.ГруппаОценка.Видимость = Истина;
		Элементы.ДекорацияКомментарийОценки.Заголовок = "("+Оценка+" из 5) "+?(СтрДлина(КомментарийОценки) > 45, Лев(КомментарийОценки, 42)+"...", КомментарийОценки);
	КонецЕсли;	
	// Конец Поддержка

	// +Модели машинного обучения
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьМоделиМашинногоОбучения") Тогда
		Помощник_Использовать = Помощник_ПроверитьИспользование();
		Если Помощник_Использовать Тогда
			Элементы.ГруппаПомощник.Видимость = Истина;
			Элементы.ДекорацияВероятностьСделки.Видимость = Ложь;
			Помощник_ОбновитьСостояние();
		КонецЕсли;
	КонецЕсли;
	// -Модели машинного обучения

	CRM_ОбщегоНазначенияСервер.УстановитьКнопкиПечати(Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка)).ПолноеИмя(), ЭтотОбъект);

	Если Метаданные.ОбщиеМодули.Найти("CRM_Модуль_РаботаСКонтрагентами") <> Неопределено Тогда
		CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСКонтрагентами");
		CRM_Модуль.ДополнитьРеквизитыФормыДляСозданияКонтрагента(ЭтотОбъект);
	КонецЕсли;

	ЗаблокироватьРеквизитыПоСостояниюИнтереса();

	// +CRM_Модуль
	ИспользоватьРучныеСкидкиВПродажах           = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидкиВПродажах   = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ИспользоватьОграниченияРучныхСкидок = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям")
	ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям");

	УправлениеСвязямиПараметровВыбораРеквизитовФормы();

	ПоСоглашениюИспользуютсяДоговорыКонтрагентов = ЗначениеЗаполнено(Объект.Соглашение) И ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов");

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

	CRM_Модуль_СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения);
	УстановитьДоступностьКомандБуфераОбмена();

	ИспользоватьСкладыВТЧ = Константы.ИспользоватьСкладыВТабличнойЧастиДокументовПродажи.Получить();
	Элементы.Контрагент.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
	Элементы.ТоварыСклад.Видимость = ИспользоватьСкладыВТЧ;
	ОбновитьНадписиПосоглашениюСервер();
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Элементы["УТИВСК_ПомощникПродаж"].Видимость = НЕ Объект.СостояниеИнтереса.Родитель.ЭтоПоддержка;
	КонецЕсли;	
	// -CRM_Модуль

	// +Мобильный клиент
	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		УстановитьТолькоПросмотр = Истина;
	ИначеЕсли ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку(Истина, Истина).ПодготовитьФормуДляМобильногоКлиента(ЭтотОбъект);
	КонецЕсли;
	// -Мобильный клиент
	
	#Вставка
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024 
	#КонецВставки
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
&ИзменениеИКонтроль("ТоварыПослеУдаления")
Процедура смарт_ТоварыПослеУдаления(Элемент)

	РассчитатьИтоговыеПоказателиКоммерческогоПредложения(ЭтаФорма);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	#Вставка
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024 
	#КонецВставки

КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриОкончанииРедактирования")
Процедура смарт_ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьИтоговыеПоказателиКоммерческогоПредложения(ЭтаФорма);
	
	#Вставка
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024 
	#КонецВставки

КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Процедура смартСформироватьЗаголовокДополнительнойГарантии()

	ЭтапКвалифицирован = Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000041");
	
	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение)
		И ТипЗнч(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение) = Тип("Дата")
		И ТекущаяДата() >= Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение
		И Объект.ТипУслуги = ПредопределенноеЗначение("Справочник.CRM_ТипУслуги.ПоставкаТоварыУслуги")
		И ЗначениеЗаполнено(Объект.СостояниеИнтереса)
		И Объект.СостояниеИнтереса.Родитель = Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000035")
		И Объект.СостояниеИнтереса.РеквизитДопУпорядочивания >= ?(ЗначениеЗаполнено(ЭтапКвалифицирован), ЭтапКвалифицирован.РеквизитДопУпорядочивания, 0) 
		И Объект.СостояниеИнтереса <> Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000037") 
		И Объект.СостояниеИнтереса <> Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000038") Тогда
		
		смартОбщегоНазначения.ИзменитьВидимостьЗаголовокДополнительнойГарантии(ЭтаФорма, 
			Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, СуммаСНДС"),
			Объект.Ссылка,
			Объект.Валюта);
		
	КонецЕсли;  
		
	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение)
		И ТипЗнч(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение) = Тип("Дата")
		И ТекущаяДата() >= Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение
		И Не Объект.Завершен
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов")
		И ЗначениеЗаполнено(Объект.ДокументОснование.ДокументОснование)
		И ЗначениеЗаполнено(Объект.ДокументОснование.ДокументОснование.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") 
		И (Объект.Дата - Объект.ДокументОснование.ДатаПодписанияАктаНаПНР) / 24/ 60 / 60 < 365 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Серия", Объект.ДокументОснование.Серия);
		Запрос.УстановитьПараметр("Заказ", Объект.ДокументОснование.ДокументОснование.ДокументОснование);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	0 КАК НомерСтроки,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.Ссылка.Валюта КАК Валюта
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Серия = &Серия
		|	И ЗаказКлиентаТовары.Ссылка = &Заказ";   
		
		ТаблицаДокумента = Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, СуммаСНДС");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаТовара = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовара, Выборка);
			
			Если Объект.Валюта <> Выборка.Валюта Тогда
				
				СтрокаТовара.СуммаСНДС = РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрокаТовара.СуммаСНДС,
					Выборка.Валюта,
					Объект.Валюта,
					Объект.ДокументОснование.Дата);
					
			КонецЕсли;
			
		КонецЦикла;

		смартОбщегоНазначения.ИзменитьВидимостьЗаголовокДополнительнойГарантии(ЭтаФорма, ТаблицаДокумента, Объект.Ссылка, Объект.Валюта); 
		
	КонецЕсли;

КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024   

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
Процедура смартТекстДопУсловийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//++ #2059 смарт: Мосолов 19.09.2024 // Подсказка для документов Интерес и Заказ клиента при первоначальной продажи Доп. гарантии 
	Если СокрЛП(НавигационнаяСсылкаФорматированнойСтроки) = "?" Тогда  
		Элементы.смартГруппаПодсказкаДопГарантии.Показать();
		Возврат;
	КонецЕсли;
	//-- #2059 смарт: Мосолов 19.09.2024  
	
	МассивСтрок = СтрРазделить(НавигационнаяСсылкаФорматированнойСтроки, ";");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НомерСтроки", Число(МассивСтрок[0]));
	СтруктураПараметров.Вставить("МесяцевГарантии", МассивСтрок[1]);
	СтруктураПараметров.Вставить("Цена", МассивСтрок[2]);
	
	Оповещение = Новый ОписаниеОповещения("смартЗавершениеВопросаДобавлениеГарантии", 
		ЭтотОбъект,
		СтруктураПараметров);
		
	Товар = смартПолучитьНоменклатуруИзСтроки(Число(МассивСтрок[0]));   
	
	ТекстВопроса = "Вы хотите добавить дополнительную гарантию для номенклатуры "
		+ Товар
		+ " сроком на "
		+ МассивСтрок[1] 
		+ " месяцев?";
		
	ПоказатьВопрос(Оповещение,
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
Процедура смартЗавершениеВопросаДобавлениеГарантии(Результат, ПараметрыВопроса) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

   смартДобавитьСтрокуГарантии(ПараметрыВопроса.НомерСтроки, ПараметрыВопроса.МесяцевГарантии, ПараметрыВопроса.Цена);
   
   смартСформироватьЗаголовокДополнительнойГарантии(); 
   ОбновитьЗаголовокГруппыТовары();
   
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Функция смартПолучитьНоменклатуруИзСтроки(НомерСтроки) 
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Серия", Объект.ДокументОснование.Серия);
		Запрос.УстановитьПараметр("Заказ", Объект.ДокументОснование.ДокументОснование.ДокументОснование);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Серия = &Серия
		|	И ЗаказКлиентаТовары.Ссылка = &Заказ"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Возврат Выборка.Номенклатура;
			
		КонецЕсли;   
		
	Иначе
		
		Отбор = Новый Структура("НомерСтроки", НомерСтроки);
		
		СтрокиТоваров = Объект.Товары.НайтиСтроки(Отбор);
		
		Возврат СтрокиТоваров[0].Номенклатура; 
		
	КонецЕсли;
	
КонецФункции //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Процедура смартДобавитьСтрокуГарантии(НомерСтроки, МесяцевГарантии, Цена) 
	
	СтрокаГарантии = Объект.Товары.Добавить();
	СтрокаГарантии.Номенклатура = Справочники.смартПредопределенныеЗначения.НоменклатураДополнительнойГарантии.Значение;
	
	Товар = смартПолучитьНоменклатуруИзСтроки(НомерСтроки);  
	
	Цена = СтрЗаменить(Цена, " ", "");
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(
		Товар.Наименование + " - " + МесяцевГарантии + " мес. " + "(" + Товар.Код + ")"
		,
		,
		,
		СтрокаГарантии.Номенклатура.ВидНоменклатуры);
		
	Если Характеристика.Пустая() Тогда   
			
		Характеристика = смартСоздатьХарактеристикуДопГарантии(СтрокаГарантии.Номенклатура, 
			Товар.Наименование + " - " + МесяцевГарантии + " мес. " + "(" + Товар.Код + ")",
			МесяцевГарантии,
			Товар.Наименование + " - " + МесяцевГарантии + " мес.");   
			
			
		смартОбщегоНазначения.СоздатьУстановкуЦенДляДопГарантии(СтрокаГарантии.Номенклатура, Характеристика, Число(Цена), Объект.Дата);
			
	КонецЕсли;
		
	СтрокаГарантии.Характеристика = Характеристика;
	СтрокаГарантии.ВидЦены = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяRUB");
	СтрокаГарантии.КоличествоУпаковок = 1;
	СтрокаГарантии.Количество = 1;

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	КэшированныеЗначения = Новый Структура;
    КэшированныеЗначения.Вставить("ИспользоватьРучныеСкидкиВПродажах", Истина);
    КэшированныеЗначения.Вставить("ИспользоватьАвтоматическиеСкидкиВПродажах", Неопределено);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаГарантии.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаГарантии.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаГарантии, СтруктураДействий, КэшированныеЗначения); 
	
	СтрокаГарантии.Сумма = Число(Цена);
	
	СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект, 
		ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаГарантии, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Функция смартСоздатьХарактеристикуДопГарантии(Товар, НаименованиеХарактеристики, МесяцевГарантии, НаименованиеДляПечати)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	Характеристика.Владелец = Товар.ВидНоменклатуры;
	Характеристика.Наименование = НаименованиеХарактеристики;
	Характеристика.НаименованиеПолное = НаименованиеДляПечати;
	Характеристика.смартСрокГарантии = Число(МесяцевГарантии);
	Характеристика.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Характеристика.Ссылка;
	
КонецФункции //-- #1944 смарт: Мосолов 26.07.2024

//++ #1945 смарт: Лопато 06.08.2024 //Убрать видимость определенных этапов в интересе при продаже запчастей.  
&НаСервере
&ИзменениеИКонтроль("ПолучитьСписокСостоянийСервер")
Функция смарт_ПолучитьСписокСостоянийСервер(ТекСостояние)

	СписокСостояний = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_СостоянияИнтересов.Ссылка КАК Ссылка,
	|	CRM_СостоянияИнтересов.ВероятностьСделки КАК ВероятностьСделки,
	|	CRM_СостоянияИнтересов.Наименование КАК Наименование,
	|	CRM_СостоянияИнтересов.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	CRM_СостоянияИнтересов.Представление КАК Представление,
	|	CRM_СостоянияИнтересов.Завершено КАК Завершено,
	|	CRM_СостоянияИнтересов.ВидСостояния КАК ВидСостояния
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	|ГДЕ
	|	CRM_СостоянияИнтересов.ПометкаУдаления = ЛОЖЬ
	|	И CRM_СостоянияИнтересов.ВидДела = ЗНАЧЕНИЕ(Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес)
	|	И CRM_СостоянияИнтересов.Родитель = &Родитель
	|	И CRM_СостоянияИнтересов.Используется
	#Вставка
	//++ #1945 смарт: Лопато 06.08.2024 //Убрать видимость определенных этапов в интересе при продаже запчастей.  
	|	И НЕ CRM_СостоянияИнтересов.смартТипыУслуг.ТипУслуги = &ТипУслугиИнтерес
	//-- #1945 смарт: Лопато 06.08.2024
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("Родитель", ТекСостояние.Родитель);
	
	#Вставка
	//++ #1945 смарт: Лопато 06.08.2024 //Убрать видимость определенных этапов в интересе при продаже запчастей.  
	Запрос.УстановитьПараметр("ТипУслугиИнтерес", Объект.ТипУслуги);
	//-- #1945 смарт: Лопато 06.08.2024
	#КонецВставки
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТекСостояние = Неопределено Тогда
			СписокСостояний.Добавить(Выборка.Ссылка, Выборка.Представление);
		Иначе
			Если Выборка.Ссылка = ТекСостояние Тогда
				КартинкаСостояния = БиблиотекаКартинок.сфпКлиентОжидание;
			ИначеЕсли Выборка.РеквизитДопУпорядочивания<ТекСостояние.РеквизитДопУпорядочивания И НЕ Выборка.Завершено Тогда
				КартинкаСостояния = БиблиотекаКартинок.CRM_Выполнено;
			ИначеЕсли Выборка.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
				КартинкаСостояния = БиблиотекаКартинок.CRM_УспешноеЗавершение;
			ИначеЕсли Выборка.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
				КартинкаСостояния = БиблиотекаКартинок.CRM_НеудачноеЗавершение;
			Иначе
				КартинкаСостояния = Неопределено;
			КонецЕсли;
			СписокСостояний.Добавить(Выборка.Ссылка, Выборка.Представление,, КартинкаСостояния);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокСостояний;
	
КонецФункции

//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений&НаСервере
&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// +CRM_Модуль
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, СтруктураДействий);
	НаборыСервер.ЗаполнитьСлужебныеРеквизиты(ЭтаФорма);

	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());

	ДанныеВыбранногоСостоянияИнтереса = Неопределено;
	// -CRM_Модуль

	// +CRM
	Элементы.ГруппаПричинаОтказа.Видимость = (Объект.СостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение);
	CRM_СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// -CRM
	
	#Вставка
	//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений&НаСервере
	ЭтапКвалифицирован = Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000041");
	
	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение)
		И ТипЗнч(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение) = Тип("Дата")
		И ТекущаяДата() >= Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение
		И Объект.ТипУслуги = ПредопределенноеЗначение("Справочник.CRM_ТипУслуги.ПоставкаТоварыУслуги")
		И ЗначениеЗаполнено(Объект.СостояниеИнтереса)
		И Объект.СостояниеИнтереса.Родитель = Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000035")
		И Объект.СостояниеИнтереса.РеквизитДопУпорядочивания >= ?(ЗначениеЗаполнено(ЭтапКвалифицирован), ЭтапКвалифицирован.РеквизитДопУпорядочивания, 0) 
		И Объект.СостояниеИнтереса <> Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000037") 
		И Объект.СостояниеИнтереса <> Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000038") Тогда  
		
		РегистрыСведений.смартУчетСпециальныхПредложенийКлиентам.ЗаписатьНаборЗаписейПоГарантии(
			Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, СуммаСНДС"),
			Объект.Ссылка,
			Объект.Валюта);  
			
		смартСформироватьЗаголовокДополнительнойГарантии();     
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение)
		И ТипЗнч(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение) = Тип("Дата")
		И ТекущаяДата() >= Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение
		И Не Объект.Завершен
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов")
		И ЗначениеЗаполнено(Объект.ДокументОснование.ДокументОснование)
		И ЗначениеЗаполнено(Объект.ДокументОснование.ДокументОснование.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") 
		И (Объект.Дата - Объект.ДокументОснование.ДатаПодписанияАктаНаПНР) / 24/ 60 / 60 < 365 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Серия", Объект.ДокументОснование.Серия);
		Запрос.УстановитьПараметр("Заказ", Объект.ДокументОснование.ДокументОснование.ДокументОснование);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	0 КАК НомерСтроки,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Серия = &Серия
		|	И ЗаказКлиентаТовары.Ссылка = &Заказ"; 

		ТаблицаДокумента = Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, СуммаСНДС");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаТовара = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовара, Выборка);
			
		КонецЦикла;

		РегистрыСведений.смартУчетСпециальныхПредложенийКлиентам.ЗаписатьНаборЗаписейПоГарантии(ТаблицаДокумента, Объект.Ссылка, Объект.Валюта);  
		
		смартСформироватьЗаголовокДополнительнойГарантии();     
	
	КонецЕсли;
	//-- #1960 смарт: Мосолов 08.08.2024
	#КонецВставки   
	
КонецПроцедуры //-- #1960 смарт: Мосолов 08.08.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриИзменении")
Процедура смарт_ТоварыПриИзменении(Элемент)
	ОбновитьЗаголовокГруппыТовары(); 
	
	#Вставка
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.   
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024
	#КонецВставки
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

&НаСервере
&ИзменениеИКонтроль("ПроверкаЗаполнения")
//++ #Б-1020 смарт: Фролов 01.10.2024 //Запретить перевод с этапа квалифицирован далее без указания товаров в тч товары
Процедура смарт_ПроверкаЗаполнения(ПроверяемыеРеквизиты, Отказ)
	Если ЗаполнятьПервичныйИнтерес Тогда
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			НаличиеУчастников = ?(ЗначениеЗаполнено(Объект.Партнер), Истина, Ложь);
		Иначе
			НаличиеУчастников = ?(ЗначениеЗаполнено(Объект.ПотенциальныйКлиент), Истина, Ложь);
		КонецЕсли;	
		Если НаличиеУчастников Тогда
			Если ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
				Если ТипЗнч(КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
					УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"ИсточникПервичногоИнтереса");
				КонецЕсли;
			КонецЕсли;
		Иначе
			УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"КаналПервичногоИнтереса");
			УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"ИсточникПервичногоИнтереса");
		КонецЕсли;
	Иначе	
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"КаналПервичногоИнтереса");
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"ИсточникПервичногоИнтереса");
	КонецЕсли;
	Попытка
		ПредыдущийИсточник	= ПервичныйИнтерес.Получить(0);
	Исключение
		ПредыдущийИсточник	= Неопределено;
	КонецПопытки;
	Если ПредыдущийИсточник = Неопределено Тогда
		Актуальность	= Ложь;
	Иначе	
		Актуальность	= ПредыдущийИсточник.Актуальность;
	КонецЕсли;
	Если Актуальность И НЕ ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"КаналПервичногоИнтереса");
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,	"ИсточникПервичногоИнтереса");
	КонецЕсли;

	ПроверяемоеСостояния = Объект.СостояниеИнтереса;

	Если ДанныеВыбранногоСостоянияИнтереса<>Неопределено Тогда
		ВыбранноеСостояние = ?(ТипЗнч(ДанныеВыбранногоСостоянияИнтереса) = Тип("Структура"),
		ДанныеВыбранногоСостоянияИнтереса.Состояние, ДанныеВыбранногоСостоянияИнтереса);
		ПроверяемоеСостояния = ВыбранноеСостояние;
		ПроверяемыеРеквизитыВыбранноеСостояние = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПроверяемыеРеквизитыИнтересаВСостоянии(ВыбранноеСостояние);
		Для каждого Реквизит из ПроверяемыеРеквизитыВыбранноеСостояние Цикл
			Если ТипЗнч(Реквизит) = Тип("Строка") Тогда
				Если Реквизит = "Договор" И НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
					Продолжить;
				КонецЕсли;
				
				#Вставка
				//++ #Б-1020 смарт: Фролов 01.10.2024 //Запретить перевод с этапа квалифицирован далее без указания товаров в тч товары
				Если Константы.смартДатаНачалаКонтроляТоваровВИнтересе.Получить() < Объект.Дата Тогда
					
					Если Реквизит = "Товары" Тогда
						
						
						Если Объект.ТипУслуги=Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги И Объект.Товары.Итог("Сумма") = 0 Тогда
							
							
						//++ #Б-1198 смарт: Фролов 24.10.2024 //Исключение некоторых квалификаций из условий обязательного указания товаров в ТЧ товары
						Если ЗначениеЗаполнено(Объект.смартИтоговаяКвалификация) И НЕ Объект.смартИтоговаяКвалификация.НеПроверятьНаличиеТоваров Тогда
							ОбщегоНазначения.СообщитьПользователю("Для перехода на этап обязательно укажите предлагаемое оборудование!", , , , Отказ);
						КонецЕсли;
						//-- #Б-1198 смарт: Фролов 24.10.2024
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЕсли;
				//-- #Б-1020 смарт: Фролов 01.10.2024
				#КонецВставки
				
				РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти(Реквизит);
				Если РеквизитМД<>Неопределено И НЕ ЗначениеЗаполнено(Объект[Реквизит]) Тогда
					ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не заполнено поле ""%1"". Запись документа невозможна!'"), РеквизитМД.Синоним), Объект.Ссылка,"Объект."+Реквизит,, Отказ);
					Элемент = Элементы.Найти(Реквизит);
					Если Элемент <> Неопределено Тогда
						Элемент.АвтоОтметкаНезаполненного = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
			Для Каждого ОписаниеДопРеквизита из ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				Если ПроверяемыеРеквизитыВыбранноеСостояние.Найти(ОписаниеДопРеквизита.Свойство) <> Неопределено
					И НЕ ЗначениеЗаполнено(ЭтотОбъект[ОписаниеДопРеквизита.ИмяРеквизитаЗначение]) Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не заполнено поле ""%1"". Запись документа невозможна!';"), ОписаниеДопРеквизита.Наименование);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ОписаниеДопРеквизита.ИмяРеквизитаЗначение,, Отказ);
					Элемент = Элементы.Найти(ОписаниеДопРеквизита.ИмяРеквизитаЗначение);
					Если Элемент <> Неопределено Тогда
						Элемент.АвтоОтметкаНезаполненного = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПроверяемоеСостояния)
		И НЕ ПроверяемоеСостояния.РазрешитьРолевуюАдресацию
		И ТипЗнч(Объект.Ответственный) = Тип("СправочникСсылка.РолиИсполнителей") Тогда

		ШаблонСообщения = НСтр("ru = 'Для состояния %1 не разрешена ролевая адресация'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ПроверяемоеСостояния),, "Ответственный", "Объект", Отказ);

	КонецЕсли;

	Если НЕ ПроверитьЗаполнениеКлиентаКонтакта() Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры //-- #Б-1020 смарт: Фролов 01.10.2024

&НаКлиенте
//++ #Б-1170 смарт: Фролов 18.10.2024 //Сделать возможным быстрое отражение состоявшегося взаимодействия
Процедура смартПереключательСтатусаВзаимодействияПриИзменении(Элемент)
	
	Если ЭтаФорма.смартПереключательСтатусаВзаимодействия = 1 Тогда
		Элементы.БыстрыйВвод_ВзаимодействиеТема.Видимость = Истина; 
		Элементы.БыстрыйВвод_Содержание.ПодсказкаВвода = "Опишите содержание планируемого взаимодействия";
		Элементы.БыстрыйВвод_Содержание.Заголовок = "Содержание";
	Иначе
		Элементы.БыстрыйВвод_ВзаимодействиеТема.Видимость = Ложь; 
		Элементы.БыстрыйВвод_Содержание.ПодсказкаВвода = "Укажите результат прошедшего взаимодействия"; 
		Элементы.БыстрыйВвод_Содержание.Заголовок = "Результат взаимодействия";
	КонецЕсли;
	
КонецПроцедуры //-- #Б-1170 смарт: Фролов 18.10.2024

&НаСервере
&ИзменениеИКонтроль("ОбновитьЭлементыДополнительныхРеквизитов")
//++ #Б-976 смарт: Фролов 21.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ОбновитьЭлементыДополнительныхРеквизитов()

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства")
		И ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда

		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

		МассивОбъектовСДопРеквизитами = Новый Массив;

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРеквизитовКлиента");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", Клиент_Объект);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРеквизитовКонтакта");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", Контакт_Объект);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("Объект", Объект);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);

		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("CRM_УправлениеСвойствами");
		#Удаление
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, МассивОбъектовСДопРеквизитами);
		#КонецУдаления
		
		#Вставка
		//++ #1442 смарт: Фролов 04.10.2023 //Исправить добавление клиента в уже записанном Интересе (без клиента)
		//МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, МассивОбъектовСДопРеквизитами);
		//++ #1571 смарт: Мосолов 11.12.2023 //Рефакторинг. Вызов переадресован на CRM_УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов_Расширенная
		//МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, МассивОбъектовСДопРеквизитами,,Истина);
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов_Расширенная(ЭтотОбъект, МассивОбъектовСДопРеквизитами,,Истина);
		//-- #1571 смарт: Мосолов 11.12.2023
		//-- #1442 смарт: Фролов 04.10.2023
		#КонецВставки

		РазложитьДопРеквизитыПоКолонкам(МассивОбъектовСДопРеквизитами);
		ИзменитьСоставРеквизитов();
	КонецЕсли;
	// +CRM
	CRM_УправлениеСвойствами.ПослеОтрисовкиДополнительныхРеквизитов(ЭтотОбъект);
	// -CRM

КонецПроцедуры //-- #Б-Задача смарт: Фролов 21.10.2024

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
	Если НЕ Объект.Партнер.Пустая() Тогда
		
		ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
		НовыйРеквизит = Новый РеквизитФормы("АдресВременногоХранилища", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ИдентификаторЗаданияПроверкиПартнера", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭтаФорма.АдресВременногоХранилища = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
		
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(Объект.Партнер);
		ПараметрыФункции.Добавить(ЭтаФорма.АдресВременногоХранилища);
		
		ЭтаФорма.ИдентификаторЗаданияПроверкиПартнера = ФоновыеЗадания.Выполнить("смартПроверкаПартнеров.НайтиДублиПартнераПоТелефонуИПочте",
																					ПараметрыФункции).УникальныйИдентификатор;
		
	КонецЕсли;
	//-- #Б1174 смарт: Шляпников 21.10.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "Партнер");
	смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
&НаКлиенте
Процедура ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера() Экспорт
	
	ЗаданиеВыполнено = ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнераСервер();
	Если ЗаданиеВыполнено Тогда
		ОтключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера");
	КонецЕсли;
	
КонецПроцедуры

//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
&НаСервере
Функция ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнераСервер() Экспорт
	
	ПродолжатьРаботу = Ложь;
	Реквизиты = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого стрРеквизит Из Реквизиты Цикл
		Если стрРеквизит.Имя = "ИдентификаторЗаданияПроверкиПартнера" Тогда
			ПродолжатьРаботу = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПродолжатьРаботу Тогда
		Возврат Истина;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ЭтаФорма.ИдентификаторЗаданияПроверкиПартнера));
	Если Задание = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		Дубли = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилища);
		
		Если Дубли.Количество() > 0 Тогда
			
			ПолучитьСообщенияПользователю(Истина);
			
			МассивСообщений = смартПроверкаПартнеров.СформироватьМассивСообщенийПоТаблицеДублейПартнеров(Дубли);
			Для каждого стрСообщение Из МассивСообщений Цикл
				ОбщегоНазначения.СообщитьПользователю(стрСообщение.Сообщение, стрСообщение.Ключ);
			КонецЦикла;
			
		//++ #Б-1216 смарт: Фролов 01.11.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
		    Если (Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте
				ИЛИ Объект.смартПредварительнаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте)
				И Объект.смартСтатусРегистрацияПользователяНаСайте = 0 Тогда
				
				Элементы.смартПодтвердить.Видимость = Ложь;
				Элементы.смартОтклонить.Видимость = Ложь;
				
				ОбщегоНазначения.СообщитьПользователю("Найдены дубли контактной информации, указанной при регистрации. Ваши действия:
					|1. Убедитесь, что выбрали правильного клиента, с которым будет связан пользователь Интернет-магазина.
					|2. Устраните дубли контактной информации (почта, телефон) во всех объектах, связанных с другими клиентами. 
					|	После этого выбирете повторна Клиента в интересе для повторной проверки.
					|Вы можете сделать это самостоятельно, или обратиться в поддержку 1С ИТ Департамента СМАРТ-Т.");
				
			Иначе	
				
				ОбщегоНазначения.СообщитьПользователю("Необходимо оставить телефон только у одного Партнера! Иначе телефонные звонки на эти номера не будут отображаться в 1С!");
				
			КонецЕсли;
			
		ИначеЕсли (Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте
			ИЛИ Объект.смартПредварительнаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте)
			И Объект.смартСтатусРегистрацияПользователяНаСайте = 0 Тогда
			
			Элементы.смартПодтвердить.Видимость = Истина;
			Элементы.смартОтклонить.Видимость = Истина;
			
			смартПроверитьНаличиеИмеющихсяНаСайтеПользователей();
			
		//-- #Б-1316 смарт: Фролов 01.11.2024
			
		КонецЕсли;
		
		Возврат Истина;
		
	ИначеЕсли НЕ Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ПартнерПриИзменении")
Процедура смарт_ПартнерПриИзменении(Элемент)

	Если Элемент<>Неопределено Тогда
		КаналПервичногоИнтереса	= Неопределено;
		ИсточникПервичногоИнтереса	= Неопределено;
	КонецЕсли;
	ПартнерПередИзменением = Партнер;
	Партнер = Объект.Партнер;

	Если ПартнерПередИзменением <> Объект.Партнер Тогда
		
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			Если ЗначениеЗаполнено(Объект.ТипУслуги) 
				И НЕ CRM_ОбщегоНазначенияКлиент.ПроверитьВозможностьЗаписиИнтереса(Объект) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Обнаружен активный интерес клиента по выбранному типу услуги!'"));
			КонецЕсли;	
		КонецЕсли;
		СтруктураДанные = ПолучитьДанныеПартнерПриИзменении(Объект.Дата, Объект.Валюта, Объект.Партнер, Объект.Организация, Объект.Проект);

		Объект.КонтактноеЛицо = СтруктураДанные.ОсновноеКонтактноеЛицо;

		Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
			КонтактыОбработкаВыбораСервер(Объект.КонтактноеЛицо, Истина);
		КонецЕсли;		

		СформироватьОписаниеКаналаИсточника();
		ДоступностьПервичногоИнтереса();

		ОбновитьЗаголовокФормы();
		ОбновленПартнерКонтакт = Истина;

		ПартнерПриИзмененииНаСервере();

		// ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
		// Отображать не по ссылке, а по ИНН, НЕ сохраняя в кэше.
		ЭтотОбъект.ИндексыСПАРКРиски = Неопределено; // Сбросить полученные значения.
		ОбновитьОтображениеИндексыСПАРК();
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.

		// +CRM_Модуль
		ПартнерПриИзмененииСервер();

		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
			ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
		КонецЕсли;
		Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			СоглашениеПриИзменении(Элемент);
		КонецЕсли;	
		// -CRM_Модуль
		
	КонецЕсли;
	
	#Вставка
	//++ #Б-1216 смарт: Фролов 01.11.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
	ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера",1);
	
	смартПроверитьНаДублиКонтактнойИнформацииВыбранногоПартнера();
	//-- #Б-1216 смарт: Фролов 01.11.2024
	
	//++ #Б-2470 смарт: Фролов 24.02.2025 //Вывод состояния Партнера в Интересе.
	смартОтразитьСостояниеПартнера();
	//-- #Б-2470 смарт: Фролов 24.02.2025
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки

КонецПроцедуры

&НаСервере
//++ #Б-1216 смарт: Фролов 05.11.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
Процедура смартПроверитьНаличиеИмеющихсяНаСайтеПользователей()
	
	НужнаяЭлектроннаяПочта = Объект.ДокументОснование.ЭлектроннаяПочта;
	
	//++ #Б-4186 смарт: Фролов 27.08.2025 //ОШИБКА. При открытии интереса с типом - Регистрация пользователя ИМ.
	//НужныйТелефон = Объект.ДокументОснование.Телефон;
	НужныйТелефон = ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(Объект.ДокументОснование.Телефон);
	
	МожноПодтвердить = Истина;
	
	Если НЕ ЗначениеЗаполнено(НужнаяЭлектроннаяПочта) Тогда
		
		ТекстСообщения = "Не заполнена электронная почта пользователя!" + Символы.ПС;
				
		МожноПодтвердить = Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НужныйТелефон) Тогда
		
		ТекстСообщения = "Не заполнен телефон пользователя!";
		
		МожноПодтвердить = Ложь;
		
	КонецЕсли;
	
	Если НЕ МожноПодтвердить Тогда
		
		ТекстСообщения = ТекстСообщения + "Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
	
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
		Элементы.смартПодтвердить.Видимость = Ложь;
		
	Иначе	
	//-- #Б-4186 смарт: Фролов 27.08.2025
	
		МассивКонтактныхЛицИмеющихсяНаСайте = смартНайтиКонтактПоЭлПочтеИТелефону(Новый 
			Структура("НужнаяЭлектроннаяПочта, НужныйТелефон, ОтобратьИмеющиесяНаСайте", НужнаяЭлектроннаяПочта, НужныйТелефон, Истина));
			
		Если МассивКонтактныхЛицИмеющихсяНаСайте.Количество() > 1 Тогда
			
			ТекстСообщения = "Найдены пользователи с такими регисрационными 
				|данными, которые уже присутствуют в качестве пользователей Интернет-магазина. 
				|Найдено Контактные лица:";
			Для Каждого Стр Из МассивКонтактныхЛицИмеющихсяНаСайте Цикл
				ТекстСообщения = ТекстСообщения + Стр + " у Клиента " + Стр.Владелец;
			КонецЦикла;
			ТекстСообщения = ТекстСообщения + "Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Элементы.смартПодтвердить.Видимость = Ложь;
			
			МожноПодтвердить = Ложь;
			
		ИначеЕсли МассивКонтактныхЛицИмеющихсяНаСайте.Количество() = 1 Тогда	
			
			Если МассивКонтактныхЛицИмеющихсяНаСайте[0].Владелец = Объект.Партнер Тогда
				
				ТекстСообщения = "Пользователь с такими регисрационными данными уже присутствует в качестве пользователя Интернет-магазина. 
					|Найдено Контактное лицо " + МассивКонтактныхЛицИмеющихсяНаСайте[0] + " у данного Клиента." + Символы.ПС + 
					"Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
				
			Иначе	
			
				ТекстСообщения = "Пользователь с такими регисрационными данными уже присутствует в качестве пользователя Интернет-магазина. 
					|Найдено Контактное лицо " + МассивКонтактныхЛицИмеющихсяНаСайте[0] + " у Клиента " +
					МассивКонтактныхЛицИмеющихсяНаСайте[0].Владелец + "." + Символы.ПС + 
					"Дальнейшая регистрация не возможна, пожалуйста Отклоните заявку или обратитесь в поддержку 1С ИТ Департамента СМАРТ-Т.";
			
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Элементы.смартПодтвердить.Видимость = Ложь;
			
			МожноПодтвердить = Ложь;
			
		КонецЕсли;
		
	//++ #Б-4186 смарт: Фролов 27.08.2025 //ОШИБКА. При открытии интереса с типом - Регистрация пользователя ИМ.
	КонецЕсли;
	//-- #Б-4186 смарт: Фролов 27.08.2025
			
КонецПроцедуры //-- #Б-1216 смарт: Фролов 05.11.2024			

&НаСервере
//++ #Б-1216 смарт: Фролов 01.11.2024 //Регистрация в ИМ. Лид-Интерес. Выбор контактного лица.
Процедура смартПроверитьНаДублиКонтактнойИнформацииВыбранногоПартнера()
	
	Если НЕ Объект.Партнер.Пустая() И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартЛид") Тогда
			
		Если (Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте
			ИЛИ Объект.смартПредварительнаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте) Тогда
			
			Попытка
				Если Элементы.Найти("ИдентификаторЗаданияПроверкиПартнера") = Неопределено
					И Элементы.Найти("АдресВременногоХранилища") = Неопределено Тогда
					ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
					НовыйРеквизит = Новый РеквизитФормы("АдресВременногоХранилища", ОбщегоНазначения.ОписаниеТипаСтрока(100));
					ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
					НовыйРеквизит = Новый РеквизитФормы("ИдентификаторЗаданияПроверкиПартнера", ОбщегоНазначения.ОписаниеТипаСтрока(100));
					ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
					ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ЭтаФорма.АдресВременногоХранилища = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить(Объект.Партнер);
			ПараметрыФункции.Добавить(ЭтаФорма.АдресВременногоХранилища);
			ПараметрыФункции.Добавить(Объект.ДокументОснование.Телефон);
			ПараметрыФункции.Добавить(Объект.ДокументОснование.ЭлектроннаяПочта);
			
			ЭтаФорма.ИдентификаторЗаданияПроверкиПартнера = ФоновыеЗадания.Выполнить("смартПроверкаПартнеров.НайтиДублиПартнераПоТелефонуИПочте",
			ПараметрыФункции).УникальныйИдентификатор;
			
			Если Объект.ДокументОснование.ИНН <> "" Тогда
				Объект.Контрагент = CRM_Модуль_РаботаСКонтрагентами.смартНайтиКонтрагентаПоИННиКПП(
				Новый Структура("ИНН, КПП", Объект.ДокументОснование.ИНН, Объект.ДокументОснование.КПП));
				
				Если Объект.Соглашение.Контрагент <> Объект.Контрагент Тогда
					Объект.Соглашение = Неопределено;	
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры //-- #Б-1216 смарт: Фролов 01.11.2024

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПередНачаломДобавления")
//++ #Б-1690 смарт: Фролов 13.12.2024 //Доработка Интереса - при выборе товара подставлять автоматом значения.
Процедура смарт_ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Если Копирование Тогда
		НаборыКлиент.ПередУдалениемСтрокиТабличнойЧасти(ЭтаФорма, "Товары", Отказ, Истина);
		Возврат;
	КонецЕсли;

	Если ФлагРекурсии Тогда

		ФлагРекурсии = Ложь;
		Возврат;

	КонецЕсли;

	Отказ        = Истина;
	ФлагРекурсии = Истина;

	Элементы.Товары.ДобавитьСтроку();

	НоваяСтрока  = Элементы.Товары.ТекущиеДанные;
	НоваяСтрока.Склад = Объект.Склад;
	
	#Вставка
	//++ #Б-1690 смарт: Фролов 13.12.2024 //Доработка Интереса - при выборе товара подставлять автоматом значения.
	НоваяСтрока.Количество = 1;
	НоваяСтрока.КоличествоУпаковок = 1;
	НоваяСтрока.ВидЦены = смартОбщегоНазначения.ВернутьЗначениеНастройкиПредопределенногоСмарт("ВидЦеныРозничнаяUSD");
	//-- #Б-1690 смарт: Фролов 13.12.2024
	#КонецВставки
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры //-- #Б-1690 смарт: Фролов 13.12.2024

&НаКлиенте
&ИзменениеИКонтроль("БыстрыйВвод_ДатаНачалаПриИзменении")
//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Процедура смарт_БыстрыйВвод_ДатаНачалаПриИзменении(Элемент)

	Если БыстрыйВвод_ДатаНачала = НачалоДня(БыстрыйВвод_ДатаНачала) И БыстрыйВвод_КэшированноеВремя > 0 Тогда
		БыстрыйВвод_ДатаНачала = БыстрыйВвод_ДатаНачала + БыстрыйВвод_КэшированноеВремя;
		БыстрыйВвод_КэшированноеВремя = 0;
	КонецЕсли;

	Если НачалоДня(БыстрыйВвод_КэшированнаяДатаНачала) = НачалоДня(БыстрыйВвод_ДатаОкончания) Тогда
		ВремяЗавершения = БыстрыйВвод_ДатаОкончания - НачалоДня(БыстрыйВвод_ДатаОкончания);
		БыстрыйВвод_ДатаОкончания = НачалоДня(БыстрыйВвод_ДатаНачала) + ВремяЗавершения;
	КонецЕсли;

	Если БыстрыйВвод_ДатаНачала > БыстрыйВвод_ДатаОкончания Тогда

		СрокПоУмолчанию = 3600;
		Если БыстрыйВвод_ТекущийТипОбъекта = "Взаимодействие" Тогда
			СрокПоУмолчанию = 1800;
		КонецЕсли;

		БыстрыйВвод_ДатаОкончания = БыстрыйВвод_ДатаНачала + СрокПоУмолчанию;
		БыстрыйВвод_ЗадачаВариантСрока = ПредопределенноеЗначение("Перечисление.CRM_ВариантыУстановкиДаты.ЧерезЧас");
	КонецЕсли;

	БыстрыйВвод_КэшированнаяДатаНачала = БыстрыйВвод_ДатаНачала;
	ПроверитьКорректностьДатыОкончания();
	
	#Вставка
	//++ #Б-5002 смарт: Фролов 17.11.2025 //Ограничение количества планируемых взаимодействий на день.
	Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Ложь;
	//-- #Б-5002 смарт: Фролов 17.11.2025
	
	//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	Если CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Партнер, "ОсновнойМенеджер") = БыстрыйВвод_ВзаимодействиеОтправитель Тогда
		
		ПредельныйСрок = смартОбщегоНазначения.ПулучитьПредельныйСрокВзаимодействияПоПартнеру(Объект.Партнер);
		Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Заголовок = "Выбранная дата больше " 
			+ ПредельныйСрок + " дней. Взаимодействие будет согласовано РОПом.";
		Если ПредельныйСрок > 0 И БыстрыйВвод_ДатаНачала > ТекущаяДата() + 3600 * 24 * ПредельныйСрок Тогда
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Истина;
		Иначе	
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Ложь;
		КонецЕсли;
		
		//++ #Б-5042 смарт: Фролов 24.11.2025 //Ошибка. Контроль максимального срока взаимодействий только для основных менеджеров! 
		СрокМаксимальногоПланированияВзаимодействийВДнях = смартОбщегоНазначения.ПолучитьЗначениеСправочникаПредопределенныеПоНовому(
			"СрокМаксимальногоПланированияВзаимодействийВДнях");
		
		Если СрокМаксимальногоПланированияВзаимодействийВДнях > 0 
			И БыстрыйВвод_ДатаНачала > ТекущаяДата() + 3600 * 24 * СрокМаксимальногоПланированияВзаимодействийВДнях Тогда
			
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Заголовок = 
				"Нельзя планировать взаимодействия на срок более " + СрокМаксимальногоПланированияВзаимодействийВДнях + " дней!";
			
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Истина;
			БыстрыйВвод_ДатаНачала = Неопределено;
			
		КонецЕсли;
		//-- #Б-5042 смарт: Фролов 24.11.2025	
	
	КонецЕсли;
	//-- #Б-2208 смарт: Фролов 25.02.2025
		
	//++ #Б-2600 смарт: Фролов 07.03.2025 //Доработка планирования взаимодействий.
	Если ЭтаФорма.смартПереключательСтатусаВзаимодействия = 2 И НЕ НачалоДня(БыстрыйВвод_ДатаНачала) = НачалоДня(ТекущаяДата()) Тогда
		
		ЭтаФорма.смартПереключательСтатусаВзаимодействия = 1;
		смартПереключательСтатусаВзаимодействияПриИзменении(Элементы.БыстрыйВвод_ПереключательСтатусаВзаимодействия);
		
	КонецЕсли; 
	//-- #Б-2600 смарт: Фролов 07.03.2025
	#КонецВставки

КонецПроцедуры //-- #Б-2208 смарт: Фролов 25.02.2025

&НаКлиенте
//++ #Б-4170 смарт: Фролов 01.09.2025 //Загрузка в 1С аналитики по звонкам из сервиса DEERAY.
Процедура смартТаблицаDEERAYПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	//++ #Б-4854 смарт: Фролов 31.10.2025 //Вывод информации по сценариям DEERAY в интересе.
	ОчиститьТабличныйДокументРасщифровкаРазговора();
	ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = Неопределено;
	Элементы.смартПрослушатьРазговорDEERAY.Заголовок = "Прослушать разговор";
	//-- #Б-4854 смарт: Фролов 31.10.2025
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		//++ #Б-4854 смарт: Фролов 31.10.2025 //Вывод информации по сценариям DEERAY в интересе.
		смартидентификаторDeeray = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Элемент.ТекущиеДанные.смартЗвонкиDEERAYСсылка, "смартидентификаторDeeray");
			ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = Элемент.ТекущиеДанные.смартЗвонкиDEERAYСсылка;
		//Элементы.смартПрослушатьРазговорDEERAY.Заголовок = Элемент.ТекущиеДанные.смартЗвонкиDEERAYСсылка;
		
		смартВывестиДанныеРасшифровкиРазговора(смартидентификаторDeeray);
		//-- #Б-4854 смарт: Фролов 31.10.2025
		
		//++ #Б-5686 смарт: Фролов 11.02.2026 //Доработка отображения данных в 1С из DEERAY.
		//ТекстРезюме = смартОбработатьТекст(Элемент.ТекущиеДанные.смартРезюмеDEERAY);
		
		ТекстРезюме = Элемент.ТекущиеДанные.смартРезюмеDEERAY;
		ТекстРезюме = СтрЗаменить(ТекстРезюме, """", "");
		ТекстРезюме = СтрЗаменить(ТекстРезюме, Символы.ПС, "<br>");
		ТекстРезюме = СтрЗаменить(ТекстРезюме, "¶", "<br>");
		//-- #Б-5686 смарт: Фролов 11.02.2026
		
		смартРезюмеHTMLDEERAY = СтрЗаменить(СтрЗаменить(ЭтаФорма.смартРезюмеHTMLПредварительныйDEERAY, "ТекстРезюмеHTMLDEERAY", ТекстРезюме), "|", "");
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-4170 смарт: Фролов 01.09.2025

&НаКлиенте
//++ #Б-4854 смарт: Фролов 29.10.2025 //Вывод информации по сценариям DEERAY в интересе.
Процедура смартТаблицаДанныеСценариевDEERAYПриАктивизацииПоля(Элемент)
	
	ИмяКолонки = Элемент.ТекущийЭлемент.Имя;
	ИдентификаторКолонки = СтрЗаменить(ИмяКолонки, "Звонок_", "");
	
	смартРезюмеHTMLDEERAY = СтрЗаменить(СтрЗаменить(ЭтаФорма.смартРезюмеHTMLПредварительныйDEERAY, "ТекстРезюмеHTMLDEERAY", ""), "|", "");
	ОчиститьТабличныйДокументРасщифровкаРазговора();
	ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = Неопределено;
	Элементы.смартПрослушатьРазговорDEERAY.Заголовок = "Прослушать разговор";
	
	Если НЕ ИмяКолонки = ИдентификаторКолонки Тогда
		
		СтрокисмартИдентификаторыЗвонковDEERAY = ЭтаФорма.смартИдентификаторыЗвонковDEERAY.НайтиСтроки(Новый Структура("смартСценарииDEERAYИдентификатор", ИдентификаторКолонки));
		
		Если СтрокисмартИдентификаторыЗвонковDEERAY.Количество() > 0 Тогда
			
			СтрокисмартДанныеСценариевDEERAYДляОбработки = ЭтаФорма.смартДанныеСценариевDEERAYДляОбработки.НайтиСтроки(Новый Структура("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок", 
				СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок));
				
			ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок;
			//Элементы.смартПрослушатьРазговорDEERAY.Заголовок = СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок;
			
			смартидентификаторDeeray = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок, "смартидентификаторDeeray"); 
			
			смартВывестиДанныеРасшифровкиРазговора(смартидентификаторDeeray);
						
			Если СтрокисмартДанныеСценариевDEERAYДляОбработки.Количество() > 0 Тогда
				
				//++ #Б-5686 смарт: Фролов 11.02.2026 //Доработка отображения данных в 1С из DEERAY.
				//ТекстРезюме = смартОбработатьТекст(СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиРезюме);
				
				ТекстРезюме = СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиРезюме;
				ТекстРезюме = СтрЗаменить(ТекстРезюме, """", "");
				ТекстРезюме = СтрЗаменить(ТекстРезюме, Символы.ПС, "<br>");
				ТекстРезюме = СтрЗаменить(ТекстРезюме, "¶", "<br>");
				//-- #Б-5686 смарт: Фролов 11.02.2026
				
				смартРезюмеHTMLDEERAY = СтрЗаменить(СтрЗаменить(ЭтаФорма.смартРезюмеHTMLПредварительныйDEERAY, "ТекстРезюмеHTMLDEERAY", ТекстРезюме), "|", "");
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-4854 смарт: Фролов 29.10.2025

&НаСервере
//++ #Б-4854 смарт: Фролов 05.11.2025 //Вывод информации по сценариям DEERAY в интересе.
Процедура смартВывестиДанныеРасшифровкиРазговора(смартидентификаторDeeray)
	
	ИмяФайла = "" + Справочники.смартПредопределенныеЗначения.Настройки.РасположениеПапкиФайловDEERAY + смартидентификаторDeeray + ".json";
	
	Данные = смартИнтеграцияDeeray.ПолучитьДанныеJSON(ИмяФайла);
	
	Если НЕ Данные = Неопределено Тогда
		
		ВывестиТабличныйДокументРасщифровкаРазговора(Данные);
		
	КонецЕсли;
			
КонецПроцедуры //-- #Б-4854 смарт: Фролов 05.11.2025			

&НаСервере 
//++ #Б-4854 смарт: Фролов 31.10.2025 //Вывод информации по сценариям DEERAY в интересе.
Процедура ОчиститьТабличныйДокументРасщифровкаРазговора()
	
	ЭтаФорма.смартРасшифровкаРазговораDEERAY.Очистить();	
	
КонецПроцедуры //-- #Б-4854 смарт: Фролов 31.10.2025	

&НаСервере 
//++ #Б-4854 смарт: Фролов 31.10.2025 //Вывод информации по сценариям DEERAY в интересе.
Процедура ВывестиТабличныйДокументРасщифровкаРазговора(Данные)
	
	ТабДок = ЭтаФорма.смартРасшифровкаРазговораDEERAY;
	
	ТабДок.Очистить();
	
	Макет = Документы.CRM_Интерес.ПолучитьМакет("смартРасшифровкаРазговора");
		
	Если НЕ Данные = Неопределено Тогда
		
		РазделДанные = Данные.Получить("data")[0];
		
		Сообщения = РазделДанные.Получить("messages");
		
		ПредыдущийАвтор = "";
		
		Для Каждого СтрСообщения Из Сообщения Цикл
			
			АвторСообщения = СтрСообщения.Получить("author");
			АвторСообщенияИмя = АвторСообщения.Получить("name");
			МассивСообщений = СтрСообщения.Получить("sentences");
			УчастникЗвонка = СтрСообщения.Получить("originator");
			
			Если УчастникЗвонка = "customer" Тогда
				ОбластьНиз = Макет.ПолучитьОбласть("НизОператор");
			Иначе
				ОбластьНиз = Макет.ПолучитьОбласть("НизКлиент");
			КонецЕсли;	
			
			Если НЕ ПредыдущийАвтор = АвторСообщенияИмя Тогда
				
				Если НЕ ПредыдущийАвтор = "" Тогда
					ТабДок.Вывести(ОбластьНиз);
				КонецЕсли;	
				
				ОбластьРазделитель = Макет.ПолучитьОбласть("РазделительБлоков");
				ТабДок.Вывести(ОбластьРазделитель);
				
			КонецЕсли;
			
			Если УчастникЗвонка = "customer" Тогда
				
				ОбластьШапка = Макет.ПолучитьОбласть("ШапкаКлиент");
				ОбластьШапка.Параметры.Клиент = АвторСообщенияИмя;
				Если НЕ ПредыдущийАвтор = АвторСообщенияИмя Тогда
					ТабДок.Вывести(ОбластьШапка);
				КонецЕсли;	
				ОбластьСтрока = Макет.ПолучитьОбласть("ТекстКлиент");
	
			Иначе
				
				ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОператор");
				ОбластьШапка.Параметры.Оператор = АвторСообщенияИмя;
				Если НЕ ПредыдущийАвтор = АвторСообщенияИмя Тогда
					ТабДок.Вывести(ОбластьШапка);
				КонецЕсли;	
				ОбластьСтрока = Макет.ПолучитьОбласть("ТекстОператор");
				
			КонецЕсли;	
				
			ДанныеВремени = СтрСообщения.Получить("time");
			Начало = ДанныеВремени.Получить("from");
			
			Если НЕ МассивСообщений = Неопределено Тогда
				
				Для Каждого СтрМассивСообщений Из МассивСообщений Цикл
					
					ОбластьСтрока.Параметры.Текст = СтрМассивСообщений.Получить("body"); 
					ОбластьСтрока.Параметры.Начало = Начало;
					
					ТабДок.Вывести(ОбластьСтрока);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ПредыдущийАвтор = АвторСообщенияИмя;
			
		КонецЦикла;	
		
	КонецЕсли;

	Если УчастникЗвонка = "customer" Тогда
		ОбластьНиз = Макет.ПолучитьОбласть("НизКлиент");
	Иначе
		ОбластьНиз = Макет.ПолучитьОбласть("НизОператор");
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьНиз);
	
КонецПроцедуры //-- #Б-4854 смарт: Фролов 31.10.2025

&НаКлиенте
//++ #Б-4854 смарт: Фролов 31.10.2025 //Вывод информации по сценариям DEERAY в интересе.
Процедура смартПрослушатьРазговорНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок) Тогда
	
		ДанныеЗвонка = смартПолучитьДанныеДляЗвонка(ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок);
		
		Если НЕ ДанныеЗвонка = Неопределено Тогда
			
			ПараметрыЗвонка = Новый Структура("ИдентификаторЗвонка, ИдентификаторЗаписи, Ответственный, Входящий, НомерТелефона, ВнутреннийНомер, ДатаНачала, ДатаОкончания, Звонок",
				ДанныеЗвонка.сфпИдентификаторЗвонка, ДанныеЗвонка.сфпИдентификаторЗаписи, ДанныеЗвонка.Ответственный, 
				ДанныеЗвонка.Входящий, ДанныеЗвонка.АбонентКакСвязаться, ДанныеЗвонка.сфпВнутреннийНомер, ДанныеЗвонка.сфпДатаНачала, 
				ДанныеЗвонка.сфпДатаОкончания, ДанныеЗвонка.Ссылка);
			
			сфпСофтФонПроКлиент.НачатьПрослушиваниеЗаписиРазговора(ПараметрыЗвонка, ЭтаФорма, Элементы.смартПрослушатьРазговорDEERAY);
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры //-- #Б-4854 смарт: Фролов 31.10.2025

&НаСервере
//++ #Б-4854 смарт: Фролов 31.10.2025 //Вывод информации по сценариям DEERAY в интересе.
Функция смартПолучитьДанныеДляЗвонка(ОбъектЗвонка)
	
	Если НЕ ОбъектЗвонка.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	сфпИсторияЗвонков.ВнутреннийНомер КАК ВнутреннийНомер,
		|	сфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
		|	сфпИсторияЗвонков.ДатаОтвета КАК ДатаОтвета,
		|	сфпИсторияЗвонков.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.сфпИсторияЗвонков КАК сфпИсторияЗвонков
		|ГДЕ
		|	сфпИсторияЗвонков.Звонок = &Звонок
		|	И сфпИсторияЗвонков.ИдентификаторЗвонка = &ИдентификаторЗвонка");
		Запрос.УстановитьПараметр("Звонок", ОбъектЗвонка.Ссылка);
		Запрос.УстановитьПараметр("ИдентификаторЗвонка", ОбъектЗвонка.сфпИдентификаторЗвонка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда   			
			
			СтруктураНужныхДанных = Новый Структура();
			СтруктураНужныхДанных.Вставить("сфпВнутреннийНомер", Выборка.ВнутреннийНомер); 
			СтруктураНужныхДанных.Вставить("сфпДатаНачала", Выборка.ДатаНачала); 
			СтруктураНужныхДанных.Вставить("сфпДатаОтвета", Выборка.ДатаОтвета); 
			СтруктураНужныхДанных.Вставить("сфпДатаОкончания", Выборка.ДатаОкончания); 
			СтруктураНужныхДанных.Вставить("сфпИдентификаторЗвонка", ОбъектЗвонка.сфпИдентификаторЗвонка);
			СтруктураНужныхДанных.Вставить("сфпИдентификаторЗаписи", ОбъектЗвонка.сфпИдентификаторЗаписи);
			СтруктураНужныхДанных.Вставить("Ответственный", ОбъектЗвонка.Ответственный);
			СтруктураНужныхДанных.Вставить("Входящий", ОбъектЗвонка.Входящий);
			СтруктураНужныхДанных.Вставить("АбонентКакСвязаться", ОбъектЗвонка.АбонентКакСвязаться);
			СтруктураНужныхДанных.Вставить("Ссылка", ОбъектЗвонка.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураНужныхДанных;
	
КонецФункции //-- #Б-4854 смарт: Фролов 31.10.2025

&НаКлиенте
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
//++ #Б-4532 смарт: Фролов 24.02.2026 //Сделать проставление цен на товары в интересе, по текущей дате.
Процедура смарт_ТоварыНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
		
		#Вставка
		//++ #Б-4532 смарт: Фролов 24.02.2026 //Сделать проставление цен на товары в интересе, по текущей дате.
		СтруктураДействий.ЗаполнитьЦенуПродажи.Дата = ТекущаяДата();
		//-- #Б-4532 смарт: Фролов 24.02.2026
		#КонецВставки
		
	КонецЕсли;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ТекущаяСтрока.Содержание = СформироватьСодержаниеДляПечати(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика);

	РассчитатьИтоговыеПоказателиКоммерческогоПредложения(ЭтаФорма);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры //-- #Б-4532 смарт: Фролов 24.02.2026

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаКлиенте
Процедура смартМаркетинговоеМероприятиеПриИзменении(Элемент)
	
	Если НЕ ММДоступенКВыбору(Объект.смартМаркетинговоеМероприятие) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя выбирать ММ, который прикреплен уже к другому интересу",, "смартМаркетинговоеМероприятие");
		Объект.смартМаркетинговоеМероприятие = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаСервереБезКонтекста
Функция ММДоступенКВыбору(Интерес)
	
	Возврат НЕ ЗначениеЗаполнено(Интерес.смартИнтерес);
	
КонецФункции

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаКлиенте
Процедура смартПоказатьМаркетинговыеМероприятия(Команда)
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ПолучитьМассивДополнительныхМаркетинговыхМероприятий());
	
	Если Список.Количество() > 0 Тогда
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("смартПоказатьМаркетинговыеМероприятияВыбор", ЭтаФорма), Список);
						  
	КонецЕсли;
	
КонецПроцедуры

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаСервере
Функция ПолучитьМассивДополнительныхМаркетинговыхМероприятий()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МаркетинговыеМероприятияДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.смартИнтерес = &Интерес
	|	И НЕ МаркетинговыеМероприятияДокумент.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Интерес", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаКлиенте
Процедура смартПоказатьМаркетинговыеМероприятияВыбор(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранноеЗначение.Значение);
	КонецЕсли;
	
КонецПроцедуры

//++ #Б-5686 смарт: Фролов 11.02.2026 //Доработка отображения данных в 1С из DEERAY.
//&НаСервере
//++ #Б-4170 смарт: Фролов 01.09.2025 //Загрузка в 1С аналитики по звонкам из сервиса DEERAY.
//Функция смартОбработатьТекст(ИсходныйТекст)
//	
//	// Разбиваем исходный текст на блоки по двойному переносу строки
//	МассивБлоков = СтрРазделить(ИсходныйТекст, "\n*", Ложь);
//	
//	// Создаем структуру для хранения данных по каждому пункту
//	Результат = Новый Структура();
//	
//	СодержимоеБлока = "";
//	ЗаголовокБлока = "";
//	
//	//++ #Б-4854 смарт: Фролов 05.11.2025 //Вывод информации по сценариям DEERAY в интересе.
//	ТабДок = ЭтаФорма.смартТабличныйДокументРезюмеDEERAY;
//	
//	ТабДок.Очистить();
//	
//	Макет = Документы.CRM_Интерес.ПолучитьМакет("смартРасшифровкаРазговора");
//	//-- #Б-4854 смарт: Фролов 05.11.2025	
//	
//	Для Каждого ТекстовыйБлок Из МассивБлоков Цикл
//		
//		// Очищаем заголовок от цифр и точек (например, "1. ")
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "1. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "2. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "3. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "4. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "5. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "6. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "7. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "8. ", "");
//		ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "9. ", "");
//		
//		Если Прав(ТекстовыйБлок, 1) = "?" Тогда
//			ТекстовыйБлок = СтрЗаменить(ТекстовыйБлок, "?", ":");
//		КонецЕсли;	
//		
//		// Пропускаем пустые блоки
//		Если ПустаяСтрока(СокрЛП(ТекстовыйБлок)) Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		// Ищем позицию двоеточия, чтобы отделить заголовок от содержимого
//		ПозицияДвоеточия = Найти(ТекстовыйБлок, ":");
//		
//		Если ПозицияДвоеточия > 0 И Прав(ТекстовыйБлок, 1) = ":" Тогда
//			
//			Если НЕ СодержимоеБлока = ""  И НЕ ЗаголовокБлока = "" Тогда
//				
//				//++ #Б-4998 смарт: Фролов 17.11.2025 //При открытии вкладки Deeray в интересах возникает следующая ошибка.
//				УправлениеСвойствамиСлужебный.УдалитьНедопустимыеСимволы(ЗаголовокБлока);
//				//-- #Б-4998 смарт: Фролов 17.11.2025
//				
//				Результат.Вставить(ЗаголовокБлока, СодержимоеБлока);
//				ЗаголовокБлока = "";
//				СодержимоеБлока = "";
//				
//			КонецЕсли;
//			
//			ЗаголовокБлока = СокрЛП(Лев(ТекстовыйБлок, ПозицияДвоеточия - 1));
//			СодержимоеБлока = СокрЛП(Прав(ТекстовыйБлок, СтрДлина(ТекстовыйБлок) - ПозицияДвоеточия));
//			
//			
//			// Обрабатываем содержимое (убираем маркеры списка *)
//			СодержимоеБлока = СтрЗаменить(СодержимоеБлока, Символы.ПС + "* ", Символы.ПС);
//			СодержимоеБлока = СтрЗаменить(СодержимоеБлока, "* ", "");
//			ЗаголовокБлока = СтрЗаменить(ЗаголовокБлока, " ", "");
//			
//			// Добавляем в структуру
//			Если НЕ СодержимоеБлока = "" И НЕ ЗаголовокБлока = "" Тогда
//				
//				//++ #Б-4998 смарт: Фролов 17.11.2025 //При открытии вкладки Deeray в интересах возникает следующая ошибка.
//				УправлениеСвойствамиСлужебный.УдалитьНедопустимыеСимволы(ЗаголовокБлока);
//				//-- #Б-4998 смарт: Фролов 17.11.2025
//				
//				Результат.Вставить(ЗаголовокБлока, СодержимоеБлока);
//				ЗаголовокБлока = "";
//				СодержимоеБлока = "";
//				
//			КонецЕсли;
//			
//		Иначе	
//			
//			СодержимоеБлока = СодержимоеБлока + ТекстовыйБлок;	
//		
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Если НЕ СодержимоеБлока = "" И НЕ ЗаголовокБлока = "" Тогда
//		
//		//++ #Б-4998 смарт: Фролов 17.11.2025 //При открытии вкладки Deeray в интересах возникает следующая ошибка.
//		УправлениеСвойствамиСлужебный.УдалитьНедопустимыеСимволы(ЗаголовокБлока);
//		//-- #Б-4998 смарт: Фролов 17.11.2025
//		
//		Результат.Вставить(ЗаголовокБлока, СодержимоеБлока);
//		
//	КонецЕсли;
//	
//	// Формируем итоговый текст в требуемом формате
//	Заголовки = Новый Соответствие;	
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	Наименование КАК Наименование,
//	|	СинонимЗаголовка КАК СинонимЗаголовка
//	|ИЗ
//	|	Справочник.смартЗаголовкиРезюмеDEERAY
//	//++ #Б-5656 смарт: Фролов 09.02.2026 //Доработка справочников для проекта DEERAY
//	|
//	|ГДЕ
//	|	НЕ ПометкаУдаления
//	|
//	|УПОРЯДОЧИТЬ ПО
//	//|	Код УБЫВ");
//	|	Порядок");
//	//-- #Б-5656 смарт: Фролов 09.02.2026
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Заголовки.Вставить(Выборка.Наименование, Выборка.СинонимЗаголовка);
//		
//	КонецЦикла;	
//	
//	ИтоговыйТекст = "";
//		
//	Для Каждого Пункт Из Заголовки Цикл
//		
//		Если Результат.Свойство(Пункт.Ключ) Тогда
//			
//			ИтоговыйТекст = ИтоговыйТекст + "<b>" + Пункт.Значение + "</b> <br>" + Символы.ПС;
//			ИтоговыйТекст = ИтоговыйТекст + Результат[Пункт.Ключ] +"<br> <br>";
//			
//			//++ #Б-4854 смарт: Фролов 05.11.2025 //Вывод информации по сценариям DEERAY в интересе.
//			ОбластьШапкаРасшифровка = Макет.ПолучитьОбласть("ШапкаРасшифровка");
//			ОбластьШапкаРасшифровка.Параметры.ЗаголовокБлока = Пункт.Значение;
//			ТабДок.Вывести(ОбластьШапкаРасшифровка);
//			
//			ОбластьСтрокаРасшифровка = Макет.ПолучитьОбласть("СтрокаРасшифровка");
//			ОбластьСтрокаРасшифровка.Параметры.СодержимоеБлока = СтрЗаменить(Результат[Пункт.Ключ], "¶", "");
//			ТабДок.Вывести(ОбластьСтрокаРасшифровка);
//			//-- #Б-4854 смарт: Фролов 05.11.2025
//			
//		КонецЕсли;
//		
//	КонецЦикла;

//	Возврат СокрЛП(ИтоговыйТекст);
//	
//КонецФункции //-- #Б-4170 смарт: Фролов 01.09.2025
//-- #Б-5686 смарт: Фролов 11.02.2026

#КонецОбласти 
