
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор = Новый Структура("ТипОбращения", ПредопределенноеЗначение("Справочник.CRM_ТипыОбращений.Интерес"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.CRM_Интерес.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "ИнтересыКакПродажа", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти