
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)

	СуммаПотенциала = 0;

	Для Каждого Элемент Из Список Цикл
		Элемент.Выбран = Истина;
		СуммаПотенциала = СуммаПотенциала + Элемент.Потенциал;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВыбор(Команда)

	СуммаПотенциала = 0;

	Для Каждого Элемент Из Список Цикл
		Элемент.Выбран = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПотенциалВыполнить()

	Закрыть(СуммаПотенциала);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Загрузить список документов.
	ДокументыПоЗадаче = ПолучитьОбъектыПоЗадаче(Параметры.Ключ);
	ДокументыПоЗадаче.Колонки.Добавить("Потенциал");
	ДокументыПоЗадаче.Колонки.Добавить("Выбран");
	
	Для Каждого Документ Из ДокументыПоЗадаче Цикл
		ДокументСсылка = Документ.ОбъектЭтапа;
		Попытка
			Документ.Потенциал = ДокументСсылка.СуммаДокумента;
		Исключение
			ДокументыПоЗадаче.Удалить(Документ);
		КонецПопытки;
		//Если ТипЗнч(Метаданные.Документы[Строка(ТипЗнч(ДокументСсылка))].Реквизиты.Найти("СуммаДокумента")) =
		//Тип("ОбъектМетаданных") Тогда Документ.Потенциал = ДокументСсылка.СуммаДокумента;
		//КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДокументыПоЗадаче, "Список");

КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектыПоЗадаче(БизнесПроцесс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ОбъектыПоБизнесПроцессам.Объект КАК ОбъектЭтапа,
	|	CRM_ОбъектыПоБизнесПроцессам.ТочкаМаршрута КАК Этап
	|ИЗ
	|	РегистрСведений.CRM_ОбъектыПоБизнесПроцессам КАК CRM_ОбъектыПоБизнесПроцессам
	|ГДЕ
	|	CRM_ОбъектыПоБизнесПроцессам.БизнесПроцесс = &БизнесПроцесс";
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ПроцедурыОбработчикиСобытийЭлементовУправленияФормы
&НаКлиенте
Процедура ВыбранПриИзменении(Элемент)

	СуммаПотенциала = 0;

	Для Каждого Элемент Из Список Цикл
		Если Элемент.Выбран Тогда
			СуммаПотенциала = СуммаПотенциала + Элемент.Потенциал;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
