
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ШаблонРазметки = "<html><head></head><body>%1</body></html>";	
	ШаблонЭтикетка = Символы.ПС + "<div><span><a target=""_blank"" href=""%1"">%2</a></span></div>";
	
	СсылкиНаФайлы = Новый Массив;
	
	Если Не Параметры.Свойство("СсылкиНаФайлы", СсылкиНаФайлы) Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли; 
	
	ТелоДокумента = "";
	
	Для Каждого СсылкаНаФайлЭтикеток Из СсылкиНаФайлы Цикл 
		
		ГотоваяСсылка = ?(Лев(СсылкаНаФайлЭтикеток, 4) = "http", СсылкаНаФайлЭтикеток, "https://" + СсылкаНаФайлЭтикеток);
		
		ТелоДокумента = ТелоДокумента + СтрШаблон(ШаблонЭтикетка, ГотоваяСсылка, ГотоваяСсылка);	
		
	КонецЦикла;  
	
	ВебДокумент = СтрШаблон(ШаблонРазметки, ТелоДокумента);
	
КонецПроцедуры
