
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Параметры.Свойство("Оборудование") Тогда
		Возврат;
	КонецЕсли;
	
	Оборудование = Параметры.Оборудование;
	ОборудованиеТекст = Оборудование.Наименование;
	ЗаполнитьДерево();
	Количество = 1;

КонецПроцедуры

Процедура ЗаполнитьДерево()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОборудованиеТекст", ОборудованиеТекст);	
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	Ссылка
	|ПОМЕСТИТЬ Номенклатура
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	НЕ ЭтоГруппа
	|	И Наименование ПОДОБНО ""%"" + &ОборудованиеТекст + ""%""
	|;
	|ВЫБРАТЬ
	|	Документы.Номенклатура 			КАК Оборудование,
	|	Номенклатуры.Ссылка 			КАК Комплектующая,
	|	Номенклатуры.Родитель 			КАК Родитель,
	|	Номенклатуры.ВидНоменклатуры 	КАК ВидНоменклатуры,
	|	Номенклатуры.Артикул 			КАК Артикул
	|ИЗ
	|	Документ.СборкаТоваров КАК Документы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Товары КАК ДокументыТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатуры
	|		ПО
	|			Номенклатуры.Ссылка = ДокументыТовары.Номенклатура
	|	ПО
	|		ДокументыТовары.Ссылка = Документы.Ссылка	
	|ГДЕ
	|	Документы.Проведен
	|	И Документы.Номенклатура В (ВЫБРАТЬ Ссылка ИЗ Номенклатура) 
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующая)
	|ПО
	|	Оборудование
	|";
	
	ДанныеЗапросаДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ДанныеЗапросаДерево, "Дерево");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
	
	Для Каждого СтрокаКоллекции Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки = СтрокаКоллекции.ПолучитьИдентификатор();
		Элементы.Дерево.Развернуть(ИдентификаторСтроки);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура НайтиКомплектующие(Команда)
	
	ЗаполнитьДерево(); 
	КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
	
	Для Каждого СтрокаКоллекции Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки = СтрокаКоллекции.ПолучитьИдентификатор();
		Элементы.Дерево.Развернуть(ИдентификаторСтроки);
	КонецЦикла; 

	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	СтруктураПереноса = Новый Структура();
	СтруктураПереноса.Вставить("Номенклатура", Комплектующая);
	СтруктураПереноса.Вставить("Количество", Количество);
	
	Оповестить("ПоискКомплектующихПоСкладамВыборКомплектующих", СтруктураПереноса);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)

	ТекЭлемент = Элементы.Дерево.ТекущиеДанные;
	
	Если ТекЭлемент <> Неопределено тогда
		Комплектующая = ТекЭлемент.Комплектующая;
	Иначе
		Комплектующая = "";
	кОНЕЦеСЛИ;     
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТекст(Команда)
	
	ОборудованиеТекст = ПолучитьНаименованиеНом(Оборудование);	
	
КонецПроцедуры

Функция ПолучитьНаименованиеНом(Ном)
	
	Возврат Ном.Наименование;
	
КонецФункции
