#Область ПеренесеноСДоработкамиСмарт
//++#1359 смарт: Балашов 25.07.2023 //дополнительная колонка в списке с внутренним номером    
&НаСервере
Процедура смарт_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//++#1651 смарт: Лопато 17.04.2024 //Телефония. Хранение истории контактной информации пользователей  
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
		"ВЫБРАТЬ",
		"ВЫБРАТЬ
		|	сфпИсторияЗвонков.ВнутреннийНомер КАК ВнНомер,");                                       

	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
		"Документ.ТелефонныйЗвонок КАК ДокументТелефонныйЗвонок",
		"Документ.ТелефонныйЗвонок КАК ДокументТелефонныйЗвонок
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сфпИсторияЗвонков КАК сфпИсторияЗвонков
		|	ПО ДокументТелефонныйЗвонок.Ссылка = сфпИсторияЗвонков.Звонок 
		|		  И ДокументТелефонныйЗвонок.сфпИдентификаторЗвонка = сфпИсторияЗвонков.ИдентификаторЗвонка	
		|");	
	//--#1651 смарт: Лопато 17.04.2024

	//++#1359 смарт: Лопато 29.12.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ДокументТелефонныйЗвонок.АбонентКонтакт КАК АбонентКонтакт,", 
		"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДокументТелефонныйЗвонок.АбонентКонтакт) = ТИП(Справочник.Партнеры) 
		|			 И ДокументТелефонныйЗвонок.АбонентКонтакт <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) 
		|ТОГДА ДокументТелефонныйЗвонок.АбонентКонтакт 
		|ИНАЧЕ ДокументТелефонныйЗвонок.АбонентПредставление 
		|КОНЕЦ КАК АбонентКонтакт,");
    //--#1359 смарт: Лопато 29.12.2023
	
КонецПроцедуры//--#1359 смарт: Балашов 25.07.2023

//++#1359 смарт: Балашов 25.07.2023 //дополнительная колонка в списке с внутренним номером    
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	смартДобавитьЭлементыПрограммно();
КонецПроцедуры//--#1359 смарт: Балашов 25.07.2023

#КонецОбласти

#Область ДоработкиСмарт

//++#1359 смарт: Балашов 25.07.2023 //дополнительная колонка в списке с внутренним номером    
Процедура смартДобавитьЭлементыПрограммно()
	
	ЭлементПеред = Элементы.Список.ПодчиненныеЭлементы.Найти("сфпДлительностьЗвонка");
	
	НоваяКолонка = Элементы.Вставить("ВнНомер", Тип("ПолеФормы"), Элементы.Список, ЭлементПеред); 
	НоваяКолонка.Заголовок = "Вн.номер"; 
	НоваяКолонка.ПутьКДанным = "Список.ВнНомер"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ГиперссылкаЯчейки = истина;
	НоваяКолонка.ТолькоПросмотр = истина;
	НоваяКолонка.АвтоВысотаЯчейки = истина; 
КонецПроцедуры//--#1359 смарт: Балашов 25.07.2023


#КонецОбласти