
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//++ #1651 смарт: Ермаков 19.04.2024 / Телефония. Хранение истории контактной информации пользователей
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", ПараметрКоманды));
	ОткрытьФорму("РегистрСведений.смартИсторияКонтактнойИнформацииПользователей.ФормаСписка", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	//-- #1651 смарт: Ермаков 19.04.2024
	
КонецПроцедуры

#КонецОбласти