
//++ #1788 смарт: Ермаков 25.12.2024 / PerfExpert. Подготовить мониторинг в 1С
Функция PerfExpert_УзнатьПараметрыПодключения() экспорт

   Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");

   возврат новый структура
   (
      "Пользователь, Сеанс, РежимСовместимости, РежимСовместимостиИнтерфейса, РежимОткрытияФормПриложения, ВариантИнтерфейсаКлиентскогоПриложения",
      ИмяПользователя(),
      НомерСеансаИнформационнойБазы(),
       Строка(Метаданные.РежимСовместимости),
      Строка(Метаданные.РежимСовместимостиИнтерфейса),
      Строка(Настройки.РежимОткрытияФормПриложения),
      Строка(Настройки.ВариантИнтерфейсаКлиентскогоПриложения)
   );
   
КонецФункции
