
//Каратеев

//********************************************
#Область ДействияФормы

#Область ДоработкиСмарт

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияПоУмолчанию();
	
	Если Объект.Ссылка.Пустая() Тогда
		УстановитьДосупностьНаСервере();
	КонецЕсли;                        

	//++ смарт:Балашов #1358 08.06.2023
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//-- смарт:Балашов #1358 08.06.2023

	//++ смарт:ММ #026 181 01.03.2020 
	
	// Временно, для совместимости старых документов 
	// В новых документах будет заполняться только таблица ИсполнителиДемоЗал вместо реквизита ИсполнительДемоЗал  
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.ИсполнительДемоЗал) И Объект.ИсполнителиДемоЗал.Количество() = 0 Тогда
			НоваяСтрока = Объект.ИсполнителиДемоЗал.Добавить();
			НоваяСтрока.Исполнитель = Объект.ИсполнительДемоЗал;
		КонецЕсли;
	КонецЕсли;
	//Смарт {{ 677 Корнющенко 18.10.21 закомментировано
	// Заполнение таблицы "Виды работ" всеми доступными вариантами из справочника смартПредопределенныеЗначения    
    //ЗаполнитьВидыРабот()	
	//-- смарт:ММ 01.03.2020
	
	//++ смарт:ММ 10.08.2020
	НастроитьВидимостьДоступность();
	//-- смарт:ММ 10.08.2020

	//++ #Б-1984 смарт: Лопато 14.02.2025 //Заявка на маркетинговое мероприятие. Типы мероприятий. Этап 2.  
	//Закомментировал код
	////++ #Б-1474 смарт: Фролов 03.12.2024 //Доработка функционала Маркетингового мероприятия
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.демоТипыМероприятия
	//|ГДЕ
	//|	НЕ ПометкаУдаления
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Наименование");
	//Элементы.ТипМероприятия.РежимВыбораИзСписка = Истина;
	//Элементы.ТипМероприятия.СписокВыбора.ЗагрузитьЗначения(
	//	Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	////-- #Б-1474 смарт: Фролов 03.12.2024
	//-- #Б-1984 смарт: Лопато 14.02.2025
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	//++ #4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров.
	//Если Объект.Ссылка.Пустая() Тогда  
	Если Объект.Ссылка.Пустая() И Параметры.Основание = Неопределено Тогда
	//-- #4898 смарт: Тимофеева 17.11.2025
				
		Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.ПустаяСсылка");
		
		Объект.Менеджер = Пользователи.АвторизованныйПользователь();
		//++ #4174 смарт: Тимофеева 15.09.2025 / Заявка на маркетинговое мероприятие. Дополнения. Склады ДемоЗала.
		Объект.ДемоЗал = ПолучитьДемоЗалПоПользователю(Объект.Менеджер);
		//-- #4174 смарт: Тимофеева 15.09.2025
		
		//++ #Б-7258 смарт: Фролов 29.06.2026 //CRM. Конверсия демонстраций
		Объект.Менеджер = Пользователи.АвторизованныйПользователь();
		//-- #Б-7258 смарт: Фролов 29.06.2026
		
	КонецЕсли;	
		
	УстановитьДоступностьСтатуса();
										 
	УстановитьДоступностьЗаявкиПриОтмене();
	
	ОбновитьТелефоныКЛ();
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
	//++ #4174 смарт: Тимофеева 15.09.2025 / Заявка на маркетинговое мероприятие. Дополнения. Склады ДемоЗала.
	Элементы.ДемоЗал.СписокВыбора.ЗагрузитьЗначения(ПолучитьСкладыДемоЗала());	
	//-- #4174 смарт: Тимофеева 15.09.2025
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "КлиентПартнер");
	смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.КлиентПартнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров. 	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) 
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартОбучениеСотрудников") Тогда
		
		Элементы.ГруппаКомментарий.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		НовыйЭлемент = Элементы.Вставить("смартДокументОснования", Тип("ПолеФормы"), Элементы.ГруппаКомментарий, Элементы.Комментарий); 
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = "Основание";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.ПутьКданным = "Объект.ДокументОснование";
	 		
	КонецЕсли;
	//--- #4898 смарт: Тимофеева 17.11.2025
	
	//++ #Б-6882 смарт: Фролов 25.05.2026 //Оценка демонстрации. Изменить поля и видимость
	НовыйЭлемент = Элементы.Вставить("смартКомментарийКОценке", Тип("ПолеФормы"), Элементы.ГруппаУправлениеОценкой, Элементы.СброситьОценку); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Комментарий к оценке";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.МногострочныйРежим = Истина;
	НовыйЭлемент.РастягиватьПоВертикали = Истина;
	НовыйЭлемент.Высота = 7;
	НовыйЭлемент.ПутьКданным = "Объект.смартКомментарийКОценке";
	
	Элементы.ГруппаСтатус.Группировка=ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	МессивРеквизитов = Новый Массив;
	МессивРеквизитов.Добавить(Новый РеквизитФормы("смартРазрешитьРедактирование", Новый ОписаниеТипов("Булево"),, "Разрешить редактирование"));	
	
	ИзменитьРеквизиты(МессивРеквизитов);
	
	НовыйЭлемент = Элементы.Вставить("смартРазрешитьРедактирование", Тип("ПолеФормы"), Элементы.ГруппаСтатус); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Разрешить редактирование";
	НовыйЭлемент.ПутьКданным = "смартРазрешитьРедактирование";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Видимость = Пользователи.РолиДоступны("смартРазрешеноРедактироватьМаркетинговоеМероприятие");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартРазрешитьРедактированиеПриИзменении");
	//-- #Б-6882 смарт: Фролов 25.05.2026
	
	//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
	Если НЕ ЕстьИнтересСММ() Тогда
		
		Элементы.ГруппаСтатус.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		События = Новый Структура("ПриИзменении", "смартИнтересПриИзменении");
		Элемент = смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартИнтерес", "ГруппаСтатус",, 1, "Объект.смартИнтерес",, События);
		
		ПараметрыВыбораИнтереса = Новый Массив;
		ПараметрыВыбораИнтереса.Добавить(Новый ПараметрВыбора("Отбор.смартМаркетинговоеМероприятие", Документы.МаркетинговыеМероприятияДокумент.ПустаяСсылка()));
		Элемент.ПараметрыВыбора =	Новый ФиксированныйМассив(ПараметрыВыбораИнтереса);
		
	КонецЕсли;
	//-- #Б7290 смарт: Шляпников 09.07.2026
	
КонецПроцедуры
 
//++ смарт:ММ #026 181 01.03.2020 
&НаСервере
Процедура ЗаполнитьВидыРабот(Исполнитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.НомерСтроки КАК НомерСтроки,
	| 	ТЗ.ВидРаботы КАК ВидРаботы,
	//Смарт {{ 677 Корнющенко 18.10.21
	|	ТЗ.смартЗатраченноеВремя КАК смартЗатраченноеВремя,
	|	ТЗ.смартСверхурочноеВремя КАК смартСверхурочноеВремя,
	|	ВЫБОР КОГДА ТЗ.смартИсполнитель = &ПустойИсполнитель ТОГДА &Исполнитель ИНАЧЕ ТЗ.смартИсполнитель КОНЕЦ КАК смартИсполнитель
	//Смарт }} 677 Корнющенко 18.10.21
	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|  &ТЗ КАК ТЗ
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТЗ.НомерСтроки, 9999) КАК Порядок,
	|	ЕСТЬNULL(ПредопределенныеЗначения.Значение, ТЗ.ВидРаботы) КАК ВидРаботы,
	|   ВЫБОР 
	|      КОГДА ТЗ.ВидРаботы ЕСТЬ NULL
	|        ТОГДА ЛОЖЬ
	|     ИНАЧЕ ИСТИНА
	|   КОНЕЦ КАК Отметка,
	//Смарт {{ 677 Корнющенко 18.10.21
	|	ЕСТЬNULL(ТЗ.смартЗатраченноеВремя,0) КАК смартЗатраченноеВремя,
	|	ЕСТЬNULL(ТЗ.смартСверхурочноеВремя,0) КАК смартСверхурочноеВремя,
	|	ЕСТЬNULL(ТЗ.смартИсполнитель,&Исполнитель) КАК смартИсполнитель

	//Смарт }} 677 Корнющенко 18.10.21
	|ИЗ
	| 	Справочник.смартПредопределенныеЗначения.Значения КАК ПредопределенныеЗначения
	|  		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТЗ КАК ТЗ
	|  		ПО ПредопределенныеЗначения.Значение = ТЗ.ВидРаботы
	|		И (ТЗ.смартИсполнитель = &Исполнитель ИЛИ ТЗ.смартИсполнитель = &ПустойИсполнитель)
	|ГДЕ
	|	ПредопределенныеЗначения.Ссылка = &НастройкаВидыРабот
	
	|УПОРЯДОЧИТЬ ПО 
	|	ЕСТЬNULL(ТЗ.НомерСтроки, 9999),
	|	ЕСТЬNULL(ПредопределенныеЗначения.Значение, ТЗ.ВидРаботы)";
		
	Запрос.УстановитьПараметр("НастройкаВидыРабот", Справочники.смартПредопределенныеЗначения.ВидыРаботДляМаркетинговыхМероприятий);
	Запрос.УстановитьПараметр("ТЗ", Объект.ВидыРабот.Выгрузить());
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("ПустойИсполнитель", Справочники.ФизическиеЛица.ПустаяСсылка());

	
	ВидыРаботРеквизитФормы.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры //-- смарт:ММ 01.03.2020

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	ЭлементыКП = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы;

	Для Каждого ЭлементКП Из ЭлементыКП Цикл 
		
		Если ЭлементКП.Имя = "ФормаПровестиИЗакрыть" И ЭлементКП <> ЭлементыКП.Получить(0) Тогда
			Элементы.Переместить(ЭлементКП, ЭтаФорма.КоманднаяПанель, ЭлементыКП.Получить(0));
		ИначеЕсли ЭлементКП.Имя = "ФормаПровести" И ЭлементКП <> ЭлементыКП.Получить(1) Тогда
			Элементы.Переместить(ЭлементКП, ЭтаФорма.КоманднаяПанель, ЭлементыКП.Получить(1));
		ИначеЕсли ЭлементКП.Имя = "ФормаЗаписать" И ЭлементКП <> ЭлементыКП.Получить(2) Тогда
			Элементы.Переместить(ЭлементКП, ЭтаФорма.КоманднаяПанель, ЭлементыКП.Получить(2));
		ИначеЕсли ЭлементКП.Имя = "ФормаПоказатьВСписке" И ЭлементКП <> ЭлементыКП.Получить(3) Тогда
			Элементы.Переместить(ЭлементКП, ЭтаФорма.КоманднаяПанель, ЭлементыКП.Получить(3));
		КонецЕсли;
		
	КонецЦикла;	
	
	УстановитьДоступностьДатыОкончания();
	
КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

#КонецОбласти

&НаСервере 
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	
	ПерезаполнитьНаименованиеДокумента();
	
	УстановитьДосупностьНаСервере();
	
	Если Объект.Оценка <> 0 Тогда
		УдалитьНапоминание();
	КонецЕсли;
	
	// Первый в таблице будет отображаться в форме списка
	Если ТекущийОбъект.ИсполнителиДемоЗал.Количество() > 0 Тогда
		ТекущийОбъект.ИсполнительДемоЗал = ТекущийОбъект.ИсполнителиДемоЗал[0].Исполнитель;
	Иначе
		ТекущийОбъект.ИсполнительДемоЗал = Неопределено;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		 ИЛИ (Объект.Проведен И НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		 
		Если НЕ ЗначениеЗаполнено(Объект.КомментарийИнженера)
			//++ #Б-2562 смарт: Лопато 04.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
			И НЕ РольДоступна("ПолныеПрава")
			//-- #Б-2562 смарт: Лопато 04.03.2025
			И Объект.Статус <> Объект.Ссылка.Статус
			И Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена") Тогда
					 
			ОбщегоНазначения.СообщитьПользователю("Не заполнен ""Комментарий инженера""!", , "КомментарийИнженера", Объект.КомментарийИнженера, Отказ);
				
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(Объект.Комментарий) Тогда

			ОбщегоНазначения.СообщитьПользователю("Не заполнен ""Комментарий""!", , "Комментарий", Объект.Комментарий, Отказ);
			
		КонецЕсли;
			
	КонецЕсли;

	//++ #Б-2970 смарт: Лопато 07.04.2025 //Заявка на маркетинговое мероприятие. Установка оценки.  
	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта") Тогда
	
		Если Объект.смартДатаНачала > Объект.смартДатаОкончания Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Установите дату окончания не ранее даты начала!", , 
												  "смартДатаОкончания", Объект.смартДатаОкончания, Отказ);
				
		КонецЕсли;
		
		Если НЕ ЭтоАдминистраторИлиИнженерДемоЗала() Тогда
			
			Если Объект.смартДатаНачала - НачалоДня(Объект.смартДатаНачала) < (9 * 3600) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Установите время начала не ранее 09:00:00", , 
													  "смартДатаНачала", Объект.смартДатаНачала, Отказ);
				
			КонецЕсли;
			
			Если Объект.смартДатаОкончания - НачалоДня(Объект.смартДатаОкончания) > (18 * 3600) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Установите время окончания не позже 18:00:00", , 
													  "смартДатаОкончания", Объект.смартДатаОкончания, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;	

	КонецЕсли;	
	//-- #Б-2970 смарт: Лопато 07.04.2025
		
	Если НЕ смартПользователи.РольДоступнаПользователю("ПолныеПрава")
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта") Тогда
		
		Если Объект.ИсполнителиДемоЗал.Количество() = 0 Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ответственных за мероприятие", , 
															  "ИсполнителиДемоЗал", Объект.ИсполнителиДемоЗал, Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.КомуПередано) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ответственных за мероприятие", , 
															  "КомуПередано", Объект.КомуПередано, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

	//-- #Б-1982 смарт: Лопато 13.02.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДосупностьНаСервере();
	УстановитьОтсрочкаНаНеопределенныйСрок();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ПерезаполнитьНаименованиеДокумента();
	КонецЕсли;
	
	ПриОткрытииНаСервере(Отказ);
	
	//Смарт {{ 677 Корнющенко 18.10.21
	Элементы.ВидыРаботЗатраченноеВремя.ТекстПодвала = ВидыРаботРеквизитФормы.Итог("смартЗатраченноеВремя");
	Элементы.ВидыРаботСверхурочноеВремя.ТекстПодвала = ВидыРаботРеквизитФормы.Итог("смартСверхурочноеВремя");
	ЭтотОбъект.ТекущийЭлемент = ЭтотОбъект.Элементы.ТипМероприятия;
	//Смарт }} 677 Корнющенко 18.10.21

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	
	Документы.МаркетинговыеМероприятияДокумент.ОбновитьОценкуДемонстрации(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

//********************************************
#Область ЭлементыФормы

//++ смарт:ММ 10.08.2020
&НаКлиенте
Процедура смарт_ТипМероприятияПриИзмененииПосле(Элемент)
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	УстановитьДатуОкончания();
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
	НастроитьВидимостьДоступность();
	
	// Добавлен вызов этой процедуры, т.к. она не была привязана к элементу (ошибка, вероятно)
	//ТипМероприятияПриИзменении(Элемент);
	
КонецПроцедуры //-- смарт:ММ 10.08.2020


&НаКлиенте
//++ #Б-6882 смарт: Фролов 25.05.2026 //Оценка демонстрации. Изменить поля и видимость
Процедура смартРазрешитьРедактированиеПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьПодчиненныхЭлементов(Элементы.СтраницаЗаполняетсяИнженером, ЭтаФорма.смартРазрешитьРедактирование);
	//УстановитьВидимостьДоступностьПодчиненныхЭлементов(Элементы.СтраницаЗаполняетсяИнженером, ЭтаФорма.смартРазрешитьРедактирование);
	
КонецПроцедуры //-- #Б-6882 смарт: Фролов 25.05.2026

&НаКлиенте
//++ #Б-6882 смарт: Фролов 26.05.2026 //Оценка демонстрации. Изменить поля и видимость
Процедура УстановитьВидимостьДоступностьПодчиненныхЭлементов(Элемент, Доступность)
	
	Попытка
		Элемент.ТолькоПросмотр = НЕ Доступность;
		Элемент.Доступность = Доступность;
	Исключение
		
		Попытка
			Элемент.Доступность = Доступность;
		Исключение
		КонецПопытки;
		
	КонецПопытки;
	
	Попытка
		
		Для каждого стрЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
			
			Попытка
				УстановитьВидимостьДоступностьПодчиненныхЭлементов(стрЭлемент, Доступность);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры //-- #Б-6882 смарт: Фролов 26.05.2026

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	
	ПерезаполнитьНаименованиеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланПриИзменении(Элемент)
	
	ПерезаполнитьНаименованиеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПланПриИзменении(Элемент)
	
	ПерезаполнитьНаименованиеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительДемоЗалПриИзменении(Элемент)
	
	Если Объект.Менеджер = Объект.ИсполнительДемоЗал Тогда
		Сообщить("Менеджер и ответственный за установлены одиноковые", СтатусСообщения.Внимание);
		//Объект.ИсполнительДемоЗал = Справочники.ФизическиеЛица.ПустаяСсылка(); //Каратеев // Временно убрал и изменил сообщение, попросил Мараковский
	КонецЕсли;
	
КонецПроцедуры

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
//Закомментировал код
//&НаКлиенте
//Процедура ЗаявкаЗакрытаПриИзменении(Элемент)
//	
//	//++ #1884 смарт: Шляпников 14.01.2025 / Документ Маркетинговые мероприятия
//	Если НЕ смартПользователи.РольДоступнаПользователю("ПолныеПрава") Тогда
//		
//		//++ смарт:ММ #026 181 01.03.2020 
//		Если Объект.ИсполнителиДемоЗал.Количество() = 0 Тогда
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить ответственных за мероприятие",, "ИсполнителиДемоЗал");
//			//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
//			Объект.Статус = СтатусДоИзменения;
//			//-- #Б-1982 смарт: Лопато 13.02.2025
//			Возврат;
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(Объект.КомуПередано) Тогда
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить поле ""Кому передано""",, "КомуПередано");
//			//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
//			Объект.Статус = СтатусДоИзменения;
//			//-- #Б-1982 смарт: Лопато 13.02.2025
//			Возврат;
//		КонецЕсли;
//		
//	КонецЕсли;
//	//-- #1884 смарт: Шляпников 14.01.2025
//		
//	//++ 26.03.2020 - пока что убрана проверка на заполненность таблицы 
//	//Если Объект.ОборудованиеДляДемонстрацииИнженер.Количество() = 0 Тогда
//	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить оборудование",, "ОборудованиеДляДемонстрацииИнженер");
//	//	Объект.ЗаявкаЗакрыта = Ложь;
//	//	Возврат;
//	//КонецЕсли;
//	//-- смарт:ММ 01.03.2020
//	
//	//++ смарт:ММ #026 181 26.03.2020 
//	//Если Объект.ДатаНачалаФакт = Дата(1,1,1,0,0,0) И Объект.ВремяПроведенияОт = Дата(1,1,1,0,0,0) И Объект.ВремяПроведенияДо = Дата(1,1,1,0,0,0) Тогда
//	//	Сообщить("Необходимо полностью заполнить дату и время проведения демонстрации", СтатусСообщения.Внимание);
//	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаФакт) Тогда
//		Сообщить("Необходимо заполнить дату проведения демонстрации", СтатусСообщения.Внимание);
//	//-- смарт:ММ 26.03.2020
//		//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
//		Объект.Статус = СтатусДоИзменения;
//		//-- #Б-1982 смарт: Лопато 13.02.2025
//		Возврат; 
//	ИначеЕсли Объект.ОтсроченнаяЗаявка Тогда
//		Объект.ОтсроченнаяЗаявка = Ложь;
//		Объект.ДатаНачалаПлан = Объект.ДатаНачалаФакт;
//		Объект.ВремяНачалаПлан = Объект.ВремяПроведенияОт;
//		Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Заголовок = "Отложить на неопределенный срок";
//	Иначе
//		УстановитьДосупностьНаСервере();
//	КонецЕсли;
//	
//	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта") Тогда
//		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСоздатьНапоминание", ЭтотОбъект);
//		ПоказатьВопрос(Оповещение, "Создать напоминание менеджеру для оценки демонстрации?", РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
//	КонецЕсли;
//		
//КонецПроцедуры

&НаКлиенте
Процедура табОборудованиеДляДемонстрацииПриИзменении(Элемент)
	УстановитьДосупностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПартнерПриИзменении(Элемент)
	УстановитьДосупностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтложенноНаНеопределенныйСрокНажатие(Элемент)
	
	Если Объект.ОтсроченнаяЗаявка = Ложь Тогда
		Объект.ОтсроченнаяЗаявка = Истина;
	Иначе
		Объект.ОтсроченнаяЗаявка = Ложь
	КонецЕсли;
	
	УстановитьОтсрочкаНаНеопределенныйСрок();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДемоЗалПриИзменении(Элемент)
	УстановитьДосупностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СброситьОценку(Команда)
	
	СброситьОценкуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_табОборудованиеДляДемонстрацииОборудованиеНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//ОткрытьФорму("Справочник.демоОборудованиеДляДемонстрации.ФормаВыбора", Новый Структура("Отбор", Новый Структура("ДемоЗал", Объект.ДемоЗал)), Элемент);
	
     //++смарт:Белоусова 661 07.10.2021 
     ПараметрТекстЗаголовка = НСтр("ru = 'Оборудование демозала'"); 
     
     НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
     
     Отбор = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
     Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГотовностьКДемонстрации");
     Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
     Отбор.ПравоеЗначение = ПолучитьЗначенияОтбораНаСервере();
     Отбор.Использование = Истина;    
     
	 //++ #4174 смарт: Тимофеева 15.09.2025 / Заявка на маркетинговое мероприятие. Дополнения. Склады ДемоЗала.
	 Если ЗначениеЗаполнено(Объект.ДемоЗал) Тогда
		 Отбор = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДемоЗал");
		 Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		 Отбор.ПравоеЗначение = Объект.ДемоЗал;
		 Отбор.Использование = Истина;    
	 КонецЕсли;
	 //-- #4174 смарт: Тимофеева 15.09.2025
	 
	 ПараметрыФормы = Новый Структура;
	 ПараметрыФормы.Вставить("ДемоЗал", Объект.ДемоЗал);
	 ПараметрыФормы.Вставить("Заголовок", ПараметрТекстЗаголовка);
	 ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
     
     
     ОткрытьФорму("Справочник.демоОборудованиеДляДемонстрации.Формавыбора",
     ПараметрыФормы, Элемент);
	 //--смарт:Белоусова 661 07.10.2021
 КонецПроцедуры
 
 //++смарт:Белоусова 661 07.10.2021
 &НаСервере
 функция ПолучитьЗначенияОтбораНаСервере()
	 список = новый СписокЗначений;
	 список.Добавить(Перечисления.демоСтатусГотовностиОборудования.НеГотов);
	 список.Добавить(Перечисления.демоСтатусГотовностиОборудования.Списано);
	 возврат список;
 КонецФункции

&НаКлиенте
Процедура смарт_ДатаНачалаПланПриИзмененииВместо(Элемент)
	РезультатПроверки=ПроверитьДоступностьДатыМероприятия(Объект);
	Если Не РезультатПроверки.ДатаСвободна Тогда 
		Для Каждого Эл Из РезультатПроверки.Ошибки Цикл 
			Текст=НСтр("ru='На дату "+Эл.ДатаМероприятия+" оборудование "+Эл.Оборудование+" уже используется в "+Эл.Мероприятие+".
			|Укажите другую дату мероприятия.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,"Объект."+Элемент.Имя);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура смарт_ДатаНачалаФактПриИзмененииВместо(Элемент)
	//РезультатПроверки=ПроверитьДоступностьДатыМероприятия(Объект);
	//Если Не РезультатПроверки.ДатаСвободна Тогда 
	//	Для Каждого Эл Из РезультатПроверки.Ошибки Цикл 
	//		Текст=НСтр("ru='На дату "+Эл.ДатаМероприятия+" оборудование "+Эл.Оборудование+" уже используется в "+Эл.Мероприятие+".
	//		|Укажите другую дату мероприятия.'");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,"Объект."+Элемент.Имя);
	//	КонецЦикла;	
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура смарт_табОборудованиеДляДемонстрацииОборудованиеПриИзмененииВместо(Элемент)
	РезультатПроверки=ПроверитьДоступностьДатыМероприятия(Объект);
	Если Не РезультатПроверки.ДатаСвободна Тогда 
		Для Каждого Эл Из РезультатПроверки.Ошибки Цикл 
			Текст=НСтр("ru='На дату "+Эл.ДатаМероприятия+" оборудование "+Эл.Оборудование+" уже используется в "+Эл.Мероприятие+".
			|Укажите другую дату мероприятия.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,
			"Объект.табОборудованиеДляДемонстрации["+Формат(Элемент.Родитель.ТекущаяСтрока,"ЧГ=")+"].Оборудование");
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

//++ смарт:ММ #026 181 01.03.2020 
&НаКлиенте
Процедура смарт_ЗаполнитьПоЗаявкеМенеджераПосле(Команда)
	
	Если Объект.ОборудованиеДляДемонстрацииИнженер.Количество() <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьТаблицуОборудования();
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 01.03.2020

//++ смарт:ММ #026 181 01.03.2020 
&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ЗаполнитьТаблицуОборудования();		
	
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 01.03.2020

//++ смарт:ММ #026 181 01.03.2020 
&НаСервере
Процедура ЗаполнитьТаблицуОборудования()
	
	Объект.ОборудованиеДляДемонстрацииИнженер.Загрузить(Объект.табОборудованиеДляДемонстрации.Выгрузить());
	
	Модифицированность = Истина;
	
КонецПроцедуры //-- смарт:ММ 01.03.2020

&НаСервере
Функция ПроверитьДоступностьДатыМероприятия(Знач Ссылка)
	Возврат Документы.МаркетинговыеМероприятияДокумент.ПроверитьДоступностьДатыМероприятия(Объект);
КонецФункции	

//++ смарт:ММ #026 181 04.03.2020 
&НаКлиенте
Процедура смарт_ОстаткиИДоступностьТоваровПосле(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("КлючВарианта", "ОстаткиИДоступностьТоваров");
	
	Отбор = Новый Структура;
	Отбор.Вставить("Склад", Объект.ДемоЗал);
	
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Отчет.ОстаткиИДоступностьТоваров.Форма", ПараметрыОткрытия);
	
КонецПроцедуры //-- смарт:ММ 01.03.2020

&НаКлиенте
Процедура смарт_КлиентПартнерПриИзмененииПосле(Элемент)
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.КлиентПартнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаКлиенте
Процедура смартИнтересПриИзменении(Элемент)
	
	Если НЕ ИнтересДоступенКВыбору(Объект.смартИнтерес) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя выбирать интерес, который прикреплен уже к другом маркетинговому мероприятию",, "смартИнтерес");
		Объект.смартИнтерес = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаСервереБезКонтекста
Функция ИнтересДоступенКВыбору(Интерес)
	
	Возврат НЕ ЗначениеЗаполнено(Интерес.смартМаркетинговоеМероприятие);
	
КонецФункции

#КонецОбласти

//********************************************
#Область Печать

&НаКлиенте
Процедура ПечататьДокумент(Команда)
    ТабДокумент = Новый ТабличныйДокумент;
	ЗаполнитьТабДокументДляПечати(ТабДокумент, Объект.Ссылка);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("МакетЗаявкаНаДемонстрацию");
    ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "МакетЗаявкаНаДемонстрацию");
    ПечатнаяФорма.СинонимМакета = "МакетЗаявкаНаДемонстрацию";
    ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
    
    ОбластиОбъектов = Новый СписокЗначений;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
    //ТабДокумент.показать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабДокументДляПечати(ТабличныйДокумент, ОбъектСсылка)
	Документы.МаркетинговыеМероприятияДокумент.ПечатьЧерезОбщуюФорму(ТабличныйДокумент, ОбъектСсылка);
КонецПроцедуры


&НаКлиенте
//++ #Б-1474 смарт: Фролов 05.12.2024 //Доработка функционала Маркетингового мероприятия
Процедура смартРезервОборудования(Команда)
	
	ТабДокумент = Новый ТабличныйДокумент;
	смартЗаполнитьРезервОборудованияДляПечати(ТабДокумент, Объект.Ссылка);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("смартРезервОборудования");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "смартРезервОборудования");
	ПечатнаяФорма.СинонимМакета = "смартРезервОборудования";
	ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
	
	ОбластиОбъектов = Новый СписокЗначений;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры //-- #Б-1474 смарт: Фролов 05.12.2024

&НаСервере
//++ #Б-1474 смарт: Фролов 05.12.2024 //Доработка функционала Маркетингового мероприятия
Процедура смартЗаполнитьРезервОборудованияДляПечати(ТабличныйДокумент, ОбъектСсылка)
	
	//++ #Б-1988 смарт: Лопато 20.02.2025 //Заявка на маркетинговое мероприятие. Резерв оборудования. Дополнение. Этап 4.  
	//Документы.МаркетинговыеМероприятияДокумент.смартПечатьРезервОборудования(ТабличныйДокумент, ОбъектСсылка);
	МассивОборудования = Объект.табОборудованиеДляДемонстрации.Выгрузить().ВыгрузитьКолонку("Оборудование");
	
	Справочники.демоОборудованиеДляДемонстрации.смартПечатьРезервОборудования(ТабличныйДокумент, МассивОборудования); 
	//-- #Б-1988 смарт: Лопато 20.02.2025
	
КонецПроцедуры //-- #Б-1474 смарт: Фролов 05.12.2024

#КонецОбласти

//********************************************
#Область ОбщиеКоманды

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	Если Объект.Менеджер.Ссылка.Пустая() Тогда
		Объект.Менеджер = Пользователи.ТекущийПользователь();
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоПользователя() // Еще не используется
	
	ЭтотПользователь = Пользователи.ТекущийПользователь();
	Возврат ЭтотПользователь;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьНаименованиеДокумента()
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	ТочноеВремяПроведения = Объект.ТипМероприятия.Наименование;
	
	Если ЗначениеЗаполнено(Объект.смартДатаНачала) Тогда
		
		ТочноеВремяПроведения = ТочноеВремяПроведения + " на " + Формат(Объект.смартДатаНачала, "ДЛФ=DD");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.смартДатаНачала)
		И Объект.смартДатаНачала <> НачалоДня(Объект.смартДатаНачала) Тогда
		
		ТочноеВремяПроведения = ТочноеВремяПроведения + " в " + Формат(Объект.смартДатаНачала, "ДЛФ=T");
		
	КонецЕсли;
	
	//-- #Б-1982 смарт: Лопато 13.02.2025
	ВремяПроведенияОтложено = Объект.ТипМероприятия.Наименование + " требует уточнения";
	ВремяПроведения 		= ?(Объект.ОтсроченнаяЗаявка = Ложь, ТочноеВремяПроведения, ВремяПроведенияОтложено);
	
	Объект.НаименованиеМероприятия = ?(Объект.ТипМероприятия.Пустая() , Строка(""), ВремяПроведения);
	
КонецПроцедуры

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
//Закомментировал код
//&НаСервере
//Функция ПроверитьЗаявкаЗакрытаСервер() // Временно не используется
//	
//	Отказ = Объект.ЗаявкаЗакрыта;
//	
//	Если РольДоступна("ПолныеПрава") Тогда
//		Отказ = Ложь;
//	Иначе
//		Сообщить("Заявка уже закрыта, повторное закрытие заявки доступно только Администратору", СтатусСообщения.ОченьВажное);
//	КонецЕсли;
//	
//	Возврат Отказ;
//	
//КонецФункции
//-- #Б-1982 смарт: Лопато 13.02.2025

&НаСервере
Процедура УстановитьОтсрочкаНаНеопределенныйСрок()
	
	Если Объект.ОтсроченнаяЗаявка = Истина Тогда
		Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Заголовок = "Установить точную дату демонстрации";
		Элементы.ДатаНачалаПлан.Доступность = Ложь;
		Элементы.ВремяНачалаПлан.Доступность = Ложь;
		ПерезаполнитьНаименованиеДокумента();
	Иначе
		Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Заголовок = "Отложить на неопределенный срок";
		Элементы.ДатаНачалаПлан.Доступность = Истина;
		Элементы.ВремяНачалаПлан.Доступность = Истина;
		ПерезаполнитьНаименованиеДокумента();
	КонецЕсли;

КонецПроцедуры

// Начало напоминание пользователю - при закрытии заявки можно создать напоминалку пользователю, чтобы тот не забыл поставить оценку за демонстрацию
&НаКлиенте
Процедура ПослеОтветаНаВопросСоздатьНапоминание(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьНапоминаниеПользователю();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
		//Объект.Статус = ЭтотОбъект.СтатусДоИзменения;
		//-- #Б-1982 смарт: Лопато 13.02.2025
		Возврат;
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьНапоминаниеПользователю()	

	//++ #Б-2562 смарт: Лопато 04.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
	УстановитьПривилегированныйРежим(Истина);
	//-- #Б-2562 смарт: Лопато 04.03.2025
	
	НовоеНапоминание = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	НовоеНапоминание.Регистратор = Объект.Ссылка;
	НовоеНапоминание.Описание = Строка("Необходимо поставить ОЦЕНКУ " + Объект.Ссылка);
	НовоеНапоминание.Пользователь = Объект.Менеджер;
	НовоеНапоминание.Источник = Объект.Ссылка;
	НовоеНапоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
	НовоеНапоминание.ВремяСобытия = Дата(ТекущаяДата());
	НовоеНапоминание.СрокНапоминания = Дата(ТекущаяДата());
	НовоеНапоминание.ИнтервалВремениНапоминания = 300;
	НовоеНапоминание.Записать(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНапоминание()
		
	РегНапоминание = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
	РегНапоминание.Отбор.Источник.Установить(Объект.Ссылка);
	
	//++ #Б-2744 смарт: Лопато 21.03.2025 //Установка оценки в закрытом ММ  
	УстановитьПривилегированныйРежим(Истина);

	РегНапоминание.Прочитать();
	
	Для Каждого ЗаписьНапоминание Из РегНапоминание Цикл
		
		Если СтрНайти(ЗаписьНапоминание.Описание, "Необходимо поставить ОЦЕНКУ") > 0 Тогда
			РегНапоминание.Удалить(ЗаписьНапоминание);
		КонецЕсли;	
		
	КонецЦикла;	
	//-- #Б-2744 смарт: Лопато 21.03.2025
	
	РегНапоминание.Записать();
	
КонецПроцедуры
// Конец напоминание пользователю

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
//Закомментировал код
//&НаСервере
//Процедура ПереключитьЗначениеЗаявкаЗакрыта()
//	
//	Если Объект.ЗаявкаЗакрыта Тогда
//		Объект.ЗаявкаЗакрыта = Ложь;
//	Иначе
//		Объект.ЗаявкаЗакрыта = Истина;
//	КонецЕсли
//	
//КонецПроцедуры
//-- #Б-1982 смарт: Лопато 13.02.2025

#КонецОбласти

//********************************************
#Область УстановкаДоступностиИВидимости

&НаСервере
Процедура УстановитьДосупностьНаСервере()
	
	//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
	//Элементы.ГруппаЗаполнилМенеджер.Доступность 				= Ложь; 
	Элементы.ГруппаЗаполнилМенеджер.ТолькоПросмотр 				= Истина;
	//-- #6604 смарт: Тимофеева 08.05.2026
	
	//++#1219 смарт: Лопато 14.10.2022 //Невозможно посмотреть информацию по инженерам  
	//Элементы.ГруппаЗаполнилДемоЗал.Доступность 					= Ложь;
	//--#1219 смарт: Лопато 14.10.2022
	//++ смарт:ММ #026 181 01.03.2020 
	//++#1200 смарт: Лопато 30.09.2022 //Блокировать каждую вкладку отдельно  
	//Элементы.СтраницаЗаполняетсяИнженером.Доступность 			= Ложь;
	//++#1219 смарт: Лопато 14.10.2022 //Невозможно посмотреть информацию по инженерам  
	//Элементы.ГруппаДемоГоризонтальная.Доступность 				    = Ложь;
	Элементы.ГруппаДатаЗакрытия.Доступность   					    = Ложь;
	Элементы.ГруппаОтветственныеЗаМероприятие.ТолькоПросмотр        = Истина;
	//--#1219 смарт: Лопато 14.10.2022
	Элементы.ГруппаВместоГруппаЗаполнилДемоЗал.Доступность 			= Ложь;
	//--#1200 смарт: Лопато 30.09.2022
	//-- смарт:ММ 01.03.2020
	Элементы.ГруппаОценка.Доступность 							= Ложь;
	 
	//++ Смарт:  Демичев №889 28.02.2022
	//Элементы.ГруппаОборудованиеМатериалы.Доступность 			= Ложь; 
	Элементы.ГруппаОбъединениеОборудоваиеМатериалы.Доступность 			= Ложь;
	//-- Смарт:  Демичев №889 28.02.2022))
	Элементы.ДатаЗакрытияЗаявки.ТолькоПросмотр					= Истина;
	Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Доступность = Ложь;
	Элементы.СброситьОценку.Видимость 							= Ложь;
	Элементы.ДемоЗал.ТолькоПросмотр								= Истина; 
	
	//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
	Элементы.ГруппаОценкаПравоВертикаль.Видимость = НЕ ЗначениеЗаполнено(Объект.Оценка)
													ИЛИ Пользователи.РолиДоступны("смартПросмотрОценокМаркетинговыхМероприятий")
													ИЛИ Объект.ПользовательПоставилОценку = Пользователи.ТекущийПользователь();
	//-- #6604 смарт: Тимофеева 08.05.2026
	
	Если РольДоступна("ПолныеПрава")Тогда
		
		
		//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
		//Элементы.ГруппаЗаполнилМенеджер.Доступность 		= Истина; 
		Элементы.ГруппаЗаполнилМенеджер.ТолькоПросмотр 		= Ложь;
		//-- #6604 смарт: Тимофеева 08.05.2026

		//++#1219 смарт: Лопато 14.10.2022 //Невозможно посмотреть информацию по инженерам  
		//Элементы.ГруппаЗаполнилДемоЗал.Доступность 					= Истина;
		//--#1219 смарт: Лопато 14.10.2022
		//++ смарт:ММ #026 181 01.03.2020 
		//++#1200 смарт: Лопато 30.09.2022 //Блокировать каждую вкладку отдельно  
		//Элементы.СтраницаЗаполняетсяИнженером.Доступность 			= Истина;
		//++#1219 смарт: Лопато 14.10.2022 //Невозможно посмотреть информацию по инженерам  
		//Элементы.ГруппаДемоГоризонтальная.Доступность 				    = Ложь;
		Элементы.ГруппаДатаЗакрытия.Доступность   					    = Истина;
		Элементы.ГруппаОтветственныеЗаМероприятие.ТолькоПросмотр        = Ложь;
		//--#1219 смарт: Лопато 14.10.2022
		Элементы.ГруппаВместоГруппаЗаполнилДемоЗал.Доступность 			= Истина;
		//--#1200 смарт: Лопато 30.09.2022
		//-- смарт:ММ 01.03.2020
		Элементы.ГруппаОценка.Доступность 					= Истина;
		Элементы.ПользовательПоставилОценку.ТолькоПросмотр 	= Ложь;
		Элементы.ПользовательПоставилОценку.КнопкаВыбора 	= Истина;
		Элементы.ДатаОценки.ТолькоПросмотр 					= Ложь;
		Элементы.ДатаОценки.КнопкаВыбора 					= Истина;
		//++ Смарт:  Демичев №889 28.02.2022
		//Элементы.ГруппаОборудованиеМатериалы.Доступность 			= Истина; 
		Элементы.ГруппаОбъединениеОборудоваиеМатериалы.Доступность 			= Истина;
		//-- Смарт:  Демичев №889 28.02.2022))
		Элементы.ДатаЗакрытияЗаявки.Доступность				= Истина;
		Элементы.СброситьОценку.Видимость 					= Истина;
		Элементы.ДемоЗал.ТолькоПросмотр						= Ложь;
		Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Доступность = Истина;
		
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	Иначе
		
		Если Объект.ПользовательПоставилОценку.Пустая() Тогда
		
			Если Объект.ДемоЗал.Пустая() Тогда
				Элементы.ДемоЗал.ТолькоПросмотр	= Ложь;
			КонецЕсли;
			
			Если Объект.Менеджер = Пользователи.ТекущийПользователь() Тогда
				//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
				Если Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта") Тогда
				//-- #Б-1982 смарт: Лопато 13.02.2025
					Элементы.ГруппаОценка.Доступность = Истина;
				Иначе 
					//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
					//Элементы.ГруппаЗаполнилМенеджер.Доступность 		= Истина; 
					Элементы.ГруппаЗаполнилМенеджер.ТолькоПросмотр 		= Ложь;
					//-- #6604 смарт: Тимофеева 08.05.2026					
					//++ Смарт:  Демичев №889 28.02.2022
					//Элементы.ГруппаОборудованиеМатериалы.Доступность 			= Истина; 
					Элементы.ГруппаОбъединениеОборудоваиеМатериалы.Доступность 			= Истина;
					//-- Смарт:  Демичев №889 28.02.2022))
					Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Доступность = Истина;
					Элементы.ДемоЗал.ТолькоПросмотр								= Ложь;
				КонецЕсли		
			ИначеЕсли Объект.Ссылка.Пустая() Тогда
					//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
					//Элементы.ГруппаЗаполнилМенеджер.Доступность 		= Истина; 
					Элементы.ГруппаЗаполнилМенеджер.ТолькоПросмотр 		= Ложь;
					//-- #6604 смарт: Тимофеева 08.05.2026
					//++ Смарт:  Демичев №889 28.02.2022
					//Элементы.ГруппаОборудованиеМатериалы.Доступность 			= Истина; 
					Элементы.ГруппаОбъединениеОборудоваиеМатериалы.Доступность 			= Истина;
					//-- Смарт:  Демичев №889 28.02.2022))				
					Элементы.ДемоЗал.ТолькоПросмотр				= Ложь;
			КонецЕсли;
			
			Если (РольДоступна("АдминистраторДемоЗала") ИЛИ  РольДоступна("смартИнженерДемозала"))
				И НЕ Объект.Менеджер = Справочники.Пользователи.ПустаяСсылка() Тогда
				
				//++ Смарт:  Демичев №889 28.02.2022
				//Элементы.ГруппаОборудованиеМатериалы.Доступность 			= Истина; 
				Элементы.ГруппаОбъединениеОборудоваиеМатериалы.Доступность 			= Истина;
				//-- Смарт:  Демичев №889 28.02.2022))
				//++#1219 смарт: Лопато 14.10.2022 //Невозможно посмотреть информацию по инженерам  
				//Элементы.ГруппаЗаполнилДемоЗал.Доступность 					= Истина;
				//--#1219 смарт: Лопато 14.10.2022
				
				//++ смарт:ММ #026 181 01.03.2020 
				//++#1200 смарт: Лопато 30.09.2022 //Блокировать каждую вкладку отдельно  
				//Элементы.СтраницаЗаполняетсяИнженером.Доступность 			= Истина;
				//++#1219 смарт: Лопато 14.10.2022 //Невозможно посмотреть информацию по инженерам  
				//Элементы.ГруппаДемоГоризонтальная.Доступность 				    = Ложь;
				Элементы.ГруппаДатаЗакрытия.Доступность   					    = Истина;
				Элементы.ГруппаОтветственныеЗаМероприятие.ТолькоПросмотр        = Ложь;
				//--#1219 смарт: Лопато 14.10.2022
				Элементы.ГруппаВместоГруппаЗаполнилДемоЗал.Доступность 			= Истина;
				//--#1200 смарт: Лопато 30.09.2022
				Элементы.Комментарий.Доступность = Ложь;
				//-- смарт:ММ 01.03.2020
				
			КонецЕсли;
			
			//установка доступности таблицы с материалами для демонстрации
			Если Объект.табОборудованиеДляДемонстрации.Количество() > 0 Тогда
				Элементы.табМатериалыДляДемонстрации.Доступность = Истина;
			Иначе
				Элементы.табМатериалыДляДемонстрации.Доступность = Ложь;
				Объект.табМатериалыДляДемонстрации.Очистить();
			КонецЕсли;
			
			//установка доступности таблицы контактных лиц
			Если Объект.КлиентПартнер.Пустая() Тогда
				Элементы.табПредставительКлиента.Доступность = Ложь;
			Иначе
				Элементы.табПредставительКлиента.Доступность = Истина;
			КонецЕсли;

		Иначе
			
			Если РольДоступна("смартИнженерДемозала")
				ИЛИ РольДоступна("АдминистраторДемоЗала") Тогда
				Элементы.СтраницаЗаполняетсяМенеджером.Видимость = Истина;
				Для каждого Стр Из Элементы.ГруппаДатаЗакрытия.ПодчиненныеЭлементы Цикл
					Стр.Доступность = Ложь;
					Стр.ТолькоПросмотр = Истина;
				КонецЦикла;
				Для каждого Стр Из Элементы.ГруппаОтветственныеЗаМероприятие.ПодчиненныеЭлементы Цикл
					//++#1219 смарт: Лопато 19.10.2022 //Невозможно посмотреть информацию по инженерам  
					//Стр.Доступность = Ложь;
					Стр.Доступность = Истина;
					//--#1219 смарт: Лопато 19.10.2022
					Стр.ТолькоПросмотр = Истина;
				КонецЦикла;
				Для каждого Стр Из Элементы.ГруппаВидыРабот.ПодчиненныеЭлементы Цикл
					Стр.Доступность = Ложь;
					Стр.ТолькоПросмотр = Истина;
				КонецЦикла;
				Для каждого Стр Из Элементы.ГруппаОборудованиеИнженер.ПодчиненныеЭлементы Цикл
					Стр.Доступность = Ложь;
					Стр.ТолькоПросмотр = Истина;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если РольДоступна("смартИнженерДемозала")
			И НЕ РольДоступна("АдминистраторДемоЗала") Тогда
			
			Элементы.СтраницаЗаполняетсяМенеджером.ТолькоПросмотр = Истина;
			Элементы.ДекорацияОтложенноНаНеопределенныйСрок.Доступность = Ложь;
			Элементы.СброситьОценку.Видимость = Ложь;
			Для Сч = 1 По 5 Цикл
				Элементы["Звезда" + Сч].Доступность = Ложь;
			КонецЦикла;
			
		КонецЕсли;
		
		Если РольДоступна("АдминистраторДемоЗала") Тогда
			Элементы.ГруппаОценкаГоризонталь.Доступность = Истина;
			Элементы.Комментарий.Доступность = Истина;
			Элементы.ГруппаОценка.Доступность = Истина;
			Элементы.СброситьОценку.Видимость = Истина;
		КонецЕсли;
			
	КонецЕсли;
	
	// Временная мера для подсветки поля первичного заполнения
	Если Объект.ДемоЗал.Пустая() Тогда
		Элементы.ДемоЗал.ЦветФона = WebЦвета.ОранжевоКрасный;
	Иначе
		Элементы.ДемоЗал.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("АдминистраторДемоЗала") И НЕ РольДоступна("ПолныеПрава") Тогда
		
		//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
		//Элементы.ГруппаЗаполнилМенеджер.Доступность 		= Истина; 
		Элементы.ГруппаЗаполнилМенеджер.ТолькоПросмотр 		= Ложь;
		//-- #6604 смарт: Тимофеева 08.05.2026
		
		//++ #Б-2562 смарт: Лопато 04.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
		//Закомментировал код
		//Для Каждого Элемент Из Элементы.ГруппаЗаполнилМенеджер.ПодчиненныеЭлементы Цикл
		//	Элемент.Доступность = (Элемент.Имя = "табПредставительКлиента" 
		//						   ИЛИ Элемент.Имя = "ГруппаДанныеПосетителя");
		//КонецЦикла;	
		//
		//Элементы.КлиентПартнер.Доступность = Ложь;
		//
		//Элементы.Группа3.Доступность = Истина;
		//
		//Для Каждого Элемент Из Элементы.Группа3.ПодчиненныеЭлементы Цикл
		//	Элемент.Доступность = Истина;
		//КонецЦикла;	
		//-- #Б-2562 смарт: Лопато 04.03.2025
		
	КонецЕсли;	
	
	Элементы.Комментарий.АвтоОтметкаНезаполненного
		  = (Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.ПустаяСсылка")
			 ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Новая"));

	Элементы.КомментарийИнженера.АвтоОтметкаНезаполненного
		= Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена");
	//-- #Б-1982 смарт: Лопато 13.02.2025	
		
КонецПроцедуры

#КонецОбласти

//********************************************
#Область ОценкаДемонстрации

&НаКлиенте
Процедура НапомнитьПроКомментарий()
	Оповещение = Новый ОписаниеОповещения("НапомнитьПроКомментарийСообщение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "ВНИМАНИЕ! Необходимо оставить комментарий - почему оценка демонастрации не получила высший бал.", РежимДиалогаВопрос.ОК,,,"Напоминание!");
КонецПроцедуры // НапомнитьПроКомментарий()

&НаКлиенте
Процедура НапомнитьПроКомментарийСообщение(Результат, Параметры) Экспорт
	
	//++ #Б-6882 смарт: Фролов 25.05.2026 //Оценка демонстрации. Изменить поля и видимость
	//Объект.Комментарий = Строка(Объект.Комментарий + "   " + "*** ТУТ НЕОБХОДИМО ОСТАВИТЬ КОММЕНТАРИЙ К ОЦЕНКЕ ("+Объект.Оценка+") ***");
	Объект.смартКомментарийКОценке = Строка(Объект.смартКомментарийКОценке + "   " + "*** ТУТ НЕОБХОДИМО ОСТАВИТЬ КОММЕНТАРИЙ К ОЦЕНКЕ ("+Объект.Оценка+") ***");
	//-- #Б-6882 смарт: Фролов 25.05.2026
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОценку()
	
	Модифицированность = Истина;
	
	Документы.МаркетинговыеМероприятияДокумент.ОбновитьОценкуДемонстрации(Объект);

	Объект.ПользовательПоставилОценку = Пользователи.ТекущийПользователь();
	Объект.ДатаОценки = Дата(ТекущаяДата());
		
КонецПроцедуры

Процедура СброситьОценкуСервер()
	
	Объект.Оценка = 0;
	Объект.ПользовательПоставилОценку = Справочники.Пользователи.ПустаяСсылка();
	Объект.ДатаОценки = Дата(1,1,1,0,0,0);
	
	Модифицированность = Истина;
	
КонецПроцедуры

//Оценка 1
&НаКлиенте
Процедура Звезда1Нажатие(Элемент)
	Объект.Оценка 	= 1;
	ОбновитьОценку();
	НапомнитьПроКомментарий();
КонецПроцедуры

//Оценка 2
&НаКлиенте
Процедура Звезда2Нажатие(Элемент)
	Объект.Оценка 	= 2;
	ОбновитьОценку();
	НапомнитьПроКомментарий();
КонецПроцедуры

//Оценка 3
&НаКлиенте
Процедура Звезда3Нажатие(Элемент)
	Объект.Оценка 	= 3;
	ОбновитьОценку();
	НапомнитьПроКомментарий();
КонецПроцедуры

//Оценка 4
&НаКлиенте
Процедура Звезда4Нажатие(Элемент)
	Объект.Оценка 	= 4;
	ОбновитьОценку();
	НапомнитьПроКомментарий();
КонецПроцедуры

//Оценка 5
&НаКлиенте
Процедура Звезда5Нажатие(Элемент)
	Объект.Оценка 	= 5;
	ОбновитьОценку();
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЖелаемаяДатаИзготовленияПриИзмененииПосле(Элемент)
	//++ смарт:rnp #310 10.08.2020 обход ошибки обязательного заполнения невидимых реквизитов
	Объект.ДатаНачалаПлан = Объект.ЖелаемаяДатаИзготовления;
	Объект.ВремяНачалаПлан = НачалоДня(Объект.ЖелаемаяДатаИзготовления)+60*60*10;
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаСервере
Процедура смарт_ОбрабататьВидыРабот(ТекущиеДанные)
		Если ТекущиеДанные.Отметка = Истина Тогда
			нашел = ложь;
			Для каждого Стр ИЗ Объект.ВидыРабот Цикл
				Если ТекущиеДанные.ВидРаботы = Стр.ВидРаботы И (ТекущиеДанные.смартИсполнитель = Стр.смартИсполнитель ИЛИ Стр.смартИсполнитель = Справочники.ФизическиеЛица.ПустаяСсылка()) Тогда
					ЗаполнитьЗначенияСвойств(Стр,ТекущиеДанные);
					нашел=истина;
				КонецЕсли
			КонецЦикла;
			Если нашел = ложь Тогда
				аа = Объект.ВидыРабот.Добавить();
				ЗаполнитьЗначенияСвойств(аа,ТекущиеДанные);
			КонецЕсли;
		Иначе
			Для каждого Стр ИЗ Объект.ВидыРабот Цикл
				Если ТекущиеДанные.ВидРаботы = Стр.ВидРаботы И (ТекущиеДанные.смартИсполнитель = Стр.смартИсполнитель ИЛИ Стр.смартИсполнитель = Справочники.ФизическиеЛица.ПустаяСсылка()) Тогда
					Объект.ВидыРабот.Удалить(Стр);
				КонецЕсли
			КонецЦикла;
		КонецЕсли;
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_ВидыРаботПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.ВидыРабот.ТекущиеДанные;
	ТекущиеДанные2 = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено Тогда
		Структура = новый Структура;
		Структура.Вставить("Отметка",ТекущиеДанные.Отметка);
		Структура.Вставить("ВидРаботы",ТекущиеДанные.ВидРаботы);
		Структура.Вставить("смартИсполнитель",ТекущиеДанные.смартИсполнитель);
		Структура.Вставить("смартСверхурочноеВремя",ТекущиеДанные.смартСверхурочноеВремя);
		Структура.Вставить("смартЗатраченноеВремя",ТекущиеДанные.смартЗатраченноеВремя);
		смарт_ОбрабататьВидыРабот(Структура);
		Если ТекущиеДанные2 <> Неопределено Тогда
			ТекущиеДанные2.ЗатраченноеВремя = ВидыРаботРеквизитФормы.Итог("смартЗатраченноеВремя");
			ТекущиеДанные2.СверхурочноеВремя = ВидыРаботРеквизитФормы.Итог("смартСверхурочноеВремя");
		КонецЕсли;
	КонецЕсли;
	Элементы.ВидыРаботЗатраченноеВремя.ТекстПодвала = ВидыРаботРеквизитФормы.Итог("смартЗатраченноеВремя");
	Элементы.ВидыРаботСверхурочноеВремя.ТекстПодвала = ВидыРаботРеквизитФормы.Итог("смартСверхурочноеВремя");
КонецПроцедуры 

//Смарт {{ 677 Корнющенко 18.10.21
&НаСервере
Процедура ЗаполнитьОборудование(Исполнитель);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Оборудование КАК Оборудование,
	| 	ВЫБОР КОГДА ТЗ.смартИсполнитель = &ПустойИсполнитель ТОГДА &Исполнитель ИНАЧЕ ТЗ.смартИсполнитель КОНЕЦ КАК смартИсполнитель
	| ПОМЕСТИТЬ ВР_ТЗ
	|ИЗ
	|  &ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.смартИсполнитель=&Исполнитель ИЛИ ТЗ.смартИсполнитель=&ПустойИсполнитель
	|;
	|ВЫБРАТЬ
	|	ТЗ2.Оборудование КАК Оборудование,
	| 	ТЗ2.смартИсполнитель КАК смартИсполнитель
	|ИЗ
	|  ВР_ТЗ КАК ТЗ2";
		
	Запрос.УстановитьПараметр("ТЗ", Объект.ОборудованиеДляДемонстрацииИнженер.Выгрузить());
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("ПустойИсполнитель", Справочники.ФизическиеЛица.ПустаяСсылка());
	
	ОборудованиеРеквизитФормы.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_ИсполнителиДемоЗалПриАктивизацииСтрокиПосле(Элемент)
	ТекущиеДанные = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		// Заполнение таблицы "Виды работ" всеми доступными вариантами из справочника смартПредопределенныеЗначения    
		ЗаполнитьВидыРабот(ТекущиеДанные.Исполнитель);
		ЗаполнитьОборудование(ТекущиеДанные.Исполнитель);
		//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
		//Закомментировал код
		//КомментарийИнженера = ?(СокрЛП(ТекущиеДанные.смартКомментарийИнженера)<>"",ТекущиеДанные.смартКомментарийИнженера,Объект.КомментарийИнженера);
		//-- #Б-1982 смарт: Лопато 13.02.2025
	КонецЕсли;
	Элементы.ВидыРаботЗатраченноеВремя.ТекстПодвала = ВидыРаботРеквизитФормы.Итог("смартЗатраченноеВремя");
	Элементы.ВидыРаботСверхурочноеВремя.ТекстПодвала = ВидыРаботРеквизитФормы.Итог("смартСверхурочноеВремя");
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаСервере
Процедура ОбработатьОборудование(Исполнитель)
	Для каждого Стр2 Из ОборудованиеРеквизитФормы Цикл
		Если Стр2.Оборудование <> Справочники.демоОборудованиеДляДемонстрации.ПустаяСсылка() Тогда
			Нашел = Ложь;
			Для каждого Стр Из Объект.ОборудованиеДляДемонстрацииИнженер Цикл
				Если Стр.Оборудование = Стр2.Оборудование И (Стр.смартИсполнитель = Исполнитель ИЛИ Стр.смартИсполнитель = Справочники.ФизическиеЛица.ПустаяСсылка()) Тогда
					Стр.смартИсполнитель = Исполнитель;
					Нашел = Истина;	
				КонецЕсли;
			КонецЦикла;
			Если Нашел = Ложь Тогда
				аа = Объект.ОборудованиеДляДемонстрацииИнженер.Добавить();
				аа.смартИсполнитель = Исполнитель;
				аа.Оборудование = Стр2.Оборудование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_ОборудованиеРеквизитФормыПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;
	ТекущиеДанные2 = Элементы.ОборудованиеРеквизитФормы.ТекущиеДанные;
	//++ #4360 смарт: Тимофеева 24.09.2025 / Ошибка ЖР. Документ маркетинговое мероприятие
	//Если ТекущиеДанные <> Неопределено Тогда
	Если НЕ ТекущиеДанные = Неопределено И НЕ ТекущиеДанные2 = Неопределено Тогда
	//-- #4360 смарт: Тимофеева 24.09.2025
		ТекущиеДанные2.смартИсполнитель = ТекущиеДанные.Исполнитель;
	КонецЕсли;
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_ОборудованиеРеквизитФормыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;
	ТекущиеДанные2 = Элементы.ОборудованиеРеквизитФормы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбработатьОборудование(ТекущиеДанные.Исполнитель);
	КонецЕсли;
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаСервере
Процедура смарт_УдалитьОборудование(Исполнитель,Оборудование)
	Для каждого Стр Из Объект.ОборудованиеДляДемонстрацииИнженер Цикл
		Если Стр.Оборудование = Оборудование И (Стр.смартИсполнитель = Исполнитель ИЛИ Стр.смартИсполнитель = Справочники.ФизическиеЛица.ПустаяСсылка()) Тогда
			Объект.ОборудованиеДляДемонстрацииИнженер.Удалить(Стр);	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_ОборудованиеРеквизитФормыПередУдалениемПосле(Элемент, Отказ)
	ТекущиеДанные = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;
	ТекущиеДанные2 = Элементы.ОборудованиеРеквизитФормы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные2 <> Неопределено Тогда
		смарт_УдалитьОборудование(ТекущиеДанные.Исполнитель,ТекущиеДанные2.Оборудование);
	КонецЕсли;
КонецПроцедуры 

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_КомментарийИнженераПриИзмененииПосле(Элемент)
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	//Закомментировал код
	//ТекущиеДанные = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;
	//Если ТекущиеДанные <> Неопределено Тогда
	//	ТекущиеДанные.смартКомментарийИнженера = КомментарийИнженера;
	//КонецЕсли;
	//-- #Б-1982 смарт: Лопато 13.02.2025
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаСервере
Процедура смарт_ОбработатьУдалениеИсполнителя(Исполнитель)
	 Запрос = Новый Запрос;
	 Запрос.Текст="ВЫБРАТь
	 |	ТЗ.ВидРаботы КАК ВидРаботы,
	 |  ТЗ.смартЗатраченноеВремя КАК смартЗатраченноеВремя,
	 |  ТЗ.смартСверхурочноеВремя КАК смартСверхурочноеВремя,
	 |  ТЗ.смартИсполнитель КАК смартИсполнитель
	 |ПОМЕСТИТЬ ВТ_ТЗ
	 |ИЗ &ТЗ КАК ТЗ
	 |;
	 |ВЫБРАТЬ
	 |	ТЗ.ВидРаботы КАК ВидРаботы,
	 |  ТЗ.смартЗатраченноеВремя КАК смартЗатраченноеВремя,
	 |  ТЗ.смартСверхурочноеВремя КАК смартСверхурочноеВремя,
	 |  ТЗ.смартИсполнитель КАК смартИсполнитель
	 |ИЗ ВТ_ТЗ КАК ТЗ
	 |ГДЕ
	 |  НЕ ТЗ.смартИсполнитель = &Исполнитель";
	 Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	 Запрос.УстановитьПараметр("ТЗ",Объект.ВидыРабот.Выгрузить());
	 Объект.ВидыРабот.Загрузить(Запрос.Выполнить().Выгрузить());
	 
	 Запрос.Текст="ВЫБРАТь
	 |	ТЗ.Оборудование КАК Оборудование,
	 |  ТЗ.смартИсполнитель КАК смартИсполнитель
	 |ПОМЕСТИТЬ ВТ_ТЗ
	 |ИЗ &ТЗ КАК ТЗ
	 |;
	 |ВЫБРАТЬ
	 |	ТЗ.Оборудование КАК Оборудование,
	 |  ТЗ.смартИсполнитель КАК смартИсполнитель
	 |ИЗ ВТ_ТЗ КАК ТЗ
	 |ГДЕ
	 |  НЕ ТЗ.смартИсполнитель = &Исполнитель";
	 Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	 Запрос.УстановитьПараметр("ТЗ",Объект.ОборудованиеДляДемонстрацииИнженер.Выгрузить());
	 Объект.ОборудованиеДляДемонстрацииИнженер.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

//Смарт {{ 677 Корнющенко 18.10.21
&НаКлиенте
Процедура смарт_ИсполнителиДемоЗалПередУдалениемПосле(Элемент, Отказ)
	ТекущиеДанные = Элементы.ИсполнителиДемоЗал.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если Объект.ИсполнителиДемоЗал.Количество() = 1 Тогда
			Объект.ВидыРабот.Очистить();
			Объект.ОборудованиеДляДемонстрацииИнженер.Очистить();
			ВидыРаботРеквизитФормы.Очистить();
			ОборудованиеРеквизитФормы.Очистить();
		Иначе
			смарт_ОбработатьУдалениеИсполнителя(ТекущиеДанные.Исполнитель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//++ #Б-1474 смарт: Фролов 09.12.2024 //Доработка функционала Маркетингового мероприятия
Процедура смартДатаНачалаПриИзменении(Элемент)
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	Если Объект.Ссылка.Пустая()
		И Объект.смартДатаНачала < НачалоДня(ТекущаяДата()) + (9 * 3600) Тогда
		
		Объект.смартДатаНачала = НачалоДня(ТекущаяДата()) + (9 * 3600);
		
	КонецЕсли;	
	
	УстановитьДатуОкончания();
	
	ПерезаполнитьНаименованиеДокумента();
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
КонецПроцедуры //-- #Б-1474 смарт: Фролов 09.12.2024

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура смарт_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	////++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	//Если НЕ Отказ Тогда
	//	
	//	Если ТекущийОбъект.Проведен
	//		И ТекущийОбъект.ДополнительныеСвойства.Свойство("ПредыдущийСтатус")
	//		И ТекущийОбъект.Статус <> ТекущийОбъект.ДополнительныеСвойства.ПредыдущийСтатус
	//		И ТекущийОбъект.Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.ПринятаВРаботу Тогда
	//		
	//		НовоеНапоминание = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	//		
	//		НовоеНапоминание.Регистратор 					   = ТекущийОбъект.Ссылка;
	//		НовоеНапоминание.Источник 						   = ТекущийОбъект.Ссылка;
	//		НовоеНапоминание.Пользователь 					   = ТекущийОбъект.Менеджер;
	//		НовоеНапоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
	//		НовоеНапоминание.ВремяСобытия 					   = ТекущаяДатаСеанса();
	//		НовоеНапоминание.СрокНапоминания 				   = ТекущаяДатаСеанса();
	//		НовоеНапоминание.ИнтервалВремениНапоминания 	   = 300;

	//		НовоеНапоминание.Описание = "Заявка на маркетинговое мероприятие № " 
	//									+ ТекущийОбъект.Номер + " от " + Строка(ТекущийОбъект.Дата) 
	//									+ " принята в работу администратором демозала";
	//		
	//		НовоеНапоминание.Записать(Ложь);
	//		
	//	КонецЕсли;
	//		
	//КонецЕсли;
	////-- #Б-1982 смарт: Лопато 13.02.2025
	
КонецПроцедуры

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаКлиенте
Процедура смарт_СтатусПриИзмененииПосле(Элемент)
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта") Тогда

		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСоздатьНапоминание", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Создать напоминание менеджеру для оценки демонстрации?", РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);

	КонецЕсли;	

	УстановитьДосупностьНаСервере();
	
КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	Если ТекущийОбъект.Проведен Тогда

		УстановитьПривилегированныйРежим(Истина);
		
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ПредыдущийСтатус")
			И ТекущийОбъект.Статус <> ТекущийОбъект.ДополнительныеСвойства.ПредыдущийСтатус
			И (ТекущийОбъект.Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.ПринятаВРаботу
			   ИЛИ ТекущийОбъект.Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена) Тогда	
			   
			НовоеНапоминание = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
			
			НовоеНапоминание.Источник 						   = ТекущийОбъект.Ссылка;
			НовоеНапоминание.Пользователь 					   = ТекущийОбъект.Менеджер;
			НовоеНапоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
			НовоеНапоминание.ВремяСобытия 					   = ТекущаяДатаСеанса();
			НовоеНапоминание.СрокНапоминания 				   = ТекущаяДатаСеанса();
			НовоеНапоминание.ИнтервалВремениНапоминания 	   = 300;
			   
			Если ТекущийОбъект.Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.ПринятаВРаботу Тогда
				
				Описание = "Заявка на маркетинговое мероприятие № " 
						   + ТекущийОбъект.Номер + " от " + Строка(ТекущийОбъект.Дата) 
						   + " принята в работу администратором демозала";
						   
			ИначеЕсли ТекущийОбъект.Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена Тогда
				
				Описание = "Заявка на маркетинговое мероприятие № " 
						   + ТекущийОбъект.Номер + " от " + Строка(ТекущийОбъект.Дата) 
						   + " отменена администратором демозала по причине: " + СокрЛП(ТекущийОбъект.КомментарийИнженера);
				   
			КонецЕсли;
			
			НовоеНапоминание.Описание = Описание;
			
			НовоеНапоминание.Записать();

		КонецЕсли;
		
		//++ #Б-1988 смарт: Лопато 21.02.2025 //Заявка на маркетинговое мероприятие. Резерв оборудования. Дополнение. Этап 4.  
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("МассивОписанийДляНапоминаний")
			И ТекущийОбъект.ДополнительныеСвойства.МассивОписанийДляНапоминаний.Количество() > 0 Тогда
			
			ДатаСобытия = ТекущаяДатаСеанса();
			
			СписокПользователейДляУведомления 
				= Справочники.смартПредопределенныеЗначения.Настройки.ПользователиДляУведомленийПоЗаявкамНаМаркетинговыеМероприятия.ВыгрузитьКолонку("Пользователь");
				
			Для Каждого ОписаниеДляНапоминаний Из ТекущийОбъект.ДополнительныеСвойства.МассивОписанийДляНапоминаний Цикл

				ДатаСобытия = ДатаСобытия + 1;
				
				НовоеНапоминание = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
				
				НовоеНапоминание.Источник 						   = ТекущийОбъект.Ссылка;
				НовоеНапоминание.Пользователь 					   = ОписаниеДляНапоминаний.Менеджер;
				НовоеНапоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
				НовоеНапоминание.ВремяСобытия 					   = ДатаСобытия;
				НовоеНапоминание.СрокНапоминания 				   = ДатаСобытия;
				НовоеНапоминание.ИнтервалВремениНапоминания 	   = 300;
				НовоеНапоминание.Описание 						   = ОписаниеДляНапоминаний.Описание;
				
				НовоеНапоминание.Записать();
				
				Для Каждого СтрПользовательДляУведомления Из СписокПользователейДляУведомления Цикл

					ДатаСобытия = ДатаСобытия + 1;
					
					НовоеНапоминание = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();

					НовоеНапоминание.Источник 						   = ТекущийОбъект.Ссылка;
					НовоеНапоминание.Пользователь 					   = СтрПользовательДляУведомления;
					НовоеНапоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
					НовоеНапоминание.ВремяСобытия 					   = ДатаСобытия;
					НовоеНапоминание.СрокНапоминания 				   = ДатаСобытия;
					НовоеНапоминание.ИнтервалВремениНапоминания 	   = 300;
					НовоеНапоминание.Описание 						   = ОписаниеДляНапоминаний.Описание;
					
					НовоеНапоминание.Записать();
					
				КонецЦикла;
				
			КонецЦикла;	

		КонецЕсли;

		УстановитьПривилегированныйРежим(Ложь);
		//-- #Б-1988 смарт: Лопато 21.02.2025
			
	КонецЕсли;

	УстановитьДоступностьЗаявкиПриОтмене();
	
	ОбновитьТелефоныКЛ();
	
	УстановитьДоступностьСтатуса();
	//-- #Б-1982 смарт: Лопато 13.02.2025

КонецПроцедуры

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура УстановитьДоступностьЗаявкиПриОтмене()

	Если НЕ РольДоступна("ПолныеПрава")
		И Объект.Проведен
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена") Тогда
		
		Элементы.СтраницаЗаполняетсяМенеджером.ТолькоПросмотр = Истина;
		Элементы.СтраницаЗаполняетсяИнженером.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Функция ЭтоАдминистраторИлиИнженерДемоЗала()
	
	Возврат Пользователи.РолиДоступны("АдминистраторДемоЗала")
			ИЛИ Пользователи.РолиДоступны("смартИнженерДемозала"); 

КонецФункции //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Функция ПолучитьТелефонКонтактногоЛица(КонтактноеЛицо)
	
	Результат = "";
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(КонтактноеЛицо);

	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
	МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	 
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);

	КонтактнаяИнформацияТелефоны = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
									   МассивСсылок, МассивТипов, МассивВидов, ТекущаяДата());
							   
	Для Каждого СтрТелефон Из КонтактнаяИнформацияТелефоны Цикл
		
		Если ЗначениеЗаполнено(СтрТелефон.Представление) Тогда
			Возврат СтрТелефон.Представление;
		КонецЕсли;
		
	КонецЦикла;							   
		
	Возврат Результат;	
		
КонецФункции //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаКлиенте
Процедура смарт_табПредставительКлиентаКонтактныеЛицаПриИзмененииПосле(Элемент)
	
	ТекущиеДанные = Элементы.табПредставительКлиента.ТекущиеДанные;
	
	ТекущиеДанные.Телефон = ПолучитьТелефонКонтактногоЛица(ТекущиеДанные.КонтактныеЛица);
	
КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура УстановитьДоступностьДатыОкончания()

	Если НЕ ЭтоАдминистраторИлиИнженерДемоЗала() 
		 И Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.демоТипыМероприятия.Демонстрация") Тогда
		 
		Элементы.смартДатаОкончания.Доступность = Ложь;
		
	Иначе
		
		Элементы.смартДатаОкончания.Доступность = Истина;

	КонецЕсли;	

КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура УстановитьДоступностьСтатуса()
	
	Если РольДоступна("ПолныеПрава") Тогда
		
		Элементы.Статус.ТолькоПросмотр = Ложь;
		
	Иначе
		
		Если Объект.Проведен
 	   		 И (Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта")
	   	  		ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена")) Тогда
				
			Элементы.Статус.ТолькоПросмотр = Истина;
				
		Иначе
			
			Элементы.Статус.ТолькоПросмотр = НЕ ЭтоАдминистраторИлиИнженерДемоЗала();
			
		КонецЕсли;	
			
	КонецЕсли;					  

КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаКлиенте
Процедура УстановитьДатуОкончания()

	Если НЕ ЭтоАдминистраторИлиИнженерДемоЗала()
		И Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.демоТипыМероприятия.Демонстрация") Тогда
		
		Объект.смартДатаОкончания = Объект.смартДатаНачала + (2 * 3600); //+2 часа от начала
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
&НаСервере
Процедура ОбновитьТелефоныКЛ()

	Для Каждого СтрКЛ Из Объект.табПредставительКлиента Цикл
		
		СтрКл.Телефон = ПолучитьТелефонКонтактногоЛица(СтрКЛ.КонтактныеЛица);
		
	КонецЦикла;

КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

#КонецОбласти

#Область ПрочиеПроцедурыФункции

//++ #4174 смарт: Тимофеева 15.09.2025 / Заявка на маркетинговое мероприятие. Дополнения. Склады ДемоЗала.
&НаСервере
Функция ПолучитьДемоЗалПоПользователю(Пользователь)
	Результат = Справочники.Склады.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(Склады.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО Пользователи.Подразделение = Склады.Подразделение
	|			И (Склады.Родитель = &Родитель)
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь
	//++ #Б-7056 смарт: Фролов 08.06.2026 //Основной ДемоЗал в ММ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование";
	//-- #Б-7056 смарт: Фролов 08.06.2026
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Родитель", Справочники.Склады.НайтиПоНаименованию("ДемоЗалы", Истина));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	Возврат Результат;
КонецФункции	
 
&НаСервере
Функция ПолучитьСкладыДемоЗала()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование";	
	Запрос.УстановитьПараметр("Родитель", Справочники.Склады.НайтиПоНаименованию("ДемоЗалы", Истина));	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции
//-- #4174 смарт: Тимофеева 15.09.2025

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
&НаСервере
Функция ЕстьИнтересСММ()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_Интерес.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.смартМаркетинговоеМероприятие = &ММ";
	
	Запрос.УстановитьПараметр("ММ", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
Конецфункции

#КонецОбласти

