
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Оборудование") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	ЭтаФорма.Оборудование = Параметры.Оборудование;
	
	ЗаполнитьДерево();	
	ПоказатьОстатокНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоллекцияЭлементовДерева = ДанныеНоменклатураОрганизацияСкладОстаток.ПолучитьЭлементы();
	
	Для Каждого СтрокаКоллекции Из КоллекцияЭлементовДерева Цикл    
		
		ИдентификаторСтроки = СтрокаКоллекции.ПолучитьИдентификатор();
		Элементы.ДанныеНоменклатураОрганизацияСкладОстаток.Развернуть(ИдентификаторСтроки);
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
    ЗаполнитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНоменклатураОрганизацияСкладОстатокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеНоменклатураОрганизацияСкладОстаток.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекущиеДанные);
	Иначе
		ЭтаФорма.Склад = "";
		ЭтаФорма.Серия = "";
        ЭтаФорма.Номенклатура = "";
		ЭтаФорма.Организация = ""; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьОстаток(Команда)
	
	ПоказатьОстатокНаСервере();
	
    КоллекцияЭлементовДерева = ДанныеНоменклатураОрганизацияСкладОстаток.ПолучитьЭлементы();
	
	Для Каждого СтрокаКоллекции Из КоллекцияЭлементовДерева Цикл    
		
		ИдентификаторСтроки = СтрокаКоллекции.ПолучитьИдентификатор();
		Элементы.ДанныеНоменклатураОрганизацияСкладОстаток.Развернуть(ИдентификаторСтроки);
		
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Структура = Новый Структура("Склад, Серия, Номенклатура, Организация");
	ЗаполнитьЗначенияСвойств(Структура, ЭтаФорма);	
	
	Оповестить("ПоискОборудованияПоСкладамВыборОборудования", Структура, ЭтаФорма.ВладелецФормы);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьОстатокНаСервере()
	
	МассивНомеклатуры = Новый Массив();
	Для Каждого СтрокаИерархии Из ДанныеНоменклатураОстаток Цикл
		
		Если СтрокаИерархии.Отметка И СтрокаИерархии.Остаток > 0 Тогда
			МассивНомеклатуры.Добавить(СтрокаИерархии.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", МассивНомеклатуры);	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	Данные.Организация КАК Организация,
	|	Данные.Склад КАК Склад,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Серия КАК Серия,
	|	СУММА(Данные.Остаток) КАК Остаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Организация КАК Организация,
	|		Аналитики.МестоХранения КАК Склад,
	|		Аналитики.Номенклатура КАК Номенклатура,
	|		Аналитики.Серия КАК Серия,
	|		Остатки.КоличествоОстаток КАК Остаток
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(, АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК Остатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитики
	|			ПО (Аналитики.Ссылка = Остатки.АналитикаУчетаНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Организация,
	|		ТоварыКОтгрузкеОстатки.Склад,
	|		ТоварыКОтгрузкеОстатки.Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Серия,
	|		-ТоварыКОтгрузкеОстатки.ВРезервеОстаток - ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ТоварыКОтгрузкеОстатки) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Организация,
	|	Данные.Серия,
	|	Данные.Номенклатура,
	|	Данные.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(Данные.Остаток) > 0
	|ИТОГИ ПО
	|	Номенклатура,
	|	Склад";
	
	ДанныеЗапросаДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ДанныеЗапросаДерево, "ДанныеНоменклатураОрганизацияСкладОстаток");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево()
	
	ДанныеНоменклатураОстаток.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Оборудование.Родитель);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ Номенклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатуры
	|ГДЕ
	|	Ссылка В ИЕРАРХИИ(&Родитель)
	|;
	|ВЫБРАТЬ
	|	Номенклатуры.Номенклатура КАК Номенклатура,
	|	Остатки.ВНаличииОстаток 
	|		- Остатки.ВРезервеСоСкладаОстаток 
	|		- Остатки.ВРезервеПодЗаказОстаток КАК Остаток
	|ИЗ
	|	Номенклатуры КАК Номенклатуры
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
	|		,
	|		Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ Номенклатуры)
	|	) КАК Остатки
	|	ПО
	|		Остатки.Номенклатура = Номенклатуры.Номенклатура
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДанныеНоменклатураОстаток.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если НоваяСтрока.Номенклатура = Оборудование Тогда
			НоваяСтрока.Отметка = Истина;
		КонецЕсли; 
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти