
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Ссылка В (&МассивСегментовДокумента)
	|			ИЛИ ЭтоГруппа
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Пометка,
	|	Ссылка КАК Сегмент,
	|	ЭтоГруппа КАК Группа
	|ИЗ
	|	Справочник.СегментыНоменклатуры
	|ГДЕ
	|	смартИспользуетсяВПланированииПродаж
	|	И НЕ ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сегмент ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("МассивСегментовДокумента", Параметры.МассивСегментовДокумента);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
	КоллекцияЭлементовДерева.Очистить();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, РезультатЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоНаФорме(СтрокиДерева)
	
	Для Каждого ТекущаяСтрока Из СтрокиДерева Цикл
		
		ДочерниеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		
		СвернутьДеревоНаФорме(ДочерниеСтроки);
		
		Элементы.Дерево.Свернуть(ТекущаяСтрока.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	СтрокиДерева = Дерево.ПолучитьЭлементы();
	СвернутьДеревоНаФорме(СтрокиДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоНаФорме(ТаблицаФормы)
	
	ДанныеФормыДерево = ЭтаФорма[ТаблицаФормы.Имя];
	
	Для каждого СтрокаПервогоУровня Из ДанныеФормыДерево.ПолучитьЭлементы() Цикл    	
		ТаблицаФормы.Развернуть(СтрокаПервогоУровня.ПолучитьИдентификатор(), Истина);   	
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура РазвернутьДерево(Команда)
	
	РазвернутьДеревоНаФорме(Элементы.Дерево);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометкиВДеревеНаФорме(ТаблицаФормы, Пометка)
	
	Если ТипЗнч(ТаблицаФормы) = Тип("ТаблицаФормы") Тогда  	
		ДанныеФормыДерево = ЭтаФорма[ТаблицаФормы.Имя]; 	
		СтрокиДерева = ДанныеФормыДерево.ПолучитьЭлементы();		
	Иначе	
		СтрокиДерева = ТаблицаФормы; 	
	КонецЕсли;
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы(); 	
		
		СтрокаДерева.Пометка = Пометка;	
		
		Если ПодчиненныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьСнятьПометкиВДеревеНаФорме(ПодчиненныеСтроки, Пометка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	УстановитьСнятьПометкиВДеревеНаФорме(Элементы.Дерево, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнатьПометки(Команда)
	
	УстановитьСнятьПометкиВДеревеНаФорме(Элементы.Дерево, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	УстановитьСнятьПометкиВДеревеНаФорме(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокВыбранныхСегментов(ТаблицаФормы)
	
	Если ТипЗнч(ТаблицаФормы) = Тип("ТаблицаФормы") Тогда  	
		ДанныеФормыДерево = ЭтаФорма[ТаблицаФормы.Имя]; 	
		СтрокиДерева = ДанныеФормыДерево.ПолучитьЭлементы();		
	Иначе	
		СтрокиДерева = ТаблицаФормы; 	
	КонецЕсли;
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы(); 	
		
		Если НЕ СтрокаДерева.Группа И СтрокаДерева.Пометка Тогда
			СписокВыбранныхСегментов.Добавить(СтрокаДерева.Сегмент);
		КонецЕсли;	
		
		Если ПодчиненныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолучитьСписокВыбранныхСегментов(ПодчиненныеСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СписокВыбранныхСегментов.Очистить();
	
	ПолучитьСписокВыбранныхСегментов(Элементы.Дерево);
	
	Оповестить("ВыбраныСегментыДляВнесенияВПлан", СписокВыбранныхСегментов, ЭтаФорма);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


