
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Этап = ЭтаФорма.Параметры.Сценарий;
	
	ЗаполнитьВсеЭтапы(Этап);
	
	СтрокиТЗЭтапы = ТЗЭтапы.НайтиСтроки(Новый Структура("Этап", Этап));
	Элементы.ТЗЭтапы.ТекущаяСтрока = СтрокиТЗЭтапы[0].ПолучитьИдентификатор();
	
	ЗаполнитьОписаниеЭтапа(Этап);
	
КонецПроцедуры

Процедура ЗаполнитьВсеЭтапы(ТекЭтап)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов
	|ГДЕ
	|	Родитель = &Родитель
	|	И НЕ ПометкаУдаления
	|	И Используется
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания");
	Запрос.УстановитьПараметр("Родитель", ТекЭтап.Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр = ТЗЭтапы.Добавить();
		НовСтр.Этап = Выборка.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗЭтапыПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ТЗЭтапы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ТекДанные.Этап <> Этап Тогда
		
		Этап = ТекДанные.Этап;
		ЗаполнитьОписаниеЭтапа(Этап);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеЭтапа(Этап)
	
	Заголовок = "Что сделать на этапе? - Этап: " + Этап;
	ОписаниеЭтапа = Этап.смартОписаниеЭтапа.Получить();
	
КонецПроцедуры

