////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
//
////////////////////////////////////////////////////////////////////////////////

#Область ДоработкиСмарт

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
&ИзменениеИКонтроль("ПриИзменении")
Процедура смарт_ПриИзменении(Форма, Элемент, ЭтоТабличнаяЧасть)

	ЭтоТабличнаяЧасть = ЭтоТабличнаяЧасть(Элемент);

	Если ЭтоТабличнаяЧасть Тогда
		ДанныеЗаполнения = Форма.Элементы[Форма.ТекущийЭлемент.Имя].ТекущиеДанные;
		Если ДанныеЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ДанныеЗаполнения = Форма;
	КонецЕсли;

	// Если это очистка, то сбрасываем представление.
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, ЭтоТабличнаяЧасть);
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	// +CRM
	Попытка
		Если Элемент.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			Текст = СокрЛП(Элемент.ТекстРедактирования);
			Форма[ДанныеСтроки.ИмяРеквизита] = Текст;
		Иначе
			Текст = Форма[ДанныеСтроки.ИмяРеквизита];
		КонецЕсли; 
	Исключение
	КонецПопытки;
	//Текст = Элемент.ТекстРедактирования;
	// -CRM

	Если ПустаяСтрока(Текст) Тогда

		ДанныеЗаполнения[Элемент.Имя] = "";
		Если ЭтоТабличнаяЧасть Тогда
			ДанныеЗаполнения[Элемент.Имя + "Значение"] = "";
		КонецЕсли;
		ДанныеСтроки.Представление = "";
		ДанныеСтроки.Значение      = "";
		Результат = Новый Структура("ОбновитьКонтекстноеМеню, ИмяЭлементаДляРазмещения", Истина, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		Если ДанныеСтроки.ИмяЭлементаДляРазмещения <> "" Тогда
			ОбновитьКонтекстноеМеню(Форма, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		КонецЕсли;
		Возврат;

	КонецЕсли;

	// +CRM
	// Разложить строку телефона по полям
	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")
		ИЛИ ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс") Тогда
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Текст);
		ДанныеСтроки.Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		ЗначенияПолей = Новый Структура;
		ЗначенияПолей.Вставить("countryCode", СтруктураТелефона.КодСтраны);
		ЗначенияПолей.Вставить("areaCode", СтруктураТелефона.КодГорода);
		ЗначенияПолей.Вставить("number", СтруктураТелефона.НомерТелефона);
		ЗначенияПолей.Вставить("extNumber", СтруктураТелефона.Добавочный);
		ЗначенияПолей.Вставить("value", ДанныеСтроки.Представление);
		ЗначенияПолей.Вставить("comment", ДанныеСтроки.Комментарий);
		ДанныеСтроки.Значение = CRM_ОбщегоНазначенияСервер.СтруктураВСтрокуJSON(ЗначенияПолей);
		Попытка
			Форма[ДанныеСтроки.ИмяРеквизита] = ДанныеСтроки.Представление;
		Исключение
		КонецПопытки;
	Иначе
		// -CRM
		ДанныеСтроки.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Текст, ДанныеСтроки.Вид);
		ДанныеСтроки.Представление = Текст;

		Если ЭтоТабличнаяЧасть Тогда
			ДанныеЗаполнения[Элемент.Имя + "Значение"]      = ДанныеСтроки.Значение;
		КонецЕсли;
		// +CRM
	КонецЕсли;
	// -CRM

	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат = Новый Структура("ОбновитьКонтекстноеМеню, ИмяЭлементаДляРазмещения", Истина, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		ОбновитьКонтактнуюИнформациюФормы(Форма, Результат)
	КонецЕсли;

	#Вставка
	
	//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
	СтрокиКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", Элемент.Имя));
	ДанныеСтроки = ?(СтрокиКонтактнойИнформации.Количество() = 0, Неопределено, СтрокиКонтактнойИнформации[0]);
	
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") 
		И Не Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда //+-#1012 смарт: Каратеев 06.10.2022 Исправление доработки 1012 //Убрал проверку дубля email у контрагента.
		
		Текст = Элемент.ТекстРедактирования;
		
		Если ПустаяСтрока(Текст) Тогда
			Возврат;
		КонецЕсли;
		
		//++#1256 смарт: Лопато 03.06.2024 //Изменить проверку на дубли email при вводе в Контактном лице (продолжение задачи 1012)  
		Если Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая" Тогда 
			ПартнерКЛ = Форма.Объект.Владелец;
		Иначе
			ПартнерКЛ = Неопределено;
		КонецЕсли;
		
		ИтогПроверки = смартОбщегоНазначения.ПроверитьАдресЭлектроннойПочты(Текст, Форма.Объект.Ссылка, ПартнерКЛ);
		//--#1256 смарт: Лопато 03.06.2024
		
		Если ИтогПроверки.КодОшибки <> 0 Тогда

			//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
			ОчиститьСообщения();

			ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
			
			Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
				
				Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
					ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
				КонецЦикла;
				
			Иначе
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
				
			КонецЕсли;
			//-- #1152 смарт: Лопато 18.10.2024
			
			Форма[ДанныеСтроки.ИмяРеквизита] = "";
			СтрокиКонтактнойИнформации[0].Представление = "";
			СтрокиКонтактнойИнформации[0].Значение = "";
			
		КонецЕсли;
		
	ИначеЕсли ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда 
		
		Текст = Элемент.ТекстРедактирования;
		
		Если ПустаяСтрока(Текст) Тогда
			Возврат;
		КонецЕсли;
		
		//++ #1651 смарт: Лопато 18.03.2024 // Телефония. Хранение истории контактной информации пользователей
		// Для внутренних номеров отключаем проверку
		Если Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ДанныеСтроки.Вид, "смартВнутреннийНомерТелефона") Тогда
			Возврат;
		КонецЕсли;
		//-- #1651 смарт: Лопато 18.03.2024

		//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
		СтруктураПроверки = Новый Структура;
		
		СтруктураПроверки.Вставить("Значение"     , ДанныеСтроки.Значение);
		СтруктураПроверки.Вставить("Представление", ДанныеСтроки.Представление);
		СтруктураПроверки.Вставить("Ссылка"       , Форма.Объект.Ссылка);

		Если Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая"
			ИЛИ Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.ФормаЭлемента" Тогда 

			СтруктураПроверки.Вставить("Владелец", Форма.Объект.Владелец);
			
		ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
			
			СтруктураПроверки.Вставить("Владелец", Форма.Объект.Партнер);
			
		Иначе
			
			СтруктураПроверки.Вставить("Владелец", Неопределено);
			
		КонецЕсли;
		
		ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураПроверки); 
		
		Если ИтогПроверки.КодОшибки <> 0 Тогда

			ОчиститьСообщения();
			
			Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
				
				Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
					ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
				КонецЦикла;

			Иначе

				ДанныеСтроки.Представление = "";
				СообщениеОбщееПояснение = 
					"Если номер имеет другой формат (например, это заграничный номер), нажмите на кнопку выбора или F4 и введите номер";		
				
				СообщениеДляВывода = ИтогПроверки.СообщениеОшибки + Символы.ПС + СообщениеОбщееПояснение; 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеДляВывода, , Элемент.Имя);
				
			КонецЕсли;
			
			Форма[ДанныеСтроки.ИмяРеквизита] = "";
			СтрокиКонтактнойИнформации[0].Представление = "";
			СтрокиКонтактнойИнформации[0].Значение = "";
			
		КонецЕсли;
		//-- #1152 смарт: Лопато 18.10.2024
		
	КонецЕсли;
	//--#1012 смарт: Холопов 04.05.2022
	#КонецВставки

КонецПроцедуры //--#1012 смарт: Холопов 04.05.2022

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
&ИзменениеИКонтроль("КонтактнаяИнформацияДобавитьПолеВводаЗавершение")
Процедура смарт_КонтактнаяИнформацияДобавитьПолеВводаЗавершение(Знач ВыбранныйЭлемент, Знач ДополнительныеПараметры)
	Если ВыбранныйЭлемент = Неопределено Тогда
		// Отказ от выбора
		Возврат;
	КонецЕсли;

	Результат = Новый Структура();
	Результат.Вставить("ДобавляемыйВид", ВыбранныйЭлемент.Значение);
	Результат.Вставить("ИмяЭлементаДляРазмещения", ДополнительныеПараметры.ИмяЭлементаДляРазмещения);
	Результат.Вставить("ИмяКоманды", ДополнительныеПараметры.ИмяКоманды);
	Если ВыбранныйЭлемент.Значение.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат.Вставить("ОбновитьКонтекстноеМеню", Истина);
	КонецЕсли;

	ОбновитьКонтактнуюИнформациюФормы(ДополнительныеПараметры.Форма, Результат);

	#Вставка
	//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации	
	Форма = ДополнительныеПараметры.Форма;
	ТекЭлемент = Форма.ТекущийЭлемент;
	ТекЭлементИмя = ТекЭлемент.Имя;
	
	Отбор = Новый Структура("ИмяРеквизита", ТекЭлементИмя);
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			
			ТекЭлемент.ПодсказкаВвода 		= "+7 ХХХ ХХХ ХХ ХХ или 8 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
			ТекЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
			ТекЭлемент.Подсказка			= "Если номер имеет заграничный формат, нажмите на кнопку выбора или F4 и введите номер";
			
		КонецЕсли;
	КонецЕсли;
	//--#1012 смарт: Холопов 04.05.2022
	#КонецВставки
	
КонецПроцедуры //--#1012 смарт: Холопов 04.05.2022

#КонецОбласти