
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить значение цвета
//
// Параметры:
//  Ссылка		 - Ссылка	 - ссылка для получения цвета.
//  ПутьКДанным	 - Строка, Неопределено	 - имя реквизита для получения цвета.
// 
// Возвращаемое значение:
//  Цвет - Значение цвета.
//
Функция ПолучитьЗначениеЦвета(Ссылка, ПутьКДанным = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;	
	Иначе	
		
		ХранилищеЦвета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ?(ПутьКДанным = Неопределено, "Цвет", ПутьКДанным));
		Если ТипЗнч(ХранилищеЦвета) = Тип("ХранилищеЗначения") Тогда
			Возврат ХранилищеЦвета.Получить();
		Иначе	
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеЦвета()

#КонецОбласти

#КонецЕсли
