
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ТекстСообщения = "";
	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если Не ЭтоНовый() Тогда
		ЗначенияРеквизитовВИнформационнойБазе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Новый Структура("ИНН"));
	КонецЕсли;

	Если НЕ ПустаяСтрока(ИНН) Тогда 
		Если (ЭтоНовый() ИЛИ ЗначенияРеквизитовВИнформационнойБазе.ИНН <> ИНН)
			И НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Ложь, ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИНН", , Отказ);
		КонецЕсли;
	Конецесли;

	Если НЕ УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей()
		ИЛИ НЕ УправлениеДоступомСлужебный.ВидДоступаИспользуется("ГруппыФизическихЛиц") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ГруппаДоступа");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	#Вставка
	//++ #1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		ПроверяемыеРеквизиты.Добавить("смартВидФизическогоЛица");	
	КонецЕсли;
	//-- #1644 смарт: Ермаков 19.04.2024
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти