
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
	НовыйЭлемент = Элементы.Вставить("extCRM_ПодписиУчетнойЗаписи", Тип("ДекорацияФормы"), ЭтотОбъект, Элементы.ПрочиеНастройки);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "Подписи учетной записи";
	НовыйЭлемент.УстановитьДействие("Нажатие", "extCRM_ПодписиУчетнойЗаписиНажатие");
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	
	Если Элементы.Найти("CRM_ПодписиУчетнойЗаписи") <> Неопределено Тогда
		Элементы.extCRM_ПодписиУчетнойЗаписи.Видимость = Ложь;
	КонецЕсли;
	//--#1542 смарт: Лопато 03.11.2023
	
КонецПроцедуры

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
&Вместо("CRM_СоздатьКнопкиДляКогоУчетнаяЗапись")
Процедура extCRM_CRM_СоздатьКнопкиДляКогоУчетнаяЗапись()
	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		ПродолжитьВызов();
	КонецЕсли;
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
&Вместо("CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере")
Процедура extCRM_CRM_ПокраситьКнопкиДляКогоУчетнаяЗаписьНаСервере()
	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		ПродолжитьВызов();
	КонецЕсли;
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
&Вместо("CRM_СоздатьКнопкиРолеваяАдресация")
Процедура extCRM_CRM_СоздатьКнопкиРолеваяАдресация()
	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		ПродолжитьВызов();
	КонецЕсли;
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
&Вместо("CRM_ПокраситьКнопкиРолеваяАдресацияНаСервере")
Процедура extCRM_CRM_ПокраситьКнопкиРолеваяАдресацияНаСервере()
	Если CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		ПродолжитьВызов();
	КонецЕсли;
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

#КонецОбласти

#Область ДоработкиСмарт

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаКлиенте
Процедура extCRM_ПодписиУчетнойЗаписиНажатие(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройка подписей возможна только после записи.'"));
		Возврат;
	КонецЕсли;
	ЗначенияЗаполнения = Новый Структура("УчетнаяЗаписьЭлектроннойПочты", Объект.Ссылка);
	ФормаНастроек = ПолучитьФорму("РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.Форма.ФормаЗаписи",
		Новый Структура("Ключ,ЗначенияЗаполнения", extCRM_КлючЗаписиНастроек(Объект.Ссылка), ЗначенияЗаполнения));
	ФормаНастроек.Элементы.СтраницаОбщие.Видимость = Ложь;
	ФормаНастроек.Элементы.ОбработкаПисем.Видимость = Ложь;
	ФормаНастроек.ЭтоПерсональнаяУчетнаяЗапись = Истина;
	ФормаНастроек.Открыть();
	
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
Функция extCRM_КлючЗаписиНастроек(УчетнаяЗаписьЭлектроннойПочты)
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	НастройкиУчетныхЗаписейЭлектроннойПочты.УчетнаяЗаписьЭлектроннойПочты
		|ИЗ
		|	РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты КАК НастройкиУчетныхЗаписейЭлектроннойПочты
		|ГДЕ
		|	НастройкиУчетныхЗаписейЭлектроннойПочты.УчетнаяЗаписьЭлектроннойПочты = &УчетнаяЗаписьЭлектроннойПочты
		|");
	
	Запрос.УстановитьПараметр("УчетнаяЗаписьЭлектроннойПочты", УчетнаяЗаписьЭлектроннойПочты);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеКлючаЗаписи = Новый Структура("УчетнаяЗаписьЭлектроннойПочты", УчетнаяЗаписьЭлектроннойПочты);
	Возврат РегистрыСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.СоздатьКлючЗаписи(ДанныеКлючаЗаписи);
	
КонецФункции //--#1542 смарт: Лопато 03.11.2023

#КонецОбласти