
&ИзменениеИКонтроль("ИнтересОкончаниеВыбора")
Процедура смарт_ИнтересОкончаниеВыбора(ВыбранноеЗначение, ДопПараметры)

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Форма = ДопПараметры.Форма;
	
	#Вставка 
	//++ #1900 смарт: Фролов 05.07.2024 //Запрет привязывания Интереса к Заказу клиента другим ответственным
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" 
		//++ #Б-4308 смарт: Фролов 10.09.2025 //Добавить возможность подтягивать в заказ не свой интерес сотрудникам бэк-офиса
		И НЕ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ЭтоПолноправныйПользователь 
		И НЕ смартПользователи.РольДоступнаПользователю("смартМенеджерБэкОфис") Тогда
		//-- #Б-4308 смарт: Фролов 10.09.2025
		
		Если НЕ ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Ответственный") = ПользователиКлиентСервер.ТекущийПользователь() Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Можно выбрать только Интерес, где вы являетесь ответственным!");
			ВыбранноеЗначение = Неопределено;
			Возврат;
			
		КонецЕсли;
		
		//++ #1984 смарт: Фролов 13.08.2024 //Запрет на привязку более одного заказа клиента к Интересу.
		НайденныйЗаказ = смартОбщегоНазначения.ПроверитьНаличиеЗаказаПоИнтересу(ВыбранноеЗначение);
				
		Если ЗначениеЗаполнено(НайденныйЗаказ) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("К интересу " + ВыбранноеЗначение + " уже привязан заказ " + НайденныйЗаказ);
			ВыбранноеЗначение = Неопределено;
			Возврат;
			
		КонецЕсли;
		//-- #1984 смарт: Фролов 13.08.2024
		
	КонецЕсли;
	//-- #1900 смарт: Фролов 08.07.2024
	#КонецВставки
	
	Если ДопПараметры.УстановитьОсновным Тогда
		Форма.CRM_ИнтересСтрокой = CRM_МетодыФормДокументовСервер.СформироватьПредставлениеИнтересаСтрокой(ВыбранноеЗначение);
	КонецЕсли;	

	МассивСтрок = Форма.CRM_ТаблицаИнтересов.НайтиСтроки(новый Структура("Ссылка",ВыбранноеЗначение));

	Если МассивСтрок.Количество() = 0 Тогда
		Если ДопПараметры.УстановитьОсновным И Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
			НоваяСтрока = Форма.CRM_ТаблицаИнтересов[0];
		Иначе
			НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, CRM_МетодыФормДокументовСервер.ПолучитьСтруктуруСтрокиИнтересов(ВыбранноеЗначение));
	ИначеЕсли ДопПараметры.УстановитьОсновным Тогда	
		Форма.CRM_ТаблицаИнтересов.Сдвинуть(Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]),-Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]));
	КонецЕсли;
	Форма.ИнтересИзменен = Истина;
	Форма.Модифицированность = Истина;

	Если Форма.ИмяФормы = "Документ.ЭлектронноеПисьмоВходящее.Форма.CRM_ФормаДокумента" Тогда
		Если CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Форма.Папка, "CRM_Вид") <> ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные")
			И CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Форма.Объект.УчетнаяЗапись, "CRM_ПереноситьВОбработанные") Тогда
			Если CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Форма.Объект.УчетнаяЗапись, "CRM_ЗадаватьВопросПриПереносеВОбработанные") Тогда
				CRM_ЗадатьВопросПриПереносеВОбработанные(Форма);
			Иначе
				CRM_ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, Форма)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
