
//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&ИзменениеИКонтроль("ЯвляетсяОснованиемИнтереса")
Функция extCRM_ЯвляетсяОснованиемИнтереса(ОбъектСсылка)

	Если ТипЗнч(ОбъектСсылка) = Тип("Тип") Тогда
		ТипОбъекта = ОбъектСсылка;
	Иначе
		ТипОбъекта = ТипЗнч(ОбъектСсылка);
	КонецЕсли;

	Возврат Метаданные.Документы.CRM_Интерес.Реквизиты.ДокументОснование.Тип.СодержитТип(ТипОбъекта)
				ИЛИ (Метаданные.НайтиПоТипу(ТипОбъекта).Реквизиты.Найти("ДокументОснование")<>Неопределено 
					#Удаление
					И Метаданные.НайтиПоТипу(ТипОбъекта).Реквизиты["ДокументОснование"].Тип.СодержитТип(Тип("ДокументСсылка.CRM_Интерес")));
					#КонецУдаления
					#Вставка
					И Метаданные.НайтиПоТипу(ТипОбъекта).Реквизиты["ДокументОснование"].Тип.СодержитТип(Тип("ДокументСсылка.CRM_Интерес")))
						ИЛИ ТипОбъекта = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку");
					#КонецВставки
					
КонецФункции //--#1542 смарт: Лопато 03.11.2023    
				
				
// +Рарус alexpr
Процедура ЗакончитьЗамерВремениСозданияФормы(Форма, ВремяНачалаЗамера) Экспорт
	
	ИмяКлючевойОперации = СтрШаблон("ОткрытиеФормы.%1.НаСервере", Форма.ИмяФормы);
	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяКлючевойОперации, ВремяНачалаЗамера, 1);
	
КонецПроцедуры

Функция КоличествоДнейСНачалаГодаПоКалендарю(Календарь, Дата) Экспорт
	
	КоличествоДней = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КалендарныеГрафики.КоличествоДнейВГрафикеСНачалаГода КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.Календарь = &Календарь
	|	И КалендарныеГрафики.Год = &Год
	|	И КалендарныеГрафики.ДатаГрафика = &ДатаГрафика");
	
	Запрос.Параметры.Вставить("Календарь", Календарь);
	Запрос.Параметры.Вставить("Год", Год(Дата));
	Запрос.Параметры.Вставить("ДатаГрафика", НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоДней = Выборка.КоличествоДней;
	КонецЕсли;
	
	Возврат КоличествоДней;
	
КонецФункции

&ИзменениеИКонтроль("БазоваяДатаПоВариантуИнтервала") 
//++ #Б-3744 смарт: Фролов 14.07.2025 //Интервал между взаимодействиями с клиентом по расходным материалам. Изменения в CRM
Функция смарт_БазоваяДатаПоВариантуИнтервала(Знач ДатаИсточник, Знач ВариантСрока)

	Результат = Неопределено;

	Если ЗначениеЗаполнено(ДатаИсточник) и ЗначениеЗаполнено(ВариантСрока)
		и (ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДень
		или ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезТриДня
		или ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезНеделю
		или ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДвеНедели
		или ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезМесяц
		
		#Вставка //++ #Б-3744 смарт: Фролов 14.07.2025 //Интервал между взаимодействиями с клиентом по расходным материалам. Изменения в CRM
		ИЛИ ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.смартЧерез44Дня
		#КонецВставки
		
		или ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезТриМесяца) Тогда

		Результат = ДатаИсточник;

		НачалоДня_ДатаИсточник = НачалоДня(ДатаИсточник);
		НачалоДня_ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());

		Если НачалоДня_ДатаИсточник <> НачалоДня_ТекущаяДата Тогда
			Результат = ДатаИсточник - (НачалоДня_ДатаИсточник - НачалоДня_ТекущаяДата);
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции //-- #Б-3744 смарт: Фролов 14.07.2025

&ИзменениеИКонтроль("ДатаПоВариантуИнтервала")
//++ #Б-3744 смарт: Фролов 14.07.2025 //Интервал между взаимодействиями с клиентом по расходным материалам. Изменения в CRM
Функция смарт_ДатаПоВариантуИнтервала(Знач БазоваяДата, Знач ВариантСрока, Знач ДлительностьИнтервала)

	ТекущаяДата = ТекущаяДатаСеанса() + ДлительностьИнтервала;

	Если Не ЗначениеЗаполнено(БазоваяДата) Тогда
		БазоваяДата = ТекущаяДата;
	КонецЕсли;

	Если ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.Сейчас Тогда
		ДатаРезультат	= ТекущаяДата;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.Через15Минут Тогда
		ДатаРезультат	= БазоваяДата + 900;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезЧас Тогда
		ДатаРезультат	= БазоваяДата + 3600;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.Через4Часа Тогда
		ДатаРезультат	= БазоваяДата + 14400;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.Через8Часов Тогда
		ДатаРезультат	= БазоваяДата + 28800;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДень Тогда
		ДатаРезультат	= БазоваяДата + 86400;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезТриДня Тогда
		ДатаРезультат	= БазоваяДата + 259200;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезНеделю Тогда
		ДатаРезультат	= БазоваяДата + 604800;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДвеНедели Тогда
		ДатаРезультат	= БазоваяДата + 1209600;
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезМесяц Тогда
		ДатаРезультат	= ДобавитьМесяц(БазоваяДата, 1); 
		
	#Вставка //++ #Б-3744 смарт: Фролов 14.07.2025 //Интервал между взаимодействиями с клиентом по расходным материалам. Изменения в CRM
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.смартЧерез44Дня Тогда
		ДатаРезультат	= БазоваяДата + 86400 * 44;
	#КонецВставки
	
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезТриМесяца Тогда
		ДатаРезультат	= ДобавитьМесяц(БазоваяДата, 3);
	Иначе
		ДатаРезультат	= БазоваяДата;
	КонецЕсли;

	Возврат ДатаРезультат;

КонецФункции //-- #Б-3744 смарт: Фролов 14.07.2025
// -Рарус alexpr
				
				