
&ИзменениеИКонтроль("ВыполнитьКоманду")
Процедура смарт_ВыполнитьКоманду(Форма, Элемент, СтандартнаяОбработка)

	#Вставка
	//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы 
	Если Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая" Тогда
		
		Если Элемент.Имя = "БизнесРегион" Тогда 
			
			СтандартнаяОбработка = Ложь;   
			ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);    
			
			Если ЗначениеЗаполнено(Форма.Клиент_Объект.БизнесРегион) Тогда
				ПараметрыФормы.Вставить("ТекущаяСтрока", Форма.Клиент_Объект.БизнесРегион);
			КонецЕсли;
			
			ОткрытьФорму("Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаСписка", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			Возврат; 
			
		КонецЕсли; 
		
	//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" 
		//++ #Б-3500 смарт: Фролов 20.08.2025 //Создание интереса вручную, дубли контрагентов	
		ИЛИ Форма.ИмяФормы = "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая" Тогда
		//-- #Б-3500 смарт: Фролов 20.08.2025
		
			СтандартнаяОбработка = Ложь;   
			ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);    
			
			Если ЗначениеЗаполнено(Форма.БизнесРегион) Тогда
				ПараметрыФормы.Вставить("ТекущаяСтрока", Форма.БизнесРегион);
			КонецЕсли;
			
			ОткрытьФорму("Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаСписка", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			Возврат; 
	//-- #1624 смарт: Фролов 13.02.2024	
	Иначе 
		
		Если Элемент.Имя = "БизнесРегион" Тогда 
			
			СтандартнаяОбработка = Ложь;   
			ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);    
			
			Если ЗначениеЗаполнено(Форма.Объект.БизнесРегион) Тогда
				ПараметрыФормы.Вставить("ТекущаяСтрока", Форма.Объект.БизнесРегион);
			КонецЕсли;
			
			ОткрытьФорму("Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаСписка", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			Возврат; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
	//-- #1537 смарт: Мосолов 26.12.2023
	#КонецВставки
	
	Если Элемент = Неопределено Тогда
		ИмяКоманды = "РедактироватьСоставДополнительныхРеквизитов";
	ИначеЕсли ТипЗнч(Элемент) = Тип("КомандаФормы") Тогда
		ИмяКоманды = Элемент.Имя;
	Иначе
		ЗначениеРеквизита = Форма[Элемент.Имя];
		Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			РедактироватьГиперссылкуРеквизита(Форма, Истина, Элемент);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если ИмяКоманды = "РедактироватьСоставДополнительныхРеквизитов" Тогда
		РедактироватьСоставСвойств(Форма);
	ИначеЕсли ИмяКоманды = "РедактироватьГиперссылкуРеквизита" Тогда
		РедактироватьГиперссылкуРеквизита(Форма);
	КонецЕсли;
	
	#Вставка
	// ++ смарт: Мосолов 26.12.2023
	// Было в &После, перенес
	Если Форма.ИмяФормы="Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая" ТОгда
		Если Элемент.Имя = "СтрокаПоиска" Тогда
			Форма.Клиент_ИНН="";	
			Форма.Клиент_КПП="";
		КонецЕсли;	
	КонецЕсли; 
	// -- смарт: Мосолов 26.12.2023
	#КонецВставки
	
КонецПроцедуры


