

//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы   
&НаКлиенте
Процедура смартДобавитьИзКлассификатора(Команда) 
	
	СтруктураВозврата = смартПолучитьСписокРегионов(Элементы.Список.ТекущаяСтрока); 
	Если СтруктураВозврата = Неопределено Тогда 
		// Дописать текст предупреждения для пользователя
	Иначе
		
		ПараметрыФормы = Новый Структура("СписокРегионов, ПоискПоРегиону, ФО, ТекущийРегион", 
			СтруктураВозврата.СписокРегионов, СтруктураВозврата.РегионПоиска, СтруктураВозврата.Регион, СтруктураВозврата.ТекущийРегион);
		
		ОткрытьФорму("Справочник.БизнесРегионы.Форма.смартКлассификатор", ПараметрыФормы, ЭтаФорма); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 26.12.2023   

//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы   
&НаСервере
Функция смартПолучитьСписокРегионов(Регион) 
	
	РегионПоиска = Регион;
	СписокРегионов = Новый СписокЗначений;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТекущийРегион", Регион);
	
	Если Регион.Уровень() = 2 Тогда 
		
		Если ЗначениеЗаполнено(Регион.Родитель.СмартКодСубъектаРФ) Тогда  
			
			СписокРегионов.Добавить(Регион.Родитель); 
			РегионПоиска = Регион.Родитель; 
			Регион = Регион.Родитель.Родитель;   
			
		КонецЕсли;      
		
	ИначеЕсли Регион.Уровень() = 1 Тогда
		
		Если ЗначениеЗаполнено(Регион.СмартКодСубъектаРФ) Тогда  
			
			СписокРегионов.Добавить(Регион);  
			Регион = Регион.Родитель;  
			
		КонецЕсли;     
		
	ИначеЕсли Регион.Уровень() = 0 Тогда   
		
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Родитель", Регион);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БизнесРегионы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БизнесРегионы КАК БизнесРегионы
		|ГДЕ
		|	БизнесРегионы.Родитель = &Родитель
		|	И БизнесРегионы.СмартКодСубъектаРФ <> 0";
		СписокРегионов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")); 
		
	КонецЕсли;
	
	СтруктураВозврата.Вставить("СписокРегионов", СписокРегионов);
	СтруктураВозврата.Вставить("Регион", Регион);
	СтруктураВозврата.Вставить("РегионПоиска", РегионПоиска);
	
	Возврат ?(СписокРегионов.Количество(), СтруктураВозврата, Неопределено);

КонецФункции //-- #1537 смарт: Мосолов 26.12.2023  

//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы   
&НаКлиенте
Процедура смартВыбрать(Команда) 
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, "Не выбрана строка с бизнес-регионом!");
		Возврат;
	КонецЕсли;  
	ОповеститьОВыборе(Элементы.Список.ДанныеСтроки(ТекСтрока).Ссылка);  
КонецПроцедуры //-- #1537 смарт: Мосолов 26.12.2023  

//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы   
&НаКлиенте
Процедура смарт_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
КонецПроцедуры //-- #1537 смарт: Мосолов 26.12.2023


//++ #1537 смарт: Мосолов 16.01.2023 //Запрет создания элементов справочника Бизнес-регионы   
&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ) 
	
	Элементы.ФормаПодборИзКлассификатора.ТолькоВоВсехДействиях = Истина;
	Элементы.ФормаНачальноеЗаполнение.ТолькоВоВсехДействиях = Истина;
	Элементы.ФормаСоздатьБизнесРегионы.ТолькоВоВсехДействиях = Истина; 
			
КонецПроцедуры //-- #1537 смарт: Мосолов 16.01.2023

//++ #1537 смарт: Мосолов 16.01.2023 //Запрет создания элементов справочника Бизнес-регионы
&НаКлиенте
Процедура смартСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(ВыбраннаяСтрока);  
	
КонецПроцедуры //-- #1537 смарт: Мосолов 16.01.2023

