
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Источник", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.CRM_РабочееВремяПользователей.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ВариантОткрытияОкна.ОтдельноеОкно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

