
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ФормаСписка = ПолучитьФорму("РегистрСведений.CRM_ИзбранныеПолучатели.формаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	ЭлементОтбора = ФормаСписка.Список.Отбор.Элементы.Добавить(Тип ("ЭлементОтбораКомпоновкиДанных"));
  	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Пользователь");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= ПараметрКоманды;
	ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.Использование		= Истина;
	ФормаСписка.Элементы.Список.ПодчиненныеЭлементы.Пользователь.Видимость = Ложь;
	ФормаСписка.Открыть();
КонецПроцедуры

#КонецОбласти

