#Область ПеренесеноСДоработками

//Смарт {[+](фрагмент Изменен), Подкин Алексей Иванович 09.06.2021 13:19:23 
//Внесены изменнения в запрос касающиеся проверки склада в документе реализация
//Проблема возникла т.к. в заявке на возврат изменяют склад в табличной части(т.е. склад реализации отличается от склада возврата) 
&Вместо("ТаблицаОстатковРеализованныхТоваров")
Процедура смарт_ТаблицаОстатковРеализованныхТоваров(ДокументОбъект, МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ СгруппированнаяТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК Ссылка,
	|	КлючиАналитикиУчетаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = КлючиАналитикиУчетаНоменклатуры.Номенклатура
	|			И ТаблицаТоваров.Характеристика = КлючиАналитикиУчетаНоменклатуры.Характеристика
	|			И ТаблицаТоваров.Серия = КлючиАналитикиУчетаНоменклатуры.Серия
	|
	|ГДЕ
	|	ТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимости.ИзДокументаПродажи)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ТЧВидыЗапасов.КоличествоПоРНПТ
	|	КОНЕЦ КАК КоличествоПоРНПТ
	|ПОМЕСТИТЬ РеализованныеТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТЧВидыЗапасов.ВидЗапасов В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ТЧВидыЗапасов.КоличествоПоРНПТ
	|	КОНЕЦ КАК КоличествоПоРНПТ
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|
	|ГДЕ
	|	(ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И ТЧВидыЗапасов.ВидЗапасов В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ТЧВидыЗапасов.КоличествоПоРНПТ
	|	КОНЕЦ КАК КоличествоПоРНПТ
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТЧВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ТЧВидыЗапасов.Ссылка.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|	И ТЧВидыЗапасов.ВидЗапасов В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ -ТЧВидыЗапасов.КоличествоПоРНПТ
	|	КОНЕЦ КАК КоличествоПоРНПТ
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТЧВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ТЧВидыЗапасов.Ссылка.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|	И ТЧВидыЗапасов.ВидЗапасов В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ -ТЧВидыЗапасов.КоличествоПоРНПТ
	|	КОНЕЦ КАК КоличествоПоРНПТ
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И (ТЧВидыЗапасов.Ссылка.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТЧВидыЗапасов.ВидЗапасов В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатурыОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация КАК Организация,
	|	ТаблицаДанныхДокумента.Склад КАК Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура КАК Номенклатура,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Характеристика КАК Характеристика,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Серия КАК Серия,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения КАК СкладОтгрузки,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение КАК Назначение,
	|	РеализованныеТовары.ДокументРеализации КАК ДокументРеализации,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасовВладельца,
	|	РеализованныеТовары.ВидЗапасов КАК ВидЗапасовОтгрузки,
	|	РеализованныеТовары.НомерГТД КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка) КАК Сделка,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасовПолучателя,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПоступления,
	|	СУММА(РеализованныеТовары.Количество) КАК КоличествоОстаток,
	|	СУММА(РеализованныеТовары.КоличествоПоРНПТ) КАК КоличествоПоРНПТОстаток,
	|	0 КАК СуммаОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РеализованныеТовары КАК РеализованныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ПО РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура
	|			И РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Характеристика = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика
	|			И РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Серия = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия
	//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 09.06.2021 13:23:58
	//|			И ВЫБОР КОГДА &ЭтоКорректировкаРеализации
	//|				ТОГДА РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	//|			ИНАЧЕ
	//|				ИСТИНА
	//|			КОНЕЦ
	//Смарт }Подкин Алексей Иванович 09.06.2021 13:23:58
	|			И РеализованныеТовары.ДокументРеализации = СгруппированнаяТаблицаТоваров.ДокументРеализации
	|			И (РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение
	|				ИЛИ СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|				ИЛИ РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимости.ИзДокументаПродажи))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Склад,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	РеализованныеТовары.НомерГТД,
	|	ТаблицаДанныхДокумента.Организация,
	|	РеализованныеТовары.ДокументРеализации,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	РеализованныеТовары.ВидЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РеализованныеТовары.Количество) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация,
	|	ТаблицаДанныхДокумента.Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	ТаблицаВидыЗапасов.ДокументРеализации,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаВидыЗапасов.Количество,
	|	ТаблицаВидыЗапасов.КоличествоПоРНПТ,
	|	0
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ПО СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимости.ИзДокументаПродажи))
	|			И (ТаблицаВидыЗапасов.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимости.ИзДокументаПродажи))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СгруппированнаяТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам";

	Запрос.УстановитьПараметр("ЭтоКорректировкаРеализации", ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаРеализации"));
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	Запрос.Выполнить();

КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьКонтрольПоТоварамОрганизаций")
Процедура смарт_ДобавитьКонтрольПоТоварамОрганизаций(Объект, ПакетЗапросов, ТекстЗапроса , МассивКонтролей, ДанныеТаблиц) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ОтказПриЗаполненииВидовЗапасов")
		Или Объект.ДополнительныеСвойства.Свойство("НужноКонтролироватьОстаткиТоваровОрганизаций")
			И Объект.ДополнительныеСвойства["НужноКонтролироватьОстаткиТоваровОрганизаций"] = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыЗапросовКонтроля = Новый Массив;
	
	Если ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц, "ДвиженияТоварыОрганизацийИзменение") Тогда
		МинимальныйПериод = ДанныеТаблиц.ДвиженияТоварыОрганизацийИзменение.МинимальныйПериод;
		ЕстьТаблицаОстатков = Истина;
	Иначе
		МинимальныйПериод = ДатаАктуальныхОстатков();
		ЕстьТаблицаОстатков = Ложь;
	КонецЕсли;
		
	Если ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц, "ДвиженияРезервыТоваровОрганизацийИзменение") Тогда
		ЕстьТаблицаРезервов = Истина;
	Иначе
		ЕстьТаблицаРезервов = Ложь;
	КонецЕсли;
	
	ТекстЗапросаВТОтборыКонтроля = "";
	
	Если ЕстьТаблицаОстатков
		И ЕстьТаблицаРезервов Тогда
		
		ТекстЗапросаВТОтборыКонтроля =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.ВидЗапасов КАК ВидЗапасов,
		|	ВложенныйЗапрос.НомерГТД КАК НомерГТД
		|ПОМЕСТИТЬ ВТОтборыКонтроляКорректностиДвижений
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаИзменений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		ТаблицаИзменений.Организация КАК Организация,
		|		ТаблицаИзменений.ВидЗапасов КАК ВидЗапасов,
		|		ТаблицаИзменений.НомерГТД КАК НомерГТД
		|	ИЗ
		|		ДвиженияТоварыОрганизацийИзменение КАК ТаблицаИзменений
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|			ПО ТаблицаИзменений.ВидЗапасов = ВидыЗапасов.Ссылка
		|	ГДЕ
		|		НЕ ВидыЗапасов.ТипЗапасов В (&НеконтролируемыеТипыЗапасов)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаИзменений.АналитикаУчетаНоменклатуры,
		|		ТаблицаИзменений.Организация,
		|		ТаблицаИзменений.ВидЗапасов,
		|		ТаблицаИзменений.НомерГТД
		|	ИЗ
		|		ДвиженияРезервыТоваровОрганизацийИзменение КАК ТаблицаИзменений
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|			ПО ТаблицаИзменений.ВидЗапасов = ВидыЗапасов.Ссылка
		|	ГДЕ
		|		НЕ ВидыЗапасов.ТипЗапасов В (&НеконтролируемыеТипыЗапасов)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
		|	ВложенныйЗапрос.ВидЗапасов,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.НомерГТД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВложенныйЗапрос.ВидЗапасов,
		|	ВложенныйЗапрос.НомерГТД,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры";
		
	ИначеЕсли ЕстьТаблицаОстатков Тогда
		
		ТекстЗапросаВТОтборыКонтроля =
		"ВЫБРАТЬ
		|	ТаблицаИзменений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТаблицаИзменений.Организация КАК Организация,
		|	ТаблицаИзменений.ВидЗапасов КАК ВидЗапасов,
		|	ТаблицаИзменений.НомерГТД КАК НомерГТД
		|ПОМЕСТИТЬ ВТОтборыКонтроляКорректностиДвижений
		|ИЗ
		|	ДвиженияТоварыОрганизацийИзменение КАК ТаблицаИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|		ПО ТаблицаИзменений.ВидЗапасов = ВидыЗапасов.Ссылка
		|ГДЕ
		|	НЕ ВидыЗапасов.ТипЗапасов В (&НеконтролируемыеТипыЗапасов)";
		
	ИначеЕсли ЕстьТаблицаРезервов Тогда
		
		ТекстЗапросаВТОтборыКонтроля =
		"ВЫБРАТЬ
		|	ТаблицаИзменений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТаблицаИзменений.Организация КАК Организация,
		|	ТаблицаИзменений.ВидЗапасов КАК ВидЗапасов,
		|	ТаблицаИзменений.НомерГТД КАК НомерГТД
		|ПОМЕСТИТЬ ВТОтборыКонтроляКорректностиДвижений
		|ИЗ
		|	ДвиженияРезервыТоваровОрганизацийИзменение КАК ТаблицаИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|		ПО ТаблицаИзменений.ВидЗапасов = ВидыЗапасов.Ссылка
		|ГДЕ
		|	НЕ ВидыЗапасов.ТипЗапасов В (&НеконтролируемыеТипыЗапасов)";
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ТекстыЗапросовКонтроля.Добавить(ТекстЗапросаВТОтборыКонтроля);
	
	ШаблонЗапросаОстаткаМесяца =
	"ВЫБРАТЬ
	|	&ПериодДата КАК Период,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыОрганизацийОстатки.Организация КАК Организация,
	|	ТоварыОрганизацийОстатки.ВидЗапасов КАК ВидЗапасов,
	|	ТоварыОрганизацийОстатки.НомерГТД КАК НомерГТД,
	|	0 КАК РезервОстаток,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыОрганизацийОстатки.КОформлениюСписанияОстаток КАК КОформлениюСписанияОстаток
	|ПОМЕСТИТЬ ВТОстаткиТоваровОрганизацийПоМесяцам
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			&ПериодГраница,
	|			(АналитикаУчетаНоменклатуры, Организация, ВидЗапасов, НомерГТД) В
	|				(ВЫБРАТЬ
	|					Отбор.АналитикаУчетаНоменклатуры,
	|					Отбор.Организация,
	|					Отбор.ВидЗапасов,
	|					Отбор.НомерГТД
	|				ИЗ
	|					ВТОтборыКонтроляКорректностиДвижений КАК Отбор)) КАК ТоварыОрганизацийОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодДата,
	|	РезервыТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизацийОстатки.Организация,
	|	РезервыТоваровОрганизацийОстатки.ВидЗапасов,
	|	РезервыТоваровОрганизацийОстатки.НомерГТД,
	|	РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
	|			&ПериодГраница,
	|			(АналитикаУчетаНоменклатуры, Организация, ВидЗапасов, НомерГТД) В
	|				(ВЫБРАТЬ
	|					Отбор.АналитикаУчетаНоменклатуры,
	|					Отбор.Организация,
	|					Отбор.ВидЗапасов,
	|					Отбор.НомерГТД
	|				ИЗ
	|					ВТОтборыКонтроляКорректностиДвижений КАК Отбор)) КАК РезервыТоваровОрганизацийОстатки";
	
	МинимальныйПериод = КонецМесяца(Мин(МинимальныйПериод, ДатаПервогоРезерва(МинимальныйПериод)));
	КонецТекущегоМесяца = КонецМесяца(ТекущаяДатаСеанса());
	
	// Больше трех лет не контролируем, чтобы не превысить количество таблиц в запросе.
	ТриГодаНазад = КонецМесяца(ДобавитьМесяц(КонецТекущегоМесяца, -36)); 
	Если МинимальныйПериод < ТриГодаНазад Тогда
		МинимальныйПериод = ТриГодаНазад;
	ИначеЕсли МинимальныйПериод > КонецТекущегоМесяца Тогда
		МинимальныйПериод = КонецТекущегоМесяца;
	КонецЕсли;
	
	ОбрабатываемыйМесяц = КонецМесяца(ДобавитьМесяц(ДатаПоследнегоДвижения(), -1));
	
	ТекстыЗапросовОстатковПоМесяцам = Новый Массив;
	
	Счетчик = 0;
		
	#Удаление
	Пока ОбрабатываемыйМесяц >= МинимальныйПериод Цикл
		
		ТекстЗапросаОстаткаМесяца = СтрЗаменить(ШаблонЗапросаОстаткаМесяца, "&ПериодДата", "&ПериодДата" + Строка(Счетчик));
		ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "&ПериодГраница", "&ПериодГраница" + Строка(Счетчик));
		Если Счетчик > 0 Тогда
			ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "ПОМЕСТИТЬ ВТОстаткиТоваровОрганизацийПоМесяцам", "");
		КонецЕсли;
		ТекстыЗапросовОстатковПоМесяцам.Добавить(ТекстЗапросаОстаткаМесяца);
		
		ПакетЗапросов.УстановитьПараметр("ПериодДата" + Строка(Счетчик), ОбрабатываемыйМесяц);
		ПакетЗапросов.УстановитьПараметр("ПериодГраница" + Строка(Счетчик), Новый Граница(ОбрабатываемыйМесяц, ВидГраницы.Включая));
		
		Счетчик = Счетчик + 1;
		ОбрабатываемыйМесяц = КонецМесяца(ДобавитьМесяц(ОбрабатываемыйМесяц, -1));
		
	КонецЦикла;	
	#КонецУдаления
	#Вставка
	//Каратеев ++
	//Пока ОбрабатываемыйМесяц >= МинимальныйПериод Цикл
	//	
	//	ТекстЗапросаОстаткаМесяца = СтрЗаменить(ШаблонЗапросаОстаткаМесяца, "&ПериодДата", "&ПериодДата" + Строка(Счетчик));
	//	ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "&ПериодГраница", "&ПериодГраница" + Строка(Счетчик));
	//	Если Счетчик > 0 Тогда
	//		ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "ПОМЕСТИТЬ ВТОстаткиТоваровОрганизацийПоМесяцам", "");
	//	КонецЕсли;
	//	ТекстыЗапросовОстатковПоМесяцам.Добавить(ТекстЗапросаОстаткаМесяца);
	//	
	//	ПакетЗапросов.УстановитьПараметр("ПериодДата" + Строка(Счетчик), ОбрабатываемыйМесяц);
	//	ПакетЗапросов.УстановитьПараметр("ПериодГраница" + Строка(Счетчик), Новый Граница(ОбрабатываемыйМесяц, ВидГраницы.Включая));
	//	
	//	Счетчик = Счетчик + 1;
	//	ОбрабатываемыйМесяц = КонецМесяца(ДобавитьМесяц(ОбрабатываемыйМесяц, -1));
	//	
	//КонецЦикла;	
	//
	//ТекстЗапросаОстаткаМесяца = СтрЗаменить(ШаблонЗапросаОстаткаМесяца, "&ПериодДата", "&ПериодДата" + Строка(Счетчик));
	//ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "&ПериодГраница", "");
	
	ТекстЗапросаОстаткаМесяца = СтрЗаменить(ШаблонЗапросаОстаткаМесяца, "&ПериодДата", "&ПериодДата" + Строка(Счетчик));
	ПакетЗапросов.УстановитьПараметр("ПериодГраница", Новый Граница(МинимальныйПериод, ВидГраницы.Включая));

	//Каратеев --
	#КонецВставки
	
	ТекстЗапросаОстаткаМесяца = СтрЗаменить(ШаблонЗапросаОстаткаМесяца, "&ПериодДата", "&ПериодДата" + Строка(Счетчик));
	ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "&ПериодГраница", "");
	Если Счетчик > 0 Тогда
		ТекстЗапросаОстаткаМесяца = СтрЗаменить(ТекстЗапросаОстаткаМесяца, "ПОМЕСТИТЬ ВТОстаткиТоваровОрганизацийПоМесяцам", "");
	КонецЕсли;
	ТекстыЗапросовОстатковПоМесяцам.Добавить(ТекстЗапросаОстаткаМесяца);
	
	ТекстыЗапросовКонтроля.Добавить(СтрСоединить(ТекстыЗапросовОстатковПоМесяцам, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()));
	
	ТекстыЗапросовКонтроля.Добавить(
	"ВЫБРАТЬ
	|	ОстаткиПоМесяцам.Период КАК Период,
	|	ОстаткиПоМесяцам.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.МестоХранения КАК МестоХранения,
	|	ОстаткиПоМесяцам.Организация КАК Организация,
	|	ОстаткиПоМесяцам.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиПоМесяцам.НомерГТД КАК НомерГТД,
	|	СУММА(ОстаткиПоМесяцам.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ОстаткиПоМесяцам.РезервОстаток) КАК РезервОстаток,
	|	СУММА(ОстаткиПоМесяцам.КОформлениюСписанияОстаток) КАК КОформлениюСписанияОстаток
	|ИЗ
	|	ВТОстаткиТоваровОрганизацийПоМесяцам КАК ОстаткиПоМесяцам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ОстаткиПоМесяцам.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоМесяцам.АналитикаУчетаНоменклатуры,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.МестоХранения,
	|	ОстаткиПоМесяцам.Организация,
	|	ОстаткиПоМесяцам.ВидЗапасов,
	|	ОстаткиПоМесяцам.НомерГТД,
	|	ОстаткиПоМесяцам.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	НомерГТД");
	
	ПакетЗапросов.УстановитьПараметр("ПериодДата" + Строка(Счетчик), ДатаАктуальныхОстатков());
	ПакетЗапросов.УстановитьПараметр("НеконтролируемыеТипыЗапасов", НеконтролируемыеТипыЗапасов());
	
	ТекстЗапросаКонтроля = СтрСоединить(ТекстыЗапросовКонтроля, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	МассивКонтролей.Добавить(ИмяКонтроляВТОтборыКонтроляКорректностиДвижений());
	МассивКонтролей.Добавить(ИмяКонтроляВТОстаткиТоваровОрганизацийПоМесяцам());
	МассивКонтролей.Добавить(ИмяКонтроляТоварыОрганизацийРезервыСводно());
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаКонтроля;
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьВидыЗапасовПоТоварамОрганизаций")
Процедура смарт_ЗаполнитьВидыЗапасовПоТоварамОрганизаций(ДокументОбъект,
													МенеджерВременныхТаблиц,
													Отказ,
													ПараметрыЗаполненияВидовЗапасов,
													ПроизводитсяОбновлениеИБ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПараметрыЗаполненияВидовЗапасов.ТаблицаОстатковУжеСформирована
		И ПараметрыЗаполненияВидовЗапасов.ИмяТаблицыОстатков <> "ТоварыОрганизаций"
		И ПараметрыЗаполненияВидовЗапасов.ИмяТаблицыОстатков <> "ПереданныеМеждуОрганизациямиТовары" Тогда
		
		ТекстИсключения = НСтр("ru = 'Процедуру ЗаполнитьВидыЗапасовПоТоварамОрганизаций можно вызывать только с таблицей остатков ТоварыОрганизаций или ПереданныеМеждуОрганизациямиТовары'");
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
		
	Если Не ПараметрыЗаполненияВидовЗапасов.ДоступныеВидыЗапасовУжеСформированы Тогда
		ИмяТаблицыЗапасов = ?(ПараметрыЗаполненияВидовЗапасов.ПодбиратьЗапасыРазныхПериодов,
								"ТаблицаВидыЗапасовПоПериодам",
								"ТаблицаВидыЗапасов");
		
		СформироватьВТДоступныеВидыЗапасов(ДокументОбъект,
											МенеджерВременныхТаблиц,
											ПараметрыЗаполненияВидовЗапасов,
											ИмяТаблицыЗапасов);
	КонецЕсли;
	
	СформироватьВТТаблицаРеквизитовВидовЗапасовПоУмолчанию(МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов);
	СохранитьИсходныеДвиженияТоваровИРезервов(ДокументОбъект.Ссылка, МенеджерВременныхТаблиц);
	СформироватьВтОтборыОстатковПоТаблицеТоваров(МенеджерВременныхТаблиц,
												Истина,
												ПараметрыЗаполненияВидовЗапасов.ПодбиратьЗапасыРазныхПериодов);
	
	Если Не ПроизводитсяОбновлениеИБ Тогда
		УстановитьБлокировкуРегистров(ДокументОбъект, МенеджерВременныхТаблиц);
	КонецЕсли;
	
	СформироватьВТТоварыОрганизацийИзменения(ДокументОбъект, МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов);
	
	// Если не повторный запуск заполнения видов запасов
	Если Не ДокументОбъект.ДополнительныеСвойства.Свойство("ТаблицаРезервыТоваровОрганизаций")
		И (// и не запуск из помощника исправления
			Не ДокументОбъект.ДополнительныеСвойства.Свойство("ПерезаполнитьВидыЗапасов")
			#Удаление
			Или Не ДокументОбъект.ДополнительныеСвойства.ПерезаполнитьВидыЗапасов) Тогда
			#КонецУдаления
			#Вставка
			//Смарт Каратеев ++
			//Или Не ДокументОбъект.ДополнительныеСвойства.ПерезаполнитьВидыЗапасов) Тогда
			Или Не ДокументОбъект.ДополнительныеСвойства.ПерезаполнитьВидыЗапасов)
			И Не ПараметрыЗаполненияВидовЗапасов.ДокументДелаетИПриходИРасход Тогда
			//Каратеев --
			#КонецВставки
		
		СформироватьВТСторноРезервов(ДокументОбъект, МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов);
		
	КонецЕсли;
	
	Если ПараметрыЗаполненияВидовЗапасов.ПодбиратьЗапасыРазныхПериодов Тогда
		
		ЗаполнитьВидыЗапасовРазныхПериодов(ДокументОбъект,
											МенеджерВременныхТаблиц,
											Отказ,
											ПараметрыЗаполненияВидовЗапасов);
		
	Иначе
		
		СформироватьВТТаблицаОстатков(ПараметрыЗаполненияВидовЗапасов.ИмяТаблицыОстатков,
										ДокументОбъект,
										МенеджерВременныхТаблиц,
										ПараметрыЗаполненияВидовЗапасов,
										Истина);
		
		ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы(ДокументОбъект,
																		МенеджерВременныхТаблиц,
																		Отказ,
																		ПараметрыЗаполненияВидовЗапасов);
		
	КонецЕсли;
	
	Если Отказ Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтказПриЗаполненииВидовЗапасов");
		
		Возврат;
	КонецЕсли;
	
	ТаблицаРезервыТоваровОрганизаций = ТаблицаРезервыТоваровОрганизаций(ДокументОбъект,
																		МенеджерВременныхТаблиц,
																		ПараметрыЗаполненияВидовЗапасов,
																		Истина);
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ТаблицаРезервыТоваровОрганизаций", ТаблицаРезервыТоваровОрганизаций);
	ДокументОбъект.ДополнительныеСвойства.Вставить("ЗаписыватьРезервыТоваровОрганизацийВместеСоВсеми",
													Не ПараметрыЗаполненияВидовЗапасов.ДокументДелаетИПриходИРасход);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&ИзменениеИКонтроль("ТаблицаОстатковТоваровОрганизаций")
Процедура смарт_ТаблицаОстатковТоваровОрганизаций(ДокументОбъект,
											МенеджерВременныхТаблиц,
											ПараметрыЗаполненияВидовЗапасов,
											ВычитатьДвиженияПоТоварамОрганизаций,
											МинимальнаяДатаОстатков,
											ДатыОстатков = Неопределено)
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Резервы.Период КАК Период,
	|	Резервы.Организация КАК Организация,
	|	Резервы.ВидДвижения КАК ВидДвижения,
	|	Резервы.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Резервы.ВидЗапасов КАК ВидЗапасов,
	|	Резервы.НомерГТД КАК НомерГТД,
	|	Резервы.Количество КАК Количество,
	|	Резервы.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	Резервы.КорОрганизация КАК КорОрганизация,
	|	Резервы.КорВидЗапасов КАК КорВидЗапасов
	|ПОМЕСТИТЬ СформированныеРезервы
	|ИЗ
	|	&СформированныеРезервы КАК Резервы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(Движения.Период, МЕСЯЦ) КАК Период,
	|	Движения.Организация,
	|	Движения.АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасов,
	|	Движения.НомерГТД,
	|	СУММА(Движения.Количество) КАК Количество,
	|	СУММА(Движения.КоличествоПоРНПТ) КАК КоличествоПоРНПТ
	|ПОМЕСТИТЬ ДвиженияДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Период КАК Период,
	|		Товары.Организация КАК Организация,
	|		Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Товары.ВидЗапасов КАК ВидЗапасов,
	|		Товары.НомерГТД КАК НомерГТД,
	|		ВЫБОР
	|			КОГДА Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -Товары.Количество
	|			ИНАЧЕ Товары.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|					ИЛИ НАЧАЛОПЕРИОДА(Товары.Период, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|				ТОГДА 0
	|			КОГДА Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -Товары.КоличествоПоРНПТ
	|			ИНАЧЕ Товары.КоличествоПоРНПТ
	|		КОНЕЦ КАК КоличествоПоРНПТ
	|	ИЗ
	|		ДвиженияТоварыОрганизацийПередЗаписью КАК Товары
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоступныеВидыЗапасов КАК ДоступныеВидыЗапасов
	|		ПО ДоступныеВидыЗапасов.ДляОрганизации = Товары.Организация
	|			И ДоступныеВидыЗапасов.ВидЗапасов = Товары.ВидЗапасов
	|	ГДЕ
	|		&ВычитатьДвиженияПоТоварамОрганизаций
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ // Погашение резервов по схеме интеркампани, используется в документах передачи
	|		Резервы.Период,
	|		Резервы.Организация,
	|		Резервы.АналитикаУчетаНоменклатуры,
	|		Резервы.ВидЗапасов,
	|		Резервы.НомерГТД,
	|		ВЫБОР
	|			КОГДА Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -Резервы.Количество
	|			ИНАЧЕ Резервы.Количество
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|					ИЛИ НАЧАЛОПЕРИОДА(Резервы.Период, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|				ТОГДА 0
	|			КОГДА Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -Резервы.КоличествоПоРНПТ
	|			ИНАЧЕ Резервы.КоличествоПоРНПТ
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РезервыТоваровОрганизаций КАК Резервы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборыОстатковОрганизаций КАК ОтборыОстатковОрганизаций
	|			ПО ОтборыОстатковОрганизаций.ВидЗапасов = Резервы.ВидЗапасов
	|				И ОтборыОстатковОрганизаций.Организация = Резервы.Организация // владелец товара
	|				И ОтборыОстатковОрганизаций.АналитикаУчетаНоменклатуры = Резервы.АналитикаУчетаНоменклатуры
	|	ГДЕ
	|		Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Резервы.КорВидЗапасов В (&КорВидыЗапасов)// продавец товара
	|		И (Резервы.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ИЛИ НЕ Резервы.ВидЗапасов В (&КорВидыЗапасов))
	|		И Резервы.Период >= НАЧАЛОПЕРИОДА(&КонецМесяца, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ // Погашение резервов за счет выкупа у поклажедателя
	|		Резервы.Период,
	|		Резервы.Организация,
	|		Резервы.АналитикаУчетаНоменклатуры,
	|		Резервы.ВидЗапасов,
	|		Резервы.НомерГТД,
	|		-Резервы.Количество,
	|		ВЫБОР
	|			КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|					ИЛИ НАЧАЛОПЕРИОДА(Резервы.Период, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|				ТОГДА 0
	|			ИНАЧЕ -Резервы.КоличествоПоРНПТ
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РезервыТоваровОрганизаций КАК Резервы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборыОстатковОрганизаций КАК ОтборыОстатковОрганизаций
	|			ПО Резервы.АналитикаУчетаНоменклатуры = ОтборыОстатковОрганизаций.АналитикаУчетаНоменклатуры
	|				И Резервы.ВидЗапасов = ОтборыОстатковОрганизаций.ВидЗапасов
	|				И Резервы.Организация = ОтборыОстатковОрганизаций.Организация // владелец товара
	|				И Резервы.КорОрганизация = ОтборыОстатковОрганизаций.Организация // продавец товара
	|	
	|	ГДЕ
	|		Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Резервы.ВидЗапасов <> Резервы.КорВидЗапасов
	|		И &ЭтоВыкупТоваров
	|		И Резервы.Период >= НАЧАЛОПЕРИОДА(&КонецМесяца, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Резервы.Период,
	|		Резервы.Организация,
	|		Резервы.АналитикаУчетаНоменклатуры,
	|		Резервы.ВидЗапасов,
	|		Резервы.НомерГТД,
	|		ВЫБОР
	|			КОГДА Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Резервы.Количество
	|			ИНАЧЕ -Резервы.Количество
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|					ИЛИ НАЧАЛОПЕРИОДА(Резервы.Период, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|				ТОГДА 0
	|			КОГДА Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Резервы.КоличествоПоРНПТ
	|			ИНАЧЕ -Резервы.КоличествоПоРНПТ
	|		КОНЕЦ
	|	ИЗ
	|		СформированныеРезервы КАК Резервы
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоступныеВидыЗапасов КАК ДоступныеВидыЗапасов
	|			ПО ДоступныеВидыЗапасов.ДляОрганизации = Резервы.Организация
	|				И ДоступныеВидыЗапасов.ВидЗапасов = Резервы.ВидЗапасов
	|	ГДЕ
	|		Резервы.ВидЗапасов В (&КорВидыЗапасов) // продавец товара
	|		И ВЫРАЗИТЬ(Резервы.ВидЗапасов КАК Справочник.ВидыЗапасов).ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ИЛИ НЕ Резервы.КорВидЗапасов В (&КорВидыЗапасов)
	|
	|	) КАК Движения
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(Движения.Период, МЕСЯЦ),
	|	Движения.Организация,
	|	Движения.АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасов,
	|	Движения.НомерГТД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОтборыОстатковОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДатыПоступленияТоваровОрганизаций.ДатаПоступления КАК ДатаПоступления,
	|	ДатыПоступленияТоваровОрганизаций.ВидЗапасов КАК ВидЗапасов,
	|	ДатыПоступленияТоваровОрганизаций.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ВТДатыПоступленияТоваровОрганизаций
	|ИЗ
	|	ВТОтборыОстатковОрганизаций КАК ВТОтборыОстатковОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоступленияТоваровОрганизаций КАК ДатыПоступленияТоваровОрганизаций
	|		ПО ВТОтборыОстатковОрганизаций.Номенклатура = ДатыПоступленияТоваровОрганизаций.Номенклатура
	|			И ВТОтборыОстатковОрганизаций.Характеристика = ДатыПоступленияТоваровОрганизаций.Характеристика
	|			И ВТОтборыОстатковОрганизаций.Серия = ДатыПоступленияТоваровОрганизаций.Серия
	|			И ВТОтборыОстатковОрганизаций.Назначение = ДатыПоступленияТоваровОрганизаций.Назначение
	|			И ВТОтборыОстатковОрганизаций.ВидЗапасов = ДатыПоступленияТоваровОрганизаций.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	
	|	//%ТекстВТОстаткиПоМесяцам%
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СгруппированныеОстатки.Период КАК Период,
	|	СгруппированныеОстатки.Организация КАК Организация,
	|	СгруппированныеОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СгруппированныеОстатки.ВидЗапасов КАК ВидЗапасов,
	|	СгруппированныеОстатки.НомерГТД КАК НомерГТД,
	|	МИНИМУМ(СгруппированныеОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	МИНИМУМ(СгруппированныеОстатки.КоличествоПоРНПТОстаток) КАК КоличествоПоРНПТОстаток,
	|	СУММА(СгруппированныеОстатки.СчетчикПериодов) КАК СчетчикПериодов
	|ПОМЕСТИТЬ СгруппированныеОстатки
	|ИЗ
	|	(//%ТекстОстаткиПоМесяцам%)  КАК СгруппированныеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Период,
	|	НомерПериода,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	НомерГТД
	|
	|ИМЕЮЩИЕ
	|	(МИНИМУМ(СгруппированныеОстатки.КоличествоОстаток) <> 0
	|	И СУММА(СгруппированныеОстатки.СчетчикПериодов) >= &ВсегоПериодов - СгруппированныеОстатки.НомерПериода + 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	НомерГТД,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СгруппированныеОстатки.Период КАК Период,
	|	СгруппированныеОстатки.Организация КАК Организация,
	|	СгруппированныеОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СгруппированныеОстатки.ВидЗапасов КАК ВидЗапасов,
	|	СгруппированныеОстатки.НомерГТД КАК НомерГТД,
	|	ДатыПоступленияТоваровОрганизаций.ДатаПоступления КАК ДатаПоступления,
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	КлючиАналитикиУчетаНоменклатуры.Серия КАК Серия,
	|	КлючиАналитикиУчетаНоменклатуры.МестоХранения КАК Склад,
	|	КлючиАналитикиУчетаНоменклатуры.Назначение КАК Назначение,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПередачи, // для заполнения ВозвратТоваровМеждуОрганизациями 
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатурыОтгрузки,  // для заполнения ВозвратТоваровМеждуОрганизациями
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасовОтгрузки,  // для заполнения ВозвратТоваровМеждуОрганизациями
	|	0 КАК СуммаОстаток,
	|	СгруппированныеОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СгруппированныеОстатки.КоличествоПоРНПТОстаток КАК КоличествоПоРНПТОстаток,
	|	СгруппированныеОстатки.СчетчикПериодов КАК СчетчикПериодов
	|ПОМЕСТИТЬ ТекстТаблицаОстатков
	|ИЗ
	|	СгруппированныеОстатки КАК СгруппированныеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыПоступленияТоваровОрганизаций КАК ДатыПоступленияТоваровОрганизаций
	|		ПО СгруппированныеОстатки.ВидЗапасов = ДатыПоступленияТоваровОрганизаций.ВидЗапасов
	|			И СгруппированныеОстатки.АналитикаУчетаНоменклатуры = ДатыПоступленияТоваровОрганизаций.АналитикаУчетаНоменклатуры
	|			И СгруппированныеОстатки.НомерГТД = ДатыПоступленияТоваровОрганизаций.НомерГТД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО СгруппированныеОстатки.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка";
	
	ПараметрыДополнения = ПараметрыДополненияЗапросаОстаткамиНаКаждыйМесяц();
	ЗаполнитьЗначенияСвойств(ПараметрыДополнения, ПараметрыЗаполненияВидовЗапасов);
	
	ОкончаниеПериодаКонтроля = Неопределено;
	ДокументОбъект.ДополнительныеСвойства.Свойство("ОкончаниеПериодаПомощникаИсправленияОстатков", ОкончаниеПериодаКонтроля);
	#Удаление
	ПараметрыДополнения.ОкончаниеПериодаКонтроля = ОкончаниеПериодаКонтроля;
	#КонецУдаления
	#Вставка
	//Смарт Каратеев ++
	///ПараметрыДополнения.ОкончаниеПериодаКонтроля = ОкончаниеПериодаКонтроля;
	ПараметрыДополнения.ОкончаниеПериодаКонтроля = МинимальнаяДатаОстатков;
	//Каратеев --
	#КонецВставки
	
	#Вставка
	//++ #Б1444 смарт: Шляпников 26.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль партий товаров.
	ОтборПоГарантийнымЗапчастям = Ложь;
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДокументОбъект.Ссылка));
	Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
			ПараметрыДополнения.Вставить("смартОтборПоГарантийнымЗапчастям", ДокументОбъект.смартЗапчастиГарантийные);
		КонецЕсли;
	КонецЕсли;
	
	//++ #1932 смарт: Шляпников 21.01.2025 / Раздельный учет товаров. Гарантийные запчасти. Дополнение
	//перемещение на склад ГАРАНТИЯ со склада Инженера, по заявке на гарантийный ремонт.
	//в этом случае списываем ТОЛЬКО служебное ГТД "смартГарантийнаяЗапчасть"
	ПараметрыДополнения.Вставить("смартВариантОтбораПоГТД", 3);
	
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров")
		И ЗначениеЗаполнено(ДокументОбъект.ЗаказНаПеремещение)
		И ЗначениеЗаполнено(ДокументОбъект.ЗаказНаПеремещение.ДокументОснование)
		И ТипЗнч(ДокументОбъект.ЗаказНаПеремещение.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт")
		И ДокументОбъект.СкладПолучатель = Справочники.смартПредопределенныеЗначения.СкладГарантийныхЗапчастейПоУмолчанию.Значение Тогда
		
		ПараметрыДополнения.Вставить("смартВариантОтбораПоГТД", 1);
		
	КонецЕсли;
	//-- #1932 смарт: Шляпников 21.01.2025
	//-- #Б1444 смарт: Шляпников 26.11.2024
	
	//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.СборкаТоваров") И ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		ПараметрыДополнения.Вставить("ВсеГТД", Истина);
	КонецЕсли;
	//-- #Б2972 смарт: Шляпников 07.11.2025
	#КонецВставки
	
	ВсегоПериодов = ДополнитьЗапросКонтролемОстатковНаКаждыйМесяц(Запрос,
																	ТекстЗапроса,
																	ПараметрыДополнения,
																	МинимальнаяДатаОстатков,
																	ДатыОстатков);
	
	Если ПараметрыЗаполненияВидовЗапасов.ПодбиратьЗапасыРазныхПериодов Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТекстТаблицаОстатков", "ТаблицаОстатковПоПериодам");
		Запрос.УстановитьПараметр("ПериодЗаполнения", МинимальнаяДатаОстатков);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТекстТаблицаОстатков", "ТаблицаОстатков");
		Запрос.УстановитьПараметр("ПериодЗаполнения", Дата(1,1,1));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПередачаТоваровМеждуОрганизациями") Тогда
		Запрос.УстановитьПараметр("КорОрганизация", ПараметрыЗаполненияВидовЗапасов.ПриПодбореПоИнтеркампаниИсключатьОрганизации);
	Иначе
		Запрос.УстановитьПараметр("КорОрганизация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("ТаблицаРезервыТоваровОрганизаций") Тогда
		СформированныеРезервы = ДокументОбъект.ДополнительныеСвойства.ТаблицаРезервыТоваровОрганизаций.Скопировать();
	Иначе
		СформированныеРезервы = РегистрыНакопления.РезервыТоваровОрганизаций.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТСторноРезервов") <> Неопределено Тогда
		ЗапросСторно = Новый Запрос("ВЫБРАТЬ * ИЗ ВТСторноРезервов");
		ЗапросСторно.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ОбщегоНазначенияУТ.ДобавитьСтрокиВТаблицу(СформированныеРезервы, ЗапросСторно.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТРезервыПоОрганизациямДляКонтроля") <> Неопределено Тогда
		ЗапросРезервыДругихОрганизаций = Новый Запрос("ВЫБРАТЬ * ИЗ ВТРезервыПоОрганизациямДляКонтроля");
		ЗапросРезервыДругихОрганизаций.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ОбщегоНазначенияУТ.ДобавитьСтрокиВТаблицу(СформированныеРезервы, ЗапросРезервыДругихОрганизаций.Выполнить().Выгрузить());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(МинимальнаяДатаОстатков));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(МинимальнаяДатаОстатков));
	Запрос.УстановитьПараметр("ГраницаМесяца", Новый Граница(КонецМесяца(МинимальнаяДатаОстатков), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаДня", Новый Граница(КонецДня(МинимальнаяДатаОстатков), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаДокумента", МинимальнаяДатаОстатков);
	Запрос.УстановитьПараметр("ВычитатьДвиженияПоТоварамОрганизаций", ВычитатьДвиженияПоТоварамОрганизаций);
	Запрос.УстановитьПараметр("СформированныеРезервы", СформированныеРезервы);
	Запрос.УстановитьПараметр("КорВидыЗапасов", ПараметрыЗаполненияВидовЗапасов.КорВидыЗапасов);
	Запрос.УстановитьПараметр("ЭтоВыкупТоваров", Ложь);
	Запрос.УстановитьПараметр("ДатаТекущихОстатков", ?(ПараметрыЗаполненияВидовЗапасов.ПодбиратьЗапасыРазныхПериодов,
														КонецМесяца(ТекущаяДатаСеанса()),
														Дата(1, 1, 1)));
	Запрос.УстановитьПараметр("ПодбиратьЗапасыРазныхПериодов", ПараметрыЗаполненияВидовЗапасов.ПодбиратьЗапасыРазныхПериодов);
	Запрос.УстановитьПараметр("ВсегоПериодов", ВсегоПериодов);
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ ДвиженияДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СформированныеРезервы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДатыПоступленияТоваровОрганизаций
	|";
	
	Запрос.Выполнить();
	
	ПараметрыЗаполненияВидовЗапасов.КоличествоПериодовПриФормированииРезервовОрганизаций = ВсегоПериодов;
	
КонецПроцедуры

&ИзменениеИКонтроль("ДополнитьЗапросКонтролемОстатковНаКаждыйМесяц")
Функция смарт_ДополнитьЗапросКонтролемОстатковНаКаждыйМесяц(Запрос, ТекстЗапроса, ПараметрыДополнения, МинимальнаяДатаОстатков, ДатыОстатков)

	КонецМесяцаДатыПоследнегоДвижения = КонецМесяца(ДатаПоследнегоДвижения());
	КонецТекущегоМесяца = КонецМесяца(ТекущаяДатаСеанса());

	// За последние три года возможна налоговая проверка.
	ТриГодаНазад = ДобавитьМесяц(КонецТекущегоМесяца, -36);
	НачальныйМесяц = КонецМесяца(Макс(МинимальнаяДатаОстатков, ТриГодаНазад));
	Если ЗначениеЗаполнено(ПараметрыДополнения.ОкончаниеПериодаКонтроля) Тогда
		НачальныйМесяц = КонецМесяца(Мин(ПараметрыДополнения.ОкончаниеПериодаКонтроля, НачальныйМесяц));
		КонечныйМесяц = КонецМесяца(ПараметрыДополнения.ОкончаниеПериодаКонтроля);
	Иначе
		КонечныйМесяц = КонецМесяца(Макс(КонецМесяцаДатыПоследнегоДвижения, КонецТекущегоМесяца, НачальныйМесяц));
	КонецЕсли;

	МесяцыКонтроля = Новый Соответствие;
	ТекущийМесяц = НачальныйМесяц;
	Пока ТекущийМесяц <= КонечныйМесяц Цикл
		МесяцыКонтроля.Вставить(ТекущийМесяц);
		ТекущийМесяц = КонецМесяца(КонецМесяца(ТекущийМесяц) + 1);
	КонецЦикла;

	ТекстВТОстаткиПоМесяцамШаблон = 
	"ВЫБРАТЬ
	|	&ТекстПериод КАК Период,
	|	ШаблонОстаткиНаМесяц.Организация КАК Организация,
	|	ШаблонОстаткиНаМесяц.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ШаблонОстаткиНаМесяц.ВидЗапасов КАК ВидЗапасов,
	|	ШаблонОстаткиНаМесяц.НомерГТД КАК НомерГТД,
	|	СУММА(ШаблонОстаткиНаМесяц.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(&ТекстПериод, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ШаблонОстаткиНаМесяц.КоличествоПоРНПТОстаток)
	|	КОНЕЦ КАК КоличествоПоРНПТОстаток
	|ПОМЕСТИТЬ ШаблонОстаткиНаМесяц
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Организация КАК Организация,
	|		Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Остатки.ВидЗапасов КАК ВидЗапасов,
	|		Остатки.НомерГТД КАК НомерГТД,
	|		Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|		Остатки.КоличествоПоРНПТОстаток КАК КоличествоПоРНПТОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				&ШаблонГраницаНаМесяц,
	#Вставка
	//++ #Б1444 смарт: Шляпников 26.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль партий товаров.
	|				(&смартУсловиеГарантийныеЗапчасти) И
	//-- #Б1444 смарт: Шляпников 26.11.2024
	#КонецВставки
	|				(//%ТекстОтборНомерГТД% АналитикаУчетаНоменклатуры, Организация, ВидЗапасов) В
	|					(ВЫБРАТЬ
	|						//%ТекстВыборкаДляОтбораНомерГТД%
	|						ВТОтборы.АналитикаУчетаНоменклатуры,
	|						ВТОтборы.Организация,
	|						ВТОтборы.ВидЗапасов
	|					ИЗ
	|						ВТОтборыОстатковОрганизаций КАК ВТОтборы)) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Остатки.Организация,
	|		Остатки.АналитикаУчетаНоменклатуры,
	|		Остатки.ВидЗапасов,
	|		Остатки.НомерГТД,
	|		Остатки.КоличествоОстаток,
	|		Остатки.КоличествоПоРНПТОстаток
	|	ИЗ
	|		РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
	|				&ШаблонГраницаНаМесяц,
	#Вставка
	//++ #Б1444 смарт: Шляпников 26.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль партий товаров.
	|				(&смартУсловиеГарантийныеЗапчасти) И
	//-- #Б1444 смарт: Шляпников 26.11.2024
	#КонецВставки
	|				(//%ТекстОтборНомерГТД% АналитикаУчетаНоменклатуры, Организация, ВидЗапасов) В
	|					(ВЫБРАТЬ
	|						//%ТекстВыборкаДляОтбораНомерГТД%
	|						ВТОтборы.АналитикаУчетаНоменклатуры,
	|						ВТОтборы.Организация,
	|						ВТОтборы.ВидЗапасов
	|					ИЗ
	|						ВТОтборыОстатковОрганизаций КАК ВТОтборы)) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокумента.Организация,
	|		ДвиженияДокумента.АналитикаУчетаНоменклатуры,
	|		ДвиженияДокумента.ВидЗапасов,
	|		ДвиженияДокумента.НомерГТД,
	|		-ДвиженияДокумента.Количество,
	|		-ДвиженияДокумента.КоличествоПоРНПТ
	|	ИЗ
	|		ДвиженияДокумента КАК ДвиженияДокумента
	|	ГДЕ
	|		(&ТекстЭтоПоследниеДвижения
	|		ИЛИ ДвиженияДокумента.Период <= &ШаблонКонецМесяца)
	|		И ДвиженияДокумента.Период >= &НачалоМесяцаМинимальнойДатыОстатков
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТОтборы.Организация,
	|		ВТОтборы.АналитикаУчетаНоменклатуры,
	|		ВТОтборы.ВидЗапасов,
	|		//%ТекстВыборкаНомерГТД%
	|		0,
	|		0
	|	ИЗ
	|		ВТОтборыОстатковОрганизаций КАК ВТОтборы
	|	
	|	//%ТекстПриходуемыеВидыЗапасов%
	|	
	|		) КАК ШаблонОстаткиНаМесяц
	|	
	|СГРУППИРОВАТЬ ПО
	|	ШаблонОстаткиНаМесяц.Организация,
	|	ШаблонОстаткиНаМесяц.АналитикаУчетаНоменклатуры,
	|	ШаблонОстаткиНаМесяц.ВидЗапасов,
	|	ШаблонОстаткиНаМесяц.НомерГТД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	НомерГТД";

	ТекстЗапросаНаМесяцШаблон = 
	"ВЫБРАТЬ
	|	&ТекстВыборкаПериода КАК Период,
	|	ШаблонОстаткиНаМесяц.Организация КАК Организация,
	|	ШаблонОстаткиНаМесяц.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ШаблонОстаткиНаМесяц.ВидЗапасов КАК ВидЗапасов,
	|	ШаблонОстаткиНаМесяц.НомерГТД КАК НомерГТД,
	|	1 КАК СчетчикПериодов,
	|	&ТекстНомерПериода КАК НомерПериода,
	|	ШаблонОстаткиНаМесяц.КоличествоОстаток КАК КоличествоОстаток,
	|	&ТекстКоличествоПоРНПТОстаток КАК КоличествоПоРНПТОстаток
	|ИЗ
	|	ШаблонОстаткиНаМесяц КАК ШаблонОстаткиНаМесяц";

	#Вставка
	//++ #Б1444 смарт: Шляпников 26.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль партий товаров.
	МассивУсловийОтбораГТД = Новый Массив;
	
	Если ПараметрыДополнения.Свойство("ВсеГТД") И ПараметрыДополнения.ВсеГТД Тогда
		МассивУсловийОтбораГТД.Добавить("ИСТИНА");
	ИначеЕсли ПараметрыДополнения.Свойство("смартОтборПоГарантийнымЗапчастям") И ПараметрыДополнения.смартОтборПоГарантийнымЗапчастям Тогда
		МассивУсловийОтбораГТД.Добавить("НомерГТД.смартНеДляПродажи");
	Иначе
		МассивУсловийОтбораГТД.Добавить("НЕ ЕСТЬNULL(НомерГТД.смартНеДляПродажи, ЛОЖЬ)");
	КонецЕсли;
	
	Если ПараметрыДополнения.Свойство("смартВариантОтбораПоГТД") И ПараметрыДополнения.смартВариантОтбораПоГТД = 1 Тогда
		МассивУсловийОтбораГТД.Добавить("НомерГТД = &смартГарантийнаяЗапчасть");
	ИначеЕсли ПараметрыДополнения.Свойство("смартВариантОтбораПоГТД") И ПараметрыДополнения.смартВариантОтбораПоГТД = 2 Тогда
		МассивУсловийОтбораГТД.Добавить("НЕ НомерГТД = &смартГарантийнаяЗапчасть");
	КонецЕсли;
		
	ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "&смартУсловиеГарантийныеЗапчасти", СтрСоединить(МассивУсловийОтбораГТД, " И "));
	
	Запрос.УстановитьПараметр("смартГарантийнаяЗапчасть", Справочники.НомераГТД.смартГарантийнаяЗапчасть);
	//-- #Б1444 смарт: Шляпников 26.11.2024
	#КонецВставки
	
	Если ПараметрыДополнения.ЕстьОтборПоНомеруГТД Тогда
		ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "//%ТекстОтборНомерГТД%", "НомерГТД,");
		ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "//%ТекстВыборкаНомерГТД%", "ВТОтборы.НомерГТД,");
		ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "//%ТекстВыборкаДляОтбораНомерГТД%", "ВТОтборы.НомерГТД,");
	Иначе
		ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "//%ТекстОтборНомерГТД%", "");
		ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "//%ТекстВыборкаНомерГТД%", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),");
		ТекстВТОстаткиПоМесяцамШаблон = СтрЗаменить(ТекстВТОстаткиПоМесяцамШаблон, "//%ТекстВыборкаДляОтбораНомерГТД%", "");
	КонецЕсли;	

	МассивТекстовЗапросовПоМесяцам = Новый Массив;
	МассивВТОстаткиПоМесяцам = Новый Массив;

	СчетчикПериодов = 0;

	Для Каждого МесяцКонтроля из МесяцыКонтроля Цикл

		ТекущийМесяц = МесяцКонтроля.Ключ;
		СчетчикПериодов = СчетчикПериодов + 1;
		ЭтоПоследниеДвижения = КонецМесяцаДатыПоследнегоДвижения = ТекущийМесяц;

		// Текстовое представление каждого месяца, например: 20160630
		СтрокаТекущийМесяц = Формат(ТекущийМесяц, ФорматДатыВИмениВТ());

		ТекстЗапросаВТОстаткиНаТекущийМесяц = ТекстВТОстаткиПоМесяцамШаблон;

		Если ПараметрыДополнения.ЕстьТаблицаПриходуемыхВидовЗапасов Тогда

			ТекстПриходуемыеВидыЗапасов =
			"ВЫБРАТЬ //Дополнительные виды запасов, приходуемые документом
			|	ТаблицаВидыЗапасов.Организация                КАК Организация,
			|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	ТаблицаВидыЗапасов.ВидЗапасов                 КАК ВидЗапасов,
			|	ТаблицаВидыЗапасов.НомерГТД                   КАК НомерГТД,
			|	ТаблицаВидыЗапасов.Количество                 КАК Количество,
			|	ТаблицаВидыЗапасов.КоличествоПоРНПТ           КАК КоличествоПоРНПТ
			|ИЗ
			|	ИмяТаблицыПриходуемыхВидовЗапасов КАК ТаблицаВидыЗапасов
			|ГДЕ
			|	&ТекстЭтоПоследниеДвижения ИЛИ ТаблицаВидыЗапасов.Период <= &ТекстПериод";

			ТекстПриходуемыеВидыЗапасов = СтрЗаменить(ТекстПриходуемыеВидыЗапасов,
			"ИмяТаблицыПриходуемыхВидовЗапасов",
			ПараметрыДополнения.ИмяТаблицыПриходуемыхВидовЗапасов);
			ТекстЗапросаВТОстаткиНаТекущийМесяц = СтрЗаменить(ТекстЗапросаВТОстаткиНаТекущийМесяц,
			"//%ТекстПриходуемыеВидыЗапасов%",
			ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
			+ ТекстПриходуемыеВидыЗапасов);

		КонецЕсли;

		Если ПараметрыДополнения.ПодбиратьЗапасыРазныхПериодов Тогда

			Для Каждого СтрМас из ДатыОстатков Цикл

				ТекстКоличествоПоРНПТОстаток = 
				"ВЫБОР
				|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
				|				ИЛИ НАЧАЛОПЕРИОДА(&ТекстВыборкаПериода, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
				|			ТОГДА 0
				|		ИНАЧЕ ШаблонОстаткиНаМесяц.КоличествоПоРНПТОстаток
				|	КОНЕЦ";

				ТекстЗапросаНаТекущийМесяц = ТекстЗапросаНаМесяцШаблон;
				ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц, "&ТекстКоличествоПоРНПТОстаток", ТекстКоличествоПоРНПТОстаток);
				ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц, "ШаблонОстаткиНаМесяц", ИмяВтОстаткиНаКонецМесяца(ТекущийМесяц));
				КонецМесяцаПолучаемыхОстатков = КонецМесяца(СтрМас);

				// Контролируемый месяц больше месяца этой итерации
				Если ТекущийМесяц >= КонецМесяцаПолучаемыхОстатков
					// или месяц этой итерации находится в будущем периоде.
					Или КонецМесяцаПолучаемыхОстатков > КонецТекущегоМесяца Тогда

					СтрокаДатыОстатков = Формат(КонецМесяцаПолучаемыхОстатков, ФорматДатыВИмениВТ());

					ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц,
					"&ТекстВыборкаПериода",
					"&Конец" + СтрокаДатыОстатков);

					НомерПериода = Год(КонецМесяцаПолучаемыхОстатков) * 12 + Месяц(КонецМесяцаПолучаемыхОстатков)
					- Год(МинимальнаяДатаОстатков) * 12 - Месяц(МинимальнаяДатаОстатков) + 1;

					ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц,
					"&ТекстНомерПериода",
					Формат(НомерПериода, "ЧН=0; ЧГ="));

					МассивТекстовЗапросовПоМесяцам.Добавить(ТекстЗапросаНаТекущийМесяц);

					Запрос.УстановитьПараметр("Конец" + СтрокаДатыОстатков, КонецМесяцаПолучаемыхОстатков);

				КонецЕсли;

			КонецЦикла;

		Иначе

			ТекстКоличествоПоРНПТОстаток = "ШаблонОстаткиНаМесяц.КоличествоПоРНПТОстаток";

			ТекстЗапросаНаТекущийМесяц = ТекстЗапросаНаМесяцШаблон;
			ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц, "&ТекстКоличествоПоРНПТОстаток", ТекстКоличествоПоРНПТОстаток);
			ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц, "ШаблонОстаткиНаМесяц", ИмяВтОстаткиНаКонецМесяца(ТекущийМесяц));
			ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц, "&ТекстВыборкаПериода", "ДАТАВРЕМЯ(1,1,1)");
			ТекстЗапросаНаТекущийМесяц = СтрЗаменить(ТекстЗапросаНаТекущийМесяц, "&ТекстНомерПериода", "1");
			МассивТекстовЗапросовПоМесяцам.Добавить(ТекстЗапросаНаТекущийМесяц);

		КонецЕсли;

		ТекстЗапросаВТОстаткиНаТекущийМесяц = СтрЗаменить(ТекстЗапросаВТОстаткиНаТекущийМесяц, "ШаблонОстаткиНаМесяц", ИмяВтОстаткиНаКонецМесяца(ТекущийМесяц));
		ТекстЗапросаВТОстаткиНаТекущийМесяц = СтрЗаменить(ТекстЗапросаВТОстаткиНаТекущийМесяц, "ШаблонГраницаНаМесяц", "Граница" + СтрокаТекущийМесяц);
		ТекстЗапросаВТОстаткиНаТекущийМесяц = СтрЗаменить(ТекстЗапросаВТОстаткиНаТекущийМесяц, "ШаблонКонецМесяца", "Конец" + СтрокаТекущийМесяц);
		ТекстЗапросаВТОстаткиНаТекущийМесяц = СтрЗаменить(ТекстЗапросаВТОстаткиНаТекущийМесяц, "&ТекстПериод", "&Конец" + СтрокаТекущийМесяц);

		ТекстЗапросаВТОстаткиНаТекущийМесяц = СтрЗаменить(ТекстЗапросаВТОстаткиНаТекущийМесяц, "&ТекстЭтоПоследниеДвижения", ?(ЭтоПоследниеДвижения, "ИСТИНА", "ЛОЖЬ"));

		МассивВТОстаткиПоМесяцам.Добавить(ТекстЗапросаВТОстаткиНаТекущийМесяц);

		Если ТекущийМесяц >= КонецМесяцаДатыПоследнегоДвижения Тогда
			Запрос.УстановитьПараметр("Граница" + СтрокаТекущийМесяц, Неопределено);
		Иначе
			Запрос.УстановитьПараметр("Граница" + СтрокаТекущийМесяц, Новый Граница(ТекущийМесяц, ВидГраницы.Включая));
		КонецЕсли;

		Запрос.УстановитьПараметр("Конец" + СтрокаТекущийМесяц, ТекущийМесяц);

	КонецЦикла;

	Если ПараметрыДополнения.ПодбиратьЗапасыРазныхПериодов Тогда
		Запрос.УстановитьПараметр("ПериодЗаполнения", МинимальнаяДатаОстатков);
		Запрос.УстановитьПараметр("НачалоМесяцаМинимальнойДатыОстатков", НачалоМесяца(МинимальнаяДатаОстатков));
	Иначе
		Запрос.УстановитьПараметр("ПериодЗаполнения", Дата(1,1,1));
		Запрос.УстановитьПараметр("НачалоМесяцаМинимальнойДатыОстатков",  Дата(1,1,1));
	КонецЕсли;

	ТекстОстаткиПоМесяцам	= СтрСоединить(МассивТекстовЗапросовПоМесяцам,
	ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	ТекстВТОстаткиПоМесяцам	= СтрСоединить(МассивВТОстаткиПоМесяцам,
	ОбщегоНазначенияУТ.РазделительЗапросовВПакете()) + ОбщегоНазначенияУТ.РазделительЗапросовВПакете();

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ТекстОстаткиПоМесяцам%", ТекстОстаткиПоМесяцам);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ТекстВТОстаткиПоМесяцам%", ТекстВТОстаткиПоМесяцам);

	Возврат СчетчикПериодов;

КонецФункции

&ИзменениеИКонтроль("ПроверитьНеобходимостьПерезаполненияВидовЗапасовДокумента")
Функция смарт_ПроверитьНеобходимостьПерезаполненияВидовЗапасовДокумента(ДокументОбъектИлиДопСвойства, Запрос)

	ИмяДопСвойства = ИмяДопСвойстваДляПерезаполненияВидовЗапасов();

	ПерезаполнитьВидыЗапасов = ?(ТипЗнч(ДокументОбъектИлиДопСвойства) = Тип("Структура"),
	ДокументОбъектИлиДопСвойства.Свойство(ИмяДопСвойства),
	ДокументОбъектИлиДопСвойства.ДополнительныеСвойства.Свойство(ИмяДопСвойства));

	#Вставка
	//++ #Б1444 смарт: Шляпников 26.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль партий товаров.
	Если НЕ ПерезаполнитьВидыЗапасов Тогда
		Если НЕ ТипЗнч(ДокументОбъектИлиДопСвойства) = Тип("Структура") 
				И ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ДокументОбъектИлиДопСвойства.Метаданные())
				И ЗначениеЗаполнено(ДокументОбъектИлиДопСвойства.Ссылка)
				И ДокументОбъектИлиДопСвойства.Ссылка.смартЗапчастиГарантийные <> ДокументОбъектИлиДопСвойства.смартЗапчастиГарантийные Тогда
				
			ПерезаполнитьВидыЗапасов = Истина;
			ДокументОбъектИлиДопСвойства.ДополнительныеСвойства.Вставить(ИмяДопСвойства, Истина);
			
			НаборЗаписейТоварыОрганизаций = РегистрыНакопления.ТоварыОрганизаций.СоздатьНаборЗаписей();
			НаборЗаписейТоварыОрганизаций.Отбор.Регистратор.Установить(ДокументОбъектИлиДопСвойства.Ссылка, Истина);
			НаборЗаписейТоварыОрганизаций.Записать(Истина);
			
		КонецЕсли;
	КонецЕсли;
	//-- #Б1444 смарт: Шляпников 26.11.2024
	#КонецВставки
	
	Если Запрос <> Неопределено Тогда
		Запрос.УстановитьПараметр(ИмяДопСвойства, ПерезаполнитьВидыЗапасов);
	КонецЕсли;

	Возврат ПерезаполнитьВидыЗапасов;

КонецФункции

&ИзменениеИКонтроль("ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы")
Процедура смарт_ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы(ДокументОбъект, МенеджерВременныхТаблиц, Отказ, ПараметрыЗаполненияВидовЗапасов)

	ТаблицаОшибок			= ТаблицаОшибокЗаполненияВидовЗапасов();
	ДополнительныеСвойства	= ДокументОбъект.ДополнительныеСвойства;

	Если ПараметрыЗаполненияВидовЗапасов.ТаблицаВидыЗапасов <> Неопределено Тогда
		ТаблицаВидыЗапасов = ПараметрыЗаполненияВидовЗапасов.ТаблицаВидыЗапасов;
	Иначе
		ТаблицаВидыЗапасов = ДокументОбъект[ПараметрыЗаполненияВидовЗапасов.ИмяТЧВидыЗапасов].ВыгрузитьКолонки();
	КонецЕсли;

	КонтролироватьИзменениеНомеровГТД = ДополнительныеСвойства.Свойство("КонтролироватьИзменениеНомеровГТД");

	Если КонтролироватьИзменениеНомеровГТД Тогда
		ТаблицаНомеровГТД = ТаблицаВидыЗапасов.Скопировать(, "АналитикаУчетаНоменклатуры, НомерГТД, Количество");
	КонецЕсли;

	ВидЗапасовПоУмолчанию	= Неопределено;
	ТаблицаНовыеРезервы		= РегистрыНакопления.РезервыТоваровОрганизаций.СоздатьНаборЗаписей().ВыгрузитьКолонки();

	ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию =
	ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию(ПараметрыЗаполненияВидовЗапасов);

	СтруктураДанныхСтроки = Новый Структура("
	|Склад,
	|Количество,
	|КоличествоПоРНПТ,
	|СуммаСНДС,
	|СтавкаНДС,
	|СуммаНДС,
	|СуммаВознаграждения,
	|СуммаНДСВознаграждения,
	|АналитикаУчетаНоменклатурыОтгрузки,
	|ВидЗапасовОтгрузки,
	|ДокументПередачи,
	|ЗаказКлиента,
	|НедостаточноОстатковТоваровОрганизаций");

	СтруктураВидаЗапасовПоУмолчанию = Новый Структура("
	|ГруппаФинансовогоУчета,
	|ВладелецТовара,
	|Контрагент,
	|Соглашение,
	|Договор,
	|Валюта,
	|НалогообложениеНДС,
	|НалогообложениеОрганизации,
	|ТипЗапасов,
	|ВидЦены");

	Запрос = ЗапросРаспределенияСУчетомПриоритетовТаблицыТоваровНаТаблицуОстатков(МенеджерВременныхТаблиц,
	ДополнительныеСвойства);

	МассивРезультатов = Запрос.ВыполнитьПакет();

	ВыборкаДанныеДокумента	= МассивРезультатов[1].Выбрать();
	ВыборкаТаблицаТоваров	= МассивРезультатов[2].Выбрать();
	ВыборкаОстаткиПоСтрокам	= МассивРезультатов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВыборкаДанныеДокумента.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураВидаЗапасовПоУмолчанию, ВыборкаДанныеДокумента);
	ПередачаПодДеятельность = ВыборкаДанныеДокумента.НалогообложениеНДС;
	Организация = ВыборкаДанныеДокумента.Организация;
	ХозяйственнаяОперация = ВыборкаДанныеДокумента.ХозяйственнаяОперация;

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов Тогда
		ТекстИсключения = НСтр("ru = 'Функция ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы не предназначена для вызова с хозяйственной операцией %ХозяйственнаяОперация%'");	
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ХозяйственнаяОперация%", ХозяйственнаяОперация);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;

	ВидыЗапасовПоУмолчанию = Новый ТаблицаЗначений;
	ВидыЗапасовПоУмолчанию.Колонки.Добавить("ВидЗапасов",
	Новый ОписаниеТипов("СправочникСсылка.ВидыЗапасов"));
	ВидыЗапасовПоУмолчанию.Колонки.Добавить("ВидЦены",
	Новый ОписаниеТипов("СправочникСсылка.ВидыЦенПоставщиков"));
	ВидыЗапасовПоУмолчанию.Колонки.Добавить("ГруппаФинансовогоУчета",
	Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"));

	ПроводитьБезКонтроляОстатковТоваровОрганизаций = ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций
	Или Не Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить();

	Пока ВыборкаОстаткиПоСтрокам.Следующий() Цикл

		КоличествоТовара				= ВыборкаОстаткиПоСтрокам.Количество;
		КоличествоТовараПоРНПТ			= ВыборкаОстаткиПоСтрокам.КоличествоПоРНПТ;
		СуммаТовараСНДС					= ВыборкаОстаткиПоСтрокам.СуммаСНДС;
		СуммаНДСТовара					= ВыборкаОстаткиПоСтрокам.СуммаНДС;
		СуммаВознагражденияВсего		= ВыборкаОстаткиПоСтрокам.СуммаВознаграждения;
		СуммаНДСВознагражденияВсего		= ВыборкаОстаткиПоСтрокам.СуммаНДСВознаграждения;

		// Детальные записи
		Выборка = ВыборкаОстаткиПоСтрокам.Выбрать();

		Пока Выборка.Следующий() Цикл

			#Вставка
			//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
			Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.СборкаТоваров") И ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
				Если Выборка.Номенклатура.ВестиУчетПоГТД Тогда
					
					НеУказанНомерГТД = Ложь;
					
					ТекущаяСтрокаДокумента = ДокументОбъект.Товары[Выборка.НомерСтроки - 1];
					ГарантийнаяЗапчасть = (ДокументОбъект.смартЗапчастиГарантийные ИЛИ ТекущаяСтрокаДокумента.смартЗапчастиГарантийные);
						
					Если НЕ ЗначениеЗаполнено(Выборка.НомерГТД) И ГарантийнаяЗапчасть Тогда
						Продолжить;
					ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.НомерГТД) Тогда
						//не гарантийные запчасти позволяем проводить с пустым ГТД
					ИначеЕсли Выборка.НомерГТД.смартНеДляПродажи <> ГарантийнаяЗапчасть Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			//-- #Б2972 смарт: Шляпников 07.11.2025
			#КонецВставки
			
			ЗаполнитьСтруктуруПоСтрокеТоваров(СтруктураВидаЗапасовПоУмолчанию, Выборка, ВыборкаДанныеДокумента);

			ПродажаНаЭкспортКомиссионногоТовара = Ложь;

			Если ЗначениеЗаполнено(Выборка.ВидЗапасов) Тогда

				ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение = ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение(
				ПараметрыЗаполненияВидовЗапасов,
				Выборка);

				Если Выборка.ОрганизацияОстатка = Организация
					И (Выборка.ТипЗапасов = Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи
					И (ВРег(ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение) = ВРег("ПоНастройкамДоговора")
					Или ВРег(ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение) = ВРег("Всегда"))
					Или Выборка.ТипЗапасов <> Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи) Тогда

					ВидЗапасов = Выборка.ВидЗапасов;

				ИначеЕсли Выборка.НастройкаПередачи = Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию
					И ПередачаПодДеятельность <> Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт 
					И ПередачаПодДеятельность <> Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров
					И ПередачаПодДеятельность <> Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг Тогда

					// Должен быть сгенерирован комиссионный товар,
					// остатки по которому позже будут закрыты документом передачи на комиссию.
					Если Выборка.НовыйВидЗапасовЭтоСубкомиссия Тогда
						// сохраняется исходное налогообложение, под которое был принят товар на комиссию
						НалогообложениеКомиссионногоВидаЗапасов = Выборка.НовыйВидЗапасовНалогообложениеКомитента;
					Иначе

						// налогообложение определяется по организации-комитенту.
						ПараметрыУчетаПоОрганизации = УчетНДСУП.ПараметрыУчетаПоОрганизации(
						Выборка.НовыйВидЗапасовВладелецТовара,
						ДокументОбъект.Дата);

						НалогообложениеКомиссионногоВидаЗапасов = ПараметрыУчетаПоОрганизации.ОсновноеНалогообложениеНДСПродажи;

					КонецЕсли;

					СтруктураВидаЗапасовПоУмолчанию.НалогообложениеНДС = НалогообложениеКомиссионногоВидаЗапасов;

					ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
					Организация,
					Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию,
					СтруктураВидаЗапасовПоУмолчанию);

				ИначеЕсли Выборка.НастройкаПередачи = Перечисления.СпособыПередачиТоваров.Продажа Тогда

					ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
					Организация,
					Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию,
					СтруктураВидаЗапасовПоУмолчанию);

				ИначеЕсли Выборка.ОрганизацияОстатка = Организация
					И ЗначениеЗаполнено(Выборка.ВладелецТовара) Тогда

					ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(Организация,
					Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию,
					СтруктураВидаЗапасовПоУмолчанию);

				Иначе // при настройках интеркампани - передача на комиссию, нельзя продавать на экспорт.
					ВидЗапасов = Справочники.ВидыЗапасов.ПустаяСсылка();
					ПродажаНаЭкспортКомиссионногоТовара = Истина;
				КонецЕсли;

			Иначе
				ВидЗапасов = Справочники.ВидыЗапасов.ПустаяСсылка();
			КонецЕсли;

			КоличествоОстаток				= Выборка.КоличествоОстаток;
			КоличествоОстатокВсего			= Выборка.КоличествоОстатокВсего;
			КоличествоПоРНПТОстатокВсего	= Выборка.КоличествоПоРНПТОстатокВсего;
			СуммаОстаток					= Выборка.СуммаОстаток;
			НеУказанНомерГТД				= Ложь;

			Если (ЗначениеЗаполнено(ВидЗапасов)
				И Выборка.ВидЗапасов <> ВидЗапасов
				И СтруктураВидаЗапасовПоУмолчанию.ТипЗапасов = Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
				// По ТоварНаХраненииСПравомПродажи не может быть прихода резерва
				Или Выборка.НеУказанНомерГТД
				Или ПродажаНаЭкспортКомиссионногоТовара Тогда

				КоличествоОстаток				= 0;
				КоличествоОстатокВсего			= 0;
				КоличествоПоРНПТОстатокВсего	= 0;
				СуммаОстаток					= 0;
				НеУказанНомерГТД				= Выборка.НеУказанНомерГТД;

			ИначеЕсли (КоличествоТовара > 0 И КоличествоОстаток > 0)
				Или (КоличествоТовара < 0 И КоличествоОстаток < 0) Тогда

				НоваяСтрока = ТаблицаВидыЗапасов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

				Если ЗначениеЗаполнено(ВидЗапасов) Тогда
					НоваяСтрока.ВидЗапасов = ВидЗапасов;
				Иначе
					ТекстИсключения = НСтр("ru = 'Ненулевое количество при пустом виде запасов.'");

					ВызватьИсключение ТекстИсключения;
				КонецЕсли;

				Если КоличествоТовара > 0 Тогда

					Количество = Мин(КоличествоТовара, КоличествоОстаток);

					Если СуммаОстаток <> 0 Тогда
						СуммаОстаток	= Макс(СуммаОстаток, 0);
						СуммаСНДС		= ?(КоличествоОстаток = Количество,
						СуммаОстаток,
						Мин(СуммаТовараСНДС, СуммаОстаток));
					Иначе
						СуммаСНДС = ?(КоличествоТовара <> 0,
						Окр(Количество * СуммаТовараСНДС / КоличествоТовара, 2, 1),
						0);
					КонецЕсли;

				Иначе

					Количество = Макс(КоличествоТовара, КоличествоОстаток);

					Если СуммаОстаток <> 0 Тогда
						СуммаОстаток = Мин(СуммаОстаток, 0);
						СуммаСНДС = ?(КоличествоОстаток = Количество,
						СуммаОстаток,
						Макс(СуммаТовараСНДС, СуммаОстаток));
					Иначе
						СуммаСНДС = ?(КоличествоТовара <> 0,
						Окр(Количество * СуммаТовараСНДС / КоличествоТовара, 2, 1),
						0);
					КонецЕсли;

				КонецЕсли;

				ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, Выборка);

				СтруктураДанныхСтроки.Количество				= Количество;
				СтруктураДанныхСтроки.КоличествоПоРНПТ			= ?(КоличествоОстатокВсего <> 0,
				?(КоличествоОстатокВсего - Количество = 0,
				КоличествоПоРНПТОстатокВсего,
				Количество * КоличествоПоРНПТОстатокВсего / КоличествоОстатокВсего),
				0);
				СтруктураДанныхСтроки.СуммаСНДС					= СуммаСНДС;
				СтруктураДанныхСтроки.СуммаНДС					= ?(СуммаТовараСНДС <> 0,
				Окр(СуммаСНДС * СуммаНДСТовара / СуммаТовараСНДС, 2, 1),
				0);
				СтруктураДанныхСтроки.СуммаВознаграждения		= ?(КоличествоТовара <> 0,
				Окр(Количество * СуммаВознагражденияВсего / КоличествоТовара, 2, 1),
				0);
				СтруктураДанныхСтроки.СуммаНДСВознаграждения	= ?(КоличествоТовара <> 0,
				Окр(Количество * СуммаНДСВознагражденияВсего / КоличествоТовара, 2, 1),
				0);
				СтруктураДанныхСтроки.НедостаточноОстатковТоваровОрганизаций = Ложь;

				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанныхСтроки);

				// Для товаров, выкупаемых по интеркампани, формируются движения по Резервам.
				Если Выборка.ВидЗапасов <> ВидЗапасов Тогда

					ДвижениеРезерваПродавца = ТаблицаНовыеРезервы.Добавить();
					ЗаполнитьЗначенияСвойств(ДвижениеРезерваПродавца, НоваяСтрока);

					ДвижениеРезерваПродавца.ВидДвижения		= ВидДвиженияНакопления.Приход;
					ДвижениеРезерваПродавца.Период			= КонецМесяца(ВыборкаДанныеДокумента.Период);
					ДвижениеРезерваПродавца.Организация		= Организация;
					ДвижениеРезерваПродавца.КорОрганизация	= Выборка.ОрганизацияОстатка;
					ДвижениеРезерваПродавца.КорВидЗапасов	= Выборка.ВидЗапасов;

					РегистрыНакопления.РезервыТоваровОрганизаций.ДобавитьВНаборРезерваКорЗапись(ТаблицаНовыеРезервы,
					ДвижениеРезерваПродавца);

				КонецЕсли;

				КоличествоТовара			= КоличествоТовара				- СтруктураДанныхСтроки.Количество;
				КоличествоТовараПоРНПТ		= КоличествоТовараПоРНПТ		- СтруктураДанныхСтроки.КоличествоПоРНПТ;
				СуммаТовараСНДС				= СуммаТовараСНДС				- СтруктураДанныхСтроки.СуммаСНДС;
				СуммаНДСТовара				= СуммаНДСТовара				- СтруктураДанныхСтроки.СуммаНДС;
				СуммаВознагражденияВсего	= СуммаВознагражденияВсего		- СтруктураДанныхСтроки.СуммаВознаграждения;
				СуммаНДСВознагражденияВсего	= СуммаНДСВознагражденияВсего	- СтруктураДанныхСтроки.СуммаНДСВознаграждения;
				СуммаОстаток				= СуммаОстаток					- СтруктураДанныхСтроки.СуммаСНДС;

			КонецЕсли;

		КонецЦикла; // Выборка по остаткам

		Если КоличествоТовара <> 0
			ИЛИ СуммаТовараСНДС <> 0 Тогда

			Если ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию
				Или ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда

				Если Не ПараметрыЗаполненияВидовЗапасов.ВладелецТовараВШапке
					И ПараметрыЗаполненияВидовЗапасов.ТаблицаРеквизитовВидовЗапасовПоУмолчанию.Количество() = 0 Тогда

					ТекстИсключения = НСтр("ru = 'Установлен флаг получения владельца товаров из таблицы
					|реквизитов видов запасов по умолчанию, но таблица не передана.'");

					ВызватьИсключение ТекстИсключения;

				КонецЕсли;

				ВыборкаТаблицаТоваров.Сбросить();
				ВидыЗапасовПоУмолчанию.Очистить();

				ОтборСтрок = Новый Структура("НомерСтроки", ВыборкаОстаткиПоСтрокам.НомерСтроки);

				Если ВыборкаТаблицаТоваров.НайтиСледующий(ОтборСтрок) Тогда

					ВидЦены = ВыборкаТаблицаТоваров.ВидЦены;
					ГруппаФинансовогоУчета = ВыборкаТаблицаТоваров.ГруппаФинансовогоУчета;

					Если ПараметрыЗаполненияВидовЗапасов.ВладелецТовараВШапке Тогда

						Отбор = Новый Структура("ВидЦены, ГруппаФинансовогоУчета", ВидЦены, ГруппаФинансовогоУчета);
						СтрокиВидовЗапасовПоУмолчанию = ВидыЗапасовПоУмолчанию.НайтиСтроки(Отбор);

						Если СтрокиВидовЗапасовПоУмолчанию.Количество() = 0 Тогда
							ЗаполнитьЗначенияСвойств(СтруктураВидаЗапасовПоУмолчанию, Отбор);

							ВидЗапасовПоУмолчанию = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
							Организация,
							ХозяйственнаяОперация,
							СтруктураВидаЗапасовПоУмолчанию);

							НоваяСтрока = ВидыЗапасовПоУмолчанию.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
							НоваяСтрока.ВидЗапасов = ВидЗапасовПоУмолчанию;
						КонецЕсли;

					Иначе

						СтруктураВидаЗапасовПоУмолчанию.ВидЦены					= ВидЦены;
						СтруктураВидаЗапасовПоУмолчанию.ГруппаФинансовогоУчета	= ГруппаФинансовогоУчета;
						СтруктураВидаЗапасовПоУмолчанию.ВладелецТовара			= ВыборкаТаблицаТоваров.ВладелецТовара;
						СтруктураВидаЗапасовПоУмолчанию.Контрагент				= ВыборкаТаблицаТоваров.Контрагент;
						СтруктураВидаЗапасовПоУмолчанию.Договор					= ВыборкаТаблицаТоваров.Договор;
						СтруктураВидаЗапасовПоУмолчанию.ТипЗапасов				= ВыборкаТаблицаТоваров.ТипЗапасов;

						ВидЗапасовПоУмолчанию = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
						Организация,
						ХозяйственнаяОперация,
						СтруктураВидаЗапасовПоУмолчанию);

					КонецЕсли;

					НоваяСтрока = ТаблицаВидыЗапасов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТаблицаТоваров);
					НоваяСтрока.ВидЗапасов = ВидЗапасовПоУмолчанию;

					ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, ВыборкаТаблицаТоваров);

					СтруктураДанныхСтроки.Количество				= КоличествоТовара;
					СтруктураДанныхСтроки.КоличествоПоРНПТ			= КоличествоТовараПоРНПТ;
					СтруктураДанныхСтроки.СуммаСНДС					= СуммаТовараСНДС;
					СтруктураДанныхСтроки.СуммаНДС					= СуммаНДСТовара;
					СтруктураДанныхСтроки.СуммаВознаграждения		= 0;
					СтруктураДанныхСтроки.СуммаНДСВознаграждения	= 0;
					СтруктураДанныхСтроки.ЗаказКлиента				= Неопределено;
					СтруктураДанныхСтроки.НедостаточноОстатковТоваровОрганизаций = Истина;

					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанныхСтроки);

					Если Не ПараметрыЗаполненияВидовЗапасов.ВладелецТовараВШапке
						И ЗначениеЗаполнено(ВыборкаТаблицаТоваров.ТипЗапасовРезервы) Тогда

						СтруктураВидаЗапасовПоУмолчаниюРезервы = Новый Структура;

						Для Каждого ТекКлюч Из СтруктураВидаЗапасовПоУмолчанию Цикл
							СтруктураВидаЗапасовПоУмолчаниюРезервы.Вставить(ТекКлюч.Ключ, ТекКлюч.Значение);
						КонецЦикла;

						СтруктураВидаЗапасовПоУмолчаниюРезервы.ТипЗапасов = ВыборкаТаблицаТоваров.ТипЗапасовРезервы;

						// Добавляем резервы для неотрицательности остатка продукции по товарам организации
						ВидЗапасовПоУмолчаниюРезерв = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
						Организация,
						ХозяйственнаяОперация,
						СтруктураВидаЗапасовПоУмолчаниюРезервы);

						ДвижениеРезерваСобственного = ТаблицаНовыеРезервы.Добавить();
						ЗаполнитьЗначенияСвойств(ДвижениеРезерваСобственного, НоваяСтрока);
						ДвижениеРезерваСобственного.ВидДвижения		= ВидДвиженияНакопления.Приход;
						ДвижениеРезерваСобственного.Период			= ВыборкаДанныеДокумента.Период;
						ДвижениеРезерваСобственного.Организация		= Организация;
						ДвижениеРезерваСобственного.КорОрганизация	= Организация;
						ДвижениеРезерваСобственного.КорВидЗапасов	= ВидЗапасовПоУмолчаниюРезерв;

						// Добавляем резервы для отражения отрицательного неконтролируемого остатка
						РегистрыНакопления.РезервыТоваровОрганизаций.ДобавитьВНаборРезерваКорЗапись(
						ТаблицаНовыеРезервы,
						ДвижениеРезерваСобственного);

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

			Если Не ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию Тогда

				Если ПараметрыЗаполненияВидовЗапасов.СообщатьОбОшибкахЗаполнения Тогда
					Выборка = ВыборкаОстаткиПоСтрокам.Выбрать();
					Выборка.Следующий();

					НоваяСтрокаОшибок = ТаблицаОшибок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОшибок, ВыборкаТаблицаТоваров);

					НоваяСтрокаОшибок.Количество		= КоличествоТовара;
					НоваяСтрокаОшибок.ЕдиницаИзмерения	= Выборка.ЕдиницаИзмерения;
					НоваяСтрокаОшибок.НеУказанНомерГТД	= НеУказанНомерГТД;
					НоваяСтрокаОшибок.Номенклатура		= Выборка.Номенклатура;
					НоваяСтрокаОшибок.Характеристика	= Выборка.Характеристика;
					НоваяСтрокаОшибок.Серия				= Выборка.Серия;
					НоваяСтрокаОшибок.Склад				= Выборка.Склад;
					НоваяСтрокаОшибок.Назначение		= Выборка.Назначение;
				КонецЕсли;

				Если Не ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
					Отказ = Истина;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла; // Выборка по строкам документа

	Если ТаблицаОшибок.Количество() > 0
		И ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда

		ТекстСообщения = НСтр( "ru = 'Документ %Ссылка% проведен с выключенным контролем остатков товаров организаций.'", Метаданные.ОсновнойЯзык.КодЯзыка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументОбъект.Ссылка);

		ЗаписьЖурналаРегистрации(ИмяСобытияВыключенКонтрольОстатков(),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		ДокументОбъект.Ссылка,
		ТекстСообщения);

	КонецЕсли;

	Если ПараметрыЗаполненияВидовЗапасов.ТаблицаВидыЗапасов = Неопределено
		И Не Отказ Тогда

		ДокументОбъект[ПараметрыЗаполненияВидовЗапасов.ИмяТЧВидыЗапасов].Загрузить(ТаблицаВидыЗапасов);

	КонецЕсли;

	Если КонтролироватьИзменениеНомеровГТД Тогда

		ТаблицаНомеровГТД.Колонки.Добавить("НовоеКоличество");

		Для Каждого СтрокаТаблицы Из ТаблицаВидыЗапасов Цикл

			НоваяСтрока = ТаблицаНомеровГТД.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Количество = 0;
			НоваяСтрока.НовоеКоличество = СтрокаТаблицы.Количество;

		КонецЦикла;

		ТаблицаНомеровГТД.Свернуть("АналитикаУчетаНоменклатуры, НомерГТД", "Количество, НовоеКоличество");

		Для Каждого СтрокаТаблицы Из ТаблицаНомеровГТД Цикл
			Если СтрокаТаблицы.Количество <> СтрокаТаблицы.НовоеКоличество Тогда
				ДополнительныеСвойства.Вставить("ИзменилисьНомераГТД", Истина);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	СообщитьОбОшибкахКонтроляТоваровОрганизаций(ДокументОбъект, ТаблицаОшибок, ПараметрыЗаполненияВидовЗапасов);

	Если ПараметрыЗаполненияВидовЗапасов.ТаблицаНовыеРезервы <> Неопределено Тогда
		// Условие выполняется только в этапе производства. В этом документе распределение резервов по периодам при заполнении
		// видов запасов не делается - оно происходит при формировании резервов в обработке проведения.
		ПараметрыЗаполненияВидовЗапасов.Вставить("ТаблицаНовыеРезервы", ТаблицаНовыеРезервы);
	Иначе

		ТаблицаНовыеРезервы = РаспределитьРезервыТоваровОрганизацийПоПериодам(
		ПараметрыЗаполненияВидовЗапасов.КоличествоПериодовПриФормированииРезервовОрганизаций,
		ТаблицаНовыеРезервы,
		МенеджерВременныхТаблиц);

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НовыеРезервы.ВидДвижения,
		|	НовыеРезервы.Период,
		|	НовыеРезервы.АналитикаУчетаНоменклатуры,
		|	НовыеРезервы.Организация,
		|	НовыеРезервы.ВидЗапасов,
		|	НовыеРезервы.НомерГТД,
		|	НовыеРезервы.Количество,
		|	НовыеРезервы.КоличествоПоРНПТ,
		|	НовыеРезервы.КорОрганизация,
		|	НовыеРезервы.КорВидЗапасов
		|ПОМЕСТИТЬ ВТНовыеРезервы
		|ИЗ
		|	&ТаблицаНовыеРезервы КАК НовыеРезервы";

		Запрос.УстановитьПараметр("ТаблицаНовыеРезервы", ТаблицаНовыеРезервы);

		Запрос.Выполнить();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

Функция смарт_ЗапросРаспределенияСУчетомПриоритетовТаблицыТоваровНаТаблицуОстатков(МенеджерВременныхТаблиц,
																			ДополнительныеСвойства)
	//++ смарт:ЩукинВВ #27955 516 17.09.2021
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаТоваров.НомерСтроки)						КАК НомерСтроки,
	|	ТаблицаДанныхДокумента.Дата									КАК ДатаДокумента,
	|	&ТекстПоляТаблицаТоваровХозяйственнаяОперация_				КАК ХозяйственнаяОперация,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры					КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры					КАК АналитикаОстатков,
	|	ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения				КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.КодТНВЭД.СырьевойТовар, ЛОЖЬ)	КАК СырьевойТовар,
	|	ТаблицаТоваров.Номенклатура.ПодакцизныйТовар				КАК ЭтоПодакцизныйТовар,
	|	ТаблицаТоваров.Номенклатура.ВестиУчетПоГТД					КАК ВестиУчетПоГТД,
	|	ТаблицаТоваров.Номенклатура.ГруппаФинансовогоУчета			КАК ГруппаФинансовогоУчета,
	|	ТаблицаТоваров.Номенклатура									КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика								КАК Характеристика,
	|	ТаблицаТоваров.Назначение									КАК Назначение,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтатусУказанияСерий В (14, 18)
	|			ТОГДА ТаблицаТоваров.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ														КАК Серия,
	|	СУММА(ТаблицаТоваров.Количество)							КАК Количество,
	|	&ТекстПоляТаблицаТоваровКоличествоПоРНПТ_					КАК КоличествоПоРНПТ,
	|	&ТекстПоляТаблицаТоваровВидЦены_							КАК ВидЦены,
	|	&ТекстПоляТаблицаТоваровСтавкаНДС_							КАК СтавкаНДС,
	|	&ТекстПоляТаблицаТоваровСуммаСНДС_							КАК СуммаСНДС,
	|	&ТекстПоляТаблицаТоваровСуммаНДС_							КАК СуммаНДС,
	|	&ТекстПоляТаблицаТоваровСуммаВознаграждения_				КАК СуммаВознаграждения,
	|	&ТекстПоляТаблицаТоваровСуммаНДСВознаграждения_				КАК СуммаНДСВознаграждения,
	|	ТаблицаТоваров.Склад										КАК Склад,
	|	ТаблицаТоваров.НомерГТД										КАК НомерГТД,
	|	ЕСТЬNULL(ТаблицаТоваров.Назначение.Заказ, НЕОПРЕДЕЛЕНО)		КАК Заказ,
	|	&ТекстПоляТаблицаТоваровДокументПередачи_					КАК ДокументПередачи,
	|	&ТекстПоляТаблицаТоваровКорАналитикаУчетаНоменклатуры_		КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.ПодбиратьВидыЗапасов							КАК ПодбиратьВидыЗапасов,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = ТаблицаНоменклатуры.Ссылка
	|
	|ГДЕ
	|	ТаблицаТоваров.Номенклатура.ТипНоменклатуры В(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|													ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Дата,
	|	&ТекстПоляТаблицаТоваровХозяйственнаяОперация_,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.КодТНВЭД.СырьевойТовар, ЛОЖЬ),
	|	ТаблицаТоваров.Номенклатура.ПодакцизныйТовар,
	|	ТаблицаТоваров.Номенклатура.ВестиУчетПоГТД,
	|	ТаблицаТоваров.Номенклатура.ГруппаФинансовогоУчета,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	ТаблицаТоваров.Назначение,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтатусУказанияСерий В (14, 18)
	|			ТОГДА ТаблицаТоваров.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	&ТекстПоляТаблицаТоваровВидЦены_,
	|	ТаблицаТоваров.Склад,
	|	ТаблицаТоваров.НомерГТД,
	|	ЕСТЬNULL(ТаблицаТоваров.Назначение.Заказ, НЕОПРЕДЕЛЕНО),
	|	&ТекстПоляТаблицаТоваровДокументПередачи_,
	|	&ТекстПоляТаблицаТоваровКорАналитикаУчетаНоменклатуры_,
	|	ТаблицаТоваров.ПодбиратьВидыЗапасов,
	|	ТаблицаТоваров.ИдентификаторСтроки
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Дата						КАК Период,
	|	ТаблицаДанныхДокумента.Организация				КАК Организация,
	|	ТаблицаДанныхДокумента.Партнер					КАК ВладелецТовара,
	|	ТаблицаДанныхДокумента.Контрагент				КАК Контрагент,
	|	ТаблицаДанныхДокумента.Соглашение				КАК Соглашение,
	|	ТаблицаДанныхДокумента.Договор					КАК Договор,
	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация	КАК ХозяйственнаяОперация,
	|	ТаблицаДанныхДокумента.Валюта					КАК Валюта,
	|	ТаблицаДанныхДокумента.НалогообложениеНДС		КАК НалогообложениеНДС,
	|	ТаблицаДанныхДокумента.ТипЗапасов				КАК ТипЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаФинансовогоУчета
	|ИЗ
	|	ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки					КАК НомерСтроки,
	|	ВидыЗапасовПоУмолчанию.ТипЗапасов				КАК ТипЗапасов,
	|	ВидыЗапасовПоУмолчанию.ТипЗапасовРезервы		КАК ТипЗапасовРезервы,
	|	ВидыЗапасовПоУмолчанию.ВладелецТовара			КАК ВладелецТовара,
	|	ВидыЗапасовПоУмолчанию.Контрагент				КАК Контрагент,
	|	ВидыЗапасовПоУмолчанию.Договор					КАК Договор,
	|	ТаблицаДокумента.Склад							КАК Склад,
	|	ТаблицаДокумента.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаДокумента.ЕдиницаИзмерения				КАК ЕдиницаИзмерения,
	|	ТаблицаДокумента.СырьевойТовар					КАК СырьевойТовар,
	|	ВЫБОР
	|		КОГДА &ИспользоватьГруппыФинУчета
	|			ТОГДА ЕСТЬNULL(ТаблицаДокумента.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ											КАК ГруппаФинансовогоУчета,
	|	ТаблицаДокумента.Номенклатура					КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика					КАК Характеристика,
	|	ТаблицаДокумента.Серия							КАК Серия,
	|	ТаблицаДокумента.Количество						КАК Количество,
	|	ТаблицаДокумента.КоличествоПоРНПТ				КАК КоличествоПоРНПТ,
	|	ТаблицаДокумента.ВидЦены						КАК ВидЦены,
	|	ТаблицаДокумента.СтавкаНДС						КАК СтавкаНДС,
	|	ТаблицаДокумента.КорАналитикаУчетаНоменклатуры	КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаДокумента.ХозяйственнаяОперация			КАК ХозяйственнаяОперация,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРеквизитовВидовЗапасовПоУмолчанию КАК ВидыЗапасовПоУмолчанию
	|		ПО ВидыЗапасовПоУмолчанию.НомерСтроки = ТаблицаДокумента.НомерСтроки
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаВидыЗапасов.НомерСтроки)			КАК НомерСтроки,
	|	ТаблицаДанныхДокумента.Дата							КАК ДатаДокумента,
	|	ТаблицаДанныхДокумента.Организация					КАК ОрганизацияДокумента,
	|	ТаблицаДанныхДокумента.НалогообложениеНДС			КАК НалогообложениеНДСДокумента,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	&ТекстПоляТаблицаВидыЗапасовДокументПередачи_		КАК ДокументПередачи,
	|	ТаблицаВидыЗапасов.ВидЗапасов						КАК ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов.ТипЗапасов			КАК ТипЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов.Организация			КАК Организация,
	|	ТаблицаВидыЗапасов.ВидЗапасов.ВладелецТовара		КАК ВладелецТовара,
	|	ТаблицаВидыЗапасов.ВидЗапасов.НалогообложениеНДС	КАК НалогообложениеНДС,
	|	ТаблицаВидыЗапасов.НомерГТД							КАК НомерГТД,
	|	&ТекстПоляТаблицаВидыЗапасовАналитикаУчетаНоменклатурыОтгрузки_ КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	&ТекстПоляТаблицаВидыЗапасовВидЗапасовОтгрузки_		КАК ВидЗапасовОтгрузки,
	|	СУММА(ТаблицаВидыЗапасов.Количество)				КАК Количество,
	|	&ТекстПоляТаблицаВидыЗапасовКоличествоПоРНПТ_		КАК КоличествоПоРНПТ,
	|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную		КАК ВидыЗапасовУказаныВручную
	|ПОМЕСТИТЬ ТаблицаВидыЗапасовСводно
	|ИЗ
	|	ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Дата,
	|	ТаблицаДанныхДокумента.Организация,
	|	ТаблицаДанныхДокумента.НалогообложениеНДС,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	&ТекстПоляТаблицаВидыЗапасовДокументПередачи_,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов.ТипЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов.Организация,
	|	ТаблицаВидыЗапасов.ВидЗапасов.ВладелецТовара,
	|	ТаблицаВидыЗапасов.ВидЗапасов.НалогообложениеНДС,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	&ТекстПоляТаблицаВидыЗапасовАналитикаУчетаНоменклатурыОтгрузки_,
	|	&ТекстПоляТаблицаВидыЗапасовВидЗапасовОтгрузки_,
	|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	НомерГТД,
	|	ДокументПередачи,
	|	АналитикаУчетаНоменклатурыОтгрузки,
	|	ВидЗапасовОтгрузки
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаВидыЗапасовСводно.ВидыЗапасовУказаныВручную, ЛОЖЬ)
	|			ТОГДА 1
	|		КОГДА Остатки.Организация = РеквизитыДокумента.Организация
	|				И НЕ ЕСТЬNULL(ВидыЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА 3
	|		ИНАЧЕ 5
	|	КОНЕЦ										КАК Приоритет,
	|	Остатки.Организация							КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ДокументПередачи					КАК ДокументПередачи,
	|	Остатки.Номенклатура						КАК Номенклатура,
	|	Остатки.Характеристика						КАК Характеристика,
	|	Остатки.Назначение							КАК Назначение,
	|	Остатки.Серия								КАК Серия,
	|	Остатки.ВидЗапасов							КАК ВидЗапасов,
	|	ВидыЗапасов.ТипЗапасов						КАК ТипЗапасов,
	|	ВидыЗапасов.Организация						КАК ОрганизацияВидаЗапасов,
	|	ВидыЗапасов.ВладелецТовара					КАК ВладелецТовара,
	|	ВидыЗапасов.НалогообложениеНДС				КАК НалогообложениеНДСВидаЗапасов,
	|	ВидыЗапасов.Договор.ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров КАК ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров,
	|	Остатки.НомерГТД							КАК НомерГТД,
	|	Остатки.ДатаПоступления						КАК ДатаПоступления,
	|	РеквизитыДокумента.Организация				КАК ОрганизацияОтгрузки,
	|	Остатки.АналитикаУчетаНоменклатурыОтгрузки	КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	Остатки.ВидЗапасовОтгрузки					КАК ВидЗапасовОтгрузки,
	|	Остатки.КоличествоОстаток					КАК КоличествоОстатокВсего,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаВидыЗапасовСводно.Количество, 0) <= Остатки.КоличествоОстаток
	|			ТОГДА ЕСТЬNULL(ТаблицаВидыЗапасовСводно.Количество, 0)
	|		ИНАЧЕ Остатки.КоличествоОстаток
	|	КОНЕЦ										КАК КоличествоОстаток,
	|	&ТекстПоляТаблицаОстатковКоличествоПоРНПТОстаток_ КАК КоличествоПоРНПТОстатокВсего,
	|	ВЫБОР
	|		КОГДА Остатки.КоличествоОстаток <> 0
	|			ТОГДА Остатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаОстаток
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	ТаблицаОстатков КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО Остатки.ВидЗапасов = ВидыЗапасов.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК РеквизитыДокумента
	|		ПО ИСТИНА
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасовСводно КАК ТаблицаВидыЗапасовСводно
	|		ПО Остатки.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатуры
	|			И Остатки.ВидЗапасов = ТаблицаВидыЗапасовСводно.ВидЗапасов
	|			И Остатки.НомерГТД = ТаблицаВидыЗапасовСводно.НомерГТД
	|			И Остатки.ДокументПередачи = ТаблицаВидыЗапасовСводно.ДокументПередачи
	|			И Остатки.АналитикаУчетаНоменклатурыОтгрузки = ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатурыОтгрузки
	|			И Остатки.ВидЗапасовОтгрузки = ТаблицаВидыЗапасовСводно.ВидЗапасовОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаВидыЗапасовСводно.ВидыЗапасовУказаныВручную, ЛОЖЬ)
	|			ТОГДА 2
	|		КОГДА Остатки.Организация = РеквизитыДокумента.Организация
	|				И НЕ ЕСТЬNULL(ВидыЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА 4
	|		ИНАЧЕ 5
	|	КОНЕЦ										КАК Приоритет,
	|	Остатки.Организация							КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ДокументПередачи					КАК ДокументПередачи,
	|	Остатки.Номенклатура						КАК Номенклатура,
	|	Остатки.Характеристика						КАК Характеристика,
	|	Остатки.Назначение							КАК Назначение,
	|	Остатки.Серия								КАК Серия,
	|	Остатки.ВидЗапасов							КАК ВидЗапасов,
	|	ВидыЗапасов.ТипЗапасов						КАК ТипЗапасов,
	|	ВидыЗапасов.Организация						КАК ОрганизацияВидаЗапасов,
	|	ВидыЗапасов.ВладелецТовара					КАК ВладелецТовара,
	|	ВидыЗапасов.НалогообложениеНДС				КАК НалогообложениеНДСВидаЗапасов,
	|	ВидыЗапасов.Договор.ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров КАК ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров,
	|	Остатки.НомерГТД							КАК НомерГТД,
	|	Остатки.ДатаПоступления						КАК ДатаПоступления,
	|	РеквизитыДокумента.Организация				КАК ОрганизацияОтгрузки,
	|	Остатки.АналитикаУчетаНоменклатурыОтгрузки	КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	Остатки.ВидЗапасовОтгрузки					КАК ВидЗапасовОтгрузки,
	|	Остатки.КоличествоОстаток					КАК КоличествоОстатокВсего,
	|	ВЫБОР
	|		КОГДА Остатки.КоличествоОстаток > ЕСТЬNULL(ТаблицаВидыЗапасовСводно.Количество, 0)
	|			ТОГДА Остатки.КоличествоОстаток - ЕСТЬNULL(ТаблицаВидыЗапасовСводно.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК КоличествоОстаток,
	|	&ТекстПоляТаблицаОстатковКоличествоПоРНПТОстаток_ КАК КоличествоПоРНПТОстатокВсего,
	|	ВЫБОР
	|		КОГДА Остатки.КоличествоОстаток <> 0
	|			ТОГДА Остатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаОстаток
	|ИЗ
	|	ТаблицаОстатков КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО Остатки.ВидЗапасов = ВидыЗапасов.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК РеквизитыДокумента
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасовСводно КАК ТаблицаВидыЗапасовСводно
	|		ПО Остатки.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатуры
	|			И Остатки.ВидЗапасов = ТаблицаВидыЗапасовСводно.ВидЗапасов
	|			И Остатки.НомерГТД = ТаблицаВидыЗапасовСводно.НомерГТД
	|			И Остатки.ДокументПередачи = ТаблицаВидыЗапасовСводно.ДокументПередачи
	|			И Остатки.АналитикаУчетаНоменклатурыОтгрузки = ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатурыОтгрузки
	|			И Остатки.ВидЗапасовОтгрузки = ТаблицаВидыЗапасовСводно.ВидЗапасовОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ТаблицаВидыЗапасовСводно.Организация,
	|	ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасовСводно.ДокументПередачи,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Назначение,
	|	Аналитика.Серия,
	|	ТаблицаВидыЗапасовСводно.ВидЗапасов,
	|	ВидыЗапасов.ТипЗапасов,
	|	ВидыЗапасов.Организация,
	|	ВидыЗапасов.ВладелецТовара,
	|	ВидыЗапасов.НалогообложениеНДС,
	|	ВидыЗапасов.Договор.ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров,
	|	ТаблицаВидыЗапасовСводно.НомерГТД,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	РеквизитыДокумента.Организация,
	|	ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТаблицаВидыЗапасовСводно.ВидЗапасовОтгрузки,
	|	ТаблицаВидыЗапасовСводно.Количество,
	|	ТаблицаВидыЗапасовСводно.Количество,
	|	ТаблицаВидыЗапасовСводно.КоличествоПоРНПТ,
	|	0
	|ИЗ
	|	ТаблицаВидыЗапасовСводно КАК ТаблицаВидыЗапасовСводно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТаблицаВидыЗапасовСводно.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ТаблицаВидыЗапасовСводно.ВидЗапасов = ВидыЗапасов.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК РеквизитыДокумента
	|		ПО ВидыЗапасов.Организация = РеквизитыДокумента.Организация
	|
	|ГДЕ
	|	ТаблицаВидыЗапасовСводно.ВидыЗапасовУказаныВручную = ИСТИНА
	|	И &ПроводитьБезКонтроляОстатковТоваровОрганизаций = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	НомерГТД
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	// данные документа
	|	ЕСТЬNULL(Остатки.Приоритет, 0)						КАК Приоритет,
	|	ТаблицаДокумента.НомерСтроки						КАК НомерСтроки,
	|	ТаблицаДокумента.ДатаДокумента						КАК ДатаДокумента,
	|	ТаблицаДокумента.ХозяйственнаяОперация				КАК ХозяйственнаяОперация,
	|	ТаблицаДокумента.Склад								КАК Склад,
	|	ТаблицаДокумента.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаДокумента.ЕдиницаИзмерения					КАК ЕдиницаИзмерения,
	|	ТаблицаДокумента.СырьевойТовар						КАК СырьевойТовар,
	|	ТаблицаДокумента.ЭтоПодакцизныйТовар				КАК ЭтоПодакцизныйТовар,
	|	ТаблицаДокумента.ГруппаФинансовогоУчета				КАК ГруппаФинансовогоУчета,
	|	ТаблицаДокумента.Номенклатура						КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика						КАК Характеристика,
	|	ТаблицаДокумента.Назначение							КАК Назначение,
	|	ТаблицаДокумента.Серия								КАК Серия,
	|	ТаблицаДокумента.Количество							КАК Количество,
	|	ТаблицаДокумента.КоличествоПоРНПТ					КАК КоличествоПоРНПТ,
	|	ТаблицаДокумента.СтавкаНДС							КАК СтавкаНДС,
	|	ТаблицаДокумента.СуммаСНДС							КАК СуммаСНДС,
	|	ТаблицаДокумента.СуммаНДС							КАК СуммаНДС,
	|	ТаблицаДокумента.СуммаВознаграждения				КАК СуммаВознаграждения,
	|	ТаблицаДокумента.СуммаНДСВознаграждения				КАК СуммаНДСВознаграждения,
	|	ТаблицаДокумента.КорАналитикаУчетаНоменклатуры		КАК КорАналитикаУчетаНоменклатуры,
	|
	// данные остатков
	|	ЕСТЬNULL(Остатки.ВидЗапасов, НЕОПРЕДЕЛЕНО)			КАК ВидЗапасов,
	|	ЕСТЬNULL(Остатки.ТипЗапасов, НЕОПРЕДЕЛЕНО)			КАК ТипЗапасов,
	|	ЕСТЬNULL(Остатки.ОрганизацияВидаЗапасов, НЕОПРЕДЕЛЕНО) КАК ОрганизацияОстатка,
	|	ЕСТЬNULL(Остатки.ВладелецТовара, Неопределено)		КАК ВладелецТовара,
	|	ЕСТЬNULL(Остатки.ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров, Неопределено) КАК ПорядокОформленияСписанияНедостачПринятыхНаХранениеТоваров,
	|	ЕСТЬNULL(Остатки.НомерГТД, Неопределено)			КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиУчетПоГТД
	|				И &ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД
	|				И (Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|					ИЛИ Остатки.НомерГТД ЕСТЬ NULL)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ												КАК НеУказанНомерГТД,
	|	ЕСТЬNULL(Остатки.ОрганизацияОтгрузки, НЕОПРЕДЕЛЕНО)	КАК ОрганизацияОтгрузки,
	|	ЕСТЬNULL(Остатки.ДатаПоступления, ДАТАВРЕМЯ(2399, 1, 1)) КАК ДатаПоступления,
	|	ЕСТЬNULL(Остатки.ДокументПередачи, Неопределено)	КАК ДокументПередачи,
	|	ЕСТЬNULL(Остатки.АналитикаУчетаНоменклатурыОтгрузки, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ЕСТЬNULL(Остатки.ВидЗапасовОтгрузки, НЕОПРЕДЕЛЕНО)	КАК ВидЗапасовОтгрузки,
	|	ЕСТЬNULL(ТаблицаДокумента.Заказ, НЕОПРЕДЕЛЕНО)		КАК Заказ,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокВсего, 0)			КАК КоличествоОстатокВсего,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0)				КАК КоличествоОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоПоРНПТОстатокВсего, 0)	КАК КоличествоПоРНПТОстатокВсего,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0)					КАК СуммаОстаток,
	|
	// данные для генерации нового вида запасов по интеркампани
	|	ЕСТЬNULL(Настройка.СпособПередачиТоваров, ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.НеПередается)) КАК НастройкаПередачи,
	|	ВЫБОР
	|		КОГДА НЕ Настройка.ОрганизацияВладелец ЕСТЬ NULL
	|			ТОГДА Настройка.ОрганизацияВладелец
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК НовыйВидЗапасовВладелецТовара,
	|	ВЫБОР
	|		КОГДА НЕ Настройка.Договор ЕСТЬ NULL
	|			ТОГДА Настройка.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК НовыйВидЗапасовДоговор,
	|	ЕСТЬNULL(Настройка.Валюта, НЕОПРЕДЕЛЕНО)			КАК НовыйВидЗапасовВалюта,
	|	ВЫБОР КОГДА НЕ Настройка.ОрганизацияВладелец ЕСТЬ NULL
	|		ТОГДА Настройка.ОрганизацияВладелец
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК НовыйВидЗапасовКонтрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Настройка.СпособПередачиТоваров, ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.ПередачаНаКомиссию)
	|				И ЕСТЬNULL(Остатки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ												КАК НовыйВидЗапасовЭтоСубкомиссия,
	|	ЕСТЬNULL(Остатки.НалогообложениеНДСВидаЗапасов, НЕОПРЕДЕЛЕНО) КАК НовыйВидЗапасовНалогообложениеКомитента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Настройка.СпособПередачиТоваров, ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.НеПередается)) = ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.ПередачаНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	КОНЕЦ												КАК НовыйВидЗапасовТипЗапасов,
	|	ТаблицаДокумента.НомерГТД = Остатки.НомерГТД		КАК НомерГТДСовпадает,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК Остатки
	|		ПО ТаблицаДокумента.АналитикаОстатков = Остатки.АналитикаУчетаНоменклатуры
	|			И (ТаблицаДокумента.ДокументПередачи = Остатки.ДокументПередачи
	|				ИЛИ ТаблицаДокумента.ДокументПередачи = НЕОПРЕДЕЛЕНО
	|					И ТаблицаДокумента.ПодбиратьВидыЗапасов)
	|			И (ТаблицаДокумента.НомерГТД = Остатки.НомерГТД
	|				ИЛИ ТаблицаДокумента.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|				ИЛИ Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоступленияТоваровОрганизаций КАК ДатыПоступления
	|		ПО ДатыПоступления.ВидЗапасов = Остатки.ВидЗапасов
	|			И ДатыПоступления.Номенклатура = Остатки.Номенклатура
	|			И ДатыПоступления.Характеристика = Остатки.Характеристика
	|			И ДатыПоступления.Серия = Остатки.Серия
	|			И ДатыПоступления.Назначение = Остатки.Назначение
	|			И ДатыПоступления.НомерГТД = Остатки.НомерГТД
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК Настройка
	|		ПО Остатки.ТипЗапасов = Настройка.ТипЗапасов
	|			И Остатки.ОрганизацияВидаЗапасов = Настройка.ОрганизацияВладелец
	|			И Остатки.ОрганизацияОтгрузки = Настройка.ОрганизацияПродавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки ВОЗР,
	|	Приоритет ВОЗР,
	|	ТаблицаДокумента.НомерГТД = Остатки.НомерГТД УБЫВ,
	|	ДатаПоступления ВОЗР,
	|	ДатыПоступления.ДатаПоступления ВОЗР,
	|	ТипЗапасов,
	|	ОрганизацияОстатка,
	|	ВладелецТовара,
	|	ВидЗапасов
	|
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(КоличествоПоРНПТ),
	|	МАКСИМУМ(СуммаСНДС),
	|	МАКСИМУМ(СтавкаНДС),
	|	МАКСИМУМ(СуммаНДС),
	|	МАКСИМУМ(СуммаВознаграждения),
	|	МАКСИМУМ(СуммаНДСВознаграждения),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	НомерСтроки
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДокумента
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаВидыЗапасовСводно
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстатки";
	
#Область ЗаменаИспользованияНеобязательныхПолей
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"КоличествоПоРНПТ",
												"СУММА(ТаблицаТоваров.КоличествоПоРНПТ)",
												"0");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"ВидЦены",
												"ТаблицаТоваров.ВидЦены",
												"ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка)");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"ДокументПередачи",
												"ТаблицаТоваров.ДокументПередачи",
												"НЕОПРЕДЕЛЕНО");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"СтавкаНДС",
												"МАКСИМУМ(ТаблицаТоваров.СтавкаНДС)",
												"ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"КорАналитикаУчетаНоменклатуры",
												"ТаблицаТоваров.КорАналитикаУчетаНоменклатуры",
												"ТаблицаТоваров.АналитикаУчетаНоменклатуры");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"ХозяйственнаяОперация",
												"ТаблицаТоваров.ХозяйственнаяОперация",
												"ТаблицаДанныхДокумента.ХозяйственнаяОперация");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"СуммаСНДС",
												"СУММА(ТаблицаТоваров.СуммаСНДС)",
												"0");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"СуммаНДС",
												"СУММА(ТаблицаТоваров.СуммаНДС)",
												"0");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"СуммаВознаграждения",
												"СУММА(ТаблицаТоваров.СуммаВознаграждения)",
												"0");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаТоваров",
												"СуммаНДСВознаграждения",
												"СУММА(ТаблицаТоваров.СуммаНДСВознаграждения)",
												"0");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаВидыЗапасов",
												"ДокументПередачи",
												"ТаблицаВидыЗапасов.ДокументПередачи",
												"НЕОПРЕДЕЛЕНО");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаВидыЗапасов",
												"АналитикаУчетаНоменклатурыОтгрузки",
												"ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки",
												"НЕОПРЕДЕЛЕНО");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаВидыЗапасов",
												"ВидЗапасовОтгрузки",
												"ТаблицаВидыЗапасов.ВидЗапасовОтгрузки",
												"НЕОПРЕДЕЛЕНО");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаВидыЗапасов",
												"КоличествоПоРНПТ",
												"СУММА(ТаблицаВидыЗапасов.КоличествоПоРНПТ)",
												"0");
	
	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
												ТекстЗапроса,
												"ТаблицаОстатков",
												"КоличествоПоРНПТОстаток",
												"Остатки.КоличествоПоРНПТОстаток",
												"0");
	
#КонецОбласти
	
	ПроводитьБезКонтроляОстатковТоваровОрганизаций = ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций 
														ИЛИ НЕ Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить();
	ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД = ?(ДополнительныеСвойства.Свойство("КонтролироватьНомераГТД"),
																	ДополнительныеСвойства.КонтролироватьНомераГТД,
																	ПолучитьФункциональнуюОпцию("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ИспользоватьГруппыФинУчета",
								ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоСделкам",
								ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
	Запрос.УстановитьПараметр("ПроводитьБезКонтроляОстатковТоваровОрганизаций",
								ПроводитьБезКонтроляОстатковТоваровОрганизаций);
	Запрос.УстановитьПараметр("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД",
								ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД);
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	ПроверитьНеобходимостьПерезаполненияВидовЗапасовДокумента(ДополнительныеСвойства, Запрос);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Возврат Запрос;
	//-- смарт:ЩукинВВ #27955 516 17.09.2021
КонецФункции

#КонецОбласти
