
//++ смарт:ММ #092 389 21.01.2021 - Конструктор оборудования
&После("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ, Замещение)
	
	//++ #Б-2620 смарт: Лопато 12.03.2025 //Удалить Спецификации по IECHO из задач.  
	// Закомментировал код
	//// Проверка, является ли запись по заказу клиента, по которому необходимо продвинуть бизнес-процесс (спецификации)
	//
	//МассивПроверяемыхЗаказов = Новый Массив;
	//ГотовКОбеспечению = Перечисления.СостоянияЗаказовКлиентов.ГотовКОбеспечению;
	//
	//Для Каждого Запись Из ЭтотОбъект Цикл
	//	
	//	Если ТипЗнч(Запись.Заказ) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если Запись.ПроцентОплаты > 0 
	//		ИЛИ Запись.Состояние = ГотовКОбеспечению Тогда
	//		Если МассивПроверяемыхЗаказов.Найти(Запись.Заказ) = Неопределено Тогда
	//			МассивПроверяемыхЗаказов.Добавить(Запись.Заказ);
	//		КонецЕсли;			
	//	КонецЕсли;		
	//КонецЦикла;
	//
	//Если МассивПроверяемыхЗаказов.Количество() > 0 Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ЗадачаИсполнителя.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	//	|ГДЕ
	//	|	НЕ ЗадачаИсполнителя.Выполнена
	//	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	//	|	И ЗадачаИсполнителя.ТочкаМаршрута В(&ТочкаМаршрута)
	//	|	И ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.смартIECHOПродажа).ЗаказКлиента В (&МассивОплаченныхЗаказов)";
	//	
	//	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента);
	//	Запрос.УстановитьПараметр("МассивОплаченныхЗаказов", МассивПроверяемыхЗаказов);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//		ЗадачаОбъект.ВыполнитьЗадачу();
	//	КонецЦикла;
	//КонецЕсли;
	//-- #Б-2620 смарт: Лопато 12.03.2025
	
КонецПроцедуры //-- смарт:ММ 21.01.2021
