//++ смарт:Подкин #1025 22.05.2022 17:56:48
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    
    ПродажаВРублях=НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
	
	Если ПродажаВРублях и (НЕ Пользователи.ЭтоПолноправныйПользователь() И НЕ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
        Элементы.Курс.Видимость=Ложь;
        Элементы.Кратность.Видимость=Ложь;
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #1025 22.05.2022 17:56:48

