
/////////////////////////////////////////////////////////////////////////////
// Модуль смартИнтеграцияDaDataПовтИсп предназначен для 
// хранения процедур и функций, связанных с получением 
// данных из сервиса DaData
// https://dadata.ru/pricing/?product=suggestions
// Примеры:
//  - Получить данные организации по ИНН - https://dadata.ru/api/find-party/
//	- геокодирование (координаты по адресу) - https://cleaner.dadata.ru/api/v1/clean/address
//	- и подобное
// 
// Модуль создал - Шляпников, 25.09.2024
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет запрос к сервису DaData для поиска организации по ИНН или ОГРН
//
// Параметры:
//  ИНН - строка - ИНН или ОГРН организации, данные по которой требуется найти
//
// Возвращаемое значение:
//  ???
//
Функция ВыполнитьЗапросПолучитьДанныеОрганизацииПоИНН(ИНН) Экспорт
	
	Возврат смартИнтеграцияDaData.ВыполнитьЗапросПолучитьДанныеОрганизацииПоИНН(ИНН);
	
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс




#КонецОбласти


#Область Прочее



#КонецОбласти