

Процедура ВыбратьПросроченныеЗаказыПоОплатеВФормеСпискаЗаказКлинта() Экспорт
	
	Пользователь = Модуль_Б1Сервер.ПолучитьТекущегоПользователя();
	
	Если НЕ Модуль_Б1Сервер.ДоступныРоль_РазделПродажи(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаСпискаДокументов");
	Форма.Состояние = "ВсеОжидающиеОплаты";
	Форма.Менеджер = Пользователь;//Пользователи.ТекущийПользователь();
	//Модуль_Б1Сервер.УстановитьОтбор(Форма);
	//ОткрытиеФормПриНачалеРаботыСистемыВызовСервера.УстановитьОтбор(Форма);
	МассивСостояний = Модуль_Б1Сервер.ПолучитьМассивСостояний();
	Партнеры = Модуль_Б1Сервер.ПолучитьЧерныйсписокПартнеров();
	МассивПросроченныхПоОплатеЗаказов = Модуль_Б1Сервер.ПолучитьМассивПросроченныхПоОплатеЗаказов();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.Отбор, "Состояние", МассивСостояний, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.Отбор, "ПометкаУдаления", Ложь,,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.Отбор, "ПроцентОтгрузки", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.Отбор, "Партнер", Партнеры, ВидСравненияКомпоновкиДанных.НеВСписке,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.Отбор, "Менеджер", Пользователь, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.Отбор, "Ссылка", МассивПросроченныхПоОплатеЗаказов, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	Форма.Открыть();
	//УстановитьОтбор(Форма);
	
	Если Форма.ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
		Форма.Закрыть();
	КонецЕсли;
	
	
	ПодключитьОбработчикОжидания("ПроверитьВремяНапоминания", 15*60);
	Если Час(ТекущаяДата()) >= 17 Тогда
		ОтключитьОбработчикОжидания("ПроверитьВремяНапоминания");
	КонецЕсли;	
	
	
КонецПроцедуры

//Процедура ПроверитьВремяНапоминания() Экспорт
//	Если Час(ТекущаяДата()) >= 16 Тогда 
//		ВыбратьПросроченныеЗаказыПоОплатеВФормеСпискаЗаказКлинта();
//	КонецЕсли;
//КонецПроцедуры	

