
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ПередЗаписью")
//++ #1845 смарт: Фролов 05.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Документы.CRM_Заявка.ЗаполнитьКонтактЗаявки(ЭтотОбъект);
		Если Не ЗначениеЗаполнено(Автор) Тогда
			Автор = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		Если ИсточникПолучения.Сценарий = Перечисления.CRM_CallTrakingСценарии.РучнойВвод Тогда
			Справочники.CRM_ПравилаОбработкиОбращений.ПрименитьПравило(ЭтотОбъект);
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		
		#Вставка
		Если НЕ ЭтотОбъект.Ссылка.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления Тогда
			
			ДополнительныеСвойства.Вставить("УдалитьДанныеВРегистрах", Истина);
			
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка.Ответственный) И ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
			
			Если НЕ ЭтотОбъект.Ссылка.Ответственный = ЭтотОбъект.Ответственный Тогда
				ДополнительныеСвойства.Вставить("СтарыйМенеджер", ЭтотОбъект.Ссылка.Ответственный);	
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка.Ответственный) И НЕ ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
			
			Если НЕ ЭтотОбъект.Ссылка.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления Тогда
				ДополнительныеСвойства.Вставить("УдалитьДанныеВРегистрах", Истина);	
			КонецЕсли;
			
		КонецЕсли;
		#КонецВставки	
		
	КонецЕсли;

КонецПроцедуры //-- #1845 смарт: Фролов 05.06.2024

&ИзменениеИКонтроль("ПриЗаписи")
//++ #1845 смарт: Фролов 05.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.
Процедура смарт_ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		Если ИсточникПолучения.Сценарий = Перечисления.CRM_CallTrakingСценарии.РучнойВвод Тогда
			Справочники.CRM_ПравилаОбработкиОбращений.ОбработатьОбращение(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	#Вставка
	Если ДополнительныеСвойства.Свойство("УдалитьДанныеВРегистрах") Тогда
		
		СтруктураИзменений = Новый Структура;
		СтруктураИзменений.Вставить("СтарыйМенеджер",Ответственный);
		СтруктураИзменений.Вставить("Квалификация",смартКвалификация);
		СтруктураИзменений.Вставить("Лид",Ссылка);
		СтруктураИзменений.Вставить("УстановленаПометкаУдаления",Истина);
		
		смартСервер.ОтразитьИзмененийЛидаВРегистрах(СтруктураИзменений);
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СтарыйМенеджер") Тогда
		
		СтруктураИзменений = Новый Структура;
		СтруктураИзменений.Вставить("СтарыйМенеджер",ДополнительныеСвойства.СтарыйМенеджер);
		СтруктураИзменений.Вставить("НовыйМенеджер",Ответственный);
		СтруктураИзменений.Вставить("Квалификация",смартКвалификация);
		СтруктураИзменений.Вставить("Лид",Ссылка);
		СтруктураИзменений.Вставить("СменаМенеджера",Истина);
		
		смартСервер.ОтразитьИзмененийЛидаВРегистрах(СтруктураИзменений);
		
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры //-- #1845 смарт: Фролов 05.06.2024

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ #1845 смарт: Фролов 06.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры //-- #1845 смарт: Фролов 06.06.2024

#КонецОбласти