
&НаСервере
Процедура ПеревестиЗвонокНаСервере()

	УстановитьЗначенияИВидимостьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиЗвонок(Команда)
	
	ПеревестиЗвонокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ #Б-6048 смарт: Фролов 12.03.2026 //Ошибка. Доработка рабочего места секретаря.
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Пользователь КАК Пользователь,
	|	ДатаОтсрочкиПоОтпуску КАК ДатаОтсрочкиПоОтпуску
	|ИЗ
	|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних
	|ГДЕ
	|	Статус = ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.ВОтпуске)
	|	И До < &ТекущаяДата");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьРегистра = РегистрыСведений.смартИсторияСтатусовСотрудников.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.Пользователь = Выборка.Пользователь;
		ЗаписьРегистра.Статус = Справочники.смартСтатусыСотрудников.НаРабочемМесте;
		ЗаписьРегистра.ДатаОтсрочкиПоОтпуску = Выборка.ДатаОтсрочкиПоОтпуску;
		ЗаписьРегистра.Записать();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	//-- #Б-6048 смарт: Фролов 12.03.2026
	
	ЗаполнитьПервичныеДанныеФормы();
	
	УстановитьЗначенияИВидимостьПоУмолчанию();
	
	Элементы.Канал.СписокВыбора.Добавить(ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Маркетплейсы"));
	Элементы.Канал.СписокВыбора.Добавить(ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Социальные сети"));
	Элементы.Канал.СписокВыбора.Добавить(ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Рекомендация сотрудника"));
	Элементы.Канал.СписокВыбора.Добавить(ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Интернет магазин"));
	Элементы.Канал.СписокВыбора.Добавить(ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Выставка Реклама"));
	
	ИсторияРаспределения.Параметры.УстановитьЗначениеПараметра("Распределил", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервичныеДанныеФормы(НеБлокироватьВыдачу = Ложь)
	УстановитьПривилегированныйРежим(Истина);
	
	КвалификацияНепределено = Справочники.смартКвалификацииМенеджеров.НайтиПоНаименованию("Неопределено");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартКвалификацииМенеджеровПользователи.Ссылка КАК Квалификация,
	|	смартКвалификацииМенеджеровПользователи.Пользователь КАК Менеджер
	|ПОМЕСТИТЬ МенеджерыКвалификаций
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи КАК смартКвалификацииМенеджеровПользователи
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеБлокироватьВыдачу
	|				ТОГДА НЕ смартКвалификацииМенеджеровПользователи.Ссылка = &КвалификацияНепределено
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//++ #Б-4442 смарт: Фролов 30.09.2025 //Доработка механизма Квалификаций менеджеров.
	|	И НЕ смартКвалификацииМенеджеровПользователи.Ссылка.НеАктуальна
	//-- #Б-4442 смарт: Фролов 30.09.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартИсторияРаботыСЛидом.Менеджер КАК Менеджер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ смартИсторияРаботыСЛидом.Лид) КАК Лид
	|ПОМЕСТИТЬ МенеджерыНЕДляВыдачи
	|ИЗ
	|	РегистрСведений.смартИсторияРаботыСЛидом КАК смартИсторияРаботыСЛидом
	|ГДЕ
	|	смартИсторияРаботыСЛидом.ДатаВыдачи МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	смартИсторияРаботыСЛидом.Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВыдачаЛидов.Менеджер КАК Менеджер,
	|	смартВыдачаЛидов.Квалификация КАК Квалификация,
	|	смартВыдачаЛидов.ВыдатьЛидов КАК ВыдатьЛидов,
	|	смартВыдачаЛидов.ВыданоЛидов КАК ВыданоЛидов
	|ПОМЕСТИТЬ ВыдачаЛидов
	|ИЗ
	|	РегистрСведений.смартВыдачаЛидов КАК смартВыдачаЛидов
	|ГДЕ
	|	НЕ смартВыдачаЛидов.Менеджер.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартОбщаяОчередьВыдачиЛидов.Менеджер КАК Менеджер
	|ПОМЕСТИТЬ ОбщаяОчередь
	|ИЗ
	|	РегистрСведений.смартОбщаяОчередьВыдачиЛидов КАК смартОбщаяОчередьВыдачиЛидов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БизнесРегионы.Ссылка КАК Регион
	|ИЗ
	|	Справочник.БизнесРегионы КАК БизнесРегионы
	|ГДЕ
	|	НЕ БизнесРегионы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регион ИЕРАРХИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ПользователиКонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ МобильныеТелефоны
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Вид = &МобильныйТелефон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенеджерыКвалификаций.Квалификация КАК Квалификация,
	|	МенеджерыКвалификаций.Менеджер КАК Менеджер,
	|	МенеджерыКвалификаций.Менеджер.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(смартИсторияСтатусовСотрудниковСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте)) = ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте)
	|				И ЧАС(ДОБАВИТЬКДАТЕ(&ТекущаяДата, СЕКУНДА, (МенеджерыКвалификаций.Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT - 3) * 3600)) > 18
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НеРабочееВремя)
	|		ИНАЧЕ ЕСТЬNULL(смартИсторияСтатусовСотрудниковСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте))
	|	КОНЕЦ КАК Статус,
	|	ЕСТЬNULL(смартИсторияСтатусовСотрудниковСрезПоследних.До, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗанятДо,
	|	ВыдачаЛидов.ВыдатьЛидов КАК ВыдатьЛидов,
	|	ВыдачаЛидов.ВыданоЛидов КАК ВыданоЛидов,
	|	МенеджерыКвалификаций.Менеджер.смартРабочийТелефон КАК ВнТелефон,
	|	ВЫБОР
	|		КОГДА &НеБлокироватьВыдачу
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА МенеджерыКвалификаций.Квалификация.ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаТоварыУслуги)
	|					ТОГДА ВЫБОР
	|							КОГДА ВыдачаЛидов.ВыданоЛидов >= ВыдачаЛидов.ВыдатьЛидов
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК БлокироватьВыдачу,
	|	МенеджерыКвалификаций.Менеджер.смартВнутреннийНомерВАТС КАК ВАТС,
	|	ЧАС(ДОБАВИТЬКДАТЕ(&ТекущаяДата, СЕКУНДА, (МенеджерыКвалификаций.Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT - 3) * 3600)) КАК ВРЕМЯЧАС,
	|	МобильныеТелефоны.Представление КАК МобильныйТелефон
	|ИЗ
	|	МенеджерыКвалификаций КАК МенеджерыКвалификаций
	//++ #Б-7054 смарт: Фролов 01.06.2026 //Отпуска сотрудников на текущую дату
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних) КАК смартИсторияСтатусовСотрудниковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(&ТекущаяДата, ) КАК смартИсторияСтатусовСотрудниковСрезПоследних
	//-- #Б-7054 смарт: Фролов 01.06.2026
	|		ПО МенеджерыКвалификаций.Менеджер = смартИсторияСтатусовСотрудниковСрезПоследних.Пользователь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыдачаЛидов КАК ВыдачаЛидов
	|		ПО МенеджерыКвалификаций.Менеджер = ВыдачаЛидов.Менеджер
	|			И МенеджерыКвалификаций.Квалификация = ВыдачаЛидов.Квалификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ МобильныеТелефоны КАК МобильныеТелефоны
	|		ПО МенеджерыКвалификаций.Менеджер = МобильныеТелефоны.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗанятДо,
	|	ВыданоЛидов,
	|	ВыдатьЛидов УБЫВ,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МенеджерыКвалификаций.Квалификация КАК Квалификация
	|ИЗ
	|	МенеджерыКвалификаций КАК МенеджерыКвалификаций
	|
	|УПОРЯДОЧИТЬ ПО
	|	МенеджерыКвалификаций.Квалификация.Сортировка,
	|	МенеджерыКвалификаций.Квалификация.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МенеджерыКвалификаций.Менеджер КАК Менеджер,
	|	МенеджерыКвалификаций.Менеджер.Подразделение КАК Подразделение,
	|	ЛОЖЬ КАК БлокироватьВыдачу,
	|	МенеджерыКвалификаций.Менеджер.Наименование КАК МенеджерНаименование
	|ИЗ
	|	МенеджерыКвалификаций КАК МенеджерыКвалификаций
	|
	|УПОРЯДОЧИТЬ ПО
	|	МенеджерНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияМенеджерыТехЦентра.Менеджер КАК Менеджер,
	|	смартПредопределенныеЗначенияМенеджерыТехЦентра.Менеджер.Наименование КАК МенеджерНаименование
	|ПОМЕСТИТЬ МенеджерыТехЦентра
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.МенеджерыТехЦентра КАК смартПредопределенныеЗначенияМенеджерыТехЦентра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенеджерыТехЦентра.Менеджер КАК Менеджер,
	|	МенеджерыТехЦентра.Менеджер.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(смартИсторияСтатусовСотрудниковСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте)) = ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте)
	|				И ЧАС(ДОБАВИТЬКДАТЕ(&ТекущаяДата, СЕКУНДА, (МенеджерыТехЦентра.Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT - 3) * 3600)) > 18
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НеРабочееВремя)
	|		ИНАЧЕ ЕСТЬNULL(смартИсторияСтатусовСотрудниковСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте))
	|	КОНЕЦ КАК Статус,
	|	ЕСТЬNULL(смартИсторияСтатусовСотрудниковСрезПоследних.До, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗанятДо,
	|	МенеджерыТехЦентра.Менеджер.смартРабочийТелефон КАК ВнТелефон,
	|	МенеджерыТехЦентра.Менеджер.смартВнутреннийНомерВАТС КАК ВАТС,
	|	ЧАС(ДОБАВИТЬКДАТЕ(&ТекущаяДата, СЕКУНДА, (МенеджерыТехЦентра.Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT - 3) * 3600)) КАК ВРЕМЯЧАС,
	|	МобильныеТелефоны.Представление КАК МобильныйТелефон
	|ИЗ
	|	МенеджерыТехЦентра КАК МенеджерыТехЦентра
	//++ #Б-7054 смарт: Фролов 01.06.2026 //Отпуска сотрудников на текущую дату
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних КАК смартИсторияСтатусовСотрудниковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(&ТекущаяДата, ) КАК смартИсторияСтатусовСотрудниковСрезПоследних
	//-- #Б-7054 смарт: Фролов 01.06.2026
	|		ПО МенеджерыТехЦентра.Менеджер = смартИсторияСтатусовСотрудниковСрезПоследних.Пользователь
	|		ЛЕВОЕ СОЕДИНЕНИЕ МобильныеТелефоны КАК МобильныеТелефоны
	|		ПО МенеджерыТехЦентра.Менеджер = МобильныеТелефоны.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗанятДо,
	|	Подразделение,
	|	МенеджерыТехЦентра.МенеджерНаименование");
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("НеБлокироватьВыдачу", НеБлокироватьВыдачу);
	Запрос.УстановитьПараметр("КвалификацияНепределено", КвалификацияНепределено); 
	Запрос.УстановитьПараметр("МобильныйТелефон", Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя);
	
	МасРезультатов = Запрос.ВыполнитьПакет();
	
	ДеревоРегионов = МасРезультатов[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЭтаФорма.Менеджеры.Загрузить(МасРезультатов[6].Выгрузить());
	ЭтаФорма.Квалификации.ЗагрузитьЗначения(МасРезультатов[7].Выгрузить().ВыгрузитьКолонку("Квалификация"));
	МенеджерыНеопределено = МасРезультатов[8].Выгрузить();
	ЭтаФорма.МенеджерыТЦ.Загрузить(МасРезультатов[10].Выгрузить());
	
	Если НеБлокироватьВыдачу Тогда
		
		ЭтаФорма.Квалификации.Добавить(КвалификацияНепределено);
		
		Для Каждого СтрМенеджерыНеопределено Из МенеджерыНеопределено Цикл
			
			СтрМенеджеры = ЭтаФорма.Менеджеры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрМенеджеры, СтрМенеджерыНеопределено);
			СтрМенеджеры.Квалификация = КвалификацияНепределено;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	КоллекцияЭлементовДерева = ЭтаФорма.Регионы.ПолучитьЭлементы();
	КоллекцияЭлементовДерева.Очистить();
	
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, ДеревоРегионов); 
	
	//++ #Б-7790 смарт: Фролов 06.08.2026 //Добавить Источник в рабочее место секретаря
	ЭтаФорма.Источник = Неопределено; 
	//-- #Б-7790 смарт: Фролов 06.08.2026
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияИВидимостьПоУмолчанию()
	
	Элементы.ГруппаАбонентСтр.Видимость = Истина;
	Элементы.ГруппаАбонент.Видимость = Ложь;
	Элементы.ГруппаАбонентСтрПр.Видимость = Истина;
	Элементы.ГруппаАбонентПр.Видимость = Ложь;
	Элементы.АбонентКомпанияСтрЭП.Видимость = Истина;
	Элементы.АбонентКомпанияЭП.Видимость = Ложь;
	Элементы.ОсновныеМенеджеры.Видимость = Ложь;
	Элементы.ОсновныеМенеджерыЭП.Видимость = Ложь;
	Элементы.ОсновныеМенеджерыПр.Видимость = Ложь;
	Элементы.ТекстПисьмаHTML.Видимость = Ложь;
	Элементы.ТекстПисьма.Видимость = Истина;
	Элементы.ДекорацияЗвонокСотрудника.Видимость = Ложь;
	Элементы.ДекорацияКонтакт.Видимость = Ложь;
	
	ОжиданиеЗвонка = Истина;
	
	ИдентификаторЗвонка = "";
	ТелефонВходящий = "";
	Телефон = "";
	РегионОпределенный = "";
	ИдентификаторСобытия = "";
	АбонентКомпанияСтр = "";
	АбонентКомпанияСтрЭП = "";
	АбонентИмяСтр = "";
	ТемаПисьма = "";
	Канал = "";
	Источник = "";
	ПочтаПр = "";
	ТелефонПр = "";
	АбонентКомпания = Неопределено;
	АбонентИмя = Неопределено;
	АбонентКомпанияЭП = Неопределено;
	Письмо = Неопределено;
	ОсновныеМенеджеры.Очистить();
	
	Потребность = "";
	Элементы.ДекорацияКонтакт.Заголовок = "";
	ВходящиеЗвонки.Очистить();
	
	Элементы.ПрикрепленныеФайлы.Видимость = Ложь;

КонецПроцедуры	

&НаКлиенте
Процедура КвалификацииПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Квалификации.ТекущиеДанные <> Неопределено Тогда
		
		УстановитьОтборМенеджеров();
		ЭтаФорма.ВыбраннаяКвалификация = Элементы.Квалификации.ТекущиеДанные.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборМенеджеров()
	
	Если ОтборПоРегиону И Элементы.Квалификации.ТекущиеДанные <> Неопределено И Элементы.Регионы.ТекущиеДанные <> Неопределено Тогда
		Элементы.Менеджеры.ОтборСтрок = Новый ФиксированнаяСтруктура("Квалификация, Подразделение",
			Элементы.Квалификации.ТекущиеДанные.Значение, 
			?(ЗначениеЗаполнено(ВернутьЗначениеРеквизитаОбъекта(Элементы.Регионы.ТекущиеДанные.Регион, "смартОтветственоеПодразделение")),
				ВернутьЗначениеРеквизитаОбъекта(Элементы.Регионы.ТекущиеДанные.Регион, "смартОтветственоеПодразделение"), 
				ВернутьЗначениеРеквизитаОбъекта(НайтиРегионВерхнегоУровня(Элементы.Регионы.ТекущиеДанные.Регион), "смартОтветственоеПодразделение")));
	ИначеЕсли НЕ ОтборПоРегиону И Элементы.Квалификации.ТекущиеДанные <> Неопределено ТОгда
		Элементы.Менеджеры.ОтборСтрок = Новый ФиксированнаяСтруктура("Квалификация", Элементы.Квалификации.ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегионыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Регионы.ТекущиеДанные <> Неопределено Тогда
		
		УстановитьОтборМенеджеров();
		ВыбранныйРегион = Элементы.Регионы.ТекущиеДанные.Регион;
		ВыбранныйРегионВУ = НайтиРегионВерхнегоУровня(ВыбранныйРегион);
		
		СортироватьТаблицуМенеджеров(ВернутьЗначениеРеквизитаОбъекта(ВыбранныйРегионВУ, "смартОтветственоеПодразделение"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СортироватьТаблицуМенеджеров(Подразделение)
	
	Для Каждого СтрМенеджеры Из Менеджеры Цикл
		
		Если СтрМенеджеры.Подразделение = Подразделение Тогда
			СтрМенеджеры.СортировкаПодразделений = 1;
		Иначе	
			СтрМенеджеры.СортировкаПодразделений = 0;
		КонецЕсли;
		
	КонецЦикла;	
	
	Менеджеры.Сортировать("ЗанятДо ВОЗР, БлокироватьВыдачу ВОЗР, СортировкаПодразделений УБЫВ, ВыданоЛидов ВОЗР, ВыдатьЛидов УБЫВ, Подразделение ВОЗР"); 
	
КонецПроцедуры	

&НаКлиенте
Процедура МенеджерыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Менеджеры.ТекущиеДанные;
	
	Если Элементы.Менеджеры.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ВыбранныйСотрудник = ТекущиеДанные.Менеджер;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВернутьЗначениеРеквизитаОбъекта(ПутьКОбъекту, ИмяРеквизита)
	
	Возврат ПутьКОбъекту[ИмяРеквизита];	
	
КонецФункции	

&НаКлиенте
Процедура ОтборПоРегионуПриИзменении(Элемент)
	
	УстановитьОтборМенеджеров();
	
КонецПроцедуры

&НаСервере
Функция ТелефонПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВозврата = Новый Структура;
	Если ЗначениеЗаполнено(ЭтаФорма.Телефон) Тогда
		ТелефонДляПоиска=ОставитьТолькоЦиФрыВСтроке(ЭтаФорма.Телефон); 
		
		СтруктураПроверки = Новый Структура();
		СтруктураПроверки.Вставить("Телефон",ТелефонДляПоиска);
		СтруктураПроверки.Вставить("ДатаЛида",ТекущаяДата());
		
		МасПартнеров=Новый СписокЗначений;
		МасКонтактов=Новый СписокЗначений;
		//Пытаемся по конактным данным найти Партнерра и Контактное лицо
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ТелефонДляПоиска);
		Клиент_Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		лКэшПоиска = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		лКэшЗаполнения = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		лУсловияПоиска = Новый Массив;
		лСтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(Клиент_Телефон, лКэшПоиска, лКэшЗаполнения);
		лРезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(лСтрокаПоискаНормализованная, 2, Истина,Истина);
		Для Каждого СтрлРезультатПоиска Из лРезультатПоиска.Элементы Цикл
			Если ТипЗнч(СтрлРезультатПоиска)=Тип("СправочникСсылка.Партнеры") И МасПартнеров.НайтиПоЗначению(СтрлРезультатПоиска)=Неопределено ТОгда
				МасПартнеров.Добавить(СтрлРезультатПоиска,""+СтрлРезультатПоиска + " - "+СтрлРезультатПоиска.Код+"");
			КонецЕсли;
			Если ТипЗнч(СтрлРезультатПоиска)=Тип("СправочникСсылка.КонтактныеЛицаПартнеров") И МасКонтактов.НайтиПоЗначению(СтрлРезультатПоиска)=Неопределено ТОгда
				МасКонтактов.Добавить(СтрлРезультатПоиска,СтрлРезультатПоиска);
				Если МасПартнеров.НайтиПоЗначению(СтрлРезультатПоиска.Владелец)=Неопределено ТОгда
					МасПартнеров.Добавить(СтрлРезультатПоиска.Владелец,""+СтрлРезультатПоиска.Владелец + " - "+СтрлРезультатПоиска.Владелец.Код+"");
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		РезультатыПоискаПоКИ="Контактная информация найдена у: ";
		Если МасПартнеров.Количество()=1 ТОгда
			АбонентКомпания=МасПартнеров[0].Значение;
			//Неддействительным не даем лид
		ИначеЕсли МасПартнеров.Количество()>1 ТОгда	
			Для Каждого СтрМасПартнеров Из МасПартнеров Цикл
				РезультатыПоискаПоКИ=РезультатыПоискаПоКИ+Символы.ПС+" - "+СтрМасПартнеров.Представление;	
			КонецЦикла;
		КонецЕсли;
		Если МасКонтактов.Количество()=1 ТОгда
			АбонентИмя = МасКонтактов[0].Значение;
			АбонентИмяСтр = МасКонтактов[0].Значение.Наименование;
		ИначеЕсли МасКонтактов.Количество()>1 ТОгда	
			Для Каждого СтрМасКонтактов Из МасКонтактов Цикл
				РезультатыПоискаПоКИ=РезультатыПоискаПоКИ+Символы.ПС+" - "+СтрМасКонтактов.Представление;	
			КонецЦикла;
		КонецЕсли;
		Если НЕ РезультатыПоискаПоКИ="Контактная информация найдена у: " Тогда
			Элементы.ДекорацияКонтакт.Заголовок = РезультатыПоискаПоКИ;
			Элементы.ГруппаАбонентСтр.Видимость = Истина;
			Элементы.ГруппаАбонент.Видимость = Ложь;
			Элементы.ОсновныеМенеджеры.Видимость = Ложь;
		ИначеЕсли МасПартнеров.Количество() = 0 И МасКонтактов.Количество() = 0 Тогда
			Элементы.ДекорацияКонтакт.Заголовок = "Телефон в базе не найден!";
			Элементы.ГруппаАбонентСтр.Видимость = Истина;
			Элементы.ГруппаАбонент.Видимость = Ложь;
			Элементы.ОсновныеМенеджеры.Видимость = Ложь;
		Иначе	
			Элементы.ДекорацияКонтакт.Заголовок = "";
			Элементы.ГруппаАбонентСтр.Видимость = Ложь;
			Элементы.ГруппаАбонент.Видимость = Истина;
			Элементы.ОсновныеМенеджеры.Видимость = Истина;
			ЗаполнитьМенеджеровАбонента();
		КонецЕсли;	
		//Ищем Бизнес-регион по телефону с помощью DaData пока что текстовое значение
		РегионОпределенный=ОбработатьТелефонНаСервере(ТелефонДляПоиска);
		РегионСсылка=НайтиРегион(РегионОпределенный);
		Если ЗначениеЗаполнено(РегионСсылка) И НЕ ЗначениеЗаполнено(РегионСсылка.смартОтветственоеПодразделение) ТОгда
			Регион=РегионСсылка;
			//Регион=НайтиРегионВерхнегоУровня(РегионСсылка);
			СтруктураВозврата.Вставить("Регион", Регион);
		ИначеЕсли ЗначениеЗаполнено(РегионСсылка) И ЗначениеЗаполнено(РегионСсылка.смартОтветственоеПодразделение) ТОгда	
			Регион=РегионСсылка;
			СтруктураВозврата.Вставить("Регион", Регион);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ОставитьТолькоЦиФрыВСтроке(СтрокаОбработки)
	НовСтрока = "";
	ПравильныеСимволы = "0123456789";
	Для Сч = 1 по СтрДлина(СтрокаОбработки) Цикл
		ТекСимв = Сред(СтрокаОбработки, Сч, 1);
		Если Найти(ПравильныеСимволы, ТекСимв) > 0 Тогда
			НовСтрока = НовСтрока + ТекСимв;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовСтрока;
КонецФункции

&НаСервере
Функция НайтиРегион(СтрокаРегион) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаРегион1 = СтрЗаменить(СтрокаРегион, "Край", "");
	СтрокаРегион2 = СтрЗаменить(СтрокаРегион1, "Область", "");
	СтрокаРегион3 = СтрЗаменить(СтрокаРегион2, "Республика", "");
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРегион3, " ");
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БизнесРегионы
	|ГДЕ
	|	Наименование ПОДОБНО &Регион
	|	И НЕ ПометкаУдаления
	|	И НЕ CRM_КодСтраны = """"");
	
	Для Каждого СтрМассивПодстрок Из МассивПодстрок Цикл
		
		Запрос.УстановитьПараметр("Регион", СтрМассивПодстрок + "%");
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() ТОгда
			
			Возврат Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Справочники.БизнесРегионы.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция НайтиРегионВерхнегоУровня(Регион)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегионПоиска=Регион;
	Пока ЗначениеЗаполнено(РегионПоиска.Родитель) Цикл
		РегионПоиска=НайтиРегионВерхнегоУровня(РегионПоиска.Родитель);
	КонецЦикла;	
	Возврат РегионПоиска;
КонецФункции

&НаСервере
Функция ОбработатьТелефонНаСервере(Телефон) Экспорт
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type" , "application/json");
	Заголовки.Вставить("Authorization", "Token " + "326380939ea6d417cad8a93feb42914f0c26e506");
	Заголовки.Вставить("X-Secret"     , "f7feaa44d6be717d4e0b1e64dc322b4890c943b2");
	
	Запрос = Новый HTTPЗапрос("/api/v1/clean/phone", Заголовки);
	Запрос.УстановитьТелоИзСтроки("[""" + Телефон + """]", КодировкаТекста.UTF8, 
								  ИспользованиеByteOrderMark.НеИспользовать);
	Соединение = Новый HTTPСоединение("cleaner.dadata.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено),);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Если Ответ.КодСостояния=200 ТОгда
		Попытка
			ОтветСервера = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			Чтение=Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(ОтветСервера);
			Прочитанное=ПрочитатьJSON(Чтение);
			Если ТипЗнч(Прочитанное)=Тип("Массив") И Прочитанное.Количество()>0 ТОгда
				Возврат ?(ЗначениеЗаполнено(Прочитанное[0].region),Прочитанное[0].region,Прочитанное[0].country);	
			Иначе	
				ОбщегоНазначения.СообщитьПользователю("Для телефона "+Телефон+" не удалось определить телефон!");
				Возврат Неопределено;
			КонецЕсли;	
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Для телефона "+Телефон+" не удалось определить телефон!");
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	Перем ТекСтрИдентиф;
	
	СтруктураПоиска = ТелефонПриИзмененииНаСервере();
	
	Если СтруктураПоиска.Свойство("Регион") Тогда
		
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Регион", ТекСтрИдентиф, Регионы.ПолучитьЭлементы(), СтруктураПоиска.Регион, Ложь);
		Элементы.Регионы.ТекущаяСтрока = ТекСтрИдентиф;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИнтересИПеревестиЗвонокНаСервере(ОтправлятьСМС = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	ОбЛид = Неопределено;
	
	Попытка
		
		Если ЗначениеЗаполнено(АбонентКомпания) Тогда
			
			смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер,
			"НайденСуществующийПартнер", Новый Структура("Партнер, Пользователь", АбонентКомпания, ВыбранныйСотрудник));
			
			ЗафиксироватьТранзакцию();
			
			УстановитьЗначенияИВидимостьПоУмолчанию();
			
		Иначе	
			
			//++ #Б-5936 смарт: Фролов 06.03.2026 //Ошибка. Доработать механизм перераспределения лидов.
			//ДатаКонтроля = ВернутьКонтрольныеДатуВремя(ВыбранныйСотрудник,ВыбраннаяКвалификация);
			ДатаКонтроля = смартОбщегоНазначения.ВернутьКонтрольныеДатуВремя(ВыбранныйСотрудник, ВыбраннаяКвалификация);
			//-- #Б-5936 смарт: Фролов 06.03.2026
			
			ОбЛид = Документы.смартЛид.СоздатьДокумент();
			ОбЛид.Ответственный = ВыбранныйСотрудник;
			ОбЛид.Распределил = ПараметрыСеанса.ТекущийПользователь;
			ОбЛид.СостояниеЛида = Перечисления.смартСостоянияЛидов.Распределен;
			ОбЛид.БизнесРегион = ВыбранныйРегион;
			ОбЛид.Квалификация = ВыбраннаяКвалификация;
			ОбЛид.Дата = ТекущаяДата();
			ОбЛид.БизнесРегионТекст = РегионОпределенный;
			ОбЛид.ДокументОснование = ДокументТелефонныйЗвонок.Ссылка;
			ОбЛид.КонтактноеЛицо = АбонентИмя;
			ОбЛид.Имя = АбонентИмяСтр;
			ОбЛид.Партнер = АбонентКомпания;
			//++ #Б-6692 смарт: Фролов 27.04.2026 //Ошибка. Вы не обработали вовремя Лид (смарт)
			Если НЕ Элементы.ДекорацияКонтакт.Заголовок = "Телефон в базе не найден!" Тогда
				ОбЛид.РезультатыПоискаПоКИ = Элементы.ДекорацияКонтакт.Заголовок;
			КонецЕсли;	
			//-- #Б-6692 смарт: Фролов 27.04.2026
			ОбЛид.Тема = "Звонок по квалификации " + ВыбраннаяКвалификация;
			ОбЛид.ТекстИсточника = Потребность;
			ОбЛид.Телефон = Телефон;
			ОбЛид.Записать(РежимЗаписиДокумента.Запись);
			
			ОбИнтерес=Документы.CRM_Интерес.СоздатьДокумент();
			ОбИнтерес.Дата=ТекущаяДата();
			ОбИнтерес.ДокументОснование = ОбЛид.Ссылка;
			ОбИнтерес.КонтактноеЛицо = ОбЛид.КонтактноеЛицо;
			//++ #Б-7790 смарт: Фролов 06.08.2026 //Добавить Источник в рабочее место секретаря
			ОбИнтерес.смартИнтересКанал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Входящий звонок");
			//ОбИнтерес.смартИнтересИсточник = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоНаименованию("+7-495-663-9111");
			ОбИнтерес.смартИнтересИсточник = ЭтаФорма.ИсточникТелефон;
			//-- #Б-7790 смарт: Фролов 06.08.2026
			ОбИнтерес.ЦенаВключаетНДС = Истина;
			ОбИнтерес.Партнер = ОбЛид.Партнер;
			ОбИнтерес.РучнойВводДатыПродажи = Истина;
			ОбИнтерес.ТипУслуги = ВыбраннаяКвалификация.ТипУслуги;
			Если ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда
				ОбИнтерес.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Иначе	
				ОбИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
			КонецЕсли;
			ОбИнтерес.смартВоронкаНовые = Истина;
			ОбИнтерес.Тема = ОбЛид.Тема;
			ОбИнтерес.Ответственный = ОбЛид.Ответственный;
			ОбИнтерес.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ОбИнтерес.Ответственный, "ОсновнаяОрганизация");
			ОбИнтерес.смартПредварительнаяКвалификация	= ВыбраннаяКвалификация;
			ОбИнтерес.СостояниеИнтереса = ВыбраннаяКвалификация.СтартовыйЭтап;
			ОбИнтерес.СрокРеакции = ДатаКонтроля;
			ОбИнтерес.Подразделение = ВыбранныйСотрудник.Подразделение;
			ОбИнтерес.Офис = ВыбранныйСотрудник.Подразделение.CRM_офис;
			ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
			
			НаборЗаписей = РегистрыСведений.смартВыдачаЛидов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Менеджер.Установить(ВыбранныйСотрудник);
			НаборЗаписей.Отбор.Квалификация.Установить(ВыбраннаяКвалификация);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей[0].ВыданоЛидов=НаборЗаписей[0].ВыданоЛидов + 1;
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.смартИсторияРаботыСЛидом.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Лид.Установить(ОбЛид.Ссылка);
			НаборЗаписей.Отбор.Менеджер.Установить(ВыбранныйСотрудник);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				СтрНаборЗаписей = НаборЗаписей.Добавить();
			Иначе	
				СтрНаборЗаписей = НаборЗаписей[0];	
			КонецЕсли;
			СтрНаборЗаписей.Лид = ОбЛид.Ссылка;
			СтрНаборЗаписей.Менеджер = ВыбранныйСотрудник;
			СтрНаборЗаписей.ДатаВыдачи = ТекущаяДата();
			СтрНаборЗаписей.ДатаКонтроля = ДатаКонтроля;
			СтрНаборЗаписей.ДатаОбработки = Неопределено;
			СтрНаборЗаписей.ПервыйКонтакт = Неопределено;
			НаборЗаписей.Записать(Истина);
			
			смартСервер.УдалитьМенеджераИзОбщейОчереди(ВыбранныйСотрудник);
			
			смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес,
			"СозданНовыйИнтерес", ОбИнтерес.Ссылка);
			
			ЗафиксироватьТранзакцию();
			
			Если ОтправлятьСМС Тогда
				
				ТекстСообщения = "" + Константы.смартТекстЗаголовкаСМС.Получить() + "тел: " + Телефон + ", " + ?(ЗначениеЗаполнено(АбонентИмя), АбонентИмя, АбонентИмяСтр) + ", " 
				+ ?(ЗначениеЗаполнено(АбонентКомпания), АбонентКомпания, АбонентКомпанияСтр) + ", " + ВыбраннаяКвалификация + ""; 
				
				Результат = смартОбщегоНазначения.ОтправитьСМСПользователю(ВыбранныйСотрудник, ТекстСообщения);
				
				Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
					ОбщегоНазначения.СообщитьПользователю("Не удалось отправить SMS менеджеру: " + Результат.ОписаниеОшибки);
				Иначе
					ОбщегоНазначения.СообщитьПользователю("Отправлено SMS менеджеру");
				КонецЕсли;
				
			КонецЕсли;
			
			УстановитьЗначенияИВидимостьПоУмолчанию();
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Не удалось создать документы");
		
	КонецПопытки;
	
	Если ТипЗнч(ОбЛид) = Тип("ДокументОбъект.смартЛид") Тогда
	
		ОтправитьПисьмоПоЛиду(ОбЛид.Ссылка.Тема, ВыбраннаяКвалификация, ОбЛид.Ссылка, 1);
		
	КонецЕсли;	
	
КонецПроцедуры

//++ #Б-5936 смарт: Фролов 06.03.2026 //Ошибка. Доработать механизм перераспределения лидов.
//&НаСервере
//Функция ВернутьКонтрольныеДатуВремя(Менеджер,Квалификация)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	ВремяПоГринвичу=Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT;
//	
//	ПриведеннаяТекущаяДата=ТекущаяДата()+(ВремяПоГринвичу-3)*3600;
//	Если НачалоДня(ТекущаяДата())+3600*17>=ПриведеннаяТекущаяДата Тогда //Определяем не закончился ли рабочий день
//		//Успеваем сегодня
//		Если НачалоДня(ТекущаяДата())+3600*9>=ПриведеннаяТекущаяДата ТОгда
//			Возврат НачалоДня(ТекущаяДата())+3600*9+Квалификация.ВремяРеакции*3600;
//		Иначе	
//			Возврат ПриведеннаяТекущаяДата+Квалификация.ВремяРеакции*3600;
//		КонецЕсли;	
//	Иначе
//		//Переносим на следующий рабочий день
//		СледующийРабочийДень=ВернутьСледующуюРабочуюДату(ПриведеннаяТекущаяДата+24*3600);
//		КонтрольнаяДата=СледующийРабочийДень+3600*9-(ВремяПоГринвичу-3)*3600+Квалификация.ВремяРеакции*3600;
//		Возврат КонтрольнаяДата;
//	КонецЕсли;	
//	
//КонецФункции

//&НаСервере
//Функция ВернутьСледующуюРабочуюДату(СледующийДень)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
//	ПараметрыПолученияБлижайшихРабочихДат = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат(Календарь);
//	ПараметрыПолученияБлижайшихРабочихДат.УчитыватьНерабочиеПериоды = Ложь;
//	
//	МассивДат = Новый Массив;
//	МассивДат.Добавить(СледующийДень);
//	СоответствиеДатаЗаказаДатаЗаказаКалендарная = КалендарныеГрафики.БлижайшиеРабочиеДаты(Календарь, МассивДат, ПараметрыПолученияБлижайшихРабочихДат);
//	РабочаяДата=СоответствиеДатаЗаказаДатаЗаказаКалендарная.Получить(НачалоДня(СледующийДень));
//	
//	Возврат РабочаяДата;
//	
//КонецФункции
//-- #Б-5936 смарт: Фролов 06.03.2026

&НаКлиенте
Процедура СоздатьИнтересИПеревестиЗвонок(Команда)

	//++ #Б-7790 смарт: Фролов 06.08.2026 //Добавить Источник в рабочее место секретаря
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ИсточникТелефон) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните источник.", , "ИсточникТелефон");
		Возврат;
		
	КонецЕсли;
	//-- #Б-7790 смарт: Фролов 06.08.2026
	
	СоздатьИнтересИПеревестиЗвонокНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПринятьЗвонок(Команда)
	
	Перем ТекСтрИдентиф;
	
	Телефон = ТелефонВходящий;
	ТелефонВходящий = "";
	ВходящиеЗвонки.Очистить();	
	
	Если ЭтоНеНомерСотрудника(Телефон) Тогда
	
		СтруктураПоиска = ТелефонПриИзмененииНаСервере();
	
		Если СтруктураПоиска.Свойство("Регион") Тогда
			
			ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Регион", ТекСтрИдентиф, Регионы.ПолучитьЭлементы(), СтруктураПоиска.Регион, Ложь);
			Элементы.Регионы.ТекущаяСтрока = ТекСтрИдентиф;
		
		КонецЕсли;
	
	
		СоздатьТелефонныйЗвонок();
		
		Элементы.ДекорацияЗвонокСотрудника.Видимость = Ложь;
		Элементы.ДекорацияКонтакт.Видимость = Истина;
		
	Иначе
		
		Элементы.ДекорацияЗвонокСотрудника.Видимость = Истина;
		Элементы.ДекорацияКонтакт.Видимость = Ложь;
	
	КонецЕсли;
	
	Элементы.ГруппаВходящийЗвонок.Видимость = Ложь;
	ОжиданиеЗвонка = Ложь;

КонецПроцедуры

&НаСервере
Функция ЭтоНеНомерСотрудника(НомерТелефона)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	| Ссылка КАК Сотрудник
	|ИЗ
	| Справочник.Пользователи.КонтактнаяИнформация
	|ГДЕ
	| НомерТелефона = &НомерТелефона
	|";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции

&НаСервере
Процедура СоздатьТелефонныйЗвонок()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументТелефонныйЗвонок = сфпСофтФонПроСервер.СоздатьТелефонныйЗвонок(Неопределено, Телефон, 
																		   ПараметрыСеанса.ТекущийПользователь, ПараметрыСеанса.ТекущийПользователь, 
																		   ПараметрыСеанса.ТекущийПользователь.смартВнутреннийНомерВАТС, Истина, ТекущаяДатаСеанса(), 
																		   ИдентификаторЗвонка);
																		   
	Успех = смартСобытияВзаимодействий.ОбработатьДанныеСобытияВзаимодействий(ИдентификаторСобытия);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоискПоРегионуАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Элемент.ТекстРедактирования = "" Тогда
		ДанныеВыбора = ПолучитьДанные(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанные(СтрокаПоиска)
	
	УстановитьПривилегированныйРежим(Истина);
	
	лЗапрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
	|	АдресныеОбъекты.КодСубъектаРФ КАК КодСубъектаРФ,
	|	БизнесРегионы.Ссылка КАК Регион,
	|	АдресныеОбъекты.Наименование КАК Наименование,
	|	АдресныеОбъекты.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БизнесРегионы КАК БизнесРегионы
	|		ПО АдресныеОбъекты.КодСубъектаРФ = БизнесРегионы.СмартКодСубъектаРФ
	|ГДЕ
	|	АдресныеОбъекты.Сокращение = &Сокращение
	|	И АдресныеОбъекты.Наименование ПОДОБНО &Наименование");

	лЗапрос.УстановитьПараметр("Наименование", "%"+СтрокаПоиска+"%");
	лЗапрос.УстановитьПараметр("Сокращение", "г");
	
	Список = Новый СписокЗначений;
	
	ТабВыборка = лЗапрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТабВыборка Из ТабВыборка Цикл
		Список.Добавить(СтрТабВыборка.КодСубъектаРФ, ""+СтрТабВыборка.Наименование + " ("+СтрТабВыборка.Регион+")");	
	КонецЦикла;	

	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПоискПоРегионуОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Перем ТекСтрИдентиф;
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ПоискПоРегиону = Элемент.ТекстРедактирования;
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Регион", ТекСтрИдентиф, Регионы.ПолучитьЭлементы(), НайтиРегионПоКодуСубъекта(ВыбранноеЗначение), Ложь);
		Элементы.Регионы.ТекущаяСтрока = ТекСтрИдентиф;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиРегионПоКодуСубъекта(КодСубъектаРФ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БизнесРегионы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БизнесРегионы КАК БизнесРегионы
	|ГДЕ
	|	НЕ БизнесРегионы.ПометкаУдаления
	|	И БизнесРегионы.СмартКодСубъектаРФ = &КодСубъектаРФ");
	Запрос.УстановитьПараметр("КодСубъектаРФ", КодСубъектаРФ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	Иначе
		Возврат Справочники.БизнесРегионы.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ВходящиеЗвонкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Перем ТекСтрИдентиф;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Телефон = ТекущиеДанные.Телефон;
		ИдентификаторЗвонка = ТекущиеДанные.ИдентификаторЗвонка;
		ИдентификаторСобытия = ТекущиеДанные.ИдентификаторСобытия;
		ТелефонВходящий = "";
		ВходящиеЗвонки.Очистить();	
		
		ЗаполнитьПервичныеДанныеФормы();
		
		Если ЭтоНеНомерСотрудника(ОставитьТолькоЦиФрыВСтроке(Телефон)) Тогда
			
			СтруктураПоиска = ТелефонПриИзмененииНаСервере();
			
			Если СтруктураПоиска.Свойство("Регион") Тогда
				
				ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Регион", ТекСтрИдентиф, 
					Регионы.ПолучитьЭлементы(), СтруктураПоиска.Регион, Ложь);
				Элементы.Регионы.ТекущаяСтрока = ТекСтрИдентиф;
				
			КонецЕсли;
			
			СоздатьТелефонныйЗвонок();
			
			Элементы.ДекорацияЗвонокСотрудника.Видимость = Ложь;
			Элементы.ДекорацияКонтакт.Видимость = Истина;
		Иначе
			
			Элементы.ДекорацияЗвонокСотрудника.Видимость = Истина;
			Элементы.ДекорацияКонтакт.Видимость = Ложь;
			
			Успех = смартСобытияВзаимодействий.ОбработатьДанныеСобытияВзаимодействий(ИдентификаторСобытия);
			
		КонецЕсли;
		
		Элементы.ГруппаВходящийЗвонок.Видимость = Ложь;
		ОжиданиеЗвонка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ОжиданиеЗвонка Тогда
		
		Если ИмяСобытия = "ВходящийТелефонныйЗвонок" Тогда
			
			ВходящиеЗвонки.Очистить();
			
			Для Каждого Стр Из Параметр.НаборДанных Цикл
				
				Если Стр.Удалить Тогда
					
					Успех = смартСобытияВзаимодействий.ОбработатьДанныеСобытияВзаимодействий(Стр.ИдентификаторСобытия);
					
				Иначе
					
					Если ЭтоНеНомерСотрудника(ОставитьТолькоЦиФрыВСтроке(Стр.Данные.Кто)) Тогда
						
						СтрВходящиеЗвонки = ВходящиеЗвонки.Добавить();
						СтрВходящиеЗвонки.Телефон = Стр.Данные.Кто;
						СтрВходящиеЗвонки.ИдентификаторЗвонка = Стр.Данные.uid;
						СтрВходящиеЗвонки.ИдентификаторСобытия = Стр.ИдентификаторСобытия;
						Если Стр.Данные.Свойство("КтоВзялТрубку") Тогда
							СтрВходящиеЗвонки.КтоВзялТрубку = Стр.Данные.КтоВзялТрубку;
						КонецЕсли;
						
					Иначе
						
						Успех = смартСобытияВзаимодействий.ОбработатьДанныеСобытияВзаимодействий(Стр.ИдентификаторСобытия);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Если ВходящиеЗвонки.Количество() > 0 Тогда
			//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТелефонныйЗвонок;
			//КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Статус", "fromivr");
	СтруктураЗаписи.Вставить("Кто", "+7 (906) 3970034");
	СтруктураЗаписи.Вставить("Кому", "Krasnodar");
	СтруктураЗаписи.Вставить("uid", "1712741258.620");
	СтруктураЗаписи.Вставить("КтоВзялТрубку", "SIP/108-0000051f");
	СтрокаJSON = CRM_СистемаСквознойАналитики.СформироватьСтрокуJSONИзСтруктуры(СтруктураЗаписи);
	
	смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок
	,"Проба",СтрокаJSON);
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Статус","INTERNAL");
	СтруктураЗаписи.Вставить("Кто","+7 (985) 7646859");
	СтруктураЗаписи.Вставить("Кому","503");
	СтруктураЗаписи.Вставить("uid","1712739957.561");
	СтруктураЗаписи.Вставить("КтоВзялТрубку", "11");
	СтрокаJSON = CRM_СистемаСквознойАналитики.СформироватьСтрокуJSONИзСтруктуры(СтруктураЗаписи);
	
	смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок
	,"Проба2",СтрокаJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ЗарегистрироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере()
	
	УстановитьЗначенияИВидимостьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ОтменитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМенеджеровАбонента()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(АбонентКомпания) Тогда
		
		ОсновныеМенеджеры.Очистить();
		
		Если НЕ АбонентКомпания.ОсновнойМенеджер.Пустая() Тогда
			СтрОсновныеМенеджеры = ОсновныеМенеджеры.Добавить();
			СтрОсновныеМенеджеры.ВидМенеджера = "Основной менеджер";
			СтрОсновныеМенеджеры.Менеджер = АбонентКомпания.ОсновнойМенеджер;
			СтрОсновныеМенеджеры.Подразделение = АбонентКомпания.ОсновнойМенеджер.Подразделение;
			СтрОсновныеМенеджеры.Статус = ПолучитьСтатусМенеджера(АбонентКомпания.ОсновнойМенеджер, АбонентКомпания, Истина);
			//++ #Б-7314 смарт: Фролов 12.08.2026 //Рабочее место секретаря. Доработка ТЧ ОсновныеМенеджеры
			СтрОсновныеМенеджеры.СостояниеПартнера = ПолучитьСостояниеПартнера(АбонентКомпания);
			//-- #Б-7314 смарт: Фролов 12.08.2026
			Телефоны = ПолучитьТелефоныМенеджеров(АбонентКомпания.ОсновнойМенеджер);
			СтрОсновныеМенеджеры.ЛичныйТелефон = Телефоны.ЛичныйТелефон;
			СтрОсновныеМенеджеры.МобильныйТелефон = Телефоны.МобильныйТелефон;
			СтрОсновныеМенеджеры.ВнутреннийТелефон = Телефоны.ВнутреннийТелефон;
		КонецЕсли;
		
		Если НЕ АбонентКомпания.смартМенеджерПоРасходнымМатериалам.Пустая() Тогда
			СтрОсновныеМенеджеры = ОсновныеМенеджеры.Добавить();
			СтрОсновныеМенеджеры.ВидМенеджера = "Расходные материалы";
			СтрОсновныеМенеджеры.Менеджер = АбонентКомпания.смартМенеджерПоРасходнымМатериалам;
			СтрОсновныеМенеджеры.Подразделение = АбонентКомпания.смартМенеджерПоРасходнымМатериалам.Подразделение;
			СтрОсновныеМенеджеры.Статус = ПолучитьСтатусМенеджера(АбонентКомпания.смартМенеджерПоРасходнымМатериалам, 
				АбонентКомпания, АбонентКомпания.ОсновнойМенеджер = АбонентКомпания.смартМенеджерПоРасходнымМатериалам);
			//++ #Б-7314 смарт: Фролов 12.08.2026 //Рабочее место секретаря. Доработка ТЧ ОсновныеМенеджеры	
			СтрОсновныеМенеджеры.СостояниеПартнера = ПолучитьСостояниеПартнера(АбонентКомпания, "РМ");
			//-- #Б-7314 смарт: Фролов 12.08.2026
			Телефоны = ПолучитьТелефоныМенеджеров(АбонентКомпания.смартМенеджерПоРасходнымМатериалам);
			СтрОсновныеМенеджеры.ЛичныйТелефон = Телефоны.ЛичныйТелефон;
			СтрОсновныеМенеджеры.МобильныйТелефон = Телефоны.МобильныйТелефон;
			СтрОсновныеМенеджеры.ВнутреннийТелефон = Телефоны.ВнутреннийТелефон;
		КонецЕсли;
		
		Если НЕ АбонентКомпания.смартОсновнойМенеджерСервисЦентра.Пустая() Тогда
			СтрОсновныеМенеджеры = ОсновныеМенеджеры.Добавить();
			СтрОсновныеМенеджеры.ВидМенеджера = "Сервис центр";
			СтрОсновныеМенеджеры.Менеджер = АбонентКомпания.смартОсновнойМенеджерСервисЦентра;
			СтрОсновныеМенеджеры.Подразделение = АбонентКомпания.смартОсновнойМенеджерСервисЦентра.Подразделение;
			СтрОсновныеМенеджеры.Статус = ПолучитьСтатусМенеджера(АбонентКомпания.смартОсновнойМенеджерСервисЦентра, 
				АбонентКомпания, АбонентКомпания.ОсновнойМенеджер = АбонентКомпания.смартОсновнойМенеджерСервисЦентра);
			//++ #Б-7314 смарт: Фролов 12.08.2026 //Рабочее место секретаря. Доработка ТЧ ОсновныеМенеджеры	
			СтрОсновныеМенеджеры.СостояниеПартнера = ПолучитьСостояниеПартнера(АбонентКомпания, "СЦ");
			//-- #Б-7314 смарт: Фролов 12.08.2026
			Телефоны = ПолучитьТелефоныМенеджеров(АбонентКомпания.смартОсновнойМенеджерСервисЦентра);
			СтрОсновныеМенеджеры.ЛичныйТелефон = Телефоны.ЛичныйТелефон;
			СтрОсновныеМенеджеры.МобильныйТелефон = Телефоны.МобильныйТелефон;
			СтрОсновныеМенеджеры.ВнутреннийТелефон = Телефоны.ВнутреннийТелефон;
		КонецЕсли;
		
		Элементы.ОсновныеМенеджерыЭП.Видимость = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
//++ #Б-7314 смарт: Фролов 12.08.2026 //Рабочее место секретаря. Доработка ТЧ ОсновныеМенеджеры
Функция ПолучитьСостояниеПартнера(Партнер, ВидСостояния = "")

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартСостояниеПартнеров.Состояние" + ВидСостояния + " КАК Состояние
	|ИЗ
	|	РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
	|ГДЕ
	|	смартСостояниеПартнеров.Партнер = &Партнер");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
	
КонецФункции //-- #Б-7314 смарт: Фролов 12.08.2026	

&НаСервере
Функция ПолучитьСтатусМенеджера(Менеджер, Партнер, Основной)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Менеджер) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Партнер КАК Партнер
		|ИЗ
		|	РегистрСведений.смартСостояниеПартнеров
		|ГДЕ
		|	Партнер = &Партнер
		|	И Состояние В(&МассивСостояний)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Статус, ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.НаРабочемМесте)) КАК Статус
		|ИЗ
		//++ #Б-7054 смарт: Фролов 01.06.2026 //Отпуска сотрудников на текущую дату
		//|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(, Пользователь = &Менеджер)"); 
		|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(&ТекущаяДата, Пользователь = &Менеджер)");
		//-- #Б-7054 смарт: Фролов 01.06.2026
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		Запрос.УстановитьПараметр("Партнер", Партнер);
		//++ #Б-7054 смарт: Фролов 01.06.2026 //Отпуска сотрудников на текущую дату
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		//-- #Б-7054 смарт: Фролов 01.06.2026
		МассивСостояний = Новый Массив;
		МассивСостояний.Добавить(Перечисления.смартСостоянияПартнеров.Закреплен);
		МассивСостояний.Добавить(Перечисления.смартСостоянияПартнеров.НеСвободен);
		Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		ВыборкаЗакрепленных = МассивРезультатов[0].Выбрать();
		ВыборкаСтатусы = МассивРезультатов[1].Выбрать();
		
		Если ВыборкаЗакрепленных.Следующий() ИЛИ НЕ Основной Тогда
			
			Если ВыборкаСтатусы.Следующий() Тогда
				Возврат ВыборкаСтатусы.Статус;	
			Иначе
				Возврат Справочники.смартСтатусыСотрудников.НаРабочемМесте;
			КонецЕсли;
			
		Иначе	
			
			Возврат Справочники.смартСтатусыСотрудников.НетВыдачи; 
			
		КонецЕсли;
		
	Иначе	
		
		Возврат "";
		
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ОсновныеМенеджерыПриАктивизацииСтроки(Элемент)

	Если Элементы.ОсновныеМенеджеры.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ВыбранныйСотрудник = Элементы.ОсновныеМенеджеры.ТекущиеДанные.Менеджер;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НазначитьЭПСотрудникуНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		//++ #Б-5936 смарт: Фролов 06.03.2026 //Ошибка. Доработать механизм перераспределения лидов.
		//ДатаКонтроля = ВернутьКонтрольныеДатуВремя(ВыбранныйСотрудник,ВыбраннаяКвалификация);
		ДатаКонтроля = смартОбщегоНазначения.ВернутьКонтрольныеДатуВремя(ВыбранныйСотрудник, ВыбраннаяКвалификация);
		//-- #Б-5936 смарт: Фролов 06.03.2026
		
		ОбЛид = Документы.смартЛид.СоздатьДокумент();
		ОбЛид.Ответственный = ВыбранныйСотрудник;
		ОбЛид.Распределил = ПараметрыСеанса.ТекущийПользователь;
		ОбЛид.СостояниеЛида = Перечисления.смартСостоянияЛидов.Распределен;
		ОбЛид.БизнесРегион = ВыбранныйРегион;
		ОбЛид.Квалификация = ВыбраннаяКвалификация;
		ОбЛид.Дата = ТекущаяДата();
		ОбЛид.БизнесРегионТекст = РегионОпределенный;
		ОбЛид.ДокументОснование = Письмо.Ссылка;
		ОбЛид.КонтактноеЛицо = АбонентИмя;
		ОбЛид.Имя = АбонентИмяСтр;
		ОбЛид.Партнер = АбонентКомпания;
		ОбЛид.Тема = ТемаПисьма;
		Если Письмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
			ОбЛид.ТекстИсточника = Письмо.ТекстHTML;
		Иначе	
			ОбЛид.ТекстИсточника = Письмо.Текст;
		КонецЕсли;	
		ОбЛид.ЭлектроннаяПочта =Письмо.ОтправительАдрес;
		ОбЛид.Записать(РежимЗаписиДокумента.Запись);
		
		ОбИнтерес=Документы.CRM_Интерес.СоздатьДокумент();
		ОбИнтерес.Дата=ТекущаяДата();
		ОбИнтерес.ДокументОснование = ОбЛид.Ссылка;
		ОбИнтерес.смартИнтересКанал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Входящее письмо");
		ОбИнтерес.смартИнтересИсточник = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоНаименованию("info@smart-t.ru");
		ОбИнтерес.ЦенаВключаетНДС = Истина;
		ОбИнтерес.Партнер = ОбЛид.Партнер;
		ОбИнтерес.РучнойВводДатыПродажи = Истина;
		ОбИнтерес.ТипУслуги = ВыбраннаяКвалификация.ТипУслуги;
		Если ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда
			ОбИнтерес.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Иначе	
			ОбИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		КонецЕсли;
		ОбИнтерес.смартВоронкаНовые = Истина;
		ОбИнтерес.смартПредварительнаяКвалификация	= ВыбраннаяКвалификация;
		ОбИнтерес.Тема = ОбЛид.Тема;
		ОбИнтерес.Ответственный = ОбЛид.Ответственный;
		ОбИнтерес.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ОбИнтерес.Ответственный, "ОсновнаяОрганизация");
		ОбИнтерес.СостояниеИнтереса = ВыбраннаяКвалификация.СтартовыйЭтап;
		ОбИнтерес.СрокРеакции = ДатаКонтроля;
		ОбИнтерес.Подразделение = ВыбранныйСотрудник.Подразделение;
		ОбИнтерес.Офис = ВыбранныйСотрудник.Подразделение.CRM_офис;
		ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ВерсияДанных КАК ВерсияДанных,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Наименование КАК Наименование,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Автор КАК Автор,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ДатаЗаема КАК ДатаЗаема,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ДатаМодификацииУниверсальная КАК ДатаМодификацииУниверсальная,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Зашифрован КАК Зашифрован,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Изменил КАК Изменил,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ИндексКартинки КАК ИндексКартинки,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Описание КАК Описание,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ПодписанЭП КАК ПодписанЭП,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Размер КАК Размер,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Расширение КАК Расширение,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Редактирует КАК Редактирует,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.СтатусИзвлеченияТекста КАК СтатусИзвлеченияТекста,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ТекстХранилище КАК ТекстХранилище,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Том КАК Том,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ФайлХранилище КАК ФайлХранилище,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ИДФайлаЭлектронногоПисьма КАК ИДФайлаЭлектронногоПисьма,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ХранитьВерсии КАК ХранитьВерсии,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ЭтоВложениеПисьмо КАК ЭтоВложениеПисьмо,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.CRM_ОчищенПоНастройке КАК CRM_ОчищенПоНастройке,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.CRM_ХэшСумма КАК CRM_ХэшСумма,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Предопределенный КАК Предопределенный,
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы КАК ЭлектронноеПисьмоВходящееПрисоединенныеФайлы
		|ГДЕ
		|	ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла");
		Запрос.УстановитьПараметр("ВладелецФайла", Письмо.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			НовыйФайл = Справочники.CRM_ИнтересПрисоединенныеФайлы.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйФайл, Результат);
			НовыйФайл.ВладелецФайла = ОбИнтерес.Ссылка;
			НовыйФайл.ОбменДанными.Загрузка = Истина;
			НовыйФайл.Записать();
		КонецЦикла;		
		
		НаборЗаписей = РегистрыСведений.смартВыдачаЛидов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Менеджер.Установить(ВыбранныйСотрудник);
		НаборЗаписей.Отбор.Квалификация.Установить(ВыбраннаяКвалификация);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей[0].ВыданоЛидов=НаборЗаписей[0].ВыданоЛидов + 1;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.смартИсторияРаботыСЛидом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лид.Установить(ОбЛид.Ссылка);
		НаборЗаписей.Отбор.Менеджер.Установить(ВыбранныйСотрудник);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			СтрНаборЗаписей = НаборЗаписей.Добавить();
		Иначе	
			СтрНаборЗаписей = НаборЗаписей[0];	
		КонецЕсли;
		СтрНаборЗаписей.Лид = ОбЛид.Ссылка;
		СтрНаборЗаписей.Менеджер = ВыбранныйСотрудник;
		СтрНаборЗаписей.ДатаВыдачи = ТекущаяДата();
		СтрНаборЗаписей.ДатаКонтроля = ДатаКонтроля;
		СтрНаборЗаписей.ДатаОбработки = Неопределено;
		СтрНаборЗаписей.ПервыйКонтакт = Неопределено;
		НаборЗаписей.Записать(Истина);
		
		смартСервер.УдалитьМенеджераИзОбщейОчереди(ВыбранныйСотрудник);
		
		смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес,
		"СозданНовыйИнтерес", ОбИнтерес.Ссылка);
		
		
		ЗафиксироватьТранзакцию();
		
		УстановитьЗначенияИВидимостьПоУмолчанию();
		
		ОтправитьПисьмоПоЛиду(ОбЛид.Тема, ВыбраннаяКвалификация, ОбЛид.Ссылка, 2);
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Не удалось создать документы");
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьЭПСотруднику(Команда)

	Если НЕ ЗначениеЗаполнено(Письмо) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать письмо", , "Письмо");
		Возврат;
	КонецЕсли;
	
	НазначитьЭПСотрудникуНаСервере();
	
	ЗаполнитьПервичныеДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеМенеджерыЭППриАктивизацииСтроки(Элемент)

	Если Элементы.ОсновныеМенеджерыЭП.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ВыбранныйСотрудник = Элементы.ОсновныеМенеджерыЭП.ТекущиеДанные.Менеджер;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПисьмоПриИзмененииНаСервере(ВыбраноеПисьмо)
	
	Письмо = ВыбраноеПисьмо;
	
	Если ЗначениеЗаполнено(ВыбраноеПисьмо.ОтправительКонтакт) И ТипЗнч(ВыбраноеПисьмо.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
		
		АбонентКомпания = ВыбраноеПисьмо.ОтправительКонтакт;
		АбонентКомпанияСтр = "";
		
		Элементы.АбонентКомпанияСтрЭП.Видимость = Ложь;
		Элементы.АбонентКомпанияЭП.Видимость = Истина;
		
		ЗаполнитьМенеджеровАбонента();
		
	Иначе
		
		АбонентКомпания = Неопределено;
		АбонентКомпанияСтр = "";
		
		Элементы.АбонентКомпанияСтрЭП.Видимость = Истина;
		Элементы.АбонентКомпанияЭП.Видимость = Ложь;
		
	КонецЕсли;	
	
	ТемаПисьма = ВыбраноеПисьмо.Тема;
	
	Если ВыбраноеПисьмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
		HTMLТекст = "<!DOCTYPE html>
		|<html lang=""ru"">
		|<head>
		|
		|</head>
		|<body>" + ВыбраноеПисьмо.ТекстHTML + "</body>
		|</html>";
		
		ТекстПисьмаHTML = HTMLТекст;
		Элементы.ТекстПисьма.Видимость = Ложь;
		Элементы.ТекстПисьмаHTML.Видимость = Истина;
	Иначе
		ТекстПисьма = ВыбраноеПисьмо.Текст;
		Элементы.ТекстПисьма.Видимость = Истина;
		Элементы.ТекстПисьмаHTML.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НазначитьПРСотрудникуНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		//++ #Б-5936 смарт: Фролов 06.03.2026 //Ошибка. Доработать механизм перераспределения лидов.
		//ДатаКонтроля = ВернутьКонтрольныеДатуВремя(ВыбранныйСотрудник,ВыбраннаяКвалификация);
		ДатаКонтроля = смартОбщегоНазначения.ВернутьКонтрольныеДатуВремя(ВыбранныйСотрудник, ВыбраннаяКвалификация);
		//-- #Б-5936 смарт: Фролов 06.03.2026
		
		ОбЛид = Документы.смартЛид.СоздатьДокумент();
		ОбЛид.Ответственный = ВыбранныйСотрудник;
		ОбЛид.Распределил = ПараметрыСеанса.ТекущийПользователь;
		ОбЛид.СостояниеЛида = Перечисления.смартСостоянияЛидов.Распределен;
		ОбЛид.БизнесРегион = ВыбранныйРегион;
		ОбЛид.Квалификация = ВыбраннаяКвалификация;
		ОбЛид.Дата = ТекущаяДата();
		ОбЛид.БизнесРегионТекст = РегионОпределенный;
		ОбЛид.Имя = АбонентИмяСтр;
		ОбЛид.КонтактноеЛицо = АбонентИмя;
		ОбЛид.Партнер = АбонентКомпания;
		ОбЛид.ЭлектроннаяПочта = ПочтаПр;
		ОбЛид.Тема = "Лид по квалификации " + ВыбраннаяКвалификация;
		ОбЛид.Телефон = ТелефонПр;
		ОбЛид.ТекстИсточника = Потребность;
		ОбЛид.Записать(РежимЗаписиДокумента.Запись);
		
		ОбИнтерес=Документы.CRM_Интерес.СоздатьДокумент();
		ОбИнтерес.Дата=ТекущаяДата();
		ОбИнтерес.ДокументОснование = ОбЛид.Ссылка;
		ОбИнтерес.смартИнтересКанал = Канал;
		ОбИнтерес.смартИнтересИсточник = Источник;
		ОбИнтерес.ЦенаВключаетНДС = Истина;
		ОбИнтерес.РучнойВводДатыПродажи = Истина;
		ОбИнтерес.ТипУслуги = ВыбраннаяКвалификация.ТипУслуги;
		Если ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда
			ОбИнтерес.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Иначе	
			ОбИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		КонецЕсли;
		ОбИнтерес.КонтактноеЛицо = ОбЛид.КонтактноеЛицо;
		ОбИнтерес.Партнер = ОбЛид.Партнер;
		ОбИнтерес.смартВоронкаНовые = Истина;
		ОбИнтерес.смартПредварительнаяКвалификация	= ВыбраннаяКвалификация;
		ОбИнтерес.Тема = ОбЛид.Тема;
		ОбИнтерес.Ответственный = ОбЛид.Ответственный;
		ОбИнтерес.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ОбИнтерес.Ответственный, "ОсновнаяОрганизация");
		ОбИнтерес.СостояниеИнтереса = ВыбраннаяКвалификация.СтартовыйЭтап;
		ОбИнтерес.СрокРеакции = ДатаКонтроля;
		ОбИнтерес.Подразделение = ВыбранныйСотрудник.Подразделение;
		ОбИнтерес.Офис = ВыбранныйСотрудник.Подразделение.CRM_офис;
		ОбИнтерес.Записать(РежимЗаписиДокумента.Запись); 
		
		//++ #Б-7240 смарт: Фролов 02.07.2026 //Файлы из Рабочего места секретаря переносить в Интересы и Лиды
		Для Каждого СтрПрикрепленныеФайлы Из ПрикрепленныеФайлы Цикл
			
			ПараметрыФайла = Новый Структура();
			ПараметрыФайла.Вставить("ИмяБезРасширения", СтрПрикрепленныеФайлы.ИмяФайла);
			ПараметрыФайла.Вставить("РасширениеБезТочки", СтрПрикрепленныеФайлы.Расширение);
			ПараметрыФайла.Вставить("ВладелецФайлов", ОбИнтерес.Ссылка);
			ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь()); 
			ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ТекущаяУниверсальнаяДата());
			
			НовыйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, СтрПрикрепленныеФайлы.АдресФайла);
						
		КонецЦикла;
		//-- #Б-7240 смарт: Фролов 02.07.2026
		
		НаборЗаписей = РегистрыСведений.смартВыдачаЛидов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Менеджер.Установить(ВыбранныйСотрудник);
		НаборЗаписей.Отбор.Квалификация.Установить(ВыбраннаяКвалификация);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей[0].ВыданоЛидов=НаборЗаписей[0].ВыданоЛидов + 1;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.смартИсторияРаботыСЛидом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лид.Установить(ОбЛид.Ссылка);
		НаборЗаписей.Отбор.Менеджер.Установить(ВыбранныйСотрудник);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			СтрНаборЗаписей = НаборЗаписей.Добавить();
		Иначе	
			СтрНаборЗаписей = НаборЗаписей[0];	
		КонецЕсли;
		СтрНаборЗаписей.Лид = ОбЛид.Ссылка;
		СтрНаборЗаписей.Менеджер = ВыбранныйСотрудник;
		СтрНаборЗаписей.ДатаВыдачи = ТекущаяДата();
		СтрНаборЗаписей.ДатаКонтроля = ДатаКонтроля;
		СтрНаборЗаписей.ДатаОбработки = Неопределено;
		СтрНаборЗаписей.ПервыйКонтакт = Неопределено;
		НаборЗаписей.Записать(Истина);
		
		смартСервер.УдалитьМенеджераИзОбщейОчереди(ВыбранныйСотрудник);
		
		смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес,
		"СозданНовыйИнтерес", ОбИнтерес.Ссылка);
		
		
		ЗафиксироватьТранзакцию();
		
		УстановитьЗначенияИВидимостьПоУмолчанию();
		
		ОтправитьПисьмоПоЛиду(ОбЛид.Тема, ВыбраннаяКвалификация, ОбЛид.Ссылка, 3);
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Не удалось создать документы");
		
	КонецПопытки;
	
	ЗаполнитьПервичныеДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура НазначитьПРСотруднику(Команда)
	
	Если НЕ ЗначениеЗаполнено(Канал) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить Канал", , "Канал");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Источник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить Источник", , "Источник");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Потребность) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить Потребность", , "Потребность");
		Возврат;
	КонецЕсли;
	
	НазначитьПРСотрудникуНаСервере();
	
	Элементы.ПрикрепленныеФайлы.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоПоЛиду(ТемаПисьма, Квалификация, Лид, Вариант)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
	АдресаДляОтправкиСтрокой = "";
	
	//++ #Б-6630 смарт: Фролов 28.05.2026 //Сделать механизм оповещений о новых Инцидентах.
	//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.
	//МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомленийПоТипуПродукта(Квалификация, Лид.Ответственный, АдресаДляОтправкиСтрокой, "Новые");
	МассивАдресовДляОтправки = Новый Массив;
	
	МассивПользователей = смартОбщегоНазначения.ПолучитьПользователейПоНастройкамОбОповещениях("Интересы", Лид.Ответственный.Подразделение, Квалификация.ТипПродукта, "Новые");
	
	Если НЕ МассивПользователей = Неопределено Тогда
		
		Для Каждого Пользователь Из МассивПользователей Цикл
			
			МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", Пользователь.смартРабочаяПочта, Пользователь.смартРабочаяПочта));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Пользователь.смартРабочаяПочта;
			
		КонецЦикла;
		
	КонецЕсли;
	//-- #Б-6630 смарт: Фролов 28.05.2026
	
	Если МассивАдресовДляОтправки.Количество() = 0 Тогда
		
		МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(Справочники.смартПредопределенныеЗначения.ПолучателиОтчетаПоРаспределениюЛидов,
			АдресаДляОтправкиСтрокой, Истина);
		
	КонецЕсли;	
	//-- #Б-3858 смарт: Фролов 21.07.2025
	МассивАдресовДляОтправкиПоКвалификации = смартОбщегоНазначения.ПолучитьАдресаПолучателейУведомленийПоКвалификации(Квалификация, АдресаДляОтправкиСтрокой);
	Для Каждого СтрМассивАдресовДляОтправкиПоКвалификации Из МассивАдресовДляОтправкиПоКвалификации Цикл
		МассивАдресовДляОтправки.Добавить(СтрМассивАдресовДляОтправкиПоКвалификации);	
	КонецЦикла;	
	
	ОбЛид = Лид.ПолучитьОбъект();
	НавСсылка=ПолучитьНавигационнуюСсылку(ОбЛид);
	Если ЗначениеЗаполнено(Лид.ДокументОснование) И ТипЗнч(Лид.ДокументОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		
		Если Лид.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
			ТекстСодержания = Взаимодействия.ПолучитьОбычныйТекстИзHTML(Лид.ТекстИсточника);
		Иначе	
			ТекстСодержания = Лид.ТекстИсточника;
		КонецЕсли;
		
	Иначе 
		
		ТекстСодержания = Лид.ТекстИсточника;
	
	КонецЕсли;
	
	ТекстПисьма = "";
	ТекстПисьма=ТекстПисьма+"Распределение: ручное" + Символы.ПС;
	Если Вариант = 1 Тогда
		ТекстПисьма=ТекстПисьма+"Канал: Телефонный звонок "+""+Символы.ПС+Символы.ПС;
	ИначеЕсли Вариант = 2 Тогда
		ТекстПисьма=ТекстПисьма+"Канал: Электронное письмо "+""+Символы.ПС+Символы.ПС;
	Иначе
		ТекстПисьма=ТекстПисьма+"Канал: Прочее "+""+Символы.ПС+Символы.ПС;
	КонецЕсли;
	ТекстПисьма=ТекстПисьма+"Ответственный " + Лид.Ответственный + ""+Символы.ПС;
	ТекстПисьма=ТекстПисьма+"Квалификация " + Лид.Квалификация + ""+Символы.ПС;
	ТекстПисьма=ТекстПисьма+"Регион " + Лид.БизнесРегион + ""+Символы.ПС;
	ТекстПисьма=ТекстПисьма+"Распределен "+Строка(Лид)+Символы.ПС+"Навигационная ссылка на документ: "+НавСсылка+""+Символы.ПС;
	ТекстПисьма=ТекстПисьма+"Телефон: "+Лид.Телефон+Символы.ПС+"Электронная почта: "+Лид.ЭлектроннаяПочта+Символы.ПС+"Регион: "+Лид.БизнесРегионТекст+Символы.ПС;
	ТекстПисьма=ТекстПисьма+"================================================================================="+Символы.ПС+Символы.ПС;
	ТекстПисьма=ТекстПисьма+"Текст источника: "+ТекстСодержания+Символы.ПС;
	
	Вложения = Новый Массив;
	
	Для Каждого СтрПрикрепленныеФайлы Из ПрикрепленныеФайлы Цикл
		
		ДанныеВложения = Новый Структура();
		ДанныеВложения.Вставить("Представление", СтрПрикрепленныеФайлы.ИмяФайла + "." + СтрПрикрепленныеФайлы.Расширение);
		ДанныеВложения.Вставить("АдресВоВременномХранилище", СтрПрикрепленныеФайлы.АдресФайла);
		Вложения.Добавить(ДанныеВложения);
					
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
		И (ТестовыеАдресаМассив.Количество() > 0
		ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		ДанныеОтправки = Новый Структура("Тема, Заголовок, Вложения", ТемаПисьма +" - "+ Лид.Тема+"", ТекстПисьма, Вложения);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
		Исключение
			ТекстСообщения = "Не удалось отправить письмо, по квалификации "+Квалификация+" по лиду "+Лид+ Символы.ПС + ОписаниеОшибки(); 
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	ТекстПисьма = "";
	
	ОчиститьПрикрепленныеФайлы();
	
КонецПроцедуры

&НаСервере
Процедура КаналПриИзмененииНаСервере()
	
	НеБлокироватьВыдачу = Ложь;
	
	Если Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Маркетплейсы") Тогда
		ИсточникРодитель = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоКоду("00000000089");	
	ИначеЕсли Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Рекомендация сотрудника") Тогда
		ИсточникРодитель = Неопределено;
	ИначеЕсли Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Интернет магазин") Тогда
		ИсточникРодитель = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоКоду("00000000075");
	ИначеЕсли Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Выставка Реклама") Тогда
		ИсточникРодитель = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоКоду("00000000010"); 
		НеБлокироватьВыдачу = Истина;
	Иначе
		ИсточникРодитель = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоКоду("00000000084");
	КонецЕсли;	
	
	Если ИсточникРодитель = Неопределено Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи");
		
	Иначе	
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартИсточникиРекламногоВоздействия 
		|ГДЕ
		|	Родитель = &Родитель");
		Запрос.УстановитьПараметр("Родитель", ИсточникРодитель);
		
	КонецЕсли;
	
	Элементы.Источник.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	ЗаполнитьПервичныеДанныеФормы(НеБлокироватьВыдачу);
	
КонецПроцедуры

&НаКлиенте
Процедура КаналПриИзменении(Элемент)
	КаналПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПоискПоКонтактнойИнформацииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВозврата = Новый Структура;
	Если ЗначениеЗаполнено(ЭтаФорма.ТелефонПр) ИЛИ ЗначениеЗаполнено(ЭтаФорма.ПочтаПр) Тогда
		
		МасПартнеров=Новый СписокЗначений;
		МасКонтактов=Новый СписокЗначений;
		
		//Пытаемся по конактным данным найти Партнерра и Контактное лицо
		Если ЗначениеЗаполнено(ЭтаФорма.ТелефонПр) Тогда
			ТелефонДляПоиска=ОставитьТолькоЦиФрыВСтроке(ЭтаФорма.ТелефонПр); 
			
			СтруктураПроверки = Новый Структура();
			СтруктураПроверки.Вставить("Телефон",ТелефонДляПоиска);
			СтруктураПроверки.Вставить("ДатаЛида",ТекущаяДата());
			
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ТелефонДляПоиска);
			Клиент_Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
			лКэшПоиска = CRM_ПоискКонтактов.СтруктураДанныхКэша();
			лКэшЗаполнения = CRM_ПоискКонтактов.СтруктураДанныхКэша();
			лУсловияПоиска = Новый Массив;
			лСтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(Клиент_Телефон, лКэшПоиска, лКэшЗаполнения);
			лРезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(лСтрокаПоискаНормализованная, 2, Истина,Истина);
			Для Каждого СтрлРезультатПоиска Из лРезультатПоиска.Элементы Цикл
				Если ТипЗнч(СтрлРезультатПоиска)=Тип("СправочникСсылка.Партнеры") И МасПартнеров.НайтиПоЗначению(СтрлРезультатПоиска)=Неопределено ТОгда
					МасПартнеров.Добавить(СтрлРезультатПоиска,""+СтрлРезультатПоиска + " - "+СтрлРезультатПоиска.Код+"");
				КонецЕсли;
				Если ТипЗнч(СтрлРезультатПоиска)=Тип("СправочникСсылка.КонтактныеЛицаПартнеров") И МасКонтактов.НайтиПоЗначению(СтрлРезультатПоиска)=Неопределено ТОгда
					МасКонтактов.Добавить(СтрлРезультатПоиска,СтрлРезультатПоиска);
					Если МасПартнеров.НайтиПоЗначению(СтрлРезультатПоиска.Владелец)=Неопределено ТОгда
						МасПартнеров.Добавить(СтрлРезультатПоиска.Владелец,""+СтрлРезультатПоиска.Владелец + " - "+СтрлРезультатПоиска.Владелец.Код+"");
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			//Ищем Бизнес-регион по телефону с помощью DaData пока что текстовое значение
			РегионОпределенный=ОбработатьТелефонНаСервере(ТелефонДляПоиска);
			РегионСсылка=НайтиРегион(РегионОпределенный);
			Если ЗначениеЗаполнено(РегионСсылка) И НЕ ЗначениеЗаполнено(РегионСсылка.смартОтветственоеПодразделение) ТОгда
				Регион=РегионСсылка;
				//Регион=НайтиРегионВерхнегоУровня(РегионСсылка);
				СтруктураВозврата.Вставить("Регион", Регион);
			ИначеЕсли ЗначениеЗаполнено(РегионСсылка) И ЗначениеЗаполнено(РегионСсылка.смартОтветственоеПодразделение) ТОгда	
				Регион=РегионСсылка;
				СтруктураВозврата.Вставить("Регион", Регион);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма.ПочтаПр) Тогда
			лРезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(ЭтаФорма.ПочтаПр, 2, Истина,Истина);
			Для Каждого СтрлРезультатПоиска Из лРезультатПоиска.Элементы Цикл
				Если ТипЗнч(СтрлРезультатПоиска)=Тип("СправочникСсылка.Партнеры") И МасПартнеров.НайтиПоЗначению(СтрлРезультатПоиска)=Неопределено И НЕ СтрлРезультатПоиска.ПометкаУдаления ТОгда
					МасПартнеров.Добавить(СтрлРезультатПоиска,""+СтрлРезультатПоиска + " - "+СтрлРезультатПоиска.Код+"");
				КонецЕсли;
				Если ТипЗнч(СтрлРезультатПоиска)=Тип("СправочникСсылка.КонтактныеЛицаПартнеров") И МасКонтактов.НайтиПоЗначению(СтрлРезультатПоиска)=Неопределено И НЕ СтрлРезультатПоиска.ПометкаУдаления ТОгда
					МасКонтактов.Добавить(СтрлРезультатПоиска,СтрлРезультатПоиска);
					Если МасПартнеров.НайтиПоЗначению(СтрлРезультатПоиска.Владелец)=Неопределено ТОгда
						МасПартнеров.Добавить(СтрлРезультатПоиска.Владелец,""+СтрлРезультатПоиска.Владелец + " - "+СтрлРезультатПоиска.Владелец.Код+"");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		РезультатыПоискаПоКИ="Контактная информация найдена у: ";
		Если МасПартнеров.Количество()=1 ТОгда
			АбонентКомпания=МасПартнеров[0].Значение;
		ИначеЕсли МасПартнеров.Количество()>1 ТОгда	
			Для Каждого СтрМасПартнеров Из МасПартнеров Цикл
				РезультатыПоискаПоКИ=РезультатыПоискаПоКИ+Символы.ПС+" - "+СтрМасПартнеров.Представление;	
			КонецЦикла;
		КонецЕсли;
		Если МасКонтактов.Количество()=1 ТОгда
			АбонентИмя = МасКонтактов[0].Значение;
			АбонентИмяСтр = МасКонтактов[0].Значение.Наименование;
		ИначеЕсли МасКонтактов.Количество()>1 ТОгда	
			Для Каждого СтрМасКонтактов Из МасКонтактов Цикл
				РезультатыПоискаПоКИ=РезультатыПоискаПоКИ+Символы.ПС+" - "+СтрМасКонтактов.Представление;	
			КонецЦикла;
		КонецЕсли;
		Если НЕ РезультатыПоискаПоКИ="Контактная информация найдена у: " Тогда
			Элементы.ДекорацияКонтакт.Заголовок = РезультатыПоискаПоКИ;
			Элементы.ГруппаАбонентСтрПр.Видимость = Истина;
			Элементы.ГруппаАбонентПр.Видимость = Ложь;
			Элементы.ОсновныеМенеджерыПр.Видимость = Ложь;
		ИначеЕсли МасПартнеров.Количество() = 0 И МасКонтактов.Количество() = 0 Тогда
			Элементы.ДекорацияКонтакт.Заголовок = "Телефон в базе не найден!";
			Элементы.ГруппаАбонентСтрПр.Видимость = Истина;
			Элементы.ГруппаАбонентПр.Видимость = Ложь;
			Элементы.ОсновныеМенеджерыПр.Видимость = Ложь;
		Иначе	
			Элементы.ДекорацияКонтакт.Заголовок = "";
			Элементы.ГруппаАбонентСтрПр.Видимость = Ложь;
			Элементы.ГруппаАбонентПр.Видимость = Истина;
			Элементы.ОсновныеМенеджерыПр.Видимость = Истина;
			ЗаполнитьМенеджеровАбонента();
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПоискПоКонтактным(Команда)
	
	Перем ТекСтрИдентиф;
	
	СтруктураПоиска = ПоискПоКонтактнойИнформацииНаСервере();
	
	Если СтруктураПоиска.Свойство("Регион") Тогда
		
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Регион", ТекСтрИдентиф, Регионы.ПолучитьЭлементы(), СтруктураПоиска.Регион, Ложь);
		Элементы.Регионы.ТекущаяСтрока = ТекСтрИдентиф;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеМенеджерыПрПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ОсновныеМенеджерыПр.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ВыбранныйСотрудник = Элементы.ОсновныеМенеджерыПр.ТекущиеДанные.Менеджер;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТелефоныМенеджеров(Менеджер)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ПользователиКонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ ЛичныйТелефон
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Вид = &ВидЛичныйТелефон
	|	И ПользователиКонтактнаяИнформация.Ссылка = &Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ПользователиКонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ РабочийТелефон
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Вид = &ВидМобильныйТелефон
	|	И ПользователиКонтактнаяИнформация.Ссылка = &Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	ЛичныйТелефон.Представление КАК ЛичныйТелефон,
	|	Пользователи.смартРабочийТелефон КАК ВнутреннийТелефон,
	|	РабочийТелефон.Представление КАК МобильныйТелефон
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛичныйТелефон КАК ЛичныйТелефон
	|		ПО Пользователи.Ссылка = ЛичныйТелефон.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабочийТелефон КАК РабочийТелефон
	|		ПО Пользователи.Ссылка = РабочийТелефон.Ссылка
	|ГДЕ
	|	Пользователи.Ссылка = &Менеджер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование");
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("ВидЛичныйТелефон", Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "ЛичныйТелефон"));
	Запрос.УстановитьПараметр("ВидМобильныйТелефон", Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаРезультата.Количество() > 0 Тогда
		Возврат Новый Структура("ЛичныйТелефон, МобильныйТелефон, ВнутреннийТелефон", ТаблицаРезультата[0].ЛичныйТелефон, ТаблицаРезультата[0].МобильныйТелефон, ТаблицаРезультата[0].ВнутреннийТелефон);	
	Иначе
		Возврат Новый Структура("ЛичныйТелефон, МобильныйТелефон, ВнутреннийТелефон", "", "", "");
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ПисьмоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ОповеститьОВыбореПисьма", ЭтаФорма);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоВходящее.ФормаВыбора", Новый Структура("УчетнаяЗапись", ВернутьУчетнуюЗаписьИнфо()), , , , , Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ВернутьУчетнуюЗаписьИнфо()
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоРеквизиту("АдресЭлектроннойПочты", "info@smart-t.ru");
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОВыбореПисьма(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ПисьмоПриИзмененииНаСервере(Результат);	
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПеревестиЗвонокСОповещениемПоСМС(Команда)

	//++ #Б-7790 смарт: Фролов 06.08.2026 //Добавить Источник в рабочее место секретаря
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ИсточникТелефон) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните источник.", , "ИсточникТелефон");
		Возврат;
		
	КонецЕсли;
	//-- #Б-7790 смарт: Фролов 06.08.2026
	
	СоздатьИнтересИПеревестиЗвонокНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыТЦПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.МенеджерыТЦ.ТекущиеДанные;
	
	Если Элементы.МенеджерыТЦ.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.ВыбранныйСотрудник = ТекущиеДанные.Менеджер;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВидМенеджеровПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "МенеджерыТехЦентра" Тогда
		
		Элементы.Квалификации.Доступность = Ложь;
		ВыбранРежимМенеджерыТЦ = Истина;
		ВыбраннаяКвалификация = Неопределено;
		Элементы.ГруппаСтраницы.ТолькоПросмотр = Истина;
		Элементы.ГруппаСтраницы.Доступность = Ложь;
		
	Иначе
		
		Элементы.Квалификации.Доступность = Истина;
		ВыбранРежимМенеджерыТЦ = Ложь;
		Элементы.ГруппаСтраницы.ТолькоПросмотр = Ложь;
		Элементы.ГруппаСтраницы.Доступность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьКомпаниюВручнуюПриИзменении(Элемент)
	
	Элементы.ГруппаАбонентСтрПр.Видимость = НЕ УказатьКомпаниюВручную;
	Элементы.ГруппаАбонентПр.Видимость = УказатьКомпаниюВручную;
	АбонентКомпанияСтр = "";
	АбонентИмяСтр = "";
	АбонентКомпания = Неопределено;
	АбонентИмя = Неопределено;
	Элементы.ОсновныеМенеджерыПр.Видимость = Ложь;
	ОсновныеМенеджеры.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентКомпанияПрПриИзменении(Элемент)
	
	ЗаполнитьМенеджеровАбонента();
	
	Элементы.ОсновныеМенеджерыПр.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, АдресВременногоХранилища, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияСлеша = СтрНайти(ВыбранноеИмя, "\", НаправлениеПоиска.СКонца);
	
	Если ПозицияСлеша > 0 Тогда
		ИмяСРасширением = Сред(ВыбранноеИмя, ПозицияСлеша + 1);
	Иначе
		ИмяСРасширением = ВыбранноеИмя;
	КонецЕсли;
	
	ПозицияТочки = СтрНайти(ИмяСРасширением, ".", НаправлениеПоиска.СКонца);
	
	Если ПозицияТочки > 0 Тогда
		Расширение = НРег(Прав(ИмяСРасширением, СтрДлина(ИмяСРасширением) - ПозицияТочки));
		ИмяБезРасширения = Лев(ИмяСРасширением, ПозицияТочки - 1);
	Иначе
		Расширение = "";
		ИмяБезРасширения = ИмяСРасширением;
	КонецЕсли;
	
	Расширение = НРег(Расширение);
	
	СтрПрикрепленныеФайлы = ПрикрепленныеФайлы.Добавить();
	СтрПрикрепленныеФайлы.АдресФайла = АдресВременногоХранилища; 
	СтрПрикрепленныеФайлы.Расширение = Расширение;
	СтрПрикрепленныеФайлы.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Расширение);
	СтрПрикрепленныеФайлы.ИмяФайла = ИмяБезРасширения;
	
	Элементы.ПрикрепленныеФайлы.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПрикрепленныеФайлы()
	
	Для Каждого СтрПрикрепленныеФайлы Из ПрикрепленныеФайлы Цикл
		
		УдалитьИзВременногоХранилища(СтрПрикрепленныеФайлы.АдресФайла);	
		
	КонецЦикла;
	
	ПрикрепленныеФайлы.Очистить();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОчиститьПрикрепленныеФайлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	УдалитьИзВременногоХранилища(ТекущиеДанные.АдресФайла);
	
КонецПроцедуры

