
&НаСервере
&Вместо("ПрименитьНаСервере")
Функция смарт_ПрименитьНаСервере()
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроекОбмена);

	Настройки.Заказы.ВыгрузкаОтгрузок						= ВыгрузкаОтгрузок;	
	Настройки.Заказы.ЗагрузкаОтгрузок 						= ЗагрузкаОтгрузок;
	Настройки.Заказы.ЗагрузкаОплат							= ЗагрузкаОплат;	
	
	Настройки.Заказы.НеРедактироватьДокументыПришедшиеССайта= НеРедактироватьДокументыПришедшиеССайта;	
	Настройки.Заказы.УстанавливатьРучнуюСкидкуВДокументе 	= УстанавливатьРучнуюСкидкуВДокументе;
	
	Настройки.Заказы.НастройкиКомпоновкиДанныхЗаказов		= КомпоновщикНастроекКомпоновкиДанныхЗаказов.ПолучитьНастройки();
	
	Настройки.Заказы.ГруппаДляНовойНоменклатуры 			= ГруппаДляНовойНоменклатуры;
	Настройки.Заказы.ВидНоменклатурыТовар 					= ВидНоменклатурыТовар;
	Настройки.Заказы.ВидНоменклатурыУслуга 					= ВидНоменклатурыУслуга;
	Настройки.Заказы.КонтрагентФизлицо 						= КонтрагентФизлицо;
	Настройки.Заказы.СоглашениеКонтрагентаФизлицо 			= СоглашениеКонтрагентаФизлицо;
	Настройки.Заказы.ПричинаОтменыЗаказа 					= ПричинаОтменыЗаказа;
	Настройки.Заказы.СтатусЗаказаОтменен 					= СтатусЗаказаОтменен;
	
	Настройки.Заказы.СоответствиеПлатежныхСистемИКасс 		= СоответствиеПлатежныхСистемИКасс.Выгрузить();
	
	Если ЭтоАдресВременногоХранилища(СохраненныеНастройкиЗагружаемыхДокументов) Тогда
		Настройки.Заказы.СохраненныеНастройкиЗагружаемыхДокументов	= ПолучитьИзВременногоХранилища(СохраненныеНастройкиЗагружаемыхДокументов);
	КонецЕсли;	
	
	//Проверяем и добавляем новые поля:
	Если Настройки.Заказы.Свойство("ТочкаАктуальностиВыгрузкиДокументов") тогда
		Настройки.Заказы.ТочкаАктуальностиВыгрузкиДокументов = ТочкаАктуальностиВыгрузкиДокументов;
	Иначе
		Настройки.Заказы.Вставить("ТочкаАктуальностиВыгрузкиДокументов", ТочкаАктуальностиВыгрузкиДокументов);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("ПроводитьЕслиОтгружен") тогда
		Настройки.Заказы.ПроводитьЕслиОтгружен = ПроводитьЕслиОтгружен;
	Иначе
		Настройки.Заказы.Вставить("ПроводитьЕслиОтгружен", ПроводитьЕслиОтгружен);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("ПроводитьЕслиОплачен") тогда
		Настройки.Заказы.ПроводитьЕслиОплачен = ПроводитьЕслиОплачен;
	Иначе
		Настройки.Заказы.Вставить("ПроводитьЕслиОплачен", ПроводитьЕслиОплачен);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("ВыгрузкаОплат") тогда
		Настройки.Заказы.ВыгрузкаОплат = ВыгрузкаОплат;
	Иначе
		Настройки.Заказы.Вставить("ВыгрузкаОплат", ВыгрузкаОплат);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("ЗагружаемыеТипыОплат") тогда
		Настройки.Заказы.ЗагружаемыеТипыОплат = ЗагружаемыеТипыОплат;
	Иначе
		Настройки.Заказы.Вставить("ЗагружаемыеТипыОплат", ЗагружаемыеТипыОплат);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("ВыгружатьВсеДокументы") тогда
		Настройки.Заказы.ВыгружатьВсеДокументы = ВыгружатьВсеДокументы;
	Иначе
		Настройки.Заказы.Вставить("ВыгружатьВсеДокументы", ВыгружатьВсеДокументы);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("КоличествоДокументовВПакете") тогда
		Настройки.Заказы.КоличествоДокументовВПакете = КоличествоДокументовВПакете;
	Иначе
		Настройки.Заказы.Вставить("КоличествоДокументовВПакете", КоличествоДокументовВПакете);
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("НастройкиКомпоновкиДанныхОтгрузок") тогда
		Настройки.Заказы.НастройкиКомпоновкиДанныхОтгрузок = КомпоновщикНастроекКомпоновкиДанныхОтгрузок.ПолучитьНастройки();
	Иначе
		Настройки.Заказы.Вставить("НастройкиКомпоновкиДанныхОтгрузок", КомпоновщикНастроекКомпоновкиДанныхОтгрузок.ПолучитьНастройки());
	КонецЕсли;
	
	Если Настройки.Заказы.Свойство("НастройкиКомпоновкиДанныхОплат") тогда
		Настройки.Заказы.НастройкиКомпоновкиДанныхОплат = КомпоновщикНастроекКомпоновкиДанныхОплат.ПолучитьНастройки();
	Иначе
		Настройки.Заказы.Вставить("НастройкиКомпоновкиДанныхОплат", КомпоновщикНастроекКомпоновкиДанныхОплат.ПолучитьНастройки());
	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 13.07.2020 12:29:07
	Если Настройки.Заказы.Свойство("ВыгружатьСтатусыТоваров") тогда
		Настройки.Заказы.ВыгружатьСтатусыТоваров = ВыгружатьСтатусыТоваров;
	Иначе
		Настройки.Заказы.Вставить("ВыгружатьСтатусыТоваров", ВыгружатьСтатусыТоваров);
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 13.07.2020 12:29:07
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.07.2020 9:46:15
	Если Настройки.Заказы.Свойство("ВыгружатьФайлыПрикрепляемыеКЗаказу") тогда
		Настройки.Заказы.ВыгружатьФайлыПрикрепляемыеКЗаказу = ВыгружатьФайлыПрикрепляемыеКЗаказу;
	Иначе
		Настройки.Заказы.Вставить("ВыгружатьФайлыПрикрепляемыеКЗаказу", ВыгружатьФайлыПрикрепляемыеКЗаказу);
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 30.07.2020 9:46:15
	
	лАдресНастроекОбмена = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресНастроекОбмена"	, лАдресНастроекОбмена);
	Возврат ПараметрыФормы;

КонецФункции

&НаСервере
Процедура смарт_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроекОбмена) Тогда
		
		АдресНастроекОбмена = Параметры.АдресНастроекОбмена;
		
		НастройкиОбмена 	= ПолучитьИзВременногоХранилища(АдресНастроекОбмена);
		Объект				= Параметры.Объект;
		
		ВыгружатьВсеДокументы 					= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВыгружатьВсеДокументы");
		
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 13.07.2020 12:31:56
		ВыгружатьСтатусыТоваров 					= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВыгружатьСтатусыТоваров");
		//Смарт }Подкин Алексей Иванович 13.07.2020 12:31:56
		
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.07.2020 9:47:17  ВыгружатьФайлыПрикрепляемыеКЗаказу
		ВыгружатьФайлыПрикрепляемыеКЗаказу 					= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВыгружатьФайлыПрикрепляемыеКЗаказу");
		//Смарт }Подкин Алексей Иванович 30.07.2020 9:47:17
		
		ТочкаАктуальностиВыгрузкиДокументов 	= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ТочкаАктуальностиВыгрузкиДокументов");
		
		ВыгрузкаОтгрузок 						= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВыгрузкаОтгрузок");
		ВыгрузкаОплат 							= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВыгрузкаОплат");
		
		НеРедактироватьДокументыПришедшиеССайта	= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "НеРедактироватьДокументыПришедшиеССайта");
		
		ЗагрузкаОплат 							= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ЗагрузкаОплат");
		ЗагрузкаОтгрузок 						= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ЗагрузкаОтгрузок");
		
		УстанавливатьРучнуюСкидкуВДокументе 	= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "УстанавливатьРучнуюСкидкуВДокументе");
		
		КоличествоДокументовВПакете 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "КоличествоДокументовВПакете");
		//мб. есть ключ КоличествоЗаказовВПакете, который был в старых модулях 
		Если НЕ ЗначениеЗаполнено(КоличествоДокументовВПакете) тогда
			КоличествоДокументовВПакете = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "КоличествоЗаказовВПакете");
		КонецЕсли;
		
		СтруктураССхемамиК = Б_ОбменССайтомСервер.ПолучитьСтруктуруСхемКомпоновки();
		
			
			
			
		СхемаВыгрузкиТоваров = ПланыОбмена.Б_ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиЗаказов");
		АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиТоваров, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхЗаказов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		
		НастройкиКомпоновкиДанныхЗаказов 		= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "НастройкиКомпоновкиДанныхЗаказов");
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемамиК.Заказы, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхЗаказов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхЗаказов.ЗагрузитьНастройки(НастройкиКомпоновкиДанныхЗаказов);
		КомпоновщикНастроекКомпоновкиДанныхЗаказов.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
		
		//создаем новую компановку, если ее ранее не было
		НастройкиКомпоновкиДанныхОтгрузок 		= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "НастройкиКомпоновкиДанныхОтгрузок");
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемамиК.Отгрузки, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхОтгрузок.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		
		Если НастройкиКомпоновкиДанныхОтгрузок <> Неопределено тогда
			КомпоновщикНастроекКомпоновкиДанныхОтгрузок.ЗагрузитьНастройки(НастройкиКомпоновкиДанныхОтгрузок);
		Иначе
			КомпоновщикНастроекКомпоновкиДанныхОтгрузок.ЗагрузитьНастройки(СтруктураССхемамиК.Отгрузки.НастройкиПоУмолчанию);
		КонецЕсли; 		
		КомпоновщикНастроекКомпоновкиДанныхОтгрузок.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
		
		НастройкиКомпоновкиДанныхОплат 		= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "НастройкиКомпоновкиДанныхОплат");
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемамиК.Оплаты, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхОплат.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		
		Если НастройкиКомпоновкиДанныхОплат <> Неопределено тогда
			КомпоновщикНастроекКомпоновкиДанныхОплат.ЗагрузитьНастройки(НастройкиКомпоновкиДанныхОплат);
		Иначе
			КомпоновщикНастроекКомпоновкиДанныхОплат.ЗагрузитьНастройки(СтруктураССхемамиК.Оплаты.НастройкиПоУмолчанию);
		КонецЕсли;
		КомпоновщикНастроекКомпоновкиДанныхОплат.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

		/////////////////////////////////////////////////////////
		ГруппаДляНовойНоменклатуры 		= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ГруппаДляНовойНоменклатуры");
		ВидНоменклатурыТовар 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВидНоменклатурыТовар");
		ВидНоменклатурыУслуга 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ВидНоменклатурыУслуга");
		КонтрагентФизлицо 				= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "КонтрагентФизлицо");
		СоглашениеКонтрагентаФизлицо 	= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "СоглашениеКонтрагентаФизлицо");
		ПричинаОтменыЗаказа 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ПричинаОтменыЗаказа");
		СтатусЗаказаОтменен 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "СтатусЗаказаОтменен");
		
		ЗагружаемыеТипыОплат 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ЗагружаемыеТипыОплат");
		ПроводитьЕслиОплачен 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ПроводитьЕслиОплачен");
		ПроводитьЕслиОтгружен 			= ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "ПроводитьЕслиОтгружен");
		
		СоответствиеПлатежныхСистемИКасс.Загрузить(ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(НастройкиОбмена.Заказы, "СоответствиеПлатежныхСистемИКасс"));
		
		СохраненныеНастройкиЗагружаемыхДокументов = ПоместитьВоВременноеХранилище(НастройкиОбмена.Заказы.СохраненныеНастройкиЗагружаемыхДокументов, УникальныйИдентификатор);
		

	КонецЕсли; 

КонецПроцедуры
