////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы CRM.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя	= "CRM";
	Описание.Версия = "3.0.22.2";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ИдентификаторИнтернетПоддержки = "CRM";
	
	Если ВРег(CRM_ОбщегоНазначенияПовтИсп.ПолучитьИмяКонфигурации()) = ВРег("УТиВсК") ИЛИ ВРег(CRM_ОбщегоНазначенияПовтИсп.ПолучитьИмяКонфигурации()) = ВРег("УправлениеТорговлей_CRM_2") Тогда
		Описание.ТребуемыеПодсистемы.Добавить("УправлениеТорговлей");
	КонецЕсли;
	
	// +CRM Модуль
	// подразумеваем что если имя "типовое", то это Модуль CRM
	//Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	Если ОбновлениеИнформационнойБазы.ВерсияИБ(Описание.Имя) = "0.0.0.0"
		И ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя) <> "0.0.0.0" Тогда
		ОбновлениеИнформационнойБазы.УстановитьВерсиюИБ(Описание.Имя, "0.0.0.0", Ложь);
			
		Если CRM_ЛицензированиеСервер.ЭтоТиповаяКонфигурация() Тогда
			
			Если ВРег(Метаданные.Имя) = ВРег("УправлениеТорговлей") Тогда
				Константы.CRM_ОсновнойВариантПоставки.Установить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
			Иначе
				Константы.CRM_ОсновнойВариантПоставки.Установить(Перечисления.CRM_ВариантыПоставки.КОРП);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	// -CRM Модуль
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ЭтоРазделенныйРежимРаботы = Константы.ИспользоватьРазделениеПоОбластямДанных.Получить();
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.ПервыйЗапуск";
	
	// Все версии
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.УстановитьЗначениеКонстантыИспользоватьНапоминанияПользователя";
		Обработчик.Комментарий = НСтр("ru='Устанавливаем константу Использовать Напоминания Пользователя в Ложь';en='Set the constant Use User Account Reminders to False'");
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.ЗаполнитьПроверитьПВХОбъектыЖурнала";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_УсловияСрабатыванияТриггеров.СоздатьПредопределенныеДействия";
	Обработчик.Комментарий = НСтр("ru='Обновление предопределенных условий триггеров.';en='Update of triggers predefined conditions.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.CRM_ДействияТриггеров.СоздатьПредопределенныеДействия";
	Обработчик.Комментарий = НСтр("ru='Обновление предопределенных действий триггеров.';en='Update predefined actions of triggers.'");
	
	Если НЕ ЭтоРазделенныйРежимРаботы Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.Комментарий = НСтр("ru='Обновляем правила регистрации объектов для iCRM.';en='Updated rules of logging of objects for iCRM.'");
		Обработчик.Процедура = "ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ОбновитьПравилаРегистрации";
		Обработчик.РежимВыполнения = "Монопольно";
	КонецЕсли;
	
	// +CRM_Модуль
	// Удалены обработчики старых версий
	// кроме начального заполнения
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.4.1";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "БлокировкаРаботыСВнешнимиРесурсами.ОбновитьПараметрыБлокировкиРаботыСВнешнимиРесурсами";
	
	// -CRM_Модуль
	
	// 3.0.21.4
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.4";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("15e0a314-f4b0-4329-b060-859dc3f80504");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.СоздатьКартуПланированияВстреч";
	Обработчик.Комментарий = НСтр("ru='Создает новую карту маршрута бизнес-процесса для согласования планов встреч.'");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ПустаяПроцедураЗаполненияДанныхОбновления";
	Обработчик.ЧитаемыеОбъекты    = "Справочник.CRM_КартыМаршрутов";
	Обработчик.ИзменяемыеОбъекты  = "Справочник.CRM_КартыМаршрутов";
	
	// Заполнение значений констант.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.ЗаполнитьКонстантыДляВзаимодействий";
	Обработчик.Комментарий = НСтр("ru='Заполнение значения констант для документа Взаимодействие.'");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ПустаяПроцедураЗаполненияДанныхОбновления";
	
	// Заполнение цвета в календаре.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.4";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6df02e40-4a18-47f0-9ab1-5864d4349ca0");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение цвета в календаре документа Взаимодействие.'");
	Обработчик.Процедура = "Документы.CRM_Взаимодействие.ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеЦветаВКалендаре";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.CRM_Взаимодействие.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеЦветаВКалендаре";
	Обработчик.ЧитаемыеОбъекты      = "Документ.CRM_Взаимодействие";
	Обработчик.ИзменяемыеОбъекты    = "Документ.CRM_Взаимодействие";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	// 3.0.21.23
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.23";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("651e49b5-a459-4d04-ac1b-c21bdf81095e");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.ПодготовитьРольДинамическойАдресации";
	Обработчик.Комментарий = НСтр("ru='Заполнение роли Динамическая адресация.'");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ПустаяПроцедураЗаполненияДанныхОбновления";
	Обработчик.ЧитаемыеОбъекты    = "Справочник.РолиИсполнителей";
	Обработчик.ИзменяемыеОбъекты  = "Справочник.РолиИсполнителей";
	
	// 3.0.21.25
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.25";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("705fe1bc-e75a-4747-a139-f75ca37f144c");
	Обработчик.ОчередьОтложеннойОбработки = 30;
	Обработчик.Процедура = "РегистрыСведений.CRM_СостоянияЛидов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.CRM_СостоянияЛидов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Обновление записей регистра сведений Состояния обращений'");
	Обработчик.ЧитаемыеОбъекты      = "РегистрСведений.CRM_СостоянияЛидов";
	Обработчик.ИзменяемыеОбъекты    = "РегистрСведений.CRM_СостоянияЛидов";
	Обработчик.БлокируемыеОбъекты   = "РегистрСведений.CRM_СостоянияЛидов";
	
	// 3.0.21.27
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.27";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72ccbf07-0085-4256-bc19-c2633d7bdd3b");
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ПустаяПроцедураЗаполненияДанныхОбновления";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.ЗаполнитьШаблоныАвтотекста";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru='Перезаполнение шаблонов автотекста';en='Reloading AutoText Templates'");
	Обработчик.ЧитаемыеОбъекты      = "Справочник.CRM_ШаблоныАвтотекста";
	Обработчик.ИзменяемыеОбъекты    = "Справочник.CRM_ШаблоныАвтотекста";
	Обработчик.БлокируемыеОбъекты   = "Справочник.CRM_ШаблоныАвтотекста";
	
	// 3.0.21.28
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.28";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9a51181f-45bd-4cd6-af79-212808f6d1b9");
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ПустаяПроцедураЗаполненияДанныхОбновления";
	Обработчик.Процедура = "Справочники.CRM_УчетныеЗаписиМессенджеров.ЗаполнитьПредопределенныеЭлементы";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru='Заполнение предопределенных учетных записей мессенджеров'");
	Обработчик.ЧитаемыеОбъекты      = "Справочник.CRM_УчетныеЗаписиМессенджеров";
	Обработчик.ИзменяемыеОбъекты    = "Справочник.CRM_УчетныеЗаписиМессенджеров";
	
	// 3.0.21.29	// Заполнение значений констант.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.29";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "CRM_КонтрольЗаполненностиРеквизитовОбъектов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Комментарий = НСтр("ru='Перезаполнение параметров контроля заполненности.'");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ПустаяПроцедураЗаполненияДанныхОбновления";
	
	// 3.0.21.30
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.21.30";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4c825ca5-808c-432d-afa8-e200ad00ce2f");
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "CRM_ОбновлениеИнформационнойБазы.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_3_0_21_30";
	Обработчик.Процедура = "CRM_ОбновлениеИнформационнойБазы.ОбработатьДанныеДляПереходаНаНовуюВерсию_3_0_21_30";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru='Очистка ссылок на удаляемые объекты'");
	Обработчик.ЧитаемыеОбъекты      = "Справочник.удалитьCRM_МероприятиеПрисоединенныеФайлы,Справочник.удалитьCRM_СделкаПрисоединенныеФайлы,
										|Справочник.УдалитьCRM_СобытиеПрисоединенныеФайлы,
										|Справочник.CRM_ВоронкиПродаж,Справочник.CRM_ГруппыУниверсальногоЖурнала,
										|Документ.удалитьCRM_Мероприятие,Документ.удалитьCRM_Планирование,
										|Документ.УдалитьCRM_Сделка,Документ.УдалитьCRM_Событие,
										|РегистрСведений.bpmУсловияЭтапов,РегистрСведений.bpmУсловияЭтаповПоБизнесПроцессам";
	Обработчик.ИзменяемыеОбъекты    = "РегистрСведений.CRM_ДокументыВзаимодействия,РегистрСведений.CRM_ОбъектыАРМ,
										|РегистрСведений.CRM_СобытияКалендаря,РегистрСведений.ИсточникиПервичногоИнтереса,
										|РегистрСведений.CRM_ЗадачиПоИсправлениюКлиентскойБазы,РегистрСведений.CRM_ИспользуемыеРешения,
										|РегистрСведений.сфпКлючевыеСловаКонтекстнойРекламы,РегистрСведений.CRM_РабочееВремяПользователей,
										|РегистрСведений.CRM_ПредметыБизнесПроцессов,РегистрСведений.СостоянияПредметовВзаимодействий,
										|РегистрСведений.НаличиеФайлов,РегистрСведений.НомераОтсканированныхФайлов,
										|РегистрСведений.CRM_ЖурналДокументов,РегистрСведений.CRM_ОбъектыДляРегламентногоФормированияОповещений,
										|РегистрСведений.bpmУсловияМаршрутизации,РегистрСведений.bpmУсловияМаршрутизацииПоБизнесПроцессам,
										|РегистрСведений.CRM_ОбъектыПоБизнесПроцессам,РегистрСведений.CRM_ОбъектыЭтапов,
										|РегистрСведений.CRM_ОбъектыЭтаповБизнесПроцессов,РегистрСведений.CRM_СостоянияВоронкиПродаж,
										|РегистрСведений.СертификатыШифрования,РегистрСведений.ЭлектронныеПодписи,
										|РегистрСведений.ДвоичныеДанныеФайлов,РегистрСведений.КодировкиФайлов,
										|РегистрСведений.ОчередьИзвлеченияТекста,РегистрСведений.СведенияОФайлах,
										|РегистрСведений.ФайлыВРабочемКаталоге,
										|Справочник.CRM_ВоронкиПродаж,Справочник.CRM_ГруппыУниверсальногоЖурнала";
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры // ПередОбновлениемИнформационнойБазы()

// Вызывается после завершения обновления данных ИБ.
// В зависимости от тех или иных условий можно отключить штатное открытие формы
// с описанием изменений в новой версии программы при первом входе в нее (после обновления),
// а также выполнить другие действия.
//
// Не рекомендуется выполнять в данной процедуре какую-либо обработку данных.
// Такие процедуры следует оформлять штатными обработчиками обновления, выполняемыми на каждую версию "*".
// 
// Параметры:
//   ПредыдущаяВерсия     - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия        - Строка - версия после обновления. Как правило, соответствует Метаданные.Версия.
//   ВыполненныеОбработчики - Массив из Структура - массив структур, описывающих сведения об обновлении каждой
//                                     библиотеки и конфигурации, с ключами:
//       * Подсистема              - Строка - имя библиотеки или конфигурации.
//       * Версия                  - Строка - например, "2.1.3.39". Номер версии библиотеки (конфигурации).
//       * ЭтоОсновнаяКонфигурация - Булево - Истина, если это основная конфигурация, а не библиотека.
//       * Обработчики             - ТаблицаЗначений - все обработчики обновления библиотеки, описание колонок
//                                   см. в ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//       * ВыполненныеОбработчики  - ДеревоЗначений - выполненные обработчики обновления, библиотеке и номеру версии,
//                                   описание колонок см. в ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//       * ИмяОсновногоСерверногоМодуля - Строка - имя модуля библиотеки (конфигурации), который предоставляет
//                                        основные сведения о ней: имя, версия и т.д.
//       * ОсновнойСерверныйМодуль      - ОбщийМодуль - общий модуль библиотеки (конфигурации), который предоставляет
//                                        основные сведения о ней: имя, версия и т.д.
//       * ПредыдущаяВерсия             - Строка - например, "2.1.3.30". Номер версии библиотеки (конфигурации) до обновления.
//   ВыводитьОписаниеОбновлений - Булево - если установить Ложь, то не будет открыта форма
//                                с описанием изменений в новой версии программы. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - признак того, что обновление выполнилось в монопольном режиме.
//
// Пример:
//  Для обхода выполненных обработчиков обновления:
//  Для Каждого ИтерацияОбновления Из ИтерацииОбновления Цикл
//  	Для Каждого Версия Из ИтерацияОбновления.ВыполненныеОбработчики.Строки Цикл
//  		
//  		Если Версия.Версия = "*" Тогда
//  			// Группа обработчиков, которые выполняются регулярно при каждой смене версии.
//  		Иначе
//  			// Группа обработчиков, которые выполнились для определенной версии.
//  		КонецЕсли;
//  		
//  		Для Каждого Обработчик Из Версия.Строки Цикл
//  			...
//  		КонецЦикла;
//  		
//  	КонецЦикла;
//  КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры // ПослеОбновленияИнформационнойБазы()

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры // ПриПодготовкеМакетаОписанияОбновлений()

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры // ПриОпределенииРежимаОбновленияДанных()

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры // ПриЗавершенииПереходаСДругойПрограммы()

// Получает версию CRM, которая хранится в информационной базе.
//
// Возвращаемое значение:
//   Строка   - версия.
//
Функция ВерсияCRM() Экспорт
	Возврат ОбновлениеИнформационнойБазы.ВерсияИБ("CRM");
КонецФункции

// Получить режим обновления данных информационной базы
//
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьРежимОбновленияДанных() Экспорт
	Возврат ОбновлениеИнформационнойБазыСлужебный.РежимОбновленияДанных();
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ОчередьСсылкой(Очередь)
	Возврат ПланыОбмена.ОбновлениеИнформационнойБазы.УзелПоОчереди(Очередь);
КонецФункции

Функция ЭтоПримитивныйТип(ПроверяемыйТип)
	
	Если ПроверяемыйТип = Тип("Неопределено")
		Или ПроверяемыйТип = Тип("Булево")
		Или ПроверяемыйТип = Тип("Строка")
		Или ПроверяемыйТип = Тип("Число")
		Или ПроверяемыйТип = Тип("Дата")
		Или ПроверяемыйТип = Тип("УникальныйИдентификатор") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПустаяПроцедураЗаполненияДанныхОбновления(Параметры = Неопределено) Экспорт
	
	// Заполнение не требуется
	Возврат;
	
КонецПроцедуры

// Возвращает количество ссылок, по которым нужно произвести обработку.
//  Данные берутся из зарегистрированных в очереди, учитываются заблокированные более приоритетными очередями данные.
//	Ссылки на документы возвращаются упорядоченными по убыванию по дате.
//
// Параметры:
//  Очередь				 - Число - очередь, к которой отнесен обработчик и в которой зарегистрированы данные, которые он будет
//									обрабатывать.
//  ПолноеИмяОбъекта	 - Строка	 - имя объекта, который нужно обработать. Например, Документ.ПриходныйОрдерНаТовары.
//  ДополнительныеПараметры	 - Структура - см. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - выборка ссылок, которые нужно обработать, поля выборки:
//  * Ссылка - ЛюбаяСсылка.
//
Функция КоличествоСсылокДляОбработки(Очередь, ПолноеИмяОбъекта, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	КонецЕсли;
	
	ИмяОбъекта = СтрРазделить(ПолноеИмяОбъекта,".",Ложь)[1];
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Ссылка КАК КоличествоСсылок
	|ИЗ
	|	#ТаблицаОбъектаИзменения КАК ТаблицаИзменений
	|ГДЕ
	|	ТаблицаИзменений.Узел = &ТекущаяОчередь
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
	|ПО
	|	ОБЩИЕ";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ТаблицаОбъектаИзменения", ПолноеИмяОбъекта + ".Изменения");	
	
	ТекущаяОчередь = ОчередьСсылкой(Очередь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущаяОчередь", ТекущаяОчередь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоСсылок;
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции

// Возвращает порцию ссылок, по которым нужно произвести обработку.
//  Данные берутся из зарегистрированных в очереди, учитываются заблокированные более приоритетными очередями данные.
//	Ссылки на документы возвращаются упорядоченными по убыванию по дате.
//
// Параметры:
//  Очередь				 - Число - очередь, к которой отнесен обработчик и в которой зарегистрированы данные, которые он будет
//									обрабатывать.
//  ПолноеИмяОбъекта	 - Строка	 - имя объекта, который нужно обработать. Например, Документ.ПриходныйОрдерНаТовары.
//  ДополнительныеПараметры	 - Структура - см. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - выборка ссылок, которые нужно обработать, поля выборки:
//  * Ссылка - ЛюбаяСсылка.
//
Функция ВыбратьСсылкиДляОбработки(Очередь, ПолноеИмяОбъекта, ДополнительныеПараметры = Неопределено, КоличествоВВыборке = 10000, Массивом = Ложь) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	КонецЕсли;
	
	ИмяОбъекта = СтрРазделить(ПолноеИмяОбъекта,".",Ложь)[1];
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
	ЭтоДокумент = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта)
				Или ОбщегоНазначения.ЭтоЗадача(МетаданныеОбъекта)
				Или ОбщегоНазначения.ЭтоБизнесПроцесс(МетаданныеОбъекта);
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 10000
	|	ТаблицаИзменений.Ссылка
	|ИЗ
	|	#ТаблицаОбъектаИзменения КАК ТаблицаИзменений
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ВТЗаблокированоСсылка КАК ВТЗаблокированоСсылка
	|		ПО ТаблицаИзменений.Ссылка = ВТЗаблокированоСсылка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ТаблицаОбъекта КАК ТаблицаОбъекта
	|			#ТекстЗапросаСоединениеСДопИсточникамиПоШапке
	|		ПО ТаблицаИзменений.Ссылка = ТаблицаОбъекта.Ссылка
	|		#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ
	|		#ТекстЗапросаСоединениеСДопИсточникамиРегистрами
	|ГДЕ
	|	ТаблицаИзменений.Узел = &ТекущаяОчередь
	|	И ВТЗаблокированоСсылка.Ссылка ЕСТЬ NULL 
	|	И &УсловиеПоДопИсточникамСсылкам
	|	И &УсловиеПоДопИсточникамРегистрам";
	Если ЭтоДокумент Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаОбъекта.Дата УБЫВ";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|УНИЧТОЖИТЬ
	|	#ВТЗаблокированоСсылка"; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВТЗаблокированоСсылка","ВТЗаблокировано" + ИмяОбъекта);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ТаблицаОбъектаИзменения", ПолноеИмяОбъекта + ".Изменения");	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ТаблицаОбъекта", ПолноеИмяОбъекта);	
	
	Если Не ДополнительныеПараметры.ВыбиратьПорциями Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 10000","ВЫБРАТЬ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "10000", Формат(КоличествоВВыборке, "ЧГ=0"));
	КонецЕсли;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(Очередь, ПолноеИмяОбъекта, МенеджерВременныхТаблиц);
	
	ДобавитьПроверкуБлокировкиДополнительныхИсточников(Очередь, ТекстЗапроса, ПолноеИмяОбъекта, Неопределено, МенеджерВременныхТаблиц, Ложь, ДополнительныеПараметры);
	ТекущаяОчередь = ОчередьСсылкой(Очередь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущаяОчередь", ТекущаяОчередь);
	
	Если Массивом Тогда
		МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Возврат МассивСсылок;
	Иначе
		ВыборкаПоСсылкам = Запрос.Выполнить().Выбрать();
		Возврат ВыборкаПоСсылкам;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьПроверкуБлокировкиДополнительныхИсточников(Очередь, ТекстЗапроса, ПолноеИмяОбъекта, ПолноеИмяРегистра, МенеджерВременныхТаблиц, ЭтоСозданиеВременнойТаблицы, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.ДополнительныеИсточникиДанных.Количество() = 0 Тогда
				
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиПоШапке", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДопИсточникамСсылкам", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДопИсточникамРегистрам", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиРегистрами", "");
	
	Иначе	
		
		ДополнительныеИсточникиСсылки = Новый Массив;
		ДополнительныеИсточникиРегистры = Новый Массив;
		
		Для Каждого КлючЗначение Из ДополнительныеПараметры.ДополнительныеИсточникиДанных Цикл
			
			ИсточникДанных = КлючЗначение.Ключ;
			
			Если ВРег(Лев(ИсточникДанных,7)) = "РЕГИСТР"
				И СтрНайти(ИсточникДанных,".") <> 0 Тогда
				ДополнительныеИсточникиРегистры.Добавить(ИсточникДанных);
			Иначе
				ДополнительныеИсточникиСсылки.Добавить(ИсточникДанных);
			КонецЕсли;
			
		КонецЦикла;
		
		#Область ДополнительныеИсточникиСсылки
		
		Если ДополнительныеИсточникиСсылки.Количество() > 0 Тогда
			
			Если ПолноеИмяОбъекта = Неопределено Тогда
				ТекстИсключения = НСтр("ru='Ошибка вызова функции %ИмяФункции%: не передано имя документа, но переданы дополнительные источники данных.';en='An error occurred when calling function %ИмяФункции%: document name is not transferred, but additional data sources are transferred.'");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяФункции%", "ОбновлениеИнформационнойБазы.ДобавитьПроверкуБлокировкиДополнительныхИсточников");
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
			
			МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			ТекстЗапросаСоединениеСДопИсточникамиПоШапке = "";
			ТекстЗапросаСоединениеСДопИсточникамиПоТЧ = "";
			ТекстыЗапросаСоединениеСДопИсточникамиПоТЧ = Новый Соответствие;
			УсловиеПоДопИсточникамСсылкам = "ИСТИНА";
			
			УсловиеПоДопИсточникамСсылкамТЧ = "ЛОЖЬ";
			
			ВременныеТаблицыЗаблокированныхДопИсточников = Новый Соответствие;
			
			Для Каждого ИсточникДанных Из ДополнительныеИсточникиСсылки Цикл
				
				Если СтрНайти(ИсточникДанных, ".") > 0 Тогда
					ЧастиИмени = СтрРазделить(ИсточникДанных, ".");
					ИмяТЧ = ЧастиИмени[0];
					ИмяРеквизита = ЧастиИмени[1];
				Иначе
					ИмяТЧ = "";
					ИмяРеквизита = ИсточникДанных;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИмяТЧ) Тогда
					ТипыИсточника = МетаданныеДокумента.ТабличныеЧасти[ИмяТЧ].Реквизиты[ИмяРеквизита].Тип.Типы();
				Иначе
					ТипыИсточника = МетаданныеДокумента.Реквизиты[ИмяРеквизита].Тип.Типы();
				КонецЕсли;	
				
				Для Каждого ТипИсточника Из ТипыИсточника Цикл
					
					Если ЭтоПримитивныйТип(ТипИсточника) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ИмяТЧ)
						И СтрНайти(ТекстЗапросаСоединениеСДопИсточникамиПоТЧ, "КАК ТЧДокумента" + ИмяТЧ) = 0 Тогда
						
						Если ПолноеИмяРегистра <> Неопределено Тогда
							
							ТекстЗапросаСоединениеСДопИсточникамиПоТЧ = ТекстЗапросаСоединениеСДопИсточникамиПоТЧ + "
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ПолноеИмяДокумента." + ИмяТЧ + " КАК ТЧДокумента" + ИмяТЧ + "
							|#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ" + ИмяТЧ + "
							|		ПО ТаблицаРегистраИзменения.Регистратор = ТЧДокумента" + ИмяТЧ + ".Ссылка
							|";
							
						Иначе
							
							ТекстЗапросаСоединениеСДопИсточникамиПоТЧ = ТекстЗапросаСоединениеСДопИсточникамиПоТЧ + "
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ПолноеИмяДокумента." + ИмяТЧ + " КАК ТЧДокумента" + ИмяТЧ + "
							|#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ" + ИмяТЧ + "
							|		ПО ТаблицаИзменений.Ссылка = ТЧДокумента" + ИмяТЧ + ".Ссылка
							|";
							
						КонецЕсли;
					КонецЕсли;
					
					МетаданныеИсточника = Метаданные.НайтиПоТипу(ТипИсточника);
					
					ИмяВТЗаблокированногоДопИсточника = ВременныеТаблицыЗаблокированныхДопИсточников.Получить(МетаданныеИсточника);
					
					Если ИмяВТЗаблокированногоДопИсточника = Неопределено Тогда
						ПолноеИмяИсточника = МетаданныеИсточника.ПолноеИмя();
						ИмяВТЗаблокированногоДопИсточника = "ВТЗаблокировано" + СтрЗаменить(ПолноеИмяИсточника,".","_");
						
						ДополнительныеПараметрыСозданияВТ = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
						ДополнительныеПараметрыСозданияВТ.ИмяВременнойТаблицы = ИмяВТЗаблокированногоДопИсточника;
						ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(Очередь, ПолноеИмяИсточника, МенеджерВременныхТаблиц, ДополнительныеПараметрыСозданияВТ);
						
						ВременныеТаблицыЗаблокированныхДопИсточников.Вставить(МетаданныеИсточника, ИмяВТЗаблокированногоДопИсточника);
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ИмяТЧ) Тогда
						
						ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ = ТекстыЗапросаСоединениеСДопИсточникамиПоТЧ.Получить(ИмяТЧ);
						
						Если ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ = Неопределено Тогда
							ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ = "";
						КонецЕсли;
						
						ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ = ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ + "
						|			ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТ КАК #СинонимВТ
						|			ПО ТЧДокумента" + ИмяТЧ + "." + ИмяРеквизита + " = #СинонимВТ.Ссылка";
						
						ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ = СтрЗаменить(ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ,
																					"#ИмяВТ",
																					ИмяВТЗаблокированногоДопИсточника);
						СинонимВТЗаблокированногоДопИсточника = ИмяВТЗаблокированногоДопИсточника + ИмяТЧ + ИмяРеквизита;															 
						ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ = СтрЗаменить(ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ,
																					"#СинонимВТ",
																					СинонимВТЗаблокированногоДопИсточника);
						ТекстыЗапросаСоединениеСДопИсточникамиПоТЧ.Вставить(ИмяТЧ, ТекстЗапросаСоединениеСДопИсточникамиПоТЧИмяТЧ);
						
						УсловиеПоДопИсточникамСсылкамТЧ = УсловиеПоДопИсточникамСсылкамТЧ + "
						|	ИЛИ НЕ " + СинонимВТЗаблокированногоДопИсточника + ".Ссылка ЕСТЬ NULL ";
					Иначе
						Если ПолноеИмяРегистра <> Неопределено Тогда
							ТекстЗапросаСоединениеСДопИсточникамиПоШапке = ТекстЗапросаСоединениеСДопИсточникамиПоШапке + "
							|			ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТ КАК #СинонимВТ
							|			ПО ТаблицаДокумента." + ИмяРеквизита + " = #СинонимВТ.Ссылка";
						Иначе
							ТекстЗапросаСоединениеСДопИсточникамиПоШапке = ТекстЗапросаСоединениеСДопИсточникамиПоШапке + "
							|			ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТ КАК #СинонимВТ
							|			ПО ТаблицаОбъекта." + ИмяРеквизита + " = #СинонимВТ.Ссылка";
						КонецЕсли;
						ТекстЗапросаСоединениеСДопИсточникамиПоШапке = СтрЗаменить(ТекстЗапросаСоединениеСДопИсточникамиПоШапке,
																					"#ИмяВТ",
																					ИмяВТЗаблокированногоДопИсточника);
						СинонимВТЗаблокированногоДопИсточника = ИмяВТЗаблокированногоДопИсточника + "Шапка";															 
						ТекстЗапросаСоединениеСДопИсточникамиПоШапке = СтрЗаменить(ТекстЗапросаСоединениеСДопИсточникамиПоШапке,
																					"#СинонимВТ",
																					СинонимВТЗаблокированногоДопИсточника);
					
						УсловиеПоДопИсточникамСсылкам = УсловиеПоДопИсточникамСсылкам + "
						|	И " + СинонимВТЗаблокированногоДопИсточника + ".Ссылка ЕСТЬ NULL ";
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			Если Не ПустаяСтрока(ТекстЗапросаСоединениеСДопИсточникамиПоТЧ) Тогда
				Для Каждого ТекстСоединения Из ТекстыЗапросаСоединениеСДопИсточникамиПоТЧ Цикл
					
					ТекстЗапросаСоединениеСДопИсточникамиПоТЧ = СтрЗаменить(ТекстЗапросаСоединениеСДопИсточникамиПоТЧ,
					"#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ" + ТекстСоединения.Ключ,
					ТекстСоединения.Значение);
					
				КонецЦикла;
				
				Если ПолноеИмяРегистра <> Неопределено Тогда
					ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ТаблицаРегистраИзменения.Регистратор КАК Ссылка
					|ПОМЕСТИТЬ ЗаблокированныеПоТЧ
					|ИЗ
					|	#ТаблицаИзменений КАК ТаблицаРегистраИзменения
					|       #ТекстЗапросаСоединениеСДопИсточникамиПоТЧ
					|ГДЕ
					|	&УсловиеПоДопИсточникамСсылкамТЧ";
				Иначе
					ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ТаблицаИзменений.Ссылка КАК Ссылка
					|ПОМЕСТИТЬ ЗаблокированныеПоТЧ
					|ИЗ
					|	#ТаблицаИзменений КАК ТаблицаИзменений
					|       #ТекстЗапросаСоединениеСДопИсточникамиПоТЧ
					|ГДЕ
					|	&УсловиеПоДопИсточникамСсылкамТЧ";
				КонецЕсли;
				
				ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ = СтрЗаменить(ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ,
																				"#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ",
																				ТекстЗапросаСоединениеСДопИсточникамиПоТЧ);
				
				ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ = СтрЗаменить(ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ,
																				"&УсловиеПоДопИсточникамСсылкамТЧ",
																				УсловиеПоДопИсточникамСсылкамТЧ);
				Если ПолноеИмяРегистра <> Неопределено Тогда
					ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ = СтрЗаменить(ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ,
																					"#ТаблицаИзменений",
																					ПолноеИмяРегистра + ".Изменения");	
				Иначе
					ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ = СтрЗаменить(ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ,
																					"#ТаблицаИзменений",
																					ПолноеИмяОбъекта + ".Изменения");	
				КонецЕсли;																
				
				ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ = СтрЗаменить(ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ,
																				"#ПолноеИмяДокумента",
																				ПолноеИмяОбъекта);
				Запрос = Новый Запрос;
				Запрос.Текст = ТекстЗапросаВременнойТаблицыЗаблокированныхПоТЧ;
				Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				Запрос.Выполнить();
				
				Если ПолноеИмяРегистра <> Неопределено Тогда
					ТекстЗапросаСоединениеСДопИсточникамиПоТЧ = "
					|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаблокированныеПоТЧ КАК ЗаблокированныеПоТЧ 
					|		ПО ТаблицаРегистраИзменения.Регистратор = ЗаблокированныеПоТЧ.Ссылка
					|";
				Иначе
					ТекстЗапросаСоединениеСДопИсточникамиПоТЧ = "
					|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаблокированныеПоТЧ КАК ЗаблокированныеПоТЧ 
					|		ПО ТаблицаИзменений.Ссылка = ЗаблокированныеПоТЧ.Ссылка
					|";
				КонецЕсли;																
				
				УсловиеПоДопИсточникамСсылкам = УсловиеПоДопИсточникамСсылкам + "
				|	И ЗаблокированныеПоТЧ.Ссылка ЕСТЬ NULL ";
				
				ВременныеТаблицыЗаблокированныхДопИсточников.Вставить("ЗаблокированныеПоТЧ", "ЗаблокированныеПоТЧ");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстЗапросаСоединениеСДопИсточникамиПоШапке) Тогда 
				Если ЭтоСозданиеВременнойТаблицы
					И ПолноеИмяРегистра <> Неопределено Тогда
					ТекстЗапросаСоединениеСДопИсточникамиПоШапке = СтрЗаменить("
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ПолноеИмяДокумента КАК ТаблицаДокумента
					|       	#ТекстЗапросаСоединениеСДопИсточникамиПоШапке
					|		ПО ТаблицаРегистраИзменения.Регистратор = ТаблицаДокумента.Ссылка",
					"#ТекстЗапросаСоединениеСДопИсточникамиПоШапке",
					ТекстЗапросаСоединениеСДопИсточникамиПоШапке);
				КонецЕсли;
			КонецЕсли;	
				
			ШаблонТекстаЗапросаУничтоженияВременнойТаблицы = "
			|УНИЧТОЖИТЬ
			|	#ИмяВТ
			|";
			
			ТекстыЗапроса = Новый Массив;
			ТекстыЗапроса.Добавить(ТекстЗапроса);
			
			Для Каждого КлючЗначение Из ВременныеТаблицыЗаблокированныхДопИсточников Цикл
				
				ТекстЗапросаУничтоженияВременнойТаблицы = СтрЗаменить(ШаблонТекстаЗапросаУничтоженияВременнойТаблицы, "#ИмяВТ", КлючЗначение.Значение);
				
				ТекстыЗапроса.Добавить(ТекстЗапросаУничтоженияВременнойТаблицы);
				
			КонецЦикла;
			
			ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ";");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиПоШапке", ТекстЗапросаСоединениеСДопИсточникамиПоШапке);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ", ТекстЗапросаСоединениеСДопИсточникамиПоТЧ);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДопИсточникамСсылкам", УсловиеПоДопИсточникамСсылкам);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПолноеИмяДокумента", ПолноеИмяОбъекта);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиПоШапке", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиПоТЧ", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДопИсточникамСсылкам", "ИСТИНА");
		КонецЕсли;
		#КонецОбласти
		
		#Область ДополнительныеИсточникиРегистры

		Если ДополнительныеИсточникиРегистры.Количество() > 0 Тогда
			
			ТекстЗапросаСоединениеСДопИсточникамиРегистрами = "";
			УсловиеПоДопИсточникамРегистрам = "ИСТИНА";
			
			ВременныеТаблицыЗаблокированныхДопИсточников = Новый Соответствие;
			
			Для Каждого ИсточникДанных Из ДополнительныеИсточникиРегистры Цикл
				
				МетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(ИсточникДанных);
				
				Если ОбщегоНазначения.ЭтоРегистрСведений(МетаданныеИсточника)
					И МетаданныеИсточника.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
					
					ТекстИсключения = НСтр("ru='Регистр %ИсточникДанных% независимый. Поддерживается проверка только по регистрам, подчиненным регистраторам.';en='Register %ИсточникДанных% is independent. Supported check only the registers that are subordinate to registrars.'");
					ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИсточникДанных%",ИсточникДанных);
					ВызватьИсключение ТекстИсключения;
				КонецЕсли;
				
				ИмяВТЗаблокированногоДопИсточника = ВременныеТаблицыЗаблокированныхДопИсточников.Получить(МетаданныеИсточника);
				
				Если ИмяВТЗаблокированногоДопИсточника = Неопределено Тогда
					ИмяВТЗаблокированногоДопИсточника = "ВТЗаблокировано" + СтрЗаменить(ИсточникДанных,".","_");
					
					ДополнительныеПараметрыСозданияВТ = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
					ДополнительныеПараметрыСозданияВТ.ИмяВременнойТаблицы = ИмяВТЗаблокированногоДопИсточника;
					ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(Очередь, ИсточникДанных, МенеджерВременныхТаблиц, ДополнительныеПараметрыСозданияВТ);
					
					ВременныеТаблицыЗаблокированныхДопИсточников.Вставить(МетаданныеИсточника, ИмяВТЗаблокированногоДопИсточника);
					
				КонецЕсли;
				
				Если ПолноеИмяРегистра <> Неопределено Тогда
					ТекстЗапросаСоединениеСДопИсточникамиРегистрами = ТекстЗапросаСоединениеСДопИсточникамиРегистрами + "
					|			ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТ КАК #ИмяВТ
					|			ПО ТаблицаРегистраИзменения.Регистратор = #ИмяВТ.Регистратор";
				Иначе
					ТекстЗапросаСоединениеСДопИсточникамиРегистрами = ТекстЗапросаСоединениеСДопИсточникамиРегистрами + "
					|			ЛЕВОЕ СОЕДИНЕНИЕ #ИмяВТ КАК #ИмяВТ
					|			ПО ТаблицаОбъекта.Ссылка = #ИмяВТ.Регистратор";
				КонецЕсли;
				ТекстЗапросаСоединениеСДопИсточникамиРегистрами = СтрЗаменить(ТекстЗапросаСоединениеСДопИсточникамиРегистрами,
					"#ИмяВТ", ИмяВТЗаблокированногоДопИсточника);
					
				УсловиеПоДопИсточникамРегистрам = УсловиеПоДопИсточникамРегистрам + "
				|	И " + ИмяВТЗаблокированногоДопИсточника + ".Регистратор ЕСТЬ NULL ";
				
			КонецЦикла;	
			
			ШаблонТекстаЗапросаУничтоженияВременнойТаблицы = "
			|УНИЧТОЖИТЬ
			|	#ИмяВТ
			|";
			
			ТекстыЗапроса = Новый Массив;
			ТекстыЗапроса.Добавить(ТекстЗапроса);
			
			Для Каждого КлючЗначение Из ВременныеТаблицыЗаблокированныхДопИсточников Цикл
				
				ТекстЗапросаУничтоженияВременнойТаблицы = СтрЗаменить(ШаблонТекстаЗапросаУничтоженияВременнойТаблицы, "#ИмяВТ", КлючЗначение.Значение);
				
				ТекстыЗапроса.Добавить(ТекстЗапросаУничтоженияВременнойТаблицы);
				
			КонецЦикла;
			
			ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ";");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиРегистрами", ТекстЗапросаСоединениеСДопИсточникамиРегистрами);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДопИсточникамРегистрам", УсловиеПоДопИсточникамРегистрам);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДопИсточникамРегистрам", "ИСТИНА");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстЗапросаСоединениеСДопИсточникамиРегистрами", "");
		КонецЕсли;
		#КонецОбласти
	КонецЕсли;	
КонецПроцедуры

#Область МетодыТолькоДляCRM3

// Процедура заполняет предопределенный элемент справочника "Организации".
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределеннуюОрганизацию() Экспорт
	
	СправочникОбъект = CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(СправочникОбъект.Префикс) Тогда
		СправочникОбъект.Префикс = "НФ";
		СправочникОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределеннуюОрганизацию()

// Функция заполняет в ИБ спрвочник "Ставки НДС" и возвращает
// ссылку на ставку НДС 18% для дальнейшего использования.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//  СправочникСсылка	- Ставка НДС
//	
Функция ЗаполнитьСтавкиНДСПервыйЗапуск()
	
	// 10%
	СтавкаНДС = Справочники["СтавкиНДС"].СоздатьЭлемент();
	СтавкаНДС.Наименование = "10%";
	СтавкаНДС.Ставка = 10;
	СтавкаНДС.Записать();
	
	// 0%
	СтавкаНДС = Справочники["СтавкиНДС"].СоздатьЭлемент();
	СтавкаНДС.Наименование = "0%";
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.Записать();
	
	// Без НДС
	СтавкаНДС = Справочники["СтавкиНДС"].СоздатьЭлемент();
	СтавкаНДС.Наименование = НСтр("ru='Без НДС';en='excluding VAT'");
	СтавкаНДС["НеОблагается"] = Истина;
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.Записать(); 
	
	Если ТекущаяДатаСеанса() < Дата(2019, 1, 1) Тогда
		// 18%
		СтавкаНДС = Справочники["СтавкиНДС"].СоздатьЭлемент();
		СтавкаНДС.Наименование = "18%";
		СтавкаНДС.Ставка = 18;	
		СтавкаНДС.Записать();
	Иначе
		// 20%
		СтавкаНДС = Справочники["СтавкиНДС"].СоздатьЭлемент();
		СтавкаНДС.Наименование = "20%";
		СтавкаНДС.Ставка = 20;	
		СтавкаНДС.Записать();
	КонецЕсли;
	
	Возврат СтавкаНДС.Ссылка;
	
КонецФункции // ЗаполнитьСтавкиНДСПервыйЗапуск()

// Процедура создает регламентные задания для сегментов.
//
// Параметры:
//	Нет.
//
Процедура СоздатьРегламентныеЗаданияДляСегментов()
	
	// Создает регламентные задания для сегментов партнеров и номенклатуры с типом формирования
	// "Периодически обновлять".
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные",Метаданные.РегламентныеЗадания.ФормированиеСегментов));
	Если МассивЗаданий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеЗадание = Неопределено;
	
	Для Каждого Задание Из МассивЗаданий Цикл
		
		Если Задание.Параметры.Количество() = 0 Тогда
			НайденноеЗадание = Задание;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СегментыНоменклатуры.Ссылка КАК Сегмент,
	|	""СегментыНоменклатуры"" КАК ТипСегмента,
	|	СегментыНоменклатуры.Наименование
	|ИЗ
	|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|ГДЕ
	|	(НЕ СегментыНоменклатуры.ЭтоГруппа)
	|	И (НЕ СегментыНоменклатуры.ПометкаУдаления)
	|	И СегментыНоменклатуры.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
	|	И СегментыНоменклатуры.РегламентноеЗадание = &ПустойУникальныйИдентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СегментыПартнеров.Ссылка,
	|	""СегментыПартнеров"",
	|	СегментыПартнеров.Наименование
	|ИЗ
	|	Справочник.СегментыПартнеров КАК СегментыПартнеров
	|ГДЕ
	|	(НЕ СегментыПартнеров.ЭтоГруппа)
	|	И (НЕ СегментыПартнеров.ПометкаУдаления)
	|	И СегментыПартнеров.СпособФормирования = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять)
	|	И СегментыПартнеров.РегламентноеЗадание = &ПустойУникальныйИдентификатор";
	
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор",Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипСегмента = "СегментыНоменклатуры" Тогда
			
			Наименование =  НСтр("ru='Формирование сегмента номенклатуры: ';en='Formation of item segment: '");
			
		ИначеЕсли Выборка.ТипСегмента = "СегментыПартнеров" Тогда
			
			Наименование =  НСтр("ru='Формирование сегмента партнеров: ';en='Formation of partners segment: '");
			
		КонецЕсли;
		
		НовоеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ФормированиеСегментов);
		НовоеЗадание.Использование = НайденноеЗадание.Использование;
		НовоеЗадание.Наименование = Наименование + СокрЛП(Выборка.Наименование);
		НовоеЗадание.Расписание = НайденноеЗадание.Расписание;
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Выборка.Сегмент);
		НовоеЗадание.Параметры = ПараметрыЗадания;
		НовоеЗадание.Записать();
		
		СегментОбъект = Выборка.Сегмент.ПолучитьОбъект();
		СегментОбъект.РегламентноеЗадание = НовоеЗадание.УникальныйИдентификатор;
		СегментОбъект.ОбменДанными.Загрузка = Истина;
		СегментОбъект.Записать();
		
	КонецЦикла;
	
	Если НайденноеЗадание.Параметры.Количество() = 0 Тогда
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Справочники.СегментыНоменклатуры.ПустаяСсылка());
		НайденноеЗадание.Параметры = ПараметрыЗадания;
		НайденноеЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры //  СоздатьРегламентныеЗаданияДляСегментов()

Функция ЗапускатьМастерНастройкиРешения() Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда
		Данные = CRM_ХранилищеНастроек.Загрузить("Запускать_CRM_МастерНастройкиРешения",,, "CRM_МастерНастройкиРешения");
		Возврат (Данные = Истина);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура заполняет реквизит "офис" у предопределенного элемента справочника "Подразделения организации"
//
Процедура ЗаполнитьРеквизитОфисУОсновногоПодразделения() 
	
	ОсновнойОфис = Справочники.CRM_ОфисыКомпании.НайтиПоНаименованию("Основной офис");
	Если ОсновнойОфис = Неопределено Тогда
		ОсновнойОфис = Справочники.CRM_ОфисыКомпании.НайтиПоНаименованию("Main office");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОсновнойОфис) Тогда
		// повторно создадим элемент справочника, если этого не удалось сделать ранее
		НовыйОфис = Справочники.CRM_ОфисыКомпании.СоздатьЭлемент();
		НовыйОфис.Наименование	= НСтр("ru='Основной офис';en='Main office'");
		НовыйОфис.CRM_ВремяПоГринвичу_GMT = 3;
		Попытка
			НовыйОфис.Записать();
			ОсновнойОфис = НовыйОфис.Ссылка;
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;		
	
	ПодразделениеОбъект = Справочники.СтруктураПредприятия["ОсновноеПодразделение"].ПолучитьОбъект();
	ПодразделениеОбъект.CRM_Офис = ОсновнойОфис.Ссылка;
	Попытка
		ПодразделениеОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры  // ЗаполнитьРеквизитОфисУОсновногоПодразделения()

#КонецОбласти // МетодыТолькоДляCRM3


#Область ПервыйЗапуск

Функция ПервыйЗапускИнформационнойБазы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Константы.CRM_НеПервыйЗапускИБ.Получить() Тогда
		Возврат Ложь;
	Иначе
		Константы.CRM_НеПервыйЗапускИБ.Установить(Истина);
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции // ПервыйЗапускИнформационнойБазы()

// Функция создает элемент справочника Валюты, если такого нет.
//
// Параметры:
//  Код -                     - значение соответствующего реквизита справочника,
//  Наименование              - значение соответствующего реквизита справочника,
//  НаименованиеПолное        - значение соответствующего реквизита справочника,
//  ПараметрыПрописиНаРусском - значение соответствующего реквизита справочника.
//
// Возвращаемое значение:
//  Ссылка на добавленный или существующий элемент.
//
Функция НайтиСоздатьВалюту(Код, Наименование, НаименованиеПолное, ПараметрыПрописиНаРусском) Экспорт
	
	Ссылка = Справочники.Валюты.НайтиПоКоду(Код);
	
	Если Ссылка.Пустая() Тогда
		
		СправочникОбъект = Справочники.Валюты.СоздатьЭлемент();
		
		СправочникОбъект.Код                       = Код;
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;
		СправочникОбъект.ПараметрыПрописи = ПараметрыПрописиНаРусском;
		
		ЗаписатьСправочникОбъект(СправочникОбъект);
		
		Ссылка = СправочникОбъект.Ссылка;
		
	ИначеЕсли Ссылка.Предопределенный 
		И ПустаяСтрока(Ссылка.НаименованиеПолное) Тогда
		
		// Это первое обращение к предопределенному элементу.
		СправочникОбъект = Ссылка.ПолучитьОбъект();
		
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;
		СправочникОбъект.ПараметрыПрописи = ПараметрыПрописиНаРусском;
		
		ЗаписатьСправочникОбъект(СправочникОбъект);
		
		Ссылка = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	// Установим курс и кратность = 1 на 1 января 1980.
	РаботаСКурсамиВалют.ПроверитьКорректностьКурсаНа01_01_1980(Ссылка);
	
	Возврат Ссылка;
	
КонецФункции // НайтиСоздатьВалюту()

// Процедура записывает переданный справочник объект и выводит сообщение.
// Предназначена для вызова из процедур заполнения и обработки справочников информационной базы.
//
// Параметры:
//  СправочникОбъект - объект, который требуется записать.
//
Процедура ЗаписатьСправочникОбъект(СправочникОбъект, Сообщать = Ложь) Экспорт
	
	Если НЕ СправочникОбъект.Модифицированность() Тогда
		Возврат;
	КонецЕсли;
	
	Если СправочникОбъект.ЭтоНовый() Тогда
		Если СправочникОбъект.ЭтоГруппа Тогда
			СтрСообщения = НСтр("ru='Создана группа справочника ""%1"", код: ""%2"", наименование: ""%3""';en='Group of catalog ""%1"" created, code: ""%2"", description: ""%3""'") ;
		Иначе
			СтрСообщения = НСтр("ru='Создан элемент справочника ""%1"", код: ""%2"", наименование: ""%3""';en='Item of catalog ""%1"" created, code: ""%2"", description: ""%3""'") ;
		КонецЕсли; 
	Иначе
		Если СправочникОбъект.ЭтоГруппа Тогда
			СтрСообщения = НСтр("ru='Обработана группа справочника ""%1"", код: ""%2"", наименование: ""%3""';en='Group of catalog ""%1"" processed, code: ""%2"", description: ""%3""'") ;
		Иначе
			СтрСообщения = НСтр("ru='Обработан элемент справочника ""%1"", код: ""%2"", наименование: ""%3""';en='Item of catalog ""%1"" processed, code: ""%2"", description: ""%3""'") ;
		КонецЕсли; 
	КонецЕсли;
	
	Если СправочникОбъект.Метаданные().ДлинаКода > 0 Тогда
		ПолныйКод = СправочникОбъект.ПолныйКод();
	Иначе
		ПолныйКод = НСтр("ru='<без кода>';en='<no code>'");
	КонецЕсли; 
	СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрСообщения, СправочникОбъект.Метаданные().Синоним, ПолныйКод, СправочникОбъект.Наименование);
	
	Попытка
		СправочникОбъект.Записать();
		Если Сообщать = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСообщения, СправочникОбъект);
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось завершить действие: %1';en='It were not possible to completed action: %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрСообщения);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
		
	КонецПопытки;
	
КонецПроцедуры // ЗаписатьСправочникОбъект()

// Процедура выполняет заполнение реквизита "CRM_ИспользоватьДляОповещений" предопределенных элементов.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределенныеВидыКонтактнойИнформацииДляОповещений() Экспорт
	
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.EmailПользователя.ПолучитьОбъект();
	СправочникОбъект.CRM_ИспользоватьДляОповещений = Истина;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица.ПолучитьОбъект();
	СправочникОбъект.CRM_ИспользоватьДляОповещений = Истина;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя.ПолучитьОбъект();
	СправочникОбъект.CRM_ИспользоватьДляОповещений = Истина;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица.ПолучитьОбъект();
	СправочникОбъект.CRM_ИспользоватьДляОповещений = Истина;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица.ПолучитьОбъект();
	СправочникОбъект.CRM_ИспользоватьДляОповещений = Истина;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица.ПолучитьОбъект();
	СправочникОбъект.CRM_ИспользоватьДляОповещений = Истина;
	СправочникОбъект.Записать();
	
КонецПроцедуры	// ЗаполнитьПредопределенныеВидыКонтактнойИнформацииДляОповещений()

// Процедура выполняет заполнение предопределенного элемента "CRM_СайтПартнера".
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьВидКонтактнойИнформацииСайтПартнера() Экспорт
	
	СправочникОбъект = Справочники.ВидыКонтактнойИнформации.CRM_СайтПартнера.ПолучитьОбъект();
	СправочникОбъект.Тип								= Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	СправочникОбъект.МожноИзменятьСпособРедактирования	= Истина;
	СправочникОбъект.ВидРедактирования					= "ПолеВвода";
	СправочникОбъект.РеквизитДопУпорядочивания			= 4;
	СправочникОбъект.Записать();
	
КонецПроцедуры // ЗаполнитьВидКонтактнойИнформацииСайтПартнера()

// Процедура заполняет значение ключевого события "День рождения" 
// у контактного лица на основе реквизита ДеньРождения
//
Процедура ЗаполнитьКлючевоеСобытиеДеньРожденияКЛНаОсновеДатыРождения()
	
	ВидСобытия = Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("День рождения контактного лица", Истина);
	
	Если ВидСобытия = Неопределено Тогда
		ВидСобытия = Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("Birthday of the contact person", Истина);
	КонецЕсли;

	
	Если ЗначениеЗаполнено(ВидСобытия) Тогда
		
		Выборка = Справочники.КонтактныеЛицаПартнеров.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
				ВыборкаОбъект 			= Выборка.ПолучитьОбъект();
				НоваяСтрока 			= ВыборкаОбъект.CRM_КлючевыеСобытия.Добавить();
				НоваяСтрока.ВидСобытия 	= ВидСобытия;
				НоваяСтрока.ДатаСобытия = Выборка.ДатаРождения;
				Если Выборка.CRM_НапоминатьОДнеРождения Тогда
					НоваяСтрока.НапоминатьОСобытии = Истина;
				Иначе
					НоваяСтрока.НапоминатьОСобытии = Ложь;
				КонецЕсли;
				ВыборкаОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры	

// Процедура заполняет пустую ИБ.
//
// Параметры:
//	Нет.
//
Процедура ПервыйЗапуск() Экспорт
	
	НачатьТранзакцию();
	
	Константы.CRM_ДемонстрационныйРежим.Установить(Ложь);
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		// Заполним валюты.
		РУБСсылка = НайтиСоздатьВалюту("643", "руб.", "Российский рубль", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		
		// Заполним ставки НДС.
		СтавкаНДС18 = Справочники["СтавкиНДС"].НайтиПоНаименованию("18%");
		Если Не ЗначениеЗаполнено(СтавкаНДС18) Тогда
			СтавкаНДС18 = ЗаполнитьСтавкиНДСПервыйЗапуск();
		КонецЕсли; 
		
		// Заполним организации.
		НашаОрганизацияСсылка = CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию();
		НашаОрганизация = НашаОрганизацияСсылка.ПолучитьОбъект();
		НашаОрганизация.НаименованиеПолное	  = НСтр("ru='ООО ""Наша фирма""';en='LLC ""Our firm""'");
		НашаОрганизация.Префикс				  = "НФ-";
		НашаОрганизация.ЮрФизЛицо			  = Перечисления.ЮрФизЛицо.ЮрЛицо;
		НашаОрганизация.НДСВключатьВСтоимость = Истина;
		НашаОрганизация.СтавкаНДСПоУмолчанию  = СтавкаНДС18;
		НашаОрганизация.Записать();
		
		// Заполним виды цен.
		ВалютаВКонстанте = Константы.ВалютаУправленческогоУчета.Получить();
		Если НЕ ЗначениеЗаполнено(ВалютаВКонстанте) Тогда
			ВалютаВКонстанте = Справочники.Валюты.НайтиПоКоду("643");
		КонецЕсли;
		// Оптовая.
		ОптоваяСсылка = Справочники.ВидыЦен["Оптовая"];
		Оптовая = ОптоваяСсылка.ПолучитьОбъект();
		Оптовая.ВалютаЦены = ВалютаВКонстанте;
		Оптовая.ЦенаВключаетНДС = Истина;
		Оптовая.ПорядокОкругления = Перечисления["ПорядкиОкругления"].Окр1;
		Оптовая.ОкруглятьВБольшуюСторону = Ложь;
		Оптовая.РассчитываетсяДинамически	= Ложь;
		Оптовая.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
		Оптовая.Записать();
		
		// Учетная.
		УчетнаяСсылка = Справочники.ВидыЦен["Учетная"];
		Учетная = УчетнаяСсылка.ПолучитьОбъект();
		Учетная.ВалютаЦены = ВалютаВКонстанте;
		Учетная.ЦенаВключаетНДС = Истина;
		Учетная.ПорядокОкругления = Перечисления["ПорядкиОкругления"].Окр1;
		Учетная.ОкруглятьВБольшуюСторону = Ложь;
		Учетная.РассчитываетсяДинамически	= Ложь;
		Учетная.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
		Учетная.Записать();
		
		// Заполним константы.
		Константы.ВалютаУправленческогоУчета.Установить(РУБСсылка);
		Константы.ВалютаРегламентированногоУчета.Установить(РУБСсылка);
		
		// Заполним наборы свойств.
		ОсновнаяНГСсылка = Справочники["НоменклатурныеГруппы"].ОсновнаяГруппа;
		ОсновнаяНГ = ОсновнаяНГСсылка.ПолучитьОбъект();
		ОсновнаяНГ.Записать();
		
		// Заполним реквизиты предопределенных единиц измерения.
		// Штука.
		ШтСсылка = Справочники["КлассификаторЕдиницИзмерения"].шт;
		ШтОбъект = ШтСсылка.ПолучитьОбъект();
		ШтОбъект.НаименованиеПолное = НСтр("ru='Штука';en='Piece'");
		ШтОбъект.МеждународноеСокращение = "PCE";
		ШтОбъект.Записать();
		
		ЗаполнитьПредопределеннуюОрганизацию();
		
		// Заполним константу ОсновнойКалендарьПредприятия.
		ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
		Если ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
			Календарь = Справочники.Календари.НайтиПоРеквизиту("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
			Если ЗначениеЗаполнено(Календарь) Тогда
				Константы.ОсновнойКалендарьПредприятия.Установить(Календарь);
			КонецЕсли;
		КонецЕсли;
		
		// Заполним предопределенный сегмент
		ИмяСпрСегменты = "СегментыПартнеров";
		Справочники[ИмяСпрСегменты].ЗаполнитьПредопределенныйСегмент();
		
		// Создаем регламентные задания для сегментов.
		СоздатьРегламентныеЗаданияДляСегментов();
	КонецЕсли; // только для CRM 3
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоУНФ() Тогда
		// Заполним предопределенный сегмент
		ИмяСпрСегменты = "СегментыПартнеров";
		Справочники[ИмяСпрСегменты].ЗаполнитьПредопределенныйСегмент();
	КонецЕсли;
	
	// Создание групп доступа на основании профилей групп доступа.
	МодульУправлениеДоступом = Неопределено;
	Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_УНФ_УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("CRM_УНФ_УправлениеДоступом");
	ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_Модуль_УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_УправлениеДоступом");
	ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("CRM_УправлениеДоступом");
	КонецЕсли;
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.СоздатьЭлементыСправочникаГруппыДоступа();
	КонецЕсли;
	
	ЭтоРазделенныйРежимРаботы = Константы.ИспользоватьРазделениеПоОбластямДанных.Получить();
	
	// Заполнение констант.
	Константы.CRM_НачалоРабочегоДня.Установить(Дата("00010101090000"));
	Константы.CRM_КонецРабочегоДня.Установить(Дата("00010101180000"));
	Константы.CRM_НачалоОбеда.Установить(Дата("00010101130000"));
	Константы.CRM_КонецОбеда.Установить(Дата("00010101140000"));
	
	Константы.ОтправлятьПисьмаВФорматеHTML.Установить(Истина);
	
	Если НЕ ЭтоРазделенныйРежимРаботы Тогда
		Константы.ФиксироватьПервичныйИнтерес.Установить(Истина);
		Константы.ИспользоватьКоммерческиеПредложенияКлиентам.Установить(Истина);
		Константы.CRM_ИспользоватьТипыУслуг.Установить(Истина);
		Константы.CRM_ИспользоватьБизнесПроцессы.Установить(Истина);
	КонецЕсли;
	
	Константы.ИспользоватьПочтовыйКлиент.Установить(Истина);
	Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Истина);
	Константы.CRM_ВыполнятьПоискДублейПриЗаписиПартнера.Установить(Истина);
	Константы.CRM_ВестиИсториюРеквизитовКлиентов.Установить(Истина);
	Константы.CRM_СвязыватьРанееПолученныеEmailиЗвонкиСКлиентами.Установить(Истина);
	Константы.сфпОператорКоллтрекинга.Установить(Перечисления.CRM_CallTrakingСценарии.Comagic);
	
	РеквизитыПоискаДублейПартнеров = Новый СписокЗначений;
	РеквизитыПоискаДублейПартнеров.Добавить("Наименование;ПОДОБНО","Наименование",Истина);
	РеквизитыПоискаДублейПартнеров.Добавить("НаименованиеПолное;ПОДОБНО","Наименование полное",Истина);
	РеквизитыПоискаДублейПартнеров.Добавить("CRM_ИНН;=","ИНН",Истина);
	
	РеквизитыПоискаДублейПартнеров.Добавить("Контакт_Адрес;ПОДОБНО","Адрес");
	РеквизитыПоискаДублейПартнеров.Добавить("Контакт_АдресЭлектроннойПочты;ПОДОБНО","Email");
	РеквизитыПоискаДублейПартнеров.Добавить("Контакт_Телефон;ПОДОБНО","Телефон");
	
	Константы.CRM_РеквизитыПоискаДублейПартнеров.Установить(Новый ХранилищеЗначения(РеквизитыПоискаДублейПартнеров));
	Константы.ИспользоватьБизнесПроцессыИЗадачи.Установить(Истина);
	Константы.ИспользоватьДатуНачалаЗадач.Установить(Истина);
	
	Константы.CRM_ИспользоватьНапоминания.Установить(Истина); 
	Константы.CRM_ПериодПроверкиНовыхНапоминаний.Установить(30);
	Константы.CRM_УчетнаяЗаписьОповещений.Установить(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	Константы.CRM_ПериодОповещенияОПросроченныхСобытиях.Установить(Перечисления.Периодичность.Месяц);
	Константы.CRM_ПериодВыводаНезавершенныхОповещений.Установить(Перечисления.Периодичность.Месяц);
	Константы.ИспользоватьПрочиеВзаимодействия.Установить(Истина);
	
	Константы.CRM_ИспользоватьТелемаркетинг.Установить(Истина); 
	Константы.CRM_ИспользоватьМаркетинговыеМероприятия.Установить(Истина); 
	Константы.CRM_ИспользоватьПоказатели.Установить(Истина); 
	Константы.CRM_ИспользоватьРассылкиЭлектронныхПисем.Установить(Истина); 
	
	Константы.CRM_СервисРассылокПоУмолчанию.Установить(Справочники.CRM_СервисыРассылок.SMTP);
	Константы.CRM_СервисРассылокОповещенийПоУмолчанию.Установить(Справочники.CRM_СервисыРассылок.SMTP);
	Константы.CRM_НеСохранятьТекстыПисемРассылок.Установить(Истина);
	Константы.CRM_ЦветСобытияВКалендареПоУмолчанию.Установить(7);
	Константы.CRM_ВидВзаимодействияПоУмолчанию.Установить(Справочники.CRM_ВидыВзаимодействий.Встреча);
	Константы.CRM_ГлубинаПересчетаПоказателей.Установить(1);
	Константы.ИспользоватьЗаметки.Установить(Истина);
	Константы.сфпПоследниеЦифрыТелефонногоНомера.Установить(10);
	
	// Заполним предопределенные элементы справочников.
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Если Метаданные.ОбщиеМодули.Найти("ОбновлениеИнформационнойБазыУТ")<>Неопределено Тогда
			ОбщегоНазначения.ОбщийМодуль("ОбновлениеИнформационнойБазыУТ").ЗаполнитьСвойстваВидовКонтактнойИнформации();
		КонецЕсли;
	КонецЕсли;
	CRM_МетодыМодулейМенеджеровСправочников.ЗаполнитьСвойстваВидовКонтактнойИнформации();
	ЗаполнитьПредопределенныеВидыКонтактнойИнформацииДляОповещений();
	
	// Заполним ПВХ каналы рекламных воздействий.
	Элемент = Неопределено;
	Элемент = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Акция", Истина);
	
	Если Не ЗначениеЗаполнено(Элемент) Тогда
		ЭлементПВХ = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		ЭлементПВХ.Наименование		= НСтр("ru='Акция';en='Action'");
		ЭлементПВХ.ТипЗначения 		= Новый ОписаниеТипов("СправочникСсылка.МаркетинговыеМероприятия");
		ЭлементПВХ.Записать();
	КонецЕсли; 
	
	Элемент = Неопределено;
	Элемент = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Сайт компании", Истина);
	Если Не ЗначениеЗаполнено(Элемент) Тогда
		ЭлементПВХ = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		ЭлементПВХ.Наименование		= НСтр("ru='Сайт компании';en='Company Website'");
		ЭлементПВХ.ТипЗначения 		= Новый ОписаниеТипов("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника");
		ЭлементПВХ.Записать();
	КонецЕсли; 
	
	Элемент = Неопределено;
	Элемент = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Рекомендация клиента", Истина);
	Если Не ЗначениеЗаполнено(Элемент) Тогда
		ЭлементПВХ = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		ЭлементПВХ.Наименование		= НСтр("ru='Рекомендация клиента';en='Recommendation of customer'");
		ЭлементПВХ.ТипЗначения 		= Новый ОписаниеТипов("СправочникСсылка.Партнеры");
		ЭлементПВХ.Записать();
	КонецЕсли; 
	
	Элемент = Неопределено;
	Элемент = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Рекомендация сотрудника", Истина);
	Если Не ЗначениеЗаполнено(Элемент) Тогда
		ЭлементПВХ = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		ЭлементПВХ.Наименование		= НСтр("ru='Рекомендация сотрудника';en='Recommendation of the employee'");
		ЭлементПВХ.ТипЗначения 		= Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		ЭлементПВХ.Записать();
	КонецЕсли; 
	
	Элемент = Неопределено;
	Элемент = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию("Рекомендация сотрудника клиента", Истина);
	Если Не ЗначениеЗаполнено(Элемент) Тогда
		ЭлементПВХ = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		ЭлементПВХ.Наименование		= НСтр("ru='Рекомендация сотрудника клиента';en='Recommendation of the employee of customer'");
		ЭлементПВХ.ТипЗначения 		= Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛицаПартнеров");
		ЭлементПВХ.Записать();
	КонецЕсли; 
	
	// Заполним справочник цветовые категории.
	ЭлементСправочника = Справочники.CRM_Категории.НайтиПоНаименованию("Командировка", Истина);
	Если ЭлементСправочника = Справочники.CRM_Категории.ПустаяСсылка() Тогда
		ЭлементСправочника = Справочники.CRM_Категории.СоздатьЭлемент();
		ЭлементСправочника.Наименование			= НСтр("ru='Командировка';en='Business trip'");
		ЭлементСправочника.ЦветПредставление 	= "Зеленый";
		ЭлементСправочника.ЦветИндекс 			= 4;
		ЭлементСправочника.ЦветКрасный 			= 122;
		ЭлементСправочника.ЦветЗеленый 			= 231;
		ЭлементСправочника.ЦветСиний 			= 191;
		ЭлементСправочника.Записать();
	КонецЕсли;
	
	ЭлементСправочника = Справочники.CRM_Категории.НайтиПоНаименованию("График руководителя", Истина);
	Если ЭлементСправочника = Справочники.CRM_Категории.ПустаяСсылка() Тогда
		ЭлементСправочника = Справочники.CRM_Категории.СоздатьЭлемент();
		ЭлементСправочника.Наименование			= НСтр("ru='График руководителя';en='Supervisor Schedule'");
		ЭлементСправочника.ЦветПредставление 	= "Красный";
		ЭлементСправочника.ЦветИндекс 			= 0;
		ЭлементСправочника.ЦветКрасный 			= 255;
		ЭлементСправочника.ЦветЗеленый 			= 136;
		ЭлементСправочника.ЦветСиний 			= 124;
		ЭлементСправочника.Записать();
	КонецЕсли;
	
	ЭлементСправочника = Справочники.CRM_Категории.НайтиПоНаименованию("Совещание (внутреннее)", Истина);
	Если ЭлементСправочника = Справочники.CRM_Категории.ПустаяСсылка() Тогда
		ЭлементСправочника = Справочники.CRM_Категории.СоздатьЭлемент();
		ЭлементСправочника.Наименование			= НСтр("ru='Совещание (внутреннее)';en='Meeting (internal)'");
		ЭлементСправочника.ЦветПредставление 	= "Лиловый";
		ЭлементСправочника.ЦветИндекс 			= 8;
		ЭлементСправочника.ЦветКрасный 			= 219;
		ЭлементСправочника.ЦветЗеленый 			= 173;
		ЭлементСправочника.ЦветСиний 			= 255;
		ЭлементСправочника.Записать();
	КонецЕсли;
	
	ЭлементСправочника = Справочники.CRM_Категории.НайтиПоНаименованию("Встреча (внешняя)", Истина);
	Если ЭлементСправочника = Справочники.CRM_Категории.ПустаяСсылка() Тогда
		ЭлементСправочника = Справочники.CRM_Категории.СоздатьЭлемент();
		ЭлементСправочника.Наименование			= НСтр("ru='Встреча (внешняя)';en='Meeting (External)'");
		ЭлементСправочника.ЦветПредставление 	= "Оранжевый";
		ЭлементСправочника.ЦветИндекс 			= 1;
		ЭлементСправочника.ЦветКрасный 			= 255;
		ЭлементСправочника.ЦветЗеленый 			= 184;
		ЭлементСправочника.ЦветСиний 			= 120;
		ЭлементСправочника.Записать();
	КонецЕсли;
	
	ЭлементСправочника = Справочники.CRM_Категории.НайтиПоНаименованию("Личные", Истина);
	Если ЭлементСправочника = Справочники.CRM_Категории.ПустаяСсылка() Тогда
		ЭлементСправочника = Справочники.CRM_Категории.СоздатьЭлемент();
		ЭлементСправочника.Наименование			= НСтр("ru='Личные';en='Personal'");
		ЭлементСправочника.ЦветПредставление 	= "Синий";
		ЭлементСправочника.ЦветИндекс 			= 7;
		ЭлементСправочника.ЦветКрасный 			= 164;
		ЭлементСправочника.ЦветЗеленый 			= 189;
		ЭлементСправочника.ЦветСиний 			= 252;
		ЭлементСправочника.Записать();
	КонецЕсли;
	
	// Для системной учетной записи электронной почты заполним папки электронных писем по умолчанию.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПапкиЭлектронныхПисем.Ссылка
	|ИЗ
	|	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
	|ГДЕ
	|	ПапкиЭлектронныхПисем.Владелец = ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		СсылкаУЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		ОбъектУЗ = СсылкаУЗ.ПолучитьОбъект();
		ОбъектУЗ.Записать();
	КонецЕсли;
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты.ПолучитьОбъект();
	УчетнаяЗапись.ПортСервераИсходящейПочты	= 25;
	УчетнаяЗапись.ПортСервераВходящейПочты	= 110;
	УчетнаяЗапись.ВремяОжидания				= 30;
	УчетнаяЗапись.Записать();
	
	// Заполним ПВХ CRM_ОбъектыЖурналаДокументов
	CRM_КлиентыСервер.ЗаполнитьПроверитьПВХОбъектыЖурнала();
	
	// Заполним справочник CRM_ГруппыУниверсальногоЖурнала.
	Справочники.CRM_ГруппыУниверсальногоЖурнала.ЗаполнитьКонтакты();
	Справочники.CRM_ГруппыУниверсальногоЖурнала.ЗаполнитьПродажи();
	Справочники.CRM_ГруппыУниверсальногоЖурнала.ЗаполнитьПроцессы();
	
	// Заполнение пользовательских настроек динамических списков по умолчанию.
	CRM_ОбщегоНазначенияСервер.ПользовательскиеНастройкиСпискаЗаполнитьПоУмолчанию();
	
	// Заполнение элементов справочника CRM_СостоянияСобытий.
	Справочники.CRM_СостоянияСобытий.ЗаполнитьЭлементыСправочника();
	
	// Заполнение константы CRM_КоличествоПисемЭлектроннойРассылкиВОтправляемомПакете.
	Константы.CRM_КоличествоПисемЭлектроннойРассылкиВОтправляемомПакете.Установить(50);
	Константы.CRM_ИспользоватьРегламентноеЗаданиеОтправкиРассылокЭлектронныхПисем.Установить(Истина);
	
	// Заполнение регистра CRM_ОписаниеРеквизитовМетаданных.
	РегистрыСведений.CRM_ОписаниеРеквизитовМетаданных.ОбновитьЗаписи();
	
	// Видам КИ с типом АдресЭлектроннойПочты включим флаг проверки корректности.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	НЕ ВидыКонтактнойИнформации.ЭтоГруппа
	|	И ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ПроверятьКорректность = Истина;
		Попытка
			СправочникОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Заполним шаблон рассылки для анкетирования.
	Справочники.CRM_ШаблоныРассылки.CRM_ЗаполнитьШаблонДляАнкетирования();
	Справочники.CRM_ШаблоныРассылки.ОбновитьОбъектСправочника(Справочники.CRM_ШаблоныРассылки.ШаблонОценкиОбращения);
	
	// Заполним шаблоны автотекста.
	Справочники.CRM_ШаблоныАвтотекста.ЗаполнитьПредопределенныеДанные();
	
	// Заполнение ролей партнеров для предопределенных элементов справочника ВидыСвязейМеждуПартнерами.
	CRM_МетодыМодулейМенеджеровСправочников.CRM_ЗаполнитьРолиПартнеровДляВидовСвязей();
	
	// Заполним реквизиты предопределенных элементов справочника обработчики событий точек маршрута.
	
	// Вложенный бизнес-процесс
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ПриСозданииВложенногоБизнесПроцесса.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ПослеСозданияВложенногоБизнесПроцесса.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПередСозданиемЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПриСозданииЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	// Выбор варианта
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВыборВарианта.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВыборВарианта;
	СпрОбъект.Записать();
	
	// Действие
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПриВыполнении.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПослеВыполнения.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПередСозданиемЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПриСозданииЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	// Завершение
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ЗавершениеПриЗавершении.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Завершение;
	СпрОбъект.Записать();
	
	// Обработка
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.Обработка.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Обработка;
	СпрОбъект.Записать();
	
	// Старт
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.СтартПередСтартом.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Старт;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.СтартПриСтарте.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Старт;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.СтартПослеСтарта.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Старт;
	СпрОбъект.Записать();
	
	// Условие
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.УсловиеПроверкаУсловия.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Условие;
	СпрОбъект.Записать();
	
	// Обработка
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.Обработка.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Обработка;
	СпрОбъект.Записать();
	
	// Заполним предопределенный БП Поручение, создадим и заполним Продажа, Продажа (несколько направлений деятельности).
	Если НЕ ЭтоРазделенныйРежимРаботы Тогда	
		Для Каждого МакетКарты Из Метаданные.Справочники.CRM_КартыМаршрутов.Макеты Цикл
			
			Если МакетКарты.Имя = "КартаМаршрутаПоУмолчанию" Тогда Продолжить; КонецЕсли;
			
			ИмяФайла = ПолучитьИмяВременногоФайла("xml");
			ДвоичныеДанные = Справочники.CRM_КартыМаршрутов.ПолучитьМакет(МакетКарты.Имя);
			Если ТипЗнч(ДвоичныеДанные)<>Тип("ДвоичныеДанные") Тогда Продолжить КонецЕсли;
			ДвоичныеДанные.Записать(ИмяФайла);
			
			Если МакетКарты.Имя = "Поручение" Тогда
				Если НЕ Справочники.CRM_КартыМаршрутов.Поручение.Наименование = МакетКарты.Синоним Тогда
					ПредопределенныйОбъект = Справочники.CRM_КартыМаршрутов.Поручение.ПолучитьОбъект();
					ПредопределенныйОбъект.Наименование = МакетКарты.Синоним;
					ПредопределенныйОбъект.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс;
					ПредопределенныйОбъект.Записать();
					
					CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(Справочники.CRM_КартыМаршрутов.Поручение, ИмяФайла);
				КонецЕсли;
				
			ИначеЕсли МакетКарты.Имя = "ЗапросНаИзменениеСроков" Тогда
				Если НЕ Справочники.CRM_КартыМаршрутов.ЗапросНаИзменениеСроков.Наименование = МакетКарты.Синоним Тогда
					ПредопределенныйОбъект = Справочники.CRM_КартыМаршрутов.ЗапросНаИзменениеСроков.ПолучитьОбъект();
					ПредопределенныйОбъект.Наименование = МакетКарты.Синоним;
					ПредопределенныйОбъект.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс;
					ПредопределенныйОбъект.Записать();
				КонецЕсли;
				
				CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(Справочники.CRM_КартыМаршрутов.ЗапросНаИзменениеСроков, ИмяФайла);
				
			ИначеЕсли МакетКарты.Имя = "Обращение" Тогда
				Элемент = Неопределено;
				Элемент = Справочники.CRM_КартыМаршрутов.НайтиПоНаименованию("Обращение");
				Если Не ЗначениеЗаполнено(Элемент) Тогда
					
					НоваяКарта = Справочники.CRM_КартыМаршрутов.СоздатьЭлемент();
					НоваяКарта.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс;
					НоваяКарта.ИспользоватьПриПринятииОбращения = Истина;
					НоваяКарта.СостояниеПроцесса = Перечисления.bpmСостояниеПроцесса.Запланирован;
					НоваяКарта.Наименование = "Обращение";
					НоваяКарта.Записать();
					
					CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(НоваяКарта.Ссылка, ИмяФайла);
				КонецЕсли;	
			ИначеЕсли МакетКарты.Имя = "СогласованиеПланаВстреч" Тогда	
				Элемент = Неопределено;
				Элемент = Справочники.CRM_КартыМаршрутов.НайтиПоНаименованию(МакетКарты.Синоним);
				Если Не ЗначениеЗаполнено(Элемент) Тогда
					
					НоваяКарта = Справочники.CRM_КартыМаршрутов.СоздатьЭлемент();
					НоваяКарта.ТипПроцесса = Перечисления.bpmТипыПроцессов.ПроцессОбъекта;
					НоваяКарта.Наименование = МакетКарты.Синоним;
					НоваяКарта.ВидОбъектаСтрокой = "CRM_ЖурналыВстреч";
					НоваяКарта.РеквизитОбъектаСтрокой = "Статус";
					НоваяКарта.РазрешеноДосрочноеЗавершение = Истина;
					НоваяКарта.РазрешитьПеремещатьТекущийЭтап = Истина;
					НоваяКарта.УказыватьПричинуНеудачногоЗавершения = Истина;
					НоваяКарта.СостояниеДосрочногоЗавершения = Перечисления.CRM_СтатусыСогласованияПланированияВстреч.Отменено;
					НоваяКарта.Записать();
					
					CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(НоваяКарта.Ссылка, ИмяФайла);
					
					СхемаКомпоновкиДанных		= CRM_БизнесПроцессыПереопределяемый.ПолучитьСхемуКомпоновкиПоИмениОбъекта("CRM_ЖурналыВстреч");
					АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
					НастройкиКомпоновки	= CRM_БизнесПроцессыПереопределяемый.СкомпоноватьНастройки(Новый КомпоновщикНастроекКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
					НоваяКарта.Прочитать();
					НоваяКарта.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
					НоваяКарта.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкиКомпоновки);
					НоваяКарта.Записать();
				КонецЕсли;
			Иначе
				Элемент = Неопределено;
				Элемент = Справочники.CRM_КартыМаршрутов.НайтиПоНаименованию(МакетКарты.Синоним);
				Если Не ЗначениеЗаполнено(Элемент) Тогда
					
					НоваяКарта = Справочники.CRM_КартыМаршрутов.СоздатьЭлемент();
					НоваяКарта.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс;
					НоваяКарта.Наименование = МакетКарты.Синоним;
					НоваяКарта.Записать();
					
					CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(НоваяКарта.Ссылка, ИмяФайла);
					
					СхемаКомпоновкиДанных		= CRM_БизнесПроцессыПереопределяемый.ПолучитьСхемуКомпоновкиПоИмениОбъекта("Пользователи");
					АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
					НастройкиКомпоновки	= CRM_БизнесПроцессыПереопределяемый.СкомпоноватьНастройки(Новый КомпоновщикНастроекКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
					НоваяКарта.Прочитать();
					НоваяКарта.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
					НоваяКарта.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкиКомпоновки);
					НоваяКарта.Записать();
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Заполнение реквизита УспешностьЗавершения у предопределенных элементов справочника
	// CRM_ВариантыЗавершенияБизнесПроцесса.
	Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.ЗаполнитьРеквизитУспешностьЗавершения();
	
	// Установим виды точек маршрута.
	Справочники.CRM_ОбработчикиСобытийТочекМаршрута.УстановитьВидТочкиВОбработчиках();
	
	// Заполнение реквизитов предопределенных элементов справочника "CRM_КатегорииРешений".
	Справочники.CRM_КатегорииРешений.ЗаполнитьПредопределенныеКатегорииРешений();
	
	// Объекты НСИ CRM 3.0
	ЗаполнитьДанныеНСИ_Редакции3();
	
	// Заполнение предопределенных данных для работы механизма триггеров.
	Справочники.CRM_ДействияТриггеров.СоздатьПредопределенныеДействия();
	Справочники.CRM_УсловияСрабатыванияТриггеров.СоздатьПредопределенныеДействия();
	
	// Заполнение должностей.
	Справочники.CRM_Должности.СоздатьЭлементыПоУмолчанию();
	
	// Заполнение причин отказа.
	Справочники.CRM_ПричиныОтказаПоИнтересам.СоздатьЭлементыПоУмолчанию();
	Справочники.CRM_ПричиныОтклоненияОбращений.СоздатьЭлементыПоУмолчанию();
	
	// Заполнение бизнес-регионов по классификатору.
	ЗаполнитьСправочникБизнесРегионыПоКлассификатору();
	
	// Заполнение шаблонов ключевых показателей
	ЗаполнитьШаблоныПоказателей();
	
	// История реквизитов.
	РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.НачальноеЗаполнениеНастроекВерсионирования();
	
	РегистрыСведений.CRM_РасшифровкиСтатусовПисемEmailРассылки.ОбновитьРасшифровкиСтатусов();
	
	ЗаполнитьРасположениеРеквизитовКлиентов();
	
	ПереименоватьПроценты();
	
	ОбработатьВзаимодействия();
	
	Если ЭтоРазделенныйРежимРаботы Тогда
		Константы.CRM_ИспользоватьИнтеграциюСМессенджерами.Установить(Истина);
	Иначе
		СписокРегЗаданий = Новый СписокЗначений;
		//СписокРегЗаданий.Добавить("CRM_ВыполнениеТриггеров");
		СписокРегЗаданий.Добавить("CRM_ОтложенноеВыполнениеТриггеров");
		СписокРегЗаданий.Добавить("CRM_ОбменДаннымиСMSExchange");
		//СписокРегЗаданий.Добавить("CRM_ОжиданиеСобытийМессенджера");
		СписокРегЗаданий.Добавить("CRM_ОтправкаОповещенийПоСМС");
		СписокРегЗаданий.Добавить("CRM_ОтправкаОповещенийПоЭлектроннойПочте");
		СписокРегЗаданий.Добавить("CRM_СинхронизацияКалендарей");
		СписокРегЗаданий.Добавить("CRM_СтатусыEmailРассылок");
		СписокРегЗаданий.Добавить("CRM_ФормированиеОповещений");
		СписокРегЗаданий.Добавить("CRM_ФормированиеПоздравленийСДнемРождения");
		СписокРегЗаданий.Добавить("CRM_РасчетКлючевыхПоказателей");
		Для Каждого РегЗадание из  СписокРегЗаданий Цикл
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания[РегЗадание.Значение].ИмяМетода);
			СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоиска);
			
			Если СписокЗаданий.Количество() = 0 Тогда
				ПараметрыЗадания = Новый Структура("Использование", Истина);
				ПараметрыЗадания.Вставить("Расписание", РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(Метаданные.РегламентныеЗадания[РегЗадание.Значение], Ложь));
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания[РегЗадание.Значение]);
				РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
				Продолжить;
			КонецЕсли;
			
			Для Каждого Задание Из СписокЗаданий Цикл
				ПараметрыЗадания = Новый Структура("Использование", Истина);
				РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
			КонецЦикла;
			
		КонецЦикла;
		
		ПланыВидовХарактеристик.CRM_Классификаторы.ВключениеИспользованияТегов();
		
	КонецЕсли;
	
	ОбновитьСоставЖурналаДокументов();
	
	ЗаполнитьНастройкиРабочегоСтола();
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() И НЕ ЭтоРазделенныйРежимРаботы Тогда
		ПроверкаКонтрагентов.ВключитьВыключитьПроверкуКонтрагентов(Ложь);
	КонецЕсли;
	
	Справочники.CRM_ТипыОтношений.ЗаполнитьПредопределенныеДанные(Неопределено);
	Справочники.CRM_УровниПоддержки.ЗаполнитьПредопределенныеДанные();
	Справочники.CRM_ТипыОбращений.ЗаполнитьПредопределенныеДанные();
	
	// Заполним служебные реквизиты для обмена с iCRM.
	ЗаполнитьРеквизитыДляОбмена();
	
	// Настройки контроля заполненности
	CRM_КонтрольЗаполненностиРеквизитовОбъектов.НачальноеЗаполнениеНастроекКонтроляЗаполненностиОбъектов(Новый Структура("ПервыйЗапуск", Истина));
	
	Справочники.CRM_СтатусыКонтактныхЛиц.НачальноеЗаполнение();
	
	CRM_МоделиМашинногоОбучения.НачальноеЗаполнениеДанных();
	
	// Начальное заполнение роли CRM_ДинамическаяАдресация
	Роль = Справочники.РолиИсполнителей.CRM_ДинамическаяАдресация.ПолучитьОбъект();
	Назначение = Роль.Назначение.Добавить();
	Назначение.ТипПользователей = Справочники.Пользователи.ПустаяСсылка();
	Роль.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ПервыйЗапуск()

// Процедура заполняет новые объекты ИБ данными по умолчанию
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьДанныеНСИ_Редакции3() Экспорт
	
	// Заполним константу использования тегов.
	Константы.CRM_ИспользоватьТеги.Установить(Истина);
	
	// Заполним справочник "Сегменты рынка".
	Справочники.CRM_СегментыРынка.СоздатьЭлементыСправочникаПоУмолчанию();
	
	// Заполним справочник "Численность сотрудников клиента".
	Справочники.CRM_ЧисленностьСотрудниковКлиента.СоздатьЭлементыСправочникаПоУмолчанию();
	
	// Заполним справочник "Численность рабочих мест клиента".
	Справочники.CRM_ЧисленностьРабочихМестКлиента.СоздатьЭлементыСправочникаПоУмолчанию();
	
	// Заполним справочник "Виды ключевых событий".
	Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлементыСправочникаПоУмолчанию();
	
	// Заполним справочник "Важность клиентов".
	Справочники.CRM_ВажностьКлиентов.ЗаполнитьПредопределенныеЭлементы();
	
	// Заполним справочник "Состояния интересов".
	Справочники.CRM_СостоянияИнтересов.ЗаполнитьПредопределенныеЭлементы();
	
	// Заполним предопределенные элементы справочника "Виды взаимодействий".
	Справочники.CRM_ВидыВзаимодействий.ЗаполнитьПредопределенныеЭлементы();
	
	// Заполним предопределенные элементы справочника "Офисы компании".
	Справочники.CRM_ОфисыКомпании.СоздатьЭлементыСправочникаПоУмолчанию();
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		// Сразу же после заполнения офисов, заполним реквизит "Офис" у основного подразделения
		ЗаполнитьРеквизитОфисУОсновногоПодразделения();
	КонецЕсли;
	
	// Заполняем у всех контактных лиц элемент "День рождения" ТЧ "Ключевые события". 
	ЗаполнитьКлючевоеСобытиеДеньРожденияКЛНаОсновеДатыРождения();	
	
	// Загружаем всем пользователям базы настройки полей отображения содержания из типового макета.
	CRM_ОбщегоНазначенияСервер.УстановитьВсемПользователямНастройкиОтображенияСодержанияИзМакета();
	
	// Заполним предопределенные ключевые показатели.
	// CRM_РаботаСВиджетамиВызовСервера.ЗаполнитьПредопределенныеКлючевыеПоказатели();
	
	// Заполним предопределенные виджеты.
	Справочники.CRM_Виджеты.ЗаполнитьПредопределенныеВиджеты();
	
	// Доступ к ключевым показателям и представления по умолчанию.
	ЗаполнитьДоступККлючевымПоказателямИПредставления();
	
	// Заполнение справочника CRM_ВоронкиПродаж.
	Справочники.CRM_ВоронкиПродаж.СоздатьЭлементыСправочникаПоУмолчанию();
	
КонецПроцедуры // ЗаполнитьДанныеНСИ_Редакции3()

Процедура ЗаполнитьСправочникБизнесРегионыПоКлассификатору()
	
	МакетКлассификатор = Справочники.БизнесРегионы.ПолучитьМакет("CRM_Классификатор");
	
	ВозвратнаяСтруктура = ОбщегоНазначения.ПрочитатьXMLВТаблицу(МакетКлассификатор.ПолучитьТекст());
	
	ТаблицаРегионов = ВозвратнаяСтруктура.Данные;
	Для Каждого СтрокаТаблицыРегионов Из ТаблицаРегионов Цикл
		
		Платежеспособность = ?(ПустаяСтрока(СтрокаТаблицыРегионов.Solvency), 
							   Перечисления.CRM_Платежеспособность.ПустаяСсылка(),
							   Перечисления.CRM_Платежеспособность[СтрокаТаблицыРегионов.Solvency]);
		
		НовыйЭлемент = Справочники.БизнесРегионы.СоздатьЭлемент();
		НовыйЭлемент.Наименование = СтрокаТаблицыРегионов.Name;
		НовыйЭлемент.CRM_КодПоКлассификатору  = Число(СтрокаТаблицыРегионов.Code);
		НовыйЭлемент.CRM_КодСтраны = СтрокаТаблицыРегионов.CountryCode;
		НовыйЭлемент.CRM_КодГорода = СтрокаТаблицыРегионов.SityCode;
		НовыйЭлемент.CRM_ЧисленностьНаселения = СтрокаТаблицыРегионов.Population;
		НовыйЭлемент.CRM_Платежеспособность = Платежеспособность;
		НовыйЭлемент.CRM_ВремяПоГринвичу_GMT = СтрокаТаблицыРегионов.TimeZone;
		НовыйЭлемент.Родитель = Справочники.БизнесРегионы.НайтиПоРеквизиту("CRM_КодПоКлассификатору", Число(СтрокаТаблицыРегионов.ParentCode));
		НовыйЭлемент.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет доступ к ключевым показателям.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьДоступККлючевымПоказателямИПредставления() Экспорт
		
КонецПроцедуры // ЗаполнитьДоступККлючевымПоказателямИПредставления()

Процедура ЗаполнитьШаблоныПоказателей() Экспорт
	Справочники.CRM_ШаблоныКлючевыхПоказателей.ЗаполнитьПредопределенныеПоказатели();
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьНапоминанияПользователя(Параметры) Экспорт
	Константы.ИспользоватьНапоминанияПользователя.Установить(Ложь);
КонецПроцедуры

Процедура ЗаполнитьРасположениеРеквизитовКлиентов() Экспорт
	
	НаборЗаписей = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	МенеджерЗаписи = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяРеквизита = "CRM_ОсновнаяОтрасль";
	МенеджерЗаписи.ПредставлениеРеквизита = Метаданные.Справочники.Партнеры.Реквизиты[МенеджерЗаписи.ИмяРеквизита].Синоним;
	МенеджерЗаписи.Колонка = "Левая";
	МенеджерЗаписи.ПорядокРасположения = 1;
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Записать(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяРеквизита = "CRM_СегментРынка";
	МенеджерЗаписи.ПредставлениеРеквизита = Метаданные.Справочники.Партнеры.Реквизиты[МенеджерЗаписи.ИмяРеквизита].Синоним;
	МенеджерЗаписи.Колонка = "Правая";
	МенеджерЗаписи.ПорядокРасположения = 1;
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Записать(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяРеквизита = "CRM_Важность";
	МенеджерЗаписи.ПредставлениеРеквизита = Метаданные.Справочники.Партнеры.Реквизиты[МенеджерЗаписи.ИмяРеквизита].Синоним;
	МенеджерЗаписи.Колонка = "Левая";
	МенеджерЗаписи.ПорядокРасположения = 2;
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Записать(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяРеквизита = "CRM_ЧисленностьСотрудников";
	МенеджерЗаписи.ПредставлениеРеквизита = Метаданные.Справочники.Партнеры.Реквизиты[МенеджерЗаписи.ИмяРеквизита].Синоним;
	МенеджерЗаписи.Колонка = "Правая";
	МенеджерЗаписи.ПорядокРасположения = 2;
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Записать(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяРеквизита = "CRM_СтатусРаботы";
	МенеджерЗаписи.ПредставлениеРеквизита = Метаданные.Справочники.Партнеры.Реквизиты[МенеджерЗаписи.ИмяРеквизита].Синоним;
	МенеджерЗаписи.Колонка = "Левая";
	МенеджерЗаписи.ПорядокРасположения = 3;
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Записать(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяРеквизита = "CRM_ЧисленностьРабочихМест";
	МенеджерЗаписи.ПредставлениеРеквизита = Метаданные.Справочники.Партнеры.Реквизиты[МенеджерЗаписи.ИмяРеквизита].Синоним;
	МенеджерЗаписи.Колонка = "Правая";
	МенеджерЗаписи.ПорядокРасположения = 3;
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Записать(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Свойство,
	|	ВложенныйЗапрос.НаборСвойств
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДополнительныеРеквизиты.Свойство КАК Свойство,
	|		ДополнительныеРеквизиты.Ссылка КАК НаборСвойств
	|	ИЗ
	|		Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|	ГДЕ
	|		НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа
	|		И ДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ(&ГруппаНабора)) КАК ВложенныйЗапрос");
	
	Запрос.УстановитьПараметр("ГруппаНабора", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры);
	ТабНаборов = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТабНаборов Цикл
		Если НЕ Строка.НаборСвойств.ПринадлежитЭлементу(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры) 
			И Строка.НаборСвойств <> Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры Тогда Продолжить КонецЕсли;
		Если Найти(Строка.НаборСвойств.Наименование, "не  используется") > 0 Тогда Продолжить КонецЕсли;
		Реквизит = Строка.Свойство;
		Если Реквизит.Пустая() Тогда Продолжить КонецЕсли;
		Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
		ИмяУникальнаяЧасть = 
		СтрЗаменить(ВРег(Строка(Строка.НаборСвойств.УникальныйИдентификатор())), "-", "x")
		+ "_"
		+ СтрЗаменить(ВРег(Строка(Реквизит.УникальныйИдентификатор())), "-", "x");
		
		Менеджер.ИмяРеквизита =	"ДополнительныйРеквизитЗначение_" + ИмяУникальнаяЧасть;
		Менеджер.ДопРеквизит = Реквизит;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(CRM_РасположениеРеквизитовКлиентов.ПорядокРасположения) КАК ПорядокРасположения
		|ИЗ
		|	РегистрСведений.CRM_РасположениеРеквизитовКлиентов КАК CRM_РасположениеРеквизитовКлиентов
		|ГДЕ
		|	CRM_РасположениеРеквизитовКлиентов.Колонка = &ИмяКолонки";
		Запрос.УстановитьПараметр("ИмяКолонки", "Дополнительно");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПорядокЭлемента = ?(ЗначениеЗаполнено(Выборка.ПорядокРасположения), Выборка.ПорядокРасположения + 1, 1);
		Иначе
			ПорядокЭлемента = 1;
		КонецЕсли;
		
		Менеджер.ПредставлениеРеквизита = Реквизит.Наименование;
		Менеджер.Колонка = "Дополнительно";
		Менеджер.ПорядокРасположения = ПорядокЭлемента;
		Менеджер.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереименоватьПроценты() Экспорт
	
	ЕдиницаПроценты = Справочники.CRM_ЕдиницыИзмеренияПоказателей.Процент.ПолучитьОбъект();
	ЕдиницаПроценты.Наименование = "%";
	ЕдиницаПроценты.Записать();
	
	Показатель = Справочники.CRM_ШаблоныКлючевыхПоказателей.ВысланныеКП.ПолучитьОбъект();
	Показатель.Наименование = "Кол-во выставленных коммерческих предложений";
	Показатель.КраткоеНаименование = "Выставленные КП";
	Показатель.Записать();
	
КонецПроцедуры

Процедура ОбработатьВзаимодействия() Экспорт
	
	ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ОбзвонКлиентов.ПолучитьОбъект();
	ВидВзаимодействия.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	ВидВзаимодействия.Записать();
	
	ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ВидВзаимодействия.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы;
	ВидВзаимодействия.Баллы				= 2;	
	ВидВзаимодействия.ВидСобытия = Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	ВидВзаимодействия.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	ВидВзаимодействия.Описание = Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	ВидВзаимодействия.Наименование = Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	ВидВзаимодействия.Записать();	
	
	ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ВидВзаимодействия.Баллы				= 2;	
	ВидВзаимодействия.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы;
	ВидВзаимодействия.ВидСобытия = Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	ВидВзаимодействия.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	ВидВзаимодействия.Описание = Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	ВидВзаимодействия.Наименование = Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	ВидВзаимодействия.Записать();
	
КонецПроцедуры

Процедура ОбновитьСоставЖурналаДокументов() Экспорт
	
	СсылкаПВХ = CRM_КлиентыСервер.ПолучитьСсылкуПВХОбъектыЖурналаПоТипу(Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс"));
	Если СсылкаПВХ <> Неопределено Тогда 
		Если Справочники.CRM_ГруппыУниверсальногоЖурнала.Бизнес_процессы.Состав.Найти(СсылкаПВХ, "Объект") = Неопределено Тогда
			ОбъектЖурнала = Справочники.CRM_ГруппыУниверсальногоЖурнала.Бизнес_процессы.ПолучитьОбъект();
			МассивТипов = Новый Массив();
			МассивТипов.Добавить(Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс"));
			Справочники.CRM_ГруппыУниверсальногоЖурнала.ЗаполнитьОбъектПоМассивуТипов(ОбъектЖурнала, МассивТипов);
			ОбъектЖурнала.Записать();
		КонецЕсли;
		ОбъектЖурнала = Справочники.CRM_ГруппыУниверсальногоЖурнала.Контакты.ПолучитьОбъект();
		Для Каждого Строка Из ОбъектЖурнала.Состав Цикл
			Если Строка.Объект = СсылкаПВХ Тогда
				ОбъектЖурнала.Состав.Удалить(Строка.НомерСтроки-1);
			КонецЕсли;	
		КонецЦикла;
		ОбъектЖурнала.Записать();
		ОбъектЖурнала = Справочники.CRM_ГруппыУниверсальногоЖурнала.Продажи.ПолучитьОбъект();
		Для Каждого Строка Из ОбъектЖурнала.Состав Цикл
			Если Строка.Объект = СсылкаПВХ Тогда
				ОбъектЖурнала.Состав.Удалить(Строка.НомерСтроки-1);
			КонецЕсли;	
		КонецЦикла;
		ОбъектЖурнала.Записать();
	КонецЕсли;
	
	СсылкаПВХ = CRM_КлиентыСервер.ПолучитьСсылкуПВХОбъектыЖурналаПоТипу(Тип("ДокументСсылка.CRM_Интерес"));
	Если СсылкаПВХ <> Неопределено Тогда
		Если Справочники.CRM_ГруппыУниверсальногоЖурнала.Продажи.Состав.Найти(СсылкаПВХ, "Объект") = Неопределено Тогда
			ОбъектЖурнала = Справочники.CRM_ГруппыУниверсальногоЖурнала.Продажи.ПолучитьОбъект();
			МассивТипов = Новый Массив();
			МассивТипов.Добавить(Тип("ДокументСсылка.CRM_Интерес"));
			Справочники.CRM_ГруппыУниверсальногоЖурнала.ЗаполнитьОбъектПоМассивуТипов(ОбъектЖурнала, МассивТипов);
			ОбъектЖурнала.Записать();
		КонецЕсли;
	КонецЕсли;
	СсылкаПВХ = CRM_КлиентыСервер.ПолучитьСсылкуПВХОбъектыЖурналаПоТипу(Тип("ДокументСсылка.CRM_Взаимодействие"));
	Если СсылкаПВХ <> Неопределено Тогда
		Если Справочники.CRM_ГруппыУниверсальногоЖурнала.Контакты.Состав.Найти(СсылкаПВХ, "Объект") = Неопределено Тогда
			ОбъектЖурнала = Справочники.CRM_ГруппыУниверсальногоЖурнала.Контакты.ПолучитьОбъект();
			МассивТипов = Новый Массив();
			МассивТипов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
			Справочники.CRM_ГруппыУниверсальногоЖурнала.ЗаполнитьОбъектПоМассивуТипов(ОбъектЖурнала, МассивТипов);
			ОбъектЖурнала.Записать();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьНастройкиРабочегоСтола() Экспорт
	
	// Для Fresh установим открытие раб. стола по умолчанию при запуске
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Запись = РегистрыСведений.CRM_НастройкиОткрытияРабочегоСтола.СоздатьМенеджерЗаписи();
		Запись.Объект = "Общие настройки";
		Запись.ОткрыватьРабочийСтол = Истина;
		Запись.БлокироватьИнтерфейс = Ложь;
		Запись.ИзменятьСоставРабочегоСтола = Ложь;
		Запись.ИзменятьРежимЗапуска = Ложь;
		Запись.ИндивидуальныеНастройки = Истина;
		Запись.ОтображатьОповещения = Истина;
		Запись.Записать();
	Иначе	
		Запись = РегистрыСведений.CRM_НастройкиОткрытияРабочегоСтола.СоздатьМенеджерЗаписи();
		Запись.Объект = "Общие настройки";
		Запись.ОткрыватьРабочийСтол = CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM();
		Запись.БлокироватьИнтерфейс = Ложь;
		Запись.ИзменятьСоставРабочегоСтола = Ложь;
		Запись.ИзменятьРежимЗапуска = Ложь;
		Запись.ИндивидуальныеНастройки = Истина;
		Запись.ОтображатьОповещения = Истина;
		Запись.Записать();
	КонецЕсли;
	
	СписокФорм = CRM_РабочийСтолСервер.ПолучитьСписокФормПоУмолчанию();
	Набор = РегистрыСведений.CRM_НастройкиРабочегоСтола.СоздатьНаборЗаписей();
	Набор.Очистить();
	Счетчик = 1;
	Для Каждого Значение Из СписокФорм Цикл
		Стр = Набор.Добавить();
		Стр.ИмяФормы = Значение.Значение;
		Стр.Наименование = Значение.Представление;
		Стр.Идентификатор = Строка(Новый УникальныйИдентификатор);
		Стр.Объект = "Общие настройки";
		Стр.Порядок = Счетчик;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыДляОбмена(Параметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.CRM_ИмяПредопределенногоЭлемента = """"";
	ТабДанных = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТабДанных Цикл
		Об = Строка.Ссылка.ПолучитьОбъект();
		Если Об.Предопределенный Тогда
			Об.CRM_ИмяПредопределенногоЭлемента = Об.ИмяПредопределенныхДанных;
		Иначе
			Об.CRM_ИмяПредопределенногоЭлемента = Строка(Строка.Ссылка.УникальныйИдентификатор());
		КонецЕсли;	
		Об.Записать();
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти


#Область ВызываемыеПриКаждомОбновлении

// Заполняет ПВХ CRM_ОбъектыЖурналаДокументов
//
Процедура ЗаполнитьПроверитьПВХОбъектыЖурнала(Параметры) Экспорт
	CRM_КлиентыСервер.ЗаполнитьПроверитьПВХОбъектыЖурнала();
КонецПроцедуры

#КонецОбласти


#Область Обновление_3_0_21_4

Процедура СоздатьКартуПланированияВстреч(Параметры = Неопределено) Экспорт
	
	МакетКарты = Метаданные.Справочники.CRM_КартыМаршрутов.Макеты.СогласованиеПланаВстреч;
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные = Справочники.CRM_КартыМаршрутов.ПолучитьМакет(МакетКарты.Имя);
	ДвоичныеДанные.Записать(ИмяФайла);
	Элемент = Неопределено;
	Элемент = Справочники.CRM_КартыМаршрутов.НайтиПоНаименованию(МакетКарты.Синоним);
	Если Не ЗначениеЗаполнено(Элемент) Тогда
		
		НоваяКарта = Справочники.CRM_КартыМаршрутов.СоздатьЭлемент();
		НоваяКарта.ТипПроцесса = Перечисления.bpmТипыПроцессов.ПроцессОбъекта;
		НоваяКарта.Наименование = МакетКарты.Синоним;
		НоваяКарта.ВидОбъектаСтрокой = "CRM_ЖурналыВстреч";
		НоваяКарта.РеквизитОбъектаСтрокой = "Статус";
		НоваяКарта.РазрешеноДосрочноеЗавершение = Истина;
		НоваяКарта.РазрешитьПеремещатьТекущийЭтап = Истина;
		НоваяКарта.УказыватьПричинуНеудачногоЗавершения = Истина;
		НоваяКарта.СостояниеДосрочногоЗавершения = Перечисления.CRM_СтатусыСогласованияПланированияВстреч.Отменено;
		НоваяКарта.Записать();
		
		CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(НоваяКарта.Ссылка, ИмяФайла);
		
		СхемаКомпоновкиДанных		= CRM_БизнесПроцессыПереопределяемый.ПолучитьСхемуКомпоновкиПоИмениОбъекта("CRM_ЖурналыВстреч");
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
		НастройкиКомпоновки	= CRM_БизнесПроцессыПереопределяемый.СкомпоноватьНастройки(Новый КомпоновщикНастроекКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
		НоваяКарта.Прочитать();
		НоваяКарта.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
		НоваяКарта.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкиКомпоновки);
		НоваяКарта.Записать();
	Иначе	
		НоваяКарта = Элемент.ПолучитьОбъект();
		НоваяКарта.ТипПроцесса = Перечисления.bpmТипыПроцессов.ПроцессОбъекта;
		НоваяКарта.Наименование = МакетКарты.Синоним;
		НоваяКарта.ВидОбъектаСтрокой = "CRM_ЖурналыВстреч";
		НоваяКарта.РеквизитОбъектаСтрокой = "Статус";
		НоваяКарта.РазрешеноДосрочноеЗавершение = Истина;
		НоваяКарта.РазрешитьПеремещатьТекущийЭтап = Истина;
		НоваяКарта.УказыватьПричинуНеудачногоЗавершения = Истина;
		НоваяКарта.СостояниеДосрочногоЗавершения = Перечисления.CRM_СтатусыСогласованияПланированияВстреч.Отменено;
		НоваяКарта.Записать();
		
		CRM_БизнесПроцессыСервер.ЗаполнитьКартуМаршрутаПоМакету(НоваяКарта.Ссылка, ИмяФайла);
		
		СхемаКомпоновкиДанных		= CRM_БизнесПроцессыПереопределяемый.ПолучитьСхемуКомпоновкиПоИмениОбъекта("CRM_ЖурналыВстреч");
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
		НастройкиКомпоновки	= CRM_БизнесПроцессыПереопределяемый.СкомпоноватьНастройки(Новый КомпоновщикНастроекКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
		НоваяКарта.Прочитать();
		НоваяКарта.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
		НоваяКарта.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкиКомпоновки);
		НоваяКарта.Записать();

	КонецЕсли;
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонстантыДляВзаимодействий(Параметры = Неопределено) Экспорт
	// Цвет в календаре по умолчанию.
	Константы.CRM_ЦветСобытияВКалендареПоУмолчанию.Установить(7);
	// Использование категорий.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Категории.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CRM_Взаимодействие.Категории КАК Категории
	               |ГДЕ
	               |	Категории.Категория <> ЗНАЧЕНИЕ(Справочник.CRM_Категории.ПустаяСсылка)";
	Константы.CRM_ИспользоватьКатегорииВзаимодействий.Установить(НЕ Запрос.Выполнить().Пустой());
	// Использование тегов.
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Теги.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CRM_Взаимодействие.CRM_Теги КАК Теги
	               |ГДЕ
	               |	Теги.Тег <> ЗНАЧЕНИЕ(Справочник.CRM_Теги.ПустаяСсылка)";
	Константы.CRM_ИспользоватьТегиДляВзаимодействий.Установить(НЕ Запрос.Выполнить().Пустой());
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // Обновление_3_0_21_4


#Область Обновление_3_0_21_23

Процедура ПодготовитьРольДинамическойАдресации(Параметры) Экспорт
	Роль = Справочники.РолиИсполнителей.CRM_ДинамическаяАдресация.ПолучитьОбъект();
	Если Роль.Назначение.Количество() = 0 Тогда
		Назначение = Роль.Назначение.Добавить();
		Назначение.ТипПользователей = Справочники.Пользователи.ПустаяСсылка();
		Роль.Записать();
	КонецЕсли;
	Параметры.ОбработкаЗавершена = Истина;
КонецПроцедуры

#КонецОбласти // Обновление_3_0_21_23


#Область Обновление_3_0_21_27

Процедура ЗаполнитьШаблоныАвтотекста(Параметры = Неопределено) Экспорт
	
	Справочники.CRM_ШаблоныАвтотекста.ЗаполнитьПредопределенныеДанные();
	
	Если Параметры <> Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // Обновление_3_0_21_27

#Область Обновление_3_0_21_30

Процедура ЗарегистрироватьДанныеКОбработкеПрисоединенныеФайлы_3_0_21_30(Параметры)
	
	ИнфоТаблица = ИнфотаблицаПрисоединенныеФайлы_3_0_21_30();
	
	Для Каждого СтрИнфоТаблица Из ИнфоТаблица Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
			|	&ИмяСправочника.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.&ИмяСправочника КАК &ИмяСправочника
			|ГДЕ
			|	&ИмяСправочника.Ссылка > &Ссылка";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяСправочника", СтрИнфоТаблица.Справочник);
		
		ОтработаныВсеЭлементы = Ложь;
		Ссылка = "";
		
		Пока Не ОтработаныВсеЭлементы Цикл
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
			
			КоличествоСсылок = МассивСсылок.Количество();
			Если КоличествоСсылок < 1000 Тогда
				ОтработаныВсеЭлементы = Истина;
			КонецЕсли;
			
			Если КоличествоСсылок > 0 Тогда
				Ссылка = МассивСсылок[КоличествоСсылок - 1];
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДокументы_3_0_21_30(Параметры)
	
	ИнфоТаблица = ИнфотаблицаРС_3_0_21_30();
	
	Для Каждого СтрИнфоТаблица Из ИнфоТаблица Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
			|	&ИмяДокумента.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.&ИмяДокумента КАК &ИмяДокумента
			|ГДЕ
			|	&ИмяДокумента.Ссылка > &Ссылка";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяДокумента", СтрИнфоТаблица.Документ);
		
		ОтработаныВсеЭлементы = Ложь;
		Ссылка = "";
		
		Пока Не ОтработаныВсеЭлементы Цикл
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
			
			КоличествоСсылок = МассивСсылок.Количество();
			Если КоличествоСсылок < 1000 Тогда
				ОтработаныВсеЭлементы = Истина;
			КонецЕсли;
			
			Если КоличествоСсылок > 0 Тогда
				Ссылка = МассивСсылок[КоличествоСсылок - 1];
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеВТЧ_3_0_21_30(Параметры)
	
	ОбрабатываемыеДанные = Новый Массив;
	ОбрабатываемыеДанные.Добавить(Новый Структура("ИмяСправочника,ИмяТЧ,ИмяРеквизита,ИмяПВХ",
										"CRM_ВоронкиПродаж", "Состав", "ТочкаМаршрута", "CRM_ВидыОбъектовБизнесПроцессов"));
	ОбрабатываемыеДанные.Добавить(Новый Структура("ИмяСправочника,ИмяТЧ,ИмяРеквизита,ИмяПВХ",
										"CRM_ГруппыУниверсальногоЖурнала", "Состав", "Объект", "CRM_ОбъектыЖурналаДокументов"));
										
										
	Для Каждого ЭлементДанных Из ОбрабатываемыеДанные Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
			|	ТЧСправочника.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИмяСправочника.ИмяТЧ КАК ТЧСправочника
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(ТЧСправочника.ИмяРеквизита) = ТИП(ПланВидовХарактеристик.ИмяПВХ)
			|	И ТЧСправочника.Ссылка > &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧСправочника.Ссылка";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяСправочника", ЭлементДанных.ИмяСправочника);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТЧ", ЭлементДанных.ИмяТЧ);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРеквизита", ЭлементДанных.ИмяРеквизита);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяПВХ", ЭлементДанных.ИмяПВХ);
		
		ОтработаныВсеЭлементы = Ложь;
		Ссылка = "";
		
		Пока Не ОтработаныВсеЭлементы Цикл
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
			
			КоличествоСсылок = МассивСсылок.Количество();
			Если КоличествоСсылок < 1000 Тогда
				ОтработаныВсеЭлементы = Истина;
			КонецЕсли;
			
			Если КоличествоСсылок > 0 Тогда
				Ссылка = МассивСсылок[КоличествоСсылок - 1];
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеПВХ_3_0_21_30(Параметры)
	
	ОбрабатываемыеДанные = Новый Массив;
	ОбрабатываемыеДанные.Добавить(Новый Структура("ИмяРС,ИмяРесурса,ИмяПВХ",
										"bpmУсловияЭтапов", "Цель", "CRM_ВидыОбъектовБизнесПроцессов"));
	ОбрабатываемыеДанные.Добавить(Новый Структура("ИмяРС,ИмяРесурса,ИмяПВХ",
										"bpmУсловияЭтаповПоБизнесПроцессам", "Цель", "CRM_ВидыОбъектовБизнесПроцессов"));
										
										
	Для Каждого ЭлементДанных Из ОбрабатываемыеДанные Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИмяРС.Объект КАК Объект,
			|	ИмяРС.ТочкаМаршрута КАК ТочкаМаршрута,
			|	ИмяРС.Идентификатор КАК Идентификатор
			|ИЗ
			|	РегистрСведений.ИмяРС КАК ИмяРС
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(ИмяРС.ИмяРесурса) = ТИП(ПланВидовХарактеристик.ИмяПВХ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИмяРС.Объект,
			|	ИмяРС.ТочкаМаршрута,
			|	ИмяРС.Идентификатор";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРС", ЭлементДанных.ИмяРС);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРесурса", ЭлементДанных.ИмяРесурса);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяПВХ", ЭлементДанных.ИмяПВХ);
		
		ИзмеренияРегистра = Запрос.Выполнить().Выгрузить();
		ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
		ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
		ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений." + ЭлементДанных.ИмяРС;
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ИзмеренияРегистра, ДополнительныеПараметры); 
		
	КонецЦикла;
	
КонецПроцедуры

// Регистрирует на плане обмена ОбновлениеИнформационнойБазы объекты,
// для которых необходимо обновить записи в регистре.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_3_0_21_30(Параметры) Экспорт
	
	ЗарегистрироватьДанныеКОбработкеПрисоединенныеФайлы_3_0_21_30(Параметры);
	ЗарегистрироватьДанныеКОбработкеВТЧ_3_0_21_30(Параметры);
	ЗарегистрироватьДанныеКОбработкеПВХ_3_0_21_30(Параметры);
	ЗарегистрироватьДанныеКОбработкеДокументы_3_0_21_30(Параметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_3_0_21_30(Параметры) Экспорт
	
	ОбработкаЗавершена = Истина;
	
	// Удаление присоединенных файлов
	Результат = ОчиститьСсылкиНаПрисоединенныеФайлы_3_0_21_30(Параметры);
	
	ОбработкаЗавершена = (ОбработкаЗавершена И Результат.ОбработкаЗавершена);
	Если ЗначениеЗаполнено(Результат.ТекстСообщения) Тогда
		ВызватьИсключение Результат.ТекстСообщения;
	КонецЕсли;
	
	// Удаление ссылок в реквизитах ТЧ:
	Результат = ОчиститьСсылкиВТЧ_3_0_21_30("CRM_ВоронкиПродаж", "ТочкаМаршрута", Параметры);
	
	ОбработкаЗавершена = (ОбработкаЗавершена И Результат.ОбработкаЗавершена);
	Если ЗначениеЗаполнено(Результат.ТекстСообщения) Тогда
		ВызватьИсключение Результат.ТекстСообщения;
	КонецЕсли;
	
	Результат = ОчиститьСсылкиВТЧ_3_0_21_30("CRM_ГруппыУниверсальногоЖурнала", "Объект", Параметры);
	
	ОбработкаЗавершена = (ОбработкаЗавершена И Результат.ОбработкаЗавершена);
	Если ЗначениеЗаполнено(Результат.ТекстСообщения) Тогда
		ВызватьИсключение Результат.ТекстСообщения;
	КонецЕсли;
	
	Результат = ОчиститьСсылкиПВХ_3_0_21_30("bpmУсловияЭтапов", "Цель", "CRM_ВидыОбъектовБизнесПроцессов", Параметры);
	
	ОбработкаЗавершена = (ОбработкаЗавершена И Результат.ОбработкаЗавершена);
	Если ЗначениеЗаполнено(Результат.ТекстСообщения) Тогда
		ВызватьИсключение Результат.ТекстСообщения;
	КонецЕсли;
	
	Результат = ОчиститьСсылкиПВХ_3_0_21_30("bpmУсловияЭтаповПоБизнесПроцессам", "Цель", "CRM_ВидыОбъектовБизнесПроцессов", Параметры);
	
	ОбработкаЗавершена = (ОбработкаЗавершена И Результат.ОбработкаЗавершена);
	Если ЗначениеЗаполнено(Результат.ТекстСообщения) Тогда
		ВызватьИсключение Результат.ТекстСообщения;
	КонецЕсли;
	
	Результат = ОчиститьСсылкиВРС_3_0_21_30(Параметры);
	
	ОбработкаЗавершена = (ОбработкаЗавершена И Результат.ОбработкаЗавершена);
	Если ЗначениеЗаполнено(Результат.ТекстСообщения) Тогда
		ВызватьИсключение Результат.ТекстСообщения;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Функция ОчиститьСсылкиВТЧ_3_0_21_30(ИмяСправочника, ИмяРеквизита, Параметры)
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, "Справочник." + ИмяСправочника);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
		    ЭлементБлокировки = Блокировка.Добавить("Справочник." + ИмяСправочника);
		    ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		    Блокировка.Заблокировать();
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
		    Если СпрОбъект = Неопределено Тогда
		        ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
		    Иначе
		
				МассивУдаляемыхСтрокТЧ = Новый Массив;
				
				Для Каждого СтрТЧ ИЗ СпрОбъект.Состав Цикл
					
					Если СтрТЧ[ИмяРеквизита].ТипЗначения = Неопределено Тогда Продолжить; КонецЕсли;
					
					Если СтрТЧ[ИмяРеквизита].ТипЗначения.СодержитТип(Тип("ДокументСсылка.удалитьCRM_Мероприятие"))
							ИЛИ СтрТЧ[ИмяРеквизита].ТипЗначения.СодержитТип(Тип("ДокументСсылка.удалитьCRM_Планирование"))
							ИЛИ СтрТЧ[ИмяРеквизита].ТипЗначения.СодержитТип(Тип("ДокументСсылка.УдалитьCRM_Сделка"))
							ИЛИ СтрТЧ[ИмяРеквизита].ТипЗначения.СодержитТип(Тип("ДокументСсылка.УдалитьCRM_Событие")) Тогда
							
						МассивУдаляемыхСтрокТЧ.Добавить(СтрТЧ);
						
					КонецЕсли;
					
				КонецЦикла;
				
				Для Каждого УдаляемаяСтрокаТЧ ИЗ МассивУдаляемыхСтрокТЧ Цикл
					СпрОбъект.Состав.Удалить(УдаляемаяСтрокаТЧ);
				КонецЦикла;
				
				Если МассивУдаляемыхСтрокТЧ.Количество() > 0 Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОбъект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обработать табличную часть элемента %1 справочника %2 по причине:"
	"%3'"), 
				Выборка.Ссылка, "Справочник." + ИмяСправочника, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "Справочник." + ИмяСправочника);
	
	Результат = Новый Структура("ОбработкаЗавершена,ТекстСообщения");
	Результат.ОбработкаЗавершена = ОбработкаЗавершена;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Процедуре ОчиститьСсылкиВТЧ_3_0_21_30 не удалось обработать очередную порцию элементов (пропущены): %1'"), 
			ПроблемныхОбъектов);
		Результат.ТекстСообщения = ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			Метаданные.НайтиПоПолномуИмени("Справочник." + ИмяСправочника),,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедура ОчиститьСсылкиВТЧ_3_0_21_30 обработала очередную порцию элементов: %1'"),
				ОбъектовОбработано));
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

Функция ОчиститьСсылкиНаПрисоединенныеФайлы_3_0_21_30(Параметры)
	
	Результат = Новый Структура("ОбработкаЗавершена,ТекстСообщения", Истина);
	
	// Удаление ссылок из измерений регистров:
	ИнфоТаблица = ИнфотаблицаПрисоединенныеФайлы_3_0_21_30();
	
	Для Каждого СтрИнфоТаблица Из ИнфоТаблица Цикл
		
		ОбъектовОбработано = 0;
		ПроблемныхОбъектов = 0;
		
		ИмяОбъектаВыборки = "Справочник." + СтрИнфоТаблица.Справочник;
		
		Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ИмяОбъектаВыборки);
	
		Пока Выборка.Следующий() Цикл
			
			Попытка
				
				Для Каждого КолИнфоТаблица Из ИнфоТаблица.Колонки Цикл
				
					Если ТипЗнч(СтрИнфоТаблица[КолИнфоТаблица.Имя]) <> Тип("Структура") Тогда Продолжить; КонецЕсли;
					
					Для Каждого Измерение Из СтрИнфоТаблица[КолИнфоТаблица.Имя] Цикл
					
						НЗ = РегистрыСведений[КолИнфоТаблица.Имя].СоздатьНаборЗаписей();
						НЗ.Отбор[Измерение.Ключ].Установить(Выборка.Ссылка);
						
						НЗ.ОбменДанными.Загрузка = Истина;
						НЗ.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ", Неопределено);
						НЗ.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
						
						НЗ.Записать();
					
					КонецЦикла;
				
				КонецЦикла;
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				
				ОбъектовОбработано = ОбъектовОбработано + 1;
				
			Исключение
				
				ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не удалось обработать элемент %1 справочника %2 по причине:"
		"%3'"), 
					Выборка.Ссылка, ИмяОбъектаВыборки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
					Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстСообщения);
				
			КонецПопытки;
			
		КонецЦикла;
		
		Результат.ОбработкаЗавершена = (Результат.ОбработкаЗавершена И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ИмяОбъектаВыборки));
		
		Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедуре ОчиститьСсылкиНаПрисоединенныеФайлы_3_0_21_30 не удалось обработать очередную порцию элементов (пропущены): %1'"), 
				ПроблемныхОбъектов);
			Результат.ТекстСообщения = ТекстСообщения;
			Прервать;
		Иначе
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
				Метаданные.НайтиПоПолномуИмени(ИмяОбъектаВыборки),,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Процедура ОчиститьСсылкиНаПрисоединенныеФайлы_3_0_21_30 обработала очередную порцию элементов: %1'"),
					ОбъектовОбработано));
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат Результат;
	
КонецФункции

Функция ОчиститьСсылкиПВХ_3_0_21_30(ИмяРС, ИмяРесурса, ИмяПВХ, Параметры)
	
	ПолноеИмяРегистра     = "РегистрСведений." + ИмяРС;
	МетаданныеРегистра    = Метаданные.НайтиПоПолномуИмени(ПолноеИмяРегистра);
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь, ПолноеИмяРегистра);
	
	Обработано = 0;
	Проблемных = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений[ИмяРС].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		НаборЗаписей.Отбор.ТочкаМаршрута.Установить(Выборка.ТочкаМаршрута);
		НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
		ЭлементБлокировки.УстановитьЗначение("Объект", Выборка.Объект);
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
		ЭлементБлокировки.УстановитьЗначение("ТочкаМаршрута", Выборка.ТочкаМаршрута);
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Выборка.Идентификатор);
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				Запись = НаборЗаписей[0];
				
				Если Запись[ИмяРесурса].ТипЗначения <> Неопределено
						И (Запись[ИмяРесурса].ТипЗначения.СодержитТип(Тип("ДокументСсылка.удалитьCRM_Мероприятие"))
						ИЛИ Запись[ИмяРесурса].ТипЗначения.СодержитТип(Тип("ДокументСсылка.удалитьCRM_Планирование"))
						ИЛИ Запись[ИмяРесурса].ТипЗначения.СодержитТип(Тип("ДокументСсылка.УдалитьCRM_Сделка"))
						ИЛИ Запись[ИмяРесурса].ТипЗначения.СодержитТип(Тип("ДокументСсылка.УдалитьCRM_Событие"))) Тогда
						
					НаборЗаписей.Очистить();
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			Обработано = Обработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Проблемных = Проблемных + 1;
			СвойстваКлюча = Новый Структура("Объект, ТочкаМаршрута, Идентификатор",
				Выборка.Объект, Выборка.ТочкаМаршрута, Выборка.Идентификатор);
			КлючЗаписи = РегистрыСведений[ИмяРС].СоздатьКлючЗаписи(СвойстваКлюча);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать запись регистра
				           |%1
				           |по причине:
				           |%2'"),
				ПолучитьНавигационнуюСсылку(КлючЗаписи),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеРегистра, , 
				ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
	Результат = Новый Структура("ОбработкаЗавершена,ТекстСообщения");
	Результат.ОбработкаЗавершена = ОбработкаЗавершена;
	
	ИмяПроцедуры = "ОчиститьСсылкиПВХ_3_0_21_30";
	
	Если Обработано = 0 И Проблемных <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре %1 не удалось обработать некоторые записи (пропущены): %2'"), 
			ИмяПроцедуры,
			Проблемных);
		Результат.ТекстСообщения = ТекстСообщения;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
		УровеньЖурналаРегистрации.Информация, , ,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедура %1 обработала очередную порцию записей: %2'"),
			ИмяПроцедуры,
			Обработано));
	
	Возврат Результат;
	
КонецФункции

Функция ОчиститьСсылкиВРС_3_0_21_30(Параметры)
	
	Результат = Новый Структура("ОбработкаЗавершена,ТекстСообщения", Истина);
	
	// Удаление ссылок из измерений регистров:
	ИнфоТаблица = ИнфотаблицаРС_3_0_21_30();
	
	Для Каждого СтрИнфоТаблица Из ИнфоТаблица Цикл
		
		ОбъектовОбработано = 0;
		ПроблемныхОбъектов = 0;
		
		ИмяОбъектаВыборки = "Документ." + СтрИнфоТаблица.Документ;
		
		Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ИмяОбъектаВыборки);
	
		Пока Выборка.Следующий() Цикл
			
			Попытка
				
				Для Каждого КолИнфоТаблица Из ИнфоТаблица.Колонки Цикл
				
					Если ТипЗнч(СтрИнфоТаблица[КолИнфоТаблица.Имя]) <> Тип("Структура") Тогда Продолжить; КонецЕсли;
					
					Для Каждого Измерение Из СтрИнфоТаблица[КолИнфоТаблица.Имя] Цикл
					
						НЗ = РегистрыСведений[КолИнфоТаблица.Имя].СоздатьНаборЗаписей();
						НЗ.Отбор[Измерение.Ключ].Установить(Выборка.Ссылка);
						
						НЗ.ОбменДанными.Загрузка = Истина;
						НЗ.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ", Неопределено);
						НЗ.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
						
						НЗ.Записать();
					
					КонецЦикла;
				
				КонецЦикла;
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				
				ОбъектовОбработано = ОбъектовОбработано + 1;
				
			Исключение
				
				ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не удалось обработать документ %1 типа %2 по причине:"
		"%3'"), 
					Выборка.Ссылка, ИмяОбъектаВыборки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
					Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстСообщения);
				
			КонецПопытки;
			
		КонецЦикла;
		
		Результат.ОбработкаЗавершена = (Результат.ОбработкаЗавершена И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ИмяОбъектаВыборки));
		
		Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедуре ОчиститьСсылкиВРС_3_0_21_30 не удалось обработать очередную порцию документов (пропущены): %1'"), 
				ПроблемныхОбъектов);
			Результат.ТекстСообщения = ТекстСообщения;
			Прервать;
		Иначе
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
				Метаданные.НайтиПоПолномуИмени(ИмяОбъектаВыборки),,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Процедура ОчиститьСсылкиВРС_3_0_21_30 обработала очередную порцию документов: %1'"),
					ОбъектовОбработано));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИнфотаблицаПрисоединенныеФайлы_3_0_21_30()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Справочник");
	
	// Регистры, связанные с определяемыми типами:
	Результат.Колонки.Добавить("СертификатыШифрования"); // ПодписанныйОбъект
	Результат.Колонки.Добавить("ЭлектронныеПодписи"); // ПодписанныйОбъект
	
	Результат.Колонки.Добавить("ДвоичныеДанныеФайлов"); // ПрисоединенныйФайл
	Результат.Колонки.Добавить("КодировкиФайлов"); // ПрисоединенныйФайл
	Результат.Колонки.Добавить("ОчередьИзвлеченияТекста"); // ПрисоединенныйФайл
	Результат.Колонки.Добавить("СведенияОФайлах"); // ПрисоединенныйФайл
	Результат.Колонки.Добавить("ФайлыВРабочемКаталоге"); // ПрисоединенныйФайл
	
	НС = Результат.Добавить();
	НС.Справочник = "удалитьCRM_МероприятиеПрисоединенныеФайлы";
	НС.СертификатыШифрования = Новый Структура("ЗашифрованныйОбъект");
	НС.ЭлектронныеПодписи = Новый Структура("ПодписанныйОбъект");
	НС.ДвоичныеДанныеФайлов = Новый Структура("Файл");
	НС.КодировкиФайлов = Новый Структура("Файл");
	НС.ОчередьИзвлеченияТекста = Новый Структура("ИсточникТекста");
	НС.СведенияОФайлах = Новый Структура("Файл");
	НС.ФайлыВРабочемКаталоге = Новый Структура("Файл");
	
	
	НС = Результат.Добавить();
	НС.Справочник = "удалитьCRM_СделкаПрисоединенныеФайлы";
	НС.СертификатыШифрования = Новый Структура("ЗашифрованныйОбъект");
	НС.ЭлектронныеПодписи = Новый Структура("ПодписанныйОбъект");
	НС.ДвоичныеДанныеФайлов = Новый Структура("Файл");
	НС.КодировкиФайлов = Новый Структура("Файл");
	НС.ОчередьИзвлеченияТекста = Новый Структура("ИсточникТекста");
	НС.СведенияОФайлах = Новый Структура("Файл");
	НС.ФайлыВРабочемКаталоге = Новый Структура("Файл");
	
	
	НС = Результат.Добавить();
	НС.Справочник = "УдалитьCRM_СобытиеПрисоединенныеФайлы";
	НС.СертификатыШифрования = Новый Структура("ЗашифрованныйОбъект");
	НС.ЭлектронныеПодписи = Новый Структура("ПодписанныйОбъект");
	НС.ДвоичныеДанныеФайлов = Новый Структура("Файл");
	НС.КодировкиФайлов = Новый Структура("Файл");
	НС.ОчередьИзвлеченияТекста = Новый Структура("ИсточникТекста");
	НС.СведенияОФайлах = Новый Структура("Файл");
	НС.ФайлыВРабочемКаталоге = Новый Структура("Файл");
	
	Возврат Результат;
	
КонецФункции

Функция ИнфотаблицаРС_3_0_21_30()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Документ");
	Результат.Колонки.Добавить("CRM_ДокументыВзаимодействия");
	Результат.Колонки.Добавить("CRM_ОбъектыАРМ");
	Результат.Колонки.Добавить("CRM_СобытияКалендаря");
	Результат.Колонки.Добавить("ИсточникиПервичногоИнтереса");
	Результат.Колонки.Добавить("CRM_ЗадачиПоИсправлениюКлиентскойБазы");
	Результат.Колонки.Добавить("CRM_ИспользуемыеРешения");
	Результат.Колонки.Добавить("сфпКлючевыеСловаКонтекстнойРекламы");
	// Регистры, связанные с определяемыми типами:
	Результат.Колонки.Добавить("CRM_РабочееВремяПользователей"); // CRM_ИсточникТрудозатрат
	Результат.Колонки.Добавить("CRM_ПредметыБизнесПроцессов"); // CRM_ПроцессныеОбъекты
	Результат.Колонки.Добавить("СостоянияПредметовВзаимодействий"); // ПредметВзаимодействия
	Результат.Колонки.Добавить("НаличиеФайлов"); // ВладелецПрисоединенныхФайлов
	Результат.Колонки.Добавить("НомераОтсканированныхФайлов"); // ВладелецПрисоединенныхФайлов
	// Регистры, связанные с ПВХ:
	Результат.Колонки.Добавить("CRM_ЖурналДокументов"); // CRM_ОбъектыЖурналаДокументов
	Результат.Колонки.Добавить("CRM_ОбъектыДляРегламентногоФормированияОповещений"); // CRM_ОбъектыЖурналаДокументов	
	Результат.Колонки.Добавить("bpmУсловияМаршрутизации"); // CRM_ВидыОбъектовБизнесПроцессов
	Результат.Колонки.Добавить("bpmУсловияМаршрутизацииПоБизнесПроцессам"); // CRM_ВидыОбъектовБизнесПроцессов
	Результат.Колонки.Добавить("CRM_ОбъектыПоБизнесПроцессам"); // CRM_ВидыОбъектовБизнесПроцессов
	Результат.Колонки.Добавить("CRM_ОбъектыЭтапов"); // CRM_ВидыОбъектовБизнесПроцессов
	Результат.Колонки.Добавить("CRM_ОбъектыЭтаповБизнесПроцессов"); // CRM_ВидыОбъектовБизнесПроцессов
	Результат.Колонки.Добавить("CRM_СостоянияВоронкиПродаж"); // CRM_ВидыОбъектовБизнесПроцессов
	
	
	НС = Результат.Добавить();
	НС.Документ = "удалитьCRM_Мероприятие";
	НС.CRM_ДокументыВзаимодействия = Новый Структура("Документ");
	НС.CRM_ОбъектыАРМ = Новый Структура("Объект");
	НС.CRM_СобытияКалендаря = Новый Структура("Объект");
	НС.CRM_РабочееВремяПользователей = Новый Структура("Источник");
	НС.CRM_ПредметыБизнесПроцессов = Новый Структура("Предмет");
	НС.НаличиеФайлов = Новый Структура("ОбъектСФайлами");
	НС.НомераОтсканированныхФайлов = Новый Структура("Владелец");
	НС.CRM_ЖурналДокументов = Новый Структура("Объект");
	НС.CRM_ОбъектыДляРегламентногоФормированияОповещений = Новый Структура("Объект");
	НС.bpmУсловияМаршрутизации = Новый Структура("ТипОбъекта");
	НС.bpmУсловияМаршрутизацииПоБизнесПроцессам = Новый Структура("ТипОбъекта");
	НС.CRM_ОбъектыПоБизнесПроцессам = Новый Структура("Объект");
	НС.CRM_ОбъектыЭтапов = Новый Структура("ВидОбъекта");
	НС.CRM_ОбъектыЭтаповБизнесПроцессов = Новый Структура("ВидОбъекта");
	НС.CRM_СостоянияВоронкиПродаж = Новый Структура("Этап");
	
	НС = Результат.Добавить();
	НС.Документ = "удалитьCRM_Планирование";
	НС.CRM_ЖурналДокументов = Новый Структура("Объект");
	НС.CRM_ОбъектыДляРегламентногоФормированияОповещений = Новый Структура("Объект");
	
	НС = Результат.Добавить();
	НС.Документ = "УдалитьCRM_Сделка";
	НС.ИсточникиПервичногоИнтереса = Новый Структура("Сделка");
	НС.СостоянияПредметовВзаимодействий = Новый Структура("Предмет");
	НС.НаличиеФайлов = Новый Структура("ОбъектСФайлами");
	НС.НомераОтсканированныхФайлов = Новый Структура("Владелец");
	НС.CRM_ЖурналДокументов = Новый Структура("Объект");
	НС.CRM_ОбъектыДляРегламентногоФормированияОповещений = Новый Структура("Объект");
	НС.bpmУсловияМаршрутизации = Новый Структура("ТипОбъекта");
	НС.bpmУсловияМаршрутизацииПоБизнесПроцессам = Новый Структура("ТипОбъекта");
	НС.CRM_ОбъектыПоБизнесПроцессам = Новый Структура("Объект");
	НС.CRM_ОбъектыЭтапов = Новый Структура("ВидОбъекта");
	НС.CRM_ОбъектыЭтаповБизнесПроцессов = Новый Структура("ВидОбъекта");
	НС.CRM_СостоянияВоронкиПродаж = Новый Структура("Этап");
	
	НС = Результат.Добавить();
	НС.Документ = "УдалитьCRM_Событие";
	НС.CRM_СобытияКалендаря = Новый Структура("Объект");
	НС.ИсточникиПервичногоИнтереса = Новый Структура("Сделка");
	НС.CRM_ЗадачиПоИсправлениюКлиентскойБазы = Новый Структура("Партнер");
	НС.CRM_ИспользуемыеРешения = Новый Структура("Объект");
	НС.сфпКлючевыеСловаКонтекстнойРекламы = Новый Структура("Событие");
	НС.СостоянияПредметовВзаимодействий = Новый Структура("Предмет");
	НС.НаличиеФайлов = Новый Структура("ОбъектСФайлами");
	НС.НомераОтсканированныхФайлов = Новый Структура("Владелец");
	НС.CRM_ЖурналДокументов = Новый Структура("Объект");
	НС.CRM_ОбъектыДляРегламентногоФормированияОповещений = Новый Структура("Объект");
	НС.bpmУсловияМаршрутизации = Новый Структура("ТипОбъекта");
	НС.bpmУсловияМаршрутизацииПоБизнесПроцессам = Новый Структура("ТипОбъекта");
	НС.CRM_ОбъектыПоБизнесПроцессам = Новый Структура("Объект");
	НС.CRM_ОбъектыЭтапов = Новый Структура("ВидОбъекта");
	НС.CRM_ОбъектыЭтаповБизнесПроцессов = Новый Структура("ВидОбъекта");
	НС.CRM_СостоянияВоронкиПродаж = Новый Структура("Этап");
	
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти // Обновление_3_0_21_30

#КонецОбласти
