#Область ДоработкиСмарт

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 12.10.2020 11:03:12
Функция АдресаПолучателяИзКонтактнойИнформации(ПолучательОтправитель)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК АдресДоставки,
	|	КонтактнаяИнформация.Вид.Представление КАК Вид,
	|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
	|ИЗ
	|	Справочник." + ПолучательОтправитель.Метаданные().Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
	
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 13.05.2021 9:31:19
Функция ПолучниеИзБанка(BankOrderID=Неопределено)
    
    //++ смарт:Подкин #1053 15.06.2022 11:16:21           
    //Значение - URL подключения к банку (строка) -сервер
    //к2 - логин api (строка)
    //к3 - пароль api (строка)
    МассивНастроек=смартОбщегоНазначенияСКэш.смартПредопределенныеЗначенияКэш(Справочники.смартПредопределенныеЗначения.смартНастройкиПодключенияБанкаОнлайнЭквайринга);
    СтруктураРезультат=Новый Структура("Значение,К2,К3"); 
    Если МассивНастроек.Количество() Тогда 
        Для каждого Стр Из МассивНастроек Цикл
            ЗаполнитьЗначенияСвойств(СтруктураРезультат,Стр); 
        КонецЦикла;   
    Иначе
        Возврат Неопределено;
    КонецЕсли; 
    //-- смарт:Подкин #1053 15.06.2022 11:16:21   
    
    Соединение=Новый HTTPСоединение(СтруктураРезультат.Значение+"/",,,,,,Новый ЗащищенноеСоединениеOpenSSL);

	//ОрдерИД="299120c8-2409-7650-af0e-ddeb5e38c631";
	Запрос=Новый HTTPЗапрос("/payment/rest/getOrderStatusExtended.do?userName="+СтруктураРезультат.К2+"&password="+СтруктураРезультат.К3+
	"&orderId="+BankOrderID);
	
	Ответ = Соединение.Получить(Запрос);  
	
	Если Ответ.КодСостояния = 200 Тогда
		СтруктураОтвета = смартОбщегоНазначения.JSONВЗначение(Ответ.ПолучитьТелоКакСтроку());
		Возврат СтруктураОтвета;
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаписатьФискальнуюОперациюНаСервере(Объект,ПараметрыФискализации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Объект.Дата = ТекущаяДатаСеанса();
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить();
		ЭлементБлокировки.Область = "Документ.ОперацияПоПлатежнойКарте";
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Объект.Ссылка);
		
		НужноЗаписатьФискальнуюОперацию = Ложь;
		Если ПараметрыФискализации <> Неопределено Тогда
			//Если НЕ ПараметрыФискализации.ОперацияЗаписана Тогда
				НужноЗаписатьФискальнуюОперацию = Истина;
				Если ЗначениеЗаполнено(ПараметрыФискализации.ДокументОснование) Тогда
					ЭлементБлокировки = Блокировка.Добавить();
					ЭлементБлокировки.Область = "РегистрСведений.ФискальныеОперации";
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
					ЭлементБлокировки.УстановитьЗначение("ДокументОснование", ПараметрыФискализации.ДокументОснование);
				КонецЕсли;	
			//КонецЕсли;
		КонецЕсли;
		
		Блокировка.Заблокировать();
		
		Если НужноЗаписатьФискальнуюОперацию Тогда
			МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
		КонецЕсли;
		
		//ПараметрыЗаписи = Новый Структура;
		//ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		//ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Оперативный);
		//ПараметрыЗаписи.Вставить("РежимТранзакции", Истина);
		//
		//Результат = Записать(ПараметрыЗаписи);
		//
		ЗафиксироватьТранзакцию();
		//
		//ПараметрыЗаписи.Вставить("РежимТранзакции", Ложь);
		//ПослеЗаписиНаСервере(Объект, ПараметрыЗаписи);
		
	Исключение
		
		ОтменитьТранзакцию();
		ТребуетсяПовторнаяПопыткаЗаписи = Истина;
		Возврат Ложь;
		
	КонецПопытки;
	
	//Если Не Результат Тогда
	//	
	//	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЧекККМ));
	//	
	//	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПараметрыФискализации(Док,СтруктураВЧек) Экспорт
	
	//ПараметрыОперацииФискализацииЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ПараметрыОперацииФискализацииЧека=Новый Структура;
	ПараметрыОперацииФискализацииЧека.Вставить("ФискальныйПризнак");
	ПараметрыОперацииФискализацииЧека.Вставить("ТипДокумента");
	ПараметрыОперацииФискализацииЧека.Вставить("ТорговыйОбъект");
	ПараметрыОперацииФискализацииЧека.Вставить("НомерСменыККМ");
	ПараметрыОперацииФискализацииЧека.Вставить("НомерЧекаККМ");
	ПараметрыОперацииФискализацииЧека.Вставить("Сумма");
	ПараметрыОперацииФискализацииЧека.Вставить("ОплатаНаличные");
	ПараметрыОперацииФискализацииЧека.Вставить("ОплатаЭлектронно");
	ПараметрыОперацииФискализацииЧека.Вставить("ОплатаПостоплата");
	ПараметрыОперацииФискализацииЧека.Вставить("ОплатаПредоплата");
	ПараметрыОперацииФискализацииЧека.Вставить("ОплатаВстречноеПредоставление");
	ПараметрыОперацииФискализацииЧека.Вставить("ДополнительныйРеквизит");
	ПараметрыОперацииФискализацииЧека.Вставить("АдресСайтаПроверки");
	ПараметрыОперацииФискализацииЧека.Вставить("ЗаводскойНомерФН");
	ПараметрыОперацииФискализацииЧека.Вставить("РегистрационныйНомерККТ");
	ПараметрыОперацииФискализацииЧека.Вставить("КорректируемыйДокумент");
	ПараметрыОперацииФискализацииЧека.Вставить("СубъектПерсональныхДанных");
	ПараметрыОперацииФискализацииЧека.Вставить("ДокументОснование");
	ПараметрыОперацииФискализацииЧека.Вставить("Организация");
	ПараметрыОперацииФискализацииЧека.Вставить("ИдентификаторФискальнойЗаписи");
	ПараметрыОперацииФискализацииЧека.Вставить("ДатаВремяЧека");
	ПараметрыОперацииФискализацииЧека.Вставить("ТипРасчета");
	ПараметрыОперацииФискализацииЧека.Вставить("ДанныеЧекаXML");
	
	ПараметрыОперацииФискализацииЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	ПараметрыОперацииФискализацииЧека.ДокументОснование = Док.Ссылка;
	ПараметрыОперацииФискализацииЧека.ДатаВремяЧека = Док.Дата;
	ПараметрыОперацииФискализацииЧека.Организация		  = Док.Организация;
	ПараметрыОперацииФискализацииЧека.ФискальныйПризнак = 0000000;
	ПараметрыОперацииФискализацииЧека.ТипДокумента      = "Кассовый чек"; 
	ПараметрыОперацииФискализацииЧека.ТорговыйОбъект    = Неопределено;
	ПараметрыОперацииФискализацииЧека.НомерСменыККМ     = СтруктураВЧек.НомерСменыККМ;
	ПараметрыОперацииФискализацииЧека.НомерЧекаККМ      = СтруктураВЧек.НомерККМ;
	ПараметрыОперацииФискализацииЧека.Сумма            = Док.СуммаДокумента;
	ПараметрыОперацииФискализацииЧека.ОплатаНаличные   = 0;
	ПараметрыОперацииФискализацииЧека.ОплатаЭлектронно = Док.СуммаДокумента;
	ПараметрыОперацииФискализацииЧека.ОплатаПостоплата = 0;
	ПараметрыОперацииФискализацииЧека.ОплатаПредоплата = 0;
	ПараметрыОперацииФискализацииЧека.ОплатаВстречноеПредоставление = 0;
	ПараметрыОперацииФискализацииЧека.ДополнительныйРеквизит  = "";
	ПараметрыОперацииФискализацииЧека.АдресСайтаПроверки      = "";
	ПараметрыОперацииФискализацииЧека.ЗаводскойНомерФН        = СтруктураВЧек.ЗаводскойНомерФН;
	ПараметрыОперацииФискализацииЧека.РегистрационныйНомерККТ = СтруктураВЧек.РегистрационныйНомерККТ; 
	ПараметрыОперацииФискализацииЧека.КорректируемыйДокумент  = Неопределено;
	ПараметрыОперацииФискализацииЧека.СубъектПерсональныхДанных = Неопределено;
	ПараметрыОперацииФискализацииЧека.ДанныеЧекаXML = СтруктураВЧек.ДанныеЧекаXML;
	
	Возврат ПараметрыОперацииФискализацииЧека;
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.02.2021 10:52:53 задача 552
Процедура ОбновитьИдДокументаОффлайн(ПараметрыОбмена, НазваниеДокумента, ДокументXML, СсылкаНаДокумент = Неопределено)
	
	Если НазваниеДокумента = "ЗаказКлиента" тогда  
		
		Документ = СсылкаНаДокумент.ПолучитьОбъект();
		
		ВремТабТЧ = ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов.Скопировать();
		ВремТабТЧ.Свернуть("ТабличнаяЧасть, Документ, ПолеXML");
		
		мНастройкиДокумента	= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ДокументыЗагрузки);
		мРеквизитыДокумента = ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияШапокДокументов);
		мТабличныеЧасти		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ВремТабТЧ); 
		мРеквизитыТЧ		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов);
		
		Если мНастройкиДокумента.Количество() = 0 тогда
			
			Б_ОбменССайтомСервер.СообщитьПодробно("У документа " + НазваниеДокумента + " не найдены основные параметры документа в настройках соответствий. Загрузка документа невозможна.", ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ОсновныеНастройкиДокумента = мНастройкиДокумента[0];
		
		Для Каждого ТекРеквизит из мРеквизитыДокумента Цикл
			// Подкин убрал заполнение Комментария по просьбе Дмитрия 01.09.2021 ИЛИ ТекРеквизит.Значение="Комментарий" 
			Если НЕ ПустаяСтрока(ТекРеквизит.Значение) И (ТекРеквизит.Значение="Ид с сайта" ИЛИ ТекРеквизит.Значение="Номер с сайта" ИЛИ ТекРеквизит.Значение="Дата с сайта") тогда
				
				Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОтменен = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
		ДокументОтменен = ?((ДокументОтменен = Неопределено ИЛИ ДокументОтменен = "false"), Ложь, Истина);
		
		//Если ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить оперативно" тогда
		//	ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Истина);
		//ИначеЕсли ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить не оперативно" тогда
		//	ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Ложь);
		//Иначе
		//	лПроводитьДокумент 		= ПроверкаНаПроведениеПоДополнительнымУсловиям(ПараметрыОбмена, НазваниеДокумента, ДокументОтменен, ДокументXML, Документ);
		//	ДокументСозданИзменен 	= ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, лПроводитьДокумент, Ложь);
		//КонецЕсли;
		
		//++#1382 смарт: Лопато 11.07.2023 //Заполнение параметров заказа при самовывозе  
		Документ.смартИдБитрикс = ДокументXML.Ид;
		//--#1382 смарт: Лопато 11.07.2023
        	
		ДокументСозданИзменен=Истина;
		
		Попытка
			Документ.ОбменДанными.Загрузка=Истина;
			Документ.Записать(РежимЗаписиДокумента.Запись);	
			Б_ОбменССайтомСервер.СообщитьПодробно("Документ: " + Строка(Документ) + " записан.", ПараметрыОбмена);
		Исключение
			Б_ОбменССайтомСервер.СообщитьПодробно("НЕ УДАЛОСЬ ЗАПИСАТЬ ДОКУМЕНТ: " + Строка(Документ), ПараметрыОбмена);
			ДокументСозданИзменен = Ложь;
		КонецПопытки;
		
		Если ДокументСозданИзменен тогда 
			//++#1382 смарт: Лопато 11.07.2023 //Заполнение параметров заказа при самовывозе  
			ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, Ложь, ДокументОтменен);
			//--#1382 смарт: Лопато 11.07.2023
			 
			Если ДокументОтменен Тогда
				
				Документ.Б_НомерВерсии = ДокументXML.НомерВерсии;	
				
				Если ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Помечать на удаление" тогда
					ДействияСОтмененнымиДокументами	= 0;
				ИначеЕсли ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Отменять проведение" тогда
					ДействияСОтмененнымиДокументами	= 1;
				Иначе
					ДействияСОтмененнымиДокументами	= 3;
				КонецЕсли;
				
				Если ДействияСОтмененнымиДокументами = 3 Тогда // Ничего
					
				ИначеЕсли ДействияСОтмененнымиДокументами = 0 Тогда // Удалять
					Если НЕ Документ.ПометкаУдаления Тогда
						Документ.ПометкаУдаления = Истина;
						Попытка
							Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							Б_ОбменССайтомСервер.СообщитьПодробно("Помечен на удаление документ: " + Строка(Документ), ПараметрыОбмена);
						Исключение
							Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка при установке пометки на удаление документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
						КонецПопытки;
					КонецЕсли;
				ИначеЕсли ДействияСОтмененнымиДокументами = 1 Тогда // отменять
					Если Документ.Проведен Тогда
						Попытка
							Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							Б_ОбменССайтомСервер.СообщитьПодробно("Отменено проведение у документа: " + Строка(Документ), ПараметрыОбмена);
						Исключение
							Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка при отмене проведения документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов(), Документ.Ссылка);
			
			Если Документ.Проведен Тогда
				
				ТипОбъекта = ТипЗнч(Документ.Ссылка);
				
				Если ТипОбъекта = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") тогда
					
					Если Документ.РасшифровкаПлатежа.Количество() > 0 тогда
						лЗаказ = Документ.РасшифровкаПлатежа[0].Заказ; 
						Если ЗначениеЗаполнено(лЗаказ) тогда
							ПланыОбмена.УдалитьРегистрациюИзменений(Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов(), лЗаказ);
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
					Если ЗначениеЗаполнено(Документ.ЗаказКлиента) тогда
						ПланыОбмена.УдалитьРегистрациюИзменений(Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов(), Документ.ЗаказКлиента);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.09.2021 11:34:18
Процедура смартДозаполнениеДокументаЗаказ(Документ,ДокументXML,ПараметрыОбмена)
	
	//++#1241 смарт: Лопато 22.02.2024 //Доработать алгоритм вычисления статуса заказа для сайта.
 	Если НЕ ЗначениеЗаполнено(Документ.Подразделение) Тогда
		Документ.Подразделение = Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение;		
	КонецЕсли;	
	//--#1241 смарт: Лопато 22.02.2024
	
	//Для b2c установим дату окончания резервирования на следующий день.
	Если Документ.Контрагент=ПараметрыОбмена.КонтрагентФизлицо Тогда
		//++#1220 смарт: Лопато 14.10.2022 //Увеличить срок резерва при создании онлайн заказа  
		//Документ.смартКонечнаяДатаРезерва= Документ.Дата+86400;
		Документ.смартКонечнаяДатаРезерва = КонецДня(смартСервер.ПолучитьПрибавитьКДатеКоличествоРабочихДней(Документ.Дата, 3));
		//--#1220 смарт: Лопато 14.10.2022
	КонецЕсли; 
	
	Документ.Статус=?(ЗначениеЗаполнено(Документ.Статус),Документ.Статус,Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
	Документ.ХозяйственнаяОперация=?(ЗначениеЗаполнено(Документ.ХозяйственнаяОперация),Документ.ХозяйственнаяОперация,Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	Если Документ.Менеджер=Справочники.Пользователи.ПустаяСсылка() Тогда
		Документ.Менеджер=?(ЗначениеЗаполнено(Документ.Менеджер),Документ.Менеджер,Пользователи.ТекущийПользователь());
    КонецЕсли;
    
    Документ.Автор=?(ЗначениеЗаполнено(Документ.Автор),Документ.Автор,Пользователи.ТекущийПользователь());
    
    Документ.ПорядокОплаты=?(ЗначениеЗаполнено(Документ.ПорядокОплаты),Документ.ПорядокОплаты,Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях);
	
	ПартнерИД = ДокументXML.ЗначенияРеквизитов.Найти("Партнер");
	Если Не ПартнерИД=Неопределено И ЗначениеЗаполнено(ПартнерИД.Значение) Тогда
		Попытка
			Партнер = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(ПартнерИД.Значение));
			Если ОбщегоНазначения.СсылкаСуществует(Партнер) Тогда 
				Документ.Партнер = Партнер;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	Грузополучатель = ДокументXML.ЗначенияРеквизитов.Найти("Грузополучатель");
	Если Не Грузополучатель=Неопределено И ЗначениеЗаполнено(Грузополучатель.Значение) Тогда 
		Попытка
			Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Грузополучатель.Значение));
			Если ОбщегоНазначения.СсылкаСуществует(Контрагент) Тогда 
				Документ.Контрагент = Контрагент;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
    Документ.Соглашение=?(ЗначениеЗаполнено(Документ.Соглашение),Документ.Соглашение,Справочники.смартПредопределенныеЗначения.СоглашениеДляСайта.Значение);
    
    //++ смарт:Подкин #1079 23.06.2022 14:26:20
    //   СпособДоставки=ДокументXML.ЗначенияРеквизитов.Найти("Способ доставки");
    //Если Не СпособДоставки=Неопределено И ЗначениеЗаполнено(СпособДоставки.Значение) Тогда
    //	Попытка
    //		ПредопределенныйЭлемент=ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения."+СокрЛП(СтрЗаменить(СпособДоставки.Значение," ","")));
    //		Если ЗначениеЗаполнено(ПредопределенныйЭлемент.ВерсияДанных) Тогда 
    //			Документ.СпособДоставки=ПредопределенныйЭлемент.Значение;
    //		КонецЕсли;
    //	Исключение 
    //		Б_ОбменССайтомСервер.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена);	
    //	КонецПопытки;
    ИДСпособаДоставки=ДокументXML.ЗначенияРеквизитов.Найти("Метод доставки ИД");
    Если Не ИДСпособаДоставки=Неопределено И ЗначениеЗаполнено(ИДСпособаДоставки.Значение) Тогда
        МассивСтруктурДоставок=смартОбщегоНазначенияСКэш.смартПредопределенныеЗначенияКэш(Справочники.смартПредопределенныеЗначения.ПараметрыСпособовДоставки);    
        Если МассивСтруктурДоставок.Количество() Тогда
            Для каждого СтрДоставка Из МассивСтруктурДоставок Цикл
                Если СтрДоставка.Значение=ИДСпособаДоставки.Значение Тогда
                    Документ.СпособДоставки=СтрДоставка.К2;
                КонецЕсли;
            КонецЦикла;
        Иначе
            Б_ОбменССайтомСервер.СообщитьПодробно(ОписаниеОшибки(), ПараметрыОбмена); 
        КонецЕсли;  
        //-- смарт:Подкин #1079 23.06.2022 14:26:20
        
        Если Документ.СпособДоставки=Перечисления.СпособыДоставки.СиламиПеревозчика Тогда 
            Документ.ПеревозчикПартнер=ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения.ОсновнойКурьер").Значение;
            Документ.СпособДоставкиТовара=Перечисления.СпособДоставкиТовара.Курьер;
            Документ.ПлатильщикЗаДоставкуГруза=Перечисления.ПлатильщикиЗаДоставкуТовара.Получатель;
        ИначеЕсли Документ.СпособДоставки=Перечисления.СпособыДоставки.ДоКлиента Тогда
            Документ.СпособДоставкиТовара=Перечисления.СпособДоставкиТовара.Авто;
            Документ.ПлатильщикЗаДоставкуГруза=Перечисления.ПлатильщикиЗаДоставкуТовара.Получатель;
        КонецЕсли;
		
		//Дима сказал убрать 10.09.2021 
        //Если Не Документ.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз И Не ЗначениеЗаполнено(Документ.Склад) Тогда
        //	СкладМосква=Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Справочники.смартПредопределенныеЗначения.СкладБитрикс.Значение));
        //	Если ЗначениеЗаполнено(СкладМосква.ВерсияДанных) Тогда 
        //		Документ.Склад=СкладМосква;
        //	КонецЕсли;
        //КонецЕсли;
		
    КонецЕсли;
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.10.2020 17:05:12  Заполнение реквизитов доставки
	ТранспортнаяКомпанияИД = ДокументXML.ЗначенияРеквизитов.Найти("Транспортная компания");
	Если НЕ ТранспортнаяКомпанияИД = Неопределено И ЗначениеЗаполнено(ТранспортнаяКомпанияИД.Значение) Тогда
		Попытка
			ТранспортнаяКомпания = Справочники.СмартТранспортныеКомпанииБитрикс.ПолучитьСсылку(Новый УникальныйИдентификатор(ТранспортнаяКомпанияИД.Значение));
			Если ОбщегоНазначения.СсылкаСуществует(ТранспортнаяКомпания) Тогда
				Документ.ПеревозчикПартнер = ТранспортнаяКомпания.Партнер;	
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.ПеревозчикПартнер) И (Документ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
		ИЛИ Документ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи ИЛИ Документ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента) Тогда
		
		ТЗАдресов=АдресаПолучателяИзКонтактнойИнформации(Документ.ПеревозчикПартнер);	
		Если ТЗАдресов.Количество() Тогда
			//++#1265 смарт: Лопато 07.03.2023 //Доработать доп опции доставки при загрузке заказа из ИМ
			Документ.АдресДоставкиПеревозчика = Неопределено;
			Для Каждого АдресПеревозчика Из ТЗАдресов Цикл
				Если АдресПеревозчика.Вид = "Фактический адрес" Тогда
					Документ.АдресДоставкиПеревозчика = АдресПеревозчика.АдресДоставки;
					Документ.АдресДоставкиПеревозчикаЗначенияПолей = АдресПеревозчика.АдресДоставкиЗначенияПолей;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ЗначениеЗаполнено(Документ.АдресДоставкиПеревозчика) Тогда
				Документ.АдресДоставкиПеревозчика = ТЗАдресов[0].АдресДоставки;
				Документ.АдресДоставкиПеревозчикаЗначенияПолей = ТЗАдресов[0].АдресДоставкиЗначенияПолей;
			КонецЕсли;	
			//--#1265 смарт: Лопато 07.03.2023
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.СпособДоставкиТовараБитрикс.Значение) Тогда
			Документ.СпособДоставкиТовара= Справочники.смартПредопределенныеЗначения.СпособДоставкиТовараБитрикс.Значение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ПлательщикЗаДоставкуГрузаБитрикс.Значение) Тогда
			Документ.ПлатильщикЗаДоставкуГруза= Справочники.смартПредопределенныеЗначения.ПлательщикЗаДоставкуГрузаБитрикс.Значение;
		КонецЕсли;
		
		Попытка
			СкладМосква = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Справочники.смартПредопределенныеЗначения.СкладБитрикс.Значение));
			Если ОбщегоНазначения.СсылкаСуществует(СкладМосква) Тогда 
				Документ.Склад = СкладМосква;
			КонецЕсли;
		Исключение
		КонецПопытки;

	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 14.09.2021 14:11:26
	Если Документ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
			СкладМосква=Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Справочники.смартПредопределенныеЗначения.СкладБитрикс.Значение));
		Если ЗначениеЗаполнено(СкладМосква.ВерсияДанных) Тогда 
			Документ.Склад=СкладМосква;
		КонецЕсли;
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 14.09.2021 14:11:26
	
	Если Документ.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу")
		ИЛИ Документ.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента") Тогда
		Документ.ЗонаДоставки = смартОбщегоНазначения.смартПолучитьЗонуДоставкиМосква();
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 09.10.2020 17:05:12
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 13.10.2020 16:39:22
	НайденМетодОплаты=ДокументXML.ЗначенияРеквизитов.Найти("Метод оплаты");
	Если Не НайденМетодОплаты=Неопределено И ЗначениеЗаполнено(НайденМетодОплаты.Значение) Тогда
		Если НайденМетодОплаты.Значение="Оплата в кредит" Тогда
			//Поиск договора
			ДоговорНайден=смартОбщегоНазначения.НайтиДоговор(Документ.Организация,Документ.Партнер,Документ.Контрагент);
			ВалютаРубли=Справочники.смартПредопределенныеЗначения.ВалютаТиповаяРубБитрикс.Значение.ВалютаЦены;
			СоглНайдено=Неопределено;
			Если ДоговорНайден<>Неопределено И ЗначениеЗаполнено(ВалютаРубли) Тогда
				//Поиск индивидуального соглашения
				СоглНайдено=смартОбщегоНазначения.ПолучитьИндСоглашение(Документ.Организация,Документ.Партнер,Документ.Контрагент,ВалютаРубли);
				//Поиск типового соглашения
			КонецЕсли; 
			Если ДоговорНайден<>Неопределено И СоглНайдено=Неопределено И ЗначениеЗаполнено(ВалютаРубли) Тогда
				СоглашениеПредопредел=Справочники.смартПредопределенныеЗначения.СоглашениеДляСайтаКредитное.Значение;
				СоглНайдено=?(ЗначениеЗаполнено(СоглашениеПредопредел),СоглашениеПредопредел,Неопределено);
			КонецЕсли;
			Если СоглНайдено<>Неопределено Тогда
				Документ.Соглашение=СоглНайдено;
			КонецЕсли;   
			Если ДоговорНайден<>Неопределено Тогда
				Документ.Договор=ДоговорНайден;
			КонецЕсли; 
		Иначе
			Для каждого СтрОплата Из Документ.ЭтапыГрафикаОплаты Цикл
				СтрОплата.ВариантОплаты=Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
			КонецЦикла;
		КонецЕсли;
		
		//Заполнение ФормыОплаты
		Если  НайденМетодОплаты.Значение="Наличными при получении" Тогда
			Документ.ФормаОплаты=Перечисления.ФормыОплаты.Наличная
		ИначеЕсли  НайденМетодОплаты.Значение="Оплата картой" Тогда
			Документ.ФормаОплаты=Перечисления.ФормыОплаты.ПлатежнаяКарта;
		ИначеЕсли  НайденМетодОплаты.Значение="Банковский перевод" Тогда
			Документ.ФормаОплаты=Перечисления.ФормыОплаты.Безналичная;
		КонецЕсли; 
		
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 13.10.2020 16:39:22
	
	ДатаДоставки=ДокументXML.ЗначенияРеквизитов.Найти("Дата доставки");
	Если Не ДатаДоставки=Неопределено И ЗначениеЗаполнено(ДатаДоставки.Значение) Тогда 
		ЖелаемаяДата=смартИнтернетМагазин.ПолучитьДатуИзСтроки(ДатаДоставки.Значение,Ложь);
		Документ.ЖелаемаяДатаОтгрузки=ЖелаемаяДата;
		ТЗ=Документ.Товары.Выгрузить();
		ТЗ.ЗаполнитьЗначения(ЖелаемаяДата,"ДатаОтгрузки"); 
       	Документ.Товары.Загрузить(ТЗ);
	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 12.10.2020 16:39:54
	Для каждого СтрОплата Из Документ.ЭтапыГрафикаОплаты Цикл
		Если ЗначениеЗаполнено(Документ.ЖелаемаяДатаОтгрузки) И СтрОплата.ДатаПлатежа<>Документ.ЖелаемаяДатаОтгрузки Тогда
			Если СтрОплата.ВариантОплаты=Перечисления.ВариантыОплатыКлиентом.КредитСдвиг ИЛИ СтрОплата.ВариантОплаты=Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки Тогда
				СтрОплата.ДатаПлатежа=Документ.ЖелаемаяДатаОтгрузки;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	//Смарт }Подкин Алексей Иванович 12.10.2020 16:39:54
	
	Телефон=ДокументXML.ЗначенияРеквизитов.Найти("Телефон");
	Если Не Телефон=Неопределено И ЗначениеЗаполнено(Телефон.Значение) Тогда 
		Документ.смартТелефонКонтактногоЛица=Телефон.Значение;
		//Документ.КонтактноеЛицо=смартИнтернетМагазин.ПолучитьКонтактноеЛицоПартнераПоТелефону(Документ.Партнер,Телефон.Значение);
	КонецЕсли;
	
	//Поиск контактного по ИД сайта
	ИДконтакного=ДокументXML.ЗначенияРеквизитов.Найти("ID контактного лица");
	Если Не ИДконтакного=Неопределено И ЗначениеЗаполнено(ИДконтакного.Значение) Тогда
		Документ.КонтактноеЛицо=смартИнтернетМагазин.ПолучитьОбъектИзБазы(Новый Структура("ID",ИДконтакного.Значение),"Пользователь",Истина);
	КонецЕсли;
	
	//Фролов поиск контактного по телефону
	Если (Не ЗначениеЗаполнено(Документ.КонтактноеЛицо) ИЛИ Документ.КонтактноеЛицо=Неопределено) И Не Телефон=Неопределено И ЗначениеЗаполнено(Телефон.Значение) тогда
		Документ.КонтактноеЛицо=смартИнтернетМагазин.ПолучитьКонтактноеЛицоПартнераПоТелефону(Документ.Партнер,Телефон.Значение);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.КонтактноеЛицо) ИЛИ Документ.КонтактноеЛицо=Неопределено Тогда 
		КонтактноеЛицоИмя=ДокументXML.ЗначенияРеквизитов.Найти("Контактное лицо");
		Если Не КонтактноеЛицоИмя=Неопределено И ЗначениеЗаполнено(КонтактноеЛицоИмя.Значение) Тогда
			КонтактноеЛицо=Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(КонтактноеЛицоИмя.Значение,Истина,,Документ.Партнер);
			Документ.КонтактноеЛицо=КонтактноеЛицо;
		КонецЕсли;	
	КонецЕсли;
	
	Комментарии=ДокументXML.ЗначенияРеквизитов.Найти("Комментарии покупателя");
	Если Не Комментарии=Неопределено И ЗначениеЗаполнено(Комментарии.Значение) И Найти(Комментарии.Значение, "[Номер документа на сайте:") = 0 Тогда 
		Документ.Комментарий=Документ.Комментарий+Символы.ПС+Комментарии.Значение;
	КонецЕсли;
	
	Комментарий=ДокументXML.ЗначенияРеквизитов.Найти("Комментарий");
	Если Не Комментарий=Неопределено И ЗначениеЗаполнено(Комментарий.Значение) И Найти(Комментарий.Значение, "[Номер документа на сайте:") = 0 Тогда 
		Документ.Комментарий=Документ.Комментарий+Символы.ПС+Комментарий.Значение;
	КонецЕсли;
	
	КомментарийСрочнаяДоставка=ДокументXML.ЗначенияРеквизитов.Найти("Срочная доставка");
	Если Не КомментарийСрочнаяДоставка=Неопределено И ЗначениеЗаполнено(КомментарийСрочнаяДоставка.Значение) И Найти(Документ.Комментарий, "Срочная доставка") = 0 Тогда 
		Документ.Комментарий=Документ.Комментарий+Символы.ПС+"Срочная доставка";
	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 10.09.2020 11:05:48 заполнение видов цен в ТЧ
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата",Документ.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Документ.Валюта);
	ПараметрыЗаполнения.Вставить("Соглашение", Документ.Соглашение);
	ПараметрыЗаполнения.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
	ПараметрыЗаполнения.Вставить("ВозвращатьМногооборотнуюТару", Документ.ВернутьМногооборотнуюТару);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
	
	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("ЦенаВключаетНДС", Документ.ЦенаВключаетНДС);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ,"НалогообложениеНДС") Тогда
		СтруктураЗаполненияЦены.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураЗаполненияЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураЗаполненияЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки", "КоличествоУпаковок");
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	
	Если Документ.ЭтоНовый() Тогда //Подстановка Вида цен в товарную табличную часть
		ПродажиСервер.ЗаполнитьЦены(
		Документ.Товары,
		, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
	КонецЕсли; 
	
	ЗависисмыеРеквизиты=Новый Структура(
	"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");
	
	//++ #Б5702 смарт: Шляпников 08.06.2026 / Проект smart-t.ru. Обмен заказами. Доработка
	РекламноеВоздействие = Справочники.смартИсточникиРекламногоВоздействия.НайтиПоКоду("00000000076");
	Никто = Справочники.Пользователи.НайтиПоНаименованию("Никто");
	
	Если НЕ ЗначениеЗаполнено(Документ.СпособДоставкиТовара) Тогда
		Документ.СпособДоставкиТовара = Перечисления.СпособДоставкиТовара.Авто;
	КонецЕсли;
	
	СтоимостьДоставки = 0;
	//-- #Б5702 смарт: Шляпников 08.06.2026

	Для Каждого Тов из Документ.Товары Цикл
		
		Если Документ.ЭтоНовый() Тогда
			Тов.ВидЦены = ?(ЗначениеЗаполнено(Тов.ВидЦены), Тов.ВидЦены, Справочники.смартПредопределенныеЗначения.ВалютаТиповаяРубБитрикс.Значение);
		КонецЕсли; 
		
		Если Тов.Номенклатура.Наименование = "Доставка заказа" Тогда
			
			МассивСтрок = ДокументXML.Товары.НайтиСтроки(Новый Структура("Наименование", Тов.Номенклатура.Наименование));
			
			Если МассивСтрок.Количество() > 0 тогда
				
				Тов.Сумма = МассивСтрок[0].Сумма;	
				Тов.Цена = МассивСтрок[0].Сумма;
				Тов.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				
				СтоимостьДоставки = МассивСтрок[0].Сумма;
				
			КонецЕсли;
			
		Иначе
			
			УИДтовара = Тов.Номенклатура.УникальныйИдентификатор();
			МассивТоваров = ДокументXML.Товары.НайтиСтроки(Новый Структура("ИД", "" + УИДтовара + ""));
			Если МассивТоваров.Количество() > 0 тогда
				Тов.Сумма = МассивТоваров[0].Сумма;
			КонецЕсли;
			//ВыборкаТовара=РегистрыСведений.СмартИдентификаторыСоответствияБитрикс.Выбрать(,,Новый Структура("ГУИД",УИДтовара),); 
			
		КонецЕсли;
		
		СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Документ,Ложь);
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ);
		//
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависисмыеРеквизиты);   
		
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 26.05.2021 19:59:29 задача 539
		СтруктураДействий.Вставить("смартЗаполнитьМинМаксЦену", Новый Структура("Объект, НомерСтроки", Документ,Тов.НомерСтроки)); 
		//Смарт }Подкин Алексей Иванович 26.05.2021 19:59:29
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Тов, СтруктураДействий, Неопределено);
		
		//++ #Б5702 смарт: Шляпников 08.06.2026 / Проект smart-t.ru. Обмен заказами. Доработка
		Тов.РекламноеВоздействие = РекламноеВоздействие;
		Тов.смартКтоПередал = Никто;
		Тов.смартКтоКонсультировал = Никто;
		//-- #Б5702 смарт: Шляпников 08.06.2026

	КонецЦикла;
	
	//++ #Б5702 смарт: Шляпников 08.06.2026 / Проект smart-t.ru. Обмен заказами. Доработка
	Если НЕ ЗначениеЗаполнено(Документ.ПлатильщикЗаДоставкуГруза) Тогда
		Если СтоимостьДоставки = 0 Тогда
			Документ.ПлатильщикЗаДоставкуГруза = Перечисления.ПлатильщикиЗаДоставкуТовара.Отправитель;
		Иначе
			Документ.ПлатильщикЗаДоставкуГруза = Перечисления.ПлатильщикиЗаДоставкуТовара.Получатель;
		КонецЕсли;
	КонецЕсли;
	//-- #Б5702 смарт: Шляпников 08.06.2026
	
	//Пропускаем заполнение Обеспечения если заказ оффлайн
	ОффлайнЗаказ=ДокументXML.ЗначенияРеквизитов.Найти("Оффлайн заказ");
	// Документ.ДополнительныеСвойства.Свойство("ЭтоНовый") И Документ.ДополнительныеСвойства.ЭтоНовый Тогда//
	НеПропускатьОбеспечение=Истина;
	Если ОффлайнЗаказ <> Неопределено И (ЗначениеЗаполнено(ОффлайнЗаказ.Значение) И ОффлайнЗаказ.Значение="Y") ИЛИ (ЗначениеЗаполнено(Документ.Ссылка)) Тогда 
		НеПропускатьОбеспечение=Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.Склад) И НеПропускатьОбеспечение Тогда 
		смартИнтернетМагазин.ЗаполнитьОбеспечениеВЗаказеССайта(Документ);
	КонецЕсли;	
	//Смарт }Подкин Алексей Иванович 10.09.2020 11:05:48
	
	//{Дополнительные параметры доставки
	Обрешётка=ДокументXML.ЗначенияРеквизитов.Найти("Обрешетка");
    Тепло=ДокументXML.ЗначенияРеквизитов.Найти("Температурный режим");  
    Страховка=ДокументXML.ЗначенияРеквизитов.Найти("Страховка"); 
      
    Если Не Обрешётка = Неопределено И ЗначениеЗаполнено(Обрешётка.Значение) И Обрешётка.Значение = "Y" Тогда  
        Обрешётка = Истина; 
    Иначе
        Обрешётка = Ложь;
    КонецЕсли; 
    
    Если Не Тепло = Неопределено И ЗначениеЗаполнено(Тепло.Значение) И Тепло.Значение = "Y" Тогда   
        Тепло = Истина; 
    Иначе
        Тепло = Ложь; 
    КонецЕсли;
    
    Если Не Страховка = Неопределено И ЗначениеЗаполнено(Страховка.Значение) И Страховка.Значение = "Y" Тогда  
        Страховка = Истина;
    Иначе
        Страховка = Ложь;
    КонецЕсли;
    
    Если Обрешётка И Не Тепло И НЕ Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Обрешётка;
    ИначеЕсли Не Обрешётка И Тепло И НЕ Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Тепло;
    ИначеЕсли Не Обрешётка И НЕ Тепло И Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Страховка;
    ИначеЕсли Обрешётка И Тепло И НЕ Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Обрешётка_Тепло;
    ИначеЕсли Обрешётка И НЕ Тепло И Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Обрешетка_Страховка;
    ИначеЕсли НЕ Обрешётка И Тепло И Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Тепло_Страховка;
    ИначеЕсли Обрешётка И Тепло И Страховка Тогда
        Документ.ДополнительнаяОбработкаГрузаТранспортнойКомпанией=Перечисления.ВидыДополнительнойОбработкиГрузовТранспортнойКомпании.Обрешётка_Тепло_Страховка;
    КонецЕсли;
    
	Документ.ОсобыеУсловияПеревозкиОписание="";
	Документ.ОсобыеУсловияПеревозки=Ложь;
	Документ.ДополнительнаяИнформацияПоДоставке="";
    
    КомментарииПокупателя=ДокументXML.ЗначенияРеквизитов.Найти("Комментарии покупателя");
    Если Не КомментарииПокупателя=Неопределено И ЗначениеЗаполнено(КомментарииПокупателя.Значение) Тогда 
    	Документ.ДополнительнаяИнформацияПоДоставке=?(Документ.ДополнительнаяИнформацияПоДоставке="",КомментарииПокупателя.Значение,Документ.ОсобыеУсловияПеревозкиОписание+Символы.ПС+КомментарииПокупателя.Значение);
    КонецЕсли;

    //НеПечататьЦены=ДокументXML.ЗначенияРеквизитов.Найти("Не печатать цены");
    //Если Не НеПечататьЦены=Неопределено И ЗначениеЗаполнено(НеПечататьЦены.Значение) И НеПечататьЦены.Значение="Y" Тогда 
    //	Документ.ОсобыеУсловияПеревозки=Истина;
    //	Документ.ОсобыеУсловияПеревозкиОписание=?(Документ.ОсобыеУсловияПеревозкиОписание="","Не печатать цены",Документ.ОсобыеУсловияПеревозкиОписание+Символы.ПС+"Не печатать цены");
    //КонецЕсли;
	
    //ПаллетныйБорт=ДокументXML.ЗначенияРеквизитов.Найти("Паллетный борт");
    //Если Не ПаллетныйБорт=Неопределено И ЗначениеЗаполнено(ПаллетныйБорт.Значение) И ПаллетныйБорт.Значение="Y" Тогда 
    //	Документ.ОсобыеУсловияПеревозки=Истина;
    //	Документ.ОсобыеУсловияПеревозкиОписание=?(Документ.ОсобыеУсловияПеревозкиОписание="","Паллетный борт",Документ.ОсобыеУсловияПеревозкиОписание+Символы.ПС+"Паллетный борт");
    //КонецЕсли;
	
    //ПаллетироватьОбязательно=ДокументXML.ЗначенияРеквизитов.Найти("Паллетировать обязательно");
    //Если Не ПаллетироватьОбязательно=Неопределено И ЗначениеЗаполнено(ПаллетироватьОбязательно.Значение) И ПаллетироватьОбязательно.Значение="Y" Тогда 
    //	Документ.ОсобыеУсловияПеревозки=Истина;
    //	Документ.ОсобыеУсловияПеревозкиОписание=?(Документ.ОсобыеУсловияПеревозкиОписание="","Паллетировать обязательно",Документ.ОсобыеУсловияПеревозкиОписание+Символы.ПС+"Паллетировать обязательно");
    //КонецЕсли;
	
    //Разгрузка=ДокументXML.ЗначенияРеквизитов.Найти("Разгрузка");
    //Если Не Разгрузка=Неопределено И ЗначениеЗаполнено(Разгрузка.Значение) И Разгрузка.Значение="Y" Тогда 
    //	Документ.ОсобыеУсловияПеревозки=Истина;
    //	Документ.ОсобыеУсловияПеревозкиОписание=?(Документ.ОсобыеУсловияПеревозкиОписание="","Разгрузка",Документ.ОсобыеУсловияПеревозкиОписание+Символы.ПС+"Разгрузка");
    //КонецЕсли;
    
	ДоставкаДоДверей=ДокументXML.ЗначенияРеквизитов.Найти("Доставка до дверей");
	//++#1265 смарт: Лопато 07.03.2023 //Доработать доп опции доставки при загрузке заказа из ИМ  
	Если Не ДоставкаДоДверей = Неопределено И ЗначениеЗаполнено(ДоставкаДоДверей.Значение) Тогда
		
		НадписьДопИнформацияДоставка = "";
		
		Если ДоставкаДоДверей.Значение="Y" Тогда 

			НадписьДопИнформацияДоставка = "Доставка до дверей";
			
		ИначеЕсли ДоставкаДоДверей.Значение="N" Тогда

			Если Документ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
				ИЛИ Документ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи 
				ИЛИ Документ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда

				НадписьДопИнформацияДоставка = "Доставка до терминала ТК";
				
				ГородТК = ДокументXML.ЗначенияРеквизитов.Найти("Город доставки (транспортная компания)"); 
				Если НЕ ГородТК = Неопределено И ЗначениеЗаполнено(ГородТК.Значение) Тогда
					Документ.АдресДоставки = "Пункт выдачи в городе " + СокрЛП(ГородТК.Значение);
					НадписьДопИнформацияДоставка = НадписьДопИнформацияДоставка + Символы.ПС + " в городе " + СокрЛП(ГородТК.Значение); 
				Иначе
					Если ЗначениеЗаполнено(Документ.АдресДоставки) Тогда
						АдресПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(Документ.АдресДоставки, 
																		Перечисления.ТипыКонтактнойИнформации.Адрес);
						Документ.АдресДоставкиЗначение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(АдресПоПолям);
						Документ.АдресДоставкиЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзJSONВXML(Документ.АдресДоставкиЗначение, 
																			Перечисления.ТипыКонтактнойИнформации.Адрес);
					КонецЕсли;
				КонецЕсли;                                                         

			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НадписьДопИнформацияДоставка) И СтрНайти(Документ.ОсобыеУсловияПеревозкиОписание, НадписьДопИнформацияДоставка) = 0 Тогда
			Если ЗначениеЗаполнено(Документ.ОсобыеУсловияПеревозкиОписание) Тогда
				Документ.ОсобыеУсловияПеревозкиОписание = Документ.ОсобыеУсловияПеревозкиОписание + Символы.ПС + НадписьДопИнформацияДоставка;
			Иначе	
				Документ.ОсобыеУсловияПеревозкиОписание = НадписьДопИнформацияДоставка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

    Если Обрешётка = Истина Тогда 
		Если СтрНайти(Документ.ОсобыеУсловияПеревозкиОписание, "Обрешётка") = 0 Тогда
			Если ЗначениеЗаполнено(Документ.ОсобыеУсловияПеревозкиОписание) Тогда
				Документ.ОсобыеУсловияПеревозкиОписание = Документ.ОсобыеУсловияПеревозкиОписание + Символы.ПС + "Обрешётка";
			Иначе	
				Документ.ОсобыеУсловияПеревозкиОписание = "Обрешётка";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 

    Если Тепло = Истина Тогда 
		Если СтрНайти(Документ.ОсобыеУсловияПеревозкиОписание, "Тепло") = 0 Тогда
			Если ЗначениеЗаполнено(Документ.ОсобыеУсловияПеревозкиОписание) Тогда
				Документ.ОсобыеУсловияПеревозкиОписание = Документ.ОсобыеУсловияПеревозкиОписание + Символы.ПС + "Тепло";
			Иначе	
				Документ.ОсобыеУсловияПеревозкиОписание = "Тепло";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 

    Если Страховка = Истина Тогда 
		Если СтрНайти(Документ.ОсобыеУсловияПеревозкиОписание, "Страховка") = 0 Тогда
			Если ЗначениеЗаполнено(Документ.ОсобыеУсловияПеревозкиОписание) Тогда
				Документ.ОсобыеУсловияПеревозкиОписание = Документ.ОсобыеУсловияПеревозкиОписание + Символы.ПС + "Страховка";
			Иначе	
				Документ.ОсобыеУсловияПеревозкиОписание = "Страховка";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 

	Документ.ОсобыеУсловияПеревозки = ЗначениеЗаполнено(Документ.ОсобыеУсловияПеревозкиОписание);
	//--#1265 смарт: Лопато 07.03.2023

	//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
	Если Документ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз 
	 ИЛИ Документ.СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда
	 
		Если НЕ ЗначениеЗаполнено(Документ.АдресДоставки) Тогда 
			
			СтруктураНовыйАдресДоставки = смартОбщегоНазначения.смартПолучитьАдресСклада(Документ.Склад, Документ.Товары, Документ.АдресДоставки, Документ.СпособДоставки);
		
			//++#1578 смарт: Лопато 15.12.2023 //Ошибка в заказе клиента при изменении адреса доставки  
			Документ.АдресДоставки 			    = СтруктураНовыйАдресДоставки.АдресДоставки;
			Документ.АдресДоставкиЗначение 	    = СтруктураНовыйАдресДоставки.АдресДоставкиЗначение; 
			Документ.АдресДоставкиЗначенияПолей = СтруктураНовыйАдресДоставки.АдресДоставкиЗначенияПолей;
            //--#1578 смарт: Лопато 15.12.2023
			
		КонецЕсли;
		
	КонецЕсли;	
	//--#1382 смарт: Лопато 21.06.2023
	
    //}
    Документ.ДополнительныеСвойства.Вставить("ЭтоНовыйБитрикс",Истина);
	Документ.смартИдБитрикс=ДокументXML.Ид;
	
	//++ #Б6022 смарт: Шляпников 17.03.2026 / Проект smart-t.ru. Обмен заказами. Выгрузка группы склада, вместо элемента
	Для каждого стрТовары Из Документ.Товары Цикл
		
		Если (ЗначениеЗаполнено(стрТовары.Склад) И стрТовары.Склад.ЭтоГруппа) Тогда
			стрТовары.Склад = ПолучитьСкладДляНоменклатуры(стрТовары.Склад, стрТовары.Номенклатура, стрТовары.Характеристика);
		ИначеЕсли Документ.Склад.ЭтоГруппа И НЕ ЗначениеЗаполнено(стрТовары.Склад)  Тогда
			стрТовары.Склад = ПолучитьСкладДляНоменклатуры(Документ.Склад, стрТовары.Номенклатура, стрТовары.Характеристика);
		КонецЕсли;
		
	КонецЦикла;
	//-- #Б6022 смарт: Шляпников 17.03.2026
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.09.2021 13:08:44
Процедура смартДозаполнениеДокументаОпПоПлКарте(Документ,ДокументXML,ПараметрыОбмена)
	
	//++ смарт:Подкин #1053 15.06.2022 11:16:21           
    //Значение - TerminalID (строка);
    //к2 - Справочник.ЭквайринговыеТерминалы.Ссылка.
    СоответствиеТерминалов=смартОбщегоНазначенияСКэш.смартПредопределенныеЗначенияКэш(Справочники.смартПредопределенныеЗначения.смартСоответствиеОнлайнТерминалаЭквайрингаИ1С);
    ТзТерминалов=Новый ТаблицаЗначений;
    Если СоответствиеТерминалов.Количество() Тогда
        ТзТерминалов=смартИнтернетМагазин.ПреобразоватьМассивВТаблицуЗначений(СоответствиеТерминалов);	
    КонецЕсли;
    Терминал1с=Неопределено;
    //-- смарт:Подкин #1053 15.06.2022 11:16:21 
    
	СтруктураВЧек=Новый Структура;
	BankOrderID=ДокументXML.ЗначенияРеквизитов.Найти("BankOrderID");
	Если Не BankOrderID=Неопределено И ЗначениеЗаполнено(BankOrderID.Значение) Тогда 
		СтруктураВЧек.Вставить("BankOrderID",BankOrderID.Значение);
		ОтветБанка=ПолучниеИзБанка(BankOrderID.Значение);
		Если НЕ ОтветБанка=Неопределено Тогда
            Если ЗначениеЗаполнено(ОтветБанка.TerminalID) Тогда
                
                //++ смарт:Подкин #1053 15.06.2022 11:47:31
                Если ТзТерминалов.Количество() Тогда
                	 СтруктураОтбора=Новый Структура("Значение",ОтветБанка.TerminalID);
                     МассивНайденных=ТзТерминалов.НайтиСтроки(СтруктураОтбора);
                     Если МассивНайденных.Количество() Тогда
                     	 Терминал1с=МассивНайденных[0].к2;
                     КонецЕсли;
                КонецЕсли;
                
                //Если Не ЗначениеЗаполнено(Терминал1с) Тогда
                //    Терминал1с=Справочники.ЭквайринговыеТерминалы.НайтиПоКоду(ОтветБанка.TerminalID);
                //КонецЕсли;
				//-- смарт:Подкин #1053 15.06.2022 11:47:31 
                
				Если Не ЗначениеЗаполнено(Терминал1с) Тогда
					ЗаписьЖурналаРегистрации("Не найдет платежный терминал",УровеньЖурналаРегистрации.Ошибка,Документ,,"Не найден платежный терминал по номеру: "+ОтветБанка.TerminalID,);
				иначе
					Документ.ЭквайринговыйТерминал=Терминал1с;	
				КонецЕсли; 
			КонецЕсли; 
			Если ОтветБанка.cardAuthInfo.Свойство("pan") Тогда
				Документ.НомерПлатежнойКарты=ОтветБанка.cardAuthInfo.pan;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	ДанныеЧека=ДокументXML.ЗначенияРеквизитов.Найти("Данные чека"); 
    СтруктураВЧек.Вставить("ДанныеЧекаXML","");
    СтруктураВЧек.Вставить("НомерККМ","");
    СтруктураВЧек.Вставить("РегистрационныйНомерККТ","");
    СтруктураВЧек.Вставить("НомерСменыККМ","");
    СтруктураВЧек.Вставить("ЗаводскойНомерФН","");
            
	Если Не ДанныеЧека=Неопределено И ЗначениеЗаполнено(ДанныеЧека.Значение) Тогда
		СтруктураВЧек.Вставить("ДанныеЧекаXML",ДанныеЧека.Значение);
		
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ДанныеЧека.Значение);
		Фабрика = Новый ФабрикаXDTO();
		ОбъектXDTO =  Фабрика.ПрочитатьXML(ЧтениеXML);
		Попытка
			СтруктураВЧек.Вставить("НомерККМ",ОбъектXDTO.fiscal_doc_number);
			СтруктураВЧек.Вставить("РегистрационныйНомерККТ",ОбъектXDTO.reg_number_kkt);
			СтруктураВЧек.Вставить("НомерСменыККМ",ОбъектXDTO.shift_number);
			СтруктураВЧек.Вставить("ЗаводскойНомерФН",ОбъектXDTO.fn_number);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	
	Если Документ.Ответственный=Справочники.Пользователи.ПустаяСсылка() ИЛИ Документ.Ответственный=Неопределено Тогда
		Документ.Ответственный=Пользователи.ТекущийПользователь();
	КонецЕсли; 
	
	Для каждого Стр Из Документ.РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(Стр.ОснованиеПлатежа) и ЗначениеЗаполнено(Стр.ОснованиеПлатежа.Контрагент) и ЗначениеЗаполнено(Стр.ОснованиеПлатежа.Партнер) Тогда
			Документ.Партнер=Стр.ОснованиеПлатежа.Партнер;
			Документ.Контрагент=Стр.ОснованиеПлатежа.Контрагент;
			Стр.Партнер=Стр.ОснованиеПлатежа.Партнер;	
		КонецЕсли; 
	КонецЦикла; 
	
	//Запись фискальной операции
	Если Документ.ЭтоНовый() Тогда
		ПараметрыФискализации=ПолучитьПараметрыФискализации(Документ,СтруктураВЧек);
		Результат=ЗаписатьФискальнуюОперациюНаСервере(Документ,ПараметрыФискализации);
	КонецЕсли;
	
КонецПроцедуры

//++ #Б6022 смарт: Шляпников 17.03.2026 / Проект smart-t.ru. Обмен заказами. Выгрузка группы склада, вместо элемента
Функция ПолучитьСкладДляНоменклатуры(СкладГруппа, Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкладысмартСкладыОстатковДляСайта.Склад КАК Склад
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады.смартСкладыОстатковДляСайта КАК СкладысмартСкладыОстатковДляСайта
	|ГДЕ
	|	СкладысмартСкладыОстатковДляСайта.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвободныеОстаткиОстатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад В
	|					(ВЫБРАТЬ
	|						Т.Склад
	|					ИЗ
	|						ВТСклады КАК Т)) КАК СвободныеОстаткиОстатки
	|ГДЕ
	|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток - СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток > 0";
	
	Запрос.УстановитьПараметр("Ссылка", СкладГруппа);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Склад <> NULL Тогда
		Возврат Выборка.Склад;
	КонецЕсли;
	
	Если СкладГруппа.смартСкладыОстатковДляСайта.Количество() > 0 Тогда
		Возврат СкладГруппа.смартСкладыОстатковДляСайта[0].Склад;
	КонецЕсли;
	
	Возврат СкладГруппа;
	
КонецФункции
	
#КонецОбласти

#Область ПеренесеноСДоработками

//++ #1993 смарт: Лопато 02.09.2024 //Обработка онлайн заказов (переделка)
&ИзменениеИКонтроль("ПолучитьЗначениеРеквизитаДокументаПоСоответствию")
Функция смарт_ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекущийРеквизит, СтрокаXML, СтрокаТабличнойЧасти, СтрараяТабличнаяЧасть)
	
	Если СтрокаТабличнойЧасти = Неопределено тогда
		лРеквизит = Документ.Метаданные().Реквизиты.Найти(ТекущийРеквизит.НаименованиеРеквизита1С);
	Иначе
		лРеквизит = Метаданные.НайтиПоТипу(Тип(СтрокаТабличнойЧасти)).Реквизиты.Найти(ТекущийРеквизит.НаименованиеРеквизита1С);	
	КонецЕсли;
	
	Если лРеквизит = Неопределено тогда
		
		Массив = Новый Массив;
		Если СтрокаТабличнойЧасти = Неопределено тогда
			Массив.Добавить(ТипЗнч(Документ[ТекущийРеквизит.НаименованиеРеквизита1С]));
		Иначе
			Массив.Добавить(ТипЗнч(СтрокаТабличнойЧасти[ТекущийРеквизит.НаименованиеРеквизита1С]));
		КонецЕсли;  
		лТипРеквизита = Новый ОписаниеТипов(Массив);
		
	Иначе
		
		лТипРеквизита = лРеквизит.Тип;
		
	КонецЕсли;
	
	мПростыеТипы = Новый Массив;
	мПростыеТипы.Добавить(Тип("Строка"));	
	мПростыеТипы.Добавить(Тип("Число"));	
	мПростыеТипы.Добавить(Тип("Булево"));	
	мПростыеТипы.Добавить(Тип("Дата"));	
	
	Результат = Неопределено;
	
	Если ТекущийРеквизит.ТипДанных = "Из поля XML документа" тогда
		
		Если ТекущийРеквизит.Значение = "Дата с сайта с учетом настройки обмена" тогда
			
			ДатаДокументаНаСайте 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);
			
			Если ОсновныеНастройкиДокумента.ДатаДокументов = "Текущая дата" тогда
				Результат = ТекущаяДатаСеанса();
			Иначе
				Результат = ДатаДокументаНаСайте;
			КонецЕсли;
			
			
		ИначеЕсли ТекущийРеквизит.Значение = "Дата отгрузки" тогда
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаОтгрузки) тогда
				Результат = СтрокаТабличнойЧасти.ДатаОтгрузки;	
			Иначе
				
				ДатаДокументаНаСайте 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);
				
				Если ОсновныеНастройкиДокумента.ДатаДокументов = "Текущая дата" тогда
					Результат = ТекущаяДатаСеанса();
				Иначе
					Результат = ДатаДокументаНаСайте;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Дата с сайта" тогда
			
			Результат 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Дата 1С" тогда
			
			Результат =  ТекущаяДатаСеанса();
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номер с сайта" тогда
			
			Результат =  ДокументXML.Номер;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Ид с сайта" тогда
			
			Результат =  ДокументXML.Ид;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номер 1С" тогда
			
			Результат = ДокументXML.Номер1С;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номер версии с сайта" тогда
			
			Результат = ДокументXML.НомерВерсии;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Пометка удаления" тогда
	
			Результат = ДокументXML.ПометкаУдаления;	
	
		ИначеЕсли ТекущийРеквизит.Значение = "Комментарий" тогда
			
			Результат = ФормированиеКомментарияДокумента(ДокументXML.Номер,  ДокументXML.Комментарий);	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Склад" тогда
			
			Результат = ПолучитьСклад(ПараметрыОбмена, Документ, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Статус" тогда
			
			Результат = ПолучитьСтатусДокумента(ПараметрыОбмена, Документ, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Способ доставки" тогда
			
			Результат = ПолучитьСпособДоставки(ПараметрыОбмена, Документ, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Перевозчик" тогда
			
			Результат = ПолучитьПеревозчика(ПараметрыОбмена, Документ, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Налогообложение НДС" тогда
			
			Результат = ЗначениеНастроекПовтИсп.НалогообложениеНДС(Документ.Организация, Документ.Склад, Документ.Договор, Документ.НаправлениеДеятельности, Документ.Дата)			
			
		ИначеЕсли ТекущийРеквизит.Значение = "Цена включает НДС" тогда
			
			Результат = ДокументXML.НДСВСумме;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Валюта" тогда
			
			Результат = ДокументXML.Валюта	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Контрагент" тогда
			
			Результат = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Партнер" тогда
			
			Контрагент = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);
			
			Если Контрагент <> неопределено  тогда
				Результат = Контрагент.Партнер;
			Иначе
				Результат = Справочники.Партнеры.ПустаяСсылка();	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Соглашение" тогда
			
			Результат = ПолучитьСоглашение(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки" тогда
			
			Если ДокументXML.ХозОперация = "Заказ товара" И ДокументXML.Контрагент.Контакты <> Неопределено тогда
				
				Для Каждого ТекАдрес из ДокументXML.Контрагент.Контакты Цикл
					
					Если ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента или ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресПартнера тогда
						
						Результат 	= ТекАдрес.Представление;
						
					КонецЕсли;
					
				КонецЦикла;
			
			Иначе
				Результат = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Адрес доставки");
			Конецесли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки значения полей" тогда
			
			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
			
				Для Каждого ТекАдрес из ДокументXML.Контрагент.Контакты Цикл
					
					Если ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента тогда
						
						Результат = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекАдрес.Представление, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, ""); 						
						
					ИначеЕсли ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресПартнера тогда
						
						Результат = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекАдрес.Представление, Справочники.ВидыКонтактнойИнформации.АдресПартнера, ""); 						
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки перевозчика" тогда
			
			Результат =  "";	
			
			Если Документ.метаданные().Реквизиты.Найти("ПеревозчикПартнер") <> Неопределено тогда
			
				Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
					
					НайденныйАдрес = Документ.ПеревозчикПартнер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресПартнера);
					
					Если НайденныйАдрес <> Неопределено тогда 
						Результат =  (НайденныйАдрес.Представление);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
				
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес контрагента" тогда
			
			Результат =  "";	
			
			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
				
				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, "ТипВидКонтактнойИнформации");
				
				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  (НайденныйАдрес.Представление);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Телефон контрагента" тогда
			
			Результат =  "";	
			
			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
				
				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти("Телефон", "ТипВидКонтактнойИнформации");
				
				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  НайденныйАдрес.Представление;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Адрес эл. почты контрагента" тогда
			
			Результат =  "";	
			
			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда
				
				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти("Почта", "ТипВидКонтактнойИнформации");
				
				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  НайденныйАдрес.Представление;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Полное наименование контрагента" тогда
			
			Результат =  ?(ЗначениеЗаполнено(ДокументXML.Контрагент.НаименованиеПолное), ДокументXML.Контрагент.НаименованиеПолное, ДокументXML.Контрагент.Наименование);	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Банковский счет" тогда
			
			Результат = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
			
			ВремСтруктДанных = Новый Структура;
			ВремСтруктДанных.Вставить("Организация"		, Документ.Организация);
			ВремСтруктДанных.Вставить("ФормаОплаты"		, Перечисления.ФормыОплаты.Безналичная);
			ВремСтруктДанных.Вставить("БанковскийСчет"	, Неопределено);
			ВремСтруктДанных.Вставить("Валюта"			, ДокументXML.Валюта);
			ВремСтруктДанных.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
			
			Если Документ.Метаданные().Реквизиты.Найти("БанковскийСчет") <> Неопределено тогда
				ВремСтруктДанных.БанковскийСчет = Документ.БанковскийСчет; 	
				Результат = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ВремСтруктДанных);	
			ИначеЕсли Документ.Метаданные().Реквизиты.Найти("БанковскийСчетОрганизации") <> Неопределено тогда
				ВремСтруктДанных.БанковскийСчет = Документ.БанковскийСчетОрганизации; 	
				Результат = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ВремСтруктДанных);			
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Банковский счет контрагента" тогда
			
			Контрагент = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);
			
			Результат = ПолучитьбанковскийСчетДляДокумента(ДокументXML, Контрагент);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Касса" тогда
			
			Результат = Справочники.Кассы.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");
				
			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;
				
			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда
					
				НайденнаяСтрока = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(ИдОплаты, "ИдПлатежнойСистемы");
				Если НайденнаяСтрока = Неопределено тогда
					Результат = Справочники.Кассы.ПустаяСсылка();
				Иначе
					Результат = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(ИдОплаты, "ИдПлатежнойСистемы").Касса;
				КонецЕсли;
			КонецЕсли;
				
			Если НЕ ЗначениеЗаполнено(Результат) тогда
				Результат = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию()
			КонецЕсли;
			
			
		ИначеЕсли ТекущийРеквизит.Значение = "Эквайринговый терминал" тогда
			
			Результат = Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");
				
			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;
				
			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда
					
				НайденнаяСтрока = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(ИдОплаты, "ИдПлатежнойСистемы");
				Если НайденнаяСтрока = Неопределено тогда
					Результат = Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
				Иначе
					Результат = НайденнаяСтрока.Терминал;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Форма оплаты" тогда
			
			Результат = Документ.Соглашение.ФормаОплаты;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Основание" тогда
			
			Результат = ПолучитьОснование(ДокументXML, лТипРеквизита);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Реализация по заказам" тогда
			
			Основание = ПолучитьОснование(ДокументXML, лТипРеквизита);
			
			Если Основание <> Неопределено тогда
				Результат = Истина;
			Иначе
				Результат = Ложь;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Менеджер" тогда
			Если Документ.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено тогда
				Результат = Документ.Соглашение.Менеджер;
			Иначе
				Результат = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли ТекущийРеквизит.Значение = "Приоритет" тогда
			
			Результат = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
			
		ИначеЕсли ТекущийРеквизит.Значение = "Операция" тогда
			
			Если Документ.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено тогда
				Результат = Документ.Соглашение.ХозяйственнаяОперация;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "График оплаты" тогда
			
			Результат = Документ.Соглашение.ГрафикОплаты;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Дата платежа" тогда
			
			ДатаОплаты			= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Дата оплаты");
			
			Если НЕ ДатаОплаты 	= Неопределено тогда
				
				Попытка
					ДатаОплаты 				= Дата(ДатаОплаты);
					Результат   			= ДатаОплаты;
				Исключение
					Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось получить дату оплаты для документа: " + Документ.Номер, ПараметрыОбмена);
				КонецПопытки
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма" тогда
			
			Если ДокументXML.ХозОперация = "Отпуск товара" тогда
				СуммаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Сумма доставки");
				Результат = ДокументXML.Сумма - Число(?(ЗначениеЗаполнено(СуммаДоставки),СуммаДоставки,0));	
			Иначе
				Результат = ДокументXML.Сумма;
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Курс" тогда
			
			Результат = ДокументXML.Курс;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Кратность" тогда
			
			Результат = 1;
			
		ИначеЕсли ТекущийРеквизит.Значение = "НДС в сумме" тогда
			
			Результат = ДокументXML.НДСВСумме;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма НДС" тогда
			
			Результат = ДокументXML.СуммаНДС;
			
		ИначеЕсли ТекущийРеквизит.Документ <> "ЗаказКлиента" И ТекущийРеквизит.Значение = "Объект расчетов" тогда
			
			Заказ = ПолучитьОснование(ДокументXML, лТипРеквизита);
			Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ОбъектРасчетов");
			
		ИначеЕсли ТекущийРеквизит.Значение = "Номенклатура" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
			
			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("В документе: " + Строка(Документ) + " не найдена/создана номенклатура. ", ПараметрыОбмена);
				Результат = Справочники.Номенклатура.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.Номенклатура;	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Наименование номенклатуры" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
			
			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Результат = "";	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.Номенклатура.Наименование;	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Содержание" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
			
			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Результат = "";	
			Иначе
				
				Если СтрИнформацииОНоменклатуре.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда
					Результат = СтрИнформацииОНоменклатуре.Номенклатура.Наименование;
				Иначе
					Результат = "";	
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Характеристика" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
		
			Если СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры = Неопределено тогда
				Результат = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры;	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Единица измерения" тогда
			
			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
		
			Если СтрИнформацииОНоменклатуре.ЕдиницаИзмерения = Неопределено тогда
				Результат = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.ЕдиницаИзмерения;	
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Ставка НДС" тогда
				
			Если ЗначениеЗаполнено(СтрокаXML.СтавкаНДСТовара) Тогда
				Результат = СтрокаXML.СтавкаНДСТовара;
			Иначе
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
					Результат = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Количество" тогда
			
			Результат = СтрокаXML.Количество;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Количество упаковок" тогда
			
			Результат = СтрокаXML.Количество;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Цена" тогда
			
			Если СтрокаXML.Количество = 0 тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("У документа: " + Документ.Номер + " есть позиция, с 0 количеством. Цена будет установлена 0", ПараметрыОбмена);
				Возврат 0;
			КонецЕсли;
			
			Если НЕ ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе тогда
			
				Результат = 0;	
					
				Если ЗначениеЗаполнено(СтрокаXML.Цена) Тогда
					Результат = СтрокаXML.Цена;
				КонецЕсли;
				
				Если Результат = 0 Тогда
					Результат = СтрокаXML.Сумма / СтрокаXML.Количество;
				КонецЕсли;
			Иначе	
				
				ЦенаДоСкидки =  СтрокаXML.Сумма/СтрокаXML.Количество;
				
				лСкидка = 0;
				Если СтрокаXML.Скидки <> Неопределено тогда
					лСкидка = СтрокаXML.Скидки.Итог("Сумма");	
				КонецЕсли;
				
				Результат = ЦенаДоСкидки + лСкидка;
				
			КонецЕсли;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Процент ручной скидки" тогда
			
			Если НЕ ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе тогда
			
				Результат = 0;
				
			Иначе	
			
				Если СтрокаXML.Количество = 0 тогда
					Возврат 0;
				КонецЕсли;
			
				ЦенаДоСкидки =  СтрокаXML.Сумма/СтрокаXML.Количество;
				
				Если ЦенаДоСкидки = 0 тогда
					Б_ОбменССайтомСервер.СообщитьПодробно("У документа: " + Документ.Номер + " есть позиция с суммой без скидок = 0. Скидка будет установлена = 0", ПараметрыОбмена);
					Возврат 0;
				КонецЕсли;
				
				лСкидка = 0;
				Если СтрокаXML.Скидки <> Неопределено тогда
					лСкидка = СтрокаXML.Скидки.Итог("Сумма");	
				КонецЕсли;
				
				Результат = лСкидка*100/(ЦенаДоСкидки+лСкидка);
				
			КонецЕсли;	
			
		ИначеЕсли ТекущийРеквизит.Значение = "Сумма позиции" тогда
			
			Результат = СтрокаXML.Сумма;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Вариант обеспечения" тогда
			
			Результат = Неопределено;
			
			Если СтрараяТабличнаяЧасть <> Неопределено тогда
				
				СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);
				
				Для Каждого ТекЭлементТЧ из СтрараяТабличнаяЧасть Цикл
					Если ТекЭлементТЧ.КодСтроки = СтрокаXML.КодСтроки И ТекЭлементТЧ.Номенклатура = СтрИнформацииОНоменклатуре.Номенклатура тогда
						Результат	= ТекЭлементТЧ.ВариантОбеспечения;	
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если Результат = Неопределено Тогда
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрИнформацииОНоменклатуре.Номенклатура, "ТипНоменклатуры") = Перечисления.ТипыНоменклатуры.Услуга тогда
					Результат	= Перечисления.ВариантыОбеспечения.НеТребуется;
				Иначе
					#Удаление
					Результат 	= Перечисления.ВариантыОбеспечения.КОбеспечению;
					#КонецУдаления
					#Вставка
					//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет" 
					Результат 	= Перечисления.ВариантыОбеспечения.Требуется;
					//-- #Б3686 смарт: Шляпников 03.07.2025
					#КонецВставки
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Отменено" тогда
			
			Отменен 	= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
			Результат   = ?((Отменен = Неопределено ИЛИ Отменен = "false"), Ложь, Истина);
			
		ИначеЕсли ТекущийРеквизит.Значение = "Причина отмены" тогда
			
			ЗаказОтменен 	= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
			ЗаказОтменен    = ?((ЗаказОтменен = Неопределено ИЛИ ЗаказОтменен = "false"), Ложь, Истина);
		
			Если ЗаказОтменен тогда
				
				#Удаление //++ #1993 смарт: Лопато 02.09.2024 //Обработка онлайн заказов (переделка)
				ПричинаОтменыНаименование 	= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Причина отмены"); 
				Если Б_ОбменССайтомСервер.СвойствоXDTOЗаполнено(ПричинаОтменыНаименование) тогда
					Результат				= ПолучитьЗначениеПричиныОтменыЗаказа(ПричинаОтменыНаименование);
				Иначе
					
					Б_ОбменССайтомСервер.СообщитьПодробно("В документе: " + Строка(Документ) + " не найдена причина отмена заказа по наименованию. Будет установлена из настроек обмена.", ПараметрыОбмена);
					Результат				= ПараметрыОбмена.ПричинаОтменыЗаказа;
					
				КонецЕсли;
				#КонецУдаления
				#Вставка
				Результат				= ПараметрыОбмена.ПричинаОтменыЗаказа;
				#КонецВставки
				
			КонецЕсли;
			
		ИначеЕсли ТекущийРеквизит.Значение = "Код строки" тогда
			Результат = СтрокаXML.КодСтроки;	 		
		КонецЕсли;
		
	ИначеЕсли ТекущийРеквизит.ТипДанных = "Фиксированное значение" тогда
		
		Если ТекущийРеквизит.НаименованиеРеквизита1С = "Соглашение" тогда
			Если Документ.Контрагент = ПараметрыОбмена.КонтрагентФизлицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) И ЗначениеЗаполнено(ПараметрыОбмена.СоглашениеКонтрагентаФизлицо) тогда	
				Результат = ПараметрыОбмена.СоглашениеКонтрагентаФизлицо; 
			Иначе
				Результат = ТекущийРеквизит.Значение;	
			КонецЕсли;
		Иначе
			Результат = ТекущийРеквизит.Значение;	
		КонецЕсли;
		
	ИначеЕсли ТекущийРеквизит.ТипДанных = "Из дополнительных свойств документа (по наименованию)" тогда
		
		лЗначениеДопСвойства = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, ТекущийРеквизит.Значение);
		
		Если НЕ ЗначениеЗаполнено(лЗначениеДопСвойства) тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого ТекТип из лТипРеквизита.Типы() Цикл
		
			Если мПростыеТипы.Найти(ТекТип) = Неопределено тогда
				
		    	лОбъект = Метаданные.НайтиПоТипу(ТекТип);
				
				Если лОбъект <> Неопределено тогда
				
					лПолноеИмяОбъектаПоиска = лОбъект.ПолноеИмя();
					
					Если Лев(лПолноеИмяОбъектаПоиска, 3) = "Пер" тогда
						
						Для каждого ТекЗначение из лОбъект.ЗначенияПеречисления Цикл
							
							Если ТекЗначение.Синоним = лЗначениеДопСвойства тогда
								
								Результат = Перечисления[лОбъект.Имя][ТекЗначение.Имя];
								
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;
						
					ИначеЕсли Лев(лПолноеИмяОбъектаПоиска, 3) = "Док" тогда
						
						Результат = Документы[лОбъект.Имя].НайтиПоНомеру(лЗначениеДопСвойства, ТекущаяДатаСеанса());
								
						Прервать;
						
					ИначеЕсли Лев(лПолноеИмяОбъектаПоиска, 3) = "Спр" тогда
						
						Если лОбъект.Имя = "СоглашенияСКлиентами" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.СоглашениеКонтрагентаФизлицо) тогда	
							Возврат ПараметрыОбмена.СоглашениеКонтрагентаФизлицо; 	
						КонецЕсли;
						
						Если лОбъект.Имя = "Контрагент" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) тогда	
							Возврат ПараметрыОбмена.КонтрагентФизлицо; 	
						КонецЕсли;
						
						Если лОбъект.Имя = "Партнер" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) тогда	
							Возврат ПараметрыОбмена.СоглашениеКонтрагентаФизлицо.Партнер; 	
						КонецЕсли;
						
						Результат = Справочники[лОбъект.Имя].НайтиПоНаименованию(лЗначениеДопСвойства);
						
						Если ЗначениеЗаполнено(Результат) тогда
							Возврат Результат; 
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Результат = лЗначениеДопСвойства;

				КонецЕсли;
				
		  Иначе
				
				Попытка 
					Результат = XMLЗначение(ТекТип, лЗначениеДопСвойства);    
				Исключение 
					Результат = ""; 
				КонецПопытки ; 	  
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;			
			
	ИначеЕсли ТекущийРеквизит.ТипДанных = "Из дополнительных свойств документа (по ид)" тогда
		
		лЗначениеДопСвойства = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, ТекущийРеквизит.Значение);
		
		Если НЕ ЗначениеЗаполнено(лЗначениеДопСвойства) тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого ТекТип из лТипРеквизита.Типы() Цикл
			
			Попытка
				
				Результат =	XMLЗначение(ТекТип, лЗначениеДопСвойства);	
				
				Прервать;
				
			Исключение
				
			КонецПопытки
	
		КонецЦикла;
		
	ИначеЕсли ТекущийРеквизит.ТипДанных = "<Свой алгоритм>" тогда
		
		лИтоговоеНазваниеПоля = ТекущийРеквизит.Значение;	
		
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Документ]"		, "Документ");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Результат]"		, "Результат");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[НоваяСтрока]"		, "СтрокаТабличнойЧасти");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[ПараметрыОбмена]"	, "ПараметрыОбмена");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[ДокументXML]"		, "ДокументXML");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[СтрокаXML]"		, "СтрокаXML");
		
		Если ЗначениеЗаполнено(лИтоговоеНазваниеПоля) тогда
			Выполнить(лИтоговоеНазваниеПоля);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

//++ #2032 смарт: Шляпников 24.09.2024 / Рефакторинг. Обращение к символьному коду для определения валюты ИТСМ 2032
&ИзменениеИКонтроль("ЗагрузитьДокументы")
Процедура смарт_ЗагрузитьДокументы(ПараметрыОбмена, ТзнДокументов, ДокументXDTO)

	лНомер 	= "";
	лДата	= "";
	Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Номер") Тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<Номер> документа XML. Документ будет пропущен.", ПараметрыОбмена);
		возврат;
	Иначе
		Если НЕ	Б_ОбменССайтомСервер.СвойствоXDTOЗаполнено(ДокументXDTO.Номер) тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("Некорректные данные в <Документ>.<Номер> документа XML. Документ будет пропущен.", ПараметрыОбмена);
			возврат;
		Иначе
			лНомер = ДокументXDTO.Номер;
		конецЕсли;
	КонецЕсли;	

	Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Дата") Тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<Дата> документа XML. Документ будет пропущен.", ПараметрыОбмена);
		возврат;
	Иначе
		Если НЕ	Б_ОбменССайтомСервер.СвойствоXDTOЗаполнено(ДокументXDTO.Дата) тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("Некорректные данные в <Документ>.<Дата> документа XML. Документ будет пропущен.", ПараметрыОбмена);
			возврат;
		Иначе
			лДата = ДокументXDTO.Дата;
		конецЕсли;
	КонецЕсли;	

	#Вставка
	//++ #Б-2656 смарт: Лопато 13.03.2025 //ИМ. Заказы в иностранной валюте. Выгрузка валютного заказа на сайт.  
	//лВалютаДокумента = Справочники.Валюты.НайтиПоНаименованию(Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Валюта", "Строка")).Ссылка;

	//лВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	//
	//Если НЕ (ЗначениеЗаполнено(лВалютаДокумента)
	//		 И ЗначениеЗаполнено(лВалютаРеглУчета)
	//		 И лВалютаДокумента = лВалютаРеглУчета) Тогда

	//	Б_ОбменССайтомСервер.СообщитьПодробно("Валюта заказа не РУБ. в <Документ>.<Номер> документа XML. Документ будет пропущен.", ПараметрыОбмена);
	//	
	//	Возврат;
	//	
	//КонецЕсли;	
	//-- #Б-2656 смарт: Лопато 13.03.2025
	#КонецВставки
	
	Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "ХозОперация")
		ИЛИ (НЕ НРег(ДокументXDTO.ХозОперация) = "заказ товара"	И НЕ НРег(ДокументXDTO.ХозОперация) = "отпуск товара" И НЕ НРег(ДокументXDTO.ХозОперация) = "выплата наличных денег" И НЕ НРег(ДокументXDTO.ХозОперация) = "выплата безналичных денег" И НЕ НРег(ДокументXDTO.ХозОперация) = "эквайринговая операция") Тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<ХозОперация> документа XML: " + лНомер + "от " + лДата + ". Документ с таким типом не обрабатывается. Документ будет пропущен.", ПараметрыОбмена);
	КонецЕсли;		

	Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Контрагенты") Тогда
		лКонтрагент = Неопределено;
	Иначе
		Контрагенты = ДокументXDTO.Контрагенты;
		Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(Контрагенты, "Контрагент") Тогда
			лКонтрагент = Неопределено;
		Иначе
			Если Б_ОбменССайтомСервер.ЭтоСписокXDTO(Контрагенты.Контрагент) тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<Контрагенты> документа XML: " + лНомер + "от " + лДата + ". Указано несколько контрагентов. Будет взят первый.", ПараметрыОбмена);
				лКонтрагентXDTO =  Контрагенты.Контрагент[0];
			иначе
				лКонтрагентXDTO =  Контрагенты.Контрагент;
			КонецЕсли;

			лКонтрагент= ОбработатьИнформациюОКонтрагентеXDTO(ПараметрыОбмена, лКонтрагентXDTO, лНомер);   

		КонецЕсли;	

	КонецЕсли;	 		


	Если  ДокументXDTO.ХозОперация = "Заказ товара" ИЛИ ДокументXDTO.ХозОперация = "Отпуск товара" тогда

		Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Товары")  Тогда
			лТовары = Неопределено;	
		Иначе
			//ТоварыXDTO 	= ДокументXDTO.Товары;

			лТовары 	= ОбработатьИнформациюОТабличнойЧастиДокументаXDTO(ПараметрыОбмена, ТзнДокументов, ДокументXDTO);

		КонецЕсли;
	Иначе
		лТовары = Неопределено;	
	КонецЕсли;

	НовСтр = ТзнДокументов.Добавить();

	НовСтр.Дата 			= лДата;
	НовСтр.Номер 			= лНомер;
	НовСтр.Дата1С 			= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Дата1С"			, "Дата");
	НовСтр.Номер1С 			= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Номер1С"			, "Строка");
	НовСтр.НомерВерсии		= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "НомерВерсии"		, "Строка");
	НовСтр.ПометкаУдаления 	= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "ПометкаУдаления"	, "Булево");
	НовСтр.Время 			= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Время"				, "Строка");
	НовСтр.ХозОперация 		= ДокументXDTO.ХозОперация;
	НовСтр.Ид 				= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Ид"				, "Строка");
	лВалюта					= Справочники.Валюты.НайтиПоНаименованию(Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Валюта", "Строка")).Ссылка;
	
	#Вставка
	////#Удаление //++ #2032 смарт: Шляпников 24.09.2024 / Рефакторинг. Обращение к символьному коду для определения валюты ИТСМ 2032
	//лВалюта					= Справочники.Валюты.НайтиПоНаименованию(Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Валюта", "Строка")).Ссылка;
	////#КонецУдаления

	//++ #2032 смарт: Шляпников 24.09.2024 / Рефакторинг. Обращение к символьному коду для определения валюты ИТСМ 2032
	//лВалюта					= Константы.ВалютаРегламентированногоУчета.Получить();
	//-- #2032 смарт: Шляпников 24.09.2024
	#КонецВставки
	
	НовСтр.Валюта 			= ?(ЗначениеЗаполнено(лВалюта), лВалюта, Константы.ВалютаУправленческогоУчета.Получить());

	НовСтр.Комментарий 		= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Комментарий"		, "Строка");
	НовСтр.Курс 			= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Курс"				, "Число");
	НовСтр.Сумма 			= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(ДокументXDTO, "Сумма"				,  "Число");

	НовСтр.Контрагент		= лКонтрагент;

	Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Склады") Тогда

		Склады = ДокументXDTO.Склады;
		Если НЕ Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(Склады, "Склад") Тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<Склады>.<Склад> документа XML: " + лНомер + "от " + лДата + "", ПараметрыОбмена);
		Иначе
			Если Б_ОбменССайтомСервер.ЭтоСписокXDTO(Склады.Склад) тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<Склады> документа XML: " + лНомер + "от " + лДата + ". Указано несколько складов. Будет взят первый.", ПараметрыОбмена);
				лСкладXDTO			=  Склады.Склад[0];
				лСклад 				= ОбработатьИнформациюОСкладеXDTO(ПараметрыОбмена, лСкладXDTO, лНомер);
				НовСтр.Склад		= лСклад;
			иначе
				лСкладXDTO 			=  Склады.Склад;
				лСклад 				= ОбработатьИнформациюОСкладеXDTO(ПараметрыОбмена, лСкладXDTO, лНомер);
				НовСтр.Склад		= лСклад;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Основание") Тогда

		НовСтр.Основание = Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству( ДокументXDTO, "Основание",		  "Строка");
	Иначе
		Если ДокументXDTO.ХозОперация = "Отпуск товара" тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("Для отгрузки с номером: " + лНомер + "от " + лДата + " не указано основание.", ПараметрыОбмена);
		КонецЕсли;	
	КонецЕсли;	

	Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Налоги") Тогда
		НалогиXDTO = ДокументXDTO.Налоги;
		Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(НалогиXDTO, "Налог") Тогда
			Если Б_ОбменССайтомСервер.ЭтоСписокXDTO(НалогиXDTO.Налог) тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка в значении узла <Документ>.<Налоги> документа XML: " + лНомер + "от " + лДата + ". Указано несколько НДС. Будет взят первый.", ПараметрыОбмена);
				НалогXDTO			= НалогиXDTO.Налог[0];
				НовСтр.НДСВСумме 	= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(НалогXDTO, "УчтеноВСумме",	  "Булево");
				НовСтр.СуммаНДС 	= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(НалогXDTO, "Сумма",			  "Число");
			иначе   				
				НалогXDTO = НалогиXDTO.Налог;

				НовСтр.НДСВСумме 	= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(НалогXDTO, "УчтеноВСумме",	  "Булево");
				НовСтр.СуммаНДС 	= Б_ОбменССайтомСервер.ПолучитьЗначениеПоСвойству(НалогXDTO, "Сумма",			  "Число");
			КонецЕсли;	
		Конецесли;
	Иначе
		НовСтр.НДСВСумме 	= Неопределено;
		НовСтр.СуммаНДС 	= 0;
	КонецЕсли;

	Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "Скидки") Тогда
		СкидкиXDTO 		= ДокументXDTO.Скидки;
		НовСтр.Скидки 	= Б_ОбменССайтомСервер.ОбработатьЗначенияСкидокXDTO(ПараметрыОбмена, СкидкиXDTO);
	КонецЕсли;

	Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "ЗначенияРеквизитов") Тогда
		ЗначенияРеквизитовXDTO 		= ДокументXDTO.ЗначенияРеквизитов;
		НовСтр.ЗначенияРеквизитов 	= Б_ОбменССайтомСервер.ОбработатьЗначенияРеквизитовXDTO(ПараметрыОбмена, ЗначенияРеквизитовXDTO);
	КонецЕсли;

	Если Б_ОбменССайтомСервер.ОбъектXDTOСодержитСвойство(ДокументXDTO, "ИнформацияОЧеках") Тогда
		ИнформацияОЧекахXDTO 		= ДокументXDTO.ИнформацияОЧеках;
		НовСтр.ИнформацияОЧеках 	= Б_ОбменССайтомСервер.ОбработатьИнформацияОЧекахXDTO(ПараметрыОбмена, ИнформацияОЧекахXDTO);
	КонецЕсли;

	НовСтр.Товары		= лТовары;

	#Вставка
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 21.08.2020 13:15:06
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку(); 
	//ЗаписьXML.ЗаписатьОбъявлениеXML(); 
	ПараметрыОбмена.МояФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ДокументXDTO,"Документ", , , ); //  "urn:1C.ru:commerceml_3"   НазначениеТипаXML.Явное
	СтрокаXML = ЗаписьXML.Закрыть();
	СтрокаXML = СтрЗаменить(СтрокаXML, " xmlns=""", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "xmlns=""http://www.w3.org/2001/XMLSchema", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, """ xmlns:xs=""http://www.w3.org/2001/XMLSchema", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, """", "");
	
	НаборЗаписей = РегистрыСведений.СмартОплатаОтпускИсправление.СоздатьНаборЗаписей();
	
	ИдДок = ?(ДокументXDTO.Свойства().Получить("Основание")=Неопределено, ДокументXDTO.Ид, ДокументXDTO.Основание);
	ИмяХозОперации = СтрЗаменить(ДокументXDTO.ХозОперация, " ", "");
	НаборЗаписей.Отбор.ИдЗаказТовара.Установить(ИдДок);
	НаборЗаписей.Прочитать();
	
	Если ИмяХозОперации <> "" и НаборЗаписей.Количество() > 0 тогда
		Для каждого стр Из НаборЗаписей Цикл
			стр["Ид"+ИмяХозОперации] = ДокументXDTO.Ид;
			стр.ХранилищеЗаказ = Новый ХранилищеЗначения(ТзнДокументов, Новый СжатиеДанных(9));
			стр[ИмяХозОперации] = СтрокаXML;
		КонецЦикла;
	Иначе	
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись["Ид"+ИмяХозОперации] = ДокументXDTO.Ид;
		НовЗапись.ХранилищеЗаказ = Новый ХранилищеЗначения(ТзнДокументов, Новый СжатиеДанных(9));
		НовЗапись[ИмяХозОперации]  = СтрокаXML;
	КонецЕсли;
	НаборЗаписей.Записать(Истина);
	//Смарт }Подкин Алексей Иванович 21.08.2020 13:15:06
	
	// Поменяем данные Контрагента на данные Грузополучателя
	//МСтр=ТзнДокументов.НайтиСтроки(Новый Структура("ХозОперация,Номер","Заказ товара",ДокументXDTO.Номер));
	//Для Каждого Стр Из МСтр Цикл
	//	Грузополучатель=Стр.ЗначенияРеквизитов.Найти("Грузополучатель");
	//	Если Не Грузополучатель=Неопределено И ЗначениеЗаполнено(Грузополучатель.Значение) Тогда 
	//		ИД=Неопределено;
	//		Если Стр.Контрагент.Свойство("ИД",ИД) Тогда 
	//			Стр.Контрагент.ИД=Грузополучатель.Значение;
	//			
	//			КонтактноеЛицо=Стр.ЗначенияРеквизитов.Найти("КонтактноеЛицо");
	//			Если КонтактноеЛицо=Неопределено Тогда 
	//				КонтактноеЛицо=Стр.ЗначенияРеквизитов.Добавить();
	//			КонецЕсли;	
	//			КонтактноеЛицо.Наименование="КонтактноеЛицо";
	//			КонтактноеЛицо.Значение=ИД;
	//		КонецЕсли;				
	//	КонецЕсли;	
	//КонецЦикла;
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("СоздатьОбновитьТиповыеДокументы")
Функция смарт_СоздатьОбновитьТиповыеДокументы(ПараметрыОбмена, ТзнДокументов)

	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("СписокИдДокументов"			, ТзнДокументов.ВыгрузитьКолонку("Ид"));

	лКоличествоСтрок 	= ПараметрыОбмена.ДокументыЗагрузки.Количество()-1; 	
	Для Итератор = 0 по лКоличествоСтрок Цикл
		ТекВидДокумента = ПараметрыОбмена.ДокументыЗагрузки[Итератор]; 
		лВидДокумента = ТекВидДокумента.ВидДокумента;
		Если Итератор = 0 тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документ.Ссылка КАК Ссылка,
			|	"""+лВидДокумента+""" КАК ТипДокумента,
			|	Документ.Б_НомерВерсии,
			|	Документ.Б_Идентификатор КАК Б_Идентификатор
			|ПОМЕСТИТЬ ВремДокументы
			|ИЗ
			|	Документ."+ТекВидДокумента.Документ+" КАК Документ
			|ГДЕ
			|	Документ.Б_Идентификатор В(&СписокИдДокументов)";
		ИначеЕсли ((лВидДокумента = "Отпуск товара" И ПараметрыОбмена.ЗагрузкаОтгрузок) 
			ИЛИ ((лВидДокумента = "Выплата наличных денег" И ПараметрыОбмена.ЗагрузкаОплат) 
			ИЛИ (лВидДокумента = "Эквайринговая операция" И ПараметрыОбмена.ЗагрузкаОплат) 
			ИЛИ (лВидДокумента = "Выплата безналичных денег" И ПараметрыОбмена.ЗагрузкаОплат))
			И ПроверитьЗагружаемостьОплаты(ПараметрыОбмена, лВидДокумента)) тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|  ВЫБРАТЬ
			|	Документ.Ссылка КАК Ссылка,
			|	"""+лВидДокумента+""" КАК ТипДокумента,
			|	Документ.Б_НомерВерсии,
			|	Документ.Б_Идентификатор КАК Б_Идентификатор
			|ИЗ
			|	Документ."+ТекВидДокумента.Документ+" КАК Документ
			|ГДЕ
			|	Документ.Б_Идентификатор В(&СписокИдДокументов)";
		КонецЕсли;

		Если Итератор = лКоличествоСтрок тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ТипДокумента,	
			|	Б_Идентификатор";

		КонецЕсли;

	КонецЦикла;

	Запрос.Текст = ТекстЗапроса;

	Запрос.Выполнить();

	Для каждого ТекДокумент из ТзнДокументов Цикл

		Если ТекДокумент.ХозОперация = "Отпуск товара" И НЕ ПараметрыОбмена.ЗагрузкаОтгрузок тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("Отгрузка с номером:" + ТекДокумент.Номер + " не будет загружена, т.к. в настройках стоит, чтобы отгрузки не загружались.", ПараметрыОбмена);
			Продолжить;	
		КонецЕсли;

		Если ТекДокумент.ХозОперация = "Выплата наличных денег" ИЛИ ТекДокумент.ХозОперация = "Выплата безналичных денег" ИЛИ ТекДокумент.ХозОперация = "Эквайринговая операция" тогда
			Если НЕ ПараметрыОбмена.ЗагрузкаОплат тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("Оплата с номером:" + ТекДокумент.Номер + " не будет загружена, т.к. в настройках стоит, чтобы оплаты не загружались.", ПараметрыОбмена);
				Продолжить;	
			КонецЕсли;

			Если ПроверитьЗагружаемостьОплаты(ПараметрыОбмена, ТекДокумент.ХозОперация) = Ложь тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("Оплата с номером:" + ТекДокумент.Номер + " не будет загружена, т.к. в настройках стоит индивидуальная настройка, чтобы оплаты этого типа не загружались.", ПараметрыОбмена);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;

		НайденнаяСтрока = ПараметрыОбмена.ДокументыЗагрузки.Найти(ТекДокумент.ХозОперация, "ВидДокумента");

		Если НайденнаяСтрока = Неопределено тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("ОШИБКА!!! Не определено, с каким документом 1С сопоставлять документ XML с типом:" + ТекДокумент.ХозОперация, ПараметрыОбмена);
			Продолжить;	
		КонецЕсли;

		ИмяДокумента 	= НайденнаяСтрока.Документ;

		#Удаление
		Документ = Б_ОбменССайтомСервер.ПолучитьДокументПоКоду(ИмяДокумента, ТекДокумент.Номер1С, ТекДокумент.Дата1С, ТекДокумент.Ид, ТекДокумент.ХозОперация, МенеджерВременныхТаблиц);

		Если НЕ Документ.Пустая() тогда

			Если ТекДокумент.НомерВерсии <> Документ.Б_НомерВерсии тогда

				Если НЕ ПараметрыОбмена.НеРедактироватьДокументыПришедшиеССайта тогда
					СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Ложь, Документ);
				Иначе
					Б_ОбменССайтомСервер.СообщитьПодробно("Стоит настройка, чтобы документы в 1С не обновлялись. Документ: " + Строка(Документ.Ссылка) + " будет пропущен.", ПараметрыОбмена);
				КонецЕсли;
			Иначе
				Б_ОбменССайтомСервер.СообщитьПодробно("С последней загрузки из БУС документ: " + Строка(Документ.Ссылка) + " не менялся. Документ будет пропущен.", ПараметрыОбмена);
			КонецЕсли;
		Иначе
			СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Истина);
		КонецЕсли;
		#КонецУдаления
		#Вставка
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.01.2021 16:47:02 для оффлайн заказа, поиск документа в 1с задача 552
        //Поиск ранее выгруженного на сайт оффлайн документа, для присвоения ИД с сайта, Номер с сайта, Дата с сайта
		Дата1С=ТекДокумент.ЗначенияРеквизитов.НайтиСтроки(Новый Структура("Наименование","Дата1С"));
		Номер1С=ТекДокумент.ЗначенияРеквизитов.НайтиСтроки(Новый Структура("Наименование","Номер1С"));
		ОффлайнЗаказ=ТекДокумент.ЗначенияРеквизитов.НайтиСтроки(Новый Структура("Наименование","Оффлайн заказ"));
		ДокОффлайн=Ложь;
		Если Дата1С.Количество() и Номер1С.Количество() И ОффлайнЗаказ.Количество() И ОффлайнЗаказ[0].Значение="Y" Тогда
			СтроковаяДата = СтрЗаменить(Дата1С[0].Значение , "-","");
			СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
			НоваяДата = Дата(СтроковаяДата);
			Документ = Б_ОбменССайтомСервер.ПолучитьДокументПоКоду(ИмяДокумента, Номер1С[0].Значение, НоваяДата, ТекДокумент.Ид, ТекДокумент.ХозОперация, МенеджерВременныхТаблиц);
			Если НЕ Документ.Пустая() тогда
				ОбновитьИдДокументаОффлайн(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Документ);

			КонецЕсли;
			ДокОффлайн=Истина;	
		Иначе	
			Документ = Б_ОбменССайтомСервер.ПолучитьДокументПоКоду(ИмяДокумента, ТекДокумент.Номер1С, ТекДокумент.Дата1С, ТекДокумент.Ид, ТекДокумент.ХозОперация, МенеджерВременныхТаблиц);
		КонецЕсли; //Смарт }Подкин Алексей Иванович 29.01.2021 16:47:02
		
		
		//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 29.01.2021 16:57:38 задача 552
		//	    Документ = Б_ОбменССайтомСервер.ПолучитьДокументПоКоду(ИмяДокумента, ТекДокумент.Номер1С, ТекДокумент.Дата1С, ТекДокумент.Ид, ТекДокумент.ХозОперация, МенеджерВременныхТаблиц);
		//Смарт }Подкин Алексей Иванович 29.01.2021 16:57:38
		
        //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.02.2021 11:38:23 задача 552
        //Если Не ДокОффлайн Тогда
            //Смарт }Подкин Алексей Иванович 01.02.2021 11:38:23
            
            Если НЕ Документ.Пустая() тогда
				
                Если ТекДокумент.НомерВерсии <> Документ.Б_НомерВерсии тогда
                    //Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 07.09.2021 9:34:19 для отмены документов онлайн убрал
                    //Если НЕ ПараметрыОбмена.НеРедактироватьДокументыПришедшиеССайта тогда 
                    
                    //-- смарт:Подкин #552 21.09.2022 16:53:41 убираем изменение документа, создаем процедуру отмены
                    //СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Ложь, Документ);  
                    ДокументОтменен = ПолучитьЗначениеРеквизитаДокумента(ТекДокумент.ЗначенияРеквизитов, "Отменен");
                    ДокументОтменен = ?((ДокументОтменен = Неопределено ИЛИ ДокументОтменен = "false"), Ложь, Истина);
                    Если ДокументОтменен Тогда 
                        СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Ложь, Документ);
                        //ДокОбъект = Документ.ПолучитьОбъект();
                        //ПричинаОтменыНаименование 	= ПолучитьЗначениеРеквизитаДокумента(ТекДокумент.ЗначенияРеквизитов, "Причина отмены"); 
                        //Если Б_ОбменССайтомСервер.СвойствоXDTOЗаполнено(ПричинаОтменыНаименование) тогда
                        //    ПричинаОтмены   		= ПолучитьЗначениеПричиныОтменыЗаказа(ПричинаОтменыНаименование);
                        //Иначе 
                        //    ПричинаОтмены			= ПараметрыОбмена.ПричинаОтменыЗаказа;
                        //КонецЕсли;    
                        //
                        //Для каждого СтрТовары Из ДокОбъект.Товары Цикл
                        //	 СтрТовары.Отменено = Истина;  
                        //     СтрТовары.ПричинаОтмены = ПричинаОтмены;
                        //КонецЦикла; 
                        //
                        //мНастройкиДокумента	= ПолучитьРеквизитыТЧДокумента(ИмяДокумента, ПараметрыОбмена.ДокументыЗагрузки);
                        //ОсновныеНастройкиДокумента = мНастройкиДокумента[0];
                        //ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ТекДокумент, ОсновныеНастройкиДокумента,ДокОбъект, Неопределено, ДокументОтменен);	
                    КонецЕсли;
                    //-- смарт:Подкин #552 21.09.2022 16:53:41
                    
                    //Иначе
                    //	Б_ОбменССайтомСервер.СообщитьПодробно("Стоит настройка, чтобы документы в 1С не обновлялись. Документ: " + Строка(Документ.Ссылка) + " будет пропущен.", ПараметрыОбмена);
                    //КонецЕсли;
				Иначе
				    Б_ОбменССайтомСервер.СообщитьПодробно("С последней загрузки из БУС документ: " + Строка(Документ.Ссылка) + " не менялся. Документ будет пропущен.", ПараметрыОбмена);
				КонецЕсли;
            Иначе
                СоздатьОбновитьДокумент(ПараметрыОбмена, ИмяДокумента, ТекДокумент, Истина);
            КонецЕсли;
            
            //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.02.2021 11:38:23 задача 552
        //КонецЕсли; 
        //Смарт }Подкин Алексей Иванович 01.02.2021 11:38:23
		#КонецВставки

	КонецЦикла;	

	МенеджерВременныхТаблиц.Закрыть();

КонецФункции

&ИзменениеИКонтроль("ЗаписьСтатусовИУдалениеЗагруженныхДокументов")
Процедура смарт_ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, НовыйДокумент, ДокументОтменен)

	ОбновлениеСвойствДокументов(ПараметрыОбмена, Документ, ДокументXML, ОсновныеНастройкиДокумента);

	ОбновлениеСвойствТоваровДокумента(ПараметрыОбмена, Документ, ДокументXML, ОсновныеНастройкиДокумента);

	Если ДокументОтменен Тогда

		Документ.Б_НомерВерсии = ДокументXML.НомерВерсии;	

		Если ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Помечать на удаление" тогда
			ДействияСОтмененнымиДокументами	= 0;
		ИначеЕсли ОсновныеНастройкиДокумента.ДействияСОтмененнымиДокументами = "Отменять проведение" тогда
			ДействияСОтмененнымиДокументами	= 1;
		Иначе
			ДействияСОтмененнымиДокументами	= 3;
		КонецЕсли;

		Если ДействияСОтмененнымиДокументами = 3 Тогда // Ничего

			#Вставка
			//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.09.2021 15:56:39 задача 552
			
			//Документ.ОбменДанными.Загрузка=Истина;
			Документ.Статус=Перечисления.СтатусыЗаказовКлиентов.Закрыт;
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				Документ.Записать(РежимЗаписиДокумента.Проведение);
				Б_ОбменССайтомСервер.СообщитьПодробно("Проведен отмененный документ: " + Строка(Документ), ПараметрыОбмена);
            Исключение 
                ЗаписьЖурналаРегистрации("Ошибка при проведении отмененного документа: " + Строка(Документ) + ОписаниеОшибки(),УровеньЖурналаРегистрации.Ошибка);
               	Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка при проведении отмененного документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
			КонецПопытки;
			
			УстановитьПривилегированныйРежим(Ложь);
			
			//Смарт }Подкин Алексей Иванович 09.09.2021 15:56:39
			#КонецВставки
			
		ИначеЕсли ДействияСОтмененнымиДокументами = 0 Тогда // Удалять
			Если НЕ Документ.ПометкаУдаления Тогда
				Документ.ПометкаУдаления = Истина;
				Попытка
					Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Б_ОбменССайтомСервер.СообщитьПодробно("Помечен на удаление документ: " + Строка(Документ), ПараметрыОбмена);
				Исключение
					Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка при установке пометки на удаление документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ДействияСОтмененнымиДокументами = 1 Тогда // отменять
			Если Документ.Проведен Тогда
				Попытка
					Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Б_ОбменССайтомСервер.СообщитьПодробно("Отменено проведение у документа: " + Строка(Документ), ПараметрыОбмена);
				Исключение
					Б_ОбменССайтомСервер.СообщитьПодробно("Ошибка при отмене проведения документа: " + Строка(Документ) + Символы.ПС + ОписаниеОшибки(), ПараметрыОбмена);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ПланыОбмена.УдалитьРегистрациюИзменений(Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов(), Документ.Ссылка);

	Если Документ.Проведен Тогда

		ТипОбъекта = ТипЗнч(Документ.Ссылка);

		Если ТипОбъекта = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") тогда

			Если Документ.РасшифровкаПлатежа.Количество() > 0 тогда
				лЗаказ = Документ.РасшифровкаПлатежа[0].ОснованиеПлатежа; 
				Если ЗначениеЗаполнено(лЗаказ) тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов(), лЗаказ);
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Если ЗначениеЗаполнено(Документ.ЗаказКлиента) тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов(), Документ.ЗаказКлиента);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;	
	
	#Вставка
	Если ТипЗнч(Документ.Ссылка)=Тип("ДокументСсылка.ЗаказКлиента") Тогда
		НаборЗаписей = РегистрыСведений.СмартОплатаОтпускИсправление.СоздатьНаборЗаписей();
		Попытка
			ИдДок=Документ.Б_Идентификатор;
			НаборЗаписей.Отбор.ИдЗаказТовара.Установить(ИдДок);
			НаборЗаписей.Прочитать();
			Для Каждого стр из НаборЗаписей цикл
				Стр.СсылкаЗаказ=Документ.Ссылка;
			КонецЦикла;
			НаборЗаписей.Записать(Истина);
		ИСключение
		КонецПопытки;
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ОбновлениеСвойствДокументов")
Процедура смарт_ОбновлениеСвойствДокументов(ПараметрыОбмена, Документ, ДокументXML, ТипДокумента)

	Если НЕ ДокументXML.ЗначенияРеквизитов = Неопределено тогда

		#Вставка
		//++ #1993 смарт: Лопато 19.08.2024 //Обработка онлайн заказов (переделка)  
		ОтправитьОповещениеОнлайнЗаказ = Ложь;
		//-- #1993 смарт: Лопато 19.08.2024
		#КонецВставки
		
		#Удаление
		Если ТипДокумента.Документ = "ЗаказКлиента" тогда
			ТипНабора = Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Документ_ЗаказКлиента"); 	
		ИначеЕсли ТипДокумента.Документ = "РеализацияТоваровУслуг" тогда
			ТипНабора = Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Документ_РеализацияТоваровУслуг"); 	
		ИначеЕсли ТипДокумента.Документ = "ПриходныйКассовыйОрдер" тогда
			ТипНабора = Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Документ_ПриходныйКассовыйОрдер"); 	
		ИначеЕсли ТипДокумента.Документ = "ОперацияПоПлатежнойКарте" тогда
			ТипНабора = Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Документ_ОперацияПоПлатежнойКарте"); 
		ИначеЕсли ТипДокумента.Документ = "ПоступлениеБезналичныхДенежныхСредств" тогда
			ТипНабора = Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Документ_ПоступлениеБезналичныхДенежныхСредств"); 

		Иначе
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка(); 	
		КонецЕсли;
		#КонецУдаления
		#Вставка
		//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет" 
		Если ТипДокумента.Документ = "ЗаказКлиента" тогда
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказКлиента; 	
		ИначеЕсли ТипДокумента.Документ = "РеализацияТоваровУслуг" тогда
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РеализацияТоваровУслуг; 	
		ИначеЕсли ТипДокумента.Документ = "ПриходныйКассовыйОрдер" тогда
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйКассовыйОрдер; 	
		ИначеЕсли ТипДокумента.Документ = "ОперацияПоПлатежнойКарте" тогда
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОперацияПоПлатежнойКарте; 
		ИначеЕсли ТипДокумента.Документ = "ПоступлениеБезналичныхДенежныхСредств" тогда
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеБезналичныхДенежныхСредств; 
			
		Иначе
			ТипНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка(); 	
		КонецЕсли;
		//-- #Б3686 смарт: Шляпников 03.07.2025
		#КонецВставки

		МенеджерВременныхТаблицСвойств 	= Новый МенеджерВременныхТаблиц;

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСвойств;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеРеквизитыИСведения.Ссылка,
		|	ДополнительныеРеквизитыИСведения.ТипЗначения,
		|	ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение,
		|	ДополнительныеРеквизитыИСведения.Заголовок  КАК Заголовок
		|ПОМЕСТИТЬ ВремДопРеквизиты
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заголовок";
		Запрос.Выполнить();

		МенеджерВременныхТаблицНаборов = Новый МенеджерВременныхТаблиц;
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицНаборов;
		Запрос.УстановитьПараметр("ТипНабора", ТипНабора);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
		|ПОМЕСТИТЬ ВремНаборыСвойств
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
		|ГДЕ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &ТипНабора
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Свойство";
		Запрос.Выполнить();

		Для каждого ТекЗначениеРеквизита из ДокументXML.ЗначенияРеквизитов Цикл

			СвойствоСтрокой = ТекЗначениеРеквизита.Наименование;

			Если ТипДокумента.Документ 	= "РеализацияТоваровУслуг" И СвойствоСтрокой = "Сумма доставки" тогда
				СоздаватьРеквизит = Истина;
			Иначе
				СоздаватьРеквизит = Ложь;
			КонецЕсли;

			Если СоздаватьРеквизит И Документ.метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты") = Неопределено тогда
				Продолжить;
			КонецЕсли;			

			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСвойств;
			Запрос.УстановитьПараметр("СоздаватьРеквизит", НЕ СоздаватьРеквизит);
			Запрос.Текст ="ВЫБРАТЬ *
			|ИЗ
			|	ВремДопРеквизиты КАК ВремДопРеквизиты
			|ГДЕ
			|	ВремДопРеквизиты.Заголовок = &Заголовок
			|	И ВремДопРеквизиты.ЭтоДополнительноеСведение = &СоздаватьРеквизит";
			Запрос.УстановитьПараметр("Заголовок", СвойствоСтрокой);

			Свойство = НеОпределено;

			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТипЗначения = Новый ОписаниеТипов("Строка") ИЛИ Выборка.ТипЗначения = Новый ОписаниеТипов("Число") Тогда
					Свойство = Выборка.Ссылка;
					Прервать;
				КонецЕсли;
			КонецЦикла;

			Если Свойство = НеОпределено Тогда

				СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
				СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке заказа с сайта'");
				СвойствоОбъект.Наименование = СвойствоСтрокой;
				СвойствоОбъект.Заголовок 	= СвойствоСтрокой;
				СвойствоОбъект.ЗаголовокФормыВыбораЗначения = СвойствоСтрокой;
				СвойствоОбъект.ЗаголовокФормыЗначения 		= СвойствоСтрокой;
				СвойствоОбъект.Б_Идентификатор = "СвойствоЗаказа";
				СвойствоОбъект.НаборСвойств = ТипНабора;

				Если СвойствоСтрокой = "Сумма доставки" тогда
					СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов("Число");
				Иначе
					СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов("Строка");
				КонецЕсли;

				Если СоздаватьРеквизит тогда

					СвойствоОбъект.Доступен = Истина;
					СвойствоОбъект.Виден 	= Истина;
					СвойствоОбъект.Записать();

					лНабор = ТипНабора.ПолучитьОбъект();
					лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоОбъект.Ссылка;
					лНабор.Записать();

				Иначе
					СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
					СвойствоОбъект.Доступен = Истина;
					СвойствоОбъект.Виден 	= Истина;
					СвойствоОбъект.Записать();

					лНабор = ТипНабора.ПолучитьОбъект();
					лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
					лНабор.Записать();
				КонецЕсли;

				Свойство = СвойствоОбъект.Ссылка;

			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицНаборов;
			Запрос.Текст ="ВЫБРАТЬ
			|	ВремНаборыСвойств.Свойство
			|ИЗ
			|	ВремНаборыСвойств КАК ВремНаборыСвойств
			|ГДЕ
			|	ВремНаборыСвойств.Свойство = &Свойство";

			Запрос.УстановитьПараметр("Свойство", Свойство);

			Если Запрос.Выполнить().Пустой() Тогда

				ЗаписьНабора 	= ТипНабора.ПолучитьОбъект();
				Если СоздаватьРеквизит тогда
					НовСвойство 	= ЗаписьНабора.ДополнительныеРеквизиты.Добавить().Свойство = Свойство;
					ЗаписьНабора.Записать();
				Иначе
					НовСвойство 	= ЗаписьНабора.ДополнительныеСведения.Добавить().Свойство = Свойство;
					ЗаписьНабора.Записать();
				КонецЕсли;	
			КонецЕсли;

			Если СвойствоСтрокой = "Сумма доставки" тогда
				Значение = Число(ТекЗначениеРеквизита.Значение);
			Иначе
				Значение = ТекЗначениеРеквизита.Значение;
			конецЕсли;

			#Вставка
			//++ #1993 смарт: Лопато 19.08.2024 //Обработка онлайн заказов (переделка)  
			Если ТипДокумента.Документ = "ЗаказКлиента" 
				И СвойствоСтрокой = "Оффлайн заказ" 
				И Значение = "N" Тогда
				
				НаборЗаписейОффлайнзаказ = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
				
				НаборЗаписейОффлайнзаказ.Отбор.Объект.Установить(Документ.Ссылка);
				НаборЗаписейОффлайнзаказ.Отбор.Свойство.Установить(Свойство);
				НаборЗаписейОффлайнзаказ.Прочитать();
				
				Если НаборЗаписейОффлайнзаказ.Количество() = 0 Тогда
					
					ОтправитьОповещениеОнлайнЗаказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			//-- #1993 смарт: Лопато 19.08.2024
			#КонецВставки
			
			Если СоздаватьРеквизит тогда

				НайденнаяСтрока = Документ.ДополнительныеРеквизиты.Найти(Свойство, "Свойство");

				Если НайденнаяСтрока = Неопределено тогда 
					лНовыйРеквизит = Документ.ДополнительныеРеквизиты.Добавить();
					лНовыйРеквизит.Свойство = Свойство;
					лНовыйРеквизит.Значение = Значение;
				Иначе
					НайденнаяСтрока.Значение = Значение;
				КонецЕсли;

				Документ.Записать();
			Иначе

				#Удаление
				НоваяЗапись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				
				НоваяЗапись.Объект 		= Документ.Ссылка;
				НоваяЗапись.Значение 	= Значение;
				НоваяЗапись.Свойство 	= Свойство;
				НоваяЗапись.Записать();
				#КонецУдаления
				#Вставка
				//++ #Б3696 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. Модуль обмена с Битрикс. Рефакторинг и обновление 
				НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Объект.Установить(Документ.Ссылка);
				НаборЗаписей.Отбор.Свойство.Установить(Свойство);
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Объект 		= Документ.Ссылка;
				НоваяЗапись.Значение 	= Значение;
				НоваяЗапись.Свойство 	= Свойство;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				//-- #Б3696 смарт: Шляпников 03.07.2025
				#КонецВставки
			КонецЕсли;

		КонецЦикла;

		#Вставка
		//++ #Б3696 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. Модуль обмена с Битрикс. Рефакторинг и обновление 
		ВерсионированиеОбъектов.ЗаписатьВерсиюОбъекта(Документ.Ссылка);
		//-- #Б3696 смарт: Шляпников 03.07.2025
		#КонецВставки
		
		МенеджерВременныхТаблицНаборов.Закрыть();
		МенеджерВременныхТаблицСвойств.Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("СоздатьОбновитьДокумент")
Процедура смарт_СоздатьОбновитьДокумент(ПараметрыОбмена, НазваниеДокумента, ДокументXML, НовыйДокумент, СсылкаНаДокумент)

	#Удаление
	Если НовыйДокумент И НЕ ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Документ = Документы[НазваниеДокумента].СоздатьДокумент();	
	ИначеЕсли НовыйДокумент И ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Помеченный на удаление документ  '"+ НазваниеДокумента + "' не загружаем.", ПараметрыОбмена);
		Возврат;   
	Иначе             
		Документ = СсылкаНаДокумент.ПолучитьОбъект();  		
	КонецЕсли;   

	Если ДокументXML.ПометкаУдаления = ИСТИНА тогда

		Попытка 
			Документ.УстановитьПометкуУдаления(Истина);
			Б_ОбменССайтомСервер.СообщитьПодробно("Помечен на удаление документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		Исключение
			Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось удалить документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		КонецПопытки;

		Возврат;

	КонецЕсли;

	ВремТабТЧ = ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов.Скопировать();
	ВремТабТЧ.Свернуть("ТабличнаяЧасть, Документ, ПолеXML");

	мНастройкиДокумента	= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ДокументыЗагрузки);
	мРеквизитыДокумента = ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияШапокДокументов);
	мТабличныеЧасти		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ВремТабТЧ); 
	мРеквизитыТЧ		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов);

	Если мНастройкиДокумента.Количество() = 0 тогда

		Б_ОбменССайтомСервер.СообщитьПодробно("У документа " + НазваниеДокумента + " не найдены основные параметры документа в настройках соответствий. Загрузка документа невозможна.", ПараметрыОбмена);

		Возврат;

	КонецЕсли;

	ОсновныеНастройкиДокумента = мНастройкиДокумента[0];

	Для Каждого ТекРеквизит из мРеквизитыДокумента Цикл

		Если НЕ ПустаяСтрока(ТекРеквизит.Значение) тогда

			Если ТекРеквизит.НаименованиеРеквизита1С = "Дата" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Номер" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "ПометкаУдаления"
				ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Б_Идентификатор" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Б_ДатаДокумента" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Б_НомерВерсии" Тогда
				Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
			Иначе
				Если Документ.Метаданные().Реквизиты.Найти(ТекРеквизит.НаименованиеРеквизита1С) <> Неопределено Тогда
					Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	ДокументОтменен = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
	ДокументОтменен = ?((ДокументОтменен = Неопределено ИЛИ ДокументОтменен = "false"), Ложь, Истина);

	Если ОсновныеНастройкиДокумента.НумерацияДокументов =  "С сайта" тогда
		Документ.Номер = ДокументXML.Номер; 	
	Иначе
		Если НовыйДокумент тогда

			Документ.УстановитьНовыйНомер();	

		КонецЕсли;
	КонецЕсли;

	Для каждого ТекТабЧасть из мТабличныеЧасти Цикл

		СтрараяТабличнаяЧасть = Документ[ТекТабЧасть.ТабличнаяЧасть].Выгрузить();

		Документ[ТекТабЧасть.ТабличнаяЧасть].Очистить();

		Если ТекТабЧасть.ПолеXML = "" тогда

			Массив = новый Массив;
			Массив.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
			лТипРеквизита = Новый ОписаниеТипов(Массив);

			Заказ = ПолучитьОснование(ДокументXML, лТипРеквизита);

			Если ЗначениеЗаполнено(Заказ) тогда

				СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				тзнТоваровЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Товары").Выгрузить();
				Если тзнТоваровЗаказа.Количество() > 0 Тогда
					СтавкаНДС = тзнТоваровЗаказа[0].СтавкаНДС;	
				КонецЕсли;

				НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();
				Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл

					Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) тогда
						НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, , НовСтрока, СтрараяТабличнаяЧасть);	
					КонецЕсли;

				КонецЦикла;

				НовСтрока.СтавкаНДС	= СтавкаНДС;

				//#Область ОсобенностиПКО
				//			Если НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда

				СтруктураПересчетаСуммы = Новый Структура;
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);

				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);

				//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет" 
				//ПакетнаяОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(НовСтрока, СтруктураДействий, Неопределено);
				//-- #Б3686 смарт: Шляпников 03.07.2025
				//				КонецЕсли;	
				//#КонецОбласти


				//Если НовСтрока.Сумма = 0 Тогда
				//	НовСтрока.СуммаНДС = 0;	
				//Иначе
				//	НовСтрока.СуммаНДС = Окр(ТекНДС.СуммаНДС*СуммаРасшифровка/ТекНДС.Сумма,2);
				//КонецЕсли;
				//
				//
				//ОплатаВсего = Документ.СуммаДокумента;
				//
				//Для Каждого ТекНДС из  тзнНДС Цикл
				//	
				//	Если ОплатаВсего < ТекНДС.Сумма Тогда
				//		СуммаРасшифровка = ОплатаВсего;
				//	Иначе
				//		СуммаРасшифровка = ТекНДС.Сумма;
				//		ОплатаВсего = ОплатаВсего - ТекНДС.Сумма; 
				//	КонецЕсли;
				//	НовСтрока.Сумма					= СуммаРасшифровка;		
				//	НовСтрока.СуммаВзаиморасчетов	= СуммаРасшифровка;		
				//	
				//КонецЦикла;
			КонецЕсли;

		Иначе

			Для каждого ТекСтрокаТЗ из ДокументXML[ТекТабЧасть.ПолеXML] Цикл

				Если ДокументXML[ТекТабЧасть.ПолеXML].Колонки.Найти("Количество") <> Неопределено тогда
					Если ТекСтрокаТЗ.Количество = 0 тогда
						Продолжить;	
					КонецЕсли;

				КонецЕсли;	

				Если ТекСтрокаТЗ.Ид = "ORDER_DELIVERY" И ДокументXML.ХозОперация = "Отпуск товара" тогда

					СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, ТекСтрокаТЗ);

					Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
						Продолжить;
					Иначе
						ТоварДоставка = СтрИнформацииОНоменклатуре.Номенклатура;	

						Если ТоварДоставка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда

							Если НЕ ТоварДоставка.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг тогда
								Продолжить;
							КонецЕсли;

						КонецЕсли; 
					КонецЕсли;

				КонецЕсли;				

				НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();

				Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл

					Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) И ТекРеквизитТЧ.ТабличнаяЧасть = ТекТабЧасть.ТабличнаяЧасть тогда

						НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, ТекСтрокаТЗ, НовСтрока, СтрараяТабличнаяЧасть);	

					КонецЕсли;

				КонецЦикла;

				Если ТекТабЧасть.ТабличнаяЧасть = "Товары" И (НазваниеДокумента = "ЗаказКлиента" или НазваниеДокумента = "РеализацияТоваровУслуг") тогда

					СтруктураДействий = Новый Структура;

					ПересчитатьСтрокуДокумента(Документ, НовСтрока);

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	#Область ОсобенностиЗаказовИОтгрузок
	Если НазваниеДокумента = "ЗаказКлиента" или НазваниеДокумента = "РеализацияТоваровУслуг" тогда
		Если ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе Тогда
			Если ДокументXML.Скидки <> Неопределено тогда
				СуммаСкидки = 0;
				Для Каждого СтрокаСкидки Из ДокументXML.Скидки Цикл

					Если ЗначениеЗаполнено(СтрокаСкидки.Сумма) И СтрокаСкидки.УчтеноВСумме Тогда

						СуммаСкидки = СуммаСкидки + СтрокаСкидки.Сумма;

					КонецЕсли;

				КонецЦикла;

				Если СуммаСкидки <> 0 Тогда

					Если Документ.Товары.Количество() > 0 Тогда
						РаспределитьСуммуПоКолонке(Документ, Документ.Товары, -СуммаСкидки);
					КонецЕсли;

				КонецЕсли;  				

			КонецЕсли;
		КонецЕсли;

		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту"					, Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет"		, Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки"	, Истина);
		СтруктураПараметры.Вставить("УправляемыеСкидки"					, Неопределено);
		СтруктураПараметры.Вставить("РеализацияСверхЗаказа"				, Ложь);

		Если ПараметрыОбмена.ИспользоватьАвтоматическиеСкидкиВПродажах тогда
			СкидкиНаценкиСервер.Рассчитать(Документ, СтруктураПараметры);
		КонецЕсли;

		Документ.СуммаДокумента = Документ.Товары.Итог("Сумма");

		Если НазваниеДокумента = "ЗаказКлиента" тогда

			ВзаиморасчетыСервер.ПроверитьЗаполнитьЭтапыГрафикаОплаты(Документ);

			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда
				Если ПараметрыОбмена.НастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СвойствоЗаказов" тогда

					ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");

					Если ИдСтатуса 	<> Неопределено тогда

						НайденноеЗначениеСвойства =ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияЗначенийСвойствЗаказа.Найти(ИдСтатуса);

						Если НайденноеЗначениеСвойства <> Неопределено тогда

							СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа);

							Если СтрокаДР = Неопределено Тогда
								НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
							Иначе
								НовоеСвойство = СтрокаДР	
							КонецЕсли;

							НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа; 
							НовоеСвойство.Значение = НайденноеЗначениеСвойства.Статус; 

						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда
				Если ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.ИсточникСлужбДоставкиЗаказа = "СвойствоЗаказов" тогда

					ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");

					Если ИдМетодаДоставки 	<> Неопределено тогда

						НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствЗаказа.Найти(ИдМетодаДоставки);

						Если НайденноеЗначениеСвойства <> Неопределено тогда

							СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа);

							Если СтрокаДР = Неопределено Тогда
								НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
							Иначе
								НовоеСвойство = СтрокаДР	
							КонецЕсли;

							НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа; 
							НовоеСвойство.Значение = НайденноеЗначениеСвойства.Служба; 

						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

		Если НазваниеДокумента = "РеализацияТоваровУслуг" тогда
			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда

				ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");

				Если ИдМетодаДоставки 	<> Неопределено тогда

					НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствОтгрузки.Найти(ИдМетодаДоставки);

					Если НайденноеЗначениеСвойства <> Неопределено тогда

						СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки);

						Если СтрокаДР = Неопределено Тогда
							НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
						Иначе
							НовоеСвойство = СтрокаДР	
						КонецЕсли;

						НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки; 
						НовоеСвойство.Значение = НайденноеЗначениеСвойства.Служба; 

					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Документ.Склад);
		СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Документ.Склад, СкладГруппа, Документ.Товары, Ложь);

	КонецЕсли;

	Если НазваниеДокумента = "РеализацияТоваровУслуг" тогда

		Документ.ШтрихкодыУпаковок.Очистить();

		Для каждого ТекСтрокаТЗ из ДокументXML.Товары Цикл

			Если ТипЗнч(ТекСтрокаТЗ.Маркировки) = Тип("Массив") Тогда

				Для каждого ТекМаркировка из ТекСтрокаТЗ.Маркировки Цикл

					Если НЕ ЗначениеЗаполнено(ТекМаркировка) Тогда
						Продолжить;
					КонецЕсли;

					НайденнаяМаркировка = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(ТекМаркировка);

					Если НайденнаяМаркировка = Неопределено Тогда
						Б_ОбменССайтомСервер.СообщитьПодробно("У документа " + НазваниеДокумента + " с ИД:" + ДокументXML.Ид + " не найден штрихкод:" + ТекМаркировка, ПараметрыОбмена);
					Иначе	
						НоваяСтрокаМаркировки = Документ.ШтрихкодыУпаковок.Добавить();	
						НоваяСтрокаМаркировки.ШтрихкодУпаковки = НайденнаяМаркировка;
					КонецЕсли;

				КонецЦикла;

			КонецЕсли;

		КонецЦикла;


	КонецЕсли;

	#КонецОбласти

	Если ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить оперативно" тогда
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Истина);
	ИначеЕсли ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить не оперативно" тогда
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Ложь);

	Иначе

		лПроводитьДокумент 		= ПроверкаНаПроведениеПоДополнительнымУсловиям(ПараметрыОбмена, НазваниеДокумента, ДокументОтменен, ДокументXML, Документ);
		ДокументСозданИзменен 	= ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, лПроводитьДокумент, Ложь);

	КонецЕсли;

	Если ДокументСозданИзменен тогда 

		Если НазваниеДокумента = "ОперацияПоПлатежнойКарте" ИЛИ НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда
			ЗаполнитьИнформациюОЧеке(Документ.Ссылка, ДокументXML);
		ИначеЕсли НазваниеДокумента = "ЗаказКлиента" тогда 

			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда

				Если ПараметрыОбмена.НастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СостоянияЗаказов" тогда

					ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");

					Если ИдСтатуса 	<> Неопределено тогда

						НайденноеСостояниеЗаказа = ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияСостоянийЗаказа.Найти(ИдСтатуса);

						Если НайденноеСостояниеЗаказа <> Неопределено тогда
							НоваяЗапись = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьМенеджерЗаписи();
							НоваяЗапись.Заказ 		= Документ.Ссылка;
							НоваяЗапись.ДатаСобытия = ТекущаяДатаСеанса();
							НоваяЗапись.Состояние 	= НайденноеСостояниеЗаказа.Статус;
							НоваяЗапись.Записать();
						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, НовыйДокумент, ДокументОтменен);
	КонецЕсли;
	#КонецУдаления
	#Вставка
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2020 10:41:24 если экваринговая операция точно оплачена, создаем её. задача 552
	Если НазваниеДокумента="ОперацияПоПлатежнойКарте" Тогда
		ДокументОплачен = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Оплачено");
		ДокументОплачен = ?((ДокументОплачен = Неопределено ИЛИ ДокументОплачен = "false"), Ложь, Истина);
		Если НЕ ДокументОплачен Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	//Смарт }Подкин Алексей Иванович 01.12.2020 10:41:24
	
	Если НовыйДокумент И НЕ ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Документ = Документы[НазваниеДокумента].СоздатьДокумент();	
	ИначеЕсли НовыйДокумент И ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Помеченный на удаление документ  '"+ НазваниеДокумента + "' не загружаем.", ПараметрыОбмена);
		Возврат;   
	Иначе             
		Документ = СсылкаНаДокумент.ПолучитьОбъект();  		
	КонецЕсли;   
	
	Если ДокументXML.ПометкаУдаления = ИСТИНА тогда
		
		Попытка 
			Документ.УстановитьПометкуУдаления(Истина);
			Б_ОбменССайтомСервер.СообщитьПодробно("Помечен на удаление документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		Исключение
			Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось удалить документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		КонецПопытки;
		
		Возврат;
		
	КонецЕсли;
	
	ВремТабТЧ = ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов.Скопировать();
	ВремТабТЧ.Свернуть("ТабличнаяЧасть, Документ, ПолеXML");
	
	мНастройкиДокумента	= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ДокументыЗагрузки);
	мРеквизитыДокумента = ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияШапокДокументов);
	мТабличныеЧасти		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ВремТабТЧ); 
	мРеквизитыТЧ		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов);
	
	Если мНастройкиДокумента.Количество() = 0 тогда
		
		Б_ОбменССайтомСервер.СообщитьПодробно("У документа " + НазваниеДокумента + " не найдены основные параметры документа в настройках соответствий. Загрузка документа невозможна.", ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	ОсновныеНастройкиДокумента = мНастройкиДокумента[0];
	
	Для Каждого ТекРеквизит из мРеквизитыДокумента Цикл
		
        Если НЕ ПустаяСтрока(ТекРеквизит.Значение) тогда
            
            //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 03.11.2021 10:03:06 - задача 552
			Если ТекРеквизит.Значение="Менеджер" ИЛИ ТекРеквизит.Значение="Автор" Тогда
                 Продолжить;
            КонецЕсли;             
            //Смарт }Подкин Алексей Иванович 03.11.2021 10:03:06

			Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОтменен = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
	ДокументОтменен = ?((ДокументОтменен = Неопределено ИЛИ ДокументОтменен = "false"), Ложь, Истина);
	
	Если ОсновныеНастройкиДокумента.НумерацияДокументов =  "С сайта" тогда
		Документ.Номер = ДокументXML.Номер; 	
	Иначе
		Если НовыйДокумент тогда
			
			Документ.УстановитьНовыйНомер();	
			
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ТекТабЧасть из мТабличныеЧасти Цикл
		
		СтараяТабличнаяЧасть = Документ[ТекТабЧасть.ТабличнаяЧасть].Выгрузить();
		
		Документ[ТекТабЧасть.ТабличнаяЧасть].Очистить();
		
		Если ТекТабЧасть.ПолеXML = "" тогда
			
			Массив = новый Массив;
			Массив.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
			лТипРеквизита = Новый ОписаниеТипов(Массив);
			
			Заказ = ПолучитьОснование(ДокументXML, лТипРеквизита);
			
			Если ЗначениеЗаполнено(Заказ) тогда
				
				тзнНДС = Заказ.Товары.Выгрузить(); 
				тзнНДС.Свернуть("СтавкаНДС", "СуммаНДС, Сумма, СуммаСНДС");
				
				ОплатаВсего = Документ.СуммаДокумента;
				
				Для Каждого ТекНДС из  тзнНДС Цикл
					
					Если ОплатаВсего < ТекНДС.Сумма Тогда
						СуммаРасшифровка = ОплатаВсего;
					Иначе
						СуммаРасшифровка = ТекНДС.Сумма;
						ОплатаВсего = ОплатаВсего - ТекНДС.Сумма; 
					КонецЕсли;
					
					НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();
					
					Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл
						
						Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) тогда
							
							НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, , НовСтрока, СтараяТабличнаяЧасть);	
							
						КонецЕсли;
						
					КонецЦикла;
					
					#Область ОсобенностиПКО
					Если НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда
						
						СтруктураПересчетаСуммы = Новый Структура;
						СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
						
						СтруктураДействий = Новый Структура;
						СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
						
						ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НовСтрока, СтруктураДействий, Неопределено);
					КонецЕсли;	
					#КонецОбласти
					
					НовСтрока.Сумма					= СуммаРасшифровка;		
					НовСтрока.СуммаВзаиморасчетов	= СуммаРасшифровка;		
					НовСтрока.СтавкаНДС				= ТекНДС.СтавкаНДС;		
					
					Если ТекНДС.Сумма = 0 Тогда
						НовСтрока.СуммаНДС = 0;	
					Иначе
						НовСтрока.СуммаНДС = Окр(ТекНДС.СуммаНДС*СуммаРасшифровка/ТекНДС.Сумма,2);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для каждого ТекСтрокаТЗ из ДокументXML[ТекТабЧасть.ПолеXML] Цикл
				
				Если ДокументXML[ТекТабЧасть.ПолеXML].Колонки.Найти("Количество") <> Неопределено тогда
					Если ТекСтрокаТЗ.Количество = 0 тогда
						Продолжить;	
					КонецЕсли;
					
				КонецЕсли;	
				
				Если ТекСтрокаТЗ.Ид = "ORDER_DELIVERY" И ДокументXML.ХозОперация = "Отпуск товара" тогда
					
					СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, ТекСтрокаТЗ);
					
					Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
						Продолжить;
					Иначе
						ТоварДоставка = СтрИнформацииОНоменклатуре.Номенклатура;	
						
						Если ТоварДоставка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда
							
							Если НЕ ТоварДоставка.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг тогда
								Продолжить;
							КонецЕсли;
							
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли;				
				
				НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();
				
				Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл
					
					Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) И ТекРеквизитТЧ.ТабличнаяЧасть = ТекТабЧасть.ТабличнаяЧасть тогда
						
						НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, ТекСтрокаТЗ, НовСтрока, СтараяТабличнаяЧасть);	
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТекТабЧасть.ТабличнаяЧасть = "Товары" И (НазваниеДокумента = "ЗаказКлиента" или НазваниеДокумента = "РеализацияТоваровУслуг") тогда
					
					СтруктураДействий = Новый Структура;
					
					ПересчитатьСтрокуДокумента(Документ, НовСтрока);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#Область ОсобенностиЗаказовИОтгрузок
	Если НазваниеДокумента = "ЗаказКлиента" или НазваниеДокумента = "РеализацияТоваровУслуг" тогда
		Если ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе Тогда
			Если ДокументXML.Скидки <> Неопределено тогда
				СуммаСкидки = 0;
				Для Каждого СтрокаСкидки Из ДокументXML.Скидки Цикл
					
					Если ЗначениеЗаполнено(СтрокаСкидки.Сумма) И СтрокаСкидки.УчтеноВСумме Тогда
						
						СуммаСкидки = СуммаСкидки + СтрокаСкидки.Сумма;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если СуммаСкидки <> 0 Тогда
					
					Если Документ.Товары.Количество() > 0 Тогда
						РаспределитьСуммуПоКолонке(Документ, Документ.Товары, -СуммаСкидки);
					КонецЕсли;
					
				КонецЕсли;  				
				
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту"					, Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет"		, Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки"	, Истина);
		СтруктураПараметры.Вставить("УправляемыеСкидки"					, Неопределено);
		СтруктураПараметры.Вставить("РеализацияСверхЗаказа"				, Ложь);
		
		Если ПараметрыОбмена.ИспользоватьАвтоматическиеСкидкиВПродажах тогда
			СкидкиНаценкиСервер.Рассчитать(Документ, СтруктураПараметры);
		КонецЕсли;
		
		Документ.СуммаДокумента = Документ.Товары.Итог("Сумма");
		
		Если НазваниеДокумента = "ЗаказКлиента" тогда
			Документ.ЗаполнитьЭтапыГрафикаОплаты();
			
			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда
				Если ПараметрыОбмена.НастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СвойствоЗаказов" тогда
					
					ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");
					
					Если ИдСтатуса 	<> Неопределено тогда
						
						НайденноеЗначениеСвойства =ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияЗначенийСвойствЗаказа.Найти(ИдСтатуса);
						
						Если НайденноеЗначениеСвойства <> Неопределено тогда
							
							СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа);
							
							Если СтрокаДР = Неопределено Тогда
								НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
							Иначе
								НовоеСвойство = СтрокаДР	
							КонецЕсли;
							
							НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа; 
							НовоеСвойство.Значение = НайденноеЗначениеСвойства.Статус; 
							
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда
				Если ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.ИсточникСлужбДоставкиЗаказа = "СвойствоЗаказов" тогда
					
					ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");
					
					Если ИдМетодаДоставки 	<> Неопределено тогда
						
						НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствЗаказа.Найти(ИдМетодаДоставки);
						
						Если НайденноеЗначениеСвойства <> Неопределено тогда
							
							СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа);
							
							Если СтрокаДР = Неопределено Тогда
								НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
							Иначе
								НовоеСвойство = СтрокаДР	
							КонецЕсли;
							
							НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа; 
							НовоеСвойство.Значение = НайденноеЗначениеСвойства.Служба; 
							
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НазваниеДокумента = "РеализацияТоваровУслуг" тогда
			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда
				
				ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");
				
				Если ИдМетодаДоставки 	<> Неопределено тогда
					
					НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствОтгрузки.Найти(ИдМетодаДоставки);
					
					Если НайденноеЗначениеСвойства <> Неопределено тогда
						
						СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки);
						
						Если СтрокаДР = Неопределено Тогда
							НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
						Иначе
							НовоеСвойство = СтрокаДР	
						КонецЕсли;
						
						НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки; 
						НовоеСвойство.Значение = НайденноеЗначениеСвойства.Служба; 
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Документ.Склад);
		СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Документ.Склад, СкладГруппа, Документ.Товары, Ложь);
		
	КонецЕсли;
	#КонецОбласти
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.09.2021 11:33:42
	Если НазваниеДокумента = "ЗаказКлиента" Тогда
		смартДозаполнениеДокументаЗаказ(Документ,ДокументXML,ПараметрыОбмена);
	КонецЕсли; 
	
	Если НазваниеДокумента = "ОперацияПоПлатежнойКарте" Тогда
		смартДозаполнениеДокументаОпПоПлКарте(Документ,ДокументXML,ПараметрыОбмена);
    КонецЕсли; 
    //Убрал отмену перезаписи, т.к. Факт со своей стороны обрабатывает 12.11.2021 г.
	//Смарт }Подкин Алексей Иванович 08.09.2021 11:33:42 - задача 552 тестирую отмена записи онлайн документа
    //ОффлайнЗаказ = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Оффлайн заказ");
    //Если ОффлайнЗаказ="N" И НЕ НовыйДокумент И Документ.Проведен И НазваниеДокумента = "ЗаказКлиента" Тогда
    //   ДокументСозданИзменен=Истина;
    //иначе
        //}---------------------------------1
        
        Если ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить оперативно" тогда
            ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Истина);
        ИначеЕсли ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить не оперативно" тогда
            ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Ложь);
            
        Иначе
            
            лПроводитьДокумент 		= ПроверкаНаПроведениеПоДополнительнымУсловиям(ПараметрыОбмена, НазваниеДокумента, ДокументОтменен, ДокументXML, Документ);
            ДокументСозданИзменен 	= ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, лПроводитьДокумент, Ложь);
            
        КонецЕсли;
        
    //{--------------------------------->2
    //КонецЕсли; 
    //}---------------------------------<2

	Если ДокументСозданИзменен тогда 
		
		Если НазваниеДокумента = "ОперацияПоПлатежнойКарте" ИЛИ НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда
			ЗаполнитьИнформациюОЧеке(Документ.Ссылка, ДокументXML);
		ИначеЕсли НазваниеДокумента = "ЗаказКлиента" тогда 
			
			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда
				
				Если ПараметрыОбмена.НастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СостоянияЗаказов" тогда
					
					ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");
					
					Если ИдСтатуса 	<> Неопределено тогда
						
						НайденноеСостояниеЗаказа = ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияСостоянийЗаказа.Найти(ИдСтатуса);
						
						Если НайденноеСостояниеЗаказа <> Неопределено тогда
							НоваяЗапись = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьМенеджерЗаписи();
							НоваяЗапись.Заказ 		= Документ.Ссылка;
							НоваяЗапись.ДатаСобытия = ТекущаяДата();
							НоваяЗапись.Состояние 	= НайденноеСостояниеЗаказа.Статус;
							НоваяЗапись.Записать();
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, НовыйДокумент, ДокументОтменен);
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ПересчитатьСтрокуДокумента")
Процедура смарт_ПересчитатьСтрокуДокумента(Документ, СтрокаТЧ)

	#Удаление
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Документ));
	Если МетаданныеОбъекта.ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураДанных = Новый Структура;
	Для каждого ТекРеквизит Из МетаданныеОбъекта.ТабличныеЧасти.Товары.Реквизиты Цикл  
		СтруктураДанных.Вставить(ТекРеквизит.Имя, Неопределено);
	КонецЦикла;  

	СтруктураДанных.Вставить("ТипНоменклатуры", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "ТипНоменклатуры")); 

	ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТЧ);

	СтруктураДействий = Новый Структура;                  

	//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет" 
	//СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ);
	СтруктураПересчетаСуммы = Неопределено;
	//-- #Б3686 смарт: Шляпников 03.07.2025

	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата", Документ.Организация, Документ.НалогообложениеНДС, Документ.Дата));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Документ.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");       
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));

	//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет" 
	//ПакетнаяОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(СтруктураДанных, СтруктураДействий, Неопределено);    
	//-- #Б3686 смарт: Шляпников 03.07.2025

	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураДанных);  
	#КонецУдаления
	#Вставка
	СтруктураДействий = Новый Структура;                  
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	
	ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ЗагрузкаДокументовССайта")
Процедура смарт_ЗагрузкаДокументовССайта(ПараметрыОбмена)

	ОтветСервера = "";
	Соединение = Неопределено;
	ТипСоединения = "sale";

	НастройкиПодключения = ПараметрыОбмена.НастройкиПодключения;

	АдресДляРаботы = НастройкиПодключения.АдресСкрипта + "?type=" + ТипСоединения; 

	Б_ОбменССайтомСервер.СообщитьПодробно("Отправка запроса на авторизацию.", ПараметрыОбмена);

	Успешно = Б_ОбменССайтомСервер.АвторизацияВыполнена(Соединение, НастройкиПодключения, ОтветСервера, ПараметрыОбмена, ТипСоединения);

	Если Не Успешно Тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Авторизация на сайте не выполнена.", ПараметрыОбмена, Истина, Истина);	
		Возврат;
	КонецЕсли;

	КукиИмя				= СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение		= СтрПолучитьСтроку(ОтветСервера, 3);
	Попытка
		Токен			= "&" + СтрПолучитьСтроку(ОтветСервера, 4);
	Исключение
		Б_ОбменССайтомСервер.СообщитьПодробно("CSRF токен не поддерживается. Для того, чтобы поддерживался - необходимо обновить БУС.", ПараметрыОбмена);	
	КонецПопытки;

	ЗаголовкиЗапросов	= "Cookie: " + КукиИмя + "=" + КукиЗначение;

	Б_ОбменССайтомСервер.СообщитьПодробно("Отправка запроса на инициализацию, для определения версии обмена данных.", ПараметрыОбмена);
	ОтветСервераОИнициализации = Б_ОбменССайтомСервер.ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_Инициализация + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы , ЗаголовкиЗапросов, ПараметрыОбмена);

	Если ОтветСервераОИнициализации = Неопределено Тогда 

		Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось провести инициализацию. Загрузка с сайта невозможна", ПараметрыОбмена);	
		Возврат;

	КонецЕсли;

	Попытка

		ВерсияXML		= СтрПолучитьСтроку(ОтветСервераОИнициализации, 4);

		ВерсияЧислом 	= Число(Прав(ВерсияXML,4)); 

	Исключение

		Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось получить версию XML. Загрузка с сайта невозможна", ПараметрыОбмена);
		Б_ОбменССайтомСервер.СообщитьПодробно("Ответ сервера: " + ОтветСервераОИнициализации, ПараметрыОбмена);
		Возврат;

	КонецПопытки;

	Если ВерсияЧислом < 2.08 тогда

		Б_ОбменССайтомСервер.СообщитьПодробно("Версия Commerce ML не 2.08, а " + Строка(ВерсияЧислом) + ". Загрузка документов этим модулем обмена невозможна.", ПараметрыОбмена);	
		Возврат;

	КонецЕсли;

	лЕстьДокументы = Истина;

	Пока лЕстьДокументы Цикл
		ОписаниеОшибки = "";

		Б_ОбменССайтомСервер.СообщитьПодробно("Отправка запроса на получение заказов с сайта.", ПараметрыОбмена);

		ОтветСервера = Б_ОбменССайтомСервер.ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ПолучитьДанные + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы, ЗаголовкиЗапросов, ПараметрыОбмена);

		Если ОтветСервера = Неопределено Тогда 
			Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось загрузить данные с сервера.", ПараметрыОбмена);	
			Возврат;

		КонецЕсли;

		СтрокаCML = "";

		Если Лев(ОтветСервера, 2) = "PK" Тогда
			СтрокаCML = РаспаковкаZIPАрхива(ОтветСервера);
		Иначе
			Если Лев(ОтветСервера, 5) = "<?xml" Тогда
				СтрокаCML = ОтветСервера;
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаCML) Тогда
			Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось прочитать данные, загруженные с сервера.", ПараметрыОбмена);
			Возврат;
		КонецЕсли;

		#Вставка
		// !!!УДАЛИТЬ, В ПРОД НЕ 
		ИмяФайла = СтрШаблон("home\exchange\shlyapnikov\Данные с сайта\Заказы с сайта %1.xml", Формат(ТекущаяДатаСеанса(), "ДФ=гггг_ММ_дд__ЧЧ_мм_сс"));
		
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(СтрокаCML);
		Текст.Записать(ИмяФайла);
		#КонецВставки
		
		лЕстьДокументы = ОбработатьКонтейнеры(СтрокаCML, ПараметрыОбмена);

	КонецЦикла;

	ОтветСервера = Б_ОбменССайтомСервер.ПолучитьДанныеССервера(Соединение, АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта + Токен + "&version=" + ПараметрыОбмена.ВерсияСхемы , ЗаголовкиЗапросов, ПараметрыОбмена);

	Если ОтветСервера = Неопределено Тогда 
		Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось отправить сообщение на сайт, что заказы получены и обработаны.", ПараметрыОбмена);	
	КонецЕсли;

	Если СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) <> "success" Тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось отправить сообщение на сайт, что заказы получены и обработаны.", ПараметрыОбмена);	
		Б_ОбменССайтомСервер.СообщитьПодробно("Ответ сервера: " + ОтветСервера, ПараметрыОбмена);	
	Иначе
		Б_ОбменССайтомСервер.СообщитьПодробно("Сообщение на сайт, что заказы получены и обработаны, доставлено.", ПараметрыОбмена);	
	КонецЕсли;



КонецПроцедуры

#КонецОбласти
