////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на клиенте
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция выполняет переопределяемую команду
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма, в которой расположена команда
//  Команда	- КомандаФормы - команда формы
//  ДополнительныеПараметры	- Структура - дополнительные параметры
//
// Возвращаемое значение:
//	Булево - результат выполнения.
//
Функция ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяКоманды = Команда.Имя;
	
	// +Рабочий стол
	СписокДоступныхФормРабочегоСтола = CRM_РабочийСтолСервер.ПолучитьСписокДоступныхФорм();
	Если СписокДоступныхФормРабочегоСтола.НайтиПоЗначению(Форма.ИмяФормы) <> Неопределено Тогда
		Если СтрНайти(Команда.Имя, "crm_СкрытаяКнопкаТумблера_") Тогда
			CRM_РабочийСтолКлиент.ВыборИзСпискаСкрытыхФорм(Форма, Команда);
		КонецЕсли;
		Если СтрНайти(Команда.Имя, "crm_КнопкаТумблера_") Тогда
			CRM_РабочийСтолКлиент.ТумблерРабочегоСтолаПриИзменении(Форма, Команда);
		КонецЕсли;	
		Если Команда.Имя = "crm_НастройкиРабочегоСтола" Тогда
			CRM_РабочийСтолКлиент.ОткрытьФормуНастроек(Форма, Команда);
		КонецЕсли;
		Если Команда.Имя = "crm_Поддержка" Тогда
			CRM_РабочийСтолКлиент.ОткрытьФормуПоддержки(Форма, Команда);
		КонецЕсли;
		Если Команда.Имя = "скИндикаторНапоминаний" ИЛИ Команда.Имя = "CRM_ОткрытьЗаметки" ИЛИ Команда.Имя = "скСоздатьПоручение" ИЛИ Команда.Имя = "скЗакрытьНапоминания" ИЛИ Команда.Имя = "скЗакрытьЗаметки" Тогда
			Если Команда.Имя = "скИндикаторНапоминаний" Тогда
				Попытка
					ПоддерживаетРабочийСтол = Форма.ПоддерживаетРабочийСтол;
				Исключение
					CRM_НапоминанияКлиент.ВывестиАктивныеНапоминания(Ложь);
					Возврат Ложь;
				КонецПопытки;	
			КонецЕсли;	
			
			Если Команда.Имя = "CRM_ОткрытьЗаметки" Тогда
				Попытка
					ПоддерживаетРабочийСтол = Форма.ПоддерживаетРабочийСтол;
				Исключение
					CRM_РабочийСтолКлиент.КомандаЗаметкиВсе(Форма, Команда);
					Возврат Ложь;
				КонецПопытки;	
			КонецЕсли;
			CRM_РабочийСтолКлиент.ОбработкаГипперссылкиДействийНажатие(Форма, Команда);
		КонецЕсли;
		Если Команда.Имя = "скНапоминанияСкрыть" Тогда
			CRM_РабочийСтолКлиент.СкрытьНапоминания(Форма);
		КонецЕсли;
		Если Команда.Имя = "скЗаметкиСкрыть" Тогда
			CRM_РабочийСтолКлиент.СкрытьЗаметки(Форма);
		КонецЕсли;
		Если Команда.Имя = "скНапоминанияПрекратитьВсе" Тогда
			CRM_РабочийСтолКлиент.КомандаНапоминанийПрекратитьВсе(Форма, Команда);
		КонецЕсли;	
		Если Команда.Имя = "скНапоминанияПеренестиВсе" Тогда
			CRM_РабочийСтолКлиент.КомандаНапоминанийПеренестиВсе(Форма, Команда);
		КонецЕсли;
		Если Команда.Имя = "скЗаметкиОткрытьВсе" Тогда
			CRM_РабочийСтолКлиент.КомандаЗаметкиВсе(Форма, Команда);
		КонецЕсли;
		Если Команда.Имя = "скЗаметкиДобавить" Тогда
			CRM_РабочийСтолКлиент.КомандаЗаметкиДобавить(Форма, Команда);
		КонецЕсли;
		Если Команда.Имя = "CRM_ОткрытьПомощь" Тогда
			ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("УниверсальныйРабочийСтол"));
		КонецЕсли;
		// +СофтФон
		Если Команда.Имя = "сфпИндикаторАктивногоЗвонка" Тогда
			сфпСофтФонПроКлиент.ОткрытьПанельЗвонка(Форма, Команда);
		КонецЕсли;
		// -СофтФон
	КонецЕсли;
	// -Рабочий стол
	
	// +Классификаторы
	CRM_КлассификаторыКлиент.ВыполнитьКоманду(Форма, Команда, ДополнительныеПараметры);
	// -Классификаторы
	
	CRM_ТриггерыКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "CRM_ТаблицаИнтересов") Тогда
		МодульРаботаСФормамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("CRM_МетодыФормДокументовКлиент");
		МодульРаботаСФормамиКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
	CRM_БизнесПроцессыИЗадачиКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда Возврат Истина КонецЕсли;
	
	CRM_МодификацияКонфигурацииКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	
	Возврат Истина;
КонецФункции

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ИмяСобытия				- Строка - идентификатор сообщения принимающей формой (см. метод Оповестить)
//	Параметр				- Произвольный - параметр сообщения (см. метод Оповестить)
//	Источник				- Произвольный - источник события (см. метод Оповестить)
//  ДополнительныеПараметры	- Структура - дополнительные параметры
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЗадачаИсполнителя") Тогда
		CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		CRM_ТриггерыКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		CRM_ТрудозатратыКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииКлиентПереопределяемый.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от записи документа
//	ПараметрыЗаписи			- Структура - параметры записи (см. событие ПередЗаписью)
//
Процедура ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	РежимЗаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					ПараметрыЗаписи, "РежимЗаписи", РежимЗаписиДокумента.Запись);
	
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ПараметрыЗаписи			- Структура - параметры записи (см. событие ПослеЗаписи)
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
			
			ТипСсылкиФормы = ТипЗнч(Форма.Объект.Ссылка);
			ТипыОбъектовЖурнала = ПараметрыПриложения["CRM_ТипыОбъектовЖурналаДокументов"];
			Если ТипыОбъектовЖурнала.Найти(ТипСсылкиФормы) <> Неопределено Тогда
				Оповестить("ЛентаСобытий_Обновить");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти
