
#Область ДоработкиСмарт

&ИзменениеИКонтроль("ЗаполнитьИсполнителейЭтаповБизнесПроцесса")
//++ #Б-2208 смарт: Фролов 24.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Процедура смарт_ЗаполнитьИсполнителейЭтаповБизнесПроцесса(БизнесПроцесс, Отказ, ТаблицаИсполнителей)
	// Таблица ТаблицаИсполнителей передается из формы бизнес-процесса.
	// Если таблица не передана, значит БП вложенный или стартован программно.
	Если ТаблицаИсполнителей = Неопределено Тогда 
		// Для программно стартованных БП берем настройки карты.
		НаборИсполнители = РегистрыСведений.CRM_ИсполнителиЭтапов.СоздатьНаборЗаписей();

		Если ЗначениеЗаполнено(БизнесПроцесс.Проект)
			И (БизнесПроцесс.Проект.CRM_КартаМаршрута = БизнесПроцесс.КартаМаршрута) Тогда
			НаборИсполнители.Отбор.Объект.Установить(БизнесПроцесс.Проект);
			НаборИсполнители.Прочитать();
			Если НаборИсполнители.Количество() = 0 Тогда
				НаборИсполнители.Отбор.Сбросить();
				НаборИсполнители.Отбор.Объект.Установить(БизнесПроцесс.КартаМаршрута);
				НаборИсполнители.Прочитать();
			КонецЕсли;
		Иначе
			НаборИсполнители.Отбор.Объект.Установить(БизнесПроцесс.КартаМаршрута);
			НаборИсполнители.Прочитать();
		КонецЕсли;
		
		ТабНаборИсполнители = НаборИсполнители.Выгрузить();
		
		#Вставка
		//++ #Б-2208 смарт: Фролов 24.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
		УстановитьПривилегированныйРежим(Истина); 
		
		Если ЗначениеЗаполнено(БизнесПроцесс.Партнер) И ЗначениеЗаполнено(БизнесПроцесс.Партнер.ОсновнойМенеджер)
			И ТипЗнч(БизнесПроцесс.Предмет) = Тип("ДокументСсылка.CRM_Взаимодействие")
			И БизнесПроцесс.Предмет.Ответственный = БизнесПроцесс.Партнер.ОсновнойМенеджер Тогда
		
		
			ИсполнительЗамена = БизнесПроцесс.Предмет.Ответственный.Подразделение.смартИсполнительОтПодразделения;
		
			Если ЗначениеЗаполнено(ИсполнительЗамена) Тогда
			
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ТочкаМаршрута КАК ТочкаМаршрута
				|ИЗ
				|	Справочник.смартПредопределенныеЗначения.ТочкиМаршрутовДляИзмненияОтветственных");
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					
					СтрокиТабНаборИсполнители = ТабНаборИсполнители.НайтиСтроки(Новый Структура("ТочкаМаршрута", Выборка.ТочкаМаршрута));
					Для Каждого СтрТабНаборИсполнители Из СтрокиТабНаборИсполнители Цикл
						СтрТабНаборИсполнители.Исполнитель = ИсполнительЗамена;	
					КонецЦикла;	
					
				КонецЦикла;	
			
			КонецЕсли;
		
		КонецЕсли;
		//-- #Б-2208 смарт: Фролов 24.02.2025
		#КонецВставки
		
		ТабНаборИсполнители.Колонки.Удалить("Объект");
		ТабНаборИсполнители.Колонки.Добавить("Объект", Новый ОписаниеТипов("БизнесПроцессСсылка.CRM_БизнесПроцесс"));
		ТабНаборИсполнители.ЗаполнитьЗначения(БизнесПроцесс, "Объект");
	Иначе
		НаборИсполнители = РегистрыСведений.CRM_ИсполнителиЭтаповБизнесПроцессов.СоздатьНаборЗаписей();
		ТабНаборИсполнители = НаборИсполнители.ВыгрузитьКолонки();
		Для Каждого СтрокаТаб Из ТаблицаИсполнителей Цикл
			Если ТипЗнч(СтрокаТаб.Исполнитель) = Тип("СписокЗначений") Тогда
				Для Каждого ЭлементСписка Из СтрокаТаб.Исполнитель Цикл
					НоваяСтрокаТаб = ТабНаборИсполнители.Добавить();
					НоваяСтрокаТаб.Объект			= БизнесПроцесс;
					НоваяСтрокаТаб.ТочкаМаршрута	= СтрокаТаб.ТочкаМаршрута;
					НоваяСтрокаТаб.Исполнитель		= ЭлементСписка.Значение;
					НоваяСтрокаТаб.Все				= ЭлементСписка.Пометка;
				КонецЦикла;
			Иначе
				НоваяСтрокаТаб = ТабНаборИсполнители.Добавить();
				НоваяСтрокаТаб.Объект			= БизнесПроцесс;
				НоваяСтрокаТаб.ТочкаМаршрута	= СтрокаТаб.ТочкаМаршрута;
				НоваяСтрокаТаб.Исполнитель		= СтрокаТаб.Исполнитель;
			КонецЕсли;
			Если БизнесПроцесс.КартаМаршрута.УказыватьСрокВыполненияЭтапов И ЗначениеЗаполнено(СтрокаТаб.ДатаВыполнения) Тогда
				ЗаписьЭтапа = РегистрыСведений.CRM_НастройкиЭтаповБизнесПроцессов.СоздатьМенеджерЗаписи();
				ЗаписьЭтапа.Объект			= БизнесПроцесс;
				ЗаписьЭтапа.ТочкаМаршрута	= СтрокаТаб.ТочкаМаршрута;
				ЗаписьЭтапа.Прочитать();
				Если ЗаписьЭтапа.Выбран() Тогда
					ЗаписьЭтапа.ДатаВыполнения = СтрокаТаб.ДатаВыполнения;
					ЗаписьЭтапа.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Отказ = (ТабНаборИсполнители.Количество() = 0);
	Если НЕ Отказ Тогда
		НаборИсполнители = РегистрыСведений.CRM_ИсполнителиЭтаповБизнесПроцессов.СоздатьНаборЗаписей();
		НаборИсполнители.Отбор.Объект.Установить(БизнесПроцесс);
		НаборИсполнители.Прочитать();
		НаборИсполнители.Загрузить(ТабНаборИсполнители);
		НаборИсполнители.Записать();
	Иначе
		ТекстСообщения = НСтр("ru='Отсутствуют исполнители этапов карты маршрута бизнес-процесса!';en='There no executors of stages of business process route map!'");		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры //-- #Б-2208 смарт: Фролов 24.02.2025

#КонецОбласти
