
#Область ПеренесеноСДоработками

&НаКлиенте
Процедура смарт_СохранитьПосле(Команда)
	// Смарт Фролов+
	Перем Значение;
	Если Параметры.ПараметрыПечати.Свойство("Идентификатор",Значение) И СтрНайти(Значение,"СчетНаОплату")>0 Тогда 
		УстановитьСвойствоСчетНаОплатуВыставлен(ОбъектыПечати.ВыгрузитьЗначения()
		#Если ВебКлиент Тогда
			,""
		#Иначе	
			,ИмяКомпьютера()
		#КонецЕсли	
		,"Сохранение в файл");
	КонецЕсли;
	// Фролов-
КонецПроцедуры

&НаКлиенте
Процедура смарт_ОтправитьПосле(Команда)
	// Смарт Фролов+
	Перем Значение;
	Если Параметры.ПараметрыПечати.Свойство("Идентификатор",Значение) И СтрНайти(Значение,"СчетНаОплату")>0 Тогда 
		УстановитьСвойствоСчетНаОплатуВыставлен(ОбъектыПечати.ВыгрузитьЗначения()
		#Если ВебКлиент Тогда
			,""
		#Иначе	
			,ИмяКомпьютера()
		#КонецЕсли
		,"Отправка по почте");
	КонецЕсли;
	// Фролов-
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПечатьПосле(Команда)
	// Смарт Фролов+
	Перем Значение;
	Если Параметры.ПараметрыПечати.Свойство("Идентификатор",Значение) И СтрНайти(Значение,"СчетНаОплату")>0 Тогда 
		УстановитьСвойствоСчетНаОплатуВыставлен(ОбъектыПечати.ВыгрузитьЗначения()
		#Если ВебКлиент Тогда
			,""
		#Иначе	
			,ИмяКомпьютера()
		#КонецЕсли
		,"Печать");
	КонецЕсли;
	// Фролов-
КонецПроцедуры	

&НаКлиенте
&После("ДобавитьУдалитьПодписьПечать")
Процедура смартДобавитьУдалитьПодписьПечать()
	// Смарт Фролов+
	Если ПодписьИПечать Тогда 
		смартДобавитьПечать();
		смартДобавитьПодписи();
	Иначе 
		смартУдалитьПечать();
	КонецЕсли;
	// Фролов-
КонецПроцедуры	

&НаСервере
&После("НастроитьВидимостьЭлементовФормы")
Процедура смартНастроитьВидимостьЭлементовФормы(Знач ЕстьРазрешенныйВывод)
	// Смарт Фролов+
	Перем УПДВалюта;
 	Если Не Параметры.ПараметрыИсточника=Неопределено И Параметры.ПараметрыИсточника.Свойство("ИдентификаторКоманды",УПДВалюта) Тогда КонецЕсли;
	Элементы.ФлажокПодписьИПечать.Видимость=Элементы.ФлажокПодписьИПечать.Видимость Или Параметры.ИменаМакетов="УПД" Или УПДВалюта="УПД_Валюта";
	// Фролов-
КонецПроцедуры	

#КонецОбласти

#Область ДоработкиСмарт

// Смарт Фролов+
// Процедура Передает массив заказов в метод документа "Заказ клиента" УстановитьПризнакСчетНаОплатуВыставлен
// Входной параметр МасивЗаказов Тип("Массив") массив ссылок на заказы клиента
&НаСервереБезКонтекста
Процедура УстановитьСвойствоСчетНаОплатуВыставлен(МассивЗаказов,ИмяКомпьютера="",Действие)
	Документы.ЗаказКлиента.УстановитьПризнакСчетНаОплатуВыставлен(МассивЗаказов,ИмяКомпьютера,Действие);
КонецПроцедуры

// Смарт Фролов+
// Процедура добавляет в текущую печатную форму печать
&НаСервере
Процедура смартДобавитьПечать()
	Перем ОбъектыПечати;
	Если Параметры.ПараметрыПечати.Свойство("ОбъектыПечати",ОбъектыПечати) Или Параметры.ПараметрыИсточника.Свойство("ОбъектыНазначения",ОбъектыПечати) Тогда
		НомерДок=1; Высота=1;
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл 
			МП=ТекущаяПечатнаяФорма.НайтиТекст("М.П.",ТекущаяПечатнаяФорма.Область(Высота,2,Высота,2),,,Истина);
			Если МП=Неопределено Тогда Возврат; КонецЕсли;
			
			Рис=ТекущаяПечатнаяФорма.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рис.Имя="смартПечать"+НомерДок;
			Рис.ГраницаСверху=Ложь; Рис.ГраницаСлева=Ложь; Рис.ГраницаСправа=Ложь; Рис.ГраницаСнизу=Ложь;
			Рис.РазмерКартинки=РазмерКартинки.Пропорционально;
			Рис.ЦветФона=Новый Цвет();
			Если ОбъектПечати.Организация.ИНН="7709461879" Тогда 
				УстановитьПривилегированныйРежим(Истина);
				Рис.Картинка=Новый Картинка(ХранилищеОбщихНастроек.Загрузить("смартПечать",,,"Администратор"),Истина);
				УстановитьПривилегированныйРежим(Ложь);
			Иначе 
				Рис.Картинка=Новый Картинка();
			КонецЕсли;
			Рис.Высота=45; Рис.Ширина=45;
			Рис.Расположить(ТекущаяПечатнаяФорма.Область(МП.Верх-12,2,МП.Верх,2));
			Высота=МП.Верх+2;
			НомерДок=НомерДок+1;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

// Смарт Фролов+
// Процедура добавляет подписи ответственных лиц организации
Процедура смартДобавитьПодписи()
	Перем ОбъектыПечати;
	МассивОтветственных=ПолучитьОтветственных();
	Если Параметры.ПараметрыПечати.Свойство("ОбъектыПечати",ОбъектыПечати) Или Параметры.ПараметрыИсточника.Свойство("ОбъектыНазначения",ОбъектыПечати) Тогда
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
			Если ОбъектПечати.Организация.ИНН="7709461879" Тогда
				ОтветственныеЛица=ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ОбъектПечати.Организация,ОбъектПечати.Дата);
				Для Каждого Должность Из МассивОтветственных Цикл
					Если ОтветственныеЛица[Должность]=ОбъектПечати[Должность].ФизическоеЛицо Тогда
						ФИО=ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОтветственныеЛица[Должность].Наименование);
						ВывестиПодпись(?(СтрНайти(ФИО,". "),ФИО,ПолучитьФИО(ФИО,".",". ")),Должность);
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры	

// Смарт Фролов+
// Процедура выводит подпись ответственного лица в табличный документ
// поиск осуществляетс по фамилии и инициалам
Процедура ВывестиПодпись(Подпись,Должность)
	Начало=ТекущаяПечатнаяФорма.Область(1,1,1,1);
	Ном=1;
	Пока Истина Цикл 
		Ответственный=ТекущаяПечатнаяФорма.НайтиТекст(Подпись,Начало,,,Истина);
		Если Ответственный=Неопределено Тогда 
			Прервать; Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ДД=ХранилищеОбщихНастроек.Загрузить(ПолучитьФИО(Подпись,". ",""),,,"Администратор");
		УстановитьПривилегированныйРежим(Ложь);
		Если ДД=Неопределено Тогда 
			Прервать; Возврат;
		КонецЕсли;	
		
		Рис=ТекущаяПечатнаяФорма.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		Рис.Имя=Должность+Ном;
		Рис.ГраницаСверху=Ложь; Рис.ГраницаСлева=Ложь; Рис.ГраницаСправа=Ложь; Рис.ГраницаСнизу=Ложь;
		Рис.РазмерКартинки=РазмерКартинки.Пропорционально;
		Рис.ЦветФона=Новый Цвет();
		Рис.Картинка=Новый Картинка(ДД);
		Рис.Высота=25; Рис.Ширина=35;
		Если Ответственный.Лево=6 Тогда
			Обл=ТекущаяПечатнаяФорма.Область(Ответственный.Верх-4,Ответственный.Лево-3,Ответственный.Низ+1,Ответственный.Лево-3);
		Иначе
			Обл=ТекущаяПечатнаяФорма.Область(Ответственный.Верх-1,Ответственный.Лево-2,Ответственный.Низ+1,Ответственный.Лево-2);
		КонецЕсли;	
		Рис.Расположить(Обл);
		
		Начало=ТекущаяПечатнаяФорма.Область(Ответственный.Верх,Ответственный.Право+1,Ответственный.Низ,Ответственный.Право+1);
		Ном=Ном+1;
	КонецЦикла;	
КонецПроцедуры	

// Смарт Фролов+
// Процедура удаляет в текущую печатную форму печать
&НаСервере
Процедура смартУдалитьПечать()
	МассивДляУдаления=Новый Массив;
	Для Каждого Рисунок Из ТекущаяПечатнаяФорма.Рисунки Цикл 
		Если Лев(Рисунок.Имя,11)="смартПечать" Или Лев(Рисунок.Имя,12)="Руководитель" Или Лев(Рисунок.Имя,16)="ГлавныйБухгалтер" Тогда
			МассивДляУдаления.Добавить(Рисунок);
		КонецЕсли;	
	КонецЦикла;
	Для Каждого Рис Из МассивДляУдаления Цикл 
		ТекущаяПечатнаяФорма.Рисунки.Удалить(Рис);
	КонецЦикла;	
КонецПроцедуры

// Смарт Фролов+
// Функция возвращает массив строковых представлений должностей ответственных лиц организаций
Функция ПолучитьОтветственных()
	Массив=Новый Массив;
	Массив.Добавить("Руководитель");
	Массив.Добавить("ГлавныйБухгалтер");
	Возврат Массив;
КонецФункции

// Смарт Фролов+
// Функция убирает или добавляет разделители в строку
Функция ПолучитьФИО(Стр,Разделитель,Соединитель)
	Возврат СокрЛП(СтрСоединить(СтрРазделить(Стр,Разделитель),Соединитель));
КонецФункции	

#КонецОбласти