
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда 
		Запись.Автор=Пользователи.ТекущийПользователь();
		Запись.Дата=ТекущаяДатаСеанса();
	КонецЕсли;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаУдалить.Видимость=РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	МассивУжеРекомендованныхГрупп=ПолучитьМассивУжеРекомендованныхГрупп(Запись.Партнер,Запись.СотрудникДавшийРекомендацию); 
	Если МассивУжеРекомендованныхГрупп.Количество() И ГруппаВходитВУжеРекомендованные(Запись.ГруппаНоменклатуры,МассивУжеРекомендованныхГрупп) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Группа номенклатуры '"+Запись.ГруппаНоменклатуры+"' уже была рекомендована!",,"Запись.ГруппаНоменклатуры",,Отказ);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыФункции

&НаСервереБезКонтекста
Функция ГруппаВходитВУжеРекомендованные(Группа,МассвивГрупп)
	Если ЗначениеЗаполнено(Группа.Родитель) Тогда 
		Если МассвивГрупп.Найти(Группа.Родитель)=Неопределено Тогда 
			ГруппаВходитВУжеРекомендованные(Группа.Родитель,МассвивГрупп);
		Иначе
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьМассивУжеРекомендованныхГрупп(Партнер,Сотрудник)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартРекомендации.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	                    |ИЗ
	                    |	РегистрСведений.смартРекомендации КАК смартРекомендации
	                    |ГДЕ
	                    |	смартРекомендации.Партнер = &Партнер
	                    |	И смартРекомендации.СотрудникДавшийРекомендацию = &Сотрудник");
	Запрос.УстановитьПараметр("Партнер",Партнер);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаНоменклатуры");
КонецФункции	

#КонецОбласти