
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заметки.Параметры.УстановитьЗначениеПараметра("Предмет", Справочники.Партнеры.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	МассивКолонокНеИсключений = Новый Массив;
	МассивКолонокНеИсключений.Добавить("Направление");
	МассивКолонокНеИсключений.Добавить("ДатаНачала");
	МассивКолонокНеИсключений.Добавить("ДатаОкончания");
	
	Если МассивКолонокНеИсключений.Найти(Элементы.Список.ТекущийЭлемент.Имя) = Неопределено 
		И Элемент.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Партнер);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СсылкаПартнер = ?(ЗначениеЗаполнено(ТекущиеДанные.Партнер), ТекущиеДанные.Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		Заметки.Параметры.УстановитьЗначениеПараметра("Предмет", СсылкаПартнер);	
		Элементы.Заметки.Обновить();	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроектыПартнерыИКонтактныеЛица.Ссылка КАК Проект,
	|	ПроектыПартнерыИКонтактныеЛица.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_Партнеры
	|ИЗ
	|	Справочник.Проекты.ПартнерыИКонтактныеЛица КАК ПроектыПартнерыИКонтактныеЛица
	|ГДЕ
	|	ПроектыПартнерыИКонтактныеЛица.Ссылка В(&Проекты)
	|	И ПроектыПартнерыИКонтактныеЛица.НомерСтроки = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ИНН,
	|	ВТ_Партнеры.Проект КАК Проект
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Партнеры.Партнер = Контрагенты.Партнер
	|ИТОГИ ПО
	|	Проект";
	
	Запрос.УстановитьПараметр("Проекты", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПроект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПроект.Следующий() Цикл
		
		СтрокаИНН = "";
	
		Выборка = ВыборкаПроект.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ИНН) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаИНН = СтрокаИНН + ?(ЗначениеЗаполнено(СтрокаИНН), ", ", "") + Выборка.ИНН;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрокаИНН) Тогда
			СтрокаСписка = Строки[ВыборкаПроект.Проект];
			СтрокаСписка.Данные.ИНН = СтрокаИНН;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаметку(Команда)
	ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", Новый Структура("Предмет", Элементы.Список.ТекущиеДанные.Партнер), ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеСозданияНовойЗаметки",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияНовойЗаметки(Результат, ДопПараметры)Экспорт
	Элементы.Заметки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаметкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);

КонецПроцедуры





