
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЭтаФорма.ПараметрыВыбора.Свойство("смартИспользуетсяВПланированииПродаж") 
			И ЭтаФорма.ПараметрыВыбора.смартИспользуетсяВПланированииПродаж Тогда
		
		Если ЗначениеЗаполнено(Объект.Родитель) 
			И НЕ CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "смартИспользуетсяВПланированииПродаж") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Группа " + Объект.Родитель + " не используется в планировании!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;	
		
		Если Объект.Ссылка.Пустая() Тогда

			Объект.смартИспользуетсяВПланированииПродаж = Истина;
			
		КонецЕсли;	
			
	КонецЕсли;
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	Если ЭтаФорма.ПараметрыВыбора.Свойство("смартИспользуетсяКакТипНоменклатуры") 
			И ЭтаФорма.ПараметрыВыбора.смартИспользуетсяКакТипНоменклатуры Тогда
		
		Если ЗначениеЗаполнено(Объект.Родитель) 
			И НЕ CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "смартИспользуетсяКакТипНоменклатуры") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Группа " + Объект.Родитель + " не используется как вид плана!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;	
		
		Если Объект.Ссылка.Пустая() Тогда

			Объект.смартИспользуетсяКакТипНоменклатуры = Истина;
			
		КонецЕсли;	
			
	КонецЕсли;
	//-- #Б-2220 смарт: Фролов 28.02.2025
			
КонецПроцедуры
