
&НаКлиенте
Процедура ОтправитьДанные(Команда)
	
	ОтправитьДанныеНаСервере();   
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерПреалерта", НомерПреалерта);	
	
	НомерПреалерта = СтрЗаменить(НомерПреалерта, Символы.НПП, "")	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(НомерПреалерта) Тогда
		
		Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьДанныеНаСервере()
	
	ДЛ_ДеловыеЛинии.ОбновитьДанныеВодителяМашиныПреалерта(НомерПреалерта, Машина, Водитель);
	
КонецПроцедуры
