
#Область ПеренесеноСДоработками

// Смарт Фролов+ 
// Добавим проверку на заполненость Статьи ДДС
&После("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//смартКаратеев ++
	Если НЕ (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеТиповыхСоглашенийСКлиентами"))Тогда
		ПроверяемыеРеквизиты.Добавить("ГруппаФинансовогоУчета");
		ПроверяемыеРеквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
		ПроверяемыеРеквизиты.Добавить("Соглашение");
	КонецЕсли;
	//Каратеев --
	
	//Если Не ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда 
	//	ТекстОшибки = НСтр("ru='Не указана Статья ДДС.'");
	//	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		ТекстОшибки,
	//		ЭтотОбъект,
	//		"СтатьяДвиженияДенежныхСредств",
	//		,
	//		Отказ);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти