
#Область ПеренесеноСДоработками

// Фролов+
&Перед("ОпределитьОбъектыСКомандамиПечати")
Процедура смарт_ОпределитьОбъектыСКомандамиПечати(СписокОбъектов)
	СписокОбъектов.Добавить(Документы.смартПредзаказПоставщику);
	
	//++ смарт:ММ #048 234 17.05.2020 - Заявка на пусконаладку  
	СписокОбъектов.Добавить(Документы.смартЗаявкаНаПускоНаладку);
	//-- смарт:ММ 17.05.2020
	
	// ++ 19.07.2020 #044
	СписокОбъектов.Добавить(Документы.смартЗаявкаНаГарантийныйРемонт);

	// ++ 13.11.2020 #082
	СписокОбъектов.Добавить(Документы.смартЗаявкаНаРемонтныеРаботы);
	
	// ++ 16.01.2021 #092
	СписокОбъектов.Добавить(Документы.смартIECHOСпецификация);
	
	// ++ 25.03.2021 #099 409
	СписокОбъектов.Добавить(Документы.смартРегламентноеОбслуживаниеКлиентов);
	
	//++ смарт:Демичев #1237 26.12.2022((
	//СписокОбъектов.Добавить(Справочники.демоОборудованиеДляДемонстрации);
	//-- смарт:Демичев #1237 26.12.2022(( 
	
	//++ #1498 смарт: Фролов 25.10.2023 //Разработать план продаж
	СписокОбъектов.Добавить(Документы.смартПланПродажПоМенеджерам);
	//-- #1498 смарт: Фролов 25.10.2023
	
	//++ #Б1226 смарт: Шляпников 25.10.2024 / Интеграция с WMS. Загрузка и хранение данных об остатках складов отв. хранения
	СписокОбъектов.Добавить(Документы.смартОтражениеОстатковНоменклатурыСОХ);
	//-- #Б1226 смарт: Шляпников 25.10.2024

КонецПроцедуры
// Фролов-

#КонецОбласти