
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&После("КонтактнаяИнформацияПриСменеСтраницы")
Процедура смарт_КонтактнаяИнформацияПриСменеСтраницы()
	////++#1012 смарт: Холопов 04.05.2022 //  Добавление подсказок для программно добавленных элементов и телефонов в КИ
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);
	////--#1012 смарт: Холопов 04.05.2022 
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ #1246 смарт: Фролов 21.11.2022 //Описание  
	//Если ЭтаФорма.Элементы.Найти("смартГруппаГрузоотправители") = Неопределено ТОгда
		ГруппаГрузоотправители = ЭтаФорма.Элементы.Вставить("смартГруппаГрузоотправители", Тип("ГруппаФормы"),ЭтаФорма.Элементы.СтраницыПараметрыОрганизации,Неопределено);
		ГруппаГрузоотправители.Вид = ВидГруппыФормы.Страница;
		ГруппаГрузоотправители.Заголовок = "Группа грузоотправители (смарт)";
				
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартУведомлениеДоступа", Тип("ДекорацияФормы"), ГруппаГрузоотправители);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Для внесения изменений в таблицу Грузоотправители, обратитесь пожалуйста к администратору 1С.";
		НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		НовыйЭлемент.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
		НовыйЭлемент.МаксимальнаяШирина = 100;
		
		ТаблицасмартГрузоотправители = Элементы.Добавить("смартГрузоотправители", Тип("ТаблицаФормы"),ГруппаГрузоотправители);
		ТаблицасмартГрузоотправители.ПутьКДанным = "Объект.смартГрузоотправители";
		НовыйЭлемент1  = ЭтаФорма.Элементы.Добавить("смартГрузоотправителиСклад",Тип("ПолеФормы"),ТаблицасмартГрузоотправители);
		НовыйЭлемент1.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент1.ПутьКДанным = "Объект.смартГрузоотправители.Склад";
		НовыйЭлемент2  = ЭтаФорма.Элементы.Добавить("смартГрузоотправителиГрузоотправитель",Тип("ПолеФормы"),ТаблицасмартГрузоотправители);
		НовыйЭлемент2.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент2.ПутьКДанным = "Объект.смартГрузоотправители.Грузоотправитель";    
	//КонецЕсли;

	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.смартГрузоотправители.ТолькоПросмотр=Истина;
	КонецЕсли;
	//-- #1246 смарт: Фролов 21.11.2022
КонецПроцедуры
	
#КонецОбласти