////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, управляющие настройками системы
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик подписки на событие ПриЗаписиКонстанты.
//
// Параметры:
//	Источник	- КонстантаОбъект	- Константа.
//	Отказ		- Булево			- Признак отказа.
//
Процедура ПриЗаписиКонстанты(Источник, Отказ) Экспорт
	
	// исключаем дублирование выполнения
	Если Метаданные.ПодпискиНаСобытия.Найти("ПриЗаписиКонстанты") <> Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НастройкиСистемы.ПриЗаписиКонстанты(Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти

