
#Область ПеренесеноСДоработками

&НаСервере
Процедура смартПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Смарт Фролов+
	смартПодписан=смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка,"Подписан");
	смартОтветственныйЗаПодпись=смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка,"ПодписавшийДокумент");
	смартСчетФактура=УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(Объект.Ссылка,Объект.Организация);
	смартИмяФайла=смартСервер.ПолучитьИмяФайлаДляБуфераОбмена(Объект.ЗаказКлиента,смартСчетФактура);
	УстановитьВидимостьПодписиДокумента();
	// Фролов-
КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Смарт Фролов+
&НаСервере
Процедура УстановитьВидимостьПодписиДокумента()
	Элементы.ГруппаПодписьДокументаДоп.Видимость=смартПодписан;
	ЭтаФорма.ТолькоПросмотр=смартПодписан И Не РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаКлиенте
Процедура смартСкопировать(Команда)
	DOM=Элементы.смартБФ.Документ.DefaultView.document;
	textArea=DOM.createElement("textarea");
	textArea.value=смартИмяФайла;
	DOM.body.appendChild(textArea);
	textArea.focus();
	textArea.select();
	DOM.execCommand("copy");
	DOM.body.removeChild(textArea);
КонецПроцедуры

&НаКлиенте
Процедура смартПодписьПриИзменении(Элемент)
	Если смартПодписан Тогда 
		Если ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена() Тогда 
			смартСкопировать(Неопределено);
		КонецЕсли;
	Иначе
		СнятьПодписьСДокумента();
		УстановитьВидимостьПодписиДокумента();
	КонецЕсли;
	Оповестить("ПодписьДокумента",смартПодписан,Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура СнятьПодписьСДокумента()
	смартСервер.УстановитьДокументПодписан(Объект.Ссылка,Объект.ЗаказКлиента,смартПодписан);
КонецПроцедуры	

&НаСервере
Функция ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена()
	ОперацияВыполнена=Ложь;
	Если смартСчетФактура=Неопределено Тогда 
		смартСчетФактура=УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(Объект.Ссылка,Объект.Организация);
		смартИмяФайла=смартСервер.ПолучитьИмяФайлаДляБуфераОбмена(Объект.ЗаказКлиента,смартСчетФактура);
	КонецЕсли;	
	ДанныеПроверки=смартСервер.ЕстьВозможностьПодписатьДокумент(Объект.Ссылка,Объект.ЗаказКлиента,смартСчетФактура);
	Если ДанныеПроверки.Результат Тогда
		смартОтветственныйЗаПодпись=ДанныеПроверки.ОтветственныйЗаПодпись;
		ОперацияВыполнена=Истина;
	Иначе
		Для Каждого Ошибка Из ДанныеПроверки.Ошибки Цикл 
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		смартПодписан=Ложь;
	КонецЕсли;
	УстановитьВидимостьПодписиДокумента();
	Возврат ОперацияВыполнена;
КонецФункции
// Фролов-
#КонецОбласти