
#Область ДоработкиСмарт

// Смарт Фролов+ Доп. расходы внесены
&НаКлиенте
Процедура смартДопРасходыВнесены(Команда)
	смартДопРасходыВнесеныСервер(Элементы.СписокДокументыЗакупки.ВыделенныеСтроки);
	Элементы.СписокДокументыЗакупки.Обновить();
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура смартДопРасходыВнесеныСервер(Знач МассивДокументов)
	Ответственный=Пользователи.ТекущийПользователь();
	Для Каждого Док Из МассивДокументов Цикл
		Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда 
			смартСервер.ИзменитьДополнительноеСвойство(Док.Ссылка, "смартОтветственныйЗаДопРасходы", Ответственный);
			смартСервер.ИзменитьДополнительноеСвойство(Док.Ссылка, "смартДопРасходыВнесены", Истина);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
// Фролов-

//++Смарт:Белоусова 522 17.05.2021
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НоваяКоманда = Команды.Добавить("КомандаСоздатьЗаказНаПеремещение");
	НоваяКоманда.Действие = "СоздатьЗаказНаПеремещение";//Имя процедуры
	НоваяКоманда.Заголовок = "Заказ на перемещение";
	
	НовыйЭлемент = Элементы.Добавить("ЭлементСоздатьЗаказНаПеремещение",
	                                 Тип("КнопкаФормы"),
									этаФорма.Элементы.СписокДокументыЗакупки.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаСоздатьЗаказНаПеремещение";
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;

КонецПроцедуры
&НаКлиенте
Процедура СоздатьЗаказНаПеремещение(команда)
	//сообщить("1");
	выделенныестроки = элементы.СписокДокументыЗакупки.ВыделенныеСтроки;
	если выделенныестроки.Количество()>0 тогда 
		Форма = ПолучитьФорму("Документ.ЗаказНаПеремещение.ФормаОбъекта");
		ДанныеФормы = Форма.Объект;
		пр = ЗаполнитьДокумент(ДанныеФормы,выделенныестроки);
		если   пр  тогда
			КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
			Форма.Открыть();
		КонецЕсли;
	иначе
		сообщить("Не выбрано ни одного документа!");
	КонецЕсли;
КонецПроцедуры


&НаСервере
функция ЗаполнитьДокумент(ДанныеФормы,выделенныестроки)
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ЗаказНаПеремещение"));
	
	Док.Дата = ТекущаяДата();
//	док.партнер = выделенныестроки[0].партнер;
	//док.контрагент = выделенныестроки[0].контрагент;
	док.организация = выделенныестроки[0].организация;
	док.подразделение = выделенныестроки[0].подразделение;
	док.СкладОтправитель = выделенныестроки[0].ссылка.Склад;
	ошибки = новый СписокЗначений;
	для каждого эл  из   выделенныестроки цикл
		если  ТипЗнч(эл.ссылка)<>тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
			ошибки.Добавить(эл.ссылка);
		иначе
			для каждого эл2 из эл.ссылка.товары цикл
				новстр = док.товары.добавить();
				новстр.номенклатура = эл2.номенклатура;
				новстр.количество = эл2.количество;
				новстр.количествоупаковок = эл2.количествоупаковок;
				новстр.упаковка = эл2.упаковка;
				новстр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;

			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	если ошибки.Количество()>0 тогда
		сообщить("В выбранном списке документов присутсвуют не только документы ПриобретениеТоваровУслуг:");
		для каждого эл из ошибки цикл
			сообщить(эл);
		КонецЦикла;
		сообщить("Выберите документы заново!");
	
		ЗначениеВДанныеФормы(Док,ДанныеФормы);	
		возврат Ложь;
	КонецЕсли;
	ошибки2 = новый СписокЗначений;
	склад = выделенныестроки[0].ссылка.Склад;
	для каждого эл  из   выделенныестроки цикл
		если склад<>эл.ссылка.Склад тогда
	    	ошибки2.Добавить(эл.ссылка);
		КонецЕсли;
	КонецЦикла;
	если ошибки2.Количество()>0 тогда
		сообщить("Выбраны документы с разными складами!");
		сообщить("Выберите документы заново!");
	
		ЗначениеВДанныеФормы(Док,ДанныеФормы);	
		возврат Ложь;
	КонецЕсли;
	ЗначениеВДанныеФормы(Док,ДанныеФормы);
	возврат истина;

КонецФункции
// Фролов-

#КонецОбласти