#Область ДоработкиСмарт
  
&После("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, Замещение)
	
	 //++ Смарт:  Демичев №№921 22.03.2022 	   
	 Если ЭтотОбъект.Количество() > 0 Тогда
		 		
		 //++ смарт:Демичев №921 22.03.2022//Сюда код попадает при внесении изменений НЕ из ОбщейФормы.РедактированиеДополнительныхСведений ЗаписатьНаборСвойствВРегистр()
		 //Поэтому заглушку надо устанавливать в 2-х местах: и в ОбщейФормы.РедактированиеДополнительныхСведений и тут
		 //Проверим на ВИП и кто устанавливает или снимает  ВИПКлиент		 
		 мДанные = ЭтотОбъект[0];
		 ПВХИД = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул","ВИПКлиент");
		 Если  ТипЗнч(мДанные.Объект) = Тип("СправочникСсылка.Партнеры") и мДанные.Свойство = ПВХИД Тогда 
			 
			 Если Не РольДоступна("ПолныеПрава") Тогда
				 
				 Если Не РольДоступна("смартРазрешитьУстановкуВИППартнеру_ДопСведение") Тогда
					 
					 Отказ = Истина;
					 
				 КонецЕсли;
				 
			 КонецЕсли;

		 КонецЕсли;
		 
	 КонецЕсли;	
	 	//-- смарт:Демичев №921 22.03.2022
		
	//++ #4570 смарт: Тимофеева 23.10.2025 / Дополнение к выгрузке звонков в дирэй
	смартИнтеграцияDeeray.ЗарегистрироватьИзмененияПриЗаписиРегистраСведенийДляОбмена(ЭтотОбъект, Отказ, Замещение);
	//-- #4570 смарт: Тимофеева 23.10.2025
	
КонецПроцедуры

//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
&После("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ, Замещение)
	
	МассивРеализаций=Новый Массив;
	МассивАктов=Новый Массив;
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		Для каждого стрЗапись Из ЭтотОбъект Цикл
			Если ТипЗнч(стрЗапись.Объект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					//И ВРег(стрЗапись.Свойство.Имя) = "ПОДПИСАН" Тогда
				МассивРеализаций.Добавить(стрЗапись.Объект);
			КонецЕсли;
			Если ТипЗнч(стрЗапись.Объект) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
					//И ВРег(стрЗапись.Свойство.Имя) = "ПОДПИСАН" Тогда
				МассивАктов.Добавить(стрЗапись.Объект);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивРеализаций", МассивРеализаций);
		Запрос.УстановитьПараметр("МассивАктов", МассивАктов);
		Запрос.Текст = "ВЫБРАТЬ
		               |	Данные.ЗаказКлиента КАК ЗаказКлиента
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
		               |	ИЗ
		               |		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |	ГДЕ
		               |		РеализацияТоваровУслуг.Ссылка В(&МассивРеализаций)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		РеализацияТоваровУслугТовары.ЗаказКлиента
		               |	ИЗ
		               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		               |	ГДЕ
		               |		РеализацияТоваровУслугТовары.Ссылка В(&МассивРеализаций)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		АктВыполненныхРабот.ЗаказКлиента
		               |	ИЗ
		               |		Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
		               |	ГДЕ
		               |		АктВыполненныхРабот.Ссылка В(&МассивАктов)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		АктВыполненныхРаботУслуги.ЗаказКлиента
		               |	ИЗ
		               |		Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
		               |	ГДЕ
		               |		АктВыполненныхРаботУслуги.Ссылка В(&МассивАктов)) КАК Данные
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Данные.ЗаказКлиента";
		МассивЗаказов=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказКлиента");
		
		Если МассивЗаказов.Количество() > 0 Тогда
			РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(МассивЗаказов, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//-- #1650 смарт: Шляпников 17.09.2024
 
#КонецОбласти