
&ИзменениеИКонтроль("ПолучитьТекущуюСтрокуСтруктурой")
Процедура смарт_ПолучитьТекущуюСтрокуСтруктурой(СтруктураДействий, СтруктураПолейТЧ)

	//++ Локализация
	
	Если СтруктураДействий.Свойство("ЗаполнитьПартиюТМЦВЭксплуатации") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ФизическоеЛицо");
		СтруктураПолейТЧ.Вставить("ПартияТМЦВЭксплуатации");
		СтруктураПолейТЧ.Вставить("ИнвентарныйУчет");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("Количество");
	КонецЕсли;
	
	
	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ЗаполнитьВидПродукцииИС", СтруктураПараметровДействия) 
		И ЗначениеЗаполнено(СтруктураПараметровДействия) Тогда
		
		Для Каждого Поле Из СтруктураПараметровДействия Цикл
			СтруктураПолейТЧ.Вставить(Поле.Ключ);
			СтруктураПолейТЧ.Вставить(Поле.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакМаркируемаяПродукция", СтруктураПараметровДействия) 
		И ЗначениеЗаполнено(СтруктураПараметровДействия) Тогда
		
		Для Каждого Поле Из СтруктураПараметровДействия Цикл
			СтруктураПолейТЧ.Вставить(Поле.Ключ);
			СтруктураПолейТЧ.Вставить(Поле.Значение);
		КонецЦикла;
	КонецЕсли;
	#Вставка
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 26.05.2021 18:24:24 задача 539
	Если СтруктураДействий.Свойство("смартЗаполнитьМинМаксЦену") Тогда
		СтруктураПолейТЧ.Вставить("ЦенаСоСкидкой");
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 26.05.2021 18:24:24
	#КонецВставки

	#Вставка
	//++#1517 смарт: Лопато 05.04.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
	Если СтруктураДействий.Свойство("ПроверитьСериюРассчитатьСтатус", СтруктураПараметровДействия) 
		И ЗначениеЗаполнено(СтруктураПараметровДействия) Тогда
		
		СтруктураПолейТЧ.Вставить("смартОтгрузкаБезСерииСлужебныйВременный");
			
	КонецЕсли;	
	//--#1517 смарт: Лопато 05.04.2024
	#КонецВставки
	//-- Локализация
	
КонецПроцедуры
