
&ИзменениеИКонтроль("СтавкиПоОперациямОтражаемымВКнигеПродаж")
Функция смарт_СтавкиПоОперациямОтражаемымВКнигеПродаж(ВходящиеПараметры)

	Если ТипЗнч(ВходящиеПараметры) = Тип("Число") Тогда
		Параметры = Новый Структура();
		Параметры.Вставить("ПрименяетсяОсвобождениеОтУплатыНДС", Ложь);
		Параметры.Вставить("ПлательщикНДС",                      Истина);
		Параметры.Вставить("ВерсияПостановленияНДС1137",         ВходящиеПараметры);

	ИначеЕсли ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		Параметры = ВходящиеПараметры;

	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Перечисления.СтавкиНДС.СтавкиПоОперациямОтражаемымВКнигеПродаж(): недопустимый тип параметра %2, ожидается Число или Структура.'"), ТипЗнч(Параметры));
	КонецЕсли;

	МассивСтавок = Новый Массив;

	Если Параметры.ПрименяетсяОсвобождениеОтУплатыНДС Тогда
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.БезНДС);
	ИначеЕсли Параметры.ПлательщикНДС Тогда
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС0);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10_110);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18_118);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20_120);
		
		#Вставка
		//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС5);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС5_105);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС7);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС7_107);
		//-- #1744 смарт: Шляпников 19.12.2024 
		//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС22);
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС22_122);
		//-- #4804 смарт: Тимофеева 12.11.2025
		#КонецВставки
		
		Если Параметры.ВерсияПостановленияНДС1137 < 3 Тогда
			МассивСтавок.Добавить(Перечисления.СтавкиНДС.БезНДС);
		КонецЕсли;
	КонецЕсли;

	Возврат МассивСтавок;

КонецФункции
