#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФильтрыНоменклатурыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура("Отбор", Новый Структура("Владелец", ПолучитьВладелцаФильтров()));
	
	ОткрытьФорму("Справочник.СмартДопФильтрыНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьВладелцаФильтров()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыВидовХарактеристик.СмартФильтрыНоменклатуры.НайтиПоКоду("000000083"));
	Результат.Добавить(ПланыВидовХарактеристик.СмартФильтрыНоменклатуры.НайтиПоКоду("000000024"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти