#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Распоряжение") Тогда
		Распоряжение = Параметры.Распоряжение;
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Распоряжение.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") И НЕ ЗначениеЗаполнено(Распоряжение) Тогда
		Сообщить("Служебная обработка, вызывается только из рабочих мест Отгрузка и Приемка");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗагрузкаСкладскихОперацийИзАдмирал();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура РаспоряжениеПриИзменении(Элемент)
	
	ЗагрузкаСкладскихОперацийИзАдмирал();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеИзАдмиралаПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьТоварыНаФормеПоСтрокеДанныхИзАдмирал();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдера(Команда)
	
	Для каждого стрДанные Из ДанныеИзАдмирала Цикл
		
		Если НЕ стрДанные.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьОрдерНаСервере(стрДанные.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СохранитьСтрокиТоваровДляЗагрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого стрДанные Из ДанныеИзАдмирала Цикл
		стрДанные.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для каждого стрДанные Из ДанныеИзАдмирала Цикл
		стрДанные.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЗагрузкаСкладскихОперацийИзАдмирал();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНоменклатуры = ПолучитьВладельцаСерий(Элементы.Товары.ТекущиеДанные.Номенклатура);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", Новый Структура("ВидНоменклатуры", ВидНоменклатуры), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеИзАдмиралаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаДанных = ДанныеИзАдмирала.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(Строкаданных.Ордер) Тогда
		ПоказатьЗначение(, СтрокаДанных.Ордер);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСерииИзРаспоряжения(Команда)
	ЗаполнитьСерииИзРаспоряженияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузкаСкладскихОперацийИзАдмирал()
	
	Если Метаданные.ОпределяемыеТипы.РаспоряжениеНаОтгрузку.Тип.СодержитТип(ТипЗнч(Распоряжение))  Тогда
		ВидОперации = 2;
	ИначеЕсли Метаданные.ОпределяемыеТипы.РаспоряжениеНаПоступление.Тип.СодержитТип(ТипЗнч(Распоряжение))  Тогда
		ВидОперации = 1;
	Иначе
		ВидОперации = 0;
	КонецЕсли;
	
	Элементы.ТоварыЗаполнитьСерииИзРаспоряжения.Видимость = (ВидОперации = 2);
	
	ДанныеИзАдмирала.Очистить();
	ТоварыКЗагрузке.Очистить();
	ТоварыВОрдере.Очистить();
	Объект.Товары.Очистить();
	
	ДанныеАдмирал = Неопределено;
	КоличествоПопыток = 5;
	
	НомерПопытки = 0;
	Пока НомерПопытки < КоличествоПопыток Цикл
		
		НомерПопытки = НомерПопытки + 1;
		
		Попытка
			
			Если ВидОперации = 1 Тогда
				ДанныеАдмирал = смартИнтеграцияСАдмирал.ПолучитьПриходныеОрдераАдмирал(
										ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(Распоряжение.Номер, Истина, Истина));
			ИначеЕсли ВидОперации = 2 Тогда
				ДанныеАдмирал = смартИнтеграцияСАдмирал.ПолучитьРасходныеОрдераАдмирал(
										ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(Распоряжение.Номер, Истина, Истина));
			Иначе
				Возврат;
			КонецЕсли;
			
			Прервать;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
		
	Если НЕ ДанныеАдмирал = Неопределено И ДанныеАдмирал.Свойство("orders") Тогда
		
		Для каждого стрОрдер Из ДанныеАдмирал.orders Цикл
			
			ДатаОрдера = ПрочитатьДатуJSON(стрОрдер.date, ФорматДатыJSON.ISO);
			НомерОрдераВнешний = стрОрдер.number_int;
			НомерРаспоряжения = стрОрдер.number;
			Комментарий = стрОрдер.comment;
			Статус = стрОрдер.status;
			
			Если ДатаОрдера < Распоряжение.Дата Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДанныеИзАдмирала.Добавить();
			НоваяСтрока.НомерРаспоряжения = НомерРаспоряжения;
			НоваяСтрока.НомерОрдераВнешний = НомерОрдераВнешний;
			НоваяСтрока.ДатаОрдера = ДатаОрдера;
			НоваяСтрока.Комментарий = Комментарий;
			НоваяСтрока.Статус = Статус;
			НоваяСтрока.Товары = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ЗаписатьОбъектВJSON(стрОрдер.goods);
			
			Если ВидОперации = 1 Тогда
				Ордер = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПолучитьПриходныйОрдерПоНомеруАдмирал(НомерОрдераВнешний, ДатаОрдера);
			ИначеЕсли ВидОперации = 2 Тогда
				Ордер = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПолучитьРасходныйОрдерПоНомеруАдмирал(НомерОрдераВнешний, ДатаОрдера);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ордер) Тогда
				НоваяСтрока.Ордер = Ордер;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыНаФормеПоСтрокеДанныхИзАдмирал()
	
	ТоварыКЗагрузке.Очистить();
	ТоварыВОрдере.Очистить();
	
	Если Элементы.ДанныеИзАдмирала.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = ДанныеИзАдмирала.НайтиПоИдентификатору(Элементы.ДанныеИзАдмирала.ТекущаяСтрока);
	
	Если СтрокаДанных <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(СтрокаДанных.Ордер) Тогда
			
			Если ТипЗнч(СтрокаДанных.Ордер) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
				ТоварыВОрдере.Загрузить(СтрокаДанных.Ордер.Товары.Выгрузить(, "Номенклатура, Серия, Количество"));
			ИначеЕсли ТипЗнч(СтрокаДанных.Ордер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
				ТоварыВОрдере.Загрузить(СтрокаДанных.Ордер.ОтгружаемыеТовары.Выгрузить(, "Номенклатура, Серия, Количество"));
			КонецЕсли;
			
		КонецЕсли;
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				НоваяСтрока = ТоварыКЗагрузке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрНайденныеСтроки);
			КонецЦикла;
			
		Иначе
			
			ЗагрузитьТоварыИзАдмиралаПоСтроке(СтрокаДанных);
			
		КонецЕсли;
		
		Элементы.ТоварыВОрдереКоличество.ТекстПодвала = Формат(ТоварыВОрдере.Итог("Количество"), "ЧДЦ=3");
		Элементы.ТоварыКоличество.ТекстПодвала = Формат(ТоварыКЗагрузке.Итог("Количество"), "ЧДЦ=3");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСтрокиТоваровДляЗагрузки()
	
	Если Элементы.ДанныеИзАдмирала.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = ДанныеИзАдмирала.НайтиПоИдентификатору(Элементы.ДанныеИзАдмирала.ТекущаяСтрока);
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
	Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
		Объект.Товары.Удалить(стрНайденныеСтроки);
	КонецЦикла;
	
	Для каждого стрТовары Из ТоварыКЗагрузке Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
		НоваяСтрока.ИДОрдера = СтрокаДанных.НомерОрдераВнешний;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОрдерНаСервере(ИдентификаторСтроки)
	
	СтрокаДанных = ДанныеИзАдмирала.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаДанных <> Неопределено Тогда
		
		Отказ = Ложь;
		НеПроводить = Ложь;
		
		Если ЗначениеЗаполнено(СтрокаДанных.Ордер) И СтрокаДанных.Ордер.Проведен Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По строке с ИД ордера ""%1"" уже создан ордер %2. Создание не выполнено.", 
															СтрокаДанных.НомерОрдераВнешний, СтрокаДанных.Ордер), СтрокаДанных.Ордер);
			Возврат;
		КонецЕсли;
		
		Если НЕ СтрНайти(ВРЕГ(СтрокаДанных.Статус), ВРЕГ("приемка завершена")) > 0 И НЕ СтрНайти(ВРЕГ(СтрокаДанных.Статус), ВРЕГ("отгружен")) > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По строке с ИД ордера ""%1"" работы не завершены. Статус ордера ""%2"". Создание не выполнено.", 
															СтрокаДанных.НомерОрдераВнешний, СтрокаДанных.Статус), СтрокаДанных.Ордер);
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.Ордер) Тогда
			ОрдерОбъект = СтрокаДанных.Ордер.ПолучитьОбъект();
		Иначе
			
			Если ВидОперации = 1 Тогда
				ОрдерОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
			ИначеЕсли ВидОперации = 2 Тогда
				ОрдерОбъект = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
			Иначе
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		ОрдерОбъект.Дата = СтрокаДанных.ДатаОрдера;
		ОрдерОбъект.смартИдентификаторWMS = СтрокаДанных.НомерОрдераВнешний;
		
		Если ВидОперации = 1 Тогда
			
			ОрдерОбъект.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение;
			ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
			ОрдерОбъект.Распоряжение = Распоряжение;
			ОрдерОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
			ОрдерОбъект.Комментарий = "Загружен по данным Адмирал";
			ОрдерОбъект.ХозяйственнаяОперация = Распоряжение.ХозяйственнаяОперация;
			ОрдерОбъект.ЗакрыватьГрафикПоступления = Истина;
			
			Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				
				ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
				ОрдерОбъект.Отправитель = Распоряжение.Партнер;
				ОрдерОбъект.ДатаВходящегоДокумента = Распоряжение.ДатаПоДаннымПоставщика;
				ОрдерОбъект.НомерВходящегоДокумента = Распоряжение.НомерПоДаннымПоставщика;
				
			ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				
				ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению;
				ОрдерОбъект.Отправитель = Распоряжение.СкладОтправитель;
				
			КонецЕсли;
			
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
			Если НЕ НайденныеСтроки.Количество() > 0 Тогда
				
				ЗагрузитьТоварыИзАдмиралаПоСтроке(СтрокаДанных, Истина);
				НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
				
			КонецЕсли;
			
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				
				НоваяСтрока = ОрдерОбъект.Товары.Добавить();
				НоваяСтрока.Номенклатура = стрНайденныеСтроки.Номенклатура;
				НоваяСтрока.Серия = стрНайденныеСтроки.Серия;
				НоваяСтрока.Количество = стрНайденныеСтроки.Количество;
				НоваяСтрока.КоличествоУпаковок = стрНайденныеСтроки.Количество;
				
				Если ЗначениеЗаполнено(стрНайденныеСтроки.СерияАдмирал) И НЕ ЗначениеЗаполнено(стрНайденныеСтроки.Серия)
					И стрНайденныеСтроки.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке товаров № %1 отстствует серия в УТ", стрНайденныеСтроки.НомерСтроки),,,, Отказ);
				КонецЕсли;
				
				Если стрНайденныеСтроки.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке товаров № %1 не заполнена характеристика", стрНайденныеСтроки.НомерСтроки),,,, НеПроводить);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
					НоваяСтрока.СтатусУказанияСерий = 14;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ВидОперации = 2 Тогда
			
			ОрдерОбъект.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение;
			ОрдерОбъект.ДатаОтгрузки = СтрокаДанных.ДатаОрдера;
			ОрдерОбъект.Комментарий = "Загружен по данным Адмирал";
			ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
			ОрдерОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
			ОрдерОбъект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
			
			Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКлиенту;
				ОрдерОбъект.Получатель = Распоряжение.Партнер;
			ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
				ОрдерОбъект.Получатель = Распоряжение.СкладПолучатель;
			КонецЕсли;
			
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
			Если НЕ НайденныеСтроки.Количество() > 0 Тогда
				
				ЗагрузитьТоварыИзАдмиралаПоСтроке(СтрокаДанных, Истина);
				НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИДОрдера", СтрокаДанных.НомерОрдераВнешний));
				
			КонецЕсли;
			
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				
				НоваяСтрока = ОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
				НоваяСтрока.Номенклатура = стрНайденныеСтроки.Номенклатура;
				НоваяСтрока.Серия = стрНайденныеСтроки.Серия;
				НоваяСтрока.Количество = стрНайденныеСтроки.Количество;
				НоваяСтрока.Распоряжение = Распоряжение;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
					НоваяСтрока.СтатусУказанияСерий = 14;
				КонецЕсли;
				
				НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
				НоваяСтрока.Номенклатура = стрНайденныеСтроки.Номенклатура;
				НоваяСтрока.Серия = стрНайденныеСтроки.Серия;
				НоваяСтрока.Количество = стрНайденныеСтроки.Количество;
				НоваяСтрока.КоличествоУпаковок = стрНайденныеСтроки.Количество;
				НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
				
				Если ЗначениеЗаполнено(стрНайденныеСтроки.СерияАдмирал) И НЕ ЗначениеЗаполнено(стрНайденныеСтроки.Серия)
					И стрНайденныеСтроки.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке товаров № %1 отстствует серия в УТ", стрНайденныеСтроки.НомерСтроки), , , , Отказ);
				КонецЕсли;
				
				Если стрНайденныеСтроки.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке товаров № %1 не заполнена характеристика", стрНайденныеСтроки.НомерСтроки),,,, НеПроводить);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
					НоваяСтрока.СтатусУказанияСерий = 14;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			Попытка
				
				Если НЕ НеПроводить Тогда
					ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан ордер %1", ОрдерОбъект.Ссылка), ОрдерОбъект.Ссылка);
				
			Исключение
				
				Ошибка = ОписаниеОшибки();
				Сообщить(СтрШаблон("Не удалось провести ордер с ИД %1 по причине :%2%3", СтрокаДанных.НомерОрдераВнешний, Символы.ПС, Ошибка));
				
				Попытка
					ОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					Ошибка = ОписаниеОшибки();
					Сообщить(СтрШаблон("Не удалось записать ордер с ИД %1 по причине :%2%3", СтрокаДанных.НомерОрдераВнешний, Символы.ПС, Ошибка));
				КонецПопытки;
				
			КонецПопытки;
			
		КонецЕсли;
			
	КонецЕсли;
	
	ТекущийИД = ДанныеИзАдмирала.НайтиПоИдентификатору(Элементы.ДанныеИзАдмирала.ТекущаяСтрока).НомерОрдераВнешний;
	ЗагрузкаСкладскихОперацийИзАдмирал();
	
	НайденныеСтроки = ДанныеИзАдмирала.НайтиСтроки(Новый Структура("НомерОрдераВнешний", ТекущийИД));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.ДанныеИзАдмирала.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТоварыИзАдмиралаПоСтроке(СтрокаДанных, ЗагрузитьВОбработку = Ложь)
	
	ТоварыИзАдмирал = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПрочитатьОбъектИзJSON(СтрокаДанных.Товары);
	Если ТипЗнч(ТоварыИзАдмирал) = Тип("Массив") Тогда
		
		Счетчик = 0;
				
		Для каждого стрТоварыИзАдмирал Из ТоварыИзАдмирал Цикл
			
			Если ЗагрузитьВОбработку Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.ИДОрдера = СтрокаДанных.НомерОрдераВнешний;
			Иначе
				Счетчик = Счетчик + 1;
				НоваяСтрока = ТоварыКЗагрузке.Добавить();
				НоваяСтрока.НомерСтроки = Счетчик;
			КонецЕсли;
			
			НоваяСтрока.ИД = стрТоварыИзАдмирал.product_id;
			НоваяСтрока.Код1С = стрТоварыИзАдмирал.product_id_ext;
			НоваяСтрока.Наименование = стрТоварыИзАдмирал.product_name;
			НоваяСтрока.СерияАдмирал = стрТоварыИзАдмирал.serial;
			НоваяСтрока.Количество = стрТоварыИзАдмирал.quantity;
			
			МассивКодАртикул = СтрРазделить(стрТоварыИзАдмирал.product_id_ext, ".", Истина);
			Если МассивКодАртикул.Количество() = 1 Тогда
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0]);
			ИначеЕсли МассивКодАртикул.Количество() = 2 Тогда
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0], МассивКодАртикул[1]);
			Иначе
				КодДляПоиска = МассивКодАртикул[МассивКодАртикул.Количество() - 1];
				АртикулДляПоиска = Лев(НоваяСтрока.Код1С, СтрДлина(НоваяСтрока.Код1С) - СтрДлина(КодДляПоиска) - 1);
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(АртикулДляПоиска, КодДляПоиска);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стрТоварыИзАдмирал.serial) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				НоваяСтрока.Серия = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиСериюНоменклатуры(НоваяСтрока.Номенклатура, стрТоварыИзАдмирал.serial);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииИзРаспоряженияНаСервере()
	
	Для каждого стрТовары Из Распоряжение.Товары Цикл
		
		НайденныеСтроки = ТоварыКЗагрузке.НайтиСтроки(Новый Структура("Номенклатура", стрТовары.Номенклатура));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			стрНайденныеСтроки.Серия = стрТовары.Серия;
		КонецЦикла;
		
	КонецЦикла;
	
	СохранитьСтрокиТоваровДляЗагрузки();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВладельцаСерий(Номенклатура) Экспорт
	
	Возврат Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПолучитьВладельцаСерий(Номенклатура);
	
КонецФункции

#КонецОбласти