#Область ОписаниеПеременных

&НаКлиенте
Перем ОсновнаяФорма; // В переменной будем хранить ссылку на основную форму, для возможности вызова экспортных процедур

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	ЗагрузитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОпределитьВызывающуюФормуПоВладельцу();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблица

&НаКлиенте
Процедура ТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		
		Отказ = Истина;
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Результат              = Новый Массив;
	ДанныеКорректные       = Истина;
	
	Для Каждого ДанныеСтроки Из Таблица Цикл
		
		Если ОсновнаяФорма.ЭтоКорректныйНомерТелефона(ДанныеСтроки.Основной, ДанныеСтроки.Добавочный) Тогда

			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Идентификатор", ДанныеСтроки.Идентификатор);
			СтруктураДанных.Вставить("Основной",      ДанныеСтроки.Основной);
			СтруктураДанных.Вставить("Добавочный",    ДанныеСтроки.Добавочный);
			
			Результат.Добавить(СтруктураДанных);

		Иначе
			
			ДанныеКорректные = Ложь;
			ОсновнаяФорма.ПоказатьСообщениеПользователю("Некорректно указан номер телефона в строке " + (Таблица.Индекс(ДанныеСтроки) + 1));

		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеКорректные Тогда
		
		ОповеститьОВыборе(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОпределитьВызывающуюФормуПоВладельцу()
	
	ТипУправляемаяФорма = Тип("УправляемаяФорма");
	
	Если ТипЗнч(ВладелецФормы) = ТипУправляемаяФорма Тогда
		
		ОсновнаяФорма = ВладелецФормы;
		
	Иначе

		ТекущийРодитель = ВладелецФормы.Родитель;
		
		Пока Истина Цикл
			
			Если ТипЗнч(ТекущийРодитель) = ТипУправляемаяФорма Тогда
				
				ОсновнаяФорма = ТекущийРодитель;
				Прервать;

			Иначе
				
				ТекущийРодитель = ТекущийРодитель.Родитель;
				
			КонецЕсли;
		
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписок()

	Для каждого ДанныеСтроки Из Параметры.Список Цикл
		
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), ДанныеСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
