
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ИнициализироватьДокумент")
Процедура смарт_ИнициализироватьДокумент(ДанныеЗаполнения)
	
	//++ смарт:ММ #048 234 30.05.2020 - Заявка на пусконаладку  
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку") Тогда
		
		Организация 		= ДанныеЗаполнения.Организация;
		Партнер 			= ДанныеЗаполнения.Партнер;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		ДокументОснование 	= ДанныеЗаполнения;
		
		НоменклатураПоУмолчанию = Справочники.смартПредопределенныеЗначения.НоменклатураДляЗаказаКлиентаИзЗаявкиНаПускоНаладкуПоУмолчанию.Значение;
		Соглашение = Справочники.смартПредопределенныеЗначения.СоглашениеДляЗаказаКлиентаИзЗаявкиНаПускоНаладкуПоУмолчанию.Значение;
		
		// ++ 01.12.2020
		ЗаполнитьУсловияПродажПоСоглашению();
		// --
		
		Если ЗначениеЗаполнено(НоменклатураПоУмолчанию) Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураПоУмолчанию;
			НоваяСтрока.КоличествоУпаковок = 1;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		КонецЕсли;
		
	//++ смарт:ММ #082 397 14.11.2020 - Заявка на ремонт
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		Организация 		= ДанныеЗаполнения.Организация;
		Партнер 			= ДанныеЗаполнения.Партнер;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		ДокументОснование 	= ДанныеЗаполнения;
		
		//НоменклатураПоУмолчанию = Справочники.смартПредопределенныеЗначения.НоменклатураДляЗаказаКлиентаИзЗаявкиНаПускоНаладкуПоУмолчанию.Значение;
		НоменклатураПоУмолчанию = Справочники.Номенклатура.НайтиПоНаименованию("Организация ремонтных работ", Истина);
		Соглашение = Справочники.смартПредопределенныеЗначения.СоглашениеДляЗаказаКлиентаИзЗаявкиНаПускоНаладкуПоУмолчанию.Значение;
		
		// ++ 01.12.2020
		ЗаполнитьУсловияПродажПоСоглашению();
		// --
		
		Если ЗначениеЗаполнено(НоменклатураПоУмолчанию) Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураПоУмолчанию;
			НоваяСтрока.КоличествоУпаковок = 1;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		КонецЕсли;

	//-- смарт:ММ 14.11.2020
	
	//++ смарт:ММ #099 409 28.03.2021 Регламентное обслуживание
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда
		
		Настройка = Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт;
		Организация 		= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
		Партнер 			= ДанныеЗаполнения.Клиент;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		ДокументОснование 	= ДанныеЗаполнения;
		
		//++ смарт:ММ #099 409 06.06.2021
		//Соглашение = Справочники.смартПредопределенныеЗначения.СоглашениеДляЗаказаКлиентаИзЗаявкиНаПускоНаладкуПоУмолчанию.Значение;
		Настройка = Справочники.смартПредопределенныеЗначения.СоглашениеДляЗаказаКлиентаИзРегламентногоРемонтногоОбслуживания;
		Соглашение = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
		//-- смарт:ММ 06.06.2021
		
		Если ЗначениеЗаполнено(Соглашение) Тогда
			ЗаполнитьУсловияПродажПоСоглашению();
			Валюта = Соглашение.Валюта;
		КонецЕсли;

		Для Каждого Строка Из ДанныеЗаполнения.Запчасти Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = Строка.Запчасть;
			НоваяСтрока.КоличествоУпаковок = Строка.Количество;
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		КонецЦикла;
		
	//-- смарт:ММ 28.03.2021
	
	//++ смарт:ММ #092 389 16.01.2021 - Конструктор оборудования
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартIECHOСпецификация") Тогда
		
		Организация 		= Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение;
		Партнер 			= ДанныеЗаполнения.Клиент;
		Контрагент 			= ПолучитьКонтрагентаПоКлиенту();
		ДокументОснование 	= ДанныеЗаполнения;
		
		//++ #Б1402 смарт: Шляпников 19.11.2024 / Дополнения по задаче создание Заказа клиента из конструктора КП
		Соглашение = Справочники.смартПредопределенныеЗначения.Настройки.СоглашениеТиповоеUSD;
		//-- #Б1402 смарт: Шляпников 19.11.2024
		
		Если ЗначениеЗаполнено(Соглашение) Тогда
			ЗаполнитьУсловияПродажПоСоглашению();
			Валюта = Соглашение.Валюта;
		КонецЕсли;
		
		//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO
		ЗаполнитьТабличнуюЧастьТоварыПоСпецификации(ДанныеЗаполнения);
		//-- #Б1252 смарт: Шляпников 12.11.2024

	//-- смарт:ММ 16.01.2021
	КонецЕсли;
	//-- смарт:ММ 30.05.2020
	
КонецПроцедуры

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
		"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");
	
КонецФункции //-- смарт:ММ 17.01.2021

//++ смарт:ММ #092 389 16.01.2021 - Конструктор оборудования 
Функция ПолучитьКонтрагентаПоКлиенту()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции //-- смарт:ММ 16.01.2021

#Область ПеренесеноСДоработками

//++ смарт:ММ #082 397 28.02.2021 Заявка на ремонтные работы
&После("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		Для Каждого Строка Из Товары Цикл
			Строка.Номенклатура = Неопределено;
		КонецЦикла;
		
	КонецЕсли;
    
    //++ смарт:Подкин # 01.03.2022 10:00:00 
	Если ДанныеЗаполнения<>Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения,"Организация") Тогда
		ЭтотОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ДанныеЗаполнения.Организация); 
	Иначе	
		ЭтотОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация);
	КонецЕсли;
	//-- смарт:Подкин # 01.03.2022 10:00:00  
    
КонецПроцедуры //-- смарт:ММ 28.02.2021

&Перед("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
    КонецЕсли;         
	//++ #1334 смарт: Фролов 29.03.2023 //Заявка на формирование и подписание договора из 1С 
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение И ЭтотОбъект.Дата>=Дата("20230413") Тогда
			Если ЭтотОбъект.Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда
				Если ЗначениеЗаполнено(ЭтотОбъект.Договор)  Тогда
					Если НЕ ЗначениеЗаполнено(СокрЛП(ЭтотОбъект.Договор.Номер))  Тогда
						Сообщить("Не заполнен номер в договоре контрагента.");
						Отказ=Истина;
					КонецЕсли;	
					Если ЭтотОбъект.Договор.смартДоговорПодписан И НЕ ЗначениеЗаполнено(ЭтотОбъект.Договор.Дата)  Тогда
						Сообщить("Не заполнена дата в договоре контрагента.");
						Отказ=Истина;
					КонецЕсли;
				Иначе
					Сообщить("Не заполнен договор контрагента.");
					Отказ=Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение И ЭтотОбъект.Дата>=Дата("20230413") Тогда
			Если ЭтотОбъект.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт Тогда
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
					Сообщить("Для продажи на экспорт обязательно должен быть заполнен договор!");
					Отказ=Истина; 
					Возврат;
				КонецЕсли;	
			КонецЕсли;
			
			//++ #1794 смарт: Фролов 24.04.2024 //Запрет печати счета из Заказа клиента если в нем есть оборудование и он создан не на основании Интереса.
			// Добавлена проверка на наличие интереса, если есть оборудование
			МасОборудование = Новый Массив;
			
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
				
				//++ #2638 смарт: Ермаков 11.03.2025 / Договор для  Сегмента Оборудование
				// Отключил код
				//СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментАппаратноеОбеспечение"); 
				// Добавил код
				СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментПродажиПоДоговору"); 
				//-- #2638 смарт: Ермаков 11.03.2025
				ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментОборудование);
				МасОборудование = ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка");
				
				Для Каждого Стр Из ЭтотОбъект.Товары Цикл
					
					Если НЕ МасОборудование.Найти(Стр.Номенклатура) = Неопределено Тогда
						
						//++ #2638 смарт: Ермаков 11.03.2025 / Договор для  Сегмента Оборудование  
						// Отключил код
						//ОбщегоНазначения.СообщитьПользователю("Товар в строке " + Стр.НомерСтроки + " " + Стр.Номенклатура + " входит в сегмент оборудования. С 13 апреля 2023, для таких заказов обязательно указывать договор." , , , , Истина);
						// Добавил код
						ОбщегоНазначения.СообщитьПользователю("Товар в строке " + Стр.НомерСтроки + " " + Стр.Номенклатура + ". С 13 апреля 2023, для таких товаров обязательно указывать договор.",,,, Отказ);
						// Отключил код
						//Отказ = Истина; 
						//-- #2638 смарт: Ермаков 11.03.2025
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли (ЗначениеЗаполнено(ЭтотОбъект.Договор) И НЕ ЭтотОбъект.Договор.смартДоговорПодписан) Тогда
				
				//++ #2638 смарт: Ермаков 11.03.2025 / Договор для  Сегмента Оборудование
				// Отключил код
				//СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментАппаратноеОбеспечение"); 
				// Добавил код
				СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментПродажиПоДоговору"); 
				//-- #2638 смарт: Ермаков 11.03.2025
				ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментОборудование);
				МасОборудование = ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка");
				
				Для Каждого Стр Из ЭтотОбъект.Товары Цикл
					
					Если НЕ МасОборудование.Найти(Стр.Номенклатура) = Неопределено Тогда 
						
						Если Стр.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.Отгрузить Тогда
							
						//++ #2638 смарт: Ермаков 11.03.2025 / Договор для  Сегмента Оборудование  
						// Отключил код
						//ОбщегоНазначения.СообщитьПользователю("Товар в строке " + Стр.НомерСтроки + " " + Стр.Номенклатура + " входит в сегмент оборудования. С 13 апреля 2023, для таких заказов обязательно указывать договор." , , , , Истина);
						// Добавил код
						ОбщегоНазначения.СообщитьПользователю("Товар в строке " + Стр.НомерСтроки + " " + Стр.Номенклатура + ". С 13 апреля 2023, для таких товаров обязательно указывать договор.",,,, Отказ);
						// Отключил код
						//Отказ = Истина; 
						//-- #2638 смарт: Ермаков 11.03.2025
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			//++ #2005 смарт: Фролов 26.08.2024 //Оповещение о необходимости привязать Интерес к Заказу срабатывает после привязки Интереса.
			//++ #1863 смарт: Фролов 14.06.2024 //Доработка механизма запрета печати счета без привязанного Интереса
			//Если Справочники.смартПредопределенныеЗначения.КонтролироватьНаличиеИнтересаВЗаказеКлиента.Значение = Истина
			//Если Справочники.смартПредопределенныеЗначения.КонтролироватьНаличиеИнтересаВЗаказеКлиента.Значение = Истина
			//	И ЭтотОбъект.Дата > Дата("20240501") Тогда
			////-- #1863 смарт: Фролов 14.06.2024	
			//	
			//	Если НЕ смартОбщегоНазначения.ПроверитьНаличиеИнтересаПоЗаказу(Ссылка) Тогда
			//		
			//		ЕстьОборудование = Ложь;
			//		
			//		Если МасОборудование.Количество() = 0 Тогда
			//			
			//			СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментАппаратноеОбеспечение"); 
			//			ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментОборудование);
			//			МасОборудование = ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка");
			//			
			//		КонецЕсли;	
			//		
			//		Для Каждого Стр Из ЭтотОбъект.Товары Цикл
			//			
			//			Если НЕ МасОборудование.Найти(Стр.Номенклатура) = Неопределено Тогда
			//				ЕстьОборудование = Истина;
			//			КонецЕсли;
			//			
			//		КонецЦикла;
			//		
			//		
			//		Если ЕстьОборудование Тогда
			//			
			//			ОбщегоНазначения.СообщитьПользователю("Внимание! В данном заказе есть оборудование! Заказ должен быть создан на основании Интереса! 
			//			|Если вы не привяжете Интерес к заказу то не сможете напечатать счет!");
			//			
			//		КонецЕсли;
			//		
			//	КонецЕсли;
			//	
			//КонецЕсли;
			//-- #1794 смарт: Фролов 24.04.2024
			//-- #2005 смарт: Фролов 26.08.2024
			
		КонецЕсли;
		Если Отказ Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	//-- #1334 смарт: Фролов 29.03.2023
	
    //++ смарт:Подкин #1009 05.05.2022 12:20:09 
    Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
        ТзРазницы = ОпределитьИзмененияВерсийОбъекта(ЭтотОбъект, "Номенклатура,Количество,ВидЦены");
        //++ #1319 смарт: Фролов 09.03.2023 //Ограничение количества продаж и отмена скидок  
		//Если Проведен И ТзРазницы.Количество()=0 Тогда 
		Если Проведен И ТзРазницы.Количество()=0 И ЭтотОбъект.Ссылка.Партнер=ЭтотОбъект.Партнер Тогда 	
        //-- #1319 смарт: Фролов 09.03.2023
		    ЭтотОбъект.ДополнительныеСвойства.Вставить("РазрешатьПроведение",);	
        КонецЕсли;    
    КонецЕсли;
    //-- смарт:Подкин #1009 05.05.2022 12:20:09

    //++ смарт:Подкин #960 30.03.2022 12:38:10
	//++#1238 смарт: Лопато 08.11.2022 //Запрет на пометку удаления в Заказ клиента  
	//Если НЕ Пользователи.ЭтоПолноправныйПользователь() И РежимЗаписи = РежимЗаписиДокумента.Запись И ЭтотОбъект.ПометкаУдаления Тогда  
    Если ЭтотОбъект.ПометкаУдаления И НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда  
    //--#1238 смарт: Лопато 08.11.2022
	    Отказ=Истина;
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено помечать на удаление Заказ клиента. Для отмены заказа, пожалуйста закройте его с отменой всех строк. 
        |Инструкция находится на портале help.smart-t.me, название статьи ""Заказ клиента"" п.3 Отменить заказ",,,,Отказ);   
    КонецЕсли;
    //-- смарт:Подкин #960 30.03.2022 12:38:10 
    
	// Смарт Фролов+
    Если РежимЗаписи=РежимЗаписиДокумента.Проведение  
        //++ смарт:Подкин #927 07.04.2022 17:45:03
        И НЕ ЭтотОбъект.Статус=Перечисления.СтатусыЗаказовКлиентов.Закрыт 
        И НЕ ЭтотОбъект.СуммаДокумента=0  
        И НЕ Контрагент.смартНеПроверятьРиски
        И НЕ смартПроводитьДокументПриВысокомСПАРКРиске
        И НЕ Пользователи.ЭтоПолноправныйПользователь()
        //-- смарт:Подкин #927 07.04.2022 17:45:03
        Тогда    
        ПроверитьКонтрагентаПоРискам(Отказ,РежимЗаписи);
        
        ////++ смарт: Белоусова 577 11.08.2021
        //Если Контрагент<>Ссылка.Контрагент Тогда
        //	Если (ПолучитьФункциональнуюОпцию("ИспользоватьСервисСПАРКРиски")
        //		И РежимЗаписи=РежимЗаписиДокумента.Проведение 
        //		И Не РольДоступна("ПолныеПрава") 
        //		И Не Ссылка.смартПроводитьДокументПриВысокомСПАРКРиске
        //		И Не Контрагент.смартНеПроверятьРиски) Тогда 
        //		ПроверитьКонтрагентаПоРискам(Отказ,РежимЗаписи);
        //	КонецЕсли;
        //Иначе 
        //	Если (ПолучитьФункциональнуюОпцию("ИспользоватьСервисСПАРКРиски")
        //		И РежимЗаписи=РежимЗаписиДокумента.Проведение 
        //		И Не РольДоступна("ПолныеПрава") 
        //		И Не Ссылка.смартПроводитьДокументПриВысокомСПАРКРиске
        //		И Не ссылка.Контрагент.смартНеПроверятьРиски) Тогда 
        //		ПроверитьКонтрагентаПоРискам(Отказ,РежимЗаписи);
        //	КонецЕсли;
        //КонецЕсли;
        ////-- смарт: Белоусова 577 11.08.2021  
        
    КонецЕсли;
	
	Если ЭтотОбъект.Контрагент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо
		И Не ЭтотОбъект.Валюта=Константы.ВалютаРегламентированногоУчета.Получить()
		И ПолучитьПроцентОтгрузки()=0
		И Не РольДоступна("ПолныеПрава") Тогда 
		
		ОбщегоНазначения.СообщитьПользователю("Валюта документа должна быть руб. (Закон ФЗ-54)",,,,Отказ);
		
	КонецЕсли;	
	// Фролов-
	
	//Богус++
	Если ПроверитьСтатус() Тогда
		ТекстОшибки = НСтр("ru='Нельзя установливать статус ""К отгрузке"", у нового документа.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Статус);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//Богус--
    
     //++ смарт:Подкин #862 13.01.2022 14:32:07 перенес выше
    //Богус++
    ///////Если заказ переводится в статус "Закрыт" впервые то устанавливаем дату закрытия
    Если Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт
        И Не ЗначениеЗаполнено(ДатаЗакрытия) Тогда
        ДатаЗакрытия = ТекущаяДата();
    КонецЕсли;
    ///////
    //Богус--
    //-- смарт:Подкин #862 13.01.2022 14:32:07   
		
	//++ #1193 смарт: Фролов 29.11.2022 //Исправить ошибки в журнале регистрации  
	Если ЭтотОбъект.Организация.ПометкаУдаления И НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
	КонецЕсли;
	//-- #1193 смарт: Фролов 29.11.2022
	//Каратеев -
	// ЯшниковДА 20180404 +++ 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ТекущаяДата() > Дата('2019.01.09 00:00:00')
		И НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
	
		ПроверитьКорректностьЗаполненияКонтрагента(Отказ);
	
	КонецЕсли;	 		
	// ЯшниковДА 20180404 ---
		
	//++ смарт: Белоусова #465 23.03.2021
	
		Если не  ЭтоНовый() Тогда

			
			стр = ПолучитьСписокПодчиненныхДокументов(Ссылка);
			если стр.количество()>0 тогда
				
				Запрос = Новый Запрос;
		        Запрос.Текст = 
		            "ВЫБРАТЬ *
		            |ИЗ
		            |	Документ.ЗаказКлиента КАК ЗаказКлиента
		            |ГДЕ
		            |	ЗаказКлиента.Ссылка = &Ссылка";
		        Запрос.УстановитьПараметр("Ссылка", Ссылка);
		        Результат = Запрос.Выполнить().Выбрать();
		        Если Результат.Количество() > 0 Тогда
		            Результат.Следующий();
		            СписокРеквизитов = ЭтотОбъект.Метаданные().Реквизиты;
					ошибки = новый СписокЗначений;
		            Для Каждого текРеквизит из СписокРеквизитов Цикл
						Если Результат[текРеквизит.Имя] <> ЭтотОбъект[текРеквизит.Имя] Тогда
							//смарт rnp из проверки удален склад, надо сделать отдельную проверку - склад нельзя менять, если введена реализация
							//если текРеквизит.Имя = "Партнер" или текРеквизит.Имя = "Контрагент" или текРеквизит.Имя = "Организация" или текРеквизит.Имя = "Соглашение" или текРеквизит.Имя = "Склад" тогда
							если Не РольДоступна("ПолныеПрава") и (текРеквизит.Имя = "Партнер" или текРеквизит.Имя = "Контрагент" или текРеквизит.Имя = "Организация" или текРеквизит.Имя = "Соглашение" или текРеквизит.Имя = "Договор") тогда
		                    	ошибки.Добавить("Изменены реквизиты: " + текРеквизит);
							КонецЕсли;
		                КонецЕсли;
		            КонецЦикла;
				КонецЕсли;
				если ошибки.Количество()>0 тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе были изменены значения реквизитов, которые нельзя изменять, если у заказа есть подчиненные документы! ");
					для каждого эл из ошибки цикл
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(эл);	
					    

					КонецЦикла;
					
					отказ = Истина;
				КонецЕсли;
    		КонецЕсли;
		КонецЕсли;
	//-- смарт: Белоусова #465 23.03.2021
	
	//++ смарт:Подкин #896 11.02.2022 10:29:44    
    Если (НЕ ЭтотОбъект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз")) 
        И 
        Не ЗначениеЗаполнено(ЭтотОбъект.ЗонаДоставки) Тогда 
        ЗД = Справочники.смартПредопределенныеЗначения.ЗонаДоставкиМоскваМО;
        Если ЗначениеЗаполнено(ЗД.значение) Тогда
            ЭтотОбъект.ЗонаДоставки = ЗД.значение; 
        КонецЕсли;
    КонецЕсли;
    //-- смарт:Подкин #896 11.02.2022 10:29:44
    
    //++ смарт:Подкин #1038 27.05.2022 21:26:34
    //++#1298 смарт: Лопато 09.01.2023 //Нет возможности поменять р/с в Заказе клиента  
    Если ЭтоНовый() Тогда
	//--#1298 смарт: Лопато 09.01.2023
	смартУстановкаРС();
    //++#1298 смарт: Лопато 09.01.2023 //Нет возможности поменять р/с в Заказе клиента  
	КонецЕсли;
	//--#1298 смарт: Лопато 09.01.2023
	//-- смарт:Подкин #1038 27.05.2022 21:26:34 
	
	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	Если ЗначениеЗаполнено(ЭтотОбъект.Б_Идентификатор) Тогда
		смартПроверкаИзмененияРеквизитовЗаказВыгруженНаСайт(Отказ);
	КонецЕсли;
	//--#1261 смарт: Лопато 01.12.2022  
	
	//++ #1599 смарт: Мосолов 11.01..2024 //Доработка документа ЗаказКлиента (реквизит смартДокументыПодписаны) 
	// !!! удалить код перед вторым этапом задачи
	//ПереносСмартДокументыПодписаны = УдалитьСмартДокументыПодписаны;
	//-- #1599 смарт: Мосолов 11.01..2024   
	
	//++ #1744 смарт: Мосолов 04.04.2024 //Добавить проверку в Заказ клиента при изменении Контрагента  
	Если ЗначениеЗаполнено(Договор) Тогда
		
		Если НЕ Договор.Контрагент = Контрагент Тогда
			
			Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"); 
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1744 смарт: Мосолов 04.04.2024 
	
	//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
	Если Ссылка.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны <> ЭтотОбъект.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны Тогда
		ЭтотОбъект.смартИДРазрешенияНаДоставкуВнеЗоны = Новый УникальныйИдентификатор;
	КонецЕсли;
	//-- #Б4868 смарт: Шляпников 12.11.2025

	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	Если Ссылка.смартРазрешенаБесплатнаяДоставка <> ЭтотОбъект.смартРазрешенаБесплатнаяДоставка Тогда
		ЭтотОбъект.смартИДРазрешенияНаБесплатнуюДоставку = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если НЕ (ДополнительныеСвойства.Свойство("НеКонтроллироватьПлатнуюДоставку") И ДополнительныеСвойства.НеКонтроллироватьПлатнуюДоставку) 
			И ЭтотОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
		ПропуститьПроверкуОнлайнЗаказа = НЕ ЭтоНовый();
		Если ПропуститьПроверкуОнлайнЗаказа Тогда
			ПропуститьПроверкуОнлайнЗаказа = (СокрЛП(УправлениеСвойствами.ЗначениеСвойства(Ссылка, "ОффлайнЗаказ")) = "N");
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ЭтоНовыйБитрикс") И ДополнительныеСвойства.ЭтоНовыйБитрикс Тогда
			
			АдресПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(АдресДоставки, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
			АдресДоставкиЗначение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(АдресПоПолям);
			АдресДоставкиЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзJSONВXML(АдресДоставкиЗначение, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
																	
			ПропуститьПроверкуОнлайнЗаказа = Истина;
			
		КонецЕсли;
		
		Если НЕ ПропуститьПроверкуОнлайнЗаказа Тогда
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.АдресДоставкиЗначение) ИЛИ УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(ЭтотОбъект.АдресДоставкиЗначение) Тогда
				ОбщегоНазначения.СообщитьПользователю("Нельзя указывать адрес доставки в свободной форме. Введите адрес с разбивкой по региону, городу, улице.",,, "Объект.АдресДоставки", Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("КонтроллироватьСтоимостьДоставкиРасходки") И Документы.ЗаказКлиента.ВЗаказеТолькоРасходныеМатериалы(ЭтотОбъект) Тогда
			
			СостояниеЗаказа = Документы.ЗаказКлиента.ДанныеСостоянияЗаказа(Ссылка);
			Если НЕ СостояниеЗаказа.ОтгруженПолностью Тогда
			
				Если ДополнительныеСвойства.Свойство("Регион") Тогда
					
					СчитатьПоМаксимальномуТарифу = Ложь;
					
					Если НЕ РегистрыСведений.смартТарифыНаДоставку.СуществуетДоставкаДоКлиентаВРегионе(ДополнительныеСвойства.Регион, ДополнительныеСвойства.Город, ДополнительныеСвойства.Расстояние) Тогда
						Если НЕ ЭтотОбъект.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны Тогда
							ОбщегоНазначения.СообщитьПользователю("Адрес доставки не входит в выбранную Зону доставки.
																	|Выберите корректный адрес, или измените Зону доставки.",,, "Объект.АдресДоставки", Отказ);
							Возврат;
						Иначе
							СчитатьПоМаксимальномуТарифу = Истина;
						КонецЕсли;
					КонецЕсли;
					
					Если НЕ ЭтотОбъект.смартРазрешенаБесплатнаяДоставка Тогда
						
						Если ЭтотОбъект.Дата >= смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаПроверкиСтоимостиДоставкиРасходки") Тогда
							
							Если НЕ ПропуститьПроверкуОнлайнЗаказа Тогда
							
								ОтправитьУведомлениеОЗаказахСБесплатнойДоставкой = Ложь;
								РезультатПроверки = РегистрыСведений.смартТарифыНаДоставку.ПроверитьПравильностьРасчетаДоставкиПоЗаказу(ЭтотОбъект, Ложь, Истина, СчитатьПоМаксимальномуТарифу);
								
								Если РезультатПроверки.смартНаценкаПоДоставкеРассчитанаСОшибкой Тогда
									
									Если НЕ ЗначениеЗаполнено(РезультатПроверки.смартНаценкаПоДоставкеСуммаПоТарифу) И Документы.ЗаказКлиента.ДоставкаРассчитана(ЭтотОбъект) Тогда
										
										//удаляем доставку, выводим сообщение
										СтрокиНаценкиНаДоставку = ЭтотОбъект.СкидкиНаценки.НайтиСтроки(Новый Структура("СкидкаНаценка", РезультатПроверки.смартНаценкаПоДоставке));
										Для каждого стр Из СтрокиНаценкиНаДоставку Цикл
											ЭтотОбъект.СкидкиНаценки.Удалить(стр);
										КонецЦикла;
										
										СтруктураДействий = Новый Структура;
										СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
										СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
										СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
										СтруктураДействий.Вставить("ПересчитатьСумму");
										СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
										СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
										
										КэшированныеЗначения = Новый Структура;
										
										Для каждого стрТовары Из ЭтотОбъект.Товары Цикл
											ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, СтруктураДействий, КэшированныеЗначения);
										КонецЦикла;
										
										Сообщение = СтрШаблон("Для клиента %1 рассчитана бесплатная доставка.
																|Стоимость доставки была автоматически изменена.", ЭтотОбъект.Партнер);
										
										ОбщегоНазначения.СообщитьПользователю(Сообщение);
										
										ОтправитьУведомлениеОЗаказахСБесплатнойДоставкой = Истина;
										
									Иначе
										
										Сообщение = СтрШаблон("%1%2%3", 
															   РезультатПроверки.смартНаценкаПоДоставкеОписаниеОшибки, 
															   Символы.ПС, 
															   "Необходимо откорректировать Наценку на доставку или согласовать с Руководителем отдела по расходным материалам Бесплатную доставку.");
										
										ОбщегоНазначения.СообщитьПользователю(Сообщение,,,, Отказ);
										
									КонецЕсли;
																			  
								ИначеЕсли НЕ ЗначениеЗаполнено(РезультатПроверки.смартНаценкаПоДоставкеСуммаПоТарифу) Тогда
									
									ОтправитьУведомлениеОЗаказахСБесплатнойДоставкой = Истина;
									
								Иначе
									
									Для каждого стрЗаказ Из РезультатПроверки.ДополнительныеДанные.Заказы Цикл
										
										Если стрЗаказ.Ссылка <> Ссылка Тогда
											//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Необходимо проверить стоимость доставки в заказе %1", стрЗаказ.Ссылка), стрЗаказ.Ссылка);
										КонецЕсли;
										
									КонецЦикла;
										
								КонецЕсли;
								
								Если ОтправитьУведомлениеОЗаказахСБесплатнойДоставкой Тогда
									
									Если РезультатПроверки.ДополнительныеДанные.Заказы.Количество() > 0 Тогда
											
										МассивСтрокСообщенияПочта = Новый Массив;
										МассивСтрокСообщенияПочта.Добавить(СтрШаблон("Уважаемый %1 !", Менеджер));
										
										МассивСтрокСообщений = Новый Массив;
										МассивСтрокСообщений.Добавить(СтрШаблон("ВНИМАНИЕ!!!
																					 |Для клиента %1 доступна бесплатная доставка.", ЭтотОбъект.Партнер));
										
										CRC32 = Новый ХешированиеДанных(ХешФункция.CRC32);
										
										Для каждого стрЗаказ Из РезультатПроверки.ДополнительныеДанные.Заказы Цикл
											
											Если стрЗаказ.Ссылка <> Ссылка И  Документы.ЗаказКлиента.ДоставкаРассчитана(стрЗаказ.Ссылка) Тогда
												
												МассивСтрокСообщенияПочта.Добавить(СтрШаблон("В Заказе клиента № %1 от %2 необходимо установить бесплатную доставку.", стрЗаказ.Ссылка.Номер, Формат(стрЗаказ.Ссылка.Дата, "ДФ=dd.MM.yyyy")));
												МассивСтрокСообщенияПочта.Добавить(СтрШаблон("Ссылка на документ в 1С: %1", ПолучитьНавигационнуюСсылку(стрЗаказ.Ссылка)));
												CRC32.Добавить(СокрЛП(стрЗаказ.Ссылка));
												
												МассивСтрокСообщений.Добавить(СтрШаблон("Требуется ручная корректировка Заказа № %1 от %2 согласно установленному регламенту.", стрЗаказ.Ссылка.Номер, Формат(стрЗаказ.Ссылка.Дата, "ДФ=dd.MM.yyyy")));
												
											КонецЕсли;
											
										КонецЦикла;
										
										МассивСтрокСообщенияПочта.Добавить("Для переноса суммы переплаты на другой счёт необходимо запросить у клиента официальное письмо о переносе ДС.");
										МассивСтрокСообщенияПочта.Добавить("Письмо сформировано автоматически и не требует ответа.");
										
										Если МассивСтрокСообщенияПочта.Количество() > 3 Тогда
											
											ТекстСообщения = СтрСоединить(МассивСтрокСообщенияПочта, Символы.ПС);
											ТемаСообщения = "ВАЖНО! Установить бесплатную доставку по Заказам клиентов";
											ВидСобытия = "ПересчетСтоимостиДоставки" + СтрЗаменить(Строка(CRC32.ХешСумма), Символы.НПП, "");
											
											ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивСтрокСообщений, Символы.ПС));
											
											Адреса = смартУведомления.СформироватьАдресаПолучателейДляОтправки(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Менеджер));
											
											Если НЕ Ссылка.Пустая() Тогда
												СсылкаНаДокумент = Ссылка;
											ИначеЕсли НЕ ЗначениеЗаполнено(ПолучитьСсылкуНового()) Тогда
												СсылкаНаДокумент = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор);
												УстановитьСсылкуНового(СсылкаНаДокумент);
											Иначе
												СсылкаНаДокумент = ПолучитьСсылкуНового();
											КонецЕсли;
											
											Если смартУведомления.ПолучитьИнформациюОПоследнемУведомлении(СсылкаНаДокумент, ВидСобытия).Объект = Неопределено Тогда
												смартУведомления.ОтправитьПочтовоеУведомление(СсылкаНаДокумент, ВидСобытия, ТемаСообщения, ТекстСообщения, Адреса);
											КонецЕсли;
											
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #5014 смарт: Тимофеева 01.12.2025 / Документ Заказ клиента. Способ доставки. Блокировка изменения.
	Если НЕ ЭтоНовый() И НЕ Пользователи.РолиДоступны("ПолныеПрава,ИспользованиеРабочегоМестаДоставки") Тогда
		РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СпособДоставки, Товары");
		Если НЕ СпособДоставки = РеквизитыСсылки.СпособДоставки
			И Документы.ЗаказКлиента.ЕстьЗаданиеНаПеревозку(Ссылка) 
			И Документы.ЗаказКлиента.ВсеТоварыЗаказаСВариантомОбеспеченияОтгрузить(РеквизитыСсылки.Товары.Выгрузить())
			И Документы.ЗаказКлиента.ЕстьНоменклатураСТипомТовар(РеквизитыСсылки.Товары) Тогда		
			ВызватьИсключение "Нельзя изменить способ доставки заказа! Все товары с вариантом обеспечения ""Отгрузить"" и есть задание на перевозку";
		КонецЕсли; 
	КонецЕсли;
	//-- #5014 смарт: Тимофеева 01.12.2025 
	
	//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
	Если НЕ ЭтотОбъект.ПометкаУдаления
		//++ #7116 смарт: Тимофеева 16.06.2026 / Контроль дебиторской задолженности. Исправить ошибку закрытия Заказа клиента
		И НЕ ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт 
        И НЕ ЭтотОбъект.СуммаДокумента = 0
		//-- #7116 смарт: Тимофеева 16.06.2026
		И (РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение)
		И смартКонтрольДебиторскойЗадолженности.ВедетсяКонтрольДебиторскойЗадолженности(Дата) 
		И ЗначениеЗаполнено(Соглашение)
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "Типовое")
		И ЗначениеЗаполнено(Договор) 
		И НЕ СегментыСервер.ВходитВСегмент(Партнер, Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение,, Ложь) Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если НЕ Товары.Найти(Перечисления.ВариантыОбеспечения.Отгрузить, "ВариантОбеспечения") = Неопределено
				И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "смартДоговорПодписан")
				Тогда		
				ОбщегоНазначения.СообщитьПользователю("Проведение невозможно. Договор не подписан.",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		//++ #7274 смарт: Тимофеева 01.07.2026 / Контроль дебиторской задолженности. Контроль дат просрочки.
		//МаксКоличествоДнейОтсрочки = 0;
		//Для Каждого СтрокаЭтапыГрафикаОплаты Из ЭтапыГрафикаОплаты Цикл
		//	Если СтрокаЭтапыГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитСдвиг Тогда
		//		КоличествоДнейОтсрочки = CRM_КалендарныеГрафики.ПолучитьРабочиеДниПериода(Дата, СтрокаЭтапыГрафикаОплаты.ДатаПлатежа).Количество();
		//		Если МаксКоличествоДнейОтсрочки < КоличествоДнейОтсрочки Тогда
		//			МаксКоличествоДнейОтсрочки = КоличествоДнейОтсрочки;	
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	Если СтрокаЭтапыГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки Тогда   
		//		МаксимальнаяДата = ОбеспечениеСервер.МаксимальноеЗначениеВКоллекции(Товары, "ДатаОтгрузки", '00010101');
		//		МаксимальнаяДата = Макс(МаксимальнаяДата, ДатаОтгрузки);
		//		КоличествоДнейОтсрочки = CRM_КалендарныеГрафики.ПолучитьРабочиеДниПериода(МаксимальнаяДата, СтрокаЭтапыГрафикаОплаты.ДатаПлатежа).Количество();
		//		Если МаксКоличествоДнейОтсрочки < КоличествоДнейОтсрочки Тогда
		//			МаксКоличествоДнейОтсрочки = КоличествоДнейОтсрочки;	
		//		КонецЕсли;			
		//	КонецЕсли;
		//КонецЦикла;
		//	
		//
		//смартКонтрольДебиторскойЗадолженности.ПроверитьСуммуКредитаПоСроку(Договор, МаксКоличествоДнейОтсрочки, Дата, Отказ);
		//-- #7274 смарт: Тимофеева 01.07.2026
		
		//++ #7784 смарт: Тимофеева 06.08.2026 / Контроль дебиторской задолженности. Кредитные договора.
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ОграничиватьСуммуЗадолженности, смартВидДоговора");
	    Если РеквизитыДоговора.ОграничиватьСуммуЗадолженности
			И РеквизитыДоговора.смартВидДоговора = Перечисления.смартВидыДоговоров.РасходныеМатериалыОтсрочка Тогда
		//-- #7784 смарт: Тимофеева 06.08.2026 
		
			Если НЕ Отказ Тогда
				СтруктураЗаказа = Новый Структура("Дата, Номер, Договор, СуммаДокумента, Ссылка");
				ЗаполнитьЗначенияСвойств(СтруктураЗаказа, ЭтотОбъект);
				смартКонтрольДебиторскойЗадолженности.ПроверитьЛимитКредита(СтруктураЗаказа, Отказ);
			КонецЕсли;
			
			Если НЕ Отказ Тогда
				СтруктураЗаказа = Новый Структура("Договор, Дата");
				ЗаполнитьЗначенияСвойств(СтруктураЗаказа, ЭтотОбъект);
				смартКонтрольДебиторскойЗадолженности.ПроверитьПросроченныеПлатежиПоДоговору(СтруктураЗаказа, Отказ);
			КонецЕсли;	
			
		//++ #7784 смарт: Тимофеева 06.08.2026 / Контроль дебиторской задолженности. Кредитные договора
		КонецЕсли;
		//-- #7784 смарт: Тимофеева 06.08.2026
		
	КонецЕсли;
	//-- #4822 смарт: Тимофеева 02.04.2026
	
	//++ #Б3034 смарт: Шляпников 29.09.2025 / Изменение алгоритма заполнения менеджера в Онлайн Заказе клиента 
	Если НЕ Отказ Тогда
		смартИнтернетМагазин.РаспределениеОповещениеПоОнлайнЗаказу(ЭтотОбъект);
	КонецЕсли;
	//-- #Б3034 смарт: Шляпников 29.09.2025
	
	//++ #6602 смарт: Тимофеева 23.04.2026 / Маркировка радиоэлектронной продукции. Системные уведомления пользователей. 
	Если смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Дата) Тогда
		ТаблицаМаркируемыйТовар = смартМаркировка.ПолучитьМаркируемыйТоварИзКоллекции(Товары.Выгрузить(), Дата);
		Если ТаблицаМаркируемыйТовар.Количество() > 0 Тогда 			
			МассивСкладов = Новый Массив;
			Если Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Склад) Тогда
				МассивСкладов = ТаблицаМаркируемыйТовар.ВыгрузитьКолонку("Склад");	
			Иначе
				МассивСкладов.Добавить(Склад);
			КонецЕсли;
			
			Для Каждого КлючИЗначение Из ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСкладов, "смартНазначениеСклада") Цикл
				Если НЕ КлючИЗначение.Значение = Перечисления.смартНазначенияСкладов.ТорговыйСклад Тогда
					ТекстСообщения = "В документе содержится маркируемый товар. Проведение документа с неторговых складов запрещено. Измените склад отгрузки.";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ); 
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	//-- #6602 смарт: Тимофеева 23.04.2026

КонецПроцедуры

//++ смарт:Подкин #1038 27.05.2022 12:27:43
&НаСервере
Процедура смартУстановкаРС() 
    
    Если (ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте 
        ИЛИ ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВВалюте)
        И НЕ ЭтотОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка()
        И ЭтотОбъект.Договор.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка() Тогда
        ЭтотОбъект.БанковскийСчет=Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация,ЭтотОбъект.Валюта);
    ИначеЕсли (ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях 
        ИЛИ ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях)
        И ЭтотОбъект.Договор.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка() Тогда
        ЭтотОбъект.БанковскийСчет=Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация); 
    КонецЕсли;
     
КонецПроцедуры //-- смарт:Подкин #1038 27.05.2022 12:27:43

&НаСервере
Функция смартПроверкаКурсаРасчета(Номенклатура, ВидЦены) Экспорт  

    //++ смарт:Подкин #914 02.03.2022 17:12:54 проверка вида цены по сегменту поиск по коду рекомендация Дмитрия
    
    //++ смарт:Подкин #1025 п3 22.05.2022 13:29:10
    //СегментВыбранЕВРО=Справочники.СегментыНоменклатуры.НайтиПоКоду("ЦБ-00000169"); 
    СегментВыбранЕВРО = Справочники.смартПредопределенныеЗначения.СегментВалютныхЗаказов.Значение;
    ПродажаВРублях = НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
    //-- смарт:Подкин #1025 п3 22.05.2022 13:29:10
	//++ смарт:Каратеев №1343 20.04.2023 //Исключить ограничение на продажу в USD
	ВалютаВидаЦенРазрешена = смартРазрешенныеВалютыВидаЦен(ВидЦены.ВалютаЦены);
	//-- смарт:Каратеев №1343 20.04.2023 //Исключить ограничение на продажу в USD
    
    ВходитВСегментЕВРО = СегментыСервер.ВходитВСегмент(Номенклатура,СегментВыбранЕВРО);
	
	//++ #Б6792 смарт: Шляпников 14.05.2026 / Использование вида цен в юанях
	СегментВыбранЮАНИ = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("СегментНоменклатурыВЮанях", Справочники.СегментыНоменклатуры.ПустаяСсылка());
	ВходитВСегментЮАНИ = СегментыСервер.ВходитВСегмент(Номенклатура,СегментВыбранЕВРО);
	//-- #Б6792 смарт: Шляпников 14.05.2026
    
    СтруктураПроверки = Новый Структура("РезультатПроверки,ВалютаСегмент");
    
	Если НЕ ЗначениеЗаполнено(ВидЦены)
		//++ #Б6792 смарт: Шляпников 14.05.2026 / Использование вида цен в юанях
        И (ВходитВСегментЕВРО ИЛИ ВходитВСегментЮАНИ)
		//-- #Б6792 смарт: Шляпников 14.05.2026
        И НЕ ВалютаВидаЦенРазрешена ////+- смарт:Каратеев №1343 20.04.2023//НЕ ВидЦены.ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить()
        ИЛИ НЕ ВидЦены.Статус = Перечисления.СтатусыДействияВидовЦен.Действует Тогда     
        
        СтруктураПроверки.РезультатПроверки = Истина; 
        
        Если ВходитВСегментЕВРО Тогда
            СтруктураПроверки.ВалютаСегмент = Константы.ВалютаУправленческогоУчета.Получить();
        ИначеЕсли ВидЦены.Статус = Перечисления.СтатусыДействияВидовЦен.Действует Тогда 
            СтруктураПроверки.ВалютаСегмент = Истина;
        Иначе
            СтруктураПроверки.ВалютаСегмент = Ложь;
        КонецЕсли;                 
        
        Возврат СтруктураПроверки; 
	ИначеЕсли ВидЦены.Статус = Перечисления.СтатусыДействияВидовЦен.Действует И НЕ ВходитВСегментЕВРО И ВидЦены.ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить() Тогда
		
        СтруктураПроверки.РезультатПроверки = Истина; 
        СтруктураПроверки.ВалютаСегмент = Истина;
        Возврат СтруктураПроверки; 
        
        //++ смарт:Подкин #984 19.04.2022 12:26:17
	//++ #Б6792 смарт: Шляпников 14.05.2026 / Использование вида цен в юанях
	ИначеЕсли ВидЦены.Статус = Перечисления.СтатусыДействияВидовЦен.Действует И НЕ ВходитВСегментЮАНИ И ВидЦены.ВалютаЦены = Справочники.Валюты.НайтиПоКоду("156") Тогда
	
        СтруктураПроверки.РезультатПроверки = Истина; 
        СтруктураПроверки.ВалютаСегмент = Истина;
		
        Возврат СтруктураПроверки; 
        
    //-- #Б6792 смарт: Шляпников 14.05.2026
	ИначеЕсли ЗначениеЗаполнено(ВидЦены) 
		//++ #Б6792 смарт: Шляпников 14.05.2026 / Использование вида цен в юанях
        И (ВходитВСегментЕВРО ИЛИ ВходитВСегментЮАНИ)
		//-- #Б6792 смарт: Шляпников 14.05.2026
        И НЕ ВалютаВидаЦенРазрешена Тогда////+- смарт:Каратеев №1343 20.04.2023//НЕ ВидЦены.ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить() Тогда 
        
        //++ смарт:Подкин #1025 23.05.2022 17:57:30
        Если ПродажаВРублях И 
            НЕ ВалютаВидаЦенРазрешена Тогда////+- смарт:Каратеев №1343 20.04.2023//НЕ ВидЦены.ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить() И НЕ ВидЦены.ВалютаЦены = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
            СтруктураПроверки.РезультатПроверки = Истина; 
            СтруктураПроверки.ВалютаСегмент = Ложь; 
        //Иначе                                     
                Возврат СтруктураПроверки;
        //-- смарт:Подкин #984 19.04.2022 12:26:17 
        КонецЕсли;
        //-- смарт:Подкин #1025 23.05.2022 17:57:30
        
        //++ смарт:Подкин #1025 22.05.2022 14:43:49
	//++ #Б6792 смарт: Шляпников 14.05.2026 / Использование вида цен в юанях
	ИначеЕсли ЗначениеЗаполнено(ВидЦены) И НЕ ВходитВСегментЕВРО И НЕ ВходитВСегментЮАНИ
	//-- #Б6792 смарт: Шляпников 14.05.2026
        И ПродажаВРублях И НЕ ВалютаВидаЦенРазрешена Тогда////+- смарт:Каратеев №1343 20.04.2023//НЕ ВидЦены.ВалютаЦены = Константы.ВалютаРегламентированногоУчета.Получить() Тогда   
        СтруктураПроверки.РезультатПроверки = Истина; 
        СтруктураПроверки.ВалютаСегмент = Константы.ВалютаРегламентированногоУчета.Получить(); 
        Возврат СтруктураПроверки;
        //-- смарт:Подкин #1025 22.05.2022 14:43:49
    КонецЕсли;
    Возврат Неопределено;
    //-- смарт:Подкин #914 02.03.2022 17:12:54  
    
КонецФункции 

//++ смарт:ММ #076 373 08.10.2020 - Доработка справочника Контрагенты - факт. адрес 
&После("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)
	
	ЭтоНовый = Ложь;
	Если ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый) Тогда
		
		// Если тут сделаны изменения, то продублировать для документа РеализацияТоваровУслуг
		Если ЭтоНовый Тогда
			
			КоличествоМесяцев = Справочники.смартПредопределенныеЗначения.ПериодичностьОбновленияРеквизитовКонтрагентов.Значение;
			
			Если ТипЗнч(КоличествоМесяцев) = Тип("Число") Тогда
				
				ПоследняяХорошаяДата = НачалоДня(ДобавитьМесяц(ТекущаяДата(), -КоличествоМесяцев));
				смартДатаОбновленияПоДаннымФНС = Контрагент.смартДатаОбновленияПоДаннымФНС;
				
				Если смартДатаОбновленияПоДаннымФНС < ПоследняяХорошаяДата Тогда
					ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
					ПараметрыПроцедуры = Новый Структура("СсылкаКонтарегнт", Ссылка.Контрагент);
					ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.ЗаполнениеРеквизитовКонтрагентаПоИНН", ПараметрыПроцедуры, ПараметрыВыполнения);
				КонецЕсли;
			КонецЕсли;
			
			//++ #Б-2620 смарт: Лопато 12.03.2025 //Удалить Спецификации по IECHO из задач.  
			// Закомментировал код
			////++ смарт:ММ #092 389 19.01.2021 - Конструктор оборудования
			//Если ЗначениеЗаполнено(ДокументОснование) 
			//	И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.смартIECHOСпецификация") Тогда
			//	ВыполнитьЗадачуСоздатьЗаказПоБизнесПроцессу();
			//КонецЕсли;
			////-- смарт:ММ 19.01.2021
			//-- #Б-2620 смарт: Лопато 12.03.2025
			
		КонецЕсли;
	КонецЕсли;

	//++ #Б-2620 смарт: Лопато 12.03.2025 //Удалить Спецификации по IECHO из задач.  
	// Закомментировал код
	////++ смарт:ММ #092 389 19.01.2021 - Конструктор оборудования
	//Если НЕ Отказ И ПометкаУдаления Тогда
	//	ВыполнитьЗадачиПриОтменеЗаказаПоБизнесПроцессу();
	//КонецЕсли;
	////-- смарт:ММ 19.01.2021
	//-- #Б-2620 смарт: Лопато 12.03.2025
	
	//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
	Если НЕ Отказ
		//++#1241 смарт: Лопато 06.04.2023 //Исправлена ошибка при получении заказа с сайта  
		И (НЕ ДополнительныеСвойства.Свойство("РежимЗаписи")
		   ИЛИ (ДополнительныеСвойства.Свойство("РежимЗаписи") И НЕ (ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
				  												 ИЛИ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)))
		//--#1241 смарт: Лопато 06.04.2023
		И Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() 
		И Б_ОбменССайтомСервер.смартПроверкаЗаказНужноВыгружатьНаСайт(Ссылка, Истина) Тогда

		СтруктураДействийРасчета = Новый Структура("Заказ");
		смарт_РаботаССтатусамиЗаказа.смартРассчитатьПараметрыСтатусовЗаказовБитрикс(Ссылка, СтруктураДействийРасчета);
		
	КонецЕсли;
	//--#1241 смарт: Лопато 14.11.2022
	
	//++ #Б674 смарт: Шляпников 25.03.2025 / Отчет по кол-ву платных доставок, ИТСМ 1959
	Если НЕ Отказ Тогда
		
		Если ДополнительныеСвойства.Свойство("Регион") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
			|	ДополнительныеРеквизитыИСведения.Имя КАК Имя
			|ИЗ
			|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|ГДЕ
			|	ДополнительныеРеквизитыИСведения.Имя В (""РегионДоставки"", ""ВесЗаказа"", ""ГородДоставки"", ""РасстояниеДоставки"")";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Ссылка, Истина);
				НаборЗаписей.Отбор.Свойство.Установить(Выборка.Ссылка, Истина);
				
				Запись = НаборЗаписей.Добавить();
				Запись.Объект = Ссылка;
				Запись.Свойство = Выборка.Ссылка;
				Если Выборка.Имя = "РегионДоставки" Тогда
					Запись.Значение = ДополнительныеСвойства.Регион;
				ИначеЕсли Выборка.Имя = "ВесЗаказа" Тогда
					Запись.Значение = ДополнительныеСвойства.ВесЗаказа;
				ИначеЕсли Выборка.Имя = "ГородДоставки" Тогда
					Запись.Значение = ДополнительныеСвойства.Город;
				ИначеЕсли Выборка.Имя = "РасстояниеДоставки" Тогда
					Запись.Значение = ДополнительныеСвойства.Расстояние;
				КонецЕсли;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б674 смарт: Шляпников 25.03.2025
	
	//++ #Б-4112 смарт: Фролов 26.08.2025 //Закрытие Интересов при закрытии Заказов клиентов - (по СЦ)
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	CRM_Интерес КАК Интерес
		|ИЗ
		|	РегистрСведений.CRM_ЖурналДокументов
		|ГДЕ
		|	Объект = &ЗаказКлиента
		|	И CRM_Интерес.ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаЗапасныеЧасти)");
		Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
		
		СтрокиТовары = Товары.НайтиСтроки(Новый Структура("Отменено", Ложь));
		Если СтрокиТовары.Количество() = 0 Тогда
			
			Если НЕ Запрос.Выполнить().Пустой() Тогда
				
				ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов", Новый ТаблицаЗначений);
				CRM_КлиентыСервер.ЗарегистрироватьОбъектВОбщемЖурнале(ЭтотОбъект, Отказ);
				
			КонецЕсли;	
			
		КонецЕсли;
		
		//++ #Б-7226 смарт: Фролов 15.07.2026 //Поле "Автоматическая квалификация" заполнять автоматически
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CRM_ЖурналДокументов.CRM_Интерес КАК Интерес,
		|	CRM_ЖурналДокументов.Объект КАК Заказ
		|ПОМЕСТИТЬ ЗаказыИИнтересы
		|ИЗ
		|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
		|ГДЕ
		|	CRM_ЖурналДокументов.ГлавнаяЗапись
		|	И НЕ CRM_ЖурналДокументов.CRM_Интерес = ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка)
		|	И CRM_ЖурналДокументов.Объект = &ЗаказКлиента
		|	И CRM_ЖурналДокументов.CRM_Интерес.ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаТоварыУслуги)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыИИнтересы.Интерес КАК Интерес,
		|	ЗаказыИИнтересы.Интерес.смартИтоговаяКвалификация КАК КвалификацияИнтереса,
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	ЗаказыИИнтересы КАК ЗаказыИИнтересы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО ЗаказыИИнтересы.Заказ = ЗаказКлиентаТовары.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		|	И ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаСНДС УБЫВ");
		Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			КвалификацияОпределенная = смартОпределитьПоПродуктуКвалификацию(Выборка.Наименование);
			
			Если НЕ КвалификацияОпределенная = Выборка.КвалификацияИнтереса Тогда
				
				ОбИнтерес = Выборка.Интерес.ПолучитьОбъект();
				ОбИнтерес.смартИтоговаяКвалификация = КвалификацияОпределенная;
				ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;	
			
		КонецЕсли;	
		//-- #Б-7226 смарт: Фролов 15.07.2026
	
	КонецЕсли;
	//-- #Б-4112 смарт: Фролов 26.08.2025
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	Если ЗначениеЗаполнено(ЭтотОбъект.смартИДРазрешенияНаБесплатнуюДоставку) И НЕ Отказ Тогда
		
		ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Ссылка, ЭтотОбъект.смартИДРазрешенияНаБесплатнуюДоставку, "БесплатнаяДоставка");
		Если ДанныеОРазрешении = Неопределено Тогда
			
			РегистрыСведений.смартИсторияИзмененияРазрешений.ЗаписатьРазрешениеВИсторию(Ссылка,, 
																						"БесплатнаяДоставка", 
																						ЭтотОбъект.смартРазрешенаБесплатнаяДоставка, 
																						ЭтотОбъект.смартИДРазрешенияНаБесплатнуюДоставку);
																						
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
	Если ЗначениеЗаполнено(ЭтотОбъект.смартИДРазрешенияНаДоставкуВнеЗоны) И НЕ Отказ Тогда
		
		//++ #Б-5712 смарт: Фролов 17.03.2026 //Документ Заказ клиента. Доставка. Алгоритм установки разрешений.
		//ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Ссылка, ЭтотОбъект.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны, "ДоставкаВнеЗоны");
		ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Ссылка, ЭтотОбъект.смартИДРазрешенияНаДоставкуВнеЗоны, "ДоставкаВнеЗоны");
		//-- #Б-5712 смарт: Фролов 17.03.2026
		Если ДанныеОРазрешении = Неопределено Тогда
			
			РегистрыСведений.смартИсторияИзмененияРазрешений.ЗаписатьРазрешениеВИсторию(Ссылка,, 
																						"ДоставкаВнеЗоны", 
																						ЭтотОбъект.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны, 
																						ЭтотОбъект.смартИДРазрешенияНаДоставкуВнеЗоны);
																						
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4868 смарт: Шляпников 12.11.2025
	
	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом 
	Если Дата >= Дата("20251106") Тогда
		ТаблицаОборудования = смартСервер.ПолучитьТаблицуСублимационногоОборудования(Товары.Выгрузить(, "Номенклатура,Склад"), Склад);
		Если НЕ Отказ 
			И ДополнительныеСвойства.Свойство("РежимЗаписи") 
			И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ТаблицаОборудования.Количество() > 0 Тогда
			
			КаталогСсылка = смартСервер.ПолучитьКаталогДляКомплектацииОборудования();
			
			Если ЗначениеЗаполнено(КаталогСсылка) 
				И НЕ ЗначениеЗаполнено(смартСервер.ПолучитьЗаказНаВнутренееПотребление(Ссылка, КаталогСсылка)) Тогда 		
				
				МассивСкладов = ТаблицаОборудования.ВыгрузитьКолонку("Склад");
				ОстаткиКаталогаНаСкладах = смартСервер.ПолучитьОстаткиНоменклатурыНаСкладах(КаталогСсылка, МассивСкладов, Дата);
				Для Каждого СтрокаОборудование Из ТаблицаОборудования Цикл
					Если (СтрокаОборудование.ЭтоВнутреннийСклад ИЛИ СтрокаОборудование.ЭтоСкладОтветственногоХранения)
						И НЕ ОстаткиКаталогаНаСкладах.Найти(СтрокаОборудование.Склад, "Склад") = Неопределено Тогда                        
						УстановитьПривилегированныйРежим(Истина);
						ЗаказНаВнутренееПотреблениеСсылка = смартСервер.СоздатьЗаказНаВнутренееПотребление(Ссылка, Партнер, КаталогСсылка, СтрокаОборудование.Склад, СтрокаОборудование.ЭтоСкладОтветственногоХранения);
						УстановитьПривилегированныйРежим(Ложь);
						Если ЗначениеЗаполнено(ЗаказНаВнутренееПотреблениеСсылка) Тогда
							ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для комплектования оборудования каталогом сформирован документ %1", ЗаказНаВнутренееПотреблениеСсылка));
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//++ #5202 смарт: Тимофеева 22.12.2025 / Списание каталога. Формирование документа Расходного ордера при отгрузке со складов ответ. хранения.
			Если Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт 
				И ЗначениеЗаполнено(КаталогСсылка)				
				И НЕ ТаблицаОборудования.Найти(Истина, "ЭтоСкладОтветственногоХранения") = Неопределено
				И ТаблицаОборудования.Найти(Ложь, "ЭтоСкладОтветственногоХранения") = Неопределено Тогда 
				
				ЗаказНаВнутренееПотребление = смартСервер.ПолучитьЗаказНаВнутренееПотребление(Ссылка, КаталогСсылка);
				ВнутренееПотреблениеПоЗаказу = смартСервер.НайтиВнутренееПотреблениеПоЗаказу(ЗаказНаВнутренееПотребление);
				
				Если ЗначениеЗаполнено(ЗаказНаВнутренееПотребление) 
					И ЗначениеЗаполнено(ВнутренееПотреблениеПоЗаказу)
					И НЕ ЗначениеЗаполнено(смартСервер.НайтиРасходныйОрдерНаТоварыПоЗаказу(ЗаказНаВнутренееПотребление)) Тогда
					УстановитьПривилегированныйРежим(Истина);
					РасходныйОрдерНаТоварыСсылка = смартСервер.СоздатьРасходныйОрдерНаТовары(ДатаЗакрытия, ЗаказНаВнутренееПотребление);
					УстановитьПривилегированныйРежим(Ложь);
					Если ЗначениеЗаполнено(РасходныйОрдерНаТоварыСсылка) Тогда
						ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для комплектования оборудования каталогом сформирован документ %1", РасходныйОрдерНаТоварыСсылка));
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			//-- #5202 смарт: Тимофеева 22.12.2025
		КонецЕсли;	
	КонецЕсли;
	//-- #2552 смарт: Тимофеева 20.10.2025

КонецПроцедуры //-- смарт:ММ 08.10.2020

//++ #Б-7226 смарт: Фролов 15.07.2026 //Поле "Автоматическая квалификация" заполнять автоматически
Функция смартОпределитьПоПродуктуКвалификацию(Продукт)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Ссылка КАК Квалификация,
	|	ДЛИНАСТРОКИ(Продукт) КАК ДлинаНаименования
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Продукты
	|ГДЕ
	|	Ссылка.ТипПродукта.АнализироватьПродукт
	|	И &Продукт ПОДОБНО ""%"" + Продукт + ""%""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДлинаНаименования УБЫВ,
	|	Ссылка.Наименование УБЫВ");
	
	Запрос.УстановитьПараметр("Продукт", Продукт);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Квалификация;
	КонецЕсли;	
	
	Возврат Справочники.смартКвалификацииМенеджеров.ПустаяСсылка();
	
КонецФункции //-- #Б-7226 смарт: Фролов 15.07.2026

//++ смарт:ММ #092 389 19.01.2021 - Конструктор оборудования
Процедура ВыполнитьЗадачуСоздатьЗаказПоБизнесПроцессу()

	// Поиск невыполненной задачи СоздатьЗаказ по бизнес процессу
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	|	ЗадачаИсполнителя.БизнесПроцесс
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|	И ЗадачаИсполнителя.Предмет = &Предмет
	|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("Предмет", ДокументОснование);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказ);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		БП = Выборка.БизнесПроцесс.ПолучитьОбъект();
		БП.ЗаказКлиента = Ссылка;
		БП.Записать();
		
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЦикла;

КонецПроцедуры //-- смарт:ММ 19.01.2021

//++ смарт:ММ #092 389 21.01.2021 - Конструктор оборудования
Процедура ВыполнитьЗадачиПриОтменеЗаказаПоБизнесПроцессу()
	
	// Проверка, являются ли нужные точки маршрута текущими, и выполнение соответствующих задач
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	|	ЗадачаИсполнителя.ТочкаМаршрута
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|	И ЗадачаИсполнителя.Предмет = &Предмет
	|	И ЗадачаИсполнителя.ТочкаМаршрута В (&ТочкаМаршрута)";
	
	ТочкаМаршрута = Новый Массив;
	ТочкаМаршрута.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента);
	ТочкаМаршрута.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОтменитьЗаказ);
	
	Запрос.УстановитьПараметр("Предмет", ДокументОснование);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Выборка.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента Тогда
			ЗадачаОбъект.КлиентОтказалсяОтЗаказаНаЭтапеОплаты = Истина;
		КонецЕсли;
		
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 21.01.2021

&После("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)
	// Фролов+
	ВыполнитьДвиженияПоРаботамСервисногоЦентра(Отказ,РежимПроведения,смартСервер.ПолучитьДатуВнедренияФункционала());
	смартСервер.ДописатьДвиженияПоУчетуУслугСЦ(Ссылка);
	// Фролов-

	//Каратеев +
	//Движение по регистрам для документа "МаркетинговыеМероприятияДокумент"
	демоДемонстрацияОборудованияЗапись();

	Если НЕ РольДоступна("ПолныеПрава")
		И Дата < Дата("14.11.2018 00:00:00")
		И ЭтотОбъект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714358034") 	//Смарт-Т Сервис (Деловой подход)
		Тогда
		Сообщить("Организация Смарт-Т Сервис прекращает свою деятельность. Пожалуйста, если Заказ клиента еще не оплачен, переделайте его на организацию Смарт-Т ООО!");
	//++смарт:rnp 682 15.10.2021	
	ИначеЕсли НЕ РольДоступна("ПолныеПрава")
		И Дата < Дата("16.10.2021 00:00:00")//> Дата("16.10.2021 00:00:00")

        //++ смарт:ПА # 11.01.2022 12:51:45
        //И Дата < Дата("31.12.2021 23:59:59") 
        //-- смарт:ПА # 11.01.2022 12:51:45 
        
		И ЭтотОбъект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9701053617") 	//СМАРТ-Т ТЕКСТИЛЬ 
      //  И НЕ ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо= Справочники.ФизическиеЛица.НайтиПоНаименованию("Придня Екатерина Игоревна") 
		Тогда     
        
        //++ смарт:ПА # 11.01.2022 13:26:49
        //Отказ = Истина;
        //-- смарт:ПА # 11.01.2022 13:26:49
        
		Сообщить("Организация Смарт-Т Текстиль приостанавливает свою деятельность. Пожалуйста, если Заказ клиента еще не оплачен, переделайте его на организацию Смарт-Т ООО!");
	ИначеЕсли ЭтотОбъект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9701053617") 	//СМАРТ-Т ТЕКСТИЛЬ
		И ЭтотОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "9723124519") //смарт:rnp 21.10.2021 Снятие ограничения для конкретного контрагента по просьбе Ларькова
		Тогда
		Сообщить("Создание счета от организации ""Смарт-Т Текстиль"" разрешено только для этого контрагента");
	//--смарт:rnp 682	
	ИначеЕсли ЭтотОбъект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714358034") 	//Смарт-Т Сервис (Деловой подход)
		И ЭтотОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "4025033326") //Снятие ограничения для конкретного контрагента по просьбе Котельниковой
		Тогда
		Сообщить("Создание счета от организации ""Смарт-Т Сервис"" разрешено только для этого контрагента 
		|и только до окончания действия годового договора на обслуживание");
	ИначеЕсли НЕ РольДоступна("ПолныеПрава")
		И	ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "7709461879")		//Смарт-Т ООО (Смарт-Т Торговля; Отличное предложение)
		//И   ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "7722799709") 	//Смарт-т Дистрибьюшн
		//И   ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714358034") 	//Смарт-Т Сервис (Деловой подход)
		//И   ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "772736906578") //ИП Макачев А. Н.
		//++смарт:rnp 682 15.10.2021 закомментировано
		//И	ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "0000000000")		//СМАРТ-Т (Управленческая организация)
        И	ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "9701053617")		//СМАРТ-Т ТЕКСТИЛЬ
        //--смарт:rnp 682 15.10.2021 
        //++ смарт:Подкин # 06.07.2022 9:35:48
        И	ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "7722457913")		//КОВЧЕГ
        //-- смарт:Подкин # 06.07.2022 9:35:48
        И	ЭтотОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "3906349822")		//СМАРТ-Т ВЕСТ
		Тогда
		Отказ = Истина;
		//++смарт:rnp 682 15.10.2021 
		//Сообщить("Возможно выбрать только одну из действующих организаций: Смарт-Т ООО; Смарт-Т Сервис; Смарт-Т Текстиль; СМАРТ-Т; Смарт-Т Вест");
		Сообщить("Возможно выбрать только действующую организацию Смарт-Т ООО");
		//--смарт:rnp 682 15.10.2021 закомментировано
	КонецЕсли;
	//Каратеев -
	// Смарт Фролов+ Если Заказ закрыт, тогда очищаем запись в регистре сведений "смарт_РегистрацияОтправкиСчета"
	Если Статус=Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда 
		Документы.ЗаказКлиента.СнятьПризнакСчетНаОплатуВыставлен(ЭтотОбъект.Ссылка);
	КонецЕсли;	
	// Фролов-
	
	//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.06.2020 12:36:19 построение таблицы статусов задача 552
	//ЗаказССайта=Неопределено;
	//ЗаказИз=ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаказССайта",ЗаказССайта);
	//Если Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() И ЗаказССайта=Неопределено И НЕ Б_ОбменССайтомСервер.ЭтоКопияБазы() Тогда
	//Если НЕ Отказ И Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() Тогда
	//     смарт_РаботаССтатусамиЗаказа.ОтразитьСостояниеЗаказаБитрикс(ЭтотОбъект);
	//КонецЕсли; 
	//Смарт }Подкин Алексей Иванович 29.06.2020 12:36:19
	//--#1241 смарт: Лопато 14.11.2022 
	
	//++ #Б-2436 смарт: Фролов 07.03.2025 //Ввод нового регламента. Учитывать выставленные Заказы клиентов как завершенные взаимодействия.
	Если ЗначениеЗаполнено(Партнер) И ЗначениеЗаполнено(Менеджер) И Партнер.ОсновнойМенеджер = Менеджер Тогда
		
		НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Партнер.Установить(Партнер);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			Если Дата > НаборЗаписей[0].ДатаПоследнегоВзаимодействия Тогда
				
				НаборЗаписей[0].ДатаПоследнегоВзаимодействия  = Дата;
				НаборЗаписей.Записать(Истина);
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-2436 смарт: Фролов 07.03.2025
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	смартАкцииИСкидки.СформироватьДвиженияИспользованныхТоваровПоЗаказуКлиента(Ссылка, Отказ);
	//-- #Б4818 смарт: Шляпников 17.11.2025

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура смарт_ОбработкаУдаленияПроведения(Отказ)
	
	//Каратеев +
	демоДемонстрацияОборудованияУдаление();
	//Каратеев -
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	Если НЕ Отказ 
		И смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("КонтроллироватьСтоимостьДоставкиРасходки")
		И Дата >= смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаПроверкиСтоимостиДоставкиРасходки") Тогда
		
		Если ЭтотОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
			
			Если Документы.ЗаказКлиента.ВЗаказеТолькоРасходныеМатериалы(ЭтотОбъект) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗаказКлиента.Ссылка КАК Ссылка,
				|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
				|	ЗаказКлиента.Валюта КАК Валюта
				|ИЗ
				|	Документ.ЗаказКлиента КАК ЗаказКлиента
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
				|		ПО (СостоянияЗаказовКлиентов.Заказ = ЗаказКлиента.Ссылка)
				|ГДЕ
				|	ЗаказКлиента.Партнер = &Партнер
				|	И ЗаказКлиента.АдресДоставки = &АдресДоставки
				|	И ЗаказКлиента.ЖелаемаяДатаОтгрузки = &ЖелаемаяДатаОтгрузки
				|	И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
				|	И ЗаказКлиента.Ссылка <> &Ссылка
				|	И ЗаказКлиента.Проведен
				|	И НЕ СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
				|	И НЕ СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100";
				
				Запрос.УстановитьПараметр("Партнер", ЭтотОбъект.Партнер);
				Запрос.УстановитьПараметр("АдресДоставки", ЭтотОбъект.АдресДоставки);
				Запрос.УстановитьПараметр("ЖелаемаяДатаОтгрузки", ЭтотОбъект.ЖелаемаяДатаОтгрузки);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Необходимо проверить стоимость доставки в заказе %1", Выборка.Ссылка), Выборка.Ссылка);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
КонецПроцедуры

&Перед("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)
	
	//Каратеев + Согласовано фин оттелом
	СогласованоБух = Ложь;
	смартДокументыПодписаны = Ложь;
	//Каратеев -
	// Фролов+
	ДатаЗакрытия='00010101';
	смартДопУслуги.Очистить();
	смартПроводитьДокументПриВысокомСПАРКРиске=Ложь;
	Комментарий="";
	ДатаДоставки='00010101';
	НаличиеСчетаВБухгалтерии=Ложь;
	ДополнительнаяИнформацияПоДоставке="";
	ОсобыеУсловияПеревозкиОписание="";
	ОсобыеУсловияПеревозки=Ложь;
	// Фролов-
	
	//++ смарт:ММ #085 364 02.12.2020 
	смартОсобыеУсловияОтгрузки = "";
	//-- смарт:ММ 02.12.2020
	//++ смарт:ММ #086 362 16.12.2020 
	смартДатаОплаты = '00010101';
	//-- смарт:ММ 16.12.2020
	
	//++ Смарт: Белоусова 566 27.06.2021
	смартВидТранспорта = "";
	смартНомерМашины = "";
	смартНомерПрицепа= "";
	смартФИОВодителя = "";
	смартНомерСерияПаспортВодителя = "";
	смартДатаВыдачиПаспортаВодителя =  '00010101';
	смартЖелаемоеВремяОтгрузки = '00010101000000';
	//-- Смарт: Белоусова 566 27.06.2021

	//++ Смарт: Белоусова 582 21.07.2021
	смартРазрешитьПродажуСНДСдляУСН = Ложь;
	//-- Смарт: Белоусова 582 21.07.2021

	//++ Смарт: Белоусова 609 25.08.2021
	смартЖелаемаяДатаОтгрузкиАдмирал = '00010101';
	//-- Смарт: Белоусова 609 25.08.2021

	//++ Смарт: Белоусова 637 13.09.2021
	смартБезвозмезднаяПередача = Ложь;
	//-- Смарт: Белоусова 637 13.09.2021
	
	//++ смарт:Каратеев #без задачи 03.02.2023 //Забыли сделать очистку индивидуальных значений при копировании документа по задаче #1047
	смартРазрешитьПовышеннуюСкидку = Ложь;
	смартПроцентРазрешеннойМаксимальнойСкидки = 0;
	смартПользовательРазрешилПовышеннуюСкидку = Справочники.Пользователи.ПустаяСсылка();
	//-- смарт:Каратеев #без задачи 03.02.2023
	
	//++ #Б-2432 смарт: Лопато 21.02.2025 //Документ Заказ клиента. Доработка  
	смартИсполнительРаботПоЗаказу = Неопределено;
	//-- #Б-2432 смарт: Лопато 21.02.2025
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	смартРазрешенаБесплатнаяДоставка = Ложь;
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
	смартРазрешенаДоставкаЗаПределыУстановленнойЗоны = Ложь;
	//-- #Б4868 смарт: Шляпников 12.11.2025
	
	//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
	СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	ПеревозчикПартнер = Неопределено;
	ЗонаДоставки = Неопределено;
	ВремяДоставкиС = 0;
	ВремяДоставкиПо = 0;
	АдресДоставки = "";
	АдресДоставкиПеревозчика = "";
	АдресДоставкиЗначенияПолей = "";
	АдресДоставкиПеревозчикаЗначенияПолей = "";
	ДополнительнаяИнформацияПоДоставке = "";
	ОсобыеУсловияПеревозки = Ложь;
	ОсобыеУсловияПеревозкиОписание = "";
	ДополнительнаяОбработкаГрузаТранспортнойКомпанией = Неопределено;
	СпособДоставкиТовара = Неопределено;
	ПлатильщикЗаДоставкуГруза = Неопределено;
	ПропускнаяСистема = Неопределено;
	ЭтотОбъект.смартАкции.Очистить();
	//-- #Б4248 смарт: Шляпников 16.09.2025

КонецПроцедуры

&После("ПриКопировании")
Процедура смарт_ПриКопированииПосле(ОбъектКопирования)
	
	Если Не НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС") Тогда
		
		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		Для Каждого Стр Из Товары Цикл
			
			//++ #Б5354 смарт: Шляпников 12.01.2026 / Новая ставка НДС22. Доработки.
			//Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20")
			//	Или Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда 
			//	Продолжить;
			//КонецЕсли;	
			Если Стр.СтавкаНДС = стр.Номенклатура.СтавкаНДС Тогда
				Продолжить;
			КонецЕсли;
			//-- #Б5354 смарт: Шляпников 12.01.2026
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", НалогообложениеНДС, Дата));
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСумму");
			ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(Стр, СтруктураДействий,КэшированныеЗначения);
			
		КонецЦикла;	
		
    КонецЕсли;      
	
	//++ смарт:Демичев #1172 07.09.2022   
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ОбъектКопирования);
	
	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("Дата",   ТекущаяДата());
	СтруктураЗаполненияЦены.Вставить("Валюта", ОбъектКопирования.Валюта);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
    //-- смарт:Демичев #1172 07.09.2022
	
    //смарт 914 Каратеев ++ 01.03.2022:
	Для Каждого Стр Из Товары Цикл
		Стр.ВидЦены = ?(Соглашение.Ссылка.Пустая(), Справочники.ВидыЦен.ПустаяСсылка(), Соглашение.ВидЦен);  
        //++ смарт:Подкин #978 17.04.2022 16:29:42
        Стр.ПроцентАвтоматическойСкидки=0;
        Стр.ПроцентРучнойСкидки=0;
        Стр.СуммаАвтоматическойСкидки=0;
        Стр.СуммаРучнойСкидки=0;
        //-- смарт:Подкин #978 17.04.2022 16:29:42 
		
		//++ смарт:Демичев #1172 07.09.2022
		
		ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, КэшированныеЗначения);

		//-- смарт:Демичев #1172 07.09.2022
		
	КонецЦикла;
	//смарт 914 Каратеев -- 01.03.2022:
    
    //++ смарт:Подкин #914 01.03.2022 12:57:16
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		//++ #1315 смарт: Фролов 21.02.2023 //Ошибка заполнения р/с организации при копировании Заказа клиента  
		Если (ЭтотОбъект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях 
		ИЛИ ЭтотОбъект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях) Тогда
			ВалютаБС=Константы.ВалютаРегламентированногоУчета.Получить();
		Иначе
			ВалютаБС=ЭтотОбъект.Валюта;
		КонецЕсли;	
        //ЭтотОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация,ЭтотОбъект.Валюта);
		ЭтотОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация,ВалютаБС);
   		//-- #1315 смарт: Фролов 21.02.2023
    КонецЕсли;
    //-- смарт:Подкин #914 01.03.2022 12:57:16   
    
    //++ смарт:Подкин #1038 27.05.2022 16:21:45
     Если ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
        ЭтотОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();  
		//++ #1315 смарт: Фролов 07.03.2023 //Ошибка заполнения р/с организации при копировании Заказа клиента
		//ЭтотОбъект.БанковскийСчет=Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		//-- #1315 смарт: Фролов 07.03.2023
    КонецЕсли;
    //-- смарт:Подкин #1038 27.05.2022 16:21:45 
		
	//++#895 смарт: Демичев 26012023((
	ПризнакПрослеживаемости = Ложь;
	
	Для каждого Строка Из ЭтотОбъект.Товары Цикл		
		
		ПризнакПрослеживаемости = Строка.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар;		
		
		Если ПризнакПрослеживаемости Тогда			
			Прервать;				
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПризнакПрослеживаемости Тогда
		
		 ТекстСообщения =  "ВНИМАНИЕ! В документе есть ""Прослеживаемый товар"", при продаже таких товаров, отгрузочные документы УПД должны обязательно подписываться через ЭДО." + Символы.ПС +
        " Пожалуйста предупредите клиента и согласуйте заранее возможность подписания документов через любого оператора ЭДО";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"Объект.Товары",,);
		
		КонецЕсли;
	
	//--#895 смарт: Демичев 26012023))

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Каратеев +
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		МассивНепроверяемыхРеквизитов = Новый Массив;
		
		НоменклатураСервер.РасшСмарт_ПроверитьЗаполнениеРекламноеВоздействие(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ); 
		//++ #1338 смарт: Фролов 10.04.2023 //Мелкие доработки  
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаЗакрытия) ТОгда
			НоменклатураСервер.смарт_ПроверитьЗаполнениесмартКтоПередал(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);
			//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
			НоменклатураСервер.смарт_ПроверитьЗаполнениесмартКтоПередал(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, , "смартКтоКонсультировал");
			//-- #1936 смарт: Шляпников 20.01.2025
		КонецЕсли;	
		//-- #1338 смарт: Фролов 10.04.2023
	КонецЕсли;
	//Каратеев -
	// Фролов+
	Если Не СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз")
		//смарт:rnp 566 08.07.2021
		И Не СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал") Тогда
		//
		ПроверяемыеРеквизиты.Добавить("КонтактноеЛицо");
		ПроверяемыеРеквизиты.Добавить("смартТелефонКонтактногоЛица");
		ПроверяемыеРеквизиты.Добавить("СпособДоставкиТовара");     
		ПроверяемыеРеквизиты.Добавить("ПлатильщикЗаДоставкуГруза");
		//ПроверяемыеРеквизиты.Добавить("ДатаДоставки");
	КонецЕсли;
	
    смартПроверитьЗаполнениеСтатьиДДС(Отказ);
    // Фролов-
	
	//++ #Б4284 смарт: Шляпников 05.09.2025 / Документ Заказ клиента. Способы доставки. Дополнения
	Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал") Тогда
		
		ЕстьТоварыКОтгрузке = Ложь;
		Для каждого стрТовары Из Товары Цикл
			
			Если стрТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить
				ИЛИ стрТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда
				
				ЕстьТоварыКОтгрузке = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьТоварыКОтгрузке Тогда

			ПроверяемыеРеквизиты.Добавить("смартВидТранспорта");
			ПроверяемыеРеквизиты.Добавить("смартНомерМашины");
			ПроверяемыеРеквизиты.Добавить("смартФИОВодителя");     
			ПроверяемыеРеквизиты.Добавить("смартНомерСерияПаспортВодителя");
			ПроверяемыеРеквизиты.Добавить("смартДатаВыдачиПаспортаВодителя");
			ПроверяемыеРеквизиты.Добавить("смартЖелаемоеВремяОтгрузки");
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4284 смарт: Шляпников 05.09.2025
    
    //++ смарт:Подкин #914 15.03.2022 20:14:33
    ЗаказСОграничением=Ложь;
    Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда 
        ЗаказСОграничением = смартОбщегоНазначения.смартПроверкаОтгруженногоОплаченного(ЭтотОбъект.Ссылка); 
    Иначе
        ЗаказСОграничением=Истина;
    КонецЕсли;
    
    Если ЗаказСОграничением Тогда
        //++ смарт:Подкин #914 02.03.2022 16:50:38 Проверка заполения вида цены
        Если НЕ РольДоступна("ПолныеПрава")  Тогда //15.03.22 в 19.30 убрал, т.к. добавил проверку Оплачен/Отгружен И НЕ РольДоступна("ДобавлениеИзменениеРеализацийТоваровУслуг")
            ПроверяемыеРеквизиты.Добавить("Товары.ВидЦены");
        КонецЕсли;  
        
        //++ смарт:Подкин #916 17.03.2022 9:06:15 временно 
        Если Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда 
            ПродажиСервер.ПроверитьЗапретОтгрузки(Партнер, Отказ); 
        КонецЕсли;
        //-- смарт:Подкин #916 17.03.2022 9:06:15     
        
    КонецЕсли;
    //-- смарт:Подкин #914 02.03.2022 16:50:38
	
	//++ #Б4036 смарт: Шляпников 14.08.2025 / Оприходование з/ч без документов основания в 1С УТ РФ
	Если НЕ Отказ Тогда
		Для каждого стрТовары Из Товары Цикл
			Если НЕ смартСервер.ПроверитьДоступностьНоменклатурыКПродажеИЗакупке(стрТовары.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Номенклатура %1 недоступна для продажи и закупки", стрТовары.Номенклатура),,,, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-- #Б4036 смарт: Шляпников 14.08.2025
	
КонецПроцедуры

//++ смарт: Белоусова #465 23.03.2021
Функция ПолучитьСписокПодчиненныхДокументов(СсылкаНаДокумент)
    
    ТаблицаСвязанныхДокументов = Новый ТаблицаЗначений;
    ТаблицаСвязанныхДокументов.Колонки.Добавить("Ссылка");
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    СвязанныеДокументы.Ссылка
    |ИЗ
    |    КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
    
    //Для Каждого СтрокаТаблицы Из ТаблицаСвязанныхДокументов Цикл
        
        Если Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(Ссылка))  Тогда
            
            Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", Ссылка);
            ТаблицаСвязанныхДокументовВременная = Запрос.Выполнить().Выгрузить();
            
            Для Каждого ЭлементКоллекции Из ТаблицаСвязанныхДокументовВременная Цикл
                РезультатПоиска = ТаблицаСвязанныхДокументов.Найти(ЭлементКоллекции.Ссылка);
				Если РезультатПоиска = НеОпределено Тогда
					если ТипЗнч(ЭлементКоллекции.Ссылка)= тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ  ТипЗнч(ЭлементКоллекции.Ссылка)= тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") ИЛИ ТипЗнч(ЭлементКоллекции.Ссылка)= тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
	                    НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
	                    НоваяСтрока.Ссылка = ЭлементКоллекции.Ссылка;
					КонецЕсли;
                КонецЕсли;
            КонецЦикла;
        КонецЕсли;
   // КонецЦикла;
        
    Возврат ТаблицаСвязанныхДокументов ;
        
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьДокументНаОснованииКоммерческогоПредложенияКлиенту")
Процедура смарт_ЗаполнитьДокументНаОснованииКоммерческогоПредложенияКлиенту(Знач Основание)

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка КАК ДокументОснование,
	|	КоммерческоеПредложениеКлиенту.Клиент КАК Партнер,
	|	КоммерческоеПредложениеКлиенту.Контрагент КАК Контрагент,
	|	КоммерческоеПредложениеКлиенту.КонтактноеЛицо КАК КонтактноеЛицо,
	|	КоммерческоеПредложениеКлиенту.Сделка КАК Сделка,
	|	КоммерческоеПредложениеКлиенту.Валюта КАК Валюта,
	|	КоммерческоеПредложениеКлиенту.СуммаДокумента КАК СуммаДокумента,
	|	КоммерческоеПредложениеКлиенту.Организация КАК Организация,
	|	КоммерческоеПредложениеКлиенту.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	КоммерческоеПредложениеКлиенту.Налогообложение КАК НалогообложениеНДС,
	|	КоммерческоеПредложениеКлиенту.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	КоммерческоеПредложениеКлиенту.Статус КАК СтатусДокумента,
	|	КоммерческоеПредложениеКлиенту.КартаЛояльности КАК КартаЛояльности,
	|	НЕ КоммерческоеПредложениеКлиенту.Проведен       КАК ЕстьОшибкиПроведен,
	|	ВЫБОР
	|		КОГДА КоммерческоеПредложениеКлиенту.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКоммерческихПредложенийКлиентам.Действует)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиСтатус
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
	|ГДЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КоммерческоеПредложениеКлиентуТовары.НомерСтроки КАК НомерСтроки,
	|	КоммерческоеПредложениеКлиентуТовары.КлючСвязи КАК КлючСвязи,
	|	КоммерческоеПредложениеКлиентуТовары.Номенклатура КАК Номенклатура,
	|	КоммерческоеПредложениеКлиентуТовары.Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатурыПолное,
	|	КоммерческоеПредложениеКлиентуТовары.Характеристика КАК Характеристика,
	|	КоммерческоеПредложениеКлиентуТовары.Характеристика.НаименованиеПолное КАК НаименованиеХарактеристикиПолное,
	|	КоммерческоеПредложениеКлиентуТовары.Номенклатура.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
	|	КоммерческоеПредложениеКлиентуТовары.ЕдиницаИзмерения КАК Упаковка,
	|	КоммерческоеПредложениеКлиентуТовары.Количество КАК КоличествоУпаковок,
	|	КоммерческоеПредложениеКлиентуТовары.Количество * ВЫБОР
	|		КОГДА КоммерческоеПредложениеКлиентуТовары.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|	КОНЕЦ КАК Количество,
	|	КоммерческоеПредложениеКлиентуТовары.ВидЦены КАК ВидЦены,
	|	КоммерческоеПредложениеКлиентуТовары.Цена КАК Цена,
	|	КоммерческоеПредложениеКлиентуТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	КоммерческоеПредложениеКлиентуТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	КоммерческоеПредложениеКлиентуТовары.СтавкаНДС КАК СтавкаНДС,
	|	КоммерческоеПредложениеКлиентуТовары.СуммаНДС КАК СуммаНДС,
	|	КоммерческоеПредложениеКлиентуТовары.СуммаСНДС КАК СуммаСНДС,
	|	КоммерческоеПредложениеКлиентуТовары.Сумма КАК Сумма,
	|	КоммерческоеПредложениеКлиентуТовары.НоменклатураНабора   КАК НоменклатураНабора,
	|	КоммерческоеПредложениеКлиентуТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ВЫБОР
	|		КОГДА КоммерческоеПредложениеКлиентуТовары.Ссылка.ВариантУказанияСрокаПоставки = 1
	|			ТОГДА КоммерческоеПредложениеКлиентуТовары.СрокПоставки
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВЫРАЗИТЬ(КоммерческоеПредложениеКлиентуТовары.СрокПоставки КАК ДАТА), &ТекущаяДата, ДЕНЬ)
	|	КОНЕЦ КАК СрокПоставки
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуТовары
	|ГДЕ
	|	КоммерческоеПредложениеКлиентуТовары.Ссылка = &Основание
	// +CRM
	|	И КоммерческоеПредложениеКлиентуТовары.CRM_Утвержден
	|	И НЕ КоммерческоеПредложениеКлиентуТовары.CRM_ЭтоРазделитель
	// -CRM
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КоммерческоеПредложениеКлиентуСкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	КоммерческоеПредложениеКлиентуСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	КоммерческоеПредложениеКлиентуСкидкиНаценки.Сумма КАК Сумма
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту.СкидкиНаценки КАК КоммерческоеПредложениеКлиентуСкидкиНаценки
	|ГДЕ
	|	КоммерческоеПредложениеКлиентуСкидкиНаценки.Ссылка = &Основание";

	Запрос.УстановитьПараметр("Основание",Основание);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"КоммерческоеПредложениеКлиентуТовары.ЕдиницаИзмерения",
	"КоммерческоеПредложениеКлиентуТовары.Номенклатура"));

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаШапка.Следующий();

	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует);

	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
	ВыборкаШапка.ДокументОснование,
	ВыборкаШапка.СтатусДокумента,
	ВыборкаШапка.ЕстьОшибкиПроведен,
	ВыборкаШапка.ЕстьОшибкиСтатус,
	МассивДопустимыхСтатусов);

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	НалогообложениеНДС = КоммерческиеПредложенияДокументыКлиентСерверУТ.НалогообложениеНДСПоНалогообложениюКоммерческихПредложений(ВыборкаШапка.НалогообложениеНДС);
	ХозяйственнаяОперация = 
	КоммерческиеПредложенияДокументыКлиентСерверУТ.ХозяйственнаяОперацияДокументаКоммерческоеПредложениеКлиенту(ВыборкаШапка.ХозяйственнаяОперация);

	ДатаНачала = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда

		ЗаполнитьСоглашениеПоСтатистике(ЭтотОбъект);
		Если Не ЗначениеЗаполнено(Соглашение) Тогда

			ПараметрыОтбора = Новый Структура;
			МассивОпераций = Новый Массив;
			МассивОпераций.Добавить(ХозяйственнаяОперация);
			ПараметрыОтбора.Вставить("ХозяйственныеОперации",             МассивОпераций);
			ПараметрыОтбора.Вставить("ИспользоватьПервоеУдовлетворяющее", Истина);
			УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(Партнер, ПараметрыОтбора);

			Если ТипЗнч(УсловияПродажПоУмолчанию) = Тип("Структура")
				И УсловияПродажПоУмолчанию.Свойство("Соглашение") Тогда
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
			КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(Соглашение) Тогда
			УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина);
			ГрафикОплаты = УсловияПродаж.ГрафикОплаты;
		КонецЕсли;

	КонецЕсли;

	ТаблицаТовары = РезультатЗапроса[1].Выгрузить();
	ТаблицаТовары.Сортировать("НомерСтроки Возр");

	Для Каждого ТекСтрока Из ТаблицаТовары Цикл

		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		#Вставка
		//++ #Б6514 смарт: Шляпников 16.04.2026 / Ошибка. Из КП при формировании Заказа клиента не подставляется номенклатура.
		Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.смартКонструкторОборудования") Тогда
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура.Номенклатура;
		КонецЕсли;
		//-- #Б6514 смарт: Шляпников 16.04.2026
		#КонецВставки

		Если ТекСтрока.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.АктВыполненныхРабот Тогда
			НоваяСтрока.Содержание = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ТекСтрока.НаименованиеНоменклатурыПолное, 
			ТекСтрока.НаименованиеХарактеристикиПолное);

		КонецЕсли;

	КонецЦикла;

	СоответствиеСтрокиДляУдаления = Новый Соответствие;

	Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперация, Валюта);

	ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчет, БанковскийСчетКонтрагента);

	Если ЗначениеЗаполнено(Договор) Тогда
		ГруппаФинансовогоУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ГруппаФинансовогоУчета");
	КонецЕсли;

	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", Новый СписокЗначений);

	СкидкиНаценки.Загрузить(РезультатЗапроса[2].Выгрузить());
	СкидкиНаценкиСервер.РассчитатьПоЗаказуКлиента(ЭтотОбъект, СтруктураПараметры);
	СкидкиРассчитаны = Истина;

	СуммаЗаказанныхСтрок = ПолучитьСуммуЗаказанныхСтрок();
	СуммаЗалоговойТары = ПолучитьСуммуЗаказанныхСтрок(Истина);

	Если ЗначениеЗаполнено(ГрафикОплаты) Тогда
		ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажиПоГрафикуОплаты(
		ЭтотОбъект,
		СуммаЗаказанныхСтрок - СуммаЗалоговойТары,
		СуммаЗалоговойТары,
		Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Богус++
Функция ПроверитьСтатус() 
	
	Если ЭтоНовый() И Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции
// Богус--

// Каратеев +
Процедура демоДемонстрацияОборудованияЗапись()
	
	// регистр демоДемонстрацияОборудования Приход
	Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		Движения.демоДемонстрацияОборудования.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.демоДемонстрацияОборудования.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Партнер = Партнер;
			Движение.Менеджер = Менеджер;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.КодСтроки = ТекСтрокаТовары.НомерСтроки;
			Движение.Распоряжение = Ссылка;
			Движение.КоличествоДемонстрация = ТекСтрокаТовары.Количество;
			Движение.Вознаграждение = ПересчитатьСуммуВЕвро(ЭтотОбъект, ТекСтрокаТовары);
		КонецЦикла
	Иначе
		демоДемонстрацияОборудованияУдаление();
	КонецЕсли;
	
КонецПроцедуры

Процедура демоДемонстрацияОборудованияУдаление()
	
	НаборЗаписей = РегистрыНакопления.демоДемонстрацияОборудования.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПересчитатьСуммуВЕвро(ТекОбъект, СтрокаТоваров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СуммыПоЗаказам.СуммаУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(СуммыПоЗаказам.Сумма / СуммыПоЗаказам.СуммаУпр, СуммыПоЗаказам.Курс)
		|	КОНЕЦ КАК СреднийКурс,
		|	КурсыВалют.Курс КАК КурсНаДеньЗаказа,
		|	СуммыПоЗаказам.СуммаУпр КАК ОплаченоЕвро
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
		|		ПО КурсыВалют.Валюта = ВалютаУправленческогоУчета.Значение
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВЫРАЗИТЬ(ПоступленияДС.Сумма / КурсыВалют.Курс КАК ЧИСЛО(15, 2))) КАК СуммаУпр,
		|			СУММА(ПоступленияДС.Сумма) КАК Сумма,
		|			СУММА(КурсыВалют.Курс) КАК Курс,
		|			КурсыВалют.Валюта КАК Валюта
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ДенежныеСредстваБезналичные.Период КАК Период,
		|				ДенежныеСредстваБезналичные.Заказ КАК Заказ,
		|				ДенежныеСредстваБезналичные.СуммаРегл КАК Сумма
		|			ИЗ
		|				РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредстваБезналичные
		|			ГДЕ
		|				ДенежныеСредстваБезналичные.Заказ = &ЗаказКлиента
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ДенежныеСредстваНаличные.Период,
		|				ДенежныеСредстваНаличные.Заказ,
		|				ДенежныеСредстваНаличные.СуммаРегл
		|			ИЗ
		|				РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредстваНаличные
		|			ГДЕ
		|				ДенежныеСредстваНаличные.Заказ = &ЗаказКлиента) КАК ПоступленияДС
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
		|					ПО КурсыВалют.Валюта = ВалютаУправленческогоУчета.Значение
		|				ПО (НАЧАЛОПЕРИОДА(ПоступленияДС.Период, ДЕНЬ) = КурсыВалют.Период)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КурсыВалют.Валюта) КАК СуммыПоЗаказам
		|		ПО КурсыВалют.Валюта = СуммыПоЗаказам.Валюта
		|ГДЕ
		|	КурсыВалют.Период = НАЧАЛОПЕРИОДА(&ДатаЗаказа, ДЕНЬ)";

	Запрос.УстановитьПараметр("ЗаказКлиента", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЗаказа", ЭтотОбъект.Ссылка.Дата);

		
	Если ТекОбъект.Валюта = Справочники.Валюты.НайтиПоКоду("978") Тогда
		СуммаВознаграждения = СтрокаТоваров.Сумма;
	Иначе
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат ОписаниеОшибки();
		КонецЕсли;	
		Результат = РезультатЗапроса.Выбрать();
		
		Результат.Следующий();
		СреднийКурс = Результат.СреднийКурс;
		КурсНаДеньЗаказа = Результат.КурсНаДеньЗаказа;
		ОплаченоЕвро = Результат.ОплаченоЕвро;
		
		СуммаВознаграждения = ОплаченоЕвро;
	КонецЕсли;
	
	Возврат СуммаВознаграждения;
	
КонецФункции
// Каратеев-

// ЯшниковДА 20180404 +++
 // Процедура проверяет корректность заполнения реквизитов контрагента
 // Добавлено по заданию от бухгалтерии для корректного выставления платежных документов
 //
 // Проверяемые реквизиты:
 //
 // ФизЛицо - Не проверяем.
 // ЮрЛицо - ИНН/КПП/ЮрАдрес.
 // Нерезидент - ЮрАдрес;
 // Индивидуальный предприниматель- ИНН
Процедура ПроверитьКорректностьЗаполненияКонтрагента(Отказ)
	
	ТекстСообщения = "";
		
	// Кэшируемые значения
	КонтрагентСсылка = Контрагент;
	КонтрагентИНН    = КонтрагентСсылка.ИНН;
	КонтрагентКПП	 = КонтрагентСсылка.КПП;
	СтрокаЮрАдрес    = КонтрагентСсылка.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, "Вид");
	
	// Определяем вид контрагента и вспомогательные переменные для проверки реквизитов.	
	ЭтоЮрЛицо = (КонтрагентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	ЭтоФизЛицо = (КонтрагентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо);
	ЭтоНерезидент = (КонтрагентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент);
	ЭтоИндивидуальныйПредпрениматель = (КонтрагентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель);			
	ВидДляПроверкиТребованийИНН = ОбщегоНазначенияУТКлиентСервер.ЭтоЮрЛицо(КонтрагентСсылка.ЮрФизЛицо);
	
	// Переменные значения
	ИННЗаполненКорректно     = Истина;
	КППЗаполненКорректно     = Истина;
	ЮрАдресЗаполненКорректно = Истина;
	
	// Выполнить проверки
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если ЭтоФизЛицо Тогда
		
		// Ничего не проверяем
		
	ИначеЕсли ЭтоЮрЛицо Тогда
		
		// ИНН
		Если ПустаяСтрока(КонтрагентИНН)
			Или Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(КонтрагентИНН, ВидДляПроверкиТребованийИНН, ТекстСообщения) Тогда
				ИННЗаполненКорректно = Ложь;
		КонецЕсли;
		// КПП
		Если ПустаяСтрока(КонтрагентКПП) Тогда
			КППЗаполненКорректно = Ложь;
		КонецЕсли;
		// ЮрАдрес
		Если СтрокаЮрАдрес = Неопределено Тогда
			ЮрАдресЗаполненКорректно = Ложь;
		ИначеЕсли СтрокаЮрАдрес <> Неопределено
			И ПустаяСтрока(СтрокаЮрАдрес.Представление) Тогда
			ЮрАдресЗаполненКорректно = Ложь;
		КонецЕсли;
		
	ИначеЕсли ЭтоНерезидент Тогда
		
		// ЮрАдрес
		Если СтрокаЮрАдрес = Неопределено Тогда
			ЮрАдресЗаполненКорректно = Ложь;
		ИначеЕсли СтрокаЮрАдрес <> Неопределено
			И ПустаяСтрока(СтрокаЮрАдрес.Представление) Тогда
			ЮрАдресЗаполненКорректно = Ложь;
		КонецЕсли;

	ИначеЕсли ЭтоИндивидуальныйПредпрениматель Тогда
		
		// ИНН
		Если ПустаяСтрока(КонтрагентИНН)
			Или Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(КонтрагентИНН, ВидДляПроверкиТребованийИНН, ТекстСообщения) Тогда
				ИННЗаполненКорректно = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Сформировать выводы на основании проверок и сообщить ошибки пользователю
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если Не ИННЗаполненКорректно Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = "Неверный ИНН контрагента";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"Объект.Контрагент",,);
			
	КонецЕсли;
			
	Если Не КППЗаполненКорректно Тогда
		
		Отказ = Истина;
				
		ТекстСообщения = НСтр("ru = 'Неверный КПП контрагента'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,,
		"Объект.Контрагент",,);
	
	КонецЕсли;
	
	Если Не ЮрАдресЗаполненКорректно Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = "Неверный юр. адрес контрагента";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"Объект.Контрагент",,);
		
	КонецЕсли;
		
КонецПроцедуры
// ЯшниковДА 20180404 ---

// Фролов+
Процедура ПроверитьКонтрагентаПоРискам(Отказ,РежимЗаписи)
	
    //++ смарт: Белоусова 577 11.08.2021
    Если Контрагент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
        //-- смарт: Белоусова 577 11.08.2021	
        
        //++ смарт:ММ #067 348 03.09.2020 - Исправление ошибки проверки ОП в СПАРК риски
        //ИндексыРисков=СПАРКРиски.ИндексыСПАРККонтрагента(Ссылка.Контрагент);
        
        //++ смарт: Белоусова 577 11.08.2021
        //Если Контрагент <> Ссылка.Контрагент Тогда
            КонтрагентДляПроверки = Контрагент;
            Если Контрагент.ОбособленноеПодразделение Тогда
                
                ГоловнойКонтрагент = Контрагент.ГоловнойКонтрагент;
                
                Если НЕ ГоловнойКонтрагент.смартНеПроверятьРиски
                    И ГоловнойКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
                    КонтрагентДляПроверки = ГоловнойКонтрагент;
                //Иначе
                //    ВыполнятьПроверку = Ложь;
                КонецЕсли;
                
            КонецЕсли;
        //Иначе
        //    КонтрагентДляПроверки = ссылка.Контрагент;
        //    Если Ссылка.Контрагент.ОбособленноеПодразделение Тогда
        //        
        //        ГоловнойКонтрагент = Ссылка.Контрагент.ГоловнойКонтрагент;
        //        
        //        Если НЕ ГоловнойКонтрагент.смартНеПроверятьРиски
        //            И ГоловнойКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
        //            КонтрагентДляПроверки = ГоловнойКонтрагент;
        //        Иначе
        //            ВыполнятьПроверку = Ложь;
        //        КонецЕсли;
        //        
        //    КонецЕсли;
        //    
        //КонецЕсли;
        //-- смарт: Белоусова 577 11.08.2021
        
        //ВыполнятьПроверку = Истина;
        //
        //
        //Если ВыполнятьПроверку Тогда
            
            //ВидКонтрагента из регистра СвойстваКонтрагентовСПАРКРиски
            ВидКонтрагентаДляПроверки = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентовСПАРКРиски.ЮридическоеЛицо"); //по умолчанию
            
            Запрос = Новый Запрос;
            Запрос.УстановитьПараметр("Контрагент", КонтрагентДляПроверки);
            Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
            |	СвойстваКонтрагентовСПАРКРиски.ВидКонтрагента КАК ВидКонтрагента
            |ИЗ
            |	РегистрСведений.СвойстваКонтрагентовСПАРКРиски КАК СвойстваКонтрагентовСПАРКРиски
            |ГДЕ
            |	СвойстваКонтрагентовСПАРКРиски.Контрагент = &Контрагент
            |";       
            
            Результат = Запрос.Выполнить();
            Если НЕ Результат.Пустой() тогда
                Выборка = Результат.Выбрать();
                Выборка.Следующий();
                
                ВидКонтрагентаДляПроверки = Выборка.ВидКонтрагента;
            КонецЕсли;
            
            ИндексыРисков = СПАРКРиски.ИндексыСПАРККонтрагента(КонтрагентДляПроверки, ВидКонтрагентаДляПроверки);
            //-- смарт:ММ 03.09.2020                 
            
            //++ смарт:Подкин #927 08.04.2022 9:45:07
            Если ИндексыРисков.Критичное Тогда 
                Текст=НСтр("ru='Документ не может быть проведен!
                |У контрагента статус риска: "+ИндексыРисков.СтатусНазвание+". Документ не записан.'");
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
             //-- смарт:Подкин #927 08.04.2022 9:45:07  
             
            ИначеЕсли ИндексыРисков.СводныйИндикатор=0 Тогда
                Текст=НСтр("ru='Документ не может быть проведен!
                |У контрагенты необходимо перезаполнить реквизиты по данным ИФНС
                |Документ не записан.'");
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
                //РежимЗаписи=РежимЗаписиДокумента.Запись;
            ИначеЕсли  ИндексыРисков.СводныйИндикаторГрадация=ПредопределенноеЗначение("Перечисление.ГрадацияИндексовСПАРКРиски.Высокий") Тогда 
                Текст=НСтр("ru = 'Документ не может быть проведен!
                |У контрагента высокая степень риска.
                |Документ не записан.'");
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
                //РежимЗаписи=РежимЗаписиДокумента.Запись;
            КонецЕсли;
            
            //++ смарт:ММ #067 348 03.09.2020 - Исправление ошибки проверки ОП в СПАРК риски
        //КонецЕсли;
        //-- смарт:ММ 03.09.2020
        
    КонецЕсли;
    
КонецПроцедуры  // Фролов-

// Фролов+
Процедура ВыполнитьДвиженияПоРаботамСервисногоЦентра(Отказ,РежимПроведения,ДатаВнедренияФункционала)	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.ВидыНоменклатуры.ПолучитьВидыНоменклатурыСЦ());
	Запрос.УстановитьПараметр("ДатаВнедрения",ДатаВнедренияФункционала);
	Запрос.Текст="
	             |ВЫБРАТЬ
	             |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	             |	Таблица.Ссылка.Дата КАК Период,
	             |	Таблица.Ссылка КАК Регистратор,
	             |	Таблица.Ссылка КАК Заказ,
	             |	Таблица.Ссылка.ДатаЗакрытия КАК ДатаЗакрытия,
	             |	Таблица.Ссылка.смартИсполнительРаботПоЗаказу КАК Инженер,
	             |	Таблица.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт) КАК ЗаказЗакрыт,
	             |	Таблица.Номенклатура КАК Номенклатура,
	             |	Таблица.КоличествоУпаковок КАК Количество,
	             |	Таблица.СуммаСНДС КАК Сумма,
	             |	Таблица.Ссылка.Валюта КАК Валюта
	             |ИЗ
	             |	Документ.ЗаказКлиента.Товары КАК Таблица
	             |ГДЕ
	             |	Таблица.Ссылка = &Ссылка
				 |  И Таблица.Ссылка.Дата >= &ДатаВнедрения
	             |	И Таблица.Номенклатура.ВидНоменклатуры В(&ВидНоменклатуры)
	             |	И Таблица.Ссылка.смартЗаявкаВыполненаПоАкту
	             |	И НЕ Таблица.Отменено";
	
	Движение=Движения.смартРаботыСервисногоЦентра;
	Движение.Записывать=Истина;
	Движение.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры // Фролов-	

// Фролов+
Процедура смартПроверитьЗаполнениеСтатьиДДС(Отказ)
	Если ЗначениеЗаполнено(Соглашение) Тогда 
		Если Не ЗначениеЗаполнено(Соглашение.СтатьяДвиженияДенежныхСредств) Тогда 
			ТекстОшибки = НСтр("ru='В Соглашении не заполнена Статья ДДС.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Соглашение",
				,
				Отказ);
		КонецЕсли;
		Если ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов")
			И Не ЗначениеЗаполнено(Договор.СтатьяДвиженияденежныхСредств) Тогда 
			
			ТекстОшибки = НСтр("ru='В Договоре не заполнена Статья ДДС.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Договор",
				,
				Отказ);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // Фролов-	

// Фролов+
Функция ПолучитьПроцентОтгрузки()
	Запрос=Новый Запрос("ВЫБРАТЬ ПроцентОтгрузки ИЗ РегистрСведений.СостоянияЗаказовКлиентов ГДЕ Заказ=&Заказ");
	Запрос.УстановитьПараметр("Заказ",Ссылка);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Возврат Рез.ПроцентОтгрузки;
	КонецЕсли;	
	Возврат 0;
КонецФункции // Фролов-	

//++ смарт:Подкин #1009 28.04.2022 10:43:20
&Перед("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	//++ #5098 смарт: Тимофеева 01.12.2025 / Срочно! Проверить отработку процедуры ограничение продаж по номенклатуре
	// Если НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРазрешитьПродажуНоменклатурыБольшеОграничения") 
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартРазрешитьПродажуНоменклатурыБольшеОграничения")) 
	//-- #5098 смарт: Тимофеева 01.12.2025
        И НЕ Справочники.смартПредопределенныеЗначения.ПроверятьОграниченияПродажиОпределеннойНоменклатурыЗаПериод.Значение=Неопределено 
        И Справочники.смартПредопределенныеЗначения.ПроверятьОграниченияПродажиОпределеннойНоменклатурыЗаПериод.Значение 
        И НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект.ДополнительныеСвойства,"РазрешатьПроведение") Тогда
		ВхождениеВОграничения=смартПроведениеОбходОграниченияНоменклатуры(); 
        Если НЕ ВхождениеВОграничения=Неопределено Тогда
            ТЗНоменклатураСограничением=смартИнтернетМагазин.ПреобразоватьМассивВТаблицуЗначений(ВхождениеВОграничения);
            ТЗПерерасход=смартПроверкаОграниченияПоРегистрам(ТЗНоменклатураСограничением);
            Если НЕ ТЗПерерасход=Неопределено Тогда
                ОбщегоНазначения.СообщитьПользователю("Проведение документа-отказ! Возможно только записать. Если нужно исправить проведенный документ, предварительно отмените проведение!",,,,Истина);
                СтрокаСообщения="";
                Для каждого СтрТовар Из Товары Цикл 
                    Для каждого Стр Из ТЗПерерасход Цикл 
                        Если СтрТовар.Номенклатура=Стр.НоменклатураРасход Тогда 
                            СтрокаСообщения=СтрокаСообщения + "Превышен недельный лимит по номенклатуре(строка № "+СтрТовар.НомерСтроки+")- "+Стр.НоменклатураРасход+" "+Символы.ПС;
                            ОбщегоНазначения.СообщитьПользователю("Данному клиенту, на этой неделе, уже производились продажи номенклатуры(строка № "+СтрТовар.НомерСтроки+")- "+Стр.НоменклатураРасход+ ", попадающей под ограничение продажи, не более "+Стр.Количество+" единиц.",,"Товары["+(СтрТовар.НомерСтроки-1)+"].КоличествоУпаковок",,Истина);
                        КонецЕсли;
                    КонецЦикла;
                КонецЦикла;  
                ВызватьИсключение НСтр("ru='"+СтрокаСообщения+"'");
                //Отказ=Истина;  
            КонецЕсли;
        КонецЕсли; 
	КонецЕсли;
	
    //++ #Б-1910 смарт: Лопато 20.01.2025 //Ошибка оформления документов УПД и РО по Заказу клиента  
	смартОбщегоНазначения.ПроверитьКоличествоУпаковокВТЧТовары(Ссылка, Товары, Отказ);
	//-- #Б-1910 смарт: Лопато 20.01.2025
	
КонецПроцедуры//-- смарт:Подкин #1009 28.04.2022 10:43:20

//++ смарт:Подкин #1009 29.04.2022 12:26:15
&НаСервере
Функция смартПроведениеОбходОграниченияНоменклатуры(Разница=Неопределено, ПроверятьКоличество=Ложь) Экспорт 
    
    Если Разница=Неопределено Тогда
        ТЗТовары=Товары.Выгрузить(,"Номенклатура,Количество"); 
    Иначе	
        ТЗТовары=Разница;
    КонецЕсли;       
	//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок	
	Если Партнер.Дилер ИЛИ Партнер.смартДилерБывший ИЛИ Партнер.Перепродавец 
		ИЛИ Контрагент.Партнер.Дилер ИЛИ Контрагент.Партнер.смартДилерБывший ИЛИ Контрагент.Партнер.Перепродавец Тогда
		ЭтоДилер=Истина;
	Иначе
		ЭтоДилер=Ложь;	
	КонецЕсли;	
	//-- #1319 смарт: Фролов 28.02.2023
    ТЗТовары.Свернуть("Номенклатура","Количество");
    МассивНом=ТЗТовары.ВыгрузитьКолонку("Номенклатура");    
    ТЗТовары.Колонки.Добавить("Использовано", Новый ОписаниеТипов("Булево"));
	
	//++#1312 смарт: Лопато 15.02.2023 //Убрать ограничение продажи на уцененный товар (продолжение задачи 1009)  
    Для каждого СтрНоменклатуры Из ТЗТовары Цикл
		Если СтрНайти(НРег(СокрЛП(СтрНоменклатуры.Номенклатура)), "уцен") <> 0 Тогда 
			СтрНоменклатуры.Использовано = Истина;
		КонецЕсли;	
	КонецЦикла;
	//--#1312 смарт: Лопато 15.02.2023
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура КАК Номенклатура,
	//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок  
	|	смартОграничениеПродажиНоменклатурыПоКоличеству.КвотаДляДилера КАК КвотаДляДилера,
 	|	смартОграничениеПродажиНоменклатурыПоКоличеству.ИспользоватьКвотуДляДилера КАК ИспользоватьКвотуДляДилера,
    //-- #1319 смарт: Фролов 28.02.2023
	|	смартОграничениеПродажиНоменклатурыПоКоличеству.Количество КАК Количество,
    |	смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура.ЭтоГруппа КАК ЭтоГруппа
    |ИЗ
    |	РегистрСведений.смартОграничениеПродажиНоменклатурыПоКоличеству КАК смартОграничениеПродажиНоменклатурыПоКоличеству
    |ГДЕ
    |	НЕ смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура.ЭтоГруппа
    |	И смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура в (&Номенклатура)";
    
    Запрос.УстановитьПараметр("Номенклатура",МассивНом); 
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    СтруктураОграничения=Неопределено; 
    МассивПроверки=Новый Массив;
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
        Для каждого СтрНоменклатуры Из ТЗТовары Цикл
            Если НЕ СтрНоменклатуры.Использовано И СтрНоменклатуры.Номенклатура=ВыборкаДетальныеЗаписи.Номенклатура Тогда 
				//++ #1319 смарт: Фролов 1.03.2023 //Ограничение количества продаж и отмена скидок
				//Если ПроверятьКоличество И СтрНоменклатуры.Количество>ВыборкаДетальныеЗаписи.Количество Тогда
				Если ПроверятьКоличество И СтрНоменклатуры.Количество>?(ЭтоДилер И ВыборкаДетальныеЗаписи.ИспользоватьКвотуДляДилера,Цел(ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КвотаДляДилера/100),ВыборкаДетальныеЗаписи.Количество) Тогда	
				//-- #1319 смарт: Фролов 1.03.2023
                   СтруктураОграничения=Новый Структура;
                    СтруктураОграничения.Вставить("Номенклатура",СтрНоменклатуры.Номенклатура); 
					//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок
					Если ЭтоДилер И ВыборкаДетальныеЗаписи.ИспользоватьКвотуДляДилера Тогда
						СтруктураОграничения.Вставить("Количество",Цел(ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КвотаДляДилера/100));	
					Иначе	
                    	СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
					КонецЕсли;
					//СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
					//-- #1319 смарт: Фролов 28.02.2023
                    СтруктураОграничения.Вставить("КоличествоВДокументе",СтрНоменклатуры.Количество); 
                    МассивПроверки.Добавить(СтруктураОграничения); 
                ИначеЕсли НЕ ПроверятьКоличество Тогда
                    СтруктураОграничения=Новый Структура;
                    СтруктураОграничения.Вставить("Номенклатура",СтрНоменклатуры.Номенклатура);
					//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок
					Если ЭтоДилер И ВыборкаДетальныеЗаписи.ИспользоватьКвотуДляДилера Тогда
						СтруктураОграничения.Вставить("Количество",Цел(ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КвотаДляДилера/100));	
					Иначе	
                    	СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
					КонецЕсли;
					//СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
					//-- #1319 смарт: Фролов 28.02.2023
                    СтруктураОграничения.Вставить("КоличествоВДокументе",СтрНоменклатуры.Количество); 
                    МассивПроверки.Добавить(СтруктураОграничения); 
                КонецЕсли;
                СтрНоменклатуры.Использовано=Истина;
                Продолжить;
            КонецЕсли; 
        КонецЦикла;
    КонецЦикла;             
    
    МассивНеИспользованныхЭл=ТЗТовары.НайтиСтроки(Новый Структура("Использовано",Ложь)); 
    Если МассивНеИспользованныхЭл.Количество()>0 Тогда
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура,
		//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок  
		|	смартОграничениеПродажиНоменклатурыПоКоличеству.КвотаДляДилера КАК КвотаДляДилера,
	 	|	смартОграничениеПродажиНоменклатурыПоКоличеству.ИспользоватьКвотуДляДилера КАК ИспользоватьКвотуДляДилера,
	    //-- #1319 смарт: Фролов 28.02.2023
        |	смартОграничениеПродажиНоменклатурыПоКоличеству.Количество,
        |	смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура.ЭтоГруппа
        |ИЗ
        |	РегистрСведений.смартОграничениеПродажиНоменклатурыПоКоличеству КАК смартОграничениеПродажиНоменклатурыПоКоличеству
        |ГДЕ
        |	смартОграничениеПродажиНоменклатурыПоКоличеству.Номенклатура.ЭтоГруппа";
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        СтруктураОграничения=Неопределено; 
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
            Для каждого СтрНоменклатуры Из ТЗТовары Цикл
                Если СтрНоменклатуры.Номенклатура.ПринадлежитЭлементу(ВыборкаДетальныеЗаписи.Номенклатура) 
                    // И СтрНоменклатуры.Количество>ВыборкаДетальныеЗаписи.Количество 
                    И НЕ СтрНоменклатуры.Использовано Тогда 
					//++ #1319 смарт: Фролов 1.03.2023 //Ограничение количества продаж и отмена скидок
					//Если ПроверятьКоличество И СтрНоменклатуры.Количество>ВыборкаДетальныеЗаписи.Количество Тогда
					Если ПроверятьКоличество И СтрНоменклатуры.Количество>?(ЭтоДилер И ВыборкаДетальныеЗаписи.ИспользоватьКвотуДляДилера,Цел(ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КвотаДляДилера/100),ВыборкаДетальныеЗаписи.Количество) Тогда	
					//-- #1319 смарт: Фролов 1.03.2023
                        СтруктураОграничения=Новый Структура;
                        СтруктураОграничения.Вставить("Номенклатура",СтрНоменклатуры.Номенклатура);
						//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок
						Если ЭтоДилер И ВыборкаДетальныеЗаписи.ИспользоватьКвотуДляДилера Тогда
							СтруктураОграничения.Вставить("Количество",Цел(ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КвотаДляДилера/100));	
						Иначе	
	                    	СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
						КонецЕсли;
						//СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
						//-- #1319 смарт: Фролов 28.02.2023
                        СтруктураОграничения.Вставить("КоличествоВДокументе",СтрНоменклатуры.Количество); 
                        МассивПроверки.Добавить(СтруктураОграничения); 
                    ИначеЕсли НЕ ПроверятьКоличество Тогда    
                        СтруктураОграничения=Новый Структура;
                        СтруктураОграничения.Вставить("Номенклатура",СтрНоменклатуры.Номенклатура);
						//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок
						Если ЭтоДилер И ВыборкаДетальныеЗаписи.ИспользоватьКвотуДляДилера Тогда
							СтруктураОграничения.Вставить("Количество",Цел(ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КвотаДляДилера/100));	
						Иначе	
	                    	СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
						КонецЕсли;
						//СтруктураОграничения.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
						//-- #1319 смарт: Фролов 28.02.2023
	                        СтруктураОграничения.Вставить("КоличествоВДокументе",СтрНоменклатуры.Количество); 
                        МассивПроверки.Добавить(СтруктураОграничения); 
                    КонецЕсли; 
					//++#1312 смарт: Лопато 15.02.2023 //Убрать ограничение продажи на уцененный товар (продолжение задачи 1009)  
               		СтрНоменклатуры.Использовано=Истина;
					//--#1312 смарт: Лопато 15.02.2023
               КонецЕсли; 
            КонецЦикла;
        КонецЦикла;    
    КонецЕсли; 
    
    Если МассивПроверки.Количество() Тогда
        Возврат МассивПроверки;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции//-- смарт:Подкин #1009 29.04.2022 12:26:15

//++ смарт:Подкин #1009 29.04.2022 12:26:15
&НаСервере
Функция смартПроверкаОграниченияПоРегистрам(ТзНомОграниченияЗаказа) 
    
    Запрос = Новый Запрос;
    
    //"ВЫБРАТЬ
    //|   ВТТовары.Номенклатура КАК Номенклатура,
    //|   ВТТовары.Количество КАК Количество,
    //|   ВТТовары.КоличествоВДокументе КАК КоличествоВДокументе
    //|ПОМЕСТИТЬ ТоварыОграничения
    //|ИЗ
    //|   &ВТТовары КАК ВТТовары
    //|;
    //|
    //|////////////////////////////////////////////////////////////////////////////////
    //|ВЫБРАТЬ
    //|   ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура КАК НоменклатураРасход,
    //|   СУММА(ТоварыКОтгрузкеОстаткиИОбороты.КОформлениюРасход) КАК КоличествоРасход
    //|ПОМЕСТИТЬ РасходНедельный
    //|ИЗ
    //|   РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(&ДатаН, &ДатаК, Регистратор, , Получатель = &Партнер) КАК ТоварыКОтгрузкеОстаткиИОбороты
    //|ГДЕ
    //|   ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеОстаткиИОбороты.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
    //|
    //|СГРУППИРОВАТЬ ПО
    //|   ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура
    //|;
    //|
    //|////////////////////////////////////////////////////////////////////////////////
    //|ВЫБРАТЬ
    //|   РасходНедельный.НоменклатураРасход КАК НоменклатураРасход,
    //|   РасходНедельный.КоличествоРасход КАК КоличествоРасход,
    //|   ТоварыОграничения.Номенклатура КАК Номенклатура,
    //|   ТоварыОграничения.Количество КАК Количество,
    //|   ТоварыОграничения.КоличествоВДокументе КАК КоличествоВДокументе
    //|ИЗ
    //|   ТоварыОграничения КАК ТоварыОграничения
    //|       ЛЕВОЕ СОЕДИНЕНИЕ РасходНедельный КАК РасходНедельный
    //|       ПО (РасходНедельный.НоменклатураРасход = ТоварыОграничения.Номенклатура)
    //|ГДЕ
    //|   РасходНедельный.КоличествоРасход + ТоварыОграничения.КоличествоВДокументе > ТоварыОграничения.Количество";
    Запрос.Текст =  "ВЫБРАТЬ
    |	ВТТовары.Номенклатура КАК Номенклатура,
    |	ВТТовары.Количество КАК Количество,
    |	ВТТовары.КоличествоВДокументе КАК КоличествоВДокументе
    |ПОМЕСТИТЬ ТоварыОграничения
    |ИЗ
    |	&ВТТовары КАК ВТТовары
    |;
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ЗаказыКлиентовОстаткиИОбороты.Номенклатура КАК НоменклатураРасход,
    |	СУММА(ЗаказыКлиентовОстаткиИОбороты.ЗаказаноПриход) КАК КоличествоРасход
    |ПОМЕСТИТЬ РасходНедельный
    |ИЗ
    |	РегистрНакопления.ЗаказыКлиентов.ОстаткиИОбороты(&ДатаН, &ДатаК, , , ЗаказКлиента.Партнер = &Партнер И НЕ ЗаказКлиента=&ЗаказКлиента) КАК ЗаказыКлиентовОстаткиИОбороты
    |СГРУППИРОВАТЬ ПО
    |	ЗаказыКлиентовОстаткиИОбороты.Номенклатура
    |;
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	РасходНедельный.НоменклатураРасход КАК НоменклатураРасход,
    |	РасходНедельный.КоличествоРасход КАК КоличествоРасход,
    |	ТоварыОграничения.Номенклатура КАК Номенклатура,
    |	ТоварыОграничения.Количество КАК Количество,
    |	ТоварыОграничения.КоличествоВДокументе КАК КоличествоВДокументе
    |ИЗ
    |	ТоварыОграничения КАК ТоварыОграничения
    |		ЛЕВОЕ СОЕДИНЕНИЕ РасходНедельный КАК РасходНедельный
    |		ПО (РасходНедельный.НоменклатураРасход = ТоварыОграничения.Номенклатура)
    |ГДЕ
    |	РасходНедельный.КоличествоРасход + ТоварыОграничения.КоличествоВДокументе > ТоварыОграничения.Количество";

    Запрос.УстановитьПараметр("ДатаН", НачалоНедели(Дата)); 
    Запрос.УстановитьПараметр("ДатаК", КонецНедели(Дата));
    Запрос.УстановитьПараметр("Партнер",Партнер);
    Запрос.УстановитьПараметр("ВТТовары", ТзНомОграниченияЗаказа);
    Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    Если РезультатЗапроса.Пустой() Тогда
        Возврат Неопределено;	
    КонецЕсли;
    
    Возврат РезультатЗапроса.Выгрузить();    
    
КонецФункции //-- смарт:Подкин #1009 29.04.2022 12:26:15

//++ смарт:Подкин #945 18.03.2022 18:57:51
&НаСервере
Функция ОпределитьИзмененияВерсийОбъекта(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации) Экспорт
    // Проверка, что это ТЧ объекта, а не таблица регистра.
    //Если Объект.Метаданные().ТабличныеЧасти.Найти(СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти) = Неопределено Тогда
    //	Возврат Ложь;
    //КонецЕсли;
    
    ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения = РеквизитыРегистрацииТабличнойЧастиДоИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации);
    ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения.Свернуть("Номенклатура,ВидЦены","Количество");
    ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения = РеквизитыРегистрацииТабличнойЧастиПослеИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации);
    ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения.Свернуть("Номенклатура,ВидЦены","Количество");          
    
    ТаблицаРазницы=РазницаТаблицЗначений(ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения, ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения, СтрокаТаблицыРеквизитовРегистрации);
    
    ТаблицаРазницы.Свернуть("Номенклатура,ВидЦены,Знак","Количество");
    
    Возврат ТаблицаРазницы; 
    //Не ТаблицыРеквизитовРегистрацииОдинаковые(ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения, ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения, СтрокаТаблицыРеквизитовРегистрации);
    
КонецФункции //-- смарт:Подкин #945 18.03.2022 18:57:51

 //++ смарт:Подкин #945 18.03.2022 18:57:51
&НаСервере
Функция РеквизитыРегистрацииТабличнойЧастиДоИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ "+ СтрокаТаблицыРеквизитовРегистрации
	+ " ИЗ Документ.ЗаказКлиента" 
	+ ".Товары КАК ТекущийОбъектИмяТабличнойЧасти
	|ГДЕ
	|   ТекущийОбъектИмяТабличнойЧасти.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ТекОбъект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //-- смарт:Подкин #945 18.03.2022 18:57:51

//++ смарт:Подкин #945 18.03.2022 18:57:51
&НаСервере
Функция РеквизитыРегистрацииТабличнойЧастиПослеИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТаблицаРеквизитовРегистрации = ТекОбъект.Товары.Выгрузить(, СтрокаТаблицыРеквизитовРегистрации);
	
	Возврат ТаблицаРеквизитовРегистрации;
	
КонецФункции //-- смарт:Подкин #945 18.03.2022 18:57:51

//++ смарт:Подкин #945 20.03.2022 21:11:33
&НаСервере
Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения) Экспорт
    
    Отбор = Новый Структура(Измерения);
    
    Ресурсы = Новый Массив;
    Для ИндексКолонки = 0 По Таблица0.Колонки.Количество() - 1 Цикл
        Если НЕ Отбор.Свойство(Таблица0.Колонки[ИндексКолонки].Имя) Тогда
            Ресурсы.Добавить(ИндексКолонки)
        КонецЕсли
    КонецЦикла;
    
    Таблица1.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
    Таблица1.ЗаполнитьЗначения(1, "Знак");
    НовыйИндекс = Таблица1.Индексы.Добавить(Измерения);
    
    Разница = Таблица1.СкопироватьКолонки();
    
    Для Каждого Строка0 Из Таблица0 Цикл
        ЗаполнитьЗначенияСвойств(Отбор, Строка0); 
        Строки1 = Таблица1.НайтиСтроки(Отбор);
        Если Строки1.Количество() = 0 Тогда     
            ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка0)     
        Иначе
            Строка1 = Строки1[0];
            Для Каждого Ресурс Из Ресурсы Цикл 
                Если Строка0[Ресурс] <> Строка1[Ресурс] Тогда    
                    ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка0);
                    ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка1);
                    Прервать 
                КонецЕсли 
            КонецЦикла;
            Строка1.Знак = 0 
        КонецЕсли 
    КонецЦикла;
    
    Для Каждого Строка1 Из Таблица1.НайтиСтроки(Новый Структура("Знак", 1)) Цикл 
        ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка1); 
    КонецЦикла;
    
    Таблица1.Колонки.Удалить("Знак");
    Таблица1.Индексы.Удалить(НовыйИндекс);
        
    Возврат Разница
    
КонецФункции//-- смарт:Подкин #945 20.03.2022 21:11:33

&НаСервере
Процедура смартПроверкаИзмененияРеквизитовЗаказВыгруженНаСайт(Отказ)
//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  

	//++#1261 смарт: Лопато 21.03.2023 //Разрешение изменения контрагента для полных прав  
	СтрокаПроверяемыхРеквизитов = "Партнер,Организация";
	//--#1261 смарт: Лопато 21.03.2023
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ "+ СтрокаПроверяемыхРеквизитов
	+ " ИЗ Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|   ЗаказКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() Тогда
		МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПроверяемыхРеквизитов, ",");
		Для Каждого Реквизит Из МассивРеквизитов Цикл
			Если Результат[Реквизит] <> ЭтотОбъект[Реквизит] Тогда
				//++#1261 смарт: Лопато 22.03.2023 //Доработка изменения Заказа клиента для ИМ  
				//Если НЕ (Реквизит = "Контрагент" И Пользователи.РолиДоступны("ПолныеПрава", Пользователи.ТекущийПользователь())) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Если заказ выгружен на сайт, изменение организации и клиента запрещено!");
					Отказ = Истина;
				//КонецЕсли;
				//--#1261 смарт: Лопато 22.03.2023
				Возврат;       
			КонецЕсли;         
		КонецЦикла;	           
	КонецЕсли;

//--#1261 смарт: Лопато 01.12.2022
КонецПроцедуры

//++ смарт:Демичев №1277 27.02.2023
&НаСервере
Функция смартУстановитьЗначениеЖелаемойДатеОтгрузки(ТекОбъект) Экспорт
	
	мЖелаемаяДатаОтгрузки = Дата(1,1,1);

	Если ТекОбъект.НеОтгружатьЧастями Тогда
		
		мЖелаемаяДатаОтгрузки = ТекОбъект.ДатаОтгрузки;
		
	ИначеЕсли НЕ НеОтгружатьЧастями Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.Отменено КАК Отменено
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&Товары КАК ЗаказКлиентаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ_ТЗ.ДатаОтгрузки) КАК ДатаОтгрузки
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|ГДЕ
		|	ВТ_ТЗ.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|	И ВТ_ТЗ.Отменено = ЛОЖЬ
		|	И ВТ_ТЗ.ДатаОтгрузки >= &ТекущаяДатаНачалоДня";
		
		Запрос.УстановитьПараметр("ТекущаяДатаНачалоДня", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Товары", ТекОбъект.Товары.Выгрузить());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.ДатаОтгрузки) Тогда
				мЖелаемаяДатаОтгрузки = Выборка.ДатаОтгрузки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	

 Возврат мЖелаемаяДатаОтгрузки;	
	
КонецФункции	
//-- смарт:Демичев №1277 27.02.2023    

//++ смарт:Каратеев №1343 20.04.2023 //Исключить ограничение на продажу в USD
//Сделал общую функцию для получения разрешенных валют видов цен, так как список разрешенных валют для установки цены постоянно меняется
&НаСервере
Функция смартРазрешенныеВалютыВидаЦен(ВалютаЦены) Экспорт
	
	Возврат ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить()
		ИЛИ ВалютаЦены = Константы.ВалютаРегламентированногоУчета.Получить()
		//++ #Б6792 смарт: Шляпников 14.05.2026 / Использование вида цен в юанях
		ИЛИ ВалютаЦены = Справочники.Валюты.НайтиПоКоду("156")
		//-- #Б6792 смарт: Шляпников 14.05.2026
		ИЛИ ВалютаЦены = Справочники.Валюты.НайтиПоКоду("840");
		
КонецФункции
//-- смарт:Каратеев №1343 20.04.2023 //Исключить ограничение на продажу в USD

//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO
Процедура ЗаполнитьТабличнуюЧастьТоварыПоСпецификации(Спецификация)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//++ #Б-1943 смарт: Ермаков 03.02.2025 / Доработка создания Заказа клиента из Спецификации.
	// Отключил код
	//++ #1943 смарт: Шляпников 23.01.2025 / Доработка создания Заказа клиента из Спецификации.
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	Т.Номенклатура КАК Номенклатура,
	//|	Т.Конструктор КАК Конструктор
	//|ПОМЕСТИТЬ ВТСоответствие
	//|ИЗ
	//|	РегистрСведений.смартСоответствиеНоменклатурыСКонструкторомКП КАК Т
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСоответствие.Номенклатура КАК Номенклатура
	//|ПОМЕСТИТЬ ВТКомплекты
	//|ИЗ
	//|	ВТСоответствие КАК ВТСоответствие
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСоответствие.Номенклатура
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТСоответствие.Конструктор) > 1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСоответствие.Номенклатура КАК Номенклатура,
	//|	ВТСоответствие.Конструктор КАК Конструктор
	//|ИЗ
	//|	ВТСоответствие КАК ВТСоответствие
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКомплекты КАК ВТКомплекты
	//|		ПО ВТСоответствие.Номенклатура = ВТКомплекты.Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Данные.Номенклатура КАК Номенклатура,
	//|	СУММА(Данные.Количество) КАК Количество,
	//|	МАКСИМУМ(Данные.НомерСтроки) КАК НомерСтроки,
	//|	Данные.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	//|	МАКСИМУМ(Данные.Цена) КАК Цена,
	//|	Данные.Приоритет КАК Приоритет,
	//|	Данные.ЭтоКомплект КАК ЭтоКомплект,
	//|	Данные.ВключатьВЗаказ КАК ВключатьВЗаказ
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЕСТЬNULL(Соответствие.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//|		Комплектующие.Количество КАК Количество,
	//|		Комплектующие.НомерСтроки КАК НомерСтроки,
	//|		Комплектующие.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	//|		ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	//|		ВЫБОР
	//|			КОГДА Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	//|				ТОГДА 1
	//|			ИНАЧЕ 2
	//|		КОНЕЦ КАК Приоритет,
	//|		ВЫБОР
	//|			КОГДА (Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	//|					ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая)
	//|					И НЕ ВТКомплекты.Номенклатура ЕСТЬ NULL
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ КАК ЭтоКомплект,
	//|		Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	//|			ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая
	//|			ИЛИ Комплектующие.Цена > 0 КАК ВключатьВЗаказ
	//|	ИЗ
	//|		Документ.смартIECHOСпецификация.Комплектующие КАК Комплектующие
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствие КАК Соответствие
	//|			ПО Комплектующие.НаименованиеКомплектующей = Соответствие.Конструктор
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
	//|			ПО (Соответствие.Номенклатура = Цены.Номенклатура)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКомплекты КАК ВТКомплекты
	//|			ПО (Соответствие.Номенклатура = ВТКомплекты.Номенклатура)
	//|	ГДЕ
	//|		Комплектующие.Ссылка = &Ссылка
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Комплектующие.НаименованиеКомплектующей.КабельВКомплекте,
	//|		Комплектующие.Количество,
	//|		Комплектующие.НомерСтроки,
	//|		Комплектующие.НаименованиеКомплектующей,
	//|		ЕСТЬNULL(Цены.Цена, 0),
	//|		2,
	//|		ЛОЖЬ,
	//|		ИСТИНА
	//|	ИЗ
	//|		Документ.смартIECHOСпецификация.Комплектующие КАК Комплектующие
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
	//|			ПО Комплектующие.НаименованиеКомплектующей.КабельВКомплекте = Цены.Номенклатура
	//|	ГДЕ
	//|		Комплектующие.Ссылка = &Ссылка
	//|		И (Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	//|				ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая
	//|				ИЛИ Комплектующие.Цена > 0)
	//|		И НЕ Комплектующие.НаименованиеКомплектующей.КабельВКомплекте = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Данные
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Данные.Номенклатура,
	//|	Данные.НаименованиеКомплектующей,
	//|	Данные.Приоритет,
	//|	Данные.ЭтоКомплект,
	//|	Данные.ВключатьВЗаказ
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Приоритет";
	//-- #Б-1943 смарт: Ермаков 03.02.2025 / Доработка создания Заказа клиента из Спецификации.
	
	//++ #Б-1943 смарт: Ермаков 03.02.2025 / Доработка создания Заказа клиента из Спецификации.
	МВТ = Новый МенеджерВременныхТаблиц; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Спецификация);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD);	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	НаименованиеКомплектующей КАК Комплектующая
	|ПОМЕСТИТЬ ИскомыеКомплектующие
	|ИЗ
	|	Документ.смартIECHOСпецификация.Комплектующие			
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И (НаименованиеКомплектующей.ОсновнаяКомплектующая
	|		ИЛИ НаименованиеКомплектующей.КлючеваяКомплектующая)";
	Запрос.УстановитьПараметр("КоличествоЭлементовКомплекта", Запрос.Выполнить().Выгрузить()[0].Количество);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(Номенклатура) КАК КоличествоКомплектующих
	|ПОМЕСТИТЬ КомплектыВключения
	|ИЗ
	|	РегистрСведений.смартСоответствиеНоменклатурыСКонструкторомКП
	|ГДЕ
	|	Конструктор В (ВЫБРАТЬ Комплектующая ИЗ ИскомыеКомплектующие)  			
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИМЕЮЩИЕ КОЛИЧЕСТВО(*) = &КоличествоЭлементовКомплекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура
	|ПОМЕСТИТЬ КомплектыИсключения
	|ИЗ
	|	РегистрСведений.смартСоответствиеНоменклатурыСКонструкторомКП	
	|ГДЕ
	|	Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ КомплектыВключения)
	|	И НЕ Конструктор В (ВЫБРАТЬ Комплектующая ИЗ ИскомыеКомплектующие)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура
	|ПОМЕСТИТЬ КомплектыЧистыеДанные
	|ИЗ
	|	КомплектыВключения
	|ГДЕ
	|	НЕ Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ КомплектыИсключения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Конструктор КАК Конструктор,
	|	Т.СуммироватьКоличество КАК СуммироватьКоличество
	|ПОМЕСТИТЬ ВТСоответствие
	|ИЗ
	|	РегистрСведений.смартСоответствиеНоменклатурыСКонструкторомКП КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоответствие.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТКомплекты
	|ИЗ
	|	ВТСоответствие КАК ВТСоответствие
	|ГДЕ
	|	ВТСоответствие.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ КомплектыЧистыеДанные)
	|СГРУППИРОВАТЬ ПО
	|	ВТСоответствие.Номенклатура
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТСоответствие.Конструктор) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоответствие.Номенклатура КАК Номенклатура,
	|	ВТСоответствие.Конструктор КАК Конструктор
	|ПОМЕСТИТЬ Комплекты
	|ИЗ
	|	ВТСоответствие КАК ВТСоответствие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКомплекты КАК ВТКомплекты
	|		ПО ВТСоответствие.Номенклатура = ВТКомплекты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Номенклатура КАК Номенклатура,
	|	СУММА(Данные.Количество) КАК Количество,
	|	МАКСИМУМ(Данные.НомерСтроки) КАК НомерСтроки,
	|	Данные.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	МАКСИМУМ(Данные.Цена) КАК Цена,
	|	Данные.Приоритет КАК Приоритет,
	|	Данные.ЭтоКомплект КАК ЭтоКомплект,
	|	Данные.ВключатьВЗаказ КАК ВключатьВЗаказ,
	|	Данные.СуммироватьКоличество КАК СуммироватьКоличество
	|ИЗ
	|	(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Комплекты.Номенклатура КАК Номенклатура,
	|		1 КАК Количество,
	|		0 КАК НомерСтроки,
	|		ЗНАЧЕНИЕ(Справочник.смартIECHOКомплектующие.ПустаяСсылка) КАК НаименованиеКомплектующей,
	|		ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	|		1 КАК Приоритет,
	|		ИСТИНА КАК ЭтоКомплект,
	|		ИСТИНА КАК ВключатьВЗаказ,
	|		ЛОЖЬ КАК СуммироватьКоличество
	|	ИЗ
	|		Комплекты КАК Комплекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
	|		ПО (Комплекты.Номенклатура = Цены.Номенклатура)
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|		
	|	ВЫБРАТЬ
	|		ЕСТЬNULL(Соответствие.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		Комплектующие.Количество КАК Количество,
	|		Комплектующие.НомерСтроки КАК НомерСтроки,
	|		Комплектующие.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|		ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	|		ВЫБОР
	|			КОГДА Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК Приоритет,
	|		ВЫБОР
	|			КОГДА (Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	|					ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая)
	|					И НЕ ВТКомплекты.Номенклатура ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоКомплект,
	|		Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	|			ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая
	|			ИЛИ Комплектующие.Цена > 0 КАК ВключатьВЗаказ,
	|		ЕСТЬNULL(Соответствие.СуммироватьКоличество, ЛОЖЬ)
	|	ИЗ
	|		Документ.смартIECHOСпецификация.Комплектующие КАК Комплектующие
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствие КАК Соответствие
	|			ПО Комплектующие.НаименованиеКомплектующей = Соответствие.Конструктор
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
	|			ПО (Соответствие.Номенклатура = Цены.Номенклатура)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКомплекты КАК ВТКомплекты
	|			ПО (Соответствие.Номенклатура = ВТКомплекты.Номенклатура)
	|	ГДЕ
	|		Комплектующие.Ссылка = &Ссылка
	|		И НЕ Комплектующие.НаименованиеКомплектующей В (ВЫБРАТЬ Конструктор ИЗ Комплекты)
	|		И НЕ (Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	|			ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая)			
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Комплектующие.НаименованиеКомплектующей.КабельВКомплекте,
	|		Комплектующие.Количество,
	|		Комплектующие.НомерСтроки,
	|		Комплектующие.НаименованиеКомплектующей,
	|		ЕСТЬNULL(Цены.Цена, 0),
	|		2,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.смартIECHOСпецификация.Комплектующие КАК Комплектующие
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
	|			ПО Комплектующие.НаименованиеКомплектующей.КабельВКомплекте = Цены.Номенклатура
	|	ГДЕ
	|		Комплектующие.Ссылка = &Ссылка
	|		И (Комплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая
	|				ИЛИ Комплектующие.НаименованиеКомплектующей.КлючеваяКомплектующая
	|				ИЛИ Комплектующие.Цена > 0)
	|		И НЕ Комплектующие.НаименованиеКомплектующей.КабельВКомплекте = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Номенклатура,
	|	Данные.НаименованиеКомплектующей,
	|	Данные.Приоритет,
	|	Данные.ЭтоКомплект,
	|	Данные.ВключатьВЗаказ,
	|	Данные.СуммироватьКоличество
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	ВалютаЦены = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD.ВалютаЦены;
	
	//++ #1943 смарт: Шляпников 23.01.2025 / Доработка создания Заказа клиента из Спецификации.
	Пакет = Запрос.ВыполнитьПакет();
	Комплектующие = Пакет[Пакет.Количество() - 1].Выгрузить();
	
	//++ #Б-1943 смарт: Ермаков 03.02.2025 / Доработка создания Заказа клиента из Спецификации.
	// Отключил код
	//Комплекты = Пакет[Пакет.Количество() - 2].Выгрузить();
	//
	//НайденныеКомплекты = Комплектующие.НайтиСтроки(Новый Структура("ЭтоКомплект", Истина));
	//Для каждого стрНайденныйКомплект Из НайденныеКомплекты Цикл
	//	
	//	МассивТребуемыхКомплектующих = Комплекты.НайтиСтроки(Новый Структура("Номенклатура", стрНайденныйКомплект.Номенклатура));
	//	МассивДобавленныхКомплектующих = Новый Массив;
	//	
	//	КомплектСобран = Истина;
	//	
	//	Для каждого стрТребуемаяКомплектующая Из МассивТребуемыхКомплектующих Цикл
	//		
	//		НайденныеКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("НаименованиеКомплектующей", стрТребуемаяКомплектующая.Конструктор));
	//		Если НайденныеКомплектующие.Количество() = 0 Тогда
	//			КомплектСобран = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//		
	//		МассивДобавленныхКомплектующих.Добавить(НайденныеКомплектующие[0]);
	//		
	//	КонецЦикла;
	//	
	//	Если НЕ КомплектСобран Тогда
	//		//удаляем комплектующие из списка
	//		
	//		Для каждого стрДобавленнаяКомплектующая Из МассивДобавленныхКомплектующих Цикл
	//			Комплектующие.Удалить(стрДобавленнаяКомплектующая);
	//		КонецЦикла;
	//		
	//	Иначе
	//		//объедниняем комплектующие
	//		Для каждого стрДобавленнаяКомплектующая Из МассивДобавленныхКомплектующих Цикл
	//			
	//			Если стрДобавленнаяКомплектующая = стрНайденныйКомплект Тогда
	//				//это основная комплектующая - ее оставляем
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			Комплектующие.Удалить(стрДобавленнаяКомплектующая);
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//-- #Б-1943 смарт: Ермаков 03.02.2025 / Доработка создания Заказа клиента из Спецификации.
	
	Для каждого Выборка Из Комплектующие Цикл
		
		Если НЕ Выборка.ВключатьВЗаказ Тогда
			Продолжить;
		КонецЕсли;
	//-- #1943 смарт: Шляпников 23.01.2025
		
		Если НЕ ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найдено соответствие комплектующей '%1' в строке %2", Выборка.НаименованиеКомплектующей, Выборка.НомерСтроки));
			Продолжить;
		КонецЕсли;
		
		//++ #Б4688 смарт: Шляпников 13.10.2025 / Доработка Спецификаций IECHo.
		НоваяСтрока = Товары.Найти(Выборка.Номенклатура, "Номенклатура");
		СуммироватьКоличество = Ложь;
		Если НЕ НоваяСтрока = Неопределено И НЕ Выборка.СуммироватьКоличество Тогда
			Продолжить;
		ИначеЕсли НЕ НоваяСтрока = Неопределено Тогда
			СуммироватьКоличество = Истина;
		КонецЕсли;
		//-- #Б-1544 смарт: Фролов 06.12.2024
		
		Если НЕ СуммироватьКоличество Тогда
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.КоличествоУпаковок = Выборка.Количество;
			НоваяСтрока.Количество = Выборка.Количество;
			НоваяСтрока.ВидЦены = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD;
			
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется;
			НоваяСтрока.Цена = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Цена, ВалютаЦены, Валюта, ТекущаяДата());
			
			Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС Тогда
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			Иначе 
				//++ #Б6462 смарт: Шляпников 13.04.2026 / Ошибка! Срочно! При создании заказа из спецификации IECHo ставиться ндс 20%.
				Если (ЗначениеЗаполнено(ЭтотОбъект.Дата) И ЭтотОбъект.Дата < Дата(2026, 1, 1)) ИЛИ (НЕ ЗначениеЗаполнено(ЭтотОбъект.Дата) И ТекущаяДата() < Дата(2026, 1, 1)) Тогда
					НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				Иначе
					НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
				КонецЕсли;
				//-- #Б6462 смарт: Шляпников 13.04.2026
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок + Выборка.Количество;
			НоваяСтрока.Количество = НоваяСтрока.Количество + Выборка.Количество;
			
		КонецЕсли;
		
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		
		НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			НоваяСтрока.Сумма,
			УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
			ЦенаВключаетНДС,
			НалогообложениеНДС);

		ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока, СтруктураДействий, Неопределено); 			
		ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуСУчетомРучнойСкидкиВСтрокеТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
				
	КонецЦикла;
	
	ИтоговаяСумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(Спецификация.ИтогоДляКлиента, Спецификация.Валюта, Валюта, ТекущаяДата());
	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	Разница = ИтоговаяСумма - СуммаДокумента;
	
	Если СуммаДокумента <> 0 Тогда
		
		Для каждого стрТовары Из Товары Цикл
			
			Если стрТовары.СуммаСНДС = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Дельта = Окр(стрТовары.СуммаСНДС * Разница / СуммаДокумента, 2);
			стрТовары.СуммаРучнойСкидки = - Дельта;
			стрТовары.ПроцентРучнойСкидки = - Дельта * 100 / стрТовары.СуммаСНДС;
			Разница = Разница + стрТовары.СуммаРучнойСкидки;
			СуммаДокумента = СуммаДокумента - стрТовары.СуммаСНДС;
			
			Если ЦенаВключаетНДС Тогда
				
				стрТовары.Сумма = стрТовары.Сумма + Дельта;
				стрТовары.СуммаСНДС = стрТовары.СуммаСНДС + Дельта;
				
				стрТовары.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
															стрТовары.Сумма,
															УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(стрТовары.СтавкаНДС),
															ЦенаВключаетНДС,
															НалогообложениеНДС);
				
			Иначе
				
				стрТовары.СуммаСНДС = стрТовары.СуммаСНДС + Дельта;
				СтавкаНДСЧислом = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(стрТовары.СтавкаНДС);
				стрТовары.Сумма = стрТовары.СуммаСНДС / (1 + СтавкаНДСЧислом / (100 + СтавкаНДСЧислом));
				стрТовары.СуммаНДС = стрТовары.СуммаСНДС - стрТовары.Сумма;
															
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
