
&ИзменениеИКонтроль("СписокРасширенийДляПредпросмотра")
//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
Функция смарт_СписокРасширенийДляПредпросмотра()

	// См. также перечисление ФорматКартинки.
	РасширенияДляПредпросмотра = Новый СписокЗначений;
	РасширенияДляПредпросмотра.Добавить("bmp");
	РасширенияДляПредпросмотра.Добавить("emf");
	РасширенияДляПредпросмотра.Добавить("gif");
	РасширенияДляПредпросмотра.Добавить("ico");
	РасширенияДляПредпросмотра.Добавить("icon");
	РасширенияДляПредпросмотра.Добавить("jpg");
	РасширенияДляПредпросмотра.Добавить("jpeg");
	РасширенияДляПредпросмотра.Добавить("png");
	РасширенияДляПредпросмотра.Добавить("tiff");
	РасширенияДляПредпросмотра.Добавить("tif");
	РасширенияДляПредпросмотра.Добавить("wmf"); 
	
	#Вставка
	//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
	РасширенияДляПредпросмотра.Добавить("pdf");
	//-- #Б-6426 смарт: Фролов 17.04.2026
	#КонецВставки

	Возврат РасширенияДляПредпросмотра;

КонецФункции //-- #Б-6426 смарт: Фролов 17.04.2026
