#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++ #Б-2336 смарт: Лопато 26.02.2025 //Печатная форма приказа на выплату ДС подотчетнику в УТ  
Функция смартПолучитьПрефиксДатыПриказаНаВыплатуДСПодотчетнику(Заявка) Экспорт
	
	//++ #Б-2612 смарт: Лопато 07.03.2025 //Нет прав для оформления Заявки на Расходование ДС  
	УстановитьПривилегированныйРежим(Истина);
	//-- #Б-2612 смарт: Лопато 07.03.2025
	
	Результат = "";
	
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Ссылка КАК Ссылка,
	|	ДатаПроведенияБанком КАК ДатаПроведенияБанком
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств
	|ГДЕ
	|	Проведен
	|	И ПроведеноБанком
	|	И ДатаПроведенияБанком <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (ЗаявкаНаРасходованиеДенежныхСредств = &Заявка 
	|	   ИЛИ Ссылка.ЗаявкаНаРасходованиеДенежныхСредств = &Заявка)
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Формат(Выборка.ДатаПроведенияБанком, "ДФ=MM") + "/" 
					+ Формат(Выборка.ДатаПроведенияБанком, "ДФ=dd");
		
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции //-- #Б-2336 смарт: Лопато 26.02.2025	

#КонецОбласти

#КонецЕсли
