
#Область СведенияОВнешнейОбработке

Функция СведенияОВнешнейОбработке() Экспорт	
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.4.71");
	ПараметрыРегистрации.Информация = НСтр("ru = 'Интерактивная карта Яндекс (смарт) разработана по задаче 1248.'");
	//++#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248)
	ПараметрыРегистрации.Информация = НСтр("ru = 'Интерактивная карта Яндекс (смарт) разработана по задаче 1248.'");
	//--#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248)
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.1";
	//++#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248)
	ПараметрыРегистрации.Версия = "2.0";
	//--#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248)
	ПараметрыРегистрации.БезопасныйРежим = Ложь; 
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Открыть интерактивную карту Яндекс (смарт)'");
	Команда.Идентификатор = "ИнтерективнаяКартаЯндекс";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти
