#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Номенклатура", Номенклатура);
	Параметры.Свойство("КодСтроки", КодСтроки);
	
	ОбновитьСписокДоступныхАкций();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ПрименитьАкцию(Команда)
	ПрименитьВыбраннуюАкцию();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоступныхАкцийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрименитьВыбраннуюАкцию();
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ОбновитьСписокДоступныхАкций()
	
	ТаблицаДоступныхАкций.Очистить();
	
	ПараметрыАкций = Новый Структура;
	ПараметрыАкций.Вставить("Организация", Организация);
	ПараметрыАкций.Вставить("Номенклатура", Номенклатура);
	
	ТЗАкций = смартАкцииИСкидки.ПолучитьДействующиеАкции(ТекущаяДата(), ПараметрыАкций);
	
	Для каждого стрАкция ИЗ ТЗАкций Цикл
		
		НоваяСтрока = ТаблицаДоступныхАкций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрАкция);
		НоваяСтрока.КодСтроки = КодСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьВыбраннуюАкцию()
	
	Закрыть(ПоместитьАцииДляПередачиВДокумент());
	
КонецПроцедуры

&НаСервере
Функция ПоместитьАцииДляПередачиВДокумент()
	
	Если Элементы.ТаблицаДоступныхАкций.ТекущаяСтрока = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущаяСтрока = ТаблицаДоступныхАкций.НайтиПоИдентификатору(Элементы.ТаблицаДоступныхАкций.ТекущаяСтрока);
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДоступныхАкций.Выгрузить(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока)), УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти