
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОтобразитьДекорациюТипаПродукта();
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров") ТОгда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	ТаблицаДляКоэффициентов = смартСервер.СформироватьВыдачуЛидовПоКвалификации(ТекущийОбъект.Ссылка);

	смартСервер.ЗаполнитьКоэффициентыМенеджеров(ТаблицаДляКоэффициентов);
	
	смартСервер.ОчиститьКоэффициентыИВыдачуЛидов();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СценарийИнтересаПриИзмененииНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ
					|	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
					|ГДЕ
					|	CRM_СостоянияИнтересов.Родитель = &Родитель
					|	И CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.Первое)");
	Запрос.УстановитьПараметр("Родитель",Объект.СценарийИнтереса);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		Объект.СтартовыйЭтап=Выборка.Ссылка;	
	Иначе
		Объект.СценарийИнтереса=Неопределено;
		ОбщегоНазначения.СообщитьПользователю("Не найден стартовый этап для сценария!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
					|	смартКвалификацииПродукты.Ссылка.Ссылка КАК Квалификация
					|ИЗ
					|	Справочник.смартКвалификацииМенеджеров.Продукты КАК смартКвалификацииПродукты
					|ГДЕ
					|	смартКвалификацииПродукты.Продукт = &Продукт
					|	И НЕ смартКвалификацииПродукты.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Для Каждого СтрПродукт Из Объект.Продукты Цикл
		Запрос.УстановитьПараметр("Продукт",СокрЛП(СтрПродукт.Продукт));
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() ТОгда
			ОбщегоНазначения.СообщитьПользователю("Продукт "+СтрПродукт.Продукт+" уже присутствует в квалификации "+Выборка.Квалификация+"!");
			Отказ=Истина;
		КонецЕсли;	
	КонецЦикла;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СценарийИнтересаПриИзменении(Элемент)
	СценарийИнтересаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДекорациюТипаПродукта()
	Если ЗначениеЗаполнено(Объект.ТипПродукта) Тогда
		Если Объект.ТипПродукта.АнализироватьПродукт Тогда
			ЭтаФорма.Элементы.ДекорацияДляТипаПродукта.Заголовок="Распределение производится по продукту";
		Иначе
			ЭтаФорма.Элементы.ДекорацияДляТипаПродукта.Заголовок="Однозначный тип продукта, товары не влияют на распределение.";
		КонецЕсли;
	Иначе
		ЭтаФорма.Элементы.ДекорацияДляТипаПродукта.Заголовок="";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ТипПродуктаПриИзменении(Элемент)
	ОтобразитьДекорациюТипаПродукта();
КонецПроцедуры

