#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Оборудование") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	Оборудование = Параметры.Оборудование;
	
	ПоказатьОстатокНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	
	ПоказатьОстатокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПоказатьОстатокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ПоказатьОстатокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	ПоказатьОстатокНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Элементы.Остатки.ТекущиеДанные.Номенклатура);
	Результат.Вставить("Серия", Элементы.Остатки.ТекущиеДанные.Серия);
	Результат.Вставить("Организация", Элементы.Остатки.ТекущиеДанные.Организация);
	Результат.Вставить("Склад", Элементы.Остатки.ТекущиеДанные.Склад);
	Результат.Вставить("Назначение", Элементы.Остатки.ТекущиеДанные.Назначение);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьОстатокНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Остатки, 
																			"Номенклатура", 
																			Оборудование,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Оборудование),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Остатки, 
																			"Организация", 
																			Организация,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Организация),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Остатки, 
																			"Склад", 
																			Склад,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Склад),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Остатки, 
																			"Серия", 
																			Серия,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Серия),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПеренестиВДокумент(Неопределено);
	
КонецПроцедуры

#КонецОбласти