
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбрабатыватьАктивизациюПоиска;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно открыть АРМ ""Принятие обращения"". Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)';en='It is impossible to open the workstation ""Receive appeal"". Subsystem 1C: CRM is not used! (see Personal settings of the user)'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СпособПоиска = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.СпособПоиска", "МастерРегистрации", 1);
	
	КоличествоПолейПоиска = 1;
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если Параметры.Свойство("ИсточникОткрытияМастера") Тогда
		ИсточникОткрытияМастера = Параметры.ИсточникОткрытияМастера;
	КонецЕсли;
	
	ДоступныКарты = Истина;
	ДоступноОбращение = Истина;
	ОпределенКлиент = Ложь;
	
	ИспользоватьТипыУслуг = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг");
	ПодставлятьОтветственногоЗаКлиентаВИнтерес = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ПодставлятьОтветственногоЗаКлиентаВИнтерес");
	ИспользоватьПоддержку = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоддержку");
	
	Элементы.ТипОбращения.Видимость = ИспользоватьПоддержку;
	ЭтоПоддержка = Ложь;
	
	Если ИспользоватьПоддержку Тогда
		
		ДанныеВыбора = Справочники.CRM_ТипыОбращений.ПолучитьДанныеВыбора(Новый Структура);
		Для Каждого ЭлементДанных Из ДанныеВыбора Цикл
			НовыйЭлемент = Элементы.ТипОбращения.СписокВыбора.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементДанных);
		КонецЦикла;
		
		ПереданТипОбращенияПоддержки = Параметры.Свойство("ТипОбращения") И ЗначениеЗаполнено(Параметры.ТипОбращения)
										И ТипЗнч(Параметры.ТипОбращения) = Тип("СправочникСсылка.CRM_ТипыОбращений")
										И Параметры.ТипОбращения <> Справочники.CRM_ТипыОбращений.Интерес;
						
		Если ПереданТипОбращенияПоддержки Тогда
			УстановитьЗначениеТипОбращения(Параметры.ТипОбращения);
		КонецЕсли;
		
		Если Параметры.Свойство("НеОбновлятьТипОбращения") Тогда
			НеОбновлятьТипОбращения = Параметры.НеОбновлятьТипОбращения;
		КонецЕсли;
		
		Элементы.РежимФильтраПоИнтересам.Заголовок = НСтр("ru = 'Интересы и обращения'");
		Элементы.ИнтересыКлиентаИнтерес.Заголовок = НСтр("ru = 'Интерес, Обращение'");
		
	КонецЕсли;	
	
	ОсновнойВидТелефонаКонтакта = Константы.CRM_ОсновнойВидТелефонаКонтакта.Получить();
	ПоказыватьМобильныйТелефон = (ОсновнойВидТелефонаКонтакта <> Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
	
	РежимФильтраПоИнтересам = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.РежимФильтраПоИнтересам", "МастерРегистрации", "");
	Если НЕ ЗначениеЗаполнено(РежимФильтраПоИнтересам) Тогда
		РежимФильтраПоИнтересам = РежимФильтраПоИнтересамАктивные();
	КонецЕсли;
	Элементы.ИнтересыКлиентаЗавершен.Видимость = НетОтбораПоАктивнымИнтересам(РежимФильтраПоИнтересам);
	
	ПараметрыЗапросов = CRM_ПоискКонтактов.ПараметрыЗапросов();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Клиент", Неопределено, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Контакт", Неопределено, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "НадписьПотенциальногоКлиента", ПараметрыЗапросов.НадписьПотенциальногоКлиента, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента,
																		"НетОтбораПоАктивнымИнтересам",
																		НетОтбораПоАктивнымИнтересам(РежимФильтраПоИнтересам),
																		Истина);
	
	УсловияПоиска = Новый Массив;
	КэшПоиска = CRM_ПоискКонтактов.СтруктураДанныхКэша();
	КэшЗаполнения = CRM_ПоискКонтактов.СтруктураДанныхКэша();
	
	Если Параметры.Свойство("ПисьмоВходящее") Тогда
		
		Обращение = Параметры.ПисьмоВходящее;
		Тема = Параметры.ПисьмоВходящее.Тема;
		
		Содержание = Обращение.Комментарий;
		
		ФИООбращения = "";
		ДанныеОтправителя = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Обращение.ОтправительПредставление, Ложь);
		Если ДанныеОтправителя.Количество() > 0 Тогда
			ФИООбращения = ДанныеОтправителя[0].Представление;
		Иначе
			ФИООбращения = Обращение.ОтправительПредставление;
		КонецЕсли;
		
		НаборЗаписейИсточники = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
		НаборЗаписейИсточники.Отбор.Сделка.Установить(Обращение);
		НаборЗаписейИсточники.Прочитать();
		Если НаборЗаписейИсточники.Количество() > 0 Тогда
			Канал = НаборЗаписейИсточники[0].КаналПервичногоИнтереса;
			Источник = НаборЗаписейИсточники[0].ИсточникПервичногоИнтереса;
		КонецЕсли;
			
		СформироватьКэши(ФИООбращения, "", "", Обращение.ОтправительАдрес, "");
		
		УсловияПоиска.Добавить(КэшПоиска.Email);
		ДобавитьПолеПоискаПоПараметру("Email", КэшЗаполнения.Email);
		
	ИначеЕсли Параметры.Свойство("ПисьмоИсходящее") Тогда
		
		Обращение = Параметры.ПисьмоИсходящее;
		Тема = Параметры.ПисьмоИсходящее.Тема;
		
		Содержание = Обращение.Комментарий;
		
		ФИООбращения = "";
		ОтправительАдрес = "";
		ДанныеПолучателя = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Обращение.СписокПолучателейПисьма, Ложь);
		Если ЗначениеЗаполнено(Обращение.CRM_ОтправительКонтакт) Тогда
			ФИООбращения = Обращение.CRM_ОтправительКонтакт.Наименование;
		ИначеЕсли ДанныеПолучателя.Количество() > 0 Тогда
			ФИООбращения = ДанныеПолучателя[0].Представление;
		КонецЕсли;			
		Если ПустаяСтрока(Обращение.CRM_ОтправительАдрес) Тогда
			Если ДанныеПолучателя.Количество() > 0 Тогда
				ОтправительАдрес = ДанныеПолучателя[0].Адрес;
			КонецЕсли;		
		Иначе	
			ОтправительАдрес = Обращение.CRM_ОтправительАдрес;
		КонецЕсли;
		
		НаборЗаписейИсточники = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
		НаборЗаписейИсточники.Отбор.Сделка.Установить(Обращение);
		НаборЗаписейИсточники.Прочитать();
		Если НаборЗаписейИсточники.Количество() > 0 Тогда
			Канал = НаборЗаписейИсточники[0].КаналПервичногоИнтереса;
			Источник = НаборЗаписейИсточники[0].ИсточникПервичногоИнтереса;
		КонецЕсли;
			
		СформироватьКэши(ФИООбращения, "", "", ОтправительАдрес, "");
		
		УсловияПоиска.Добавить(КэшПоиска.Email);
		ДобавитьПолеПоискаПоПараметру("Email", КэшЗаполнения.Email);
		
	ИначеЕсли Параметры.Свойство("Телемаркетинг") Тогда
		
		Обращение = Параметры.Телемаркетинг;
		ДоступноОбращение = Ложь;
		
		КлиентОбращения = Неопределено;
		КонтактОбращения = Неопределено;
		ТелефонОбращения = "";
		ФИООбращения = "";
		
		Параметры.ЗначенияЗаполнения.Свойство("Партнер", КлиентОбращения);
		Параметры.ЗначенияЗаполнения.Свойство("КонтактноеЛицо", КонтактОбращения);
		Параметры.ЗначенияЗаполнения.Свойство("Телефон", ТелефонОбращения);
		Параметры.ЗначенияЗаполнения.Свойство("КлиентСтрокой", ФИООбращения);
		
		СформироватьКэши(ФИООбращения, "", ТелефонОбращения, "", "");
		
		Если ЗначениеЗаполнено(КонтактОбращения) Тогда
			
			ЗаполнитьРезультатыПоискаПоПараметру("Контакт", КонтактОбращения);
			ОпределенКлиент = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(КлиентОбращения) Тогда
			
			ЗаполнитьРезультатыПоискаПоПараметру("Клиент", КлиентОбращения);
			ОпределенКлиент = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ТелефонОбращения) Тогда
			
			УсловияПоиска.Добавить(КэшПоиска.Телефон);
			ДобавитьПолеПоискаПоПараметру("Телефон", КэшЗаполнения.Телефон);
			
		ИначеЕсли ЗначениеЗаполнено(ФИООбращения) Тогда
			
			УсловияПоиска.Добавить(КэшПоиска.ФИО);
			ДобавитьПолеПоискаПоПараметру("ФИО", КэшЗаполнения.ФИО);
			
		КонецЕсли;
		
	// +Рарус alexpr
	//ИначеЕсли Параметры.Свойство("СообщениеМессенджера") Тогда
	//	
	//	Обращение = Параметры.СообщениеМессенджера;
	//	Попытка
	//		Элементы.ИДАккаунта.Заголовок = Обращение.УчетнаяЗапись.ТипМессенджера;
	//	Исключение
	//		Элементы.ИДАккаунта.Заголовок = НСтр("ru='Не определен';en='Not Stated'");
	//	КонецПопытки;
	//	
	//	ФИООбращения = Обращение.КонтактПредставление;
	//	Если CRM_РаботаСМессенджерамиСерверПовтИсп.ТипКИМессенджера(Обращение.УчетнаяЗапись) = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
	//		ТелефонОбращения = CRM_РаботаСМессенджерамиСерверПовтИсп.ПредставлениеКонтактнойИнформацииПользователя(Обращение.УчетнаяЗапись, Обращение.ID_Пользователя);
	//		СформироватьКэши("", "", ТелефонОбращения, "", "");
	//		УсловияПоиска.Добавить(КэшПоиска.Телефон);
	//		ДобавитьПолеПоискаПоПараметру("Телефон", ТелефонОбращения);
	//	Иначе
	//		URLОбращения = CRM_РаботаСМессенджерамиСерверПовтИсп.ПредставлениеКонтактнойИнформацииПользователя(Обращение.УчетнаяЗапись, Обращение.ID_Пользователя);
	//		СформироватьКэши(ФИООбращения, "", "", "", URLОбращения);
	//		УсловияПоиска.Добавить(КэшПоиска.URL);
	//		ДобавитьПолеПоискаПоПараметру("URL", КэшЗаполнения.URL);
	//	КонецЕсли;
	ИначеЕсли Параметры.Свойство("СообщениеМессенджера") Или Параметры.Свойство("Диалог") Тогда
		
		Если Параметры.Свойство("СообщениеМессенджера") Тогда
			Обращение = Параметры.СообщениеМессенджера.Диалог;
		Иначе
			Обращение = Параметры.Диалог;
		КонецЕсли;
		Попытка
			Элементы.ИДАккаунта.Заголовок = Обращение.УчетнаяЗапись.ТипМессенджера;
		Исключение
			Элементы.ИДАккаунта.Заголовок = НСтр("ru='Не определен';en='Not Stated'");
		КонецПопытки;
		
		ФИООбращения = Обращение.КонтактПредставление;
		Если CRM_РаботаСМессенджерамиСерверПовтИсп.ТипКИМессенджера(Обращение.УчетнаяЗапись) = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ТелефонОбращения = CRM_РаботаСМессенджерамиСерверПовтИсп.ПредставлениеКонтактнойИнформацииПользователя(Обращение.УчетнаяЗапись,
				 Обращение.ID_Пользователя);
			СформироватьКэши("", "", ТелефонОбращения, "", "");
			УсловияПоиска.Добавить(КэшПоиска.Телефон);
			ДобавитьПолеПоискаПоПараметру("Телефон", ТелефонОбращения);
		Иначе
			URLОбращения = CRM_РаботаСМессенджерамиСерверПовтИсп.ПредставлениеКонтактнойИнформацииПользователя(Обращение.УчетнаяЗапись,
				 Обращение.ID_Пользователя);
			СформироватьКэши(ФИООбращения, "", "", "", URLОбращения);
			УсловияПоиска.Добавить(КэшПоиска.URL);
			ДобавитьПолеПоискаПоПараметру("URL", КэшЗаполнения.URL);
		КонецЕсли;
		
	// -Рарус alexpr
		
	ИначеЕсли Параметры.Свойство("Заявка") Тогда
		
		Обращение = Параметры.Заявка;
		Тема = Обращение.Тема;
		
		Содержание = Обращение.Комментарий;
		
		ФИООбращения = Обращение.Наименование;
		ОрганизацияОбращения = Обращение.Организация;
		ТелефонОбращения = Обращение.Телефон;
		EmailОбращения = Обращение.ЭлектроннаяПочта;
		
		СформироватьКэши(ФИООбращения, ОрганизацияОбращения, ТелефонОбращения, EmailОбращения, "");
		
		Если ЗначениеЗаполнено(КэшПоиска.Телефон) Тогда
			УсловияПоиска.Добавить(КэшПоиска.Телефон);
		КонецЕсли;
		Если ЗначениеЗаполнено(КэшПоиска.Email) Тогда
			УсловияПоиска.Добавить(КэшПоиска.Email);
		КонецЕсли;
		ДобавитьПолеПоискаПоПараметру("Телефон", ТелефонОбращения);
		ДобавитьПолеПоискаПоПараметру("Email", КэшЗаполнения.Email);
		
		Канал = Обращение.КаналПервичногоИнтереса;
		Источник = Обращение.ИсточникПервичногоИнтереса;
		
	ИначеЕсли Параметры.Свойство("Взаимодействие") Тогда

		Обращение = Параметры.Взаимодействие;
		Тема = Параметры.ДанныеВзаимодействия.Тема;
		
		СформироватьКэши("", "", "", "", "");

		Если ЗначениеЗаполнено(Параметры.ДанныеВзаимодействия.Партнер) Тогда
			
			ЗаполнитьРезультатыПоискаПоПараметру("Клиент", Параметры.ДанныеВзаимодействия.Партнер);
			ОпределенКлиент = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(Параметры.ДанныеВзаимодействия.КонтактноеЛицо) Тогда
			
			ЗаполнитьРезультатыПоискаПоПараметру("Контакт", Параметры.ДанныеВзаимодействия.КонтактноеЛицо);
			ОпределенКлиент = Истина;

		ИначеЕсли ЗначениеЗаполнено(Параметры.ДанныеВзаимодействия.ПотенциальныйКлиент) Тогда
			
			ЗаполнитьРезультатыПоискаПоПараметру("Клиент", Параметры.ДанныеВзаимодействия.Партнер);
			ОпределенКлиент = Истина;
			
		КонецЕсли;

	ИначеЕсли Параметры.Свойство("ТелефонныйЗвонок") Тогда
		
		Обращение = Параметры.ТелефонныйЗвонок;
		
		Содержание = Обращение.Комментарий;
		
		ТелефонОбращения = "";
		Параметры.Свойство("НомерТелефона", ТелефонОбращения);
		
		СформироватьКэши("", "", ТелефонОбращения, "", "");
		
		УсловияПоиска.Добавить(КэшПоиска.Телефон);
		ДобавитьПолеПоискаПоПараметру("Телефон", ТелефонОбращения);
		
		Если Параметры.Свойство("сфпСтруктураВнешнихДанных") Тогда
			ДанныеCoMagic = РазобратьДанныеCoMagic(Параметры.сфпСтруктураВнешнихДанных);
			Содержание = Содержание + ?(ЗначениеЗаполнено(Содержание), Символы.ПС, "") + ДанныеCoMagic.Текст;
			Канал = ДанныеCoMagic.Канал;
			Источник = ДанныеCoMagic.Источник;
			
		Иначе
			НаборЗаписейИсточники = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
			НаборЗаписейИсточники.Отбор.Сделка.Установить(Обращение);
			НаборЗаписейИсточники.Прочитать();
			Если НаборЗаписейИсточники.Количество() > 0 Тогда
				Канал = НаборЗаписейИсточники[0].КаналПервичногоИнтереса;
				Источник = НаборЗаписейИсточники[0].ИсточникПервичногоИнтереса;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("Партнер") Тогда
		
		ДоступныКарты = Ложь;
		ДоступноОбращение = Ложь;
		
		Если ЗначениеЗаполнено(Параметры.Партнер) Тогда
			ЗаполнитьРезультатыПоискаПоПараметру("Клиент", Параметры.Партнер);
			ОпределенКлиент = Истина;
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("Основание") Тогда
		Обращение = Параметры.Основание;
		Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.CRM_Интерес") Тогда	
		
			УстановитьЗначениеТипУслуги(Обращение.ТипУслуги);
			СценарийПродажи = Обращение.СостояниеИнтереса.Родитель;
			
			ДоступныКарты = Ложь;
			ДоступноОбращение = Ложь;
			
			ЗаполнитьРезультатыПоискаПоПараметру("Интерес", Обращение);
			
			ОпределенКлиент = Истина;
		ИначеЕсли ТипЗнч(Параметры.Основание) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			СформироватьКэши("", "", "", "", "");

			Если ЗначениеЗаполнено(Параметры.Основание.CRM_КонтактноеЛицо) Тогда
				
				ЗаполнитьРезультатыПоискаПоПараметру("Контакт", Параметры.Основание.CRM_КонтактноеЛицо);
				ОпределенКлиент = Истина;

			ИначеЕсли ЗначениеЗаполнено(Параметры.Основание.CRM_Партнер) Тогда
				
				ЗаполнитьРезультатыПоискаПоПараметру("Клиент", Параметры.Основание.CRM_Партнер);
				ОпределенКлиент = Истина;
				
			ИначеЕсли ЗначениеЗаполнено(Параметры.Основание.БизнесПроцесс) И ЗначениеЗаполнено(Параметры.Основание.БизнесПроцесс.КонтактноеЛицо) Тогда	
				
				ЗаполнитьРезультатыПоискаПоПараметру("Контакт", Параметры.Основание.БизнесПроцесс.КонтактноеЛицо);
				ОпределенКлиент = Истина;

			ИначеЕсли ЗначениеЗаполнено(Параметры.Основание.БизнесПроцесс) И ЗначениеЗаполнено(Параметры.Основание.БизнесПроцесс.Партнер) Тогда	
				
				ЗаполнитьРезультатыПоискаПоПараметру("Клиент", Параметры.Основание.БизнесПроцесс.Партнер);
				ОпределенКлиент = Истина;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ДоступноОбращение") Тогда
		ДоступноОбращение = Параметры.ДоступноОбращение;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипУслуги") Тогда
		УстановитьЗначениеТипУслуги(Параметры.ТипУслуги);
		Если Параметры.Свойство("НеОбновлятьТипУслуги") Тогда
			НеОбновлятьТипУслуги = Параметры.НеОбновлятьТипУслуги;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Сценарий") Тогда
		СценарийПродажи = Параметры.Сценарий;
		Если ИспользоватьТипыУслуг Тогда
			Если ТипЗнч(СценарийПродажи) = Тип("СправочникСсылка.CRM_СостоянияИнтересов")
				И НЕ ЗначениеЗаполнено(ТипУслуги) Тогда
				Если СценарийПродажи.ТипыУслуг.Количество() = 1 Тогда
					ТипУслуги = СценарийПродажи.ТипыУслуг[0].ТипУслуги;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФормуПоКаналу();
	
	// Проверка возможности отклонить лид.
	ЭтоЛид = Ложь;
	Если ЗначениеЗаполнено(Обращение) Тогда
		ЭтоЛид = РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(Обращение);
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		ЭтоЛид = Истина;
	КонецЕсли;
	Элементы.Отклонить.Видимость = ЭтоЛид;
	
	// Заполнение состояния лида+
	Если ЗначениеЗаполнено(Обращение) Тогда
		Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Обращение) Тогда
			СтруктураСостоянияЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Обращение);
			Если СтруктураСостоянияЛида = Неопределено
				ИЛИ СтруктураСостоянияЛида.Состояние = Справочники.CRM_СостоянияЛидов.Новый Тогда
				Элементы.ГруппаОбращение.Видимость = Ложь;
			Иначе
				Элементы.ГруппаОбращение.Видимость = Истина;
				
				Обращение_Состояние = СтруктураСостоянияЛида.Состояние;
				Если Обращение_Состояние = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
					Обращение_ПричинаОтклонения = СтруктураСостоянияЛида.ПричинаОтклонения;
					Обращение_КомментарийСостояния = СтруктураСостоянияЛида.Комментарий;
				Иначе
					Обращение_СконвертированВОбъект = СтруктураСостоянияЛида.СконвертированВОбъект;
					Элементы.Обращение_ПричинаОтклонения.Видимость = Ложь;
					Элементы.Обращение_КомментарийСостояния.Видимость = Ложь;
				КонецЕсли;
				
				Элементы.Обращение_СконвертированВОбъект.Видимость = ЗначениеЗаполнено(Обращение_СконвертированВОбъект);
				ОбновитьДанныеОбработкиОбращения(СтруктураСостоянияЛида.ДатаОбработки, СтруктураСостоянияЛида.ОтветственныйЗаОбработку);
				
			КонецЕсли;
		Иначе
			Элементы.ГруппаОбращение.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	// Заполнение состояния лида-
	
	ТекстЗаголовка = ЗаголовокОбращения(Обращение);
	Если ЗначениеЗаполнено(ТекстЗаголовка) Тогда
		Элементы.ДекорацияЗаголовокОбращение.Заголовок = ТекстЗаголовка;
	КонецЕсли;
		
	Если Не ДоступноОбращение Тогда
		Элементы.ГруппаСвязатьСИнтересом.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойОтветственный");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ТекущийПользователь;
	КонецЕсли;
	ОсновнаяОрганизация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация", Ответственный);
	Проект = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойПроект", Ответственный);
	
	Если Не ЗначениеЗаполнено(ТипУслуги) Тогда
		УстановитьЗначениеТипУслуги(ПолучитьТипУслугиПользователя(Ответственный, Истина));
	КонецЕсли;
	//Если Не ЗначениеЗаполнено(ТипУслуги) Тогда
	//	УстановитьЗначениеТипУслуги(Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги);
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипОбращения) Тогда
		УстановитьЗначениеТипОбращения(ПолучитьТипОбращенияПользователя(Ответственный, Истина));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТипОбращения) Тогда
		Если ИсточникОткрытияМастера = CRM_МетодыФормОбработокСервер.МастерОткрытИзОбращений() Тогда
			УстановитьЗначениеТипОбращения(Справочники.CRM_ТипыОбращений.Обращение);
		Иначе
			УстановитьЗначениеТипОбращения(Справочники.CRM_ТипыОбращений.Интерес);
		КонецЕсли;
	КонецЕсли;
	
	ЭтоПоддержка = ЗначениеЗаполнено(ТипОбращения) И ТипОбращения <> ПредопределенноеЗначение("Справочник.CRM_ТипыОбращений.Интерес")
					ИЛИ НЕ ЗначениеЗаполнено(ТипОбращения) И ИсточникОткрытияМастера = CRM_МетодыФормОбработокСервер.МастерОткрытИзОбращений();
	
	Если ЭтоПоддержка Тогда
		Элементы.СоздатьНовыйИнтерес.Заголовок = НСтр("ru = 'Создать обращение'");
	КонецЕсли;
	Элементы.ГруппаУровеньПоддержки.Видимость = ЭтоПоддержка;
	

	ОбновитьЗаголовок();
	
	// +Модели машинного обучения
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьМоделиМашинногоОбучения") Тогда
		Помощник_Использовать = Помощник_ПроверитьИспользование();
		Если Помощник_Использовать Тогда
			Элементы.ГруппаПомощник.Видимость = Истина;
			Помощник_ОбновитьСостояние();
		КонецЕсли;
	КонецЕсли;
	// -Модели машинного обучения
	
	ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
	Если ОпределенКлиент Тогда
		ЗаблокироватьСтрокуПоиска();
		НастроитьФормуПослеПоиска();
	Иначе
		ВыполнитьПоискНаСервере(УсловияПоиска);
	КонецЕсли;
	
	Если Метаданные.ОбщиеМодули.Найти("CRM_Модуль_РаботаСКонтрагентами") <> Неопределено Тогда
		CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСКонтрагентами");
		CRM_Модуль.ДополнитьРеквизитыФормыДляСозданияКонтрагента(ЭтотОбъект);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		
		МассивОбъектовСДопРеквизитами = Новый Массив;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРеквизитовКлиента");
		ДополнительныеПараметры.Вставить("Объект", Клиент);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРеквизитовКонтакта");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", ТемпКонтакт);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРекизитовПК");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", ТемпПотенциальныйКлиент);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ТемпИнтерес.ТипОбращения = ТипОбращения;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДопРеквизитыИнтереса");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", ТемпИнтерес);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ДополнительныеПараметры.Вставить("МассивОбъектов", МассивОбъектовСДопРеквизитами);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("CRM_УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
		
		РазложитьДопРеквизитыПоКолонкам(МассивОбъектовСДопРеквизитами);
		
		Элемент = Элементы.Найти("РедактироватьСоставДополнительныхРеквизитов");
		Если Элемент<>Неопределено Тогда
			Элемент.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПроверяемыеРеквизитыИнтереса();
	ИзменитьСоставРеквизитов();
	ОбновитьОжидаемуюДатуПродажи();
	
	НастроитьРолевуюАдресацию(ЭтотОбъект, РолеваяАдресацияРазрешена(СценарийПродажи));
	
	РежимВводаНовогоКлиента = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.РежимВводаНовогоКлиента", "МастерРегистрации", 1);
	
	ОткрыватьИнтерес = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.ОткрыватьИнтерес", "МастерРегистрации", Ложь);
	ОткрыватьИнтересОбращение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.ОткрыватьИнтересОбращение", "МастерРегистрации", Ложь);
	СоздаватьЗадачуПриСвязывании = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.СоздаватьЗадачуПриСвязывании", "МастерРегистрации", Истина);
	
	CRM_РазрешитьСозданиеИнтересаБезКЛ = (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("CRM_РазрешитьСозданиеИнтересаБезКЛ"));
	
	Клиент_Объект.CRM_СтатусРаботы = Справочники.CRM_СтатусыРаботыСКлиентом.Работаем;
	
	ВыбранныеТипы = Новый Массив;
	
	ОсновнойТипОтношенийСКлиентом = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойТипОтношенийСКлиентом");
	Если ЗначениеЗаполнено(ОсновнойТипОтношенийСКлиентом) Тогда
		ВыбранныеТипы.Добавить(ОсновнойТипОтношенийСКлиентом);
	Иначе
		ВыбранныеТипы.Добавить(Справочники.CRM_ТипыОтношений.Покупатель);
	КонецЕсли;
	
	Справочники.CRM_ТипыОтношений.ЗаполнитьСписокОтношений(CRM_ВсеТипыОтношений, ВыбранныеТипы);
	
	// +CRM_Модуль
	//МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступом");
	//Если МодульУправлениеДоступом <> Неопределено Тогда
	//	Если МодульУправлениеДоступом.ИспользоватьОграниченияДоступа() Тогда
	//		ВключеныОграниченияДоступа = Не Пользователи.ЭтоПолноправныйПользователь();
	//	КонецЕсли;
	//КонецЕсли;
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		Если МодульУправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() Тогда
			ВключеныОграниченияДоступа = Не Пользователи.ЭтоПолноправныйПользователь();
		КонецЕсли;
	КонецЕсли;
	// -CRM_Модуль
	
	ДоступноИзменениеПартнеров = ПравоДоступа("Редактирование", Метаданные.Справочники.Партнеры);	
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CRM_ЗаписатьВсеТипыОтношений();
	СформироватьТипОтношенийПредставление();
	
	// +СофтФон
	Если сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Ложь) Тогда
		сфпВерсияПанели = сфпСофтФонПроКлиент.сфпПолучитьВерсиюПанели();
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(сфпВерсияПанели,"3.0.3.120") >= 0 Тогда
			сфпВиднаКолонкаСтатусов = Истина;
		Иначе
			сфпВиднаКолонкаСтатусов = Ложь;
			Элементы.сфпСтатус.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	сфпВидимостьИДоступностьГруппыСофтфон();
	// -СофтФон
	
	Элементы.СоздатьКлиента.Видимость = ДоступноИзменениеПартнеров;
	
	// Переключение интерфейса ввода на Клиента
	Если ДоступноИзменениеПартнеров И РежимВводаНовогоКлиента = 0 Тогда
		СоздатьКлиента(Неопределено);
	КонецЕсли;
	
	ОбрабатыватьАктивизациюПоиска = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура);
		ТекстВопроса = НСтр("ru='Введенные данные будут потеряны. Закрыть?';en='Input data will be lost. Close?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	Иначе	
		Оповестить("ОбновитьАРМ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") 
			И (ИсточникВыбора.ИмяФормы = "ОбщаяФорма.CRM_ПодборПользователейПоТипуУслуги" ИЛИ ИсточникВыбора.ИмяФормы = "Справочник.РолиИсполнителей.Форма.ФормаВыбора") Тогда
		
		ВыбранПользователь = (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи"));
			
		Если ЗначениеЗаполнено(ВыбранноеЗначение) 
			И (ВыбранПользователь ИЛИ ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.РолиИсполнителей")) Тогда
		
			ОбрабатыватьАктивизациюПоиска = Ложь;
			Ответственный = ВыбранноеЗначение;
			
			Если ВыбранПользователь Тогда
			
				ТипУслугиОтв = ПолучитьТипУслугиПользователя(Ответственный);
				Если ЗначениеЗаполнено(ТипУслугиОтв) Тогда
					УстановитьЗначениеТипУслуги(ТипУслугиОтв);
				КонецЕсли;
				
				ОбновитьТипОбращения(Ответственный);
				
			КонецЕсли;
			
			ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
			ЗаполнитьПроверяемыеРеквизитыИнтереса();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, ИсточникОповещения)
	
	Если (ИмяСобытия = "ЗаполнитьОснованиеОбращения") И (ТипЗнч(Параметр) = Тип("ДокументСсылка.ТелефонныйЗвонок")) И (Обращение = Параметр) Тогда
		сфпВидимостьИДоступностьГруппыСофтфон();
	КонецЕсли;
	
	Если ИмяСобытия = "НовыйПотенциальныйКлиентЗаписан" Тогда
		Если Параметр = ПотенциальныйКлиентПриАктивизацииСтроки Тогда
			Если ВыполнитьПоискНаСервереПоДаннымПК() Тогда
				НастроитьЗаполнитьПоНайденнымДанным();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// +Софтфон
	Если (ИмяСобытия = "СофтФон_КонецРазговора") И (Параметр.Звонок = Обращение) Тогда		
		
		ТекущийЭлемент = Элементы.сфпПодтвердитьПеревод;
		
		Если Элементы.сфпПереводЗвонка.Видимость Тогда
			Элементы.сфпПереводЗвонка.Доступность = Ложь;
		КонецЕсли;
		Если Элементы.сфпПодтвердитьПеревод.Доступность Тогда
			Элементы.сфпПодтвердитьПеревод.Доступность = Ложь;
		КонецЕсли;
		Элементы.сфпУдержатьЗвонок.Доступность = Ложь;
		сфпУдержаниеЗвонка = Ложь;
	ИначеЕсли ИмяСобытия = "сфпПерезаполнитьСтатусыЛиний" Тогда		
		Если ЗначениеЗаполнено(сфпНомерПеревода) Тогда
			Если сфпВиднаКолонкаСтатусов И сфпСофтФонПроКлиент.сфпИспользуетсяОбработчикOnLinesStatus() Тогда
				СтатусЛинии = сфпСоответствиеЛинийИСтатусов.Получить(сфпНомерПеревода);
				сфпСтатус = сфпКартинкаСтатуса(СтатусЛинии);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли (ИмяСобытия = "Софтфон_CoMagic") И Параметр.Свойство("Звонок") Тогда
		Если Параметр.Звонок = Обращение Тогда
			// Заполняем документ данными из CoMagic
			ДанныеCoMagic = РазобратьДанныеCoMagic(Параметр.СтруктураCoMagic);
			Содержание = Содержание + ?(ЗначениеЗаполнено(Содержание), Символы.ПС, "") + ДанныеCoMagic.Текст;
			Канал = ДанныеCoMagic.Канал;
			Источник = ДанныеCoMagic.Источник;
			НастроитьФормуПоКаналу();
			УстановитьВидимостьКарточкиCoMagic();
		КонецЕсли;
	КонецЕсли;
	// -Софтфон
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если РежимПроверкиЗаполнения = "СозданиеКлиентаКонтакта" Тогда
		ПроверяемыеРеквизиты.Очистить();
	КонецЕсли;
	
	Если Не Клиент.Пустая() Тогда
		Если Клиент.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания И Элементы.ГруппаКонтакт.Видимость Тогда
			Если НЕ CRM_РазрешитьСозданиеИнтересаБезКЛ Тогда
				ПроверяемыеРеквизиты.Добавить("Контакт");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если РежимПроверкиЗаполнения = "СозданиеПотенциальногоКлиента" Тогда
		
		ПроверяемыеРеквизиты.Добавить("ФИО");
		ДополнительныеПроверяемыеРеквизиты = Неопределено;
		
	ИначеЕсли РежимПроверкиЗаполнения = "ЗапускБизнесПроцесса" Тогда
		
		ПроверяемыеРеквизиты.Добавить("СценарийПродажи");
		ДополнительныеПроверяемыеРеквизиты = Неопределено;
		
	ИначеЕсли РежимПроверкиЗаполнения = "СозданиеИнтереса"
		ИЛИ РежимПроверкиЗаполнения = "СозданиеКлиентаКонтакта" Тогда
		
		Если РежимПроверкиЗаполнения = "СозданиеИнтереса" Тогда
		
			ПроверяемыеРеквизиты.Добавить("СценарийПродажи");
			Если ПолучитьФункциональнуюОпциюФормы("CRM_ИспользоватьТипыУслуг") Тогда
				ПроверяемыеРеквизиты.Добавить("ТипУслуги");
			КонецЕсли;
			Если Константы.CRM_ЗаполнятьПервичныйИнтерес.Получить() Тогда
				ПроверяемыеРеквизиты.Добавить("Канал");
			КонецЕсли;
			
		КонецЕсли;
		
		ДополнительныеПоля = Новый Массив;
		
		Если (Элементы.ГруппаРеквизитыКлиента.Видимость ИЛИ Элементы.ГруппаРеквизитыКонтакта.Видимость) 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ПоискДублей_НайденыДубли") 
			И НЕ РольДоступна("ПолныеПрава") Тогда
			
			Если ЭтотОбъект["ПоискДублей_НайденыДублиКлиенты"] 
				И Константы.CRM_ЗапретитьВводНовогоКлиентаПриНайденныхСовпадениях.Получить() Тогда
				
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Найдены дубли клиента!
					|Необходимо обратиться к администратору базы для предоставления прав доступа к имеющемуся контакту. '"),,,, Отказ);
			КонецЕсли;
			Если ЭтотОбъект["ПоискДублей_НайденыДублиКонтакты"] 
				И Константы.CRM_ЗапретитьВводНовогоКонтактаПриНайденныхСовпадениях.Получить() Тогда
				
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Найдены дубли контактного лица!
					|Необходимо обратиться к администратору базы для предоставления прав доступа к имеющемуся контакту. '"),,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Элементы.ГруппаРеквизитыКлиента.Видимость Тогда
			Если НЕ ЗначениеЗаполнено(Клиент_Объект.Наименование) Тогда
				ТекстСообщения = НСтр("ru='Не заполнено наименование клиента'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Клиент_Объект.Наименование",, Отказ);
			КонецЕсли;
			Если Клиент_Объект.ЮрФизЛицо <> Перечисления.КомпанияЧастноеЛицо.Компания Тогда
				ДополнительныеПоля.Добавить("Клиент_Телефон");
				ДополнительныеПоля.Добавить("Клиент_Email");
				Если Элементы.Клиент_МобТелефон.Видимость Тогда
					ДополнительныеПоля.Добавить("Клиент_МобТелефон");
				КонецЕсли;
			КонецЕсли;
			Если Метаданные.ОбщиеМодули.Найти("CRM_Модуль_РаботаСКонтрагентами") <> Неопределено Тогда
				CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСКонтрагентами");
				CRM_Модуль.ПроверитьЗаполнениеКонтрагента(ЭтотОбъект, Отказ);
			КонецЕсли;
		КонецЕсли;
		Если Элементы.ГруппаРеквизитыКонтакта.Видимость Тогда
			Если НЕ CRM_РазрешитьСозданиеИнтересаБезКЛ Тогда
				
				ЮрЛицо = Истина;
				Если ЗначениеЗаполнено(Клиент) Тогда
					ЮрЛицо = (Клиент.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания);
				Иначе
					ЮрЛицо = (Клиент_Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Контакт_ФИО) И ЮрЛицо Тогда
					ТекстСообщения = НСтр("ru='Не заполнено наименование контакта'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ФИО",, Отказ);
				КонецЕсли;
				
				ПроверятьЗаполнениеКИ = ЗначениеЗаполнено(Контакт_ФИО)
										ИЛИ ЮрЛицо;
				
				Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("CRM_РазрешитьСохранениеКЛБезКИ")
					И ПроверятьЗаполнениеКИ Тогда
					ДополнительныеПоля.Добавить("Почта");
					ДополнительныеПоля.Добавить("Телефон");
					Если Элементы.ИДАккаунта.Видимость Тогда
						ДополнительныеПоля.Добавить("ИДАккаунта");
					КонецЕсли;
					Если ПоказыватьМобильныйТелефон Тогда
						ДополнительныеПоля.Добавить("НомерМобильногоТелефона");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		Если Элементы.ГруппаФИО.Видимость Тогда
			Если Элементы.ФИО.Видимость Тогда
				ПроверяемыеРеквизиты.Добавить("ФИО");
			КонецЕсли;
			ДополнительныеПоля.Добавить("Почта1");
			ДополнительныеПоля.Добавить("Телефон1");
			Если Элементы.ИДАккаунта.Видимость Тогда
				ДополнительныеПоля.Добавить("ИДАккаунта");
			КонецЕсли;
			Если ПоказыватьМобильныйТелефон Тогда
				ДополнительныеПоля.Добавить("НомерМобильногоТелефона");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		РежимПроверкиЗаполнения = "";
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеПоля <> Неопределено
		И НЕ ЗначениеЗаполнено(ПотенциальныйКлиент)
		И (НЕ ЗначениеЗаполнено(Клиент) ИЛИ НЕ Элементы.ГруппаКонтакт.Видимость) Тогда
		
		НетЗаполненных = Истина;
		Для Каждого Поле Из ДополнительныеПоля Цикл
			Если ЗначениеЗаполнено(ЭтотОбъект[Элементы[Поле].ПутьКДанным]) Тогда
				НетЗаполненных = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НетЗаполненных Тогда
			Для Каждого Поле Из ДополнительныеПоля Цикл
				Если Элементы[Поле].Видимость Тогда
					ТекстСообщения = НСтр("ru='Не заполнена контактная информация';en='Contact information not filled'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Элементы[Поле].ПутьКДанным,, Отказ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимПроверкиЗаполнения <> "СозданиеКлиентаКонтакта" Тогда
	
		Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") И Элементы.Источник.АвтоОтметкаНезаполненного = Истина Тогда
			ПроверяемыеРеквизиты.Добавить("Источник");
		КонецЕсли;
		
		Если НЕ РолеваяАдресацияРазрешена(СценарийПродажи) И ТипЗнч(Ответственный) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			
			ШаблонСообщения = НСтр("ru = 'Для первого состояния сценария %1 не разрешена ролевая адресация'");
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СценарийПродажи),, "Ответственный",, Отказ);
			
		КонецЕсли; 
	//++ #1398 смарт: Фролов 24.08.2023 //Доработать карточку интереса (исправить логику)  
	ИначеЕсли Не Пользователи.ЭтоПолноправныйПользователь() Тогда	
		ПроверяемыеРеквизиты.Добавить("Клиент_Телефон");
		ПроверяемыеРеквизиты.Добавить("Клиент_Email");
		ПроверяемыеРеквизиты.Добавить("Содержание");
		ПроверяемыеРеквизиты.Добавить("Контакт_ФИО");
		ПроверяемыеРеквизиты.Добавить("Контакт_Email");
		ПроверяемыеРеквизиты.Добавить("Контакт_Телефон");
		ПроверяемыеРеквизиты.Добавить("НомерМобильногоТелефона"); 
	//-- #1398 смарт: Фролов 25.08.2023	
	КонецЕсли;
	
	РежимПроверкиЗаполнения = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	ВыполнитьПоиск(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СпособыПоиска = Новый СписокЗначений;
	СпособыПоиска.Добавить(0, НСтр("ru = 'По началу строки'"));
	СпособыПоиска.Добавить(1, НСтр("ru = 'По части строки'"));
	СпособыПоиска.Добавить(2, НСтр("ru = 'По точному совпадению'"));
	
	НайденныйЭлемент = СпособыПоиска.НайтиПоЗначению(СпособПоиска);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Пометка = Истина;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СтрокаПоискаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	ПоказатьВыборИзМеню(ОповещениеЗавершения, СпособыПоиска, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособПоиска <> ВыбранныйЭлемент.Значение Тогда
		СпособПоиска = ВыбранныйЭлемент.Значение;
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.СпособПоиска", "МастерРегистрации", СпособПоиска);
		ВыполнитьПоиск(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура сфпКарточкаCoMagic(Команда)
	
	СтруктураПоиска = Новый Структура("Звонок,Партнер,КонтактноеЛицо", Обращение, Клиент, Контакт);
	сфпСофтФонПроКлиентПереопределяемый.сфпОбработкаКомандыКарточкаCoMagic(СтруктураПоиска);

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ДанныеСобытия.href) Тогда
		Попытка
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.href);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаголовокОбращениеНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		ПоказатьЗначение(, Обращение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаналНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",		Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока",	Канал);
	ОткрытьФорму("ПланВидовХарактеристик.КаналыРекламныхВоздействий.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КаналПриИзменении(Элемент)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	НастроитьФормуПоКаналу();
	УстановитьВидимостьКарточкиCoMagic();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Канал) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипПВХ(Канал) = Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",		Истина);
		ПараметрыФормы.Вставить("ТекущаяСтрока",	Источник);
		ПараметрыФормы.Вставить("СкрытьПодменюВид",	Истина);
		ФормаВыбора = ПолучитьФорму("Справочник.МаркетинговыеМероприятия.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
		ЭлементОтбора					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Завершено");
		ЭлементОтбора.ПравоеЗначение	= Истина;
		ЭлементОтбора.Использование		= Истина;
		
		ГруппаОтбора					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы			= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ЭлементОтбора					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ДатаОкончания");
		ЭлементОтбора.ПравоеЗначение	= Дата("00010101");
		ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("CRM_ДатаАктуальности");
		ЭлементОтбора.ПравоеЗначение	= НачалоДня(ТекущаяДата());
		ЭлементОтбора.Использование		= Истина;
		ФормаВыбора.Открыть();
		
	ИначеЕсли ТипПВХ(Канал) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		
		СтандартнаяОбработка	= Ложь;
		ДополнительныеПараметры	= Новый Структура("Элемент", Элемент);
		ОписаниеВыбораПартнера	= Новый ОписаниеОповещения("ОбработкаВыбораПартнераИсточника", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыФормы			= Новый Структура;
		Если ЗначениеЗаполнено(Источник) И (ТипЗнч(Источник) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")) Тогда
			ПараметрыФормы.Вставить("ТекущаяСтрока", CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Источник, "Владелец"));
		КонецЕсли;	
		ОткрытьФорму("Справочник.Партнеры.ФормаВыбора", ПараметрыФормы, Элемент, , ВариантОткрытияОкна.ОтдельноеОкно, , ОписаниеВыбораПартнера);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотенциальныйКлиентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПотенциальныйКлиентОткрытиеЗавершение", ЭтотОбъект, Новый Структура);
		ПоказатьЗначение(ОповещениеЗавершения, ПотенциальныйКлиент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотенциальныйКлиентОткрытиеЗавершение(ДополнительныеПараметры) Экспорт
	
	Организация = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ПотенциальныйКлиент, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбращенияПриИзменении(Элемент)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	ЭтоПоддержка = (ТипОбращения <> ПредопределенноеЗначение("Справочник.CRM_ТипыОбращений.Интерес"));
	Элементы.ГруппаУровеньПоддержки.Видимость = ЭтоПоддержка;
	Если ЭтоПоддержка Тогда
		Элементы.СоздатьНовыйИнтерес.Заголовок = НСтр("ru = 'Создать обращение'");
	Иначе
		Элементы.СоздатьНовыйИнтерес.Заголовок = НСтр("ru = 'Создать интерес'");
	КонецЕсли;
	ОпределитьУровеньПоддержки();
	ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
	ЗаполнитьПроверяемыеРеквизитыИнтереса();
	ОбновитьЭлементыДополнительныхРеквизитов();
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипУслугиПриИзменении(Элемент)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	ОпределитьУровеньПоддержки();
	ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
	ЗаполнитьПроверяемыеРеквизитыИнтереса();
	ОбновитьЭлементыДополнительныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПродажиПриИзменении(Элемент)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	НастроитьФормуПоСценариюПродаж(ЭтотОбъект);
	
	СценарийПродажиПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура СценарийПродажиПриИзмененииСервер()
	
	ЗаполнитьПроверяемыеРеквизитыИнтереса();
	ОбновитьЭлементыДополнительныхРеквизитов();
	ОбновитьОжидаемуюДатуПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если Ответственный = Неопределено Тогда
		Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	ВыбранПользователь = (ТипЗнч(Ответственный) = Тип("СправочникСсылка.Пользователи"));
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	Если ВыбранПользователь Тогда
		
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойОтветственный");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = ТекущийПользователь;
		КонецЕсли;
		ОсновнаяОрганизация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация", Ответственный);
		
		ТемпПроект = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойПроект", Ответственный);
		Если ЗначениеЗаполнено(ТемпПроект) Тогда
			Проект = ТемпПроект;
		КонецЕсли;
		
	КонецЕсли;
		
	ОпределитьУровеньПоддержки();
		
	Если ВыбранПользователь Тогда
		
		ТипУслугиОтв = ПолучитьТипУслугиПользователя(Ответственный);
		Если ЗначениеЗаполнено(ТипУслугиОтв) Тогда
			УстановитьЗначениеТипУслуги(ТипУслугиОтв);
		КонецЕсли;	
		
		ОбновитьТипОбращения(Ответственный);
	
	КонецЕсли;
	
	ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
	ЗаполнитьПроверяемыеРеквизитыИнтереса();
	ОбновитьЭлементыДополнительныхРеквизитов();
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	сфпВидимостьИДоступностьГруппыСофтфон();
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
	
	Почта = СокрЛП(Почта);
	Ошибка = CRM_ОбщегоНазначенияКлиентСервер.АнализАдресаЭП(Почта);
	Если Ошибка.КодОшибки <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка.Сообщение,, "Почта");
	КонецЕсли;
	
	ВыполнитьПоискДублейПоЗначению(Почта, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	Если Элемент.Имя = "Телефон1" Тогда
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
		Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		
		ВыполнитьПоискДублейПоЗначению(Телефон, Элемент,
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Иначе	
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Контакт_Телефон);
		Контакт_Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		
		ВыполнитьПоискДублейПоЗначению(Контакт_Телефон, Элемент,
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерМобильногоТелефонаПриИзменении(Элемент)
	
	СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерМобильногоТелефона);
	НомерМобильногоТелефона = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
	
	ВыполнитьПоискДублейПоЗначению(НомерМобильногоТелефона, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФИО1ПриИзменении(Элемент)
	
	КонтактРедактированиеПредставления = Истина;
	Если Не КонтактПредставлениеВыбраноИзСписка Тогда
		
		ФИО_Темп = Контакт_ФИО;
		ФИО_Темп = СтрЗаменить(ФИО_Темп,",","");
		ФИО_Темп = СтрЗаменить(ФИО_Темп,".","");
		ФИО_Темп = СтрЗаменить(ФИО_Темп,";","");
		
		Если ПустаяСтрока(Контакт_Фамилия) Тогда
		
			ПервоеСлово = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(ФИО_Темп);
			
			Контакт_Фамилия = ПервоеСлово;
			Контакт_Имя = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(ФИО_Темп);
			Контакт_Отчество = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(ФИО_Темп);
			
			Если Не ЗначениеЗаполнено(ПолКонтактногоЛица) Тогда
				ПолКонтактногоЛица = CRM_КлиентыКлиент.ОпределитьПол(Контакт_Имя);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьПоискДублейПоЗначению(ФИО, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	ФИО = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(ФИО);
	МассивФИО = СтрРазделить(ФИО, " ", Ложь);
	Если МассивФИО.Количество()>1 Тогда
		ПолКонтактногоЛица = CRM_КлиентыСервер.ОпределитьПол(МассивФИО[1]);
	КонецЕсли;
	
	ВыполнитьПоискДублейПоЗначению(ФИО, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ФИООкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ФИО = СокрЛП(Текст);
	Если Элемент.Имя = "ФИО1" Тогда
		Контакт_ФИО = ФИО;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаКонтактРедактированиеФИО.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ФИООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КонтактПредставлениеВыбраноИзСписка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СтруктураКЛ = Новый Структура;
	СтруктураКЛ.Вставить("CRM_Фамилия", Контакт_Фамилия);
	СтруктураКЛ.Вставить("CRM_Имя", Контакт_Имя);
	СтруктураКЛ.Вставить("CRM_Отчество", Контакт_Отчество);
	
	МассивПредставлений = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(СтруктураКЛ, Ложь);
	Если МассивПредставлений.Количество() > 0 Тогда
		Если ДанныеВыбора = Неопределено Тогда
			ДанныеВыбора = Новый СписокЗначений();
		КонецЕсли;
		Для Каждого тДанные Из МассивПредставлений Цикл
			ДанныеВыбора.Вставить(0, тДанные, тДанные);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактНаименованиеВыборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не КонтактПредставлениеВыбраноИзСписка Тогда
		
		СтруктураКЛ = Новый Структура;
		СтруктураКЛ.Вставить("CRM_Фамилия", Контакт_Фамилия);
		СтруктураКЛ.Вставить("CRM_Имя", Контакт_Имя);
		СтруктураКЛ.Вставить("CRM_Отчество", Контакт_Отчество);
		
		СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(СтруктураКЛ, Ложь);	
		Элементы.КонтактНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимФильтраПоИнтересамНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьЗаголовокФильтраПоИнтересам();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента,
																		"НетОтбораПоАктивнымИнтересам",
																		НетОтбораПоАктивнымИнтересам(РежимФильтраПоИнтересам),
																		Истина);
	Элементы.ИнтересыКлиентаЗавершен.Видимость = НетОтбораПоАктивнымИнтересам(РежимФильтраПоИнтересам);
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьЗадачуПриСвязыванииПриИзменении(Элемент)
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.СоздаватьЗадачуПриСвязывании", "МастерРегистрации", СоздаватьЗадачуПриСвязывании);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьИнтересПриИзменении(Элемент)
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.ОткрыватьИнтерес", "МастерРегистрации", ОткрыватьИнтерес);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьИнтересОбращениеПриИзменении(Элемент)
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.ОткрыватьИнтересОбращение", "МастерРегистрации", ОткрыватьИнтересОбращение);
	
КонецПроцедуры

&НаКлиенте
Процедура РольКонтактногоЛицаПриИзменении(Элемент)
	РольВИнтересе = РольКонтактногоЛица;
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектCRM_ФамилияПриИзменении(Элемент)
	
	Клиент_ОбъектРедактированиеФИО = Истина;
	Клиент_Объект.CRM_Фамилия = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(Клиент_Объект.CRM_Фамилия);
	Если Клиент_Объект.Ссылка.Пустая() И Не Клиент_ОбъектРедактированиеПредставления Тогда
		
		Если (Не ПустаяСтрока(Клиент_ОбъектТекФамилия) И Клиент_ОбъектТекФамилия <> СокрЛП(Клиент_Объект.CRM_Фамилия)) 
			 Или (ПустаяСтрока(Клиент_Объект.CRM_Фамилия) И Не ПустаяСтрока(Клиент_ОбъектТекФамилия)) Тогда
			
			Клиент_Объект.Наименование = СокрЛП(СтрЗаменить(Клиент_Объект.Наименование, Клиент_ОбъектТекФамилия, СокрЛП(Клиент_Объект.CRM_Фамилия)));
			
		ИначеЕсли ПустаяСтрока(Клиент_Объект.Наименование) Тогда
			
			Клиент_Объект.Наименование = СокрЛП(Клиент_Объект.CRM_Фамилия);
			
		ИначеЕсли Не ПустаяСтрока(Клиент_Объект.CRM_Фамилия) И ПустаяСтрока(Клиент_ОбъектТекФамилия) Тогда
			
			Клиент_Объект.Наименование = СокрЛП((?(ЗначениеЗаполнено(Клиент_Объект.CRM_Фамилия),   СокрЛП(Клиент_Объект.CRM_Фамилия) + " ", "")
										+ ?(ЗначениеЗаполнено(Клиент_Объект.CRM_Имя), 		 СокрЛП(Клиент_Объект.CRM_Имя) + " ", "")
										+ ?(ЗначениеЗаполнено(Клиент_Объект.CRM_Отчество),  СокрЛП(Клиент_Объект.CRM_Отчество), "")));   
			
		КонецЕсли;
		
	КонецЕсли;
	
	Клиент_ОбъектТекФамилия = СокрЛП(Клиент_Объект.CRM_Фамилия);
	
	СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(Клиент_Объект);
	Элементы.Клиент_ОбъектНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	ЗаполнитьПолноеНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектCRM_ИмяПриИзменении(Элемент)
	
	Клиент_ОбъектРедактированиеФИО = Истина;
	Клиент_Объект.CRM_Имя = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(Клиент_Объект.CRM_Имя);
	Если Клиент_Объект.Ссылка.Пустая() И Не Клиент_ОбъектРедактированиеПредставления Тогда
		
		Если (Не ПустаяСтрока(Клиент_ОбъектТекИмя) И Клиент_ОбъектТекФамилия <> СокрЛП(Клиент_Объект.CRM_Имя)) 
			 Или (ПустаяСтрока(Клиент_Объект.CRM_Имя) И Не ПустаяСтрока(Клиент_ОбъектТекИмя)) Тогда
			
			Клиент_Объект.Наименование = СокрЛП(СтрЗаменить(Клиент_Объект.Наименование, Клиент_ОбъектТекИмя, СокрЛП(Клиент_Объект.CRM_Имя)));
			
		ИначеЕсли ПустаяСтрока(Клиент_Объект.Наименование) Тогда
			
			Клиент_Объект.Наименование = СокрЛП(Клиент_Объект.CRM_Имя);
			
		ИначеЕсли Не ПустаяСтрока(Клиент_Объект.CRM_Имя) И ПустаяСтрока(Клиент_ОбъектТекИмя) Тогда
			
			Клиент_Объект.Наименование = СокрЛП((?(ЗначениеЗаполнено(Клиент_Объект.CRM_Фамилия), 	 СокрЛП(Клиент_Объект.CRM_Фамилия) + " ", "")
										+ ?(ЗначениеЗаполнено(Клиент_Объект.CRM_Имя), 		 СокрЛП(Клиент_Объект.CRM_Имя) + " ", "")
										+ ?(ЗначениеЗаполнено(Клиент_Объект.CRM_Отчество),  СокрЛП(Клиент_Объект.CRM_Отчество), "")));   
			
		КонецЕсли;
		
	КонецЕсли;
	
	Клиент_ОбъектТекИмя = СокрЛП(Клиент_Объект.CRM_Имя);
	
	// Определим пол
	Если Не ЗначениеЗаполнено(Клиент_Объект.Пол) Тогда
		
		Клиент_Объект.Пол = CRM_КлиентыКлиент.ОпределитьПол(Клиент_Объект.CRM_Имя);
		
	КонецЕсли;
	
	СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(Клиент_Объект);
	Элементы.Клиент_ОбъектНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	ЗаполнитьПолноеНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектCRM_ОтчествоПриИзменении(Элемент)
	
	Клиент_ОбъектРедактированиеФИО = Истина;
	Клиент_Объект.CRM_Отчество = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(Клиент_Объект.CRM_Отчество);
	Если Клиент_Объект.Ссылка.Пустая() И Не Клиент_ОбъектРедактированиеПредставления Тогда
		
		Если (Не ПустаяСтрока(Клиент_ОбъектТекОтчество)) 
			Или (ПустаяСтрока(Клиент_Объект.CRM_Отчество) И Не ПустаяСтрока(Клиент_ОбъектТекОтчество)) Тогда
			
			Клиент_Объект.Наименование = СокрЛП(СтрЗаменить(Клиент_Объект.Наименование, Клиент_ОбъектТекОтчество, СокрЛП(Клиент_Объект.CRM_Отчество)));
			
		ИначеЕсли ПустаяСтрока(Клиент_Объект.Наименование) Тогда
		
			Клиент_Объект.Наименование = СокрЛП(Клиент_Объект.CRM_Отчество);
	
		ИначеЕсли Не ПустаяСтрока(Клиент_Объект.CRM_Отчество) И ПустаяСтрока(Клиент_ОбъектТекОтчество) Тогда

			Клиент_Объект.Наименование = Клиент_Объект.Наименование + " " + СокрЛП(Клиент_Объект.CRM_Отчество);
			
		КонецЕсли;
						
	КонецЕсли;
	
	Клиент_ОбъектТекОтчество = СокрЛП(Клиент_Объект.CRM_Отчество);
	
	СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(Клиент_Объект);
	Элементы.Клиент_ОбъектНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	ЗаполнитьПолноеНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура Контакт_ФамилияПриИзменении(Элемент)
	
	КонтактРедактированиеФИО = Истина;
	Контакт_Фамилия = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(Контакт_Фамилия);
	Если Не КонтактРедактированиеПредставления Тогда
		
		Если (Не ПустаяСтрока(КонтактТекФамилия) И КонтактТекФамилия <> СокрЛП(Контакт_Фамилия)) 
			 Или (ПустаяСтрока(Контакт_Фамилия) И Не ПустаяСтрока(КонтактТекФамилия)) Тогда
			
			Контакт_ФИО = СокрЛП(СтрЗаменить(Контакт_ФИО, КонтактТекФамилия, СокрЛП(Контакт_Фамилия)));
			
		ИначеЕсли ПустаяСтрока(Контакт_ФИО) Тогда
			
			Контакт_ФИО = СокрЛП(Контакт_Фамилия);
			
		ИначеЕсли Не ПустаяСтрока(Контакт_Фамилия) И ПустаяСтрока(КонтактТекФамилия) Тогда
			
			Контакт_ФИО = СокрЛП((?(ЗначениеЗаполнено(Контакт_Фамилия),   СокрЛП(Контакт_Фамилия) + " ", "")
										+ ?(ЗначениеЗаполнено(Контакт_Имя), 		 СокрЛП(Контакт_Имя) + " ", "")
										+ ?(ЗначениеЗаполнено(Контакт_Отчество),  СокрЛП(Контакт_Отчество), "")));   
			
		КонецЕсли;
		
	КонецЕсли;
	
	КонтактТекФамилия = СокрЛП(Контакт_Фамилия);
	
	СтруктураКЛ = Новый Структура;
	СтруктураКЛ.Вставить("CRM_Фамилия", Контакт_Фамилия);
	СтруктураКЛ.Вставить("CRM_Имя", Контакт_Имя);
	СтруктураКЛ.Вставить("CRM_Отчество", Контакт_Отчество);
	СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(СтруктураКЛ, Ложь);
	Элементы.КонтактНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Контакт_ИмяПриИзменении(Элемент)
	
	КонтактРедактированиеФИО = Истина;
	Контакт_Имя = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(Контакт_Имя);
	Если Не КонтактРедактированиеПредставления Тогда
		
		Если (Не ПустаяСтрока(КонтактТекИмя) И КонтактТекФамилия <> СокрЛП(Контакт_Имя)) 
			 Или (ПустаяСтрока(Контакт_Имя) И Не ПустаяСтрока(КонтактТекИмя)) Тогда
			
			Контакт_ФИО = СокрЛП(СтрЗаменить(Контакт_ФИО, КонтактТекИмя, СокрЛП(Контакт_Имя)));
			
		ИначеЕсли ПустаяСтрока(Контакт_ФИО) Тогда
			
			Контакт_ФИО = СокрЛП(Контакт_Имя);
			
		ИначеЕсли Не ПустаяСтрока(Контакт_Имя) И ПустаяСтрока(КонтактТекИмя) Тогда
			
			Контакт_ФИО = СокрЛП((?(ЗначениеЗаполнено(Контакт_Фамилия), 	 СокрЛП(Контакт_Фамилия) + " ", "")
										+ ?(ЗначениеЗаполнено(Контакт_Имя), 		 СокрЛП(Контакт_Имя) + " ", "")
										+ ?(ЗначениеЗаполнено(Контакт_Отчество),  СокрЛП(Контакт_Отчество), "")));   
			
		КонецЕсли;
		
	КонецЕсли;
	
	КонтактТекИмя = СокрЛП(Контакт_Имя);
	
	// Определим пол
	Если Не ЗначениеЗаполнено(ПолКонтактногоЛица) Тогда
		
		ПолКонтактногоЛица = CRM_КлиентыКлиент.ОпределитьПол(Контакт_Имя);
		
	КонецЕсли;
	
	СтруктураКЛ = Новый Структура;
	СтруктураКЛ.Вставить("CRM_Фамилия", Контакт_Фамилия);
	СтруктураКЛ.Вставить("CRM_Имя", Контакт_Имя);
	СтруктураКЛ.Вставить("CRM_Отчество", Контакт_Отчество);
	СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(СтруктураКЛ, Ложь);
	Элементы.КонтактНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Контакт_ОтчествоПриИзменении(Элемент)
	
	КонтактРедактированиеФИО = Истина;
	Контакт_Отчество = CRM_КлиентыКлиент.ПривестиФИОКСтандартномуВиду(Контакт_Отчество);
	Если Не КонтактРедактированиеПредставления Тогда
		
		Если (Не ПустаяСтрока(КонтактТекОтчество)) 
			Или (ПустаяСтрока(Контакт_Отчество) И Не ПустаяСтрока(КонтактТекОтчество)) Тогда
			
			Контакт_ФИО = СокрЛП(СтрЗаменить(Контакт_ФИО, КонтактТекОтчество, СокрЛП(Контакт_Отчество)));
			
		ИначеЕсли ПустаяСтрока(Контакт_ФИО) Тогда
		
			Контакт_ФИО = СокрЛП(Контакт_Отчество);
	
		ИначеЕсли Не ПустаяСтрока(Контакт_Отчество) И ПустаяСтрока(КонтактТекОтчество) Тогда

			Контакт_ФИО = Контакт_ФИО + " " + СокрЛП(Контакт_Отчество);
			
		КонецЕсли;
						
	КонецЕсли;
	
	КонтактТекОтчество = СокрЛП(Контакт_Отчество);
	
	СтруктураКЛ = Новый Структура;
	СтруктураКЛ.Вставить("CRM_Фамилия", Контакт_Фамилия);
	СтруктураКЛ.Вставить("CRM_Имя", Контакт_Имя);
	СтруктураКЛ.Вставить("CRM_Отчество", Контакт_Отчество);
	СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(СтруктураКЛ, Ложь);
	Элементы.КонтактНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектCRM_ОсновнаяОтрасльПриИзменении(Элемент)
	
	Клиент_Объект.CRM_ВидыДеятельности.Очистить();
	Если ЗначениеЗаполнено(Клиент_Объект.CRM_ОсновнаяОтрасль) Тогда
		СтрОтрасль = Клиент_Объект.CRM_ВидыДеятельности.Добавить();
		СтрОтрасль.ВидДеятельности = Клиент_Объект.CRM_ОсновнаяОтрасль;
	КонецЕсли;
	
КонецПроцедуры

// +CRM_Модуль

&НаКлиенте
Процедура ОсновнаяОрганизацияПриИзменении(Элемент)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	ПодключитьОбработчикОжидания("ОбновитьСвязиПараметровВыбораРеквизитовФормы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоглащениеПриИзменении(Элемент)
	
	СоглашениеПриИзмененииСервер();
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	ПодключитьОбработчикОжидания("ОбновитьСвязиПараметровВыбораРеквизитовФормы", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СоглашениеПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(ЭтотОбъект["Соглашение"]) Тогда
		
		УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(ЭтотОбъект["Соглашение"], Истина);
		
		Если УсловияПродаж = Неопределено Тогда
			Возврат;
		КонецЕсли;
	
		ОжидаемаяВыручка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ОжидаемаяВыручка, Валюта, УсловияПродаж.ВалютаВзаиморасчетов, ТекущаяДатаСеанса());  
		Валюта = УсловияПродаж.ВалютаВзаиморасчетов;
		
		ИзмененаОрганизация = ЗначениеЗаполнено(УсловияПродаж.Организация) И УсловияПродаж.Организация <> ОсновнаяОрганизация;
	
		Если ИзмененаОрганизация Тогда
			ОсновнаяОрганизация = УсловияПродаж.Организация;
		КонецЕсли;
	
		Если Не УсловияПродаж.Типовое Тогда
			Если ЗначениеЗаполнено(УсловияПродаж.Контрагент) Тогда
				Контрагент = УсловияПродаж.Контрагент;
			КонецЕсли;
		КонецЕсли;
	
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Клиент, Контрагент);
	
		//Если Не УсловияПродаж.Типовое Тогда
		//	Если ЗначениеЗаполнено(УсловияПродаж.КонтактноеЛицо) 
		//		И НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		//		КонтактноеЛицо = УсловияПродаж.КонтактноеЛицо;
		//	КонецЕсли;
		//КонецЕсли;
	
		//ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер, КонтактноеЛицо);
	
		Если УсловияПродаж.ИспользуютсяДоговорыКонтрагентов <> Неопределено И УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		 
			ДанныеОбъекта = Новый Структура("Организация, Соглашение, Партнер, Контрагент, Договор",
											ОсновнаяОрганизация, ЭтотОбъект["Соглашение"], Клиент, Контрагент, Договор);
			Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ДанныеОбъекта, Перечисления.ХозяйственныеОперации.РеализацияКлиенту, Валюта);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииСервер();
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	ПодключитьОбработчикОжидания("ОбновитьСвязиПараметровВыбораРеквизитовФормы", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		ЗаполнитьДоговорПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		ОжидаемаяВыручка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ОжидаемаяВыручка, Валюта, Договор.ВалютаВзаиморасчетов, ТекущаяДатаСеанса());
		Валюта = Договор.ВалютаВзаиморасчетов;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорПоУмолчанию()
	
	ДанныеОбъекта = Новый Структура("Организация, Соглашение, Партнер, Контрагент, Договор",
											ОсновнаяОрганизация, ЭтотОбъект["Соглашение"], Клиент, Контрагент, Договор);
	ДоговорПоУмолчанию = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ДанныеОбъекта, Перечисления.ХозяйственныеОперации.РеализацияКлиенту, Валюта);
															
	Если ДоговорПоУмолчанию <> Договор Тогда
		Договор = ДоговорПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвязиПараметровВыбораРеквизитовФормы()
	
	ОбновитьСвязиПараметровВыбораРеквизитовФормыНаСервере();
	
	// сброс ОбрабатыватьАктивизациюПоиска в Истина
	Если Не ОбрабатыватьАктивизациюПоиска Тогда
		РезультатыПоискаПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвязиПараметровВыбораРеквизитовФормыНаСервере()
	
	// Договор
	ЭлементФормы = Элементы.Договор;
	НовыеСвязиПараметровВыбора = Новый Массив;
	
	ПараметрВыбора = Новый СвязьПараметраВыбора("Отбор.Партнер", "Клиент", РежимИзмененияСвязанногоЗначения.Очищать);
	НовыеСвязиПараметровВыбора.Добавить(ПараметрВыбора);
	
	Если Элементы.ОсновнаяОрганизация.Видимость И ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		ПараметрВыбора = Новый СвязьПараметраВыбора("Отбор.Организация", "ОсновнаяОрганизация", РежимИзмененияСвязанногоЗначения.Очищать);
		НовыеСвязиПараметровВыбора.Добавить(ПараметрВыбора);
	КонецЕсли;
	
	Если Элементы.Контрагент.Видимость И ЗначениеЗаполнено(Контрагент) Тогда
		ПараметрВыбора = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Контрагент", РежимИзмененияСвязанногоЗначения.Очищать);
		НовыеСвязиПараметровВыбора.Добавить(ПараметрВыбора);
	КонецЕсли;
	
	ЭлементСоглашение = Элементы.Найти("Соглашение");
	Если ЭлементСоглашение <> Неопределено 
		И ЭлементСоглашение.Видимость И ЗначениеЗаполнено(ЭтотОбъект["Соглашение"]) Тогда
		ПараметрВыбора = Новый СвязьПараметраВыбора("Соглашение", "Соглашение", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыеСвязиПараметровВыбора.Добавить(ПараметрВыбора);
	КонецЕсли;
	
	ЭлементФормы.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыеСвязиПараметровВыбора);
	
КонецПроцедуры

Процедура ЗаполнитьУсловияПродажПоУмолчанию() Экспорт
	
	Партнер = Клиент;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	Если ЗначениеЗаполнено(Партнер) ИЛИ Не ИспользоватьСоглашенияСКлиентами Тогда
		
		УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(
			Партнер,
			Новый Структура("УчитыватьГруппыСкладов, ВыбранноеСоглашение, ПустаяСсылкаДокумента", 
			Истина, 
			ЭтотОбъект["Соглашение"],
			Документы.CRM_Интерес.ПустаяСсылка()));
			
		Если УсловияПродажПоУмолчанию <> Неопределено Тогда
			ЭтотОбъект["Соглашение"] = УсловияПродажПоУмолчанию.Соглашение;
			ЗаполнитьУсловияПродаж(УсловияПродажПоУмолчанию);
		Иначе
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, ЭтотОбъект["Контрагент"]);
			ЭтотОбъект["Соглашение"] = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	Если ЭтотОбъект["Контрагент"].Пустая() Тогда
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, ЭтотОбъект["Контрагент"]);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьУсловияПродаж(Знач УсловияПродаж) Экспорт
	
	Если УсловияПродаж = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаемаяВыручка = РаботаСКурсамиВалют.ПересчитатьВВалюту(ОжидаемаяВыручка, Валюта, УсловияПродаж.ВалютаВзаиморасчетов, ТекущаяДатаСеанса());
	Валюта = УсловияПродаж.ВалютаВзаиморасчетов;
	
	ИзмененаОрганизация = ЗначениеЗаполнено(УсловияПродаж.Организация) И УсловияПродаж.Организация <> ОсновнаяОрганизация;
	
	Если ИзмененаОрганизация Тогда
		ОсновнаяОрганизация = УсловияПродаж.Организация;
	КонецЕсли;
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.Контрагент) Тогда
			Контрагент = УсловияПродаж.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Клиент, Контрагент);
	
	Если УсловияПродаж.ИспользуютсяДоговорыКонтрагентов <> Неопределено И УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
	
		ДанныеОбъекта = Новый Структура("Организация, Соглашение, Партнер, Контрагент, Договор",
											ОсновнаяОрганизация, ЭтотОбъект["Соглашение"], Клиент, Контрагент, Договор);
		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ДанныеОбъекта, Перечисления.ХозяйственныеОперации.РеализацияКлиенту, Валюта);
	
	КонецЕсли;
	
КонецПроцедуры

// -CRM_Модуль

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыПоиска

&НаКлиенте
Процедура РезультатыПоискаПриАктивизацииСтроки(Элемент)
	
	Если Не ОбрабатыватьАктивизациюПоиска Тогда
		ОбрабатыватьАктивизациюПоиска = Истина;
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("НастроитьЗаполнитьПоНайденнымДанным", 0.1, Истина);
	
	Если Элементы.РезультатыПоиска.ТекущаяСтрока <> Неопределено Тогда
		ПотенциальныйКлиентПриАктивизацииСтроки = Элементы.РезультатыПоиска.ТекущиеДанные.Контакт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РезультатыПоиска.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Клиент);
	Иначе
		ПоказатьЗначение(, ТекущиеДанные.Контакт);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНайденныеИнтересы

&НаКлиенте
Процедура НайденныеИнтересыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Интерес);
КонецПроцедуры

&НаКлиенте
Процедура НайденныеИнтересыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НайденныеИнтересы.ТекущиеДанные;
	Элементы.ПрикрепитьКВыбранному.Доступность = ТекущиеДанные <> Неопределено И ДоступноОбращение;
	Элементы.ОткрыватьИнтересОбращение.Видимость = ТекущиеДанные <> Неопределено И ДоступноОбращение;
	УстановитьВидимостьСоздаватьЗадачуПриСвязывании(ЭтотОбъект, Элементы.ОткрыватьИнтересОбращение.Видимость);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьСоздаватьЗадачуПриСвязывании(Форма, ВидимостьБезУчетаОтветственного)
	
	#Если Сервер Тогда
		Возврат;
	#Иначе
		
	Форма.Элементы.СоздаватьЗадачуПриСвязывании.Видимость = Ложь;
	Если ВидимостьБезУчетаОтветственного Тогда
		
		ТекущиеДанные = Форма.Элементы.НайденныеИнтересы.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
		
			ТипПользователи = Тип("СправочникСсылка.Пользователи");
			ТипРоли = Тип("СправочникСсылка.РолиИсполнителей");
			ТипОтветственныйИнтерес = ТипЗнч(ТекущиеДанные.Ответственный);
			
			Если ТипОтветственныйИнтерес = ТипПользователи Тогда
				Форма.Элементы.СоздаватьЗадачуПриСвязывании.Видимость = (ТекущиеДанные.Ответственный <> Форма.ТекущийПользователь);
			ИначеЕсли ТипОтветственныйИнтерес = ТипРоли Тогда
				Форма.Элементы.СоздаватьЗадачуПриСвязывании.Видимость = НЕ ПользовательВходитВРоль(Форма.ТекущийПользователь, ТекущиеДанные.Ответственный);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОткрыватьИнтерес(Форма)
	
	ТипПользователи = Тип("СправочникСсылка.Пользователи");
	ТипРоли = Тип("СправочникСсылка.РолиИсполнителей");
	ТипОтветственныйИнтерес = ТипЗнч(Форма.Ответственный);
	
	Если ТипОтветственныйИнтерес = ТипПользователи Тогда
		Форма.Элементы.ОткрыватьИнтерес.Видимость = (Форма.ТекущийПользователь <> Форма.Ответственный);
	ИначеЕсли ТипОтветственныйИнтерес = ТипРоли Тогда
		Форма.Элементы.ОткрыватьИнтерес.Видимость = НЕ ПользовательВходитВРоль(Форма.ТекущийПользователь, Форма.Ответственный);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОсновныеДействия

&НаКлиенте
Процедура СоздатьИнтерес(Команда)
	
	ЭтоСвязываниеИнтереса = Ложь;
	
	Если ТипЗнч(СценарийПродажи) = Тип("СправочникСсылка.CRM_КартыМаршрутов") Тогда
		
		РежимПроверкиЗаполнения = "ЗапускБизнесПроцесса";
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		Если Клиент.Пустая() И ПотенциальныйКлиент.Пустая() Тогда
			СоздатьПотенциальныйКлиентНаСервере();
		КонецЕсли;
		СтруктураЗаполнения = Новый Структура("ПотенциальныйКлиент, Партнер, Контакт, КартаМаршрута, Тема, Описание, Ответственный, Подразделение, Сумма", ПотенциальныйКлиент, Клиент, Контакт, СценарийПродажи, Тема, Содержание, Ответственный, CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Ответственный, "Подразделение"), ОжидаемаяВыручка);
		Если ЗначениеЗаполнено(Проект) Тогда
			СтруктураЗаполнения.Вставить("Проект", Проект);	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Обращение) Тогда
			СтруктураЗаполнения.Вставить("Предмет", Обращение);
		КонецЕсли;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЭтоБП");
		ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
		
		Если CRM_БизнесПроцессыИЗадачиСервер.ЭтоПоручение(СценарийПродажи) Тогда
			ДополнительныеПараметры.Вставить("ИмяФормы", "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаПоручения");
		Иначе
			ДополнительныеПараметры.Вставить("ИмяФормы", "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаСтартаНезависимого");
		КонецЕсли;
		
		Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
			ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры);
		Иначе
			ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
		КонецЕсли;
		
	Иначе
		
		РежимПроверкиЗаполнения = "СозданиеИнтереса";
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		Если Элементы.ГруппаРеквизитыКлиента.Видимость Тогда
			ДополнительныеПараметры = Новый Структура("ВФормеДублейВыбраноКЛ", Ложь);
			ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьИнтересЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			НайтиДубли(ОписаниеОповещения);
		Иначе
			СоздатьИнтересЗавершение(Ложь, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИнтересЗавершение(НайденыДубли, ДополнительныеПараметры) Экспорт
	
	Если НЕ НайденыДубли Тогда
		ИнтересСоздан = СоздатьИнтересНаСервере();
			
		Если ИнтересСоздан Тогда
				
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Интерес", СозданныйИнтерес);
			ДополнительныеПараметры.Вставить("ЭтоСоздание");
			Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
				ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры);
			Иначе
				ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
			КонецЕсли;
			
			// +Рарус alexpr
			СоздатьИнтересЗавершениеСервер(ДополнительныеПараметры);
			
			Если ТипЗнч(Обращение) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
				Оповестить("ОбновитьСообщения");
				ОповеститьОбИзменении(Обращение);
			КонецЕсли;
			// -Рарус alexpr
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// +Рарус alexpr
&НаСервере
Процедура СоздатьИнтересЗавершениеСервер(ДополнительныеПараметры)
	
	Если ТипЗнч(Обращение) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
		Если Обращение.Статус <> Перечисления.CRM_СтатусыДиалогов.ПринятВРаботу
			И Обращение.Статус <> Перечисления.CRM_СтатусыДиалогов.Закрыт Тогда
			CRM_РаботаСМессенджерамиСервер.ПринятьДиалог(Обращение);
		КонецЕсли;
		Если ПустаяСтрока(Обращение.Наименование) Тогда
			CRM_РаботаСМессенджерамиСервер.ПереименоватьДиалог(Обращение, Содержание);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// -Рарус alexpr

&НаКлиенте
Процедура ПрикрепитьКВыбранному(Команда)
	
	ЭтоСвязываниеИнтереса = Истина;
	
	ТекущиеДанные = Элементы.НайденныеИнтересы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Интерес", ТекущиеДанные.Интерес);
	ДополнительныеПараметры.Вставить("ЭтоСвязывание");
	Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
		ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры);
	Иначе
		ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ТекущееСостояние = Неопределено;
	Если CRM_МетодыФормДокументовСервер.ОбращениеНельзяОтклонить(Обращение, ТекущееСостояние) Тогда
		CRM_МетодыФормДокументовКлиент.ПоказатьПредупреждениеОбращениеОбработано(ТекущееСостояние);
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	Если ОбязательноУказыватьПричинуОтказа(Обращение) Тогда
		ОповещениеПричинаОтказа = Новый ОписаниеОповещения("ОтклонитьЗавершение", ЭтотОбъект);
		ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", Новый Структура, ЭтотОбъект,,,, ОповещениеПричинаОтказа, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ДописатьИнформациюВОснованиеОбращения("", "");
		ЗаписатьСостояниеОтклоненногоЛида(Обращение, "", "");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("ПричинаОтказа")
		И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
		ДописатьИнформациюВОснованиеОбращения(Результат.ПричинаОтказа, Результат.Комментарий);
		ЗаписатьСостояниеОтклоненногоЛида(Обращение, Результат.ПричинаОтказа, Результат.Комментарий);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеДействия

&НаКлиенте
Процедура ДобавитьПолеПоиска(Команда)
	
	Элементы["ГруппаПоиска"+Строка(КоличествоПолейПоиска)].Видимость = Истина;
	Элементы["ДобавитьПолеПоиска"+Строка(КоличествоПолейПоиска-1)].Видимость = Ложь;
	КоличествоПолейПоиска = КоличествоПолейПоиска + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйКлиент(Команда)
	
	Если РезультатыПоиска.Количество() > 0 Тогда
		РезультатыПоиска.Очистить();
	Иначе
		НастроитьЗаполнитьПоНайденнымДанным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиента(Команда)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	ВидПартнераКомпания = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания");
	ВидПартнераЧастноеЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо");
	Клиент_Объект.ОсновнойМенеджер = Ответственный;
	Если ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
		ЗаполнитьКлиентаИзПотенциального();
	Иначе		
		Если ЗначениеЗаполнено(Организация) Тогда
			Клиент_Объект.ЮрФизЛицо = ВидПартнераКомпания;
		Иначе
			НастройкаКлиент_ОбъектЮрФизЛицо = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.Клиент_ОбъектЮрФизЛицо", "МастерРегистрации", Неопределено);
			Если НастройкаКлиент_ОбъектЮрФизЛицо = Неопределено Тогда
				Клиент_Объект.ЮрФизЛицо = ВидПартнераЧастноеЛицо;
			Иначе
				Клиент_Объект.ЮрФизЛицо = НастройкаКлиент_ОбъектЮрФизЛицо;
			КонецЕсли;
		КонецЕсли;
		//++#1398 смарт: Балашов 17.07.2023 //Доработать карточку интереса (исправить логику)
		Клиент_Объект.ЮрФизЛицо = НастройкаКлиент_ОбъектЮрФизЛицо;
		//++ #1398 смарт: Фролов 24.08.2023 //Доработать карточку интереса (исправить логику)  
		Элементы.Клиент_ОбъектЮрФизЛицо.Видимость=Ложь;
		смартИзменитьКнопкиНаСервере();
		//-- #1398 смарт: Фролов 24.08.2023
        //--#1398 смарт: Балашов 17.07.2023
		
		
		БуферФИО = ФИО;
		ФамилияКонтакта = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(БуферФИО);
		ИмяКонтакта = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(БуферФИО);
		ОтчествоКонтакта = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(БуферФИО);
		ПараметрыКЛ = Новый структура("ФИО, Фамилия, Имя, Отчество", ФИО, ФамилияКонтакта, ИмяКонтакта, ОтчествоКонтакта);
		
		Если Клиент_Объект.ЮрФизЛицо = ВидПартнераКомпания Тогда
			ПравоваяФорма = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Ответственный, "ПравоваяФормаКлиентаПоУмолчанию");
			Клиент_Объект.Наименование = Организация;
			Клиент_Объект.НаименованиеПолное = ?(СокрЛП(ПравоваяФорма) = "" ,СокрЛП(Организация),СокрЛП(ПравоваяФорма)+" """+СокрЛП(Организация)+"""");
			Если ЗначениеЗаполнено(ИДАккаунта) Тогда
				Контакт_Мессенджер = ИДАккаунта;
				Элементы.Контакт_Мессенджер.Заголовок = Элементы.ИДАккаунта.Заголовок;
				Элементы.Контакт_Мессенджер.Видимость = Истина;
			КонецЕсли;
			
			Контакт_ФИО = ФИО;
			Контакт_Email = Почта;
			Контакт_Телефон = Телефон;
			
		Иначе
			Клиент_Объект.Наименование = ФИО;
			Клиент_Объект.НаименованиеПолное = ФИО;
			Клиент_Объект.CRM_Фамилия = ФамилияКонтакта;
			Клиент_Объект.CRM_Имя = ИмяКонтакта;
			Клиент_Объект.CRM_Отчество = ОтчествоКонтакта;
			Клиент_Email = Почта;
			Клиент_Телефон = Телефон;
			Клиент_МобТелефон = НомерМобильногоТелефона;
			Если ЗначениеЗаполнено(ИДАккаунта) Тогда
				Клиент_Мессенджер = ИДАккаунта;
				Элементы.Клиент_Мессенджер.Заголовок = Элементы.ИДАккаунта.Заголовок;
				Элементы.Клиент_Мессенджер.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Клиент_Объект.БизнесРегион = БизнесРегион;
		Клиент_Объект.CRM_ОсновнаяОтрасль = Отрасль;
		Клиент_Объект.CRM_ВидыДеятельности.Очистить();
		Если ЗначениеЗаполнено(Клиент_Объект.CRM_ОсновнаяОтрасль) Тогда
			СтрОтрасль = Клиент_Объект.CRM_ВидыДеятельности.Добавить();
			СтрОтрасль.ВидДеятельности = Клиент_Объект.CRM_ОсновнаяОтрасль;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаФИО.Видимость = Ложь;
	Элементы.ГруппаРеквизитыКлиента.Видимость = Истина;
	Элементы.ГруппаРеквизитыПотенциальногоКлиента.Видимость = Ложь;
	Элементы.ГруппаВзаимодействие.Видимость = Ложь;
	
	ИменаЭлементовИзменениеВидимости = Новый Массив;
	ИменаЭлементовИзменениеВидимости.Добавить(Элементы.РольВИнтересе.Имя);
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	Иначе
		ИменаЭлементовИзменениеВидимости.Добавить("Соглашение");
		ИменаЭлементовИзменениеВидимости.Добавить("Контрагент");
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	КонецЕсли;	
	УстановитьВидимостьРеквизитов(ИменаЭлементовИзменениеВидимости);
	
	Клиент_ОбъектЮрФизЛицоПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиентаОтмена(Команда)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	Контакт_ФИО = "";
	
	Элементы.ГруппаФИО.Видимость = Истина;
	Элементы.ГруппаРеквизитыКлиента.Видимость = Ложь;
	Элементы.ГруппаРеквизитыКонтакта.Видимость = Ложь;
	Элементы.ГруппаРеквизитыПотенциальногоКлиента.Видимость = НЕ ЗначениеЗаполнено(ПотенциальныйКлиент);
	Элементы.ГруппаВзаимодействие.Видимость = Истина;
	
	ИменаЭлементовИзменениеВидимости = Новый Массив;
	ИменаЭлементовИзменениеВидимости.Добавить(Элементы.РольВИнтересе.Имя);
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	Иначе
		ИменаЭлементовИзменениеВидимости.Добавить("Соглашение");
		ИменаЭлементовИзменениеВидимости.Добавить("Контрагент");
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	КонецЕсли;	
	УстановитьВидимостьРеквизитов(ИменаЭлементовИзменениеВидимости);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиентаЗаписать(Команда)
	
	РежимПроверкиЗаполнения = "СозданиеКлиентаКонтакта";
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ВФормеДублейВыбраноКЛ", Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКлиентаЗаписатьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НайтиДубли(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиентаЗаписатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СоздатьКлиентаЗаписатьНаСервере(ДополнительныеПараметры.ВФормеДублейВыбраноКЛ);
	СпозиционироватьсяНаКлиентеКонтакте();
	
КонецПроцедуры

&НаКлиенте
Процедура СпозиционироватьсяНаКлиентеКонтакте()
	
	ПараметрыОтбораРезультатаПоиска = Новый Структура;
		
	Если ЗначениеЗаполнено(Клиент) Тогда
		
		ПараметрыОтбораРезультатаПоиска.Вставить("Клиент", Клиент);
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Контакт) Тогда
		
		ПараметрыОтбораРезультатаПоиска.Вставить("Контакт", Контакт);
		
	КонецЕсли;
	
	СтрокиПозиционирования = РезультатыПоиска.НайтиСтроки(ПараметрыОтбораРезультатаПоиска);
	
	Для Каждого СтрПозиционирования Из СтрокиПозиционирования Цикл
		Элементы.РезультатыПоиска.ТекущаяСтрока = СтрПозиционирования.ПолучитьИдентификатор();
	КонецЦикла;
	
	НастроитьЗаполнитьПоНайденнымДанным();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКлиентаЗаписатьНаСервере(ВФормеДублейВыбраноКЛ)
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		СоздатьКлиентаНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		
		Если НЕ (ПустаяСтрока(Контакт_ФИО) ИЛИ ВФормеДублейВыбраноКЛ ИЛИ ЗначениеЗаполнено(Контакт)) Тогда
			СоздатьКонтактНаСервере();
			Контакт_ФИО = "";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Клиент.CRM_ОсновноеКонтактноеЛицо) Тогда
			КлиентОбъект = Клиент.ПолучитьОбъект();
			КлиентОбъект.CRM_ОсновноеКонтактноеЛицо = Контакт;
			КлиентОбъект.Записать();
		КонецЕсли;			
		
		// Связывание Потенциального клиента с созданным Клиентом
		Если ЗначениеЗаполнено(ПотенциальныйКлиент)
			И НЕ ЗначениеЗаполнено(ПотенциальныйКлиент.Партнер) Тогда
			
			ПотенциальныйКлиентОбъект = ПотенциальныйКлиент.ПолучитьОбъект();
			ПотенциальныйКлиентОбъект.Партнер = Клиент;
			ПотенциальныйКлиентОбъект.КонтактноеЛицо = Контакт;
			ПотенциальныйКлиентОбъект.Записать();
			
			CRM_ОбщегоНазначенияСервер.ПереписатьАктивныеИнтересыСПотенциальногоКлиентаНаПартнера(ПотенциальныйКлиент, Клиент);
		
		КонецЕсли;
	
	КонецЕсли;
	
	
	УсловияПоиска = Новый Массив;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		УсловияПоиска.Добавить(СокрЛП(Клиент));
	КонецЕсли;
	Если ЗначениеЗаполнено(Контакт) Тогда
		УсловияПоиска.Добавить(СокрЛП(Контакт));
	КонецЕсли;
	
	Если УсловияПоиска.Количество() > 0 Тогда
		ВыполнитьПоискНаСервере(УсловияПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтакт(Команда)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	Контакт = Неопределено;
	
	Элементы.ГруппаКонтакт.Видимость = Ложь;
	
	Элементы.ГруппаФИО.Видимость = Ложь;
	Элементы.ГруппаРеквизитыПотенциальногоКлиента.Видимость = Ложь;
	Элементы.ФИО.Видимость = Истина;
	
	Элементы.ГруппаРеквизитыКонтакта.Видимость = Истина;
	Элементы.Контакт_Мессенджер.Видимость = ЗначениеЗаполнено(ИДАккаунта);
	
	ИменаЭлементовИзменениеВидимости = Новый Массив;
	ИменаЭлементовИзменениеВидимости.Добавить(Элементы.РольВИнтересе.Имя);
	УстановитьВидимостьРеквизитов(ИменаЭлементовИзменениеВидимости);
	
	Элементы.СоздатьКлиента.Видимость = Ложь;
	Элементы.СоздатьКонтактОтмена.Видимость = Истина;
	Элементы.СоздатьКонтактЗаписать.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтактОтмена(Команда)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	Контакт_ФИО = "";
	
	НастроитьЗаполнитьПоНайденнымДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтактЗаписать(Команда)
	
	РежимПроверкиЗаполнения = "СозданиеКлиентаКонтакта";
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ВФормеДублейВыбраноКЛ", Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКонтактЗаписатьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НайтиДубли(ОписаниеОповещения);
	
	Фио = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтактЗаписатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СоздатьКонтактЗаписатьНаСервере(ДополнительныеПараметры.ВФормеДублейВыбраноКЛ);
	СпозиционироватьсяНаКлиентеКонтакте();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтактЗаписатьНаСервере(ВФормеДублейВыбраноКЛ)
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		
		Если НЕ (ПустаяСтрока(Контакт_ФИО) ИЛИ ВФормеДублейВыбраноКЛ ИЛИ ЗначениеЗаполнено(Контакт)) Тогда
			СоздатьКонтактНаСервере();
			Контакт_ФИО = "";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Клиент.CRM_ОсновноеКонтактноеЛицо) Тогда
			КлиентОбъект = Клиент.ПолучитьОбъект();
			КлиентОбъект.CRM_ОсновноеКонтактноеЛицо = Контакт;
			КлиентОбъект.Записать();
		КонецЕсли;
	
	КонецЕсли;
	
	
	УсловияПоиска = Новый Массив;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		УсловияПоиска.Добавить(СокрЛП(Клиент));
	КонецЕсли;
	Если ЗначениеЗаполнено(Контакт) Тогда
		УсловияПоиска.Добавить(СокрЛП(Контакт));
	КонецЕсли;
	
	Если УсловияПоиска.Количество() > 0 Тогда
		ВыполнитьПоискНаСервере(УсловияПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ОткрытьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНастроек",, ЭтотОбъект,,,, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		ПодставлятьОтветственногоЗаКлиентаВИнтерес = РезультатЗакрытия.ПодставлятьОтветственногоЗаКлиентаВИнтерес;
		
		РежимВводаНовогоКлиента = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.РежимВводаНовогоКлиента", "МастерРегистрации", 0);
		
		Если ЗначениеЗаполнено(РезультатЗакрытия.ОсновнойТипУслуги)
			И ТипУслуги <> РезультатЗакрытия.ОсновнойТипУслуги Тогда
			УстановитьЗначениеТипУслуги(РезультатЗакрытия.ОсновнойТипУслуги);
			ОбрабатыватьАктивизациюПоиска = Ложь;
			ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
			ЗаполнитьПроверяемыеРеквизитыИнтереса();
			ОбновитьЭлементыДополнительныхРеквизитов();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатЗакрытия.ОсновнойТипОбращения)
			И ТипОбращения <> РезультатЗакрытия.ОсновнойТипОбращения Тогда
			УстановитьЗначениеТипОбращения(РезультатЗакрытия.ОсновнойТипОбращения);
			ОбрабатыватьАктивизациюПоиска = Ложь;
			ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
			ЗаполнитьПроверяемыеРеквизитыИнтереса();
			ОбновитьЭлементыДополнительныхРеквизитов();
		КонецЕсли;
		
		Если РезультатЗакрытия.ИзмененСоставРеквизитов Тогда
			ИзменитьСоставРеквизитов();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Если Не сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Ложь) Тогда
		сфпВиднаКолонкаСтатусов = Ложь;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект, Новый Структура);
	ПараметрыОткрытия = Новый Структура;
	ПоказыватьНастройкаПоТипуУслуги = Ложь;
	Если ЗначениеЗаполнено(ТипУслуги) Тогда
		ПараметрыОткрытия.Вставить("ТипУслуги", ТипУслуги);
		ПоказыватьНастройкаПоТипуУслуги = Истина;
	КонецЕсли;
	ПараметрыОткрытия.Вставить("сфпВиднаКолонкаСтатусов", сфпВиднаКолонкаСтатусов);
	ПараметрыОткрытия.Вставить("ПоказыватьНастройкаПоТипуУслуги", ПоказыватьНастройкаПоТипуУслуги);
	
	ОткрытьФорму("ОбщаяФорма.CRM_ПодборПользователейПоТипуУслуги", ПараметрыОткрытия ,ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьНаРоль(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект, Новый Структура);

	ОткрытьФорму("Справочник.РолиИсполнителей.ФормаВыбора",,ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьЗавершение(Результат, ДопПараметры) Экспорт
	
	ВыбранПользователь = (ТипЗнч(Результат) = Тип("СправочникСсылка.Пользователи"));
	ВыбранаРоль = (ТипЗнч(Результат) = Тип("СправочникСсылка.РолиИсполнителей"));
	
	Если ВыбранПользователь ИЛИ ВыбранаРоль Тогда
		ОбрабатыватьАктивизациюПоиска = Ложь;
		Ответственный = Результат;
		
		Если ВыбранПользователь Тогда
			
			ОсновнаяОрганизация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация", Ответственный);
			Проект = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойПроект", Ответственный);
			ТипУслугиОтв = ПолучитьТипУслугиПользователя(Ответственный);
			Если ЗначениеЗаполнено(ТипУслугиОтв) Тогда
				УстановитьЗначениеТипУслуги(ТипУслугиОтв);
			КонецЕсли;
			
			ОбновитьТипОбращения(Ответственный);
			
		КонецЕсли;
		
		ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
		ЗаполнитьПроверяемыеРеквизитыИнтереса();
		ОбновитьЭлементыДополнительныхРеквизитов();
	
		сфпВидимостьИДоступностьГруппыСофтфон();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтактнуюИнформацию(Команда)
	
	ИмяКомандыМассив = СтрРазделить(Команда.Имя, "_");
	ПризнакТипа = ИмяКомандыМассив[1];
	ПризнакВладельца = ИмяКомандыМассив[2];
	
	ДобавитьКИНаСервере(ПризнакТипа, ПризнакВладельца, КэшЗаполнения[ПризнакТипа]);
	ТекущиеДанные = Элементы.РезультатыПоиска.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Описание = ОписаниеСтрокиНайденного(ТекущиеДанные.Клиент, ТекущиеДанные.Контакт);
	КонецЕсли;
	
	Элементы[Команда.Имя].Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФИО(Команда)
	
	ФИО = КэшЗаполнения.ФИО;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомпанию(Команда)
	
	Организация = КэшЗаполнения.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	
	Если НЕ ЗначениеЗаполнено(Клиент_ИНН) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""ИНН"" не заполнено';en='The field ""TIN"" is empty'"));
		ТекущийЭлемент = Элементы.Клиент_ОбъектCRM_ИНН;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_Объект.Наименование) 
		ИЛИ ЗначениеЗаполнено(Клиент_Объект.НаименованиеПолное) Тогда
		ТекстВопроса = НСтр("ru='Перезаполнить текущие реквизиты?';en='Refill current attributes?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПоИННЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоИННЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СофтФон

&НаКлиенте
Процедура сфпУдержатьЗвонок(Команда)
	
	Если сфпПанельУправления = Неопределено Тогда Возврат; КонецЕсли;
	hCall = сфпПолучитьИдентификаторЗвонка(Обращение);
	НайденныйЗвонок = сфпСофтФонПроКлиент.сфпНайтиДанныеЗвонка(hCall);
	Если НайденныйЗвонок = Неопределено Тогда Возврат; КонецЕсли;
	Если НЕ сфпУдержаниеЗвонка Тогда
		Элементы.сфпУдержатьЗвонок.Картинка	= БиблиотекаКартинок.сфпОтветитьПанель;
	Иначе
		Элементы.сфпУдержатьЗвонок.Картинка	= БиблиотекаКартинок.сфпУдержаниеПанель;
	КонецЕсли;
	сфпПанельУправления.HoldCall(НайденныйЗвонок.LineName, НайденныйЗвонок.hCall);
	сфпУдержаниеЗвонка = НЕ сфпУдержаниеЗвонка;
	
КонецПроцедуры

&НаКлиенте
Процедура сфпПереводЗвонка(Команда)
	
	Если сфпПанельУправления = Неопределено Тогда Возврат; КонецЕсли;
	hCall = сфпПолучитьИдентификаторЗвонка(Обращение);
	НайденныйЗвонок = сфпСофтФонПроКлиент.сфпНайтиДанныеЗвонка(hCall);
	Если НайденныйЗвонок = Неопределено Тогда Возврат; КонецЕсли;
	Если ЗначениеЗаполнено(сфпНомерПеревода) Тогда
		СтруктураКонтакта = Новый Структура;
		СтруктураКонтакта.Вставить("НомерТелефона", сфпНомерПеревода);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("LineName", НайденныйЗвонок.LineName);
		ДополнительныеПараметры.Вставить("hCall", hCall);
		сфпВыполнитьПереключитьЗвонок(СтруктураКонтакта, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура сфпПодтвердитьПереводЗвонка(Команда)
	
	Если сфпПанельУправления = Неопределено Тогда Возврат; КонецЕсли;
	hCall = сфпПолучитьИдентификаторЗвонка(Обращение);
	Попытка 
		hCall = Число(hCall);
	Исключение
		Возврат;
	КонецПопытки;
	НайденныйЗвонок = сфпСофтФонПроКлиент.сфпНайтиДанныеЗвонка(hCall);
	Если НайденныйЗвонок = Неопределено Тогда Возврат; КонецЕсли;
	Если сфпИдентификаторПереводимогоЗвонка > 0 Тогда
		// Подтверждаем перевод звонка
		сфпПанельУправления.FinishTransferCall(НайденныйЗвонок.LineName, сфпИдентификаторПереводимогоЗвонка, "");
		сфпИдентификаторПереводимогоЗвонка = 0;
		Элементы.сфпПодтвердитьПеревод.Доступность 	= Ложь;
		Элементы.сфпУдержатьЗвонок.Доступность 		= Ложь;
		Элементы.сфпПереводЗвонка.Доступность 		= Ложь;
		Закрыть();
	Иначе
		сфпПанельУправления.DropCall(НайденныйЗвонок.LineName, hCall);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПоискДанныхИНастройка

&НаКлиенте
Процедура ВыполнитьПоиск(ОповещатьОбОшибках) Экспорт //++#1397 смарт: Балашов 27.07.2023 добавил "Экспорт" для вызова процедуры из CRM_ПоискКонтактовКлиент

	//++#1397 смарт: Балашов 27.07.2023 //Исправить ошибку на форме создания Интерес
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	//--#1397 смарт: Балашов 27.07.2023
	
	ОбрабатыватьАктивизациюПоиска = Истина;
	
	РезультатыПоиска.Очистить();
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	Для Сч = 1 По 3 Цикл
		ИмяПоля = "СтрокаПоискаДоп"+Строка(Сч);
		ЭтотОбъект[ИмяПоля] = СокрЛП(ЭтотОбъект[ИмяПоля]);
	КонецЦикла;
	
	// Проверка возможности поиска.
	Отказ = Ложь;
	ТекстСообщения = НСтр("ru='Минимальная длина строки поиска 3 символа.';en='Minimum length of the search line is 3 characters.'");
	Если ОповещатьОбОшибках И СтрДлина(СтрокаПоиска) < 3  И СтрДлина(СтрокаПоиска) > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СтрокаПоиска",, Отказ);
	КонецЕсли;	
	Для Сч = 1 По 3 Цикл
		ИмяПоля = "СтрокаПоискаДоп"+Строка(Сч);
		Если ОповещатьОбОшибках И СтрДлина(ЭтотОбъект[ИмяПоля]) < 3  И СтрДлина(ЭтотОбъект[ИмяПоля]) > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ИмяПоля,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		НастроитьЗаполнитьПоНайденнымДанным();
		Возврат;
	КонецЕсли;
	
	ВыполнитьПоискНаСервере();
	
	Если РезультатыПоиска.Количество() = 0 Тогда
		НастроитьЗаполнитьПоНайденнымДанным();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере(УсловияПоиска = Неопределено)
	
	Если УсловияПоиска = Неопределено Тогда
		
		// Анализ строк поиска, формализация условий и заполнение кэша.
		КэшПоиска = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		КэшЗаполнения = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		УсловияПоиска = Новый Массив;
		Если Не ПустаяСтрока(СтрокаПоиска) Тогда
			СтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(СтрокаПоиска, КэшПоиска, КэшЗаполнения);
			УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
		КонецЕсли;
		Для Сч = 1 По 3 Цикл
			ТекущаяСтрокаПоиска = ЭтотОбъект["СтрокаПоискаДоп" + Сч];
			Если Не ПустаяСтрока(ТекущаяСтрокаПоиска) Тогда
				СтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(ТекущаяСтрокаПоиска, КэшПоиска, КэшЗаполнения);
				УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Поиск.
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоиска, СпособПоиска, Истина);
	Если ЗначениеЗаполнено(РезультатПоиска.КодОшибки) Тогда
		НастроитьФормуПослеПоиска();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	НайденныеСсылки = Новый ТаблицаЗначений;
	НайденныеСсылки.Колонки.Добавить("Ссылка", Метаданные.ОпределяемыеТипы.CRM_КонтактДляПоиска.Тип);
	Для Каждого НайденнаяСсылка Из РезультатПоиска.Элементы Цикл
		НайденныеСсылки.Добавить().Ссылка = НайденнаяСсылка;
	КонецЦикла;
	Запрос.Параметры.Вставить("НайденныеСсылки", НайденныеСсылки);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, ПараметрыЗапросов);
	
	Запрос.Текст = ТекстЗапросаПоискаДанных();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		РезультатыПоиска.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	НастроитьФормуПослеПоиска();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатыПоискаПоПараметру(ИмяПараметра, ЗначениеПараметра)
	
	Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ИмяПараметра = "Клиент" Тогда
		Запрос.Текст = ТекстЗапросаЗаполненияПоКлиенту();
	ИначеЕсли ИмяПараметра = "Контакт" Тогда
		Запрос.Текст = ТекстЗапросаЗаполненияПоКонтакту();
	ИначеЕсли ИмяПараметра = "Интерес" Тогда
		Запрос.Текст = ТекстЗапросаЗаполненияПоИнтересу();
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Ссылка", ЗначениеПараметра);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, ПараметрыЗапросов);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	НоваяСтрока = РезультатыПоиска.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультатыПоиска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКэши(Знач КэшФИО, Знач КэшОрганизация, Знач КэшТелефон, Знач КэшEmail, Знач КэшURL)
	
	КэшФИО			= СокрЛП(КэшФИО);
	КэшОрганизация	= СокрЛП(КэшОрганизация);
	КэшТелефон		= СокрЛП(КэшТелефон);
	КэшEmail		= СокрЛП(КэшEmail);
	КэшURL			= СокрЛП(КэшURL);
	
	КэшПоиска.ФИО = КэшФИО;
	КэшЗаполнения.ФИО = CRM_КлиентыСервер.ПривестиФИОКСтандартномуВиду(КэшФИО);
	
	КэшПоиска.Организация = КэшОрганизация;
	КэшЗаполнения.Организация = КэшОрганизация;
	
	ПозДоб = Найти(ВРЕГ(КэшТелефон), ", ДОБ.");
	Если ПозДоб = 0 Тогда
		ПозДоб = Найти(ВРЕГ(КэшТелефон), ", EXT.");
	КонецЕсли;
	Если ПозДоб = 0 Тогда
		КэшПоиска.Телефон = CRM_ПоискКонтактов.ФорматироватьНомерДляПоиска(КэшТелефон);
	Иначе
		КэшПоиска.Телефон = CRM_ПоискКонтактов.ФорматироватьНомерДляПоиска(Лев(КэшТелефон, ПозДоб - 1));
	КонецЕсли;	
	СтруктураКИ = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(КэшТелефон);
	КэшЗаполнения.Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураКИ.КодСтраны, СтруктураКИ.КодГорода, СтруктураКИ.НомерТелефона, СтруктураКИ.Добавочный, "");
	
	КэшПоиска.Email = КэшEmail;
	КэшЗаполнения.Email = КэшEmail;
	
	КэшПоиска.URL = КэшURL;
	КэшЗаполнения.URL = КэшURL;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПослеПоиска()
	
	ЕстьНайденные = (РезультатыПоиска.Количество() > 0);
	
	Почта = КэшЗаполнения.Email;
	Телефон = КэшЗаполнения.Телефон;
	ИДАккаунта = КэшЗаполнения.URL;
	
	Для Каждого КлючИЗначение Из КэшЗаполнения Цикл
		
		ИмяПараметра = КлючИЗначение.Ключ;
		ЗначениеПараметра = КлючИЗначение.Значение;
		
		Если ИмяПараметра = "ИНН" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЭлемента = "Заполнить_" + ИмяПараметра;
		Если ИмяПараметра = "Телефон" Тогда
			ЗаголовокКоманды = НСтр("ru='Добавить телефон';en='Add Phone'") + ": " + ЗначениеПараметра;
			Элементы[ИмяЭлемента+"_Клиент"].Заголовок = ЗаголовокКоманды;
			Элементы[ИмяЭлемента+"_ПК"].Заголовок = ЗаголовокКоманды;
			Элементы[ИмяЭлемента+"_Контакт"].Заголовок = ЗаголовокКоманды;
		ИначеЕсли ИмяПараметра = "Email" Тогда
			ЗаголовокКоманды = НСтр("ru='Добавить Email';en='Add Email'") + ": " + ЗначениеПараметра;
			Элементы[ИмяЭлемента+"_Клиент"].Заголовок = ЗаголовокКоманды;
			Элементы[ИмяЭлемента+"_ПК"].Заголовок = ЗаголовокКоманды;
			Элементы[ИмяЭлемента+"_Контакт"].Заголовок = ЗаголовокКоманды;
		ИначеЕсли ИмяПараметра = "URL" Тогда
			ЗаголовокКоманды = НСтр("ru='Добавить';en='Add'") + " " + СокрЛП(Обращение.УчетнаяЗапись.ТипМессенджера) + ": " + ЗначениеПараметра;
			Элементы[ИмяЭлемента+"_Клиент"].Заголовок = ЗаголовокКоманды;
			Элементы[ИмяЭлемента+"_ПК"].Заголовок = ЗаголовокКоманды;
			Элементы[ИмяЭлемента+"_Контакт"].Заголовок = ЗаголовокКоманды;
		Иначе
			Элементы[ИмяЭлемента].Заголовок = НСтр("ru='Заполнить';en='Fill in'") + ": " + ЗначениеПараметра;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.СоздатьНовогоКлиента.Видимость = ЕстьНайденные И Не ОпределенКлиент;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗаполнитьПоНайденнымДанным()
	
	ТекущиеДанные = Элементы.РезультатыПоиска.ТекущиеДанные;
	РежимВвода = "";
	Элементы.ГруппаВзаимодействие.Видимость = Истина;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Ответственный = Неопределено;
		РежимВвода = "СброситьДанные";
		Клиент = Неопределено;
		Контакт = Неопределено;
		ПотенциальныйКлиент = Неопределено;
		Организация = ""; 
		Контрагент = Неопределено;
		
	Иначе
		
		Ответственный = Неопределено;
		Если ТипЗнч(ТекущиеДанные.Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
			РежимВвода = "ПотенциальныйКлиент";
			Клиент = Неопределено;
			Контакт = Неопределено;
			Контрагент = Неопределено;
			ПотенциальныйКлиент = ТекущиеДанные.Контакт;
			Организация = ТекущиеДанные.Организация;
		Иначе
			РежимВвода = "КлиентИКонтакт";
			Клиент = ТекущиеДанные.Клиент;
			Контакт = ТекущиеДанные.Контакт;
			РольВИнтересе = ТекущиеДанные.КонтактРоль;
			Контрагент = Неопределено;
			ПотенциальныйКлиент = Неопределено;
			Организация = "";
		КонецЕсли;
		
		Если ПодставлятьОтветственногоЗаКлиентаВИнтерес Тогда
			Ответственный = ТекущиеДанные.ОсновнойМенеджер;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойОтветственный");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ТекущийПользователь;
	КонецЕсли;
	ОсновнаяОрганизация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация", Ответственный);
	Проект = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойПроект", Ответственный);
	
	Если ВключеныОграниченияДоступа Тогда
		Элементы.ГруппаПраваяКолонка.ТолькоПросмотр = Ложь;
		Элементы.СоздатьНовыйИнтерес.Доступность = Истина;
		Элементы.СоздатьКонтакт.Доступность = Истина;
		Элементы.Перенаправить.Доступность = Истина;
		Элементы.ПеренаправитьНаРоль.Доступность = Истина;
	КонецЕсли;
	
	Если РежимВвода = "СброситьДанные" Тогда
		
		Описание = "";
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Клиент", Неопределено, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Контакт", Неопределено, Истина);
		
		Должность = Неопределено;
		
		ФИО = "";
		
		Элементы.ГруппаКлиент.Видимость = Ложь;
		Элементы.ГруппаКонтакт.Видимость = Ложь;
		
		Элементы.ГруппаФИО.Видимость = Истина;
		Элементы.ПотенциальныйКлиент.Видимость = Ложь;
		Элементы.ФИО.Видимость = Истина;
		Элементы.Компания.Видимость = Истина;
		Элементы.Компания.Доступность = Истина;
		
		Элементы.СоздатьКлиента.Видимость = ДоступноИзменениеПартнеров;
		Элементы.СоздатьКонтактОтмена.Видимость = Ложь;
		Элементы.СоздатьКонтактЗаписать.Видимость = Ложь;
		
		Элементы.Заполнить_Организация.Видимость = ЗначениеЗаполнено(КэшПоиска.Организация);
		Элементы.Заполнить_ФИО.Видимость = ЗначениеЗаполнено(КэшПоиска.ФИО);
		
		Элементы.Заполнить_Телефон_ПК.Видимость = Ложь;
		Элементы.Заполнить_Email_ПК.Видимость = Ложь;
		Элементы.Заполнить_URL_ПК.Видимость = Ложь;
		
		Элементы.ГруппаРеквизитыКлиента.Видимость = Ложь;
		Элементы.ГруппаРеквизитыКонтакта.Видимость = Ложь;
		Элементы.ГруппаРеквизитыПотенциальногоКлиента.Видимость = Истина;
		
		Элементы.ИДАккаунта.Видимость = ЗначениеЗаполнено(ИДАккаунта);
		
		// Переключение интерфейса ввода на Клиента
		Если ДоступноИзменениеПартнеров И РежимВводаНовогоКлиента = 0 Тогда
			СоздатьКлиента(Неопределено);
		КонецЕсли;
		
	ИначеЕсли РежимВвода = "ПотенциальныйКлиент" Тогда
		
		Описание = ОписаниеСтрокиНайденного(Неопределено, ПотенциальныйКлиент);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Клиент", ПотенциальныйКлиент, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Контакт", ПотенциальныйКлиент, Истина);
		
		Элементы.ГруппаКлиент.Видимость = Ложь;
		Элементы.ГруппаКонтакт.Видимость = Ложь;
		
		Элементы.ГруппаФИО.Видимость = Истина;
		Элементы.ПотенциальныйКлиент.Видимость = Истина;
		Элементы.ФИО.Видимость = Ложь;
		Элементы.Компания.Видимость = ЗначениеЗаполнено(Организация);
		Элементы.Компания.Доступность = Ложь;
		
		Элементы.Должность.Видимость = Ложь;
		
		Элементы.СоздатьКлиента.Видимость = ДоступноИзменениеПартнеров;
		Элементы.СоздатьКонтактОтмена.Видимость = Ложь;
		Элементы.СоздатьКонтактЗаписать.Видимость = Ложь;
		
		Элементы.Заполнить_Организация.Видимость = Ложь;
		Элементы.Заполнить_ФИО.Видимость = Ложь;
		
		РезультатПоискаКИ = НайтиКИ(ПотенциальныйКлиент, КэшПоиска);
		
		Элементы.Заполнить_Телефон_ПК.Видимость = ЗначениеЗаполнено(КэшПоиска.Телефон) И Не РезультатПоискаКИ.Телефон;
		Элементы.Заполнить_Email_ПК.Видимость = ЗначениеЗаполнено(КэшПоиска.Email) И Не РезультатПоискаКИ.Email;
		Элементы.Заполнить_URL_ПК.Видимость = ЗначениеЗаполнено(КэшПоиска.URL) И Не РезультатПоискаКИ.URL;
		
		Элементы.ГруппаРеквизитыКлиента.Видимость = Ложь;
		Элементы.ГруппаРеквизитыКонтакта.Видимость = Ложь;
		Элементы.ГруппаРеквизитыПотенциальногоКлиента.Видимость = Ложь;
		
		Элементы.ИДАккаунта.Видимость = Ложь;
		
	ИначеЕсли РежимВвода = "КлиентИКонтакт" Тогда
		
		ДоступенКлиент = Истина;
		ДоступенКонтакт = Истина;
		
		Если ВключеныОграниченияДоступа Тогда
			Описание = ОписаниеСтрокиНайденного(Клиент, Контакт, ВключеныОграниченияДоступа, ДоступенКлиент, ДоступенКонтакт);
		Иначе
			Описание = ОписаниеСтрокиНайденного(Клиент, Контакт);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Клиент", Клиент, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИнтересыКлиента, "Контакт", Контакт, Истина);
		
		Элементы.ГруппаКлиент.Видимость = Истина;
		Элементы.ГруппаКонтакт.Видимость = Истина;
		
		Элементы.ГруппаФИО.Видимость = Ложь;
		Элементы.Компания.Видимость = Ложь;
		Элементы.Заполнить_Организация.Видимость = Ложь;
		
		РезультатПоискаКИКлиент = НайтиКИ(Клиент, КэшПоиска);
		РезультатПоискаКИКонтакт = НайтиКИ(Контакт, КэшПоиска);
		
		Элементы.Заполнить_Телефон_Клиент.Видимость = ЗначениеЗаполнено(КэшПоиска.Телефон) И Не ЗначениеЗаполнено(Контакт) И Не РезультатПоискаКИКлиент.Телефон;
		Элементы.Заполнить_Email_Клиент.Видимость = ЗначениеЗаполнено(КэшПоиска.Email) И Не ЗначениеЗаполнено(Контакт) И Не РезультатПоискаКИКлиент.Email;
		Элементы.Заполнить_URL_Клиент.Видимость = ЗначениеЗаполнено(КэшПоиска.URL) И Не ЗначениеЗаполнено(Контакт) И Не РезультатПоискаКИКлиент.URL;
		
		Элементы.Заполнить_Телефон_Контакт.Видимость = ЗначениеЗаполнено(КэшПоиска.Телефон) И ЗначениеЗаполнено(Контакт) И Не РезультатПоискаКИКонтакт.Телефон;
		Элементы.Заполнить_Email_Контакт.Видимость = ЗначениеЗаполнено(КэшПоиска.Email) И ЗначениеЗаполнено(Контакт) И Не РезультатПоискаКИКонтакт.Email;
		Элементы.Заполнить_URL_Контакт.Видимость = ЗначениеЗаполнено(КэшПоиска.URL) И ЗначениеЗаполнено(Контакт) И Не РезультатПоискаКИКонтакт.URL;
		
		Элементы.ГруппаРеквизитыКлиента.Видимость = Ложь;
		Элементы.ГруппаРеквизитыКонтакта.Видимость = Ложь;
		Элементы.ГруппаРеквизитыПотенциальногоКлиента.Видимость = Ложь;
		
		Элементы.ИДАккаунта.Видимость = Ложь;
		
		Если ВключеныОграниченияДоступа Тогда
			Если Не (ДоступенКлиент И ДоступенКонтакт) Тогда
				ОбрабатыватьАктивизациюПоиска = Ложь;
				Элементы.ГруппаПраваяКолонка.ТолькоПросмотр = Истина;
				Элементы.СоздатьНовыйИнтерес.Доступность = Ложь;
				Элементы.СоздатьКонтакт.Доступность = Ложь;
				Элементы.Перенаправить.Доступность = Ложь;
				Элементы.ПеренаправитьНаРоль.Доступность = Ложь;
			КонецЕсли;
			Если Не ДоступенКлиент Тогда
				Элементы.ГруппаКлиент.Видимость = Ложь;
			КонецЕсли;
			Если Не ДоступенКонтакт Тогда
				Элементы.ГруппаКонтакт.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ИменаЭлементовИзменениеВидимости = Новый Массив;
	ИменаЭлементовИзменениеВидимости.Добавить(Элементы.РольВИнтересе.Имя);
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	Иначе
		ИменаЭлементовИзменениеВидимости.Добавить("Соглашение");
		ИменаЭлементовИзменениеВидимости.Добавить("Контрагент");
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	КонецЕсли;	
	УстановитьВидимостьРеквизитов(ИменаЭлементовИзменениеВидимости);
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Попытка
				Договор = CRM_ОбщегоНазначенияСервер.ПолучитьДоговорПартнера(Клиент,ОсновнаяОрганизация);
			Исключение
				// Обработка исключения не требуется.
			КонецПопытки;
		Иначе
			ЗаполнитьУсловияПродажПоУмолчанию();
			
			ОбрабатыватьАктивизациюПоиска = Ложь;
			ПодключитьОбработчикОжидания("ОбновитьСвязиПараметровВыбораРеквизитовФормы", 0.1, Истина);
		КонецЕсли;
		
	Иначе
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ЭтотОбъект["Договор"] = Неопределено;
		Иначе
			ЭтотОбъект["Соглашение"] = Неопределено;
			ЭтотОбъект["Контрагент"] = Неопределено;
			ЭтотОбъект["Договор"] = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ТипУслугиОтв = ПолучитьТипУслугиПользователя(Ответственный);
	
	Если ЗначениеЗаполнено(ТипУслугиОтв) И НЕ НеОбновлятьТипУслуги Тогда
		УстановитьЗначениеТипУслуги(ТипУслугиОтв);
	КонецЕсли;
	
	НеОбновлятьТипУслуги = Ложь;
	
	ОбновитьТипОбращения(Ответственный);
	
	ЗаполнитьДоступныеСценарииПродаж(ЭтотОбъект);
	
	ОпределитьУровеньПоддержки();
	сфпВидимостьИДоступностьГруппыСофтфон();
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьСтрокуПоиска()
	
	Элементы.СтрокаПоиска.Доступность = Ложь;
	Элементы.ДобавитьПолеПоиска0.Доступность = Ложь;
	
	КоличествоПолейПоиска = 1;
	
	Для Сч = 1 По 3 Цикл
		ЭтотОбъект["СтрокаПоискаДоп" + Сч] = "";
		Элементы["ГруппаПоиска" + Сч].Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеПоискаПоПараметру(ИмяПараметра, ЗначениеПараметра)
	
	Элементы["ГруппаПоиска" + Строка(КоличествоПолейПоиска)].Видимость = Истина;
	Элементы["ДобавитьПолеПоиска"+Строка(КоличествоПолейПоиска-1)].Видимость = Ложь;
	ЭтотОбъект["СтрокаПоискаДоп"+Строка(КоличествоПолейПоиска)] = ЗначениеПараметра;
	КоличествоПолейПоиска = КоличествоПолейПоиска + 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеДействия

&НаСервере
Функция СоздатьИнтересНаСервере()
	
	Результат = Ложь;
	
	Отказ = Ложь;
	ПервоеСостояниеИнтереса = ПервичноеСостояниеСценария;
	ПроверяемыеРеквизитыИнтереса = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПроверяемыеРеквизитыИнтересаВСостоянии(ПервоеСостояниеИнтереса);
	Если Не ЗначениеЗаполнено(ПервоеСостояниеИнтереса) Тогда
		ТекстСообщения = НСтр("ru='Не определено первое состояние интереса!';en='Primary lead state not defined!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СценарийПродажи",, Отказ);
	Иначе
		Если ПроверяемыеРеквизитыИнтереса.Найти("Партнер")<>Неопределено И НЕ ЗначениеЗаполнено(Клиент) Тогда
			ТекстСообщения = НСтр("ru='Не выбран клиент';en='No customer selected'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Клиент",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("ОжидаемаяВыручка")<>Неопределено И НЕ ЗначениеЗаполнено(ОжидаемаяВыручка) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Выручка""';en='Not Filled Box ""Revenue""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОжидаемаяВыручка",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("ОжидаемаяДатаПродажи")<>Неопределено И НЕ ЗначениеЗаполнено(ОжидаемаяДатаПродажи) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Дата продажи""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОжидаемаяДатаПродажи",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("Организация")<>Неопределено И НЕ ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Организация""';");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОсновнаяОрганизация",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("Проект")<>Неопределено И НЕ ЗначениеЗаполнено(Проект) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Проект""';");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Проект",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("Договор")<>Неопределено И НЕ ЗначениеЗаполнено(Договор) 
				И Элементы.Договор.Доступность Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Договор""';");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Договор",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("Соглашение")<>Неопределено И НЕ ЗначениеЗаполнено(ЭтотОбъект["Соглашение"]) 
				И Элементы["Соглашение"].Доступность Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Соглашение""';");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Соглашение",, Отказ);
		КонецЕсли;
		Если ПроверяемыеРеквизитыИнтереса.Найти("Контрагент")<>Неопределено И НЕ ЗначениеЗаполнено(ЭтотОбъект["Контрагент"]) 
				И Элементы["Контрагент"].Доступность Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Контрагент""';");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Контрагент",, Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
			Если ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
				Для Каждого ОписаниеДопРеквизита из ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов Цикл
					Если ПроверяемыеРеквизитыИнтереса.Найти(ОписаниеДопРеквизита.Свойство)<>Неопределено
						И НЕ ЗначениеЗаполнено(ЭтотОбъект[ОписаниеДопРеквизита.ИмяРеквизитаЗначение]) Тогда
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не заполнено поле ""%1""';"), ОписаниеДопРеквизита.Наименование);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ОписаниеДопРеквизита.ИмяРеквизитаЗначение,, Отказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) И Клиент.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
		Если Не ЗначениеЗаполнено(Контакт) И НЕ CRM_РазрешитьСозданиеИнтересаБезКЛ Тогда
			Если ПустаяСтрока(ФИО) Тогда
				
				Если Элементы.ГруппаФИО.Видимость Тогда
					Если Элементы.ФИО.Видимость Тогда
						ТекстСообщения = НСтр("ru='Не заполнено поле ""ФИО""';en='Not Filled Box ""Full Name""'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ФИО",, Отказ);	
					Иначе
						ТекстСообщения = НСтр("ru='Не заполнено поле ""Контакт""';en='Not Filled Box ""Contact""'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Контакт",, Отказ);	
					КонецЕсли;
				Иначе
					ТекстСообщения = НСтр("ru='Не заполнено поле ""Контакт""';en='Not Filled Box ""Contact""'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Контакт",, Отказ);	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
		ОбъектИнтерес							= Документы.CRM_Интерес.СоздатьДокумент();
		ОбъектИнтерес.Дата						= ТекущаяДатаСеанса();
		ОбъектИнтерес.Автор						= ТекущийПользователь;
		
		Если НЕ ЗначениеЗаполнено(Клиент) И Элементы.ГруппаРеквизитыКлиента.Видимость Тогда
			СоздатьКлиентаНаСервере();
		КонецЕсли;

		Если ЗначениеЗаполнено(Клиент) Тогда
			ОбъектИнтерес.Партнер				= Клиент;
			Если НЕ (ПустаяСтрока(Контакт_ФИО) ИЛИ ЗначениеЗаполнено(Контакт)) Тогда
				СоздатьКонтактНаСервере();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Контакт) Тогда
				ОбъектИнтерес.КонтактноеЛицо		= Контакт;
				СтрКонтакт = ОбъектИнтерес.Контакты.Добавить();
				СтрКонтакт.Контакт = Контакт;
				СтрКонтакт.Роль = РольВИнтересе;
				
				Если НЕ ЗначениеЗаполнено(Клиент.CRM_ОсновноеКонтактноеЛицо) Тогда
					КлиентОбъект = Клиент.ПолучитьОбъект();
					КлиентОбъект.CRM_ОсновноеКонтактноеЛицо = Контакт;
					КлиентОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			
			// Связывание Потенциального клиента с созданным Клиентом
			Если ЗначениеЗаполнено(ПотенциальныйКлиент)
				И НЕ ЗначениеЗаполнено(ПотенциальныйКлиент.Партнер) Тогда
				
				ПотенциальныйКлиентОбъект = ПотенциальныйКлиент.ПолучитьОбъект();
				ПотенциальныйКлиентОбъект.Партнер = Клиент;
				ПотенциальныйКлиентОбъект.КонтактноеЛицо = Контакт;
				ПотенциальныйКлиентОбъект.Записать();
				
				CRM_ОбщегоНазначенияСервер.ПереписатьАктивныеИнтересыСПотенциальногоКлиентаНаПартнера(ПотенциальныйКлиент, Клиент);
			
			КонецЕсли;
			
		Иначе
			Если Не ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
				СоздатьПотенциальныйКлиентНаСервере();
			КонецЕсли;
			ОбъектИнтерес.ПотенциальныйКлиент	= ПотенциальныйКлиент;
		КонецЕсли;
		
		ОбъектИнтерес.СостояниеИнтереса			= ПервоеСостояниеИнтереса;
		ОбъектИнтерес.ДокументОснование			= Обращение;
		ОбъектИнтерес.Описание					= Содержание;
		ОбъектИнтерес.ОжидаемаяВыручка			= РаботаСКурсамиВалют.ПересчитатьВВалюту(ОжидаемаяВыручка, Валюта, Константы.ВалютаУправленческогоУчета.Получить(), ТекущаяДатаСеанса());
		Если ЗначениеЗаполнено(ОжидаемаяДатаПродажи) Тогда
			ОбъектИнтерес.ОжидаемаяДатаПродажи	= ОжидаемаяДатаПродажи;
			ОбъектИнтерес.РучнойВводДатыПродажи	= РучнойВводДатыПродажи;
		КонецЕсли;
		ОбъектИнтерес.Ответственный				= Ответственный;
		ОбъектИнтерес.Подразделение				= CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(ОбъектИнтерес.Ответственный, "Подразделение");
		ОбъектИнтерес.Офис						= CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ОбъектИнтерес.Подразделение, "CRM_Офис");
		ОбъектИнтерес.Проект = Проект;
		Если ЗначениеЗаполнено(ТипУслуги) Тогда
			ОбъектИнтерес.ТипУслуги				= ТипУслуги;
		Иначе
			ОбъектИнтерес.ТипУслуги				= Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги;
		КонецЕсли;
		ОбъектИнтерес.Тема						= Тема;
		
		ОбъектИнтерес.Организация				= ОсновнаяОрганизация;
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Если НЕ ЗначениеЗаполнено(ОбъектИнтерес.Организация) Тогда
				ОбъектИнтерес.Организация				= CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Ответственный, "ОсновнаяОрганизация");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ОбъектИнтерес.Организация) Тогда
				ОбъектИнтерес.Организация			= CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию();
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ОбъектИнтерес.Организация) Тогда
				МодульCRM_Модуль_МетодыМодулейОбъектовДокументов = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_МетодыМодулейОбъектовДокументов");
				Если МодульCRM_Модуль_МетодыМодулейОбъектовДокументов <> Неопределено Тогда
					МодульCRM_Модуль_МетодыМодулейОбъектовДокументов.ЗаполнитьОрганизацию(ОбъектИнтерес);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Проект) Тогда
			ЗначениеНастройки = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойПроект");
			Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
				ОбъектИнтерес.Проект				= ЗначениеНастройки;
			КонецЕсли;
		КонецЕсли;
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Если ТипЗнч(ОбъектИнтерес.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
				Если ЗначениеЗаполнено(ОбъектИнтерес.Партнер) И ЗначениеЗаполнено(ОбъектИнтерес.Ответственный["CRM_УровеньДоступа"])
					И ОбъектИнтерес.Партнер["CRM_УровниДоступа"].Найти(ОбъектИнтерес.Ответственный["CRM_УровеньДоступа"],"УровеньДоступа") = Неопределено
					И ОбъектИнтерес.Партнер["CRM_УровниДоступа"].Количество() > 0 Тогда
					
					ПартнерОбъект = ОбъектИнтерес.Партнер.ПолучитьОбъект();
					НоваяСтрокаУровня = ПартнерОбъект["CRM_УровниДоступа"].Добавить();
					НоваяСтрокаУровня["УровеньДоступа"]= ОбъектИнтерес.Ответственный["CRM_УровеньДоступа"];
					ПартнерОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Если ЗначениеЗаполнено(ОбъектИнтерес.Партнер) Тогда
				Если НЕ ЗначениеЗаполнено(Договор) Тогда
					Договор = CRM_ОбщегоНазначенияСервер.ПолучитьДоговорПартнера(ОбъектИнтерес.Партнер, ОбъектИнтерес.Организация);
				КонецЕсли;
				Если ЗначениеЗаполнено(Договор) Тогда
					ОбъектИнтерес["Договор"] = Договор;
					ОбъектИнтерес.Валюта = Договор.ВалютаРасчетов;
					ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ОбъектИнтерес.Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
					ОбъектИнтерес["Курс"]      = ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
					ОбъектИнтерес["Кратность"] = ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
					ОбъектИнтерес["ВидСкидкиНаценки"] = Договор.ВидСкидкиНаценки;
					ВидЦен = Договор.ВидЦен;
					ОбъектИнтерес["ВидЦен"] = ВидЦен;
					ОбъектИнтерес["ЦенаВключаетНДС"] = ВидЦен.ЦенаВключаетНДС;
				КонецЕсли;
			Иначе
				ОбъектИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
				ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ОбъектИнтерес.Дата, Новый Структура("Валюта", ОбъектИнтерес.Валюта));
				ОбъектИнтерес["Курс"]      = ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
				ОбъектИнтерес["Кратность"] = ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
				ВидЦен = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ОсновнойВидЦенПродажи");;
				ОбъектИнтерес["ВидЦен"] = ВидЦен;
				ОбъектИнтерес["ЦенаВключаетНДС"] = ВидЦен.ЦенаВключаетНДС;
			КонецЕсли;
		Иначе
			ОбъектИнтерес.Валюта = Валюта;
			МодульCRM_Модуль_МетодыМодулейОбъектовДокументов = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_МетодыМодулейОбъектовДокументов");
			МодульCRM_Модуль_МетодыМодулейОбъектовДокументов.ИнтересЗаполнитьРеквизитыДокумента(ОбъектИнтерес, Ложь);
			Если ЗначениеЗаполнено(ОбъектИнтерес.Партнер) Тогда
				ИмяФО = "ИспользоватьСоглашенияСКлиентами";
				Если ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
					Если ЗначениеЗаполнено(ЭтотОбъект["Соглашение"]) Тогда
						ОбъектИнтерес.Соглашение = ЭтотОбъект["Соглашение"];
					// Иначе // закомментировано: не заполнять!
					//	ОбъектИнтерес.Соглашение = МодульCRM_Модуль_МетодыМодулейОбъектовДокументов.ВернутьПоследнееСоглашение(Клиент);
					КонецЕсли;
					ОбъектИнтерес.ЦенаВключаетНДС = ?(ОбъектИнтерес.Соглашение.Пустая(), Истина, ОбъектИнтерес.Соглашение.ЦенаВключаетНДС);
				КонецЕсли;
			Иначе
				ОбъектИнтерес.ЦенаВключаетНДС = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбъектИнтерес.Соглашение) Тогда
				CRM_Модуль_МетодыМодулейОбъектовДокументов.ИнтересЗаполнитьУсловияПродажПоСоглашению(ОбъектИнтерес);
			// Иначе // закомментировано: не заполнять!
			//	ОбъектИнтерес.ЗаполнитьУсловияПродажПоУмолчанию();
			КонецЕсли;
														
			Если ЗначениеЗаполнено(Контрагент) Тогда
				ОбъектИнтерес.Контрагент = Контрагент;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Договор) Тогда
				ОбъектИнтерес.Договор = Договор;
			КонецЕсли;
			
			МодульCRM_Модуль_МетодыМодулейМенеджеровДокументов = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_МетодыМодулейМенеджеровДокументов");
			ПараметрыЗаполнения = МодульCRM_Модуль_МетодыМодулейМенеджеровДокументов.ИнтересПараметрыЗаполненияНалогообложенияНДСПродажи(ОбъектИнтерес);
			
			ИзмененныеПараметры = Новый Структура("ПараметрыЗаполненияНалогообложенияНДСПродажи");
			ИзмененныеПараметры.ПараметрыЗаполненияНалогообложенияНДСПродажи = МодульCRM_Модуль_МетодыМодулейМенеджеровДокументов.ИнтересПараметрыЗаполненияНалогообложенияНДСПродажи(ОбъектИнтерес);
			ИзмененныеПараметры.ПараметрыЗаполненияНалогообложенияНДСПродажи.Договор = Неопределено;
			ИзмененныеПараметры.ПараметрыЗаполненияНалогообложенияНДСПродажи.Организация = Неопределено;
			
			УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ОбъектИнтерес.НалогообложениеНДС, ПараметрыЗаполнения, ИзмененныеПараметры);
		КонецЕсли;
		
		Если ЭтоПоддержка Тогда
			ОбъектИнтерес.ТипОбращения = ТипОбращения;
			ОбъектИнтерес.УровеньПоддержки = УровеньПоддержки;
			СрокиПоОбращению = Справочники.CRM_УровниПоддержки.СрокиПоУровнюПоддержки(ОбъектИнтерес.Дата, УровеньПоддержки);
			ЗаполнитьЗначенияСвойств(ОбъектИнтерес, СрокиПоОбращению);
		Иначе
			ОбъектИнтерес.ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес;
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
			Если ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
				CRM_УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, ОбъектИнтерес);
			КонецЕсли;
		КонецЕсли;
			
		//ОбъектИнтерес.УстановитьНовыйНомер(ПрефиксНомераИнтереса);
		Если Не ЗначениеЗаполнено(ОбъектИнтерес.Тема)  И НЕ СценарийПродажи.ЭтоПоддержка Тогда
			ОбъектИнтерес.ДополнительныеСвойства.Вставить("НеОтражатьВИстории");
			ОбъектИнтерес.Записать();
			ОбъектИнтерес.Прочитать();
			Если Не ЗначениеЗаполнено(ОбъектИнтерес.Тема) Тогда
				// Тема могла быть установлена триггером.
				ОбъектИнтерес.ДополнительныеСвойства.Вставить("ОбновитьИсторию", Истина);
				ОбъектИнтерес.ДополнительныеСвойства.Удалить("НеОтражатьВИстории");
				ОбъектИнтерес.Тема = "#"+ОбъектИнтерес.Номер;
				ОбъектИнтерес.Записать();
			КонецЕсли;
		Иначе
			ОбъектИнтерес.Записать();
		КонецЕсли;
		СозданныйИнтерес = ОбъектИнтерес.Ссылка;

		Если ЗначениеЗаполнено(Канал) Тогда
			Менеджер = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
			Менеджер.Период = ОбъектИнтерес.Дата;
			Менеджер.Сделка = СозданныйИнтерес;
			Менеджер.Партнер = ?(ОбъектИнтерес.Партнер.Пустая(), ОбъектИнтерес.ПотенциальныйКлиент, ОбъектИнтерес.Партнер);
			Менеджер.КаналПервичногоИнтереса = Канал;
			Менеджер.ИсточникПервичногоИнтереса = Источник;
			Менеджер.Записать(Истина);
		КонецЕсли;
		
		Если ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
			СтруктураДляЗаписи = РегистрыСведений.ПредметыПапкиВзаимодействий.РеквизитыВзаимодействия();
			СтруктураДляЗаписи.Предмет                 = СозданныйИнтерес;
			СтруктураДляЗаписи.РассчитыватьРассмотрено = Ложь;
			РегистрыСведений.ПредметыПапкиВзаимодействий.ЗаписатьПредметыПапкиВзаимодействий(Обращение, СтруктураДляЗаписи);
		ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
			КонтактноеЛицо = Неопределено;
			Если ЗначениеЗаполнено(Контакт) Тогда
				КонтактноеЛицо = Контакт;
			ИначеЕсли ЗначениеЗаполнено(Клиент) Тогда
				КонтактноеЛицо = Клиент;
			ИначеЕсли ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
				КонтактноеЛицо = ПотенциальныйКлиент;
			КонецЕсли;
			Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
				CRM_РаботаСМессенджерамиСервер.СвязатьВсеСообщенияПользователяСКонтактом(Обращение.УчетнаяЗапись.ТипМессенджера, Обращение.ID_Пользователя, КонтактноеЛицо);
			КонецЕсли;
		// +Рарус alexpr
		ИначеЕсли ТипЗнч(Обращение) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
			Если Обращение.Статус <> Перечисления.CRM_СтатусыДиалогов.ПринятВРаботу
				И Обращение.Статус <> Перечисления.CRM_СтатусыДиалогов.Закрыт Тогда
				Справочники.CRM_Диалоги.ПринятьДиалог(Обращение);                             
			КонецЕсли;
			Справочники.CRM_Диалоги.ДобавитьДействие(Обращение,
				 Перечисления.CRM_ДействияСДиалогами.ПринятоОбращение, ОбъектИнтерес.Дата, ОбъектИнтерес.Автор,
				 ОбъектИнтерес.Ссылка);
		// -Рарус alexpr
		КонецЕсли;
		
		Если Ответственный <> ТекущийПользователь
			И НЕ CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(ОбъектИнтерес.Ссылка)
			И НЕ ПервоеСостояниеИнтереса.НеСоздаватьЗадачу
			И ТипЗнч(Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
			СоздатьЗадачуНаСервере();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		Результат = ЗначениеЗаполнено(СозданныйИнтерес);
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ПотенциальныйКлиент = Неопределено;
		
		ТекстСообщения = НСтр("ru='Не удалось записать интерес. Подробности см. в журнале регистрации.';en='Could not write lead. For details, see in Event Log.'");
		ТекстЗаписиЖурнала = НСтр("ru='Принятие обращения (Интерес не создан)';en='New Request (Lead not created)'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации(ТекстЗаписиЖурнала, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьЗадачуНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаЗадачи = ТекущаяДатаСеанса();
	Если СозданныйИнтерес.ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес Тогда
		ТекстЗадачи = НСтр("ru='Обработать новый интерес клиента';en='Process new lead'") + ?(ЗначениеЗаполнено(Тема), " ("+Тема+")", "");
	Иначе
		ТекстЗадачи = НСтр("ru='Обработать новое обращение: '") + НРег(СозданныйИнтерес.ТипОбращения) + ?(ЗначениеЗаполнено(Тема), " ("+Тема+")", "");
	КонецЕсли;	
	
	ОбъектЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	ОбъектЗадача.Автор				= ТекущийПользователь;
	ОбъектЗадача.Исполнитель		= Ответственный;
	ОбъектЗадача.ПринятаКИсполнению	= Истина;
	ОбъектЗадача.Наименование		= ТекстЗадачи;
	ОбъектЗадача.Дата				= ДатаЗадачи;
	ОбъектЗадача.ДатаНачала			= ДатаЗадачи;

	СрокИсполнения = НачалоДня(ДатаЗадачи+60*60*24);
	СоответствиеДат = CRM_КалендарныеГрафики.ПолучитьСоответствиеДатРабочихДней(СрокИсполнения);
	Если СоответствиеДат.Количество() > 0 Тогда
		ОбъектЗадача.СрокИсполнения = КонецДня(CRM_КалендарныеГрафики.ПолучитьСоответствиеДатРабочихДней(СрокИсполнения).Получить(СрокИсполнения));
	Иначе
		ОбъектЗадача.СрокИсполнения = СрокИсполнения;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен календарный график! Срок исполнения задачи по обработке Интереса установлен без учета календаря!'"));
	КонецЕсли;
	
	ОбъектЗадача.CRM_Личная			= Истина;
	ОбъектЗадача.Предмет			= СозданныйИнтерес;
	ОбъектЗадача.Описание			= Содержание;
	ОбъектЗадача.CRM_Партнер		= Клиент;
	ОбъектЗадача.CRM_КонтактноеЛицо	= Контакт;
	ОбъектЗадача.Записать();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПотенциальныйКлиентНаСервере()
	
	ПотенциальныйКлиентОбъект = Справочники.CRM_ПотенциальныеКлиенты.СоздатьЭлемент();
	ПотенциальныйКлиентОбъект.Наименование = ФИО;
	ПотенциальныйКлиентОбъект.Организация = Организация;
	ПотенциальныйКлиентОбъект.Должность = Должность;
	ПотенциальныйКлиентОбъект.БизнесРегион = БизнесРегион;
	ПотенциальныйКлиентОбъект.Отрасль = Отрасль;
	ПотенциальныйКлиентОбъект.Родитель = РодительПК;
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
		Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Почта) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
		ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Почта, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИДАккаунта) Тогда
		ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка());
		ТипКИ = ВидКИ.Тип;
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ИДАккаунта);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
			ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		Иначе
			СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
			ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, ИДАккаунта, ВидКИ);
		КонецЕсли;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		Если ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
			CRM_УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, ПотенциальныйКлиентОбъект);
		КонецЕсли;
	КонецЕсли;

	ПотенциальныйКлиентОбъект.Записать();
	ПотенциальныйКлиент = ПотенциальныйКлиентОбъект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКлиентаНаСервере()
	
	Если ЗначениеЗаполнено(Клиент_Телефон) Тогда
		ВидКИ = Константы.CRM_ОсновнойВидТелефонаКлиента.Получить();
		Если Не ЗначениеЗаполнено(ВидКИ) Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
		КонецЕсли;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Клиент_Телефон);
		Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Клиент_Объект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_МобТелефон) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Клиент_МобТелефон);
		Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
		ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Клиент_Объект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_Email) Тогда
		ВидКИ = Константы.CRM_ОсновнойВидEmailКлиента.Получить();
		Если Не ЗначениеЗаполнено(ВидКИ) Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
		КонецЕсли;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
		ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Клиент_Email, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Клиент_Объект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_Адрес) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		ТипКИ = ВидКИ.Тип;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Клиент_Объект, Клиент_АдресЗначение, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_Мессенджер) Тогда
		ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.Партнеры.ПустаяСсылка());
		ТипКИ = ВидКИ.Тип;
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Клиент_Мессенджер);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
			ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		Иначе
			СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
			ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Клиент_Мессенджер, ВидКИ);
		КонецЕсли;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Клиент_Объект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент_ЮрАдрес) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_ЮрАдрес;
		ТипКИ = ВидКИ.Тип;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Клиент_Объект, Клиент_ЮрАдресЗначение, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		Если ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
			CRM_УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, Клиент_Объект);
		КонецЕсли;
	КонецЕсли;

	Для каждого ТипОтношений из CRM_ВсеТипыОтношений Цикл
		Если ТипОтношений.Пометка Тогда
			НовСтр = Клиент_Объект.CRM_ТипыОтношений.Добавить();
			НовСтр.ТипОтношений = ТипОтношений.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Клиент_Объект, "CRM_ИНН") Тогда
		Клиент_Объект["CRM_ИНН"] = Клиент_ИНН;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Клиент_Объект, "CRM_КПП") Тогда
		Клиент_Объект["CRM_КПП"] = Клиент_КПП;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Клиент_Объект.ОсновнойМенеджер) Тогда
		Клиент_Объект.ОсновнойМенеджер = Ответственный;
	КонецЕсли;
	Клиент_Объект.CRM_Автор = ТекущийПользователь;
	
	НовыйКлиент = РеквизитФормыВЗначение("Клиент_Объект");
	НовыйКлиент.ДатаРегистрации = ТекущаяДатаСеанса();
	НовыйКлиент.Записать();
	Клиент = НовыйКлиент.Ссылка;
	
	CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСКонтрагентами");
	Если CRM_Модуль <> Неопределено Тогда
		CRM_Модуль.СоздатьКонтрагентаПриСозданииПартнера(ЭтотОбъект, Клиент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтактНаСервере()
	
	НовоеКЛ = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
	НовоеКЛ.Владелец = Клиент;
	НовоеКЛ.Наименование = Контакт_ФИО;
	
	НаименованиеДляОбработки = Контакт_ФИО;
	Если ЗначениеЗаполнено(Контакт_Фамилия) Тогда
		НовоеКЛ.CRM_Фамилия = Контакт_Фамилия;
	Иначе
		НовоеКЛ.CRM_Фамилия = CRM_КлиентыСервер.ВыделитьЧастьНаименованияКонтактногоЛица(НаименованиеДляОбработки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт_Имя) Тогда
		НовоеКЛ.CRM_Имя = Контакт_Имя;
	Иначе
		НовоеКЛ.CRM_Имя = CRM_КлиентыСервер.ВыделитьЧастьНаименованияКонтактногоЛица(НаименованиеДляОбработки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт_Отчество) Тогда
		НовоеКЛ.CRM_Отчество = Контакт_Отчество;
	Иначе
		НовоеКЛ.CRM_Отчество = CRM_КлиентыСервер.ВыделитьЧастьНаименованияКонтактногоЛица(НаименованиеДляОбработки);
	КонецЕсли;
	
	
	НовоеКЛ.Комментарий = Контакт_Описание;
	НовоеКЛ.CRM_Состояние = Перечисления.CRM_Состояние.Работает;
	НовоеКЛ.CRM_Должность = Должность;
	НовоеКЛ.CRM_РольКонтактногоЛица = РольКонтактногоЛица;
	НовоеКЛ.ДатаРегистрацииСвязи = ТекущаяДатаСеанса();
	Если НЕ ЗначениеЗаполнено(ПолКонтактногоЛица) Тогда
		НовоеКЛ.Пол = CRM_КлиентыСервер.ОпределитьПол(НовоеКЛ.CRM_Имя);
	Иначе
		НовоеКЛ.Пол = ПолКонтактногоЛица;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт_Телефон) Тогда
		ВидКИ = Константы.CRM_ОсновнойВидТелефонаКонтакта.Получить();
		Если Не ЗначениеЗаполнено(ВидКИ) Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		КонецЕсли;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Контакт_Телефон);
		Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовоеКЛ, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерМобильногоТелефона) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерМобильногоТелефона);
		Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
		ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовоеКЛ, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт_Email) Тогда
		ВидКИ = Константы.CRM_ОсновнойВидEmailКонтакта.Получить();
		Если Не ЗначениеЗаполнено(ВидКИ) Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		КонецЕсли;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
		ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Контакт_Email, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовоеКЛ, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт_Мессенджер) Тогда
		ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
		ТипКИ = ВидКИ.Тип;
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Контакт_Мессенджер);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
			ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		Иначе
			СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
			ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Контакт_Мессенджер, ВидКИ);
		КонецЕсли;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовоеКЛ, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		Если ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
			CRM_УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, НовоеКЛ);
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаРожденияКЛ) Тогда
		НовоеКЛ.ДатаРождения = ДатаРожденияКЛ;
		ВидСобытия = Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию(Нстр("ru='День рождения контактного лица'"), Истина);
		Если НЕ (ВидСобытия = Справочники.CRM_ВидыКлючевыхСобытий.ПустаяСсылка()) Тогда
			НовСтрока = НовоеКЛ.CRM_КлючевыеСобытия.Добавить();
			НовСтрока.ВидСобытия = ВидСобытия;
			НовСтрока.ДатаСобытия = ДатаРожденияКЛ;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусКЛ) Тогда
		НовСтрока = НовоеКЛ.CRM_Статусы.Добавить();
		НовСтрока.Статус = СтатусКЛ;
	КонецЕсли;
	
	НовоеКЛ.Автор = ТекущийПользователь;
	НовоеКЛ.Записать();
	Контакт = НовоеКЛ.Ссылка;

КонецПроцедуры

&НаСервере
Процедура СвязатьОбращениеСИнтересомНаСервере(ТекущийИнтерес)
	
	ОбращениеЗаполнено = ЗначениеЗаполнено(Обращение)
		И ТипЗнч(Обращение) <> Тип("ДокументСсылка.CRM_Интерес")
		И ТипЗнч(Обращение) <> Тип("ДокументСсылка.CRM_Телемаркетинг")
		И ТипЗнч(Обращение) <> Тип("ЗадачаСсылка.ЗадачаИсполнителя");
	
	Если Не ОбращениеЗаполнено Тогда
		Возврат;
	КонецЕсли;
	
	ОбращениеОбъект = Обращение.ПолучитьОбъект();
	
	ЭтоВзаимодействие = ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_Взаимодействие");
	Если ЭтоВзаимодействие Тогда
		ОбращениеОбъект.ДокументОснование = ТекущийИнтерес;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ЛОЖЬ КАК ВведенНаОсновании,
	|	ИСТИНА КАК ОсновнойИнтерес
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Ссылка = &СсылкаИнтерес
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_Интерес.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("СсылкаИнтерес" , ТекущийИнтерес);
	
	ТаблицаСвязей = Запрос.Выполнить().Выгрузить();
	Если ТаблицаСвязей.Количество() > 0 Тогда
		ОбращениеОбъект.ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов",ТаблицаСвязей);
	КонецЕсли;
	
	ОбращениеЯвляетсяЛидом = РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Обращение);
	Если ОбращениеЯвляетсяЛидом и НЕ ЭтоВзаимодействие Тогда
			ПараметрСостояниеЛида = Справочники.CRM_СостоянияЛидов.Сконвертирован;
			Если ЭтоСвязываниеИнтереса Тогда
				ПараметрСостояниеЛида = Справочники.CRM_СостоянияЛидов.ПовторныйОбработанный;
			КонецЕсли;
			РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Обращение, ПараметрСостояниеЛида, ТекущийИнтерес);
	КонецЕсли;
	
	Если ОбращениеЯвляетсяЛидом и ОбщегоНазначения.ЕстьРеквизитОбъекта("CRM_СкрытьВАРМ", ОбращениеОбъект.Метаданные()) Тогда
		ОбращениеОбъект.CRM_СкрытьВАРМ = Истина;
	КонецЕсли;
	
	ОбращениеОбъект.Ответственный = Ответственный;
	ОбращениеОбъект.Записать();
	
	ПеренестиПисьмоВОбработанные(Обращение);	
	
КонецПроцедуры

&НаСервере
Функция ПрикрепитьКВыбранномуНаСервере(ТекущийИнтерес)
	
	Если ТекущийИнтерес.Ответственный <> ТекущийПользователь
		И ТипЗнч(ТекущийИнтерес.Ответственный) = Тип("СправочникСсылка.Пользователи")
		И СоздаватьЗадачуПриСвязывании Тогда
		
		ДатаЗадачи = ТекущаяДатаСеанса();
		ТекстЗадачи = НСтр("ru='Обработать обращение клиента';en='Process lead'");
		
		ОбъектЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ОбъектЗадача.Автор 				= ТекущийПользователь;
		ОбъектЗадача.Исполнитель		= ТекущийИнтерес.Ответственный;
		ОбъектЗадача.ПринятаКИсполнению	= Истина;
		ОбъектЗадача.Наименование		= ТекстЗадачи;
		ОбъектЗадача.Дата				= ДатаЗадачи;
		ОбъектЗадача.ДатаНачала			= ДатаЗадачи;
		ОбъектЗадача.СрокИсполнения		= ДатаЗадачи;
		ОбъектЗадача.CRM_Личная			= Истина;
		ОбъектЗадача.Предмет			= ТекущийИнтерес;
		ОбъектЗадача.Описание			= Содержание;
		ОбъектЗадача.CRM_Партнер		= Клиент;
		ОбъектЗадача.CRM_КонтактноеЛицо	= Контакт;
		ОбъектЗадача.Записать();
		
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") И ЗначениеЗаполнено(Содержание) Тогда
		
		ОбъектЗвонок = Обращение.ПолучитьОбъект();
		ОбъектЗвонок.Комментарий = Содержание;
		ОбъектЗвонок.Записать();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Содержание) Тогда
		
		ФорматированныйТекст = Новый ФорматированныйДокумент;
		ФорматированныйТекст.УстановитьHTML(Содержание, Новый Структура);
		СодержаниеЗаметки = Новый ХранилищеЗначения(ФорматированныйТекст, Новый СжатиеДанных(9));
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ДатаИзменения",			ТекущаяДатаСеанса());
		ДанныеЗаполнения.Вставить("Предмет",				ТекущийИнтерес);
		ДанныеЗаполнения.Вставить("Автор",					ТекущийПользователь);
		ДанныеЗаполнения.Вставить("Содержание",				СодержаниеЗаметки);
		ДанныеЗаполнения.Вставить("ТекстСодержания",			Содержание);
		ДанныеЗаполнения.Вставить("CRM_ЗаметкаЛенты",			Истина);
		
		ЗаметкаОбъект = Справочники.Заметки.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ЗаметкаОбъект, ДанныеЗаполнения);
		ЗаметкаОбъект.Записать();
		
	КонецЕсли;
	
	СвязатьОбращениеСИнтересомНаСервере(ТекущийИнтерес);
	
КонецФункции

&НаСервере
Процедура ДописатьИнформациюВОснованиеОбращения(ПричинаОтказа, Комментарий)
	
	Если Не ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Возврат;
	КонецЕсли;
	
	ТелефонныйЗвонок = Обращение.ПолучитьОбъект();
	ТелефонныйЗвонок.CRM_СкрытьВАРМ = Истина;
	ТелефонныйЗвонок.Комментарий = ТелефонныйЗвонок.Комментарий+?(ЗначениеЗаполнено(ТелефонныйЗвонок.Комментарий), Символы.ПС, "")
		+НСтр("ru='Обращение потеряно по причине';en='Request is lost for a reason'")+": "+Строка(ПричинаОтказа)
		+Символы.ПС+Комментарий;
	АбонентВТелефонномЗвонке = ТелефонныйЗвонок.АбонентКонтакт;
	Если ЗначениеЗаполнено(ПотенциальныйКлиент) И ПотенциальныйКлиент <> АбонентВТелефонномЗвонке Тогда
		ТелефонныйЗвонок.АбонентКонтакт 		= ПотенциальныйКлиент;
		ТелефонныйЗвонок.АбонентПредставление 	= Строка(ТелефонныйЗвонок.АбонентКонтакт);
	ИначеЕсли ЗначениеЗаполнено(Контакт) И Контакт <> АбонентВТелефонномЗвонке Тогда
		ТелефонныйЗвонок.АбонентКонтакт 		= Контакт;
		ТелефонныйЗвонок.АбонентПредставление 	= Строка(ТелефонныйЗвонок.АбонентКонтакт);
	КонецЕсли;
	Попытка
		ТелефонныйЗвонок.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСостояниеОтклоненногоЛида(ОснованиеОбращения, ПричинаОтказа, Комментарий)
	
	Если ТипЗнч(ОснованиеОбращения) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
		ИЛИ ТипЗнч(ОснованиеОбращения) = Тип("ДокументСсылка.ТелефонныйЗвонок")
		ИЛИ ТипЗнч(ОснованиеОбращения) = Тип("ДокументСсылка.CRM_Заявка")
		ИЛИ ТипЗнч(ОснованиеОбращения) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		Если ЗначениеЗаполнено(ОснованиеОбращения) И РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(ОснованиеОбращения) Тогда
			РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(ОснованиеОбращения, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа, Комментарий);
		КонецЕсли;
		ОбъектОбращение = ОснованиеОбращения.ПолучитьОбъект();
		ОбъектОбращение.CRM_СкрытьВАРМ = Истина;
		Если Не ЗначениеЗаполнено(ОбъектОбращение.Ответственный) Тогда
			ОбъектОбращение.Ответственный = ТекущийПользователь;
		КонецЕсли;
		ОбъектОбращение.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Поддержка

&НаКлиенте
Процедура ОпределитьУровеньПоддержки()
	
	Если Не ЭтоПоддержка Тогда
		Возврат;
	КонецЕсли;
	
	ПоляФормы = Новый Структура;
	ПоляФормы.Вставить("КонтактноеЛицо",	Контакт);
	ПоляФормы.Вставить("Организация",		Организация);
	ПоляФормы.Вставить("Ответственный",		Ответственный);
	ПоляФормы.Вставить("Партнер",			Клиент);
	ПоляФормы.Вставить("ТипУслуги",			ТипУслуги);
	ПоляФормы.Вставить("ТипОбращения",		ТипОбращения);
	ПоляФормы.Вставить("Проект",		Проект);
	
	ДанныеУровня = ДанныеУровняПоддержки(ПоляФормы);
	
	УровеньПоддержки  = ДанныеУровня.Уровень;
	ВремяРеакции = ДанныеУровня.ВремяРеакции;
	ВремяРешения = ДанныеУровня.ВремяРешения;
	УровеньПоддержкиОписание = ДанныеУровня.Описание;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеУровняПоддержки(Знач ПоляФормы)
	
	ДанныеОбращения = Справочники.CRM_УровниПоддержки.ОписаниеДанныхОбращения();
	СтрокаНабора = ДанныеОбращения.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаНабора, ПоляФормы);
	
	СтрокаНабора.Ключ			= Строка(Новый УникальныйИдентификатор);
	СтрокаНабора.Дата			= ТекущаяДатаСеанса();
	СтрокаНабора.Подразделение	= CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(ПоляФормы.Ответственный, "Подразделение");
	
	ДанныеУровня = Справочники.CRM_УровниПоддержки.ДанныеУровняПоддержки(ДанныеОбращения);
	
	Цвет = ЦветаСтиля.CRM_ОсновнойГолубой;
	Шрифт = Новый Шрифт(,,Истина);
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ДанныеУровня.Уровень);
	
	Описания = Новый Массив;
	Описания.Добавить(НСтр("ru = 'Поддержка'") + ": ");
	Описания.Добавить(Новый ФорматированнаяСтрока(Строка(ДанныеУровня.Уровень), Шрифт, Цвет,, НавигационнаяСсылка));
	Описания.Добавить(" " + НСтр("ru = 'Время реакции'") + ": ");
	Описания.Добавить(Новый ФорматированнаяСтрока(Формат(ДанныеУровня.ВремяРеакции, "ЧФ='Ч ч.'"), Шрифт, Цвет));
	Описания.Добавить(" " + НСтр("ru = 'Время решения'") + ": ");
	Описания.Добавить(Новый ФорматированнаяСтрока(Формат(ДанныеУровня.ВремяРешения, "ЧФ='Ч ч.'"), Шрифт, Цвет));
	
	ДанныеУровня.Вставить("Описание", Новый ФорматированнаяСтрока(Описания));
	
	Возврат ДанныеУровня;
	
КонецФункции

#КонецОбласти

#Область ПрочиеДействия

&НаКлиенте
Процедура ОбработкаВыбораПартнераИсточника(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы	= Новый Структура("Отбор", Новый Структура("Владелец", РезультатЗакрытия));
	ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", ПараметрыФормы, ДополнительныеПараметры.Элемент);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоКаналу()
	
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Элементы.Источник.ПодсказкаВвода = Строка(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Канал, "ТипЗначения"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Канал) И ТипПВХ(Канал) <> Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.Источник.Видимость = Истина;
		Элементы.Источник.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Источник.Видимость = Ложь;
		Элементы.Источник.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Канал) И Не ЗначениеЗаполнено(Источник) Тогда
		Элементы.Источник.АвтоОтметкаНезаполненного = Истина;
		Элементы.Источник.ОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Источник.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Источник.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Канал) И ТипПВХ(Канал) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.Источник.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Источник.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Элементы.Источник.ОграничениеТипа = Новый ОписаниеТипов(Канал.ТипЗначения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДоступныеСценарииПродаж(Форма)
	
	СписокВыбора = Форма.Элементы.СценарийПродажи.СписокВыбора;
	
	ПараметрыСценариев = Новый Структура;
	ПараметрыСценариев.Вставить("ТипУслуги", Форма.ТипУслуги);
	ПараметрыСценариев.Вставить("ИспользоватьТипыУслуг", Форма.ИспользоватьТипыУслуг);
	ПараметрыСценариев.Вставить("Ответственный", Форма.Ответственный);
	ПараметрыСценариев.Вставить("ДоступныКарты", Форма.ДоступныКарты);
	ПараметрыСценариев.Вставить("ТипОбращения", Форма.ТипОбращения);
	ПараметрыСценариев.Вставить("ЭтоПоддержка", Форма.ЭтоПоддержка);
	
	ДоступныеСценарии = ПолучитьДоступныеСценарииПродаж(ПараметрыСценариев);
	
	СписокВыбора.Очистить();
	Для Каждого Элемент Из ДоступныеСценарии Цикл
		СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление,, Элемент.Картинка);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Форма.СценарийПродажи) Тогда
		Если СписокВыбора.Количество() > 0 Тогда
			Форма.СценарийПродажи = СписокВыбора[0].Значение;
		КонецЕсли;
	Иначе
		Если СписокВыбора.Количество() > 0 Тогда
			Если СписокВыбора.Количество() = 1 Тогда
				Форма.СценарийПродажи = СписокВыбора[0].Значение;
			ИначеЕсли СписокВыбора.НайтиПоЗначению(Форма.СценарийПродажи) = Неопределено Тогда
				Форма.СценарийПродажи = СписокВыбора[0].Значение;
			КонецЕсли;
		Иначе
			Форма.СценарийПродажи = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФормуПоСценариюПродаж(Форма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныеСценарииПродаж(Знач ПараметрыСценариев)
	Возврат Обработки.CRM_МастерРегистрацииОбращения.ПолучитьДоступныеСценарииПродаж(ПараметрыСценариев);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФормуПоСценариюПродаж(Форма)
	
	Элементы = Форма.Элементы;
	
	Если ТипЗнч(Форма.СценарийПродажи) = Тип("СправочникСсылка.CRM_КартыМаршрутов") Тогда
		Элементы.СоздатьНовыйИнтерес.Заголовок = НСтр("ru='Запустить бизнес-процесс';en='Start Business Process'");
		Элементы.ОткрыватьИнтерес.Видимость = Ложь;
		Элементы.ОткрыватьИнтересОбращение.Видимость = Ложь;
		Элементы.СоздаватьЗадачуПриСвязывании.Видимость = Ложь;
	Иначе
		Если Форма.ЭтоПоддержка Тогда
			Элементы.СоздатьНовыйИнтерес.Заголовок = НСтр("ru = 'Создать обращение'");
		Иначе
			Элементы.СоздатьНовыйИнтерес.Заголовок = НСтр("ru = 'Создать интерес'");
		КонецЕсли;
		УстановитьВидимостьОткрыватьИнтерес(Форма);
		Элементы.ОткрыватьИнтересОбращение.Видимость = Элементы.ПрикрепитьКВыбранному.Доступность;		
		#Если Клиент Тогда
			УстановитьВидимостьСоздаватьЗадачуПриСвязывании(Форма, Элементы.ПрикрепитьКВыбранному.Доступность);
		#Иначе
			Элементы.СоздаватьЗадачуПриСвязывании.Видимость = Элементы.ПрикрепитьКВыбранному.Доступность;
		#КонецЕсли
			
	КонецЕсли;
	
	НастроитьРолевуюАдресацию(Форма, РолеваяАдресацияРазрешена(Форма.СценарийПродажи));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроверяемыеРеквизитыИнтереса()
	
	ПервичноеСостояниеСценария = Справочники.CRM_СостоянияИнтересов.ПервичноеСостояниеСценария(СценарийПродажи);
	ПроверяемыеРеквизитыИнтереса = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПроверяемыеРеквизитыИнтересаВСостоянии(ПервичноеСостояниеСценария);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиКИ(Знач ОбъектПоиска, Знач КэшПоиска)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатПоиска = Новый Структура;
	РезультатПоиска.Вставить("Телефон", Ложь);
	РезультатПоиска.Вставить("Email", Ложь);
	РезультатПоиска.Вставить("URL", Ложь);
	
	Если Не ЗначениеЗаполнено(ОбъектПоиска) Тогда
		Возврат РезультатПоиска;
	КонецЕсли;
	
	ИскатьТелефон = ЗначениеЗаполнено(КэшПоиска.Телефон);
	ИскатьEmail = ЗначениеЗаполнено(КэшПоиска.Email);
	ИскатьURL = ЗначениеЗаполнено(КэшПоиска.URL);
	
	КонтактнаяИнформация = ОбъектПоиска.КонтактнаяИнформация;
	Если КонтактнаяИнформация.Количество() = 0 Тогда
		Возврат РезультатПоиска;
	КонецЕсли;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если ИскатьТелефон И Не РезультатПоиска.Телефон Тогда
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
				И СтрНайти(СтрокаКИ.НомерТелефона, КэшПоиска.Телефон) > 0 Тогда
				РезультатПоиска.Телефон = Истина;
			КонецЕсли;
		КонецЕсли;
		Если ИскатьEmail И Не РезультатПоиска.Email Тогда
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты
				И СтрНайти(СтрокаКИ.АдресЭП, КэшПоиска.Email) > 0 Тогда
				РезультатПоиска.Email = Истина;
			КонецЕсли;
		КонецЕсли;
		Если ИскатьURL И Не РезультатПоиска.URL Тогда
			Если СтрокаКИ.Представление = КэшПоиска.URL Тогда
				РезультатПоиска.URL = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Процедура ДобавитьКИНаСервере(ПризнакТипа, ПризнакВладельца, Представление)
	
	Если ПризнакТипа = "Email" Тогда ПризнакТипа = "Почта"; КонецЕсли;
	
	Если ПризнакВладельца = "Клиент" И ЗначениеЗаполнено(Клиент) Тогда
		
		ВладелецОбъект = Клиент.ПолучитьОбъект();
		Если ПризнакТипа = "Телефон" Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
		ИначеЕсли ПризнакТипа = "Почта" Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
		ИначеЕсли ПризнакТипа = "Мессенждер" Тогда
			ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.Партнеры.ПустаяСсылка());
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ПризнакВладельца = "Контакт" И ЗначениеЗаполнено(Контакт) Тогда
		
		ВладелецОбъект = Контакт.ПолучитьОбъект();
		Если ПризнакТипа = "Телефон" Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		ИначеЕсли ПризнакТипа = "Почта" Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		ИначеЕсли ПризнакТипа = "Мессенждер" Тогда
			ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ПризнакВладельца = "ПотенциальныйКлиент" И ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
		
		ВладелецОбъект = ПотенциальныйКлиент.ПолучитьОбъект();
		Если ПризнакТипа = "Телефон" Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
		ИначеЕсли ПризнакТипа = "Почта" Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
		ИначеЕсли ПризнакТипа = "Мессенждер" Тогда
			ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка());
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ПризнакТипа = "Телефон" Тогда
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураКИ = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Представление);
		ПредставлениеКИ = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураКИ.КодСтраны, СтруктураКИ.КодГорода, СтруктураКИ.НомерТелефона, СтруктураКИ.Добавочный, "");
		ДанныеКИ = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(СокрЛП(ПредставлениеКИ));
	ИначеЕсли ПризнакТипа = "Почта" Тогда
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ПредставлениеКИ = Представление;
		ДанныеКИ = Представление;
	ИначеЕсли ПризнакТипа = "Мессенждер" Тогда
		ТипКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ТипКИМессенджера(Обращение.УчетнаяЗапись);
		СтруктураКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
		ПредставлениеКИ = Представление;
		ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураКИ, Представление, ВидКИ);
	Иначе
		Возврат;
	КонецЕсли;
	
	СтрокаКИ = ВладелецОбъект.КонтактнаяИнформация.Добавить();
	СтрокаКИ.Тип = ТипКИ;
	СтрокаКИ.Вид = ВидКИ;
	СтрокаКИ.Представление = ПредставлениеКИ;
	Если ПризнакТипа = "Телефон" Тогда
		СтрокаКИ.НомерТелефона = ДанныеКИ;
	ИначеЕсли ПризнакТипа = "Почта" Тогда
		СтрокаКИ.АдресЭП = ДанныеКИ;
	ИначеЕсли ПризнакТипа = "Мессенждер" Тогда
		СтрокаКИ.ЗначенияПолей = ДанныеКИ;
	КонецЕсли;
	
	ВладелецОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокФильтраПоИнтересам()
	
	Если РежимФильтраПоИнтересам = РежимФильтраПоИнтересамАктивные() Тогда
		РежимФильтраПоИнтересам = РежимФильтраПоИнтересамВсе();
	Иначе
		РежимФильтраПоИнтересам = РежимФильтраПоИнтересамАктивные();
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.РежимФильтраПоИнтересам", "МастерРегистрации", РежимФильтраПоИнтересам);
	
Конецпроцедуры

Процедура ОбновитьДанныеОбработкиОбращения(ДатаОбработки, ОтветственныйЗаОбработку)
	
	ШаблонЗаголовкаДата = НСтр("ru = 'Дата обработки: %1'; en = 'Processing Date: %1'");
	Элементы.Обращение_ДатаОбработки.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовкаДата, Формат(ДатаОбработки,"ДФ='dd.MM.yyyy HH:mm'"));
	Элементы.Обращение_ДатаОбработки.Видимость = ЗначениеЗаполнено(ДатаОбработки);

	Обращение_ОтветственныйЗаОбработку = ОтветственныйЗаОбработку;
	Элементы.ГруппаОтветственныйЗаОбработку.Видимость = ЗначениеЗаполнено(ОтветственныйЗаОбработку);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидаемаяДатаПродажиПриИзменении(Элемент)
	РучнойВводДатыПродажи = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьОжидаемуюДатуПродажи()
	Если ЭтоПоддержка или РучнойВводДатыПродажи Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИнтереса = Новый Структура;
	СтруктураИнтереса.Вставить("СостояниеИнтереса", ПервичноеСостояниеСценария);
	СтруктураИнтереса.Вставить("Ссылка", ПервичноеСостояниеСценария);
	
	ОжидаемаяДатаПродажи = CRM_ИнтересыСервер.ПлановаяДатаПродажи(СтруктураИнтереса, Истина);
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные

&НаСервереБезКонтекста
Функция ТекстЗапросаПоискаДанных()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НайденныеСсылки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВсеНайденныеСсылки
	|ИЗ
	|	&НайденныеСсылки КАК НайденныеСсылки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеНайденныеСсылки.Ссылка КАК Ссылка,
	|	"""" КАК Оригинал
	|ПОМЕСТИТЬ НайденныеСсылкиИОригиналы
	|ИЗ
	|	ВсеНайденныеСсылки КАК ВсеНайденныеСсылки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДублиКлиентовИКонтактов.Оригинал,
	|	&ДополнениеОригиналаКлиента
	|ИЗ
	|	РегистрСведений.CRM_ДублиКлиентовИКонтактов КАК ДублиКлиентовИКонтактов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеНайденныеСсылки КАК ВсеНайденныеСсылки
	|		ПО ДублиКлиентовИКонтактов.Контакт = ВсеНайденныеСсылки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеСсылкиИОригиналы.Ссылка КАК Ссылка,
	|	МАКСИМУМ(НайденныеСсылкиИОригиналы.Оригинал) КАК Оригинал
	|ПОМЕСТИТЬ НайденныеСсылки
	|ИЗ
	|	НайденныеСсылкиИОригиналы КАК НайденныеСсылкиИОригиналы
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеСсылкиИОригиналы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Партнер,
	|	Контакты.Ссылка КАК КонтактноеЛицо,
	|	Клиенты.Наименование + ВЫБОР
	|		КОГДА Клиенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
	|			ТОГДА "" "" + &ДополнениеКлиентаФизическогоЛица
	|		ИНАЧЕ """"
	|	КОНЕЦ + НайденныеСсылки.Оригинал КАК ПредставлениеКлиента,
	|	Контакты.Наименование + ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА "" "" + &ДополнениеУволенногоКонтакта
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.ВременноНеРаботает)
	|			ТОГДА "" "" + &ДополнениеНеРаботающегоКонтакта
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеКонтакта,
	|	Клиенты.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтактУволен,
	|	"""" КАК Организация,
	|	Клиенты.ПометкаУдаления КАК КлиентПометкаУдаления,
	|	Контакты.ПометкаУдаления КАК КонтактПометкаУдаления,
	|	Контакты.CRM_РольКонтактногоЛица КАК КонтактРоль
	|ПОМЕСТИТЬ ДанныеКлиентов
	|ИЗ
	|	Справочник.Партнеры КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК Контакты
	|		ПО Клиенты.Ссылка = Контакты.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
	|		ПО Клиенты.Ссылка = НайденныеСсылки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Клиенты.Ссылка,
	|	Контакты.Ссылка,
	|	Клиенты.Наименование + ВЫБОР
	|		КОГДА Клиенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
	|			ТОГДА "" "" + &ДополнениеКлиентаФизическогоЛица
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Контакты.Наименование + ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА "" "" + &ДополнениеУволенногоКонтакта
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.ВременноНеРаботает)
	|			ТОГДА "" "" + &ДополнениеНеРаботающегоКонтакта
	|		ИНАЧЕ """"
	|	КОНЕЦ + НайденныеСсылки.Оригинал,
	|	Клиенты.ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	"""",
	|	Клиенты.ПометкаУдаления,
	|	Контакты.ПометкаУдаления,
	|	Контакты.CRM_РольКонтактногоЛица
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК Контакты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Клиенты
	|		ПО Контакты.Владелец = Клиенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
	|		ПО Контакты.Ссылка = НайденныеСсылки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка),
	|	ПотенциальныеКлиенты.Ссылка,
	|	ВЫБОР
	|		КОГДА ПотенциальныеКлиенты.Организация = """"
	|			ТОГДА &НадписьПотенциальногоКлиента
	|		ИНАЧЕ ПотенциальныеКлиенты.Организация + "" "" + &ДополнениеПотенциальногоКлиента
	|	КОНЕЦ,
	|	ПРЕДСТАВЛЕНИЕ(ПотенциальныеКлиенты.Ссылка),
	|	ПотенциальныеКлиенты.ОсновнойМенеджер,
	|	ЛОЖЬ,
	|	ПотенциальныеКлиенты.Организация,
	|	ЛОЖЬ,
	|	ПотенциальныеКлиенты.ПометкаУдаления,
	|	ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПустаяСсылка)
	|ИЗ
	|	Справочник.CRM_ПотенциальныеКлиенты КАК ПотенциальныеКлиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
	|		ПО ПотенциальныеКлиенты.Ссылка = НайденныеСсылки.Ссылка
	|ГДЕ
	|	ПотенциальныеКлиенты.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеКлиентов.Партнер КАК Клиент,
	|	ДанныеКлиентов.КонтактноеЛицо КАК Контакт,
	|	ДанныеКлиентов.ПредставлениеКлиента КАК ПредставлениеКлиента,
	|	ДанныеКлиентов.ПредставлениеКонтакта КАК ПредставлениеКонтакта,
	|	ДанныеКлиентов.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	ДанныеКлиентов.КонтактУволен КАК КонтактУволен,
	|	ДанныеКлиентов.Организация КАК Организация,
	|	ДанныеКлиентов.КлиентПометкаУдаления КАК КлиентПометкаУдаления,
	|	ДанныеКлиентов.КонтактПометкаУдаления КАК КонтактПометкаУдаления,
	|	ДанныеКлиентов.КонтактРоль КАК КонтактРоль
	|ИЗ
	|	ДанныеКлиентов КАК ДанныеКлиентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПредставлениеКлиента,
	|	ПредставлениеКонтакта";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаЗаполненияПоКлиенту()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Контакты.Ссылка КАК Контакт,
	|	Клиенты.Наименование + ВЫБОР
	|		КОГДА Клиенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
	|			ТОГДА "" "" + &ДополнениеКлиентаФизическогоЛица
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеКлиента,
	|	Контакты.Наименование + ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА "" "" + &ДополнениеУволенногоКонтакта
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.ВременноНеРаботает)
	|			ТОГДА "" "" + &ДополнениеНеРаботающегоКонтакта
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеКонтакта,
	|	Клиенты.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтактУволен,
	|	Клиенты.Наименование КАК СтрокаПоиска,
	|	"""" КАК Организация,
	|	Клиенты.ПометкаУдаления КАК КлиентПометкаУдаления,
	|	Контакты.ПометкаУдаления КАК КонтактПометкаУдаления
	|ИЗ
	|	Справочник.Партнеры КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК Контакты
	|		ПО Клиенты.Ссылка = Контакты.Владелец
	|ГДЕ
	|	Клиенты.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПредставлениеКлиента,
	|	ПредставлениеКонтакта";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаЗаполненияПоКонтакту()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Контакты.Владелец КАК Клиент,
	|	Контакты.Ссылка КАК Контакт,
	|	Клиенты.Наименование + ВЫБОР
	|		КОГДА Клиенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
	|			ТОГДА "" "" + &ДополнениеКлиентаФизическогоЛица
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеКлиента,
	|	Контакты.Наименование + ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА "" "" + &ДополнениеУволенногоКонтакта
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.ВременноНеРаботает)
	|			ТОГДА "" "" + &ДополнениеНеРаботающегоКонтакта
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеКонтакта,
	|	Клиенты.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА Контакты.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтактУволен,
	|	Контакты.Наименование КАК СтрокаПоиска,
	|	"""" КАК Организация,
	|	Клиенты.ПометкаУдаления КАК КлиентПометкаУдаления,
	|	Контакты.ПометкаУдаления КАК КонтактПометкаУдаления
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК Контакты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Клиенты
	|		ПО Контакты.Владелец = Клиенты.Ссылка
	|ГДЕ
	|	Контакты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаЗаполненияПоИнтересу()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Интерес.Партнер КАК Клиент,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Интерес.КонтактноеЛицо
	|		ИНАЧЕ Интерес.ПотенциальныйКлиент
	|	КОНЕЦ КАК Контакт,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Клиенты.Наименование + ВЫБОР
	|					КОГДА Клиенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
	|						ТОГДА "" "" + &ДополнениеКлиентаФизическогоЛица
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПотенциальныеКлиенты.Организация = """"
	|					ТОГДА &НадписьПотенциальногоКлиента
	|				ИНАЧЕ ПотенциальныеКлиенты.Организация + "" "" + &ДополнениеПотенциальногоКлиента
	|			КОНЕЦ
	|	КОНЕЦ КАК ПредставлениеКлиента,
	|	ВЫБОР
	|		КОГДА Интерес.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА КонтактныеЛица.Наименование + ВЫБОР
	|					КОГДА КонтактныеЛица.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|						ТОГДА "" "" + &ДополнениеУволенногоКонтакта
	|					КОГДА КонтактныеЛица.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.ВременноНеРаботает)
	|						ТОГДА "" "" + &ДополнениеНеРаботающегоКонтакта
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		КОГДА Интерес.ПотенциальныйКлиент <> ЗНАЧЕНИЕ(Справочник.CRM_ПотенциальныеКлиенты.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПотенциальныеКлиенты.Ссылка)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеКонтакта,
	|	Интерес.Ответственный КАК Ответственный,
	|	ЕСТЬNULL(Клиенты.ОсновнойМенеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА Интерес.КонтактноеЛицо = ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА КонтактныеЛица.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Уволен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтактУволен,
	|	"""" КАК СтрокаПоиска,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА Интерес.ПотенциальныйКлиент <> ЗНАЧЕНИЕ(Справочник.CRM_ПотенциальныеКлиенты.ПустаяСсылка)
	|			ТОГДА ПотенциальныеКлиенты.Организация
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Клиенты.ПометкаУдаления
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КлиентПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА КонтактныеЛица.ПометкаУдаления
	|		ИНАЧЕ ПотенциальныеКлиенты.ПометкаУдаления
	|	КОНЕЦ КАК КонтактПометкаУдаления
	|ИЗ
	|	Документ.CRM_Интерес КАК Интерес
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Клиенты
	|		ПО Интерес.Партнер = Клиенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛица
	|		ПО Интерес.КонтактноеЛицо = КонтактныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ПотенциальныеКлиенты КАК ПотенциальныеКлиенты
	|		ПО Интерес.ПотенциальныйКлиент = ПотенциальныеКлиенты.Ссылка
	|ГДЕ
	|	Интерес.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазобратьДанныеCoMagic(Знач Данные)
	
	Текст = НСтр("ru='Кампания:';en='Campaign:'") + " " + Данные.comagic_context.campaign + Символы.ПС 
		+ НСтр("ru='Сайт:';en='Website:'") + " " + Данные.comagic_context.site + Символы.ПС
		+ НСтр("ru='Ключевые слова:';en='Keywords:'") + " " + Данные.comagic_context.search_query; 
	
	Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.CRM_CoMagic;
	Источник = сфпСофтФонПроСервер.сфпНайтиМаркетинговоеМероприятие(Данные.comagic_context.campaign);
	
	Возврат Новый Структура("Текст,Канал,Источник", Текст, Канал, Источник);
	
КонецФункции

&НаСервере
Функция ПолучитьТипУслугиПользователя(Знач Пользователь, ПолучитьЗначениеПоУмолчанию = Ложь)
	
	Если НЕ ПолучитьЗначениеПоУмолчанию Тогда
		Возврат ТипУслуги;
	КонецЕсли;
	
	Возврат CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойТипУслуг");
	
КонецФункции

&НаСервере
Функция ПолучитьТипОбращенияПользователя(Знач Пользователь, ПолучитьЗначениеПоУмолчанию = Ложь)
	
	Если НЕ ПолучитьЗначениеПоУмолчанию Тогда
		Возврат ТипОбращения;
	КонецЕсли;
	
	Возврат CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойТипОбращения");
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКарточкиCoMagic()
	Элементы.ГруппаКарточкаCoMagic.Видимость = (Канал = ПредопределенноеЗначение("ПланВидовХарактеристик.КаналыРекламныхВоздействий.CRM_CoMagic"));
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ТипПВХ(ПВХСсылка)
	Возврат ТипЗнч(ПВХСсылка.ТипЗначения.ПривестиЗначение());
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеСтрокиНайденного(Знач Клиент, Знач Контакт, Знач ВключеныОграниченияДоступа = Ложь, ДоступенКлиент = Истина, ДоступенКонтакт = Истина)
	
	// 00A0F2 - голубой
	
	Описание = "";
	
	Если ЗначениеЗаполнено(Клиент) И ТипЗнч(Клиент) = Тип("СправочникСсылка.Партнеры") Тогда
		
		Если ВключеныОграниченияДоступа Тогда
			ДоступенКлиент = Не РазрешенТолькоБазовыйДоступ(Клиент);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Клиент);
		Описание = "<table width=""100%"" border=""0"" cellspacing=""2"">
		|<td width=""50%"" valign=""top"" style=""border-right: 1px solid"">
		|<font style=""font-size:14px;"" face=""MS Sans Serif""><a href=" + НавигационнаяСсылка + "><B>"+СокрЛП(Клиент.Наименование)+"</B></a></font>
		|<br>
		|<font style=""font-size:12px;"" face=""MS Sans Serif"">"+НСтр("ru='Публ. наименование: ';en='Public Name: '")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Клиент.НаименованиеПолное)+"</font>
		|<br>
		|";
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() И ЗначениеЗаполнено(Клиент["CRM_ИНН"]) Тогда
			Описание = Описание + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+НСтр("ru='ИНН: ';en='TIN:'")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Клиент.CRM_ИНН)+"  </font><font style=""font-size:12px;"" face=""MS Sans Serif"">КПП: </font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Клиент.CRM_КПП)+"</font>
			|<br>
			|";
		КонецЕсли;	
		Если ЗначениеЗаполнено(Клиент.CRM_ТипОтношенийПредставление) Тогда
			Описание = Описание + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+НСтр("ru='Тип отношений: ';en='Realtion Type:'")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Клиент.CRM_ТипОтношенийПредставление)+"</font>
			|<br>
			|";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент.ОсновнойМенеджер) Тогда
			Описание = Описание + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+НСтр("ru='Ответственный: ';en='Responsible: '")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Клиент.ОсновнойМенеджер)+"</font>
			|<br>
			|";
		КонецЕсли;
		
		ОписаниеКонтакты = "";
		Для Каждого Строка Из Клиент.КонтактнаяИнформация Цикл
			Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон ИЛИ Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				Если ОписаниеКонтакты = "" Тогда
					ОписаниеКонтакты = "</td>
					|<td width=""50%"" valign=""top"" style=""padding-left: 10px"">
					|<font style=""font-size:14px;"" face=""MS Sans Serif""><B>"+НСтр("ru='Контакты';en='Contacts'")+"</B></font>
					|<br>
					|";
				КонецЕсли;	
				ОписаниеКонтакты = ОписаниеКонтакты + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+СокрЛП(Строка.Вид)+": </font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Строка.Представление)+"</font>
				|<br>
				|";	
			КонецЕсли;
		КонецЦикла;	
		Если ЗначениеЗаполнено(ОписаниеКонтакты) Тогда
			Описание = Описание + ОписаниеКонтакты;
		КонецЕсли;	
		Описание = Описание + "</td>
		|</table>
		|";
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт) И ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Контакт);
		Описание = "<table width=""100%"" border=""0"" cellspacing=""2"">
		|<td width=""50%"" valign=""top"" style=""border-right: 1px solid"">
		|<font style=""font-size:14px;"" face=""MS Sans Serif""><a href=" + НавигационнаяСсылка + "><B>"+СокрЛП(Контакт.Наименование)+"</B></a></font>
		|<br>
		|<font style=""font-size:12px;"" face=""MS Sans Serif"">"+?(ЗначениеЗаполнено(Контакт.Организация), НСтр("ru='Компания: ';en='Company: '"),"")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Контакт.Организация)+"</font>
		|<br>
		|";
		Если ЗначениеЗаполнено(Контакт.ОсновнойМенеджер) Тогда
			Описание = Описание + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+НСтр("ru='Ответственный: ';en='Responsible: '")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Контакт.ОсновнойМенеджер)+"</font>
			|<br>
			|";
		КонецЕсли;
		ОписаниеКонтакты = "";
		Для Каждого Строка Из Контакт.КонтактнаяИнформация Цикл
			Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон ИЛИ Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				Если ОписаниеКонтакты = "" Тогда
					ОписаниеКонтакты = "</td>
					|<td width=""50%"" valign=""top"" style=""padding-left: 10px"">
					|<font style=""font-size:14px;"" face=""MS Sans Serif""><B>Контакты</B></font>
					|<br>
					|";
				КонецЕсли;	
				ОписаниеКонтакты = ОписаниеКонтакты + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+СокрЛП(Строка.Вид)+": </font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Строка.Представление)+"</font>
				|<br>
				|";
			КонецЕсли;	
		КонецЦикла;
		Если ЗначениеЗаполнено(ОписаниеКонтакты) Тогда
			Описание = Описание + ОписаниеКонтакты;
		КонецЕсли;
		Описание = Описание + "</td>
		|</table>
		|";
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контакт) И ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		
		Если ВключеныОграниченияДоступа Тогда
			ДоступенКонтакт = Не РазрешенТолькоБазовыйДоступ(Контакт);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Контакт);
		Описание = Описание + "<table width=""100%"" style=""border-top: 1px solid"" cellspacing=""2"">
		|<td width=""50%"" valign=""top"" style=""border-right: 1px solid"">
		|<font style=""font-size:14px;"" face=""MS Sans Serif""><a href=" + НавигационнаяСсылка + "><B>"+СокрЛП(Контакт.Наименование)+"</B></a></font>
		|<br>
		|<font style=""font-size:12px;"" face=""MS Sans Serif"">"+НСтр("ru='Состояние: ';en='State: '")+"</font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Контакт.CRM_Состояние)+"</font>
		|<br>
		|";
		
		ОписаниеКонтакты = "";
		
		Если ДоступенКонтакт Тогда
			Для Каждого Строка Из Контакт.КонтактнаяИнформация Цикл
				Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон ИЛИ Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					Если ОписаниеКонтакты = "" Тогда
						ОписаниеКонтакты = "</td>
						|<td width=""50%"" valign=""top"" style=""padding-left: 10px"">
						|<font style=""font-size:14px;"" face=""MS Sans Serif""><B>Контакты</B></font>
						|<br>
						|";
					КонецЕсли;	
					ОписаниеКонтакты = ОписаниеКонтакты + "<font style=""font-size:12px;"" face=""MS Sans Serif"">"+СокрЛП(Строка.Вид)+": </font><font style=""font-size:12px;color:#00A0F2;"" face=""MS Sans Serif"">"+СокрЛП(Строка.Представление)+"</font>
					|<br>
					|";
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеКонтакты) Тогда
			Описание = Описание + ОписаниеКонтакты;
		КонецЕсли;
		Описание = Описание + "</td>
		|</table>
		|";
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Описание =
	"<html>
	|<head>
	|
	|<style type=""text/css"">
	|	a {text-decoration:none;
	|	color: #000000;}
	|</style>
	|
	|<meta http-equiv=Content-Type content=" + """" + "text/html; charset=utf-8"">
	|<title></title>
	|</head>
	|<body>
	|" + Описание + "
	|</body>
	|</html>";
	
	Возврат Описание;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЗаголовокОбращения(Обращение)
	
	ТекстЗаголовка = "";
	
	Если ТипЗнч(Обращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ТекстЗаголовка = НСтр("ru='Письмо';en='Letter'") + ": " + Обращение.Тема;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ТекстЗаголовка = НСтр("ru='Письмо';en='Letter'") + ": " + Обращение.Тема;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		ТекстЗаголовка = НСтр("ru='Сообщение';en='Message'") + ": " + Обращение.ТекстСообщения;
	// +Рарус alexpr
	ИначеЕсли ТипЗнч(Обращение) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
		ТекстЗаголовка = НСтр("ru='Диалог';en='Dialog'") + ": " + Строка(Обращение);
	// -Рарус alexpr
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		ТекстЗаголовка = НСтр("ru='Заявка';en='Request'") + ": " + Строка(Обращение);
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
		ТекстЗаголовка = НСтр("ru='Взаимодействие';en='Interaction'") + ": " + Строка(Обращение);
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если ЗначениеЗаполнено(Обращение) Тогда
			ТекстЗаголовка = НСтр("ru='Телефонный звонок';en='Phone call'") + ": " + Строка(Обращение);
		Иначе
			ТекстЗаголовка = НСтр("ru='Звонок с номера';en='Call from number'") + ": " + Строка(Обращение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбязательноУказыватьПричинуОтказа(Обращение)
	
	Если ТипЗнч(Обращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Возврат Обращение.УчетнаяЗапись.CRM_УказыватьПричинуОтклонения;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		Возврат Обращение.УчетнаяЗапись.CRM_УказыватьПричинуОтклонения;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		Возврат Обращение.ИсточникПолучения.CRM_УказыватьПричинуОтклонения;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Возврат Константы.CRM_ОбязательноУказыватьПричинуПотериЗвонков.Получить();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимФильтраПоИнтересамАктивные()
	Возврат	НСтр("ru = 'активные'");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимФильтраПоИнтересамВсе()
	Возврат	НСтр("ru = 'все'");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НетОтбораПоАктивнымИнтересам(РежимФильтраПоИнтересам)
	
	Возврат РежимФильтраПоИнтересам <> РежимФильтраПоИнтересамАктивные();
	
КонецФункции

Процедура ОбновитьТипОбращения(ПользовательСсылка)
	
	ТипОбращенияОтв = ПолучитьТипОбращенияПользователя(ПользовательСсылка);
	Если ЗначениеЗаполнено(ТипОбращенияОтв) И НЕ НеОбновлятьТипОбращения Тогда
		УстановитьЗначениеТипОбращения(ТипОбращенияОтв);
	КонецЕсли;
	
	НеОбновлятьТипОбращения = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеТипОбращения(Значение)
	
	Если ИсточникОткрытияМастера = CRM_МетодыФормОбработокСервер.МастерОткрытИзПродаж() И НЕ ЭтоПоддержка Тогда
		ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес;
	Иначе
		ТипОбращения = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеТипУслуги(Значение)
	
	Если ИспользоватьТипыУслуг Тогда
		ТипУслуги = Значение;
	Иначе
		ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовок()
	
	Если Не ДоступноОбращение Тогда
		ШаблонЗаголовка = НСтр("ru='%1 (новый)';en='%1 (New)'");
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, ТипОбращения);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РолеваяАдресацияРазрешена(Сценарий)
	
	ПервоеСостояние = Справочники.CRM_СостоянияИнтересов.ПервичноеСостояниеСценария(Сценарий);
	
	Если ЗначениеЗаполнено(ПервоеСостояние) Тогда
		Возврат ПервоеСостояние.РазрешитьРолевуюАдресацию;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьРолевуюАдресацию(Форма, РолеваяАдресацияРазрешена)
		
	ТипПользователи = Тип("СправочникСсылка.Пользователи");
	ТипРолиИсполнителей = Тип("СправочникСсылка.РолиИсполнителей");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипПользователи);
	
	Форма.Элементы.ПеренаправитьНаРоль.Видимость = Ложь;
	
	Если РолеваяАдресацияРазрешена Тогда		
		МассивТипов.Добавить(ТипРолиИсполнителей);
		Форма.Элементы.ПеренаправитьНаРоль.Видимость = Истина;
	КонецЕсли;
	
	Форма.Элементы.Ответственный.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриПереносеВОбработанныеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПереноситьПисьмаВОбработанные = (Результат = КодВозвратаДиалога.Да);
	
	ЭтоСоздание = ДополнительныеПараметры.Свойство("ЭтоСоздание");
	ЭтоСвязывание = ДополнительныеПараметры.Свойство("ЭтоСвязывание");
	ЭтоБП = ДополнительныеПараметры.Свойство("ЭтоБП");
	
	Если ЭтоСоздание ИЛИ ЭтоСвязывание Тогда
	
		ИнтересСсылка = ДополнительныеПараметры.Интерес;	
		
		Если ЭтоСоздание Тогда
			СвязатьОбращениеСИнтересомНаСервере(ИнтересСсылка);
		КонецЕсли;
		
		Если ЭтоСвязывание Тогда
			ПрикрепитьКВыбранномуНаСервере(ИнтересСсылка);
		КонецЕсли;
			
		ПоказатьОповещениеПользователя(НСтр("ru='Обращение принято';en='Request Accepted'"),
			ПолучитьНавигационнуюСсылку(ИнтересСсылка), 
			НСтр("ru='Интерес: ';en='Lead:'") + CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ИнтересСсылка, "Тема") + " (" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ")");
		
		Оповестить("ОбновитьАРМ");
		
		Если ЭтоСоздание Тогда
			Оповестить("ПринятиеОбращения", ИнтересСсылка, Обращение);
			Если ОткрыватьИнтерес ИЛИ ТекущийПользователь = Ответственный
				ИЛИ ПользовательВходитВРоль(ТекущийПользователь, Ответственный) Тогда
				ПоказатьЗначение(, ИнтересСсылка);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоСвязывание Тогда
			Если ОткрыватьИнтересОбращение Тогда
				ПоказатьЗначение(, ИнтересСсылка);
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ЭтоБП Тогда
				
		ОткрытьФорму(ДополнительныеПараметры.ИмяФормы, ДополнительныеПараметры.ПараметрыФормы);
		ПеренестиПисьмоВОбработанные(Обращение);
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры = Неопределено)
	ТекстВопроса = НСтр("ru = 'Перенести письмо в папку обработанные?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриПереносеВОбработанныеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,,);
КонецПроцедуры

&НаСервере
Функция НеобходимоЗадатьВопросПриПереносеВОбработанные()
		
	Если ЗначениеЗаполнено(Обращение) И ТипЗнч(Обращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		
		УчетнаяЗапись = Обращение.УчетнаяЗапись;
		Если УчетнаяЗапись.CRM_ЗадаватьВопросПриПереносеВОбработанные Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;

	Возврат Ложь;
					
КонецФункции

&НаСервере
Процедура ПеренестиПисьмоВОбработанные(Обращение)
	
	Если ТипЗнч(Обращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда

		// Перенос в обработанные осуществляется, если учетная запись конкретного письма разрешает данное действие,
		// а при наличии необходимости задавать вопрос о переносе - на него был дан утвердительный ответ ранее на стороне Клиента:
		Если Обращение.УчетнаяЗапись.CRM_ПереноситьВОбработанные И ПереноситьПисьмаВОбработанные Тогда						
			Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Обращение.УчетнаяЗапись, Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные);
			Взаимодействия.УстановитьПапкуЭлектронногоПисьма(Обращение, Папка, Ложь);
			
			ПрочитанныеПисьма = Новый Массив;
			ПрочитанныеПисьма.Добавить(Обращение);
			CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(ПрочитанныеПисьма, Истина);
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательВходитВРоль(Пользователь, Роль)
	
	Если ТипЗнч(Роль) <> Тип("СправочникСсылка.РолиИсполнителей") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	Запрос.УстановитьПараметр("РольИсполнителя", Роль);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.Исполнитель КАК Исполнитель
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
	               |	И ИсполнителиЗадач.Исполнитель = &Исполнитель";

	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаИзЗапроса.Следующий();
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПотенциальногоКлиента(ПотенциальныйКлиент)
	
	Результат = Новый Структура("Клиент, Контакт");
	
	Если НЕ ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ПотенциальныеКлиенты.Ссылка КАК Ссылка,
		|	CRM_ПотенциальныеКлиенты.Партнер КАК Клиент,
		|	CRM_ПотенциальныеКлиенты.КонтактноеЛицо КАК Контакт
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКлиенты КАК CRM_ПотенциальныеКлиенты
		|ГДЕ
		|	CRM_ПотенциальныеКлиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПотенциальныйКлиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыполнитьПоискНаСервереПоДаннымПК()
	
	Результат = Ложь;

	ДанныеПК = ДанныеПотенциальногоКлиента(ПотенциальныйКлиентПриАктивизацииСтроки);
	ПК_КлиентЗаполнен = ЗначениеЗаполнено(ДанныеПК.Клиент);
	ПК_КонтактЗаполнен = ЗначениеЗаполнено(ДанныеПК.Контакт);
	
	УсловияПоиска = Новый Массив;
	Если ПК_КлиентЗаполнен Тогда
		УсловияПоиска.Добавить(СокрЛП(ДанныеПК.Клиент));
	КонецЕсли;
	Если ПК_КонтактЗаполнен Тогда
		УсловияПоиска.Добавить(СокрЛП(ДанныеПК.Контакт));
	КонецЕсли;
	
	Если УсловияПоиска.Количество() > 0 Тогда
		
		// Поиск.
		УстановитьПривилегированныйРежим(Истина);
		РезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоиска, СпособПоиска, Истина);
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ ЗначениеЗаполнено(РезультатПоиска.КодОшибки) Тогда
			
			Запрос = Новый Запрос;
			НайденныеСсылки = Новый ТаблицаЗначений;
			НайденныеСсылки.Колонки.Добавить("Ссылка", Метаданные.ОпределяемыеТипы.CRM_КонтактДляПоиска.Тип);
			Для Каждого НайденнаяСсылка Из РезультатПоиска.Элементы Цикл
				НайденныеСсылки.Добавить().Ссылка = НайденнаяСсылка;
			КонецЦикла;
			Запрос.Параметры.Вставить("НайденныеСсылки", НайденныеСсылки);
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, ПараметрыЗапросов);
			
			Запрос.Текст = ТекстЗапросаПоискаДанных();
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				лРезультатыПоиска = РезультатЗапроса.Выгрузить();
				
				ПараметрыОтбораРезультатаПоиска = Новый Структура;
				Если ПК_КлиентЗаполнен Тогда
					ПараметрыОтбораРезультатаПоиска.Вставить("Клиент", ДанныеПК.Клиент);
				КонецЕсли;
				Если ПК_КонтактЗаполнен Тогда
					ПараметрыОтбораРезультатаПоиска.Вставить("Контакт", ДанныеПК.Контакт);
				КонецЕсли;						
				
				СтрокиСДанными = лРезультатыПоиска.НайтиСтроки(ПараметрыОтбораРезультатаПоиска);
				
				ИдентификаторСтроки = Элементы.РезультатыПоиска.ТекущаяСтрока;
				СтрокаРезультатыПоиска = РезультатыПоиска.НайтиПоИдентификатору(ИдентификаторСтроки);
		
				Для Каждого СтрСДанными Из СтрокиСДанными Цикл
					ЗаполнитьЗначенияСвойств(СтрокаРезультатыПоиска, СтрСДанными);
					
					// очистка незаполненного поля:
					Если НЕ ПК_КлиентЗаполнен Тогда
						СтрокаРезультатыПоиска.Клиент = Неопределено;
						СтрокаРезультатыПоиска.КлиентПометкаУдаления = Ложь;
						СтрокаРезультатыПоиска.ПредставлениеКлиента = "";
					КонецЕсли;
					Если НЕ ПК_КонтактЗаполнен Тогда
						СтрокаРезультатыПоиска.Контакт = Неопределено;
						СтрокаРезультатыПоиска.КонтактПометкаУдаления = Ложь;
						СтрокаРезультатыПоиска.КонтактУволен = Ложь;
						СтрокаРезультатыПоиска.ПредставлениеКонтакта = "";
					КонецЕсли;
					
					Результат = Истина;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

&НаСервереБезКонтекста
Функция РазрешенТолькоБазовыйДоступ(Знач Клиент)
	
	// +CRM_Модуль
	//МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступомУровниДоступа");
	//Если МодульУправлениеДоступом <> Неопределено Тогда
	//	Возврат МодульУправлениеДоступом.РазрешенТолькоБазовыйДоступ(Клиент);
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		Возврат Не МодульУправлениеДоступом.ЧтениеРазрешено(Клиент);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	// -CRM_Модуль
	
КонецФункции

#КонецОбласти

#Область СофтФон

&НаКлиенте
Процедура сфпВыполнитьПереключитьЗвонок(СтруктураКонтакта, ДополнительныеПараметры)
	Если СтруктураКонтакта = Неопределено Тогда Возврат; КонецЕсли;
	ПолеВводаНомера = СтруктураКонтакта.НомерТелефона;
	сфпИдентификаторПереводимогоЗвонка = ДополнительныеПараметры.hCall;
	ИмяЛинии = ДополнительныеПараметры.LineName; 
	сфпПанельУправления.StartTransferCall(ИмяЛинии, сфпИдентификаторПереводимогоЗвонка, ПолеВводаНомера, "");
	Элементы.сфпПодтвердитьПеревод.Доступность = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция сфпПолучитьИдентификаторЗвонка(ТелефЗвонок)
	Если ТелефЗвонок = Неопределено ИЛИ ТипЗнч(ТелефЗвонок) <> Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат СтрЗаменить(ТелефЗвонок.сфпИдентификаторЗвонка, Символы.НПП, "");
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция сфпКартинкаСтатуса(ПредставлениеСтатуса)
	
	КартинкаСтатуса = 4;
	
	Если ВРЕГ(ПредставлениеСтатуса) = "В СЕТИ" Тогда
		КартинкаСтатуса = 0;
		
	ИначеЕсли ВРЕГ(ПредставлениеСтатуса) = "НЕТ НА МЕСТЕ" Тогда
		КартинкаСтатуса = 1;
		
	ИначеЕсли ВРЕГ(ПредставлениеСтатуса) = "НЕ БЕСПОКОИТЬ" Тогда
		КартинкаСтатуса = 2;
		
	ИначеЕсли ВРЕГ(ПредставлениеСтатуса) = "ЛИНИЯ ЗАНЯТА" Тогда
		КартинкаСтатуса = 3;
	КонецЕсли;
	
	Возврат КартинкаСтатуса;
	
КонецФункции

&НаКлиенте
Процедура сфпВидимостьИДоступностьГруппыСофтфон()
	
	сфпНомерПеревода = "";
	
	Если сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Ложь) И ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") И НЕ ИзАРМ Тогда 
		Элементы.ГруппаКнопкиСофтфона.Видимость = Истина;
		Элементы.ГруппаНомерИСтатусЛинии.Видимость = Истина;
		сфпНомерПеревода = сфпСофтФонПроСервер.сфпТекущийВнутреннийНомер(Ответственный, Истина);
		Если ЗначениеЗаполнено(сфпНомерПеревода) Тогда
			ЗаголовокВнутреннегоНомера = Нстр("ru='Вн. номер: ';en='Int. number:'") + сфпНомерПеревода;
			Если сфпВиднаКолонкаСтатусов И сфпСофтФонПроКлиент.сфпИспользуетсяОбработчикOnLinesStatus() Тогда
				СтатусЛинии = сфпСоответствиеЛинийИСтатусов.Получить(сфпНомерПеревода);
				Если СтатусЛинии <> Неопределено Тогда
					ЗаголовокВнутреннегоНомера = ЗаголовокВнутреннегоНомера + " (" + НРег(СтатусЛинии) + ")";
				КонецЕсли;
				сфпСтатус = сфпКартинкаСтатуса(СтатусЛинии);
			КонецЕсли;
			Элементы.сфпВнутреннийНомер.Заголовок = ЗаголовокВнутреннегоНомера;
		Иначе
			Элементы.сфпВнутреннийНомер.Заголовок = "";
			сфпСтатус = 4;
		КонецЕсли;
		Если ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
			НайденныйЗвонок = сфпСофтФонПроКлиент.сфпНайтиДанныеЗвонка(сфпПолучитьИдентификаторЗвонка(Обращение));
			Если НайденныйЗвонок <> Неопределено Тогда
				Элементы.сфпУдержатьЗвонок.Доступность = Истина;
				Элементы.сфпПодтвердитьПеревод.Доступность = Истина;
				Элементы.сфпПереводЗвонка.Доступность = НЕ (сфпНомерПеревода =  сфпСофтФонПроСервер.сфпТекущийВнутреннийНомер(ТекущийПользователь));
			Иначе
				Элементы.сфпУдержатьЗвонок.Доступность = Ложь;
				Элементы.сфпПодтвердитьПеревод.Доступность 	= Ложь;
				Элементы.сфпПереводЗвонка.Доступность = Ложь;
			КонецЕсли;
		Иначе
			Элементы.сфпУдержатьЗвонок.Доступность = Ложь;
			Элементы.сфпПодтвердитьПеревод.Доступность 	= Ложь;
			Элементы.сфпПереводЗвонка.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаКнопкиСофтфона.Видимость = Ложь;
		Элементы.ГруппаНомерИСтатусЛинии.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область МоделиМашинногоОбучения

&НаСервере
Функция Помощник_ПроверитьИспользование()
	
	Если Не ИспользоватьПоддержку Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиМоделей = CRM_МоделиМашинногоОбучения.ПолучитьНастройкиМоделей();
	Если Не CRM_МоделиМашинногоОбученияКлиентСервер.НастройкиМоделейЗаполнены(НастройкиМоделей) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не НастройкиМоделей.ИспользоватьКлассификациюОбращений Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатПроверки = CRM_МоделиМашинногоОбучения.ПроверитьСостояние("КлассификацияОбращений", НастройкиМоделей);
	Если РезультатПроверки.Ошибка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Помощник_ТекущаяПодсказкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипОбращения <> Помощник_ТекущаяПодсказка Тогда
		ТипОбращения = Помощник_ТекущаяПодсказка;
		ТипОбращенияПриИзменении(Элементы.ТипОбращения);
	КонецЕсли;
	
	Элементы.ТипОбращения.ЦветФона = Помощник_ВспомогательныеДанные.ФонПодсказки;
	Элементы.Помощник_Подсказки.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник_ИсходныйТипОбращенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипОбращения <> Помощник_ИсходныйТипОбращения Тогда
		ТипОбращения = Помощник_ИсходныйТипОбращения;
		ТипОбращенияПриИзменении(Элементы.ТипОбращения);
	КонецЕсли;
	
	Элементы.ТипОбращения.ЦветФона = Новый Цвет;
	Элементы.Помощник_Подсказки.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник_ЗаголовокНажатие(Элемент)
	
	Элементы.Помощник_Подсказки.Показать();
	ТекущийЭлемент = Элементы.Помощник_ИконкаБольшая;
	
	Элементы.Помощник_Страницы.ТекущаяСтраница = Элементы.Помощник_ГруппаСовет;
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник_ВсеПодсказкиНажатие(Элемент)
	Элементы.Помощник_Страницы.ТекущаяСтраница = Элементы.Помощник_ГруппаПодсказки;
КонецПроцедуры

&НаКлиенте
Процедура Помощник_ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Помощник_Данные.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Помощник_ДанныеОценкаПлюс Тогда
		
		Если ТекущиеДанные.Оценка = 1 Тогда
			ОбновитьОценкуПодсказки(ТекущиеДанные, 0);
		Иначе
			ОбновитьОценкуПодсказки(ТекущиеДанные, 1);
		КонецЕсли;
		
		Если Помощник_ТекущаяПодсказка = ТекущиеДанные.Ссылка Тогда
			ОбновитьОценкуСовета(ТекущиеДанные.Оценка);
		КонецЕсли;
		
		CRM_МоделиМашинногоОбучения.ЗаписатьОценку("КлассификацияОбращений",
			Помощник_ТекстПоиска, ТекущиеДанные.Ссылка, ТекущиеДанные.Оценка);
		
	ИначеЕсли Поле = Элементы.Помощник_ДанныеОценкаМинус Тогда
		
		Если ТекущиеДанные.Оценка = -1 Тогда
			ОбновитьОценкуПодсказки(ТекущиеДанные, 0);
		Иначе
			ОбновитьОценкуПодсказки(ТекущиеДанные, -1);
		КонецЕсли;
		
		Если Помощник_ТекущаяПодсказка = ТекущиеДанные.Ссылка Тогда
			ОбновитьОценкуСовета(ТекущиеДанные.Оценка);
		КонецЕсли;
		
		CRM_МоделиМашинногоОбучения.ЗаписатьОценку("КлассификацияОбращений",
			Помощник_ТекстПоиска, ТекущиеДанные.Ссылка, ТекущиеДанные.Оценка);
		
	Иначе
		
		Если ТипОбращения <> ТекущиеДанные.Ссылка Тогда
			ТипОбращения = ТекущиеДанные.Ссылка;
			ТипОбращенияПриИзменении(Элементы.ТипОбращения);
		КонецЕсли;
		Элементы.Помощник_Подсказки.Скрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник_ОценкаПоложительная(Команда)
	
	Если Помощник_ТекущаяОценка = 1 Тогда
		ОбновитьОценкуСовета(0);
	Иначе
		ОбновитьОценкуСовета(1);
	КонецЕсли;
	
	НайденныеСтроки = Помощник_Данные.НайтиСтроки(Новый Структура("Ссылка", Помощник_ТекущаяПодсказка));
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		ОбновитьОценкуПодсказки(НайденнаяСтрока, Помощник_ТекущаяОценка);
	КонецЕсли;
	
	CRM_МоделиМашинногоОбучения.ЗаписатьОценку("КлассификацияОбращений",
		Помощник_ТекстПоиска, Помощник_ТекущаяПодсказка, Помощник_ТекущаяОценка);
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник_ОценкаОтрицательная(Команда)
	
	Если Помощник_ТекущаяОценка = -1 Тогда
		ОбновитьОценкуСовета(0);
	Иначе
		ОбновитьОценкуСовета(-1);
	КонецЕсли;
	
	НайденныеСтроки = Помощник_Данные.НайтиСтроки(Новый Структура("Ссылка", Помощник_ТекущаяПодсказка));
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		ОбновитьОценкуПодсказки(НайденнаяСтрока, Помощник_ТекущаяОценка);
	КонецЕсли;
	
	CRM_МоделиМашинногоОбучения.ЗаписатьОценку("КлассификацияОбращений",
		Помощник_ТекстПоиска, Помощник_ТекущаяПодсказка, Помощник_ТекущаяОценка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОценкуСовета(Оценка)
	
	Помощник_ТекущаяОценка = Оценка;
	Если Оценка = 1 Тогда
		Элементы.Помощник_ОценкаПоложительная.Картинка = Помощник_ВспомогательныеДанные.КартинкаПлюсБольшая;
		Элементы.Помощник_ОценкаОтрицательная.Картинка = Помощник_ВспомогательныеДанные.КартинкаМинусСерыйБольшая;
	ИначеЕсли Оценка = -1 Тогда
		Элементы.Помощник_ОценкаПоложительная.Картинка = Помощник_ВспомогательныеДанные.КартинкаПлюсСерыйБольшая;
		Элементы.Помощник_ОценкаОтрицательная.Картинка = Помощник_ВспомогательныеДанные.КартинкаМинусБольшая;
	Иначе
		Элементы.Помощник_ОценкаПоложительная.Картинка = Помощник_ВспомогательныеДанные.КартинкаПлюсСерыйБольшая;
		Элементы.Помощник_ОценкаОтрицательная.Картинка = Помощник_ВспомогательныеДанные.КартинкаМинусСерыйБольшая;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОценкуПодсказки(СтрокаПодсказки, Оценка)
	
	СтрокаПодсказки.Оценка = Оценка;
	Если Оценка = 1 Тогда
		СтрокаПодсказки.ОценкаПлюс = Помощник_ВспомогательныеДанные.КартинкаПлюс;
		СтрокаПодсказки.ОценкаМинус = Помощник_ВспомогательныеДанные.КартинкаМинусСерый;
	ИначеЕсли Оценка = -1 Тогда
		СтрокаПодсказки.ОценкаПлюс = Помощник_ВспомогательныеДанные.КартинкаПлюсСерый;
		СтрокаПодсказки.ОценкаМинус = Помощник_ВспомогательныеДанные.КартинкаМинус;
	Иначе
		СтрокаПодсказки.ОценкаПлюс = Помощник_ВспомогательныеДанные.КартинкаПлюсСерый;
		СтрокаПодсказки.ОценкаМинус = Помощник_ВспомогательныеДанные.КартинкаМинусСерый;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Помощник_ОбновитьСостояние()
	
	// Проверки и формирование текста запроса.
	Помощник_ТекстПоиска = "";
	Если Параметры.Свойство("ПисьмоВходящее") Тогда
		Обращение = Параметры.ПисьмоВходящее;
		Помощник_ТекстПоиска = CRM_МоделиМашинногоОбученияКлиентСервер.ОбработатьТекст(Обращение.Текст);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Помощник_ТекстПоиска) Тогда
		Элементы.ГруппаПомощник.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	// Запрос данных.
	РезультатыКлассификации = CRM_МоделиМашинногоОбучения.КлассифицироватьОбращение(Помощник_ТекстПоиска);
	
	КоличествоПодсказок = РезультатыКлассификации.Количество();
	Если КоличествоПодсказок = 0 Тогда
		Элементы.ГруппаПомощник.Видимость = Ложь;
		Возврат;
	ИначеЕсли КоличествоПодсказок = 1 Тогда
		Элементы.Помощник_ГруппаВсеПодсказки.Видимость = Ложь;
		Элементы.Помощник_ГруппаПодсказки.Видимость = Ложь;
	Иначе
		ЗаголовокВсеПодсказки = НСтр("ru = 'Все подсказки (%1)'");
		Элементы.Помощник_ВсеПодсказки.Заголовок = СтрШаблон(ЗаголовокВсеПодсказки, КоличествоПодсказок);
	КонецЕсли;
	
	// Вспомогательные данные.
	Помощник_ВспомогательныеДанные = Новый Структура;
	Помощник_ВспомогательныеДанные.Вставить("ФонПодсказки", ЦветаСтиля.CRM_ЦветФонаПодсказкиПомощника);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаПлюсСерый", БиблиотекаКартинок.CRM_ОценкаПлюсСерый);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаПлюс", БиблиотекаКартинок.CRM_ОценкаПлюс);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаМинусСерый", БиблиотекаКартинок.CRM_ОценкаМинусСерый);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаМинус", БиблиотекаКартинок.CRM_ОценкаМинус);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаПлюсСерыйБольшая", БиблиотекаКартинок.CRM_ОценкаПлюсСерый24);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаПлюсБольшая", БиблиотекаКартинок.CRM_ОценкаПлюс24);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаМинусСерыйБольшая", БиблиотекаКартинок.CRM_ОценкаМинусСерый24);
	Помощник_ВспомогательныеДанные.Вставить("КартинкаМинусБольшая", БиблиотекаКартинок.CRM_ОценкаМинус24);
	
	// Заполнение.
	Помощник_ИсходныйТипОбращения = ТипОбращения;
	Помощник_ТекущаяОценка = 0;
	ПервыйРезультат = РезультатыКлассификации[0];
	Помощник_ТекущаяПодсказка = ПервыйРезультат.Ссылка;
	
	Если ПервыйРезультат.ЭтоСовет Тогда
		Если ТипОбращения <> Помощник_ТекущаяПодсказка Тогда
			ТипОбращения = Помощник_ТекущаяПодсказка;
			Элементы.ТипОбращения.ЦветФона = ЦветаСтиля.CRM_ЦветФонаПодсказкиПомощника;
			Элементы.Помощник_СтраницыКомментария.ТекущаяСтраница = Элементы.Помощник_КомментарийИзменения;
		Иначе
			Элементы.Помощник_СтраницыКомментария.ТекущаяСтраница = Элементы.Помощник_КомментарийПодсказки;
			Элементы.Помощник_НадписьНеИзменено.Заголовок =
				НСтр("ru = 'Я не менял исходный тип обращения, поскольку он совпадает с моим прогнозом'");
		КонецЕсли;
	Иначе
		Элементы.Помощник_ГруппаИсходныйТипОбращения.Видимость = Ложь;
		Элементы.Помощник_СтраницыКомментария.ТекущаяСтраница = Элементы.Помощник_КомментарийПодсказки;
	КонецЕсли;
	
	ТекстСовета = НСтр("ru = 'Уверен на %1, что тип этого обращения:'");
	Элементы.Помощник_ТекстСовета.Заголовок = СтрШаблон(ТекстСовета, Формат(ПервыйРезультат.Уверенность, "ЧФ=Ч%"));
	
	ИндексКартинки = Помощник_ИсходныйТипОбращения.ИндексКартинки;
	Элементы.Помощник_ИсходнаяКартинка.Картинка = БиблиотекаКартинок["CRM_ТипОбращения" + ИндексКартинки];
	ИндексКартинки = Помощник_ТекущаяПодсказка.ИндексКартинки;
	Элементы.Помощник_ТекущаяКартинка.Картинка = БиблиотекаКартинок["CRM_ТипОбращения" + ИндексКартинки];
	
	Для Каждого Результат Из РезультатыКлассификации Цикл
		НоваяСтрока = Помощник_Данные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
		НоваяСтрока.ИндексКартинки = Результат.Ссылка.ИндексКартинки;
		НоваяСтрока.Оценка = 0;
		НоваяСтрока.ОценкаПлюс = Помощник_ВспомогательныеДанные.КартинкаПлюсСерый;
		НоваяСтрока.ОценкаМинус = Помощник_ВспомогательныеДанные.КартинкаМинусСерый;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаСоставаРеквизитов

&НаСервере
Процедура ИзменитьСоставРеквизитов()
	
	Настройки = ПараметрыСеанса.CRM_НастройкаСоставаРеквизитовМастераРегистрации.Получить();
	ОбщиеНастройки = Неопределено;
	Настройки.Свойство("ОбщиеНастройки", ОбщиеНастройки);
	Если ОбщиеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого НастройкаГруппы из ОбщиеНастройки Цикл
		Для Каждого НастройкаЭлемента Из НастройкаГруппы.Значение Цикл
			Элемент = Неопределено;
			Если ТипЗнч(НастройкаЭлемента.Значение) = Тип("Строка") Тогда
				Элемент = Элементы.Найти(НастройкаЭлемента.Значение);
			Иначе
				Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") И ЭтотОбъект["Свойства_ИспользоватьСвойства"] Тогда
					ОписанияДР = ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", НастройкаЭлемента.Значение));
					Если ОписанияДР.Количество() > 0 Тогда
						Элемент = CRM_УправлениеСвойствами.ЭлементДопРеквизита(ЭтотОбъект, ОписанияДР[0]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Элемент <> Неопределено Тогда
				Элемент.Видимость = НастройкаЭлемента.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого НастройкаЭлемента Из ПроверяемыеРеквизитыИнтереса Цикл
		Если ТипЗнч(НастройкаЭлемента) = Тип("Строка") Тогда
			Элемент = Элементы.Найти(НастройкаЭлемента);
		Иначе
			Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") И ЭтотОбъект["Свойства_ИспользоватьСвойства"] Тогда
				ОписанияДР = ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", НастройкаЭлемента));
				Если ОписанияДР.Количество() > 0 Тогда
					Элемент = CRM_УправлениеСвойствами.ЭлементДопРеквизита(ЭтотОбъект, ОписанияДР[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Элемент <> Неопределено Тогда
			Элемент.Видимость = Истина;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "ОтметкаНезаполненного") Тогда
				Элемент.ОтметкаНезаполненного = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Элементы.ОжидаемаяВыручка.Видимость = Элементы.ОжидаемаяВыручка.Видимость И НЕ ЭтоПоддержка;
	Элементы.ОжидаемаяДатаПродажи.Видимость = Элементы.ОжидаемаяДатаПродажи.Видимость И НЕ ЭтоПоддержка;
	// +CRM_Модуль
	Элементы.Валюта.Видимость = Элементы.ОжидаемаяВыручка.Видимость;
	// -CRM_Модуль
	
	ИменаЭлементовИзменениеВидимости = Новый Массив;
	ИменаЭлементовИзменениеВидимости.Добавить(Элементы.РольВИнтересе.Имя);
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	Иначе
		ИменаЭлементовИзменениеВидимости.Добавить("Соглашение");
		ИменаЭлементовИзменениеВидимости.Добавить("Контрагент");
		ИменаЭлементовИзменениеВидимости.Добавить("Договор");
	КонецЕсли;	
	УстановитьВидимостьРеквизитаНаСервере(ИменаЭлементовИзменениеВидимости);
	// +CRM_Модуль
	ОбновитьСвязиПараметровВыбораРеквизитовФормыНаСервере();
	// -CRM_Модуль
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов(МассивИменЭлементов)
	
	УстановитьВидимостьРеквизитаНаСервере(МассивИменЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитаНаСервере(МассивИменЭлементов)
	
	МассивЭлементов = Новый Массив;
	Для Каждого ИмяЭлемента Из МассивИменЭлементов Цикл
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент = Неопределено Тогда Продолжить; КонецЕсли;
		МассивЭлементов.Добавить(Элемент);
	КонецЦикла;
	
	Если МассивЭлементов.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Настройки = ПараметрыСеанса.CRM_НастройкаСоставаРеквизитовМастераРегистрации.Получить();
	ОбщиеНастройки = Неопределено;
	Настройки.Свойство("ОбщиеНастройки", ОбщиеНастройки);
	Если ОбщиеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого НастройкаГруппы из ОбщиеНастройки Цикл
		
		Для Каждого Элемент Из МассивЭлементов Цикл
			
			ИмяЭлемента = Элемент.Имя;
		
			ЭлементСписка = НастройкаГруппы.Значение.НайтиПоЗначению(ИмяЭлемента);
			Если ЭлементСписка <> Неопределено Тогда
				
				ОбязательноКЗаполнению = Ложь;
				Если ТипЗнч(ПроверяемыеРеквизитыИнтереса) = Тип("ФиксированныйМассив") Тогда
					ОбязательноКЗаполнению = ?(ПроверяемыеРеквизитыИнтереса.Найти(ИмяЭлемента) = Неопределено,
												Ложь, Истина);
				КонецЕсли;
												
				Если ИмяЭлемента = "Договор" Тогда			
					Элемент.Видимость = (ЭлементСписка.Пометка ИЛИ ОбязательноКЗаполнению)
										И ЗначениеЗаполнено(Клиент);
				ИначеЕсли ИмяЭлемента = "РольВИнтересе" Тогда			
					Элемент.Видимость = ЭлементСписка.Пометка
										И (ЗначениеЗаполнено(Контакт) ИЛИ Элементы.ГруппаРеквизитыКлиента.Видимость);
					Элементы.РольКонтактногоЛица.Видимость = ЭлементСписка.Пометка
										И (Элементы.ГруппаРеквизитыКлиента.Видимость ИЛИ Элементы.ГруппаРеквизитыКонтакта.Видимость);
				ИначеЕсли ИмяЭлемента = "Соглашение" Тогда
					Элемент.Видимость = (ЭлементСписка.Пометка ИЛИ ОбязательноКЗаполнению)
											И ЗначениеЗаполнено(Клиент);
				ИначеЕсли ИмяЭлемента = "Контрагент" Тогда
					Элемент.Видимость = (ЭлементСписка.Пометка ИЛИ ОбязательноКЗаполнению)
											И ЗначениеЗаполнено(Клиент);
											
				КонецЕсли;
				
				Элемент.АвтоОтметкаНезаполненного = Элемент.Видимость И ОбязательноКЗаполнению;
				Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И НЕ ЗначениеЗаполнено(ЭтотОбъект[Элемент.ПутьКДанным]);
				Элемент.Доступность = Элемент.Видимость;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы_Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("CRM_УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект, Клиент_Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("CRM_УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект, Клиент_Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства")
		И ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
		
		МассивОбъектовСДопРеквизитами = Новый Массив;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРеквизитовКлиента");
		ДополнительныеПараметры.Вставить("Объект", Клиент_Объект);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРеквизитовКонтакта");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", ТемпКонтакт);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтейнерДопРекизитовПК");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", ТемпПотенциальныйКлиент);
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		
		ТемпИнтерес.ТипОбращения = ТипОбращения;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДопРеквизитыИнтереса");
		ДополнительныеПараметры.Вставить("НеУчитыватьЗависимости", Истина);
		ДополнительныеПараметры.Вставить("Объект", ТемпИнтерес);
		
		МассивОбъектовСДопРеквизитами.Добавить(ДополнительныеПараметры);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("CRM_УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, МассивОбъектовСДопРеквизитами);
		
		РазложитьДопРеквизитыПоКолонкам(МассивОбъектовСДопРеквизитами);
		ИзменитьСоставРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура РазложитьДопРеквизитыПоКолонкам(МассивОбъектов)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства")
		И ЭтотОбъект.Свойства_ИспользоватьСвойства И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
		Для каждого ОбъектДопРеквизитов из МассивОбъектов Цикл
			ГруппаДопРеквизитов = Элементы.Найти(ОбъектДопРеквизитов.ИмяЭлементаДляРазмещения);
			Если ГруппаДопРеквизитов <> Неопределено Тогда
				ГруппаЛев = Элементы.Найти(ОбъектДопРеквизитов.ИмяЭлементаДляРазмещения+"Левая");
				ГруппаПрав = Элементы.Найти(ОбъектДопРеквизитов.ИмяЭлементаДляРазмещения+"Правая");
				Если ГруппаЛев <> Неопределено И ГруппаПрав <> Неопределено Тогда
					Левая = Истина;
					Для каждого ДопРеквизит из ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов Цикл
						ДопЭлемент = CRM_УправлениеСвойствами.ЭлементДопРеквизита(ЭтотОбъект, ДопРеквизит);
						Если ДопЭлемент <> Неопределено 
							И (ДопЭлемент.Родитель = ГруппаДопРеквизитов ИЛИ ДопЭлемент.Родитель.Родитель = ГруппаДопРеквизитов) Тогда
							ДопЭлемент.Видимость = Ложь;
							Элементы.Переместить(ДопЭлемент, ?(Левая, ГруппаЛев, ГруппаПрав));
							Левая = Не Левая;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактПриИзменении(Элемент)
	РольВИнтересе = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Контакт, "CRM_РольКонтактногоЛица")
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанныхКлиента

&НаСервере
Процедура ЗаполнитьКлиентаИзПотенциального()
	Если ЗначениеЗаполнено(ПотенциальныйКлиент.Организация) Тогда
		Клиент_Объект.ЮрФизЛицо	= Перечисления.КомпанияЧастноеЛицо.Компания;
		Клиент_Объект.Наименование = ПотенциальныйКлиент.Организация;
		Клиент_Объект.НаименованиеПолное = ПотенциальныйКлиент.Организация;
		Контакт_ФИО = ПотенциальныйКлиент.Наименование;
		СтрокаТелефонаПотенциальногоКлиента	= ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента, "Вид");
		Если НЕ (СтрокаТелефонаПотенциальногоКлиента = Неопределено) Тогда
			Телефон = СтрокаТелефонаПотенциальногоКлиента.Представление;
		КонецЕсли;
		
		СтрокаЭлектронногоАдресаПотенциальногоКлиента = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента, "Вид");
		Если НЕ (СтрокаЭлектронногоАдресаПотенциальногоКлиента = Неопределено) Тогда
			Почта = СтрокаЭлектронногоАдресаПотенциальногоКлиента.Представление;
		КонецЕсли;
		
		СтрокаДругойКИПотенциальногоКлиента = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.ВебСтраница, "Тип");
		Если НЕ (СтрокаДругойКИПотенциальногоКлиента = Неопределено) И Метаданные.Обработки.Найти("CRM_РаботаСМессенджером"+СтрокаДругойКИПотенциальногоКлиента.Вид.Наименование) <> Неопределено Тогда
			Контакт_МессенджерВид = Обработки["CRM_РаботаСМессенджером"+СтрокаДругойКИПотенциальногоКлиента.Вид.Наименование].ПолучитьВидКИМессенджера(Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
			Контакт_Мессенджер = СтрокаДругойКИПотенциальногоКлиента.Представление;
			Элементы.Контакт_Мессенджер.Видимость = Истина;
			Элементы.Контакт_Мессенджер.Заголовок = Контакт_МессенджерВид;
		КонецЕсли;
	Иначе
		
		НастройкаКлиент_ОбъектЮрФизЛицо = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.Клиент_ОбъектЮрФизЛицо", "МастерРегистрации", Неопределено);
		Если НастройкаКлиент_ОбъектЮрФизЛицо = Неопределено Тогда
			Клиент_Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
		Иначе
			Клиент_Объект.ЮрФизЛицо = НастройкаКлиент_ОбъектЮрФизЛицо;
		КонецЕсли;
		
		Клиент_Объект.Наименование = ПотенциальныйКлиент.Наименование;
		Клиент_Объект.НаименованиеПолное = ПотенциальныйКлиент.Наименование;
		Клиент_Объект.CRM_Фамилия = ПотенциальныйКлиент.Фамилия;
		Клиент_Объект.CRM_Имя = ПотенциальныйКлиент.Имя;
		Клиент_Объект.CRM_Отчество = ПотенциальныйКлиент.Отчество;
		СтрокаТелефонаПотенциальногоКлиента	= ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента, "Вид");
		Если НЕ (СтрокаТелефонаПотенциальногоКлиента = Неопределено) Тогда
			Клиент_Телефон = СтрокаТелефонаПотенциальногоКлиента.Представление;
		КонецЕсли;
		
		СтрокаЭлектронногоАдресаПотенциальногоКлиента = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента, "Вид");
		Если НЕ (СтрокаЭлектронногоАдресаПотенциальногоКлиента = Неопределено) Тогда
			Клиент_Email = СтрокаЭлектронногоАдресаПотенциальногоКлиента.Представление;
		КонецЕсли;
		
		СтрокаДругойКИПотенциальногоКлиента = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.ВебСтраница, "Тип");
		Если НЕ (СтрокаДругойКИПотенциальногоКлиента = Неопределено) И Метаданные.Обработки.Найти("CRM_РаботаСМессенджером"+СтрокаДругойКИПотенциальногоКлиента.Вид.Наименование) <> Неопределено Тогда
			Клиент_МессенджерВид = Обработки["CRM_РаботаСМессенджером"+СтрокаДругойКИПотенциальногоКлиента.Вид.Наименование].ПолучитьВидКИМессенджера(Справочники.Партнеры.ПустаяСсылка());
			Клиент_Мессенджер = СтрокаДругойКИПотенциальногоКлиента.Представление;
			Элементы.Клиент_Мессенджер.Видимость = Истина;
			Элементы.Клиент_Мессенджер.Заголовок = Клиент_МессенджерВид;
		КонецЕсли;
	КонецЕсли;
	
	Должность = ПотенциальныйКлиент.Должность;
	Клиент_Объект.БизнесРегион = ПотенциальныйКлиент.БизнесРегион;
	Клиент_Объект.CRM_ОсновнаяОтрасль = ПотенциальныйКлиент.Отрасль;
	
	Клиент_Объект.CRM_ВидыДеятельности.Очистить();
	Если ЗначениеЗаполнено(Клиент_Объект.CRM_ОсновнаяОтрасль) Тогда
		СтрОтрасль = Клиент_Объект.CRM_ВидыДеятельности.Добавить();
		СтрОтрасль.ВидДеятельности = Клиент_Объект.CRM_ОсновнаяОтрасль;
	КонецЕсли;
	
	Клиент_Объект.Комментарий = ПотенциальныйКлиент.Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектЮрФизЛицоПриИзменении(Элемент)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	Если Элемент <> Неопределено Тогда
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.Клиент_ОбъектЮрФизЛицо", "МастерРегистрации", Клиент_Объект.ЮрФизЛицо);
	КонецЕсли;
	
	Клиент_ОбъектЮрФизЛицоПриИзмененииСервер();
	
	ФизЛицо = (Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо"));
	
	Элементы.Клиент_ОбъектНаименование.КнопкаВыбора = ФизЛицо;
	
	Если ФизЛицо Тогда
		СписокВыбораКлиент_Объект = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(Клиент_Объект);
		Элементы.Клиент_ОбъектНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбораКлиент_Объект);
		Элементы.ГруппаКлиент_ОбъектРедактированиеФИО.Видимость = Истина;
	Иначе
		Элементы.Клиент_ОбъектНаименованиеВыбор.СписокВыбора.Очистить();
		Элементы.ГруппаКлиент_ОбъектРедактированиеФИО.Видимость = Ложь;
	КонецЕсли;
	
	СтруктураКЛ = Новый Структура;
	СтруктураКЛ.Вставить("CRM_Фамилия", Контакт_Фамилия);
	СтруктураКЛ.Вставить("CRM_Имя", Контакт_Имя);
	СтруктураКЛ.Вставить("CRM_Отчество", Контакт_Отчество);
	СписокВыбораКонтакт = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(СтруктураКЛ, Ложь);
	Элементы.КонтактНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбораКонтакт);
	
	Элементы.ГруппаКлиент_ОбъектРедактированиеФИО.Скрыть();
	Элементы.ГруппаКонтактРедактированиеФИО.Скрыть();
	
	
	Элементы.Клиент_ОбъектДатаРождения.Видимость = Элементы.Клиент_ОбъектДатаРождения.Видимость И ФизЛицо;
	Элементы.Клиент_ОбъектПол.Видимость = Элементы.Клиент_ОбъектПол.Видимость И ФизЛицо;
	Элементы.Клиент_МобТелефон.Видимость = ФизЛицо;
	
	Элементы.Клиент_ЮрАдрес.Видимость = Элементы.Клиент_ЮрАдрес.Видимость И НЕ ФизЛицо;
	Элементы.Клиент_ОбъектCRM_КПП.Видимость = Элементы.Клиент_ОбъектCRM_КПП.Видимость И НЕ ФизЛицо;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Элементы.ГруппаКлиентИНН.Видимость = НЕ ФизЛицо;
	КонецЕсли;
	
	Элементы.ГруппаРеквизитыКонтакта.Видимость = Истина;
	Элементы.ФИО1.АвтоОтметкаНезаполненного =  НЕ (CRM_РазрешитьСозданиеИнтересаБезКЛ ИЛИ ФизЛицо);
	Элементы.ФИО1.ОтметкаНезаполненного =  НЕ (CRM_РазрешитьСозданиеИнтересаБезКЛ ИЛИ ФизЛицо) И НЕ ЗначениеЗаполнено(ФИО);
	
	Если Элемент <> Неопределено Тогда
		Если ФизЛицо Тогда // с юр лица на физ лицо
			
			Клиент_Объект.CRM_Фамилия = Контакт_Фамилия;
			Клиент_Объект.CRM_Имя = Контакт_Имя;
			Клиент_Объект.CRM_Отчество = Контакт_Отчество;
			
			Клиент_Email = Контакт_Email;
			Клиент_Телефон = Контакт_Телефон;
			Клиент_МобТелефон = НомерМобильногоТелефона;
			Клиент_Мессенджер = Контакт_Мессенджер;
			
			Контакт_Email = "";
			Контакт_Телефон = "";
			НомерМобильногоТелефона = "";
			Контакт_Мессенджер = "";
			
		Иначе // с физ лица на юр лицо
			
			Контакт_ФИО = Клиент_Объект.Наименование;
			Контакт_Фамилия = Клиент_Объект.CRM_Фамилия;
			Контакт_Имя = Клиент_Объект.CRM_Имя;
			Контакт_Отчество = Клиент_Объект.CRM_Отчество;
			
			Контакт_Email = Клиент_Email;
			Контакт_Телефон = Клиент_Телефон;
			НомерМобильногоТелефона = Клиент_МобТелефон;
			Контакт_Мессенджер = Клиент_Мессенджер;
			
			Клиент_Email = "";
			Клиент_Телефон = "";
			Клиент_МобТелефон = "";
			Клиент_Мессенджер = "";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура Клиент_ОбъектЮрФизЛицоПриИзмененииСервер()
	
	ОбновитьЭлементыДополнительныхРеквизитов();

	Если Метаданные.ОбщиеМодули.Найти("CRM_Модуль_РаботаСКонтрагентами") <> Неопределено Тогда
		CRM_Модуль = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСКонтрагентами");
		CRM_Модуль.ЮрФизЛицоПриИзменении(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеРеквизитовПоИНН()
	
	ОписаниеОшибки = "";
	ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		// Обработка ошибок
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов"
"необходимо подключиться к Интернет-поддержке пользователей."
"Подключиться сейчас?';en='Fill in details of counterparty automatically"
"it is necessary to connect to user Internet support."
"Connect now?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки = "")
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ЭтоЮридическоеЛицо = (Клиент_Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания);
	Иначе
		ЭтоЮридическоеЛицо = (ЭтотОбъект["Контрагент_Объект"].ЮрФизЛицо <> Перечисления["ЮрФизЛицо"].ИндивидуальныйПредприниматель);
	КонецЕсли;
	Если ЭтоЮридическоеЛицо Тогда
		РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыЮридическогоЛицаПоИНН(Клиент_ИНН);
	Иначе
		РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(Клиент_ИНН);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыКонтрагента.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Клиент_Объект, РеквизитыКонтрагента);
	
	Если ЭтоЮридическоеЛицо Тогда
		Если РеквизитыКонтрагента.Свойство("ЮридическийАдрес") И ЗначениеЗаполнено(РеквизитыКонтрагента.ЮридическийАдрес) Тогда
			Клиент_ЮрАдрес = РеквизитыКонтрагента.ЮридическийАдрес.Представление;
			Клиент_ЮрАдресЗначение = РеквизитыКонтрагента.ЮридическийАдрес.КонтактнаяИнформация;
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("Телефон") И ЗначениеЗаполнено(РеквизитыКонтрагента.Телефон) Тогда
		Клиент_Телефон = РеквизитыКонтрагента.Телефон.Представление;
	КонецЕсли;
	
	// +CRM_Модуль
	//РеквизитыКонтрагента.Свойство("КПП", Клиент_Объект.CRM_КПП);
	РеквизитыКонтрагента.Свойство("КПП", Клиент_КПП);
	// -CRM_Модуль

КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектCRM_ТипОтношенийПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	Элементы.ГруппаВсеТипыОтношений.Показать();
	ПодключитьОбработчикОжидания("ПроверитьВсплывающиеГруппы", 0.3, Истина);
	
КонецПроцедуры // CRM_ТипыОтношенийНачалоВыбора()

&НаКлиенте
Процедура ПроверитьВсплывающиеГруппы()
	
	Если Элементы.ГруппаВсеТипыОтношений.Скрыта() Тогда
		ТекущийЭлемент = Элементы.Клиент_ОбъектCRM_ТипОтношенийПредставление;
		CRM_ЗаписатьВсеТипыОтношений();
		СформироватьТипОтношенийПредставление();
	Иначе	
		ПодключитьОбработчикОжидания("ПроверитьВсплывающиеГруппы", 0.3, Истина);
	КонецЕсли;
	
КонецПроцедуры // CRM_ТипыОтношенийНачалоВыбора()

&НаСервере
Процедура СформироватьТипОтношенийПредставление()
	
	Если ДоступноИзменениеПартнеров Тогда
		CRM_ТипыОтношений = "";
		ТипКлиент = Ложь;
		ТипПоставщик = Ложь;
		ТипКонкурент = Ложь;
		ТипПрочиеОтношения = Ложь;
		
		Для Каждого Строка Из Клиент_Объект.CRM_ТипыОтношений Цикл
			ТипКлиент = ТипКлиент ИЛИ Строка.ТипОтношений.Клиент;
			ТипПоставщик = ТипПоставщик ИЛИ Строка.ТипОтношений.Поставщик;
			ТипКонкурент = ТипКонкурент ИЛИ Строка.ТипОтношений.Конкурент;
			ТипПрочиеОтношения = ТипПрочиеОтношения ИЛИ Строка.ТипОтношений.ПрочиеОтношения;
			
			CRM_ТипыОтношений = CRM_ТипыОтношений  + "; " + Строка.ТипОтношений;
		КонецЦикла;	
		Если СтрДлина(CRM_ТипыОтношений) > 0 Тогда
			CRM_ТипыОтношений = Сред(CRM_ТипыОтношений, 3);
		КонецЕсли;	
		Клиент_Объект.CRM_ТипОтношенийПредставление = CRM_ТипыОтношений;
		Клиент_Объект.Клиент = ТипКлиент;
		Клиент_Объект.Поставщик = ТипПоставщик;
		Клиент_Объект.Конкурент = ТипКонкурент;
		Клиент_Объект.ПрочиеОтношения = ТипПрочиеОтношения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура сохраняет все типы отношений клиента.
//
// Параметры:
//	Нет.
//
Процедура CRM_ЗаписатьВсеТипыОтношений()
	
	Если ДоступноИзменениеПартнеров Тогда
		Клиент_Объект.CRM_ТипыОтношений.Очистить();
		Для Каждого ТипОтношений Из CRM_ВсеТипыОтношений Цикл
			Если ТипОтношений.Пометка Тогда
				НовСтр = Клиент_Объект.CRM_ТипыОтношений.Добавить();
				НовСтр.ТипОтношений = ТипОтношений.Значение;	
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры // CRM_ЗаписатьВсеТипыОтношений()

&НаКлиенте
Процедура КлиентКонтакт_КИНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыОткрытия = Новый Структура;
	Если Элемент.Имя = "Клиент_Адрес" Тогда
		ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПартнера"));
	ИначеЕсли Элемент.Имя = "Клиент_ЮрАдрес" Тогда
		ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_ЮрАдрес"));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("Представление", ЭтотОбъект[Элемент.Имя]);
	ПараметрыОткрытия.Вставить("Значение", ЭтотОбъект[Элемент.Имя+"Значение"]);
	
	Оповещение = Новый ОписаниеОповещения("ПредставлениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ИмяЭлементаРазмещения", Элемент.Имя);

	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры.ИмяЭлементаРазмещения] = РезультатЗакрытия.Представление;
	ЭтотОбъект[ДополнительныеПараметры.ИмяЭлементаРазмещения+"Значение"] = РезультатЗакрытия.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ТелефонПриИзменении(Элемент)
	
	СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Клиент_Телефон);
	Клиент_Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
	
	ВыполнитьПоискДублейПоЗначению(Клиент_Телефон, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_МобТелефонПриИзменении(Элемент)
	
	СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Клиент_МобТелефон);
	Клиент_МобТелефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
	
	ВыполнитьПоискДублейПоЗначению(Клиент_МобТелефон, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектНаименованиеПриИзменении(Элемент)
	
	Клиент_ОбъектРедактированиеПредставления = Истина;
	Если Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда
		
		Если Не Клиент_ОбъектПредставлениеВыбраноИзСписка Тогда
			
			ФИО_Темп = Клиент_Объект.Наименование;
			ФИО_Темп = СтрЗаменить(ФИО_Темп,",","");
			ФИО_Темп = СтрЗаменить(ФИО_Темп,".","");		
			ФИО_Темп = СтрЗаменить(ФИО_Темп,";","");
			
			Если ПустаяСтрока(Клиент_Объект.CRM_Фамилия) Или Клиент_Объект.Ссылка.Пустая() Тогда
			
				ПервоеСлово = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(ФИО_Темп);
				
				Клиент_Объект.CRM_Фамилия = ПервоеСлово;			
				Клиент_Объект.CRM_Имя = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(ФИО_Темп);
				Клиент_Объект.CRM_Отчество = CRM_КлиентыКлиент.ВыделитьЧастьНаименованияКонтактногоЛица(ФИО_Темп);
				
				Если Не ЗначениеЗаполнено(Клиент_Объект.Пол) Тогда
					Клиент_Объект.Пол = CRM_КлиентыКлиент.ОпределитьПол(Клиент_Объект.CRM_Имя);
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	ЗаполнитьПолноеНаименование();
	
	ВыполнитьПоискДублейПоЗначению(Клиент_Объект.Наименование, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолноеНаименование()
	
	Если Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания") Тогда
		ПравоваяФорма = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Ответственный, "ПравоваяФормаКлиентаПоУмолчанию");
		Клиент_Объект.НаименованиеПолное = ?(СокрЛП(ПравоваяФорма) = "" ,СокрЛП(Клиент_Объект.Наименование),
			СокрЛП(ПравоваяФорма)+" """+СокрЛП(Клиент_Объект.Наименование)+"""");
	Иначе
		Клиент_Объект.НаименованиеПолное = СокрЛП(Клиент_Объект.Наименование);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаКлиент_ОбъектРедактированиеФИО.Показать();
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Клиент_ОбъектПредставлениеВыбраноИзСписка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектНаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
			
	Если Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда
		
		МассивПредставлений = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(Клиент_Объект);
		Если МассивПредставлений.Количество() > 0 Тогда
			Если ДанныеВыбора = Неопределено Тогда
				ДанныеВыбора = Новый СписокЗначений();
			КонецЕсли;
			Для Каждого тДанные Из МассивПредставлений Цикл
				ДанныеВыбора.Вставить(0, тДанные, тДанные);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектНаименованиеВыборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда
		Если Не Клиент_ОбъектПредставлениеВыбраноИзСписка Тогда
			
			СписокВыбора = CRM_КлиентыКлиент.ПолучитьСписокПредставленийФизЛица(Клиент_Объект);	
			Элементы.Клиент_ОбъектНаименованиеВыбор.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектНаименованиеПолноеПриИзменении(Элемент)
	ВыполнитьПоискДублейПоЗначению(Клиент_Объект.НаименованиеПолное, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ОбъектCRM_ИННПриИзменении(Элемент)
	ТекстСообщения = "";
	Если ЗначениеЗаполнено(Клиент_ИНН) Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ЭтоЮридическоеЛицо = (Клиент_Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания"));
		Иначе
			ЭтоЮридическоеЛицо = (ЭтотОбъект["Контрагент_Объект"].ЮрФизЛицо <> ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель"));
		КонецЕсли;
		Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Клиент_ИНН, ЭтоЮридическоеЛицо, ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Клиент_ИНН");
		Иначе
			ВыполнитьЗаполнениеРеквизитовПоИНН();
		КонецЕсли;
	КонецЕсли;
	ВыполнитьПоискДублейПоЗначению(Клиент_ИНН, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Клиент_EmailПриИзменении(Элемент)
	ВыполнитьПоискДублейПоЗначению(Клиент_Email, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
КонецПроцедуры

&НаКлиенте
Процедура Клиент_АдресПриИзменении(Элемент)
	ВыполнитьПоискДублейПоЗначению(Клиент_Адрес, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
КонецПроцедуры

&НаКлиенте
Процедура Клиент_ЮрАдресПриИзменении(Элемент)
	ВыполнитьПоискДублейПоЗначению(Клиент_ЮрАдрес, Элемент,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
КонецПроцедуры

&НаКлиенте
Процедура НайтиДубли(ОписаниеОповещения)
	СтруктураПоиска = СоздатьСтруктуруПоиска();
	Если СтруктураПоиска.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не установлены реквизиты поиска в настройках сервисных функций!';en='Search attributes in the settings of the service functions are not set!'"));
	КонецЕсли;
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Наименование",		Клиент_Объект.Наименование);
	СтруктураОбъекта.Вставить("НаименованиеПолное",	Клиент_Объект.НаименованиеПолное) ;
	СтруктураОбъекта.Вставить("ИНН",				Клиент_ИНН);
	Если ЗначениеЗаполнено(Клиент_Адрес) Тогда
		СтруктураОбъекта.Вставить("Адрес", Клиент_Адрес);
	КонецЕсли;
	ТелефонДляПоиска	= "";
	EmailДляПоиска		= "";
	Если НЕ ПустаяСтрока(Контакт_Телефон) Тогда
		СтруктураОбъекта.Вставить("Контакт_Телефон", Контакт_Телефон);
		ТелефонДляПоиска	= Контакт_Телефон;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Клиент_Телефон) Тогда
		СтруктураОбъекта.Вставить("Телефон", Клиент_Телефон);
		Если НЕ СтруктураПоиска.Свойство("Телефон") Тогда
			СтруктураПоиска.Вставить("Телефон", "ПОДОБНО");
		КонецЕсли;	
		Если ПустаяСтрока(ТелефонДляПоиска) Тогда
			ТелефонДляПоиска	= Клиент_Телефон;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ПустаяСтрока(Контакт_Email) Тогда
		СтруктураОбъекта.Вставить("Контакт_АдресЭлектроннойПочты", Контакт_Email);
		EmailДляПоиска	= Контакт_Email;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Клиент_Email) Тогда
		СтруктураОбъекта.Вставить("АдресЭлектроннойПочты", Клиент_Email);
		Если НЕ СтруктураПоиска.Свойство("АдресЭлектроннойПочты") Тогда
			СтруктураПоиска.Вставить("АдресЭлектроннойПочты", "ПОДОБНО");
		КонецЕсли;	
		Если ПустаяСтрока(EmailДляПоиска) Тогда
			EmailДляПоиска	= Клиент_Email;
		КонецЕсли;
	КонецЕсли;
	ПоискПоТелефону	= НЕ ПустаяСтрока(ТелефонДляПоиска);
	ПоискПоEmail	= НЕ ПустаяСтрока(EmailДляПоиска);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураПоиска",		СтруктураПоиска);
	ПараметрыФормы.Вставить("СтруктураОбъекта",		СтруктураОбъекта);
	ПараметрыФормы.Вставить("ПотенциальныйКлиент",	Истина);
	Форма = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНайденныхДублей", ПараметрыФормы, ЭтотОбъект);
	Если Форма = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
	Иначе 
		Форма.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ДублиНайденыЗавершение", ЭтотОбъект, ОписаниеОповещения);
		Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДублиНайденыЗавершение(РезультатЗакрытия, ОписаниеОповещения) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Если РезультатЗакрытия.Свойство("Результат") Тогда
			Если РезультатЗакрытия.Результат = "Перейти" ИЛИ РезультатЗакрытия.Результат = "Продолжить" Тогда
				Если РезультатЗакрытия.Свойство("Объект") Тогда
					Если ТипЗнч(РезультатЗакрытия.Объект) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
						Клиент = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(РезультатЗакрытия.Объект, "Владелец");
						Контакт = РезультатЗакрытия.Объект;
						Элементы.ГруппаРеквизитыКлиента.Видимость = Ложь;
						Элементы.ГруппаРеквизитыКонтакта.Видимость = Ложь;
						Если ОписаниеОповещения.ДополнительныеПараметры.Свойство("ВФормеДублейВыбраноКЛ") Тогда
							ОписаниеОповещения.ДополнительныеПараметры.ВФормеДублейВыбраноКЛ = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(РезультатЗакрытия.Объект) = Тип("СправочникСсылка.Партнеры") Тогда
						Клиент = РезультатЗакрытия.Объект;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли РезультатЗакрытия = Неопределено Тогда
		Возврат;
	ИначеЕсли (ТипЗнч(РезультатЗакрытия) = Тип("КодВозвратаДиалога")) 
		И (РезультатЗакрытия = КодВозвратаДиалога.Отмена) Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
КонецПроцедуры

&НаСервере
// Функция создает Структуру реквизитов для поиска партнеров.
//
Функция СоздатьСтруктуруПоиска()
	СтруктураПоиска = Новый Структура;
	ЗначениеХранилища = Константы.CRM_РеквизитыПоискаДублейПартнеров.Получить();
	РеквизитыПоиска = ЗначениеХранилища.Получить();
	Если НЕ (РеквизитыПоиска = Неопределено) Тогда
		Если ТипЗнч(РеквизитыПоиска) = Тип("СписокЗначений") Тогда
			Для Каждого СтрокаСписка Из РеквизитыПоиска Цикл
				Если СтрокаСписка.Пометка Тогда	
					Значение = СтрокаСписка.Значение;
					ТочкаСЗапятой = Найти(Значение, ";");
					СтруктураПоиска.Вставить(Сред(Значение, 1, ТочкаСЗапятой - 1), Сред(Значение, ТочкаСЗапятой + 1));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат СтруктураПоиска;
КонецФункции

#КонецОбласти

#Область ПоискДублейПоЗначению

&НаКлиенте
Процедура ВыполнитьПоискДублейПоЗначению(ЗначениеПоиска, Поле, ТипКИ = Неопределено)
	
	ОбрабатыватьАктивизациюПоиска = Ложь;
	
	ВыполнитьПоискДублейПоЗначениюНаСервере(ЗначениеПоиска, Поле.Имя, ТипКИ);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискДублейПоЗначениюНаСервере(ЗначениеПоиска, ИмяПоля, ТипКИ)
	
	CRM_ПоискКонтактовВызовСервера.ПодготовитьПоискДублейПоЗначению(ЭтотОбъект, ЗначениеПоиска, ИмяПоля, ТипКИ);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаРезультатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	CRM_ПоискКонтактовКлиент.ОбработатьВыборТаблицыРезультатов(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область ДоработкиСмарт

&НаСервере
//++ #1398 смарт: Фролов 20.09.2023 //Доработать карточку интереса (исправить логику)  
Процедура смартИзменитьКнопкиНаСервере()
	Элементы.ДекорацияВыравниваниеКлиент.Видимость=Ложь;
	Элементы.СоздатьКлиентаЗаписать.ЦветФона=ЦветаСтиля.CRM_ОсновнойГолубой;
	Элементы.СоздатьКлиентаЗаписать.ЦветТекста=WEBЦвета.Белый;
	Элементы.СоздатьКлиентаЗаписать.Заголовок="Сохранить нового клиента";
	Элементы.СоздатьКлиентаЗаписать.Шрифт=Новый Шрифт(,10,Истина);
	Элементы.СоздатьКлиентаЗаписать.ОтображениеФигуры=ОтображениеФигурыКнопки.Всегда;
	Элементы.СоздатьКлиентаЗаписать.ГоризонтальноеПоложениеВГруппе=ГоризонтальноеПоложениеЭлемента.Лево;
	Элементы.СоздатьКлиентаОтмена.ОтображениеФигуры=ОтображениеФигурыКнопки.Всегда;
	Элементы.СоздатьКлиентаОтмена.ГоризонтальноеПоложениеВГруппе=ГоризонтальноеПоложениеЭлемента.Лево;
КонецПроцедуры  //-- #1398 смарт: Фролов 20.09.2023

#КонецОбласти
