
Процедура ПередЗаписью(Отказ)
	
	//проверка на уникальность имени условия
	РезультатПроверки = ПроверитьУникальностьУсловия();
	
	Если РезультатПроверки <> Неопределено Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Данное Наименование уже указано для другого шаблона'"),, "Объект.Наименование",, Отказ);
			
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьУникальностьУсловия()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка          
	|ИЗ
	|	Справочник.смартШаблоныБренда
	|ГДЕ
	|	Наименование = &Наименование
	|	И Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	   Возврат Выборка;	 
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции