
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ответственный = ЭтаФорма.Параметры.Ответственный;
	Партнер = ЭтаФорма.Параметры.Партнер;
	ДатаПеревода = ЭтаФорма.Параметры.Дата;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач
	|ГДЕ
	|	РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.смартОтветственныйЗаСогласованиеСтатусаПартнера)");
	
	МассивСогласователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
	
	Если МассивСогласователей.Найти(ПараметрыСеанса.ТекущийПользователь) = Неопределено Тогда
		
		Если НЕ Партнер.смартОсновнойМенеджерСервисЦентра = ПараметрыСеанса.ТекущийПользователь Тогда
			
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.КлиентБольшеНеАрхивный.Доступность = Ложь;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КлиентБольшеНеАрхивныйНаСервере()
	
	НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партнер.Установить(Партнер);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		НаборЗаписей[0].СостояниеСЦ = Перечисления.смартСостоянияПартнеров.Свободен;
		НаборЗаписей[0].ДатаПереводаВАрхив = Неопределено;
		НаборЗаписей[0].ОтветственныйЗаПереводВАрхив = Неопределено;
		НаборЗаписей[0].СогласованоПомещениеВАрхив = Неопределено;
		НаборЗаписей[0].ПричинаПереводаКлиентовВАрхив = Неопределено;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
	НайтиИЗакрытьЗадачиПоАрхивированию("Архивирование клиента отменено")
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентБольшеНеАрхивный(Команда)
	
	КлиентБольшеНеАрхивныйНаСервере();
	ЭтаФорма.Закрыть("ОтменаАрхива");
	
КонецПроцедуры

&НаСервере
Процедура НайтиИЗакрытьЗадачиПоАрхивированию(РезультатВыполнения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя
	|ГДЕ
	|	смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.СогласоватьОтправкуВАрхивКлиента)
	|	И CRM_Партнер = &Партнер
	|	И НЕ Выполнена");
	Запрос.УстановитьПараметр("Партнер", Партнер.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадача = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗадача.Выполнена = Истина;
		ОбъектЗадача.РезультатВыполнения = РезультатВыполнения;
		ОбъектЗадача.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры
