#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Типы = ТипЗначения.Типы();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Типы[0]);
	ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Типы = ТипЗначения.Типы();
	Если Типы.Количество() > 1 Тогда
	  	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Составной тип аналитики запрещен.';en='A composite type of analytics is prohibited.'"),, "Объект.ТипЗначения",, Отказ)
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантПолучения = Перечисления.CRM_ВариантыПолученияАналитикиКлассификатора.НастройкиПользователя Тогда
		АлгоритмПолучения = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем параметр сеанса "CRM_ИспользуемаяАналитикаКлассификаторов"
	CRM_КлассификаторыЭкспортныеМетоды.ОбновитьЗначенияИспользуемыхАналитик();

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли