
//++ #Б-1038смарт: Мосолов 23.10.2024 //Доработать календарь загрузки инженеров (смарт)
&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	
	ЦветПриИзмененииНаСервере();

КонецПроцедуры //-- #Б-1038смарт: Мосолов 23.10.2024 

//++ #Б-1038смарт: Мосолов 23.10.2024 //Доработать календарь загрузки инженеров (смарт)
&НаСервере
Процедура ЦветПриИзмененииНаСервере()
	
	Объект.Цвет = ЗначениеВСтрокуВнутр(Цвет);  
	Элементы.Цвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.Цвет);
    Модифицированность = Истина;
	
КонецПроцедуры //-- #Б-1038смарт: Мосолов 23.10.2024 

//++ #Б-1038смарт: Мосолов 23.10.2024 //Доработать календарь загрузки инженеров (смарт)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Если ЗначениеЗаполнено(Объект.Цвет) Тогда
		Элементы.Цвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.Цвет);
	КонецЕсли;     
	
КонецПроцедуры //-- #Б-1038смарт: Мосолов 23.10.2024
