#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Создать элементы справочника по умолчанию
//  Процедура создает элементы справочника по умолчанию.
//
Процедура СоздатьЭлементыСправочникаПоУмолчанию() Экспорт
	
	// Элемент "КОРП рынок"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("КОРП рынок", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='КОРП рынок';en='CORP Market'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Государство"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("Государство", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='Государство';en='The state'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Партнер"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("Партнер", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='Партнер';en='Partner'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "SMB"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("SMB", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='SMB';en='SMB'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры // СоздатьЭлементыСправочникаПоУмолчанию()

#КонецОбласти


#КонецЕсли

