
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("СформироватьСписокРегистровДляКонтроля")
//++ #Б-3292 смарт: Фролов 14.05.2025 //Проверка резервов при отражении порчи
Процедура смарт_СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	
	#Вставка
	//++ #Б-3292 смарт: Фролов 14.05.2025 //Проверка резервов при отражении порчи
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Массив.Добавить(Движения.СвободныеОстатки);
			
	КонецЕсли;
	//-- #Б-3292 смарт: Фролов 14.05.2025
	#КонецВставки

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры //-- #Б-3292 смарт: Фролов 14.05.2025

#КонецОбласти 

#КонецЕсли