// + mwoleg@yandex.ru - начало изменения { [08.12.2014]
// Разработчик обработки.
// Обработка реализована максимально приближено к обработке от Элиас
// } - mwoleg@yandex.ru - конец изменения [08.12.2014]

&НаКлиенте
Процедура СсылкаНаДокументПриИзменении(Элемент)
	
	СсылкаНаДокументПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СсылкаНаДокументПриИзмененииНаСервере()
	
	//Считываем данные из табличной части Менеджеры в дерево значений ДеревоМенеджеров
	СформироватьДеревоДоступныхПолей();

КонецПроцедуры

&НаКлиенте
Процедура ОбходДереваВниз(ТекущиеДанные)
	
	//ДочерниеСтроки = ТекущиеДанные.ПолучитьЭлементы();
	ДочерниеСтроки = ТекущиеДанные.Добавить();
	Для каждого Элемент Из ДочерниеСтроки Цикл
		СуммаПремии = СуммаПремии + Элемент.СуммаПремии;
		Элемент.
		ОбходДереваВниз(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаполнитьДерево(Коряга,Метаданные.Документы[ИмяДокумента].Реквизиты);
	
	
	//// Документв
	//Элементы.ТипДокумента.СписокВыбора.Добавить("ДокументСсылка.РеализацияТоваровУслуг",  "Реализация товаров и услуг");
	//Элементы.ТипДокумента.СписокВыбора.Добавить("ДокументСсылка.ПоступлениеТоваровУслуг", "Поступление товаров услуг");
	//Элементы.ТипДокумента.СписокВыбора.Добавить("ДокументСсылка.ПриходныйКассовыйОрдер",  "Ордер кассовый");
	//
	//// Справочники
	//Элементы.ТипДокумента.СписокВыбора.Добавить("СправочникСсылка.Номенклатура",  "Номенклатура");

	Объект.СсылкаНаДокумент = Параметры.ОбъектМетаданных;

	НастроитьЭлементыФормы();
	
	СсылкаНаДокументПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.ДеревоРеквизитов.КартинкаСтрок             = БиблиотекаКартинок.КоллекцияПиктограммФайлов;
	Элементы.ДеревоРеквизитов.ПутьКДаннымКартинкиСтроки = "ДеревоРеквизитов.ИндексКартинки";
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СсылкаНаДокументПриИзмененииНаСервере();

КонецПроцедуры


////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
//////////// из обработки Инфостарта ///////////////////////

// Процедура чтения табличной части Менеджеры в дерево значений
//
// Параметры
//  Дерево  – <ДеревоЗначений> - дерево значений, в которое осуществляется чтение
//
&НаСервере
Процедура СформироватьДеревоДоступныхПолей() Экспорт
	
	//ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	//
	//ВыбранныйОбъектОбъект = ТИП(ОбъектОбработка.ТипДокумента);
	//ОбъектМетаданных = Метаданные.НайтиПоТипу(ВыбранныйОбъектОбъект);
	//ОбъектМетаданных.Реквизиты
	
	ОбъектМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.ОбъектМетаданныхПоИдентификатору(Объект.СсылкаНаДокумент, Ложь);
	
	//ЗаполнитьДерево(Коряга,Метаданные.Документы[ИмяДокумента].Реквизиты);
	ЗаполнитьДеревоСтандартные(ДеревоРеквизитов.ПолучитьЭлементы(), ОбъектМетаданных.СтандартныеРеквизиты);
	ЗаполнитьДерево(ДеревоРеквизитов.ПолучитьЭлементы(), ОбъектМетаданных.Реквизиты);
	//Для Каждого ТЧ Из Метаданные.Документы[ИмяДокумента].ТабличныеЧасти Цикл
	ЗаполнитьДеревоТЧ(ДеревоРеквизитов.ПолучитьЭлементы(), ОбъектМетаданных.ТабличныеЧасти);
	
	//Для Каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
	//	ЗаполнитьТЧ(ДеревоРеквизитов.ПолучитьЭлементы(),ТЧ);
	//КонецЦикла;	
	
	//ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");

КонецПроцедуры // ПрочитатьДеревоПланов

&НаСервере
Процедура ЗаполнитьПоСпискуРеквизитов(Строка,СписокРеквизитов, ЭтоТабличнаяЧасть = Ложь)
	
	Для Каждого Рекв Из СписокРеквизитов Цикл
		НовСтрока=Строка.Добавить();
		НовСтрока.Реквизит=Рекв.Имя;
		Если ЗначениеЗаполнено(Рекв.Синоним) Тогда
			НовСтрока.Реквизитпредставление=Рекв.Синоним;
		Иначе	
			НовСтрока.Реквизитпредставление=Рекв.Имя;
		КонецЕсли; 
		НовСтрока.ТипРеквизита=Рекв.Тип;
		НовСтрока.ЭтоТабличнаяЧасть=ЭтоТабличнаяЧасть;
		
		ВеткаРодителя = НовСтрока.ПолучитьРодителя();
		Если ВеткаРодителя = Неопределено Тогда 
			НовСтрока.ПолноеИмя=Рекв.Имя;
		Иначе
			НовСтрока.ПолноеИмя=ВеткаРодителя.ПолноеИмя + ?(ЗначениеЗаполнено(ВеткаРодителя.ПолноеИмя),".","") + Рекв.Имя;
		КонецЕсли;
		
		Типы=Рекв.Тип.Типы();
		
		Есть=Ложь;
		Для К=0 По Типы.ВГраница() Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(Типы[К]) ИЛИ Документы.ТипВсеСсылки().СодержитТип(Типы[К]) Тогда 
				Нов=НовСтрока.ПолучитьЭлементы().Добавить();
				Нов.Реквизит="+++";
				Есть=Истина;
				НовСтрока.РеквизитСсылка=Рекв.Тип;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСтандартные(Строка,СписокРеквизитов)
	Строка.Очистить();
	ЗаполнитьПоСпискуРеквизитов(Строка,СписокРеквизитов);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево(Строка,СписокРеквизитов)
	ЗаполнитьПоСпискуРеквизитов(Строка,СписокРеквизитов);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоТЧ(Строка,СписокРеквизитов)
	Для Каждого ТЧ Из СписокРеквизитов Цикл
		ЗаполнитьТЧ(Строка, ТЧ);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ(Строка,ТЧ)
	НовСтрока=Строка.Добавить();
	НовСтрока.Реквизит=ТЧ.Имя;
	НовСтрока.ТипРеквизита = "(ТабличнаяЧасть)";
	НовСтрока.ЭтоТабличнаяЧасть = ИСТИНА;
	НовСтрока.РеквизитПредставление=ТЧ.Синоним+" (табличная часть)";
	//НовСтрока.РеквизитКартинка = БиблиотекаКартинок.Папка;	
	НовСтрока.ИндексКартинки = 2;	
	
	ВеткаРодителя = НовСтрока.ПолучитьРодителя();
	Если ВеткаРодителя = Неопределено Тогда 
		НовСтрока.ПолноеИмя=ТЧ.Имя;
	Иначе
		НовСтрока.ПолноеИмя=ВеткаРодителя.ПолноеИмя + ?(ЗначениеЗаполнено(ВеткаРодителя.ПолноеИмя),".","") + ТЧ.Имя;
	КонецЕсли;

	ЗаполнитьПоСпискуРеквизитов(НовСтрока.ПолучитьЭлементы(),ТЧ.Реквизиты, ИСТИНА);
КонецПроцедуры	

///////////////////////////////////////////
// Обработчики событий
///////////////////////////////////////////

// ОБработка раскрытия ветки дерева
&НаСервере
Процедура КорягаПередРазворачиванием(Строка) Экспорт 
	
	Если Строка.ПолучитьЭлементы()[0].Реквизит = "+++" Тогда 
		Типы=Строка.РеквизитСсылка.Типы();
		Для К=0 По Типы.ВГраница() Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(Типы[К]) ИЛИ Документы.ТипВсеСсылки().СодержитТип(Типы[К]) Тогда 
				
				СписокРеквизитовСтандартные=Метаданные.НайтиПоТипу(Типы[К]).СтандартныеРеквизиты;
				ЗаполнитьДеревоСтандартные(Строка.ПолучитьЭлементы(), СписокРеквизитовСтандартные);
				
				СписокРеквизитов=Метаданные.НайтиПоТипу(Типы[К]).Реквизиты;
				ЗаполнитьДерево(Строка.ПолучитьЭлементы(),СписокРеквизитов);
				
				//// Табличные части
				СписокТабличныхЧастей=Метаданные.НайтиПоТипу(Типы[К]).ТабличныеЧасти;
				ЗаполнитьДеревоТЧ(Строка.ПолучитьЭлементы(), СписокТабличныхЧастей);

			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	//УстановитьКартинкиКоряги(Коряга);
КонецПроцедуры


&НаКлиенте
Процедура ДеревоРеквизитовПередРазворачиванием(Элемент, Строка, Отказ)
	ДеревоРеквизитовПередРазворачиваниемНаСервере(Строка);
КонецПроцедуры


&НаСервере
Процедура ДеревоРеквизитовПередРазворачиваниемНаСервере(Строка)
	
	Лист = ДеревоРеквизитов.НайтиПоИдентификатору(Строка);
	
	КорягаПередРазворачиванием(Лист);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбранныеПоляПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		Для Каждого ВеткаДерева Из ПараметрыПеретаскивания.Значение Цикл
			СтрокаВыбранныеПоля = ВыбранныеПоля.Добавить();
			СтрокаВыбранныеПоля.Поле = ?(ВеткаДерева.ЭтоТабличнаяЧасть, "гвсу_ТабЧасть"+ВеткаДерева.ПолноеИмя, ВеткаДерева.ПолноеИмя);
			
			УстановитьПолеФорматированное(СтрокаВыбранныеПоля);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляФорматВыводаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//
	//ТекущаяСтрока = Элементы.ВыбранныеПоля.ТекущиеДанные;
	//
	//Конструктор=Новый КонструкторФорматнойСтроки();
	//Конструктор.ОткрытьМодально();
	//ТекущаяСтрока.ФорматВывода = Конструктор.Текст;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПолеФорматированное(ТекущаяСтрока)
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ФорматВывода) Тогда 
		
		ТекущаяСтрока.ПолеФорматированное = ТекущаяСтрока.Поле +"(" + ТекущаяСтрока.ФорматВывода + ")";
	Иначе
		
		ТекущаяСтрока.ПолеФорматированное = ТекущаяСтрока.Поле;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ВыбранныеПоля.ТекущиеДанные;
	
	Конструктор=Новый КонструкторФорматнойСтроки();
	Конструктор.ОткрытьМодально();
	
	Если НЕ ЗначениеЗаполнено(Конструктор.Текст) И  ЗначениеЗаполнено(ТекущаяСтрока.ФорматВывода) Тогда 
		
		Ответ = Вопрос(
		НСтр("ru = 'Форматная строка не задана. Очистить текущее значение?'"),
		РежимДиалогаВопрос.ДаНет);
		
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяСтрока.ФорматВывода = Конструктор.Текст;
	
	УстановитьПолеФорматированное(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("ПолноеИмяРеквизита", Элемент.ТекущиеДанные.ПолноеИмя);
	РезультатСтруктура.Вставить("ТипРеквизита", Элемент.ТекущиеДанные.ТипРеквизита);
	РезультатСтруктура.Вставить("ПредставлениеРеквизита", Элемент.ТекущиеДанные.РеквизитПредставление);
	РезультатСтруктура.Вставить("ЭтоТабличнаяЧасть", Элемент.ТекущиеДанные.ЭтоТабличнаяЧасть);
	
	Закрыть(РезультатСтруктура);
	
КонецПроцедуры


