
#Область ПеренесеноСДоработками

&После("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)
	
	//++#1311 смарт: Лопато 02.05.2023 //Изменить форму Счета на оплату (Счет-оферта)
	смартИдентификаторДляФормул = Неопределено;
	//--#1311 смарт: Лопато 02.05.2023
	
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++#1311 смарт: Лопато 02.05.2023 //Изменить форму Счета на оплату (Счет-оферта)  
	Если ЗначениеЗаполнено(ЭтотОбъект.смартИдентификаторДляФормул) Тогда
		смартПроверитьКорректностьИдентификатораДляФормул(Отказ);
	КонецЕсли;	
	//--#1311 смарт: Лопато 02.05.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1311 смарт: Лопато 02.05.2023 //Изменить форму Счета на оплату (Счет-оферта)  
&НаСервере
Процедура смартПроверитьКорректностьИдентификатораДляФормул(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СегментыНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|ГДЕ
		|	СегментыНоменклатуры.Ссылка <> &ТекущийСегментСсылка 
		|	И СегментыНоменклатуры.смартИдентификаторДляФормул = &ИдентификаторДляФормул";
	
	Запрос.УстановитьПараметр("ИдентификаторДляФормул", ЭтотОбъект.смартИдентификаторДляФормул);
	Запрос.УстановитьПараметр("ТекущийСегментСсылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Идентификатор для формул """ + ЭтотОбъект.смартИдентификаторДляФормул + """ уже присвоен другому сегменту: " + СокрЛП(РезультатЗапроса.Ссылка),
			ЭтотОбъект,
			"смартИдентификаторДляФормул",
			,
			Отказ);
			
	КонецЕсли;	
	
КонецПроцедуры //--#1311 смарт: Лопато 02.05.2023

&ИзменениеИКонтроль("ПередЗаписью")
//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов
Процедура смарт_ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	СегментыСервер.СегментОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	#Вставка
	//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов
	Если ЗначениеЗаполнено(Родитель) Тогда
		
		Если НЕ ЭтотОбъект.смартИспользуетсяВПланированииПродаж = Родитель.смартИспользуетсяВПланированииПродаж Тогда
			
			Если ЭтотОбъект.смартИспользуетсяВПланированииПродаж Тогда
				ОбщегоНазначения.СообщитьПользователю("Группа " + Родитель + " не используется в планировании!");
			Иначе
				ОбщегоНазначения.СообщитьПользователю("В группе " + Родитель + " могут быть только сегменты и группы для планирования!");
			КонецЕсли;	
				
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-1436 смарт: Фролов 29.11.2024
	#КонецВставки
	
	#Вставка
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	Если ЗначениеЗаполнено(Родитель) Тогда
		
		Если НЕ ЭтотОбъект.смартИспользуетсяКакТипНоменклатуры = Родитель.смартИспользуетсяКакТипНоменклатуры Тогда
			
			Если ЭтотОбъект.смартИспользуетсяКакТипНоменклатуры Тогда
				ОбщегоНазначения.СообщитьПользователю("Группа " + Родитель + " не используется как тип номенклатуры!");
			Иначе
				ОбщегоНазначения.СообщитьПользователю("В группе " + Родитель + " могут быть только сегменты и группы для типов номенклатуры!");
			КонецЕсли;	
				
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-2220 смарт: Фролов 28.02.2025
	#КонецВставки
	
КонецПроцедуры //-- #Б-1436 смарт: Фролов 29.11.2024

#КонецОбласти