
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура;
	Параметры.Вставить("УзелОбмена", ПараметрКоманды);
	
	ВыполнитьОбменНаСервере(Параметры);
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбменЧерезОбработку(ПараметрыВызова)
	
	СсылкаНаОбъект = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Выгрузка в deeray", Истина);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось найти внешнюю обработку");
		Возврат;
	КонецЕсли;
	
	Если НЕ СсылкаНаОбъект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось найти внешнюю обработку");
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные = СсылкаНаОбъект.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	
	Попытка
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.ВыполнитьОбмен(ПараметрыВызова.УзелОбмена);
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Выбранный файл не является внешней обработкой,
		|поврежден, либо функция вызвана неверно.");
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайла);
		
КонецПроцедуры	              

&НаСервере
Процедура ВыполнитьОбменНаСервере(ПараметрыВызова)
	
	смартИнтеграцияDeeray.ВыгрузитьДанные(ПараметрыВызова.УзелОбмена);
	
КонецПроцедуры	

#КонецОбласти							