
////////////////////////////////////////////////////////////////////////////////
// Сфп софт фон про глобальный
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура сфпПодключитьОбработчикНовыхСообщенийСистемыВзаимодействия() Экспорт
	
	СлужебныйЖурналЗвонков = сфпСофтФонПроСерверПовтИсп.ИдентификаторОбсужденияЖурналЗвонков();
	Если СлужебныйЖурналЗвонков <> Неопределено Тогда	
		сфпСофтФонПроСервер.ПроверитьИдентификаторЖурналаЗвонков(СлужебныйЖурналЗвонков);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщенияОбсуждениеЖурналЗвонков", сфпСофтФонПроКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, СлужебныйЖурналЗвонков, ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
