//++ смарт:Подкин #1025 п.5 20.05.2022 20:40:03
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
    
    ПродажаВРублях=НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
	
	Если ПродажаВРублях и (НЕ Пользователи.ЭтоПолноправныйПользователь() И НЕ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
		
        ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ВидЦены");
        Массив=Новый Массив;
        СтруктураВалюты=Новый Структура; 
        СтруктураВалюты.Вставить("Ключ","ВалютаЦены");
        СтруктураВалюты.Вставить("Значение",Константы.ВалютаРегламентированногоУчета.Получить());
        Массив.Добавить(СтруктураВалюты);
        СписокВидовЦен = Новый СписокЗначений;
        СписокВидовЦен.ЗагрузитьЗначения(Справочники.ВидыЦен.ДоступныеВидыЦен(Массив));
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидЦены", СписокВидовЦен, ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #1025 20.05.2022 20:40:03


