
&НаСервере
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере_После(Отказ, СтандартнаяОбработка)

	//++#1316 смарт: Лопато 12.10.2023 //Запретить использование в документах подразделения другой организации  
    КолонкаОрганизация = Элементы.Вставить("смартОрганизацияВладелец", Тип("ПолеФормы"), Элементы.Список);
    КолонкаОрганизация.ПутьКДанным = "Список.Ссылка.смартОрганизацияВладелец";
    КолонкаОрганизация.Заголовок = "Организация";
    КолонкаОрганизация.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
	//--#1316 смарт: Лопато 12.10.2023
	
КонецПроцедуры
