
#Область СобытияФормыЭлементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборНоменклатура") Тогда
		ОтборНоменклатура = Параметры.ОтборНоменклатура;
	КонецЕсли;
	
	//++ смарт:ММ #103 495 18.04.2021 
	Если Параметры.Свойство("Режим") Тогда
		
		Режим = Параметры.Режим;
		
		Если Режим = 2 Тогда
			Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаПредпосылка.Заголовок = "Характеристика (следствие)";
			Элементы.НоменклатураПродаваемаяСовместноСДаннойНоменклатураСледствие.Заголовок = "Номенклатура (предпосылка)";
			Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаСледствие.Заголовок = "Характеристика (предпосылка)";
		КонецЕсли;
	КонецЕсли;
	//-- смарт:ММ 18.04.2021
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьДоступностьКолонок();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВариантАнализаПриИзменении(Элемент)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		ПроверитьСуществующуюНоменклатуруСервер(Строка.НомерСтроки, Строка.НоменклатураСледствие, Строка.ХарактеристикаСледствие, Строка.ХарактеристикаПредпосылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	НастроитьДоступностьКолонок();
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		ПроверитьСуществующуюНоменклатуруСервер(Строка.НомерСтроки, Строка.НоменклатураСледствие, Строка.ХарактеристикаСледствие, Строка.ХарактеристикаПредпосылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	
	СоздатьЗаписиНаСервере();
	Оповестить("смартИзмененРегистрНоменклатураПродаваемаяСовместно");
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		
		МенеджерЗаписи = РегистрыСведений.НоменклатураПродаваемаяСовместно.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВариантАнализа 				= ВариантАнализа;
		//++ смарт:ММ #103 495 18.04.2021 
		Если Режим = 1 Тогда
			МенеджерЗаписи.НоменклатураПредпосылка 		= ОтборНоменклатура;
			МенеджерЗаписи.ХарактеристикаПредпосылка 	= Строка.ХарактеристикаПредпосылка;			
			МенеджерЗаписи.НоменклатураСледствие 		= Строка.НоменклатураСледствие;
			МенеджерЗаписи.ХарактеристикаСледствие 		= Строка.ХарактеристикаСледствие;			
		Иначе
			МенеджерЗаписи.НоменклатураПредпосылка 		= Строка.НоменклатураСледствие;
			МенеджерЗаписи.ХарактеристикаПредпосылка 	= Строка.ХарактеристикаСледствие;			
			МенеджерЗаписи.НоменклатураСледствие 		= ОтборНоменклатура;
			МенеджерЗаписи.ХарактеристикаСледствие 		= Строка.ХарактеристикаПредпосылка;			
		КонецЕсли;
		//-- смарт:ММ 18.04.2021
		МенеджерЗаписи.ДобавленоАвтоматически 		= Ложь;
		МенеджерЗаписи.ПроцентСлучаев 				= ПроцентСлучаев;
		МенеджерЗаписи.КоличествоСлучаев 			= КоличествоСлучаев;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	//++ смарт:ММ #103 495 04.05.2021 
	Если Не ЗначениеЗаполнено(ВариантАнализа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать вариант анализа");
		Возврат;
	КонецЕсли;
	//-- смарт:ММ 04.05.2021
	
	МассивНедоступнойНоменклатуры = ПолучитьМассивУжеЗаписаннойВРегистрНоменклатуры();
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимВыбора", Истина, Истина, Истина);
	ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, ЭтаФорма.Элементы.НоменклатураПродаваемаяСовместноСДанной);
	
	Если МассивНедоступнойНоменклатуры.Количество() > 0 Тогда
		
		//Элемент = ФормаПодбора.СписокНоменклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент = ФормаПодбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
		Элемент.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеВСписке;
		Элемент.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элемент.Использование 		= Истина;
		Элемент.ПравоеЗначение 		= МассивНедоступнойНоменклатуры;
		
		Элемент.ИдентификаторПользовательскойНастройки = "ОтборСсылка";
		
	КонецЕсли;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		НоваяСтрока = НоменклатураПродаваемаяСовместноСДанной.Добавить();
		НоваяСтрока.НоменклатураСледствие = ВыбранноеЗначение;
		НоваяСтрока.НомерСтроки = ПолучитьСледующийНомерСтроки();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого ВидРасчета Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = НоменклатураПродаваемаяСовместноСДанной.Добавить();
			НоваяСтрока.НоменклатураСледствие = ВидРасчета;
			НоваяСтрока.НомерСтроки = ПолучитьСледующийНомерСтроки();
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекСтрока = Элемент.ТекущиеДанные; 
		ТекСтрока.НомерСтроки = ПолучитьСледующийНомерСтроки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		ПроверитьСуществующуюНоменклатуруСервер(Строка.НомерСтроки, Строка.НоменклатураСледствие, Строка.ХарактеристикаСледствие, Строка.ХарактеристикаПредпосылка);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПослеУдаления(Элемент)
	
	УстановитьДоступностьКомандыСоздатьЗаписи();
	ПроставитьНомераСтрок();	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПриАктивизацииСтроки(Элемент)
	
	НастроитьДоступностьКолонок();
		
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойНоменклатураСледствиеПриИзменении(Элемент)
	
	НастроитьДоступностьКолонок();
	//ПроверитьСуществующуюНоменклатуруКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойХарактеристикаСледствиеПриИзменении(Элемент)
	//ПроверитьСуществующуюНоменклатуруКлиент();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыФункции

&НаКлиенте
Процедура НастроитьДоступностьКолонок()
	
	ПредпосылкаХарактеристикиИспользуются = ХарактеристикиИспользуются(ОтборНоменклатура); 
	Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаПредпосылка.ТолькоПросмотр = НЕ ПредпосылкаХарактеристикиИспользуются;

	ТекущиеДанные = Элементы.НоменклатураПродаваемаяСовместноСДанной.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СледствиеХарактеристикиИспользуются = ХарактеристикиИспользуются(ТекущиеДанные.НоменклатураСледствие);
		Элементы.НоменклатураПродаваемаяСовместноСДаннойХарактеристикаСледствие.ТолькоПросмотр = НЕ СледствиеХарактеристикиИспользуются;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХарактеристикиИспользуются(Номенклатура)
	
	Возврат Справочники.Номенклатура.ХарактеристикиИспользуются(Номенклатура);
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьКомандыСоздатьЗаписи()
	
	ДоступностьКнопки = Истина;
	
	Если НЕ ЗначениеЗаполнено(ВариантАнализа) Тогда
		ДоступностьКнопки = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборНоменклатура) Тогда
		ДоступностьКнопки = Ложь;
	КонецЕсли;

	Если НоменклатураПродаваемаяСовместноСДанной.Количество() = 0 Тогда
		ДоступностьКнопки = Ложь;
	КонецЕсли;
	
	Если ДоступностьКнопки Тогда
		
		Запрос = Новый Запрос;
		//++ смарт:ММ #103 495 04.05.2021 
		Если Режим = 1 Тогда
		//-- смарт:ММ 04.05.2021
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
		|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК НоменклатураСледствие,
		|	НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие КАК ХарактеристикаСледствие
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&НоменклатураПредпосылка КАК НоменклатураПредпосылка,
		|	ВТ_ТЧ.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
		|	ВТ_ТЧ.НоменклатураСледствие КАК НоменклатураСледствие,
		|	ВТ_ТЧ.ХарактеристикаСледствие КАК ХарактеристикаСледствие,
		|	&ВариантАнализа КАК ВариантАнализа
		|ПОМЕСТИТЬ ВТ_ПроверяемыеЗаписи
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка КАК НоменклатураПредпосылка,
		|	ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
		|	ВТ_ПроверяемыеЗаписи.НоменклатураСледствие КАК НоменклатураСледствие,
		|	ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие КАК ХарактеристикаСледствие
		|ИЗ
		|	ВТ_ПроверяемыеЗаписи КАК ВТ_ПроверяемыеЗаписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
		|		ПО ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка = НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка
		|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка = НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка
		|			И ВТ_ПроверяемыеЗаписи.НоменклатураСледствие = НоменклатураПродаваемаяСовместно.НоменклатураСледствие
		|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие = НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие
		|			И ВТ_ПроверяемыеЗаписи.ВариантАнализа = НоменклатураПродаваемаяСовместно.ВариантАнализа";
		
		Запрос.УстановитьПараметр("НоменклатураПродаваемаяСовместно", НоменклатураПродаваемаяСовместноСДанной.Выгрузить());
		Запрос.УстановитьПараметр("ВариантАнализа", ВариантАнализа);
		Запрос.УстановитьПараметр("НоменклатураПредпосылка", ОтборНоменклатура);
		
		//++ смарт:ММ #103 495 04.05.2021 
		ИначеЕсли Режим = 2 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка КАК ХарактеристикаСледствие,
			|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК НоменклатураПредпосылка,
			|	НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие КАК ХарактеристикаПредпосылка
			|ПОМЕСТИТЬ ВТ_ТЧ
			|ИЗ
			|	&НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&НоменклатураСледствие КАК НоменклатураСледствие,
			|	ВТ_ТЧ.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
			|	ВТ_ТЧ.НоменклатураПредпосылка КАК НоменклатураПредпосылка,
			|	ВТ_ТЧ.ХарактеристикаСледствие КАК ХарактеристикаСледствие,
			|	&ВариантАнализа КАК ВариантАнализа
			|ПОМЕСТИТЬ ВТ_ПроверяемыеЗаписи
			|ИЗ
			|	ВТ_ТЧ КАК ВТ_ТЧ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка КАК НоменклатураПредпосылка,
			|	ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка КАК ХарактеристикаПредпосылка,
			|	ВТ_ПроверяемыеЗаписи.НоменклатураСледствие КАК НоменклатураСледствие,
			|	ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие КАК ХарактеристикаСледствие
			|ИЗ
			|	ВТ_ПроверяемыеЗаписи КАК ВТ_ПроверяемыеЗаписи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
			|		ПО ВТ_ПроверяемыеЗаписи.НоменклатураПредпосылка = НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка
			|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаПредпосылка = НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка
			|			И ВТ_ПроверяемыеЗаписи.НоменклатураСледствие = НоменклатураПродаваемаяСовместно.НоменклатураСледствие
			|			И ВТ_ПроверяемыеЗаписи.ХарактеристикаСледствие = НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие
			|			И ВТ_ПроверяемыеЗаписи.ВариантАнализа = НоменклатураПродаваемаяСовместно.ВариантАнализа";
			
			Запрос.УстановитьПараметр("НоменклатураПродаваемаяСовместно", НоменклатураПродаваемаяСовместноСДанной.Выгрузить());
			Запрос.УстановитьПараметр("ВариантАнализа", ВариантАнализа);
			Запрос.УстановитьПараметр("НоменклатураСледствие", ОтборНоменклатура);

		КонецЕсли;
		//-- смарт:ММ 04.05.2021
		РезультатЗапроса = Запрос.Выполнить();
		ДоступностьКнопки = РезультатЗапроса.Пустой();
		
	КонецЕсли;
	
	Элементы.ФормаСоздатьЗаписи.Доступность = ДоступностьКнопки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьСуществующуюНоменклатуруКлиент()
	
	//ТекущиеДанные = Элементы.НоменклатураПродаваемаяСовместноСДанной.ТекущиеДанные;
	//
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//УжеЕстьЗаписьВРегистре = ПроверитьСуществующуюНоменклатуруСервер(ТекущиеДанные.НоменклатураСледствие, ТекущиеДанные.ХарактеристикаСледствие, ТекущиеДанные.ХарактеристикаПредпосылка);
	//		
КонецПроцедуры

&НаСервере
Функция ПроверитьСуществующуюНоменклатуруСервер(НомерСтроки, Номенклатура, Характеристика, ХарактеристикаПредпосылка)
	
	УжеЕстьЗапись = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НоменклатураСледствие", Номенклатура);
	Отбор.Вставить("ХарактеристикаСледствие", Характеристика);
	Отбор.Вставить("ХарактеристикаПредпосылка", ХарактеристикаПредпосылка);
	
	НайденныеСтроки = НоменклатураПродаваемаяСовместноСДанной.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = "В таблице уже есть строка для полей Строка " + НомерСтроки + ", " + ОтборНоменклатура 
			+ ?(ЗначениеЗаполнено(ХарактеристикаПредпосылка), " (" + ХарактеристикаПредпосылка + ")", "") 
			+ " - " + Номенклатура + " " + Характеристика;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		УжеЕстьЗапись = Истина;
	КонецЕсли;                               
	
	Если НЕ УжеЕстьЗапись Тогда
		МенеджерЗаписи = РегистрыСведений.НоменклатураПродаваемаяСовместно.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВариантАнализа 				= ВариантАнализа;
		//++ смарт:ММ #103 495 18.04.2021 
		Если Режим = 1 Тогда
		//-- смарт:ММ 18.04.2021
		МенеджерЗаписи.НоменклатураПредпосылка 		= ОтборНоменклатура;
		МенеджерЗаписи.ХарактеристикаПредпосылка 	= ХарактеристикаПредпосылка;
		МенеджерЗаписи.НоменклатураСледствие 		= Номенклатура;
		МенеджерЗаписи.ХарактеристикаСледствие 		= Характеристика;
		
		//++ смарт:ММ #103 495 18.04.2021 
		Иначе
			МенеджерЗаписи.НоменклатураПредпосылка 		= Номенклатура;
			МенеджерЗаписи.ХарактеристикаПредпосылка 	= Характеристика;
			МенеджерЗаписи.НоменклатураСледствие 		= ОтборНоменклатура;
			МенеджерЗаписи.ХарактеристикаСледствие 		= ХарактеристикаПредпосылка;
		КонецЕсли;
		//-- смарт:ММ 18.04.2021
		
		//МенеджерЗаписи.ДобавленоАвтоматически 		= Ложь;
		
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			ТекстСообщения = "В регистре уже имеется запись для полей Строка " + НомерСтроки + ", " + ВариантАнализа + ": " + ОтборНоменклатура 
			+ ?(ЗначениеЗаполнено(ХарактеристикаПредпосылка), " (" + ХарактеристикаПредпосылка + ")", "") 
			+ " - " + Номенклатура + " " + Характеристика;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			УжеЕстьЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Возврат УжеЕстьЗапись;
	
КонецФункции

&НаСервере
Процедура ПроставитьНомераСтрок()
	
	НомерСтроки = 1;
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивУжеЗаписаннойВРегистрНоменклатуры()
	
	Запрос = Новый Запрос;
	//++ смарт:ММ #103 495 04.05.2021 
	Запрос.УстановитьПараметр("ВариантАнализа", ВариантАнализа);
	
	Если Режим = 1 Тогда 
	//-- смарт:ММ 04.05.2021
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК НоменклатураСледствие
	|ИЗ
	|	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
	|ГДЕ
	//++ смарт:ММ #103 495 04.05.2021 
	|	НоменклатураПродаваемаяСовместно.ВариантАнализа = &ВариантАнализа
	|	И
	//-- смарт:ММ 04.05.2021
	|	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка = &НоменклатураПредпосылка";
	
	Запрос.УстановитьПараметр("НоменклатураПредпосылка", ОтборНоменклатура);
	
	МассивУжеИспользованнойНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураСледствие");
	
	//++ смарт:ММ #103 495 04.05.2021 
	ИначеЕсли Режим = 2 Тогда 
	
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка КАК Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
		|ГДЕ
		|	НоменклатураПродаваемаяСовместно.ВариантАнализа = &ВариантАнализа
		|	И
		|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие = &ОтборНоменклатура";
		
		Запрос.УстановитьПараметр("ОтборНоменклатура", ОтборНоменклатура);
		
		МассивУжеИспользованнойНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;	
	//-- смарт:ММ 04.05.2021
		
	// Дополнить номенклатурой из текущей табличной части
	
	Для Каждого Строка Из НоменклатураПродаваемаяСовместноСДанной Цикл
		Если МассивУжеИспользованнойНоменклатуры.Найти(Строка.НоменклатураСледствие) = Неопределено Тогда
			МассивУжеИспользованнойНоменклатуры.Добавить(Строка.НоменклатураСледствие);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивУжеИспользованнойНоменклатуры;
		
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	Сч = 1;
	ИДСтроки = 0;
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл	
		Если Сч = 1 И НоменклатураПродаваемаяСовместноСДанной.Количество() <> 0 Тогда
			ИДСтроки = ПолучитьСледующийНомерСтроки();
		Иначе
			ИДСтроки = ИДСтроки + 1;
		КонецЕсли;
		
		ТекущаяСтрока = НоменклатураПродаваемаяСовместноСДанной.Добавить();
		ТекущаяСтрока.НоменклатураСледствие = СтрокаТовара.Номенклатура;		
		ТекущаяСтрока.НомерСтроки = ИДСтроки;	
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийНомерСтроки()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПродаваемаяСовместноСДанной.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК НоменклатураПродаваемаяСовместноСДанной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВТ.НомерСтроки), 0) КАК НомерСтроки
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТЗ", НоменклатураПродаваемаяСовместноСДанной.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки + 1;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

//++ смарт:ММ #103 495 04.05.2021 
&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(ВариантАнализа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать вариант анализа");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры //-- смарт:ММ 04.05.2021

//++ смарт:ММ #103 495 04.05.2021 
&НаКлиенте
Процедура НоменклатураПродаваемаяСовместноСДаннойНоменклатураСледствиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивНедоступнойНоменклатуры = ПолучитьМассивУжеЗаписаннойВРегистрНоменклатуры();
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимВыбора", Истина, Ложь, Истина);
	ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, Элемент);
	
	Если МассивНедоступнойНоменклатуры.Количество() > 0 Тогда
		
		Элемент = ФормаПодбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
		Элемент.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеВСписке;
		Элемент.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Элемент.Использование 		= Истина;
		Элемент.ПравоеЗначение 		= МассивНедоступнойНоменклатуры;
		
		Элемент.ИдентификаторПользовательскойНастройки = "ОтборСсылка";
		
	КонецЕсли;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры //-- смарт:ММ 04.05.2021

#КонецОбласти