
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Элементы.ФормаПодборИзТНВЭД.Видимость = ПравоДоступа("Редактирование", Метаданные.Справочники.КлассификаторТНВЭД);
	
	#Вставка
	//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
	НовыйЭлемент = Элементы.Добавить("смартОбязательнаяМаркировка", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Список.Ссылка.смартОбязательнаяМаркировка";
	
	НовыйЭлемент = Элементы.Добавить("смартЭкспериментальныйРежимМаркировки", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Список.Ссылка.смартЭкспериментальныйРежимМаркировки";
	//-- #Б3790 смарт: Шляпников 12.08.2025
	#КонецВставки
	
КонецПроцедуры
