
//Каратеев

//
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаПоступления = Дата(ТекущаяДата());
		Объект.ВНаличии = Истина;
	КонецЕсли;
	
	УстановитьВидимость();
	ПерезаполнитьНаименование();
	
КонецПроцедуры

#КонецОбласти

//
#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ВНаличииПриИзменении(Элемент)
	ВНаличииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВНаличииПриИзмененииНаСервере()
	Объект.ДатаПоступления = Дата(1,1,1);
	ПерезаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ЭксперементальныйПриИзменении(Элемент)
	
	УстановитьВидимость();	
	ЭксперементальныйПриИзмененииНаСервере();
	ПерезаполнитьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ЭксперементальныйПриИзмененииНаСервере()
	
	Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Объект.НаименованиеЭксперементальное = "";
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ПерезаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЭксперементальноеПриИзменении(Элемент)
	ПерезаполнитьНаименование();
КонецПроцедуры

#КонецОбласти

//
#Область ОбщиеКомманды

&НаСервере
Процедура ПерезаполнитьНаименование()
	
	НаименованиеМатериала = ?(Объект.Эксперементальный, 
								?(Объект.НаименованиеЭксперементальное = "", "", Объект.НаименованиеЭксперементальное + " (Эксперементальный)"), 
								Объект.Номенклатура.Наименование);
	Наличие = ?(Объект.ВНаличии, " в наличии", " под заказ");
	Объект.Наименование = ?(НаименованиеМатериала = "", "", НаименованиеМатериала + " / " + Наличие); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.Номенклатура.Видимость = Ложь;
	Элементы.НаименованиеЭксперементальное.Видимость = Ложь;
	
	Если Объект.Эксперементальный Тогда
		Элементы.НаименованиеЭксперементальное.Видимость = Истина;
	Иначе
		Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти