#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		//Компьютер = ИмяКомпьютера();
		Пользователь = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
		//Наименование = Строка(Пользователь) +" (" + Строка(Компьютер) + ")";
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли