
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда 
		ОтборКомпоновкиДанных = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборКомпоновкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ОтборКомпоновкиДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборКомпоновкиДанных.ПравоеЗначение = Параметры.Отбор.Владелец;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

