
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
//++ #1845 смарт: Фролов 06.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументCRM_Заявка.Ссылка КАК Ссылка,
	|	ДокументCRM_Заявка.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументCRM_Заявка.Номер КАК Номер,
	|	ДокументCRM_Заявка.Дата КАК Дата,
	|	ДокументCRM_Заявка.Проведен КАК Проведен,
	|	ДокументCRM_Заявка.CRM_РольОтветственного КАК CRM_РольОтветственного,
	|	ДокументCRM_Заявка.CRM_СкрытьВАРМ КАК CRM_СкрытьВАРМ,
	|	ДокументCRM_Заявка.UTMМетка КАК UTMМетка,
	|	ДокументCRM_Заявка.Автор КАК Автор,
	|	ДокументCRM_Заявка.ДокументОснование КАК ДокументОснование,
	|	ДокументCRM_Заявка.ИДСобытия КАК ИДСобытия,
	|	ДокументCRM_Заявка.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтереса,
	|	ДокументCRM_Заявка.ИсточникПолучения КАК ИсточникПолучения,
	|	ДокументCRM_Заявка.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса,
	|	ДокументCRM_Заявка.Комментарий КАК Комментарий,
	|	ДокументCRM_Заявка.Контакт КАК Контакт,
	|	ДокументCRM_Заявка.Наименование КАК Наименование,
	|	ДокументCRM_Заявка.Организация КАК Организация,
	|	ДокументCRM_Заявка.Ответственный КАК Ответственный,
	|	ДокументCRM_Заявка.Телефон КАК Телефон,
	|	ДокументCRM_Заявка.Тема КАК Тема,
	|	ДокументCRM_Заявка.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|	ДокументCRM_Заявка.ТипЗаявки КАК ТипЗаявки,
	|	ДокументCRM_Заявка.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение
	|	) КАК ДополнительныеРеквизиты,
	|	ДокументCRM_Заявка.МоментВремени КАК МоментВремени,
	|	ВЫБОР
	|		КОГДА ДокументCRM_Заявка.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ДокументCRM_Заявка.CRM_РольОтветственного
	|		ИНАЧЕ ДокументCRM_Заявка.Ответственный
	|	КОНЕЦ КАК Ответственный_Роль,
	|	CRM_СостоянияЛидов.Состояние КАК Состояние,
	|	CRM_СостоянияЛидов.СконвертированВОбъект КАК Интерес,
	|	ДокументCRM_Заявка.смартБизнесРегион КАК смартБизнесРегион,
	|	ДокументCRM_Заявка.смартКвалификация КАК смартКвалификация,
	|	ДокументCRM_Заявка.смартСостояниеЛида КАК смартСостояниеЛида,
	|	ДокументCRM_Заявка.смартПродукт КАК смартПродукт,
	|	ДокументCRM_Заявка.смартТипТовара КАК смартТипТовара,
	|	ДокументCRM_Заявка.смартБизнесРегионТекст КАК смартБизнесРегионТекст,
	|	смартИсторияРаботыСЛидом.ДатаКонтроля КАК ДатаКонтроля,
	|	смартИсторияРаботыСЛидом.ДатаОбработки КАК ДатаОбработки
	|ИЗ
	|	Документ.CRM_Заявка КАК ДокументCRM_Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	|		ПО (ДокументCRM_Заявка.Ссылка = CRM_СостоянияЛидов.Лид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияРаботыСЛидом КАК смартИсторияРаботыСЛидом
	|		ПО (ДокументCRM_Заявка.Ссылка = смартИсторияРаботыСЛидом.Лид)";
	
	НоваяКолонка = Элементы.Вставить("смартСостояниеЛида", Тип("ПолеФормы"), Элементы.Список, Элементы.Наименование);
	НоваяКолонка.ПутьКДанным = "Список.смартСостояниеЛида";
	НоваяКолонка.Заголовок = "Состояние";
	
	НоваяКолонка = Элементы.Добавить("смартКвалификация", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.смартКвалификация";
	НоваяКолонка.Заголовок = "Квалификация";
	
	НоваяКолонка = Элементы.Добавить("Телефон", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.Телефон";
	НоваяКолонка.Заголовок = "Телефон";
	
	НоваяКолонка = Элементы.Добавить("ЭлектроннаяПочта", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.ЭлектроннаяПочта";
	НоваяКолонка.Заголовок = "Электронная почта";
	
	НоваяКолонка = Элементы.Добавить("Контакт", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.Контакт";
	НоваяКолонка.Заголовок = "Контакт";

	НоваяКолонка = Элементы.Добавить("смартПродукт", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.смартПродукт";
	НоваяКолонка.Заголовок = "Продукт";
	
	НоваяКолонка = Элементы.Добавить("смартТипТовара", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.смартТипТовара";
	НоваяКолонка.Заголовок = "Тип товара";
	
	НоваяКолонка = Элементы.Добавить("смартБизнесРегион", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.смартБизнесРегион";
	НоваяКолонка.Заголовок = "Бизнес регион";
	
	НоваяКолонка = Элементы.Добавить("ДатаКонтроля", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.ДатаКонтроля";
	НоваяКолонка.Заголовок = "Дата контроля";

	НоваяКолонка = Элементы.Добавить("ДатаОбработки", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.ДатаОбработки";
	НоваяКолонка.Заголовок = "Дата обработки";
	
	Элементы.Переместить(Элементы.Тема, Элементы.Список, Неопределено);
	Элементы.Переместить(Элементы.Состояние, Элементы.Список, Неопределено);
	Элементы.Переместить(Элементы.ИсточникПолучения, Элементы.Список, Неопределено);
	Элементы.Переместить(Элементы.Ответственный, Элементы.Список, Элементы.ДатаКонтроля);
	Элементы.Переместить(Элементы.Ответственный_Роль, Элементы.Список, Элементы.ДатаКонтроля);
	Элементы.Переместить(Элементы.Автор, Элементы.Список, Неопределено);
	
	смартУстановитьУсловноеОформление();
	
КонецПроцедуры //-- #1845 смарт: Фролов 06.06.2024

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
//++ #1845 смарт: Фролов 06.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.
Процедура смартУстановитьУсловноеОформление() 

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОбработки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(215, 240, 199));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаЭлементовОтбора.Использование = Истина;

	ЭлементУсловия = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОбработки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУсловия = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаКонтроля");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементУсловия.ПравоеЗначение = ТекущаяДата();
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 200, 200));
	
КонецПроцедуры //-- #1845 смарт: Фролов 06.06.2024

#КонецОбласти
