Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат смартДеловыеЛинии.МассивДвухЭлементов("uid", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = смартДеловыеЛинии.НоваяТаблицаПолейЗначений();
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Наименование", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "title", "ПолноеНаименование", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "countryUID", "СтранаUID", "Реквизит");	
	
	Возврат Результат;
	
КонецФункции