	
//++ смарт:ММ #008 136 08.12.2019
Процедура смартПроверкаКонтрагентаПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
	//Если РольДоступна("ПолныеПрава") Тогда
	//	Возврат;
	//КонецЕсли;

	ПроверятьКонтрагентов = Справочники.смартПредопределенныеЗначения.ПроверятьЗаполненностьКонтрагентаПередПроведениемДокументов.Значение;
	
	Если ТипЗнч(ПроверятьКонтрагентов) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверятьКонтрагентов = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		// смарт:++Белоусова 376 04.06.2021  
		запрос = новый запрос;
		запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
		|	ЗаказКлиентаТовары.Отменено КАК Отменено
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|	И ЗаказКлиентаТовары.Отменено";
		запрос.УстановитьПараметр("Ссылка",источник.ссылка);
		рез = запрос.Выполнить().Выгрузить();
		если рез.Количество() = Источник.товары.количество() тогда
			Возврат;
		КонецЕсли;
		// смарт:--Белоусова 376 04.06.2021
		
		//++смарт: Белоусова #448 21.03.2021
		//МояПроверка = смартОбщегоНазначения.ПолучитьДанныеПоКонтрагентуИЗЭДО(Источник.Контрагент);
		//статус = "";
		//ошибка = "";

		//если ТипЗнч(МояПроверка) = тип("Структура") тогда
		//	если МояПроверка.Свойство("Статус") тогда	
		//		статус = МояПроверка.статус.наименование;
		//	конецЕсли;
		//	если МояПроверка.Свойство("ОписаниеОшибки") тогда	
		//		если НЕ МояПроверка.ОписаниеОшибки = неопределено тогда
		//			ошибка = МояПроверка.ОписаниеОшибки;
		//		КонецЕсли;
		//	конецЕсли;
		//	если не статус = "" и не статус = "Действующее" тогда
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Состояние контрагента по данным ИФНС "+ статус + " не позволяет создать заказ. Пожалуйста отредактируйте контрагента или выберите другого");	
		//		Отказ = Истина;
		//		//возврат;
		//	КонецЕсли;
		//	если не ошибка = "" тогда
		//		если найти(ошибка,"Не удалось найти данные для заполнения реквизитов по ИНН")>0 тогда
		//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У контрагента неверный ИНН! Пожалуйста отредактируйте контрагента или выберите другого!");	
		//			Отказ = Истина;
		//		иначе
		//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка + " Пожалуйста отредактируйте контрагента или выберите другого!");	
		//			Отказ = Истина;
		//			
		//			
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//--смарт: Белоусова #448 21.03.2021

		
		СоответствиеНезаполненныхРеквизитов = смартОбщегоНазначения.ПолучитьНезаполненныеРеквизитыКонтрагента(Источник.Контрагент);
		
		НезаполненныеРеквизиты = СоответствиеНезаполненныхРеквизитов.Получить(Источник.Контрагент);
		
		Если ТипЗнч(НезаполненныеРеквизиты) = Тип("Массив") И НезаполненныеРеквизиты.Количество() <> 0 Тогда
			
			Отказ = Истина;
			
			СписокРеквизитов = "";
			
			Для Каждого Реквизит Из НезаполненныеРеквизиты Цикл
				СписокРеквизитов = СписокРеквизитов + ?(ЗначениеЗаполнено(СписокРеквизитов), ", ", "") + Реквизит;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У контрагента """ + Источник.Контрагент + """ не заполнены реквизиты: " + СписокРеквизитов);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 08.12.2019

//++ смарт:ММ #022 193 19.02.2020 - доработка формирования Счетов на оплату на основании Заказов клиентов
Процедура смартЗаказКлиентаПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	 // Если по заказу не сформирован Счет, то сформировать новый; 
	 // если счет уже имеется,то переформировать его (если есть отличия в реквизитах, 
	 // например, изменился контрагент или сумма).
	 
	 Если Источник.Проведен 
		 //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 04.03.2020 15:19:05
		И НЕ Источник.ОбменДанными.Загрузка 
		//Смарт }Подкин Алексей Иванович 04.03.2020 15:19:05
		//++ смарт:ММ #022 193 30.03.2020 
		И Год(ТекущаяДата()) = Год(Источник.Дата)
		//-- смарт:ММ 30.03.2020
		Тогда
		 
		 
		 //++ смарт:Балашов #1360 29.05.2023 убираем авто создание документа при записи 
		 СоздаватьСчет = Ложь;
		 ДокументСчет = Документы.СчетНаОплатуКлиенту.ПустаяСсылка();
		 //ДокументСчет = ПолучитьОбъектСчетНаОплату(Источник.Ссылка, СоздаватьСчет);
		 //-- смарт:Балашов #1360 29.05.2023 
		 
		 Если СоздаватьСчет Тогда
			 
			 ДокументСчет.Заполнить(Неопределено);
			 ЗаполнитьЗначенияСвойств(ДокументСчет, Источник);
			 
			 ДокументСчет.ДокументОснование = Источник.Ссылка;
			 
			 ДокументСчет.Дата = ТекущаяДатаСеанса();
			 ДокументСчет.Номер = Источник.Номер;
			 ДокументСчет.СуммаДокумента = Источник.СуммаДокумента;
			 ДокументСчет.ЧастичнаяОплата = Ложь;
			 
			 ДокументСчет.НазначениеПлатежа = Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
					Источник.Номер,
					Источник.Ссылка);
			
			 ДокументСчет.Проведен = Ложь;
			 
			 Для Каждого ТекущийЭтап Из Источник.ЭтапыГрафикаОплаты Цикл
				 НовыйЭтап = ДокументСчет.ЭтапыГрафикаОплаты.Добавить();
				 НовыйЭтап.ДатаПлатежа    = ТекущийЭтап.ДатаПлатежа;
				 НовыйЭтап.СуммаПлатежа   = Источник.СуммаДокумента;
				 НовыйЭтап.ЭтоЗалогЗаТару = ТекущийЭтап.СуммаЗалогаЗаТару > 0;
				 НовыйЭтап.ПроцентПлатежа = 100;
			 КонецЦикла;
			 
			 Попытка
				 ДокументСчет.Записать(РежимЗаписиДокумента.Проведение);
				 //ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + ДокументСчет.Ссылка, ДокументСчет.Ссылка);
			 Исключение
				 ДокументСчет.Записать(РежимЗаписиДокумента.Запись);
				 //ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан, но не проведен документ " + ДокументСчет.Ссылка + Символы.ПС + ОписаниеОшибки(), ДокументСчет.Ссылка);
			 КонецПопытки;	
		 КонецЕсли;
		 
	 КонецЕсли;
	 
	 //++ смарт:ММ #090 436 29.12.2020 - Фоновое изменение заявки на пусконаладку при изменении заказа клиента
	 Если Источник.Проведен 
		И РольДоступна("смартДобавлениеИзменениеЗаявкиНаПускоНаладку")//смарт:rnp - добавлено ограничение на доступную роль, иначе запускаются и завершаются с ошибкой фоновые задания у пользователей без доступа к заявкам на ПНР 
		И НЕ Источник.ОбменДанными.Загрузка Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыПроцедуры = Новый Структура();
		ПараметрыПроцедуры.Вставить("ДокументСсылка", Источник.Ссылка);
		
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ИзменитьЗаявкуНаПусконаладкуПоЗаказуКлиента", ПараметрыПроцедуры, ПараметрыВыполнения);

	КонецЕсли;
	 //-- смарт:ММ 29.12.2020
	 
	 //++ смарт:Демичев №1147 22.08.2022((  
	 Если Не Источник.Проведен и Источник.ПометкаУдаления Тогда
		 
		 мДокСчет = ПолучитьОбъектСчетНаОплату_Ссылку(Источник.Ссылка); 
		 
		 Если мДокСчет <> Неопределено Тогда
			 
			 ОбъектСчет = мДокСчет.ПолучитьОбъект();
			 
			 ОбъектСчет.УстановитьПометкуУдаления(Истина);
			 
			 Попытка
				 
				 ОбъектСчет.Записать();
				 
			 Исключение
				 
				 мОшибка = ОписаниеОшибки();
				 
				 ТекстСообщения = "При установке пометки удаления для Документа ""Счет на оплату"" №" + Строка(мДокСчет.Номер) + " от " + Строка(мДокСчет.Дата) + " произошла ошибка: " + мОшибка;
				 ЗаписьЖурналаРегистрации("смартОбработкаПодписокНаСобытия.смартЗаказКлиентаПриЗаписиПриЗаписи", УровеньЖурналаРегистрации.Ошибка,, Источник.Ссылка, ТекстСообщения);
				 				 
			 КонецПопытки;
			 
		 КонецЕсли;
		 
	 КонецЕсли;
	 //-- смарт:Демичев №1147 22.08.2022))  
	 
КонецПроцедуры //-- смарт:ММ 19.02.2020
//-- смарт:Демичев №1147 22.08.2022))  

//++ смарт:ММ #022 193 20.02.2020 - доработка формирования Счетов на оплату на основании Заказов клиентов
Функция ПолучитьОбъектСчетНаОплату(ЗаказКлиента, СоздаватьСчет = Ложь) Экспорт
	
	// Подразумевается, что на 1 Заказ 1 Счет на оплату
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СчетНаОплатуКлиенту.Ссылка         КАК Ссылка,
	|	СчетНаОплатуКлиенту.Организация    КАК Организация,
	|	СчетНаОплатуКлиенту.Контрагент     КАК Контрагент,
	|	СчетНаОплатуКлиенту.СуммаДокумента КАК СуммаДокумента,
	|	СчетНаОплатуКлиенту.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.Контрагент            КАК КонтрагентЗаказ,
	|	ЗаказКлиента.СуммаДокумента        КАК СуммаДокументаЗаказ,
	|	ЗаказКлиента.БанковскийСчет        КАК БанковскийСчетЗаказ
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО СчетНаОплатуКлиенту.ДокументОснование = ЗаказКлиента.Ссылка
	//|			И (НЕ СчетНаОплатуКлиенту.ПометкаУдаления)
	|ГДЕ
	|	(ВЫРАЗИТЬ(СчетНаОплатуКлиенту.ДокументОснование КАК Документ.ЗаказКлиента)) = &ДокументОснование
	|	И ЗаказКлиента.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоздаватьСчет = Ложь;
	ДокументСчет = Неопределено;
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Организация <> ЗаказКлиента.Организация Тогда
			
			//Смарт+ {заявка 347} Станчев Андрей
			УстановитьПривилегированныйРежим(Истина);
			ДокументСчет = Выборка.Ссылка.ПолучитьОбъект();
			ДокументСчет.Удалить();  // т.к. нам необходимо переделать документ по любому (удалим его непосредственно
			                         // и сразу создадим заново 
			
			ДокументСчет = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
			СоздаватьСчет = Истина;
			//Смарт- {заявка 347} Станчев Андрей

		ИначеЕсли Выборка.Контрагент <> Выборка.КонтрагентЗаказ 
			ИЛИ Выборка.СуммаДокумента <> Выборка.СуммаДокументаЗаказ 
			ИЛИ Выборка.БанковскийСчет <> Выборка.БанковскийСчетЗаказ Тогда
			
			ДокументСчет = Выборка.Ссылка.ПолучитьОбъект();
			ДокументСчет.ПометкаУдаления = Ложь;
			ДокументСчет.ЭтапыГрафикаОплаты.Очистить();
			ДокументСчет.ЧастичнаяОплата = Ложь;
			ДокументСчет.Аннулирован = Ложь;
			
			СоздаватьСчет = Истина;
		КонецЕсли;
	Иначе
		ДокументСчет = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
		СоздаватьСчет = Истина;
	КонецЕсли;
	
	Возврат ДокументСчет;
	
КонецФункции //-- смарт:ММ 20.02.2020

//++ смарт:ММ #010 137 02.01.2020
Процедура смартОбработкаПроведенияДокументовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
		
	//++ смарт:ММ #044 224 15.02.2021 - Заявка на гарантийный ремонт 
	Если (ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйОрдерНаТовары"))
		И НЕ Источник.ОбменДанными.Загрузка 
		Тогда
		
		ДобавитьДвиженияПосмартОстаткиНаСкладеГарантийныхЗапчастей(Источник);
		
	КонецЕсли;
	//-- смарт:ММ 15.02.2021

	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары")
		И Источник.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят
		// ++ 22.06.2020
		//И Источник.Склад = Справочники.смартПредопределенныеЗначения.ОсновнойСклад.Значение // Чтобы сюда не попадать, когда инженер сдает на склад ГАРАНТИЯ
		// -- 22.06.2020
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 04.03.2020 15:19:05
		И НЕ Источник.ОбменДанными.Загрузка 
		//Смарт }Подкин Алексей Иванович 04.03.2020 15:19:05
		
		//++ #6328 смарт: Тимофеева 15.04.2026 / Перевод запчастей на серийный учет. Автоматизация создания ордеров для складов физлиц. ЗГР. Ошибка. 
		И НЕ (Источник.Отправитель = Справочники.смартПредопределенныеЗначения.СкладГарантийныхЗапчастейПоУмолчанию.Значение 
	 	И смартСервер.ЭтоСкладФизическогоЛица(Источник.Склад))
        //-- #6328 смарт: Тимофеева 15.04.2026 
		
		Тогда		
		
		//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт 
		// Перенесено в фоновое выполнение (сюда смартОбработкаПроведенияПриходныйОрдер)
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыПроцедуры = Новый Структура();
		ПараметрыПроцедуры.Вставить("Источник", Источник.Ссылка);
				
		смартОтправлятьУведомления = Ложь;
		ДопСвойства = Источник.ДополнительныеСвойства;
		Если (ДопСвойства.Свойство("ЭтоНовый") И ДопСвойства.ЭтоНовый = Истина)
			ИЛИ (ДопСвойства.Свойство("смартОтправлятьУведомления") И ДопСвойства.смартОтправлятьУведомления = Истина) Тогда
			смартОтправлятьУведомления = Истина;
		КонецЕсли;	
		
		ПараметрыПроцедуры.Вставить("смартОтправлятьУведомления", смартОтправлятьУведомления);
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.смартОбработкаПроведенияПриходныйОрдер", ПараметрыПроцедуры, ПараметрыВыполнения);
		//-- смарт:ММ 18.11.2020

	//++ смарт:ММ #044 137 15.04.2020 
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйОрдерНаТовары")
		И Источник.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
		И НЕ Источник.ОбменДанными.Загрузка 
		Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		//++ #Б1154 смарт: Шляпников 29.10.2024 / Контроль оперативных остатков в разрезе организаций
		//"ВЫБРАТЬ
		//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт,
		//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	&Товары КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ.Номенклатура КАК Номенклатура,
		//|	ВТ.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт,
		//// ++ 21.11.2020
		////|	ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка, ЗНАЧЕНИЕ(Документ.смартЗАявкаНаГарантийныйРемонт.ПустаяСсылка)) КАК ЗаявкаНаГарантийныйРемонт,
		////|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерСтроки КАК НомерСтроки
		//|	ЕСТЬNULL(Статусы.Ссылка, ЗНАЧЕНИЕ(Документ.смартЗАявкаНаГарантийныйРемонт.ПустаяСсылка)) КАК ЗаявкаНаГарантийныйРемонт,
		//|	ЕСТЬNULL(Статусы.НомерПозиции, """") КАК НомерПозиции
		//// --	
		//|ИЗ
		//|	ВТ КАК ВТ
		//// ++ 21.11.2020
		////|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
		////|		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонт = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка.Номер
		////|			И ВТ.Номенклатура = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.Статусы КАК Статусы
		//|		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонт = Статусы.Ссылка.Номер
		//|			И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка)
		//|			И ВТ.Распоряжение = Статусы.ДокументДвижения
		//// --
		//|				
		//|ГДЕ
		//|	ВТ.смартНомерЗаявкиНаГарантийныйРемонт <> """"
		//|	И ВТ.Распоряжение ССЫЛКА Документ.ВозвратТоваровПоставщику
		//|ИТОГИ
		//|	МАКСИМУМ(Номенклатура),
		//|	МАКСИМУМ(смартНомерЗаявкиНаГарантийныйРемонт)
		//|ПО
		//|	ЗаявкаНаГарантийныйРемонт";
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.смартНомерЗаявкиНаГарантийныйРемонтСсылка КАК смартНомерЗаявкиНаГарантийныйРемонтСсылка,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Товары КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	Статусы.Ссылка.Номер КАК смартНомерЗаявкиНаГарантийныйРемонт,
		|	ЕСТЬNULL(Статусы.Ссылка, ЗНАЧЕНИЕ(Документ.смартЗАявкаНаГарантийныйРемонт.ПустаяСсылка)) КАК ЗаявкаНаГарантийныйРемонт,
		|	ЕСТЬNULL(Статусы.НомерПозиции, """") КАК НомерПозиции
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.Статусы КАК Статусы
		|		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Статусы.Ссылка
		|			И Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПоГарантии.ОжидаетсяОтправка)
		|			И ВТ.Распоряжение = Статусы.ДокументДвижения
		|				
		|ГДЕ
		|	ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка <> ЗНАЧЕНИЕ(Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка)
		|	И ВТ.Распоряжение ССЫЛКА Документ.ВозвратТоваровПоставщику
		|ИТОГИ
		|	МАКСИМУМ(Номенклатура),
		|	МАКСИМУМ(смартНомерЗаявкиНаГарантийныйРемонт)
		|ПО
		|	ЗаявкаНаГарантийныйРемонт";
		//-- #Б1154 смарт: Шляпников 29.10.2024
		
		Запрос.УстановитьПараметр("Товары", Источник.ТоварыПоРаспоряжениям.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаЗаявкиНаГарантийныйРемонт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтатусОтправленоПоставщику = Перечисления.смартСтатусыПоГарантии.ОтправленоПоставщику;
		
		Пока ВыборкаЗаявкиНаГарантийныйРемонт.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт) Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По указанной заявке №" 
				+ ВыборкаЗаявкиНаГарантийныйРемонт.смартНомерЗаявкиНаГарантийныйРемонт + " не найдена расходуемая позиция " 
				+ ВыборкаЗаявкиНаГарантийныйРемонт.Номенклатура);
				Прервать;
			КонецЕсли;
			
			ДокОбъект = ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
			
			Выборка = ВыборкаЗаявкиНаГарантийныйРемонт.Выбрать();
			
			БылиИзменения = Ложь;
			
			Пока Выборка.Следующий() Цикл
				
				// ++ 21.11.2020
				//ТекСтрока = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям[Выборка.НомерСтроки - 1];
				
				//НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, ТекСтрока.НомерПозиции, СтатусОтправленоПоставщику); 
				
				Если Выборка.НомерПозиции = "" Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор = Новый Структура;
				Отбор.Вставить("НомерПозиции", Выборка.НомерПозиции);
				НайденныеСтроки = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.Статус = СтатусОтправленоПоставщику;
				КонецЕсли;				
				
				НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, Выборка.НомерПозиции, СтатусОтправленоПоставщику); 
				// --
												
				НоваяСтрокаСтатус.НомерПозиции 			= Выборка.НомерПозиции;
				НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= Источник.Дата;
				НоваяСтрокаСтатус.Статус 				= СтатусОтправленоПоставщику;
				НоваяСтрокаСтатус.ДокументДвижения 		= Источник.Ссылка;
				
				//ТекСтрока.Статус = СтатусОтправленоПоставщику; // ++ 21.11.2020
				
				// 25.04.2020
				//ТекСтрока.ДатаОтправления = Источник.Дата;
				
				БылиИзменения = Истина;
			КонецЦикла;
			
			Если НЕ БылиИзменения Тогда
				Продолжить;
			КонецЕсли;
			
			СинонимДокумента = ДокОбъект.Метаданные().Синоним;
			
			Попытка 
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменен документ """ + ДокОбъект.Ссылка + """", ДокОбъект.Ссылка);
			Исключение
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
				|" + ОписаниеОшибки() + "
				|Документ записан без проведения.", ДокОбъект.Ссылка);
			КонецПопытки;
		КонецЦикла;

		//++ смарт:ММ #044 224 29.12.2020 - Заявка на гарантийный ремонт 
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыПроцедуры = Новый Структура();
		ПараметрыПроцедуры.Вставить("Источник", Источник.Ссылка);
						
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.смартОбработкаПроведенияРасходныйОрдер", ПараметрыПроцедуры, ПараметрыВыполнения);
		//-- смарт:ММ 29.12.2020
		
	//-- смарт:ММ 15.04.2020	
	КонецЕсли;
	
	
КонецПроцедуры //-- смарт:ММ 02.01.2020

//++ смарт:ММ #044 224 29.12.2020 - Заявка на гарантийный ремонт 
Процедура смартОбработкаПроведенияРасходныйОрдер(Параметры, Адрес) Экспорт
	
	ОбщегоНазначенияБТС.Пауза(5);
	
	Источник = Параметры.Источник;
	
	// Изменение статуса на Списано, если проводится расходный ордер по заказу на внутреннее потребление
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
	//"ВЫБРАТЬ
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	&Товары КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВТ.Номенклатура КАК Номенклатура,
	//|	ВТ.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт,
	//|	ЕСТЬNULL(Статусы.Ссылка, ЗНАЧЕНИЕ(Документ.смартЗАявкаНаГарантийныйРемонт.ПустаяСсылка)) КАК ЗаявкаНаГарантийныйРемонт,
	//|	ЕСТЬNULL(Статусы.НомерПозиции, """") КАК НомерПозиции
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.Статусы КАК Статусы
	//|		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонт = Статусы.Ссылка.Номер
	//|			И Статусы.Статус В (&СтатусыСписания)
	//|			И ВТ.Распоряжение = Статусы.ДокументДвижения
	//|				
	//|ГДЕ
	//|	ВТ.смартНомерЗаявкиНаГарантийныйРемонт <> """"
	//|	И ВТ.Распоряжение ССЫЛКА Документ.ЗаказНаВнутреннееПотребление
	//|ИТОГИ
	//|	МАКСИМУМ(Номенклатура),
	//|	МАКСИМУМ(смартНомерЗаявкиНаГарантийныйРемонт)
	//|ПО
	//|	ЗаявкаНаГарантийныйРемонт";
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.смартНомерЗаявкиНаГарантийныйРемонтСсылка КАК смартНомерЗаявкиНаГарантийныйРемонтСсылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Товары КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	Статусы.Ссылка.Номер КАК смартНомерЗаявкиНаГарантийныйРемонт,
	|	Статусы.Ссылка КАК ЗаявкаНаГарантийныйРемонт,
	|	Статусы.НомерПозиции КАК НомерПозиции
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.Статусы КАК Статусы
	|		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Статусы.Ссылка
	|			И Статусы.Статус В (&СтатусыСписания)
	|			И ВТ.Распоряжение = Статусы.ДокументДвижения
	|				
	|ГДЕ
	|	ВТ.Распоряжение ССЫЛКА Документ.ЗаказНаВнутреннееПотребление
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(смартНомерЗаявкиНаГарантийныйРемонт)
	|ПО
	|	ЗаявкаНаГарантийныйРемонт";
	//-- #Б1132 смарт: Шляпников 11.11.2024
	
	СтатусыСписания = Новый Массив;
	СтатусыСписания.Добавить(Перечисления.смартСтатусыПоГарантии.ОтгрузкаНеТребуется);
	СтатусыСписания.Добавить(Перечисления.смартСтатусыПоГарантииПолучение.Компенсация);
	СтатусыСписания.Добавить(Перечисления.смартСтатусыПоГарантии.ВГарантииОтказано);
	
	Запрос.УстановитьПараметр("СтатусыСписания", СтатусыСписания);
	Запрос.УстановитьПараметр("Товары", Источник.ТоварыПоРаспоряжениям.Выгрузить());
	
	УстановитьПривилегированныйРежим(Истина); //смарт:rnp  09.02.2021 - добавлен привилегированный режим, иначе возникает ошибка доступа у пользователей по заявкам на гарантийный ремонт (не работает РАЗРЕШЕННЫЕ в фоне???) 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаявкиНаГарантийныйРемонт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтатусСписано = Перечисления.смартСтатусыПоГарантии.Списано;
	
	Пока ВыборкаЗаявкиНаГарантийныйРемонт.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По указанной заявке №" 
			+ ВыборкаЗаявкиНаГарантийныйРемонт.смартНомерЗаявкиНаГарантийныйРемонт + " не найдена расходуемая позиция " 
			+ ВыборкаЗаявкиНаГарантийныйРемонт.Номенклатура);
			Прервать;
		КонецЕсли;
		
		ДокОбъект = ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
		
		Выборка = ВыборкаЗаявкиНаГарантийныйРемонт.Выбрать();
		
		БылиИзменения = Ложь;
		
		Пока Выборка.Следующий() Цикл
						
			Если Выборка.НомерПозиции = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("НомерПозиции", Выборка.НомерПозиции);
			НайденныеСтроки = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.Статус = СтатусСписано;
			КонецЕсли;				
			
			НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, Выборка.НомерПозиции, СтатусСписано); 
			
			НоваяСтрокаСтатус.НомерПозиции 			= Выборка.НомерПозиции;
			НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= Источник.Дата;
			НоваяСтрокаСтатус.Статус 				= СтатусСписано;
			НоваяСтрокаСтатус.ДокументДвижения 		= Источник.Ссылка;
						
			БылиИзменения = Истина;
		КонецЦикла;
		
		Если НЕ БылиИзменения Тогда
			Продолжить;
		КонецЕсли;
		
		СинонимДокумента = ДокОбъект.Метаданные().Синоним;
		
		Попытка 
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменен документ """ + ДокОбъект.Ссылка + """", ДокОбъект.Ссылка);
		Исключение
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
			|" + ОписаниеОшибки() + "
			|Документ записан без проведения.", ДокОбъект.Ссылка);
		КонецПопытки;
	КонецЦикла;
		
КонецПроцедуры //-- смарт:ММ 29.12.2020

//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт 
Процедура смартОбработкаПроведенияПриходныйОрдер(Параметры, Адрес) Экспорт
	
	// ++ 08.12.2020
	ОбщегоНазначенияБТС.Пауза(5);
	// --
	
	Источник = Параметры.Источник;
	смартОтправлятьУведомления = Параметры.смартОтправлятьУведомления;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
 //   "ВЫБРАТЬ
 //   |	ПриходныйОрдерНаТоварыТовары.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт,
 //   //++ смарт:ММ 09.08.2020
 //   |	ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
 //   //-- смарт:ММ 09.08.2020
 //   |	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура
 //   //++ смарт:Подкин #939 23.03.2022 17:41:47
 //   | , &Распоряжение как Распоряжение
 //   //-- смарт:Подкин #939 23.03.2022 17:41:47
 //   |ПОМЕСТИТЬ ВТ
 //   |ИЗ
 //   |	&Товары КАК ПриходныйОрдерНаТоварыТовары
 //   |;
 //   |
 //   |////////////////////////////////////////////////////////////////////////////////
 //   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
 //   |	ВТ.Номенклатура КАК Номенклатура,
 //   //++ смарт:ММ 09.08.2020
 //   |	ВТ.Количество КАК Количество,
 //   //-- смарт:ММ 09.08.2020
 //   |	ВТ.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт,
 //   |	ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка, ЗНАЧЕНИЕ(Документ.смартЗАявкаНаГарантийныйРемонт.ПустаяСсылка)) КАК ЗаявкаНаГарантийныйРемонт,
 //   |	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерСтроки КАК НомерСтроки
 //   //++ смарт:Подкин #939 23.03.2022 17:41:47
 //   | , ВТ.Распоряжение как Распоряжение
 //   //-- смарт:Подкин #939 23.03.2022 17:41:47
 //
 //   |ИЗ
 //   |	ВТ КАК ВТ
 //   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
 //   |		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонт = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка.Номер
 //   |			И (ВТ.Номенклатура = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура
 //   |				ИЛИ ВТ.Номенклатура = смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.АналогОтПоставщика)
 //   |ГДЕ
 //   |	ВТ.смартНомерЗаявкиНаГарантийныйРемонт <> """"
 //   //++ смарт:ММ 09.08.2020
 //   |УПОРЯДОЧИТЬ ПО
 //   |	ЗаявкаНаГарантийныйРемонт,
 //   |	Номенклатура,
 //   |	НомерСтроки
 //   //-- смарт:ММ 09.08.2020
 //   |ИТОГИ
 //   //++ смарт:ММ 09.08.2020
 //   //|	МАКСИМУМ(Номенклатура),
 //   |	МАКСИМУМ(Количество),
 //   //-- смарт:ММ 09.08.2020
 //   |
 //   |	МАКСИМУМ(смартНомерЗаявкиНаГарантийныйРемонт)
 //   |ПО
 //   |	ЗаявкаНаГарантийныйРемонт,
 //   //++ смарт:ММ 09.08.2020
 //   |	Номенклатура";
 //   //-- смарт:ММ 09.08.2020";
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка КАК смартНомерЗаявкиНаГарантийныйРемонтСсылка,
	|	ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|	&Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Товары КАК ПриходныйОрдерНаТоварыТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Количество КАК Количество,
	|	Претензии.Ссылка.Номер КАК смартНомерЗаявкиНаГарантийныйРемонт,
	|	ЕСТЬNULL(Претензии.Ссылка, ЗНАЧЕНИЕ(Документ.смартЗАявкаНаГарантийныйРемонт.ПустаяСсылка)) КАК ЗаявкаНаГарантийныйРемонт,
	|	Претензии.НомерСтроки КАК НомерСтроки,
	|	ВТ.Распоряжение КАК Распоряжение
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК Претензии
	|		ПО ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Претензии.Ссылка
	|			И (ВТ.Номенклатура = Претензии.Номенклатура
	|				ИЛИ ВТ.Номенклатура = Претензии.АналогОтПоставщика)
	|ГДЕ
	|	ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка <> ЗНАЧЕНИЕ(Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаГарантийныйРемонт,
	|	Номенклатура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(смартНомерЗаявкиНаГарантийныйРемонт)
	|ПО
	|	ЗаявкаНаГарантийныйРемонт,
	|	Номенклатура";
    //-- смарт:ММ 09.08.2020";

	//-- #Б1132 смарт: Шляпников 11.11.2024
	
	Запрос.УстановитьПараметр("Товары", Источник.Товары.Выгрузить());
    
    //++ смарт:Подкин #939 23.03.2022 17:39:54
    Запрос.УстановитьПараметр("Распоряжение", Источник.Распоряжение);
    //-- смарт:Подкин #939 23.03.2022 17:39:54
	
	УстановитьПривилегированныйРежим(Истина); //смарт:rnp  09.02.2021 - добавлен привилегированный режим, иначе возникает ошибка доступа у пользователей по заявкам на гарантийный ремонт (не работает РАЗРЕШЕННЫЕ в фоне???)
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаявкиНаГарантийныйРемонт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//++ смарт:ММ 16.10.2020
	СтатусПолученоОтПоставщика = Перечисления.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика;
	СтатусОжидаютсяДействия = Перечисления.смартСтатусыПоГарантии.ОжидаютсяДействия;
	
	ОтправитьУведомлениеСклад = Ложь;
	// ++ 20.12.2020
	//СоответствиеНоменклатурыДляОповещения = Новый Массив;
	// --
	ПеремещениеНаСкладДляЗапчастейПодЗаказ = Ложь;
	//-- смарт:ММ 16.10.2020
	// ++ 18.11.2020
	ИмпортПроверкиЦепочекДокументовПройденыУспешно = Истина;  // Ложь только для импорта в случае неудачи
	ИмпортПеремещениеТоваровСозданоУспешно = Истина; // Ложь только для импорта в случае неудачи
	ИмпортСоздаватьПеремещениеТоваров = Ложь;
	ИмпортОтправитьУведомлениеНаХелпКонтрольЗаказаПоставщику = Ложь;
	ИмпортСтруктураНаличиеДокументов = Новый Структура;
	ИмпортЗаказыНаПеремещение = Новый Массив;
	ЭтоИмпорт = Ложь;
	// --
	
	// ++ 20.12.2020
	ИмпортТаблицаОбработанныхЗаказовНаПеремещение = Новый ТаблицаЗначений;
	ИмпортТаблицаОбработанныхЗаказовНаПеремещение.Колонки.Добавить("ЗаказНаПеремещение", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	ИмпортТаблицаОбработанныхЗаказовНаПеремещение.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ИмпортТаблицаОбработанныхЗаказовНаПеремещение.Колонки.Добавить("НомераЗаявокНаГР", Новый ОписаниеТипов("Строка"));
	ИмпортТаблицаОбработанныхЗаказовНаПеремещение.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
	ОтправитьУведомлениеОНесоответствииПоступившегоКоличества = Ложь;
	ТекстНесоответствиеКоличества = "";
	
	ТаблицаНоменклатурыДляОповещения = Новый ТаблицаЗначений;
	ТаблицаНоменклатурыДляОповещения.Колонки.Добавить("ЗаказНаПеремещение");
	ТаблицаНоменклатурыДляОповещения.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатурыДляОповещения.Колонки.Добавить("НомерЗаявкиНаГарантийныйРемонт");
	// --
	
	// ++ 16.02.2021
	ОсновнойСкладДляЗапчастейПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	// --
	
	// ++ 25.06.2020 
	//СтатусПолученоОтПоставщика = Перечисления.смартСтатусыПоГарантии.ПолученоОтПоставщика;
	Если Источник.Склад = Справочники.смартПредопределенныеЗначения.СкладГарантийныхЗапчастейПоУмолчанию.Значение 
		ИЛИ Источник.Склад = Справочники.Склады.НайтиПоНаименованию("ГАРАНТИЯ Смарт-Т АЗИЯ") //++rnp 17.11.2021 надо переделать на смартпредопределенное значение
		Тогда
		// Инженер сдает на склад ГАРАНТИЯ			
		УстанавливаемыйСтатус = СтатусОжидаютсяДействия; 
		//++ смарт:ММ 19.10.2020
	//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег  
	//ИначеЕсли Источник.Склад = ОсновнойСкладДляЗапчастейПодЗаказ Тогда
	ИначеЕсли Источник.Склад.смартОтправлятьОповещенияОПриходеТовара Тогда
		ОсновнойСкладДляЗапчастейПодЗаказ=Источник.Склад;
		// По Заказу на перемещение. В обработке только формируются оповещения, Заявки на гар. ремонт не меняются
	//-- #1369 смарт: Фролов 06.06.2023
		ПеремещениеНаСкладДляЗапчастейПодЗаказ = Истина;
		//-- смарт:ММ 19.10.2020
	Иначе
		// По заказу поставщику (приход на склад Основной)
		//++ смарт:ММ #044 224 20.07.2020
		//УстанавливаемыйСтатус = Перечисления.смартСтатусыПоГарантии.ПолученоОтПоставщика;
		УстанавливаемыйСтатус = СтатусПолученоОтПоставщика;
		//-- смарт:ММ 20.07.2020
		
		// ++ 18.11.2020 - доп. проверки перед отправкой уведомления о необходимости перемещения на склад Гарантия не для продажи
		ЗаказПоставщику = Источник.Распоряжение;
		
		Если ЗначениеЗаполнено(ЗаказПоставщику) И ТипЗнч(ЗаказПоставщику) = Тип("ДокументСсылка.ЗаказПоставщику") 
			И ЗаказПоставщику.смартЗапчастиГарантийные Тогда //rnp 1.11.2021 обрабатываем только импорт гарантийных запчастей
			
			// Если импорт, то проверить наличие документов Таможенная декларация и Приобретение товаров
			// Если импорт (товары в пути), то проверить еще и наличие Поступления товаров на склад
			// Если есть не все документы, то сообщение на хелп о необходимости проконтролировать Заказ поставщику
			// 	+ запись в регистр сведений смартЦепочкиДокументовПоставки
			// Если есть все документы, то попытаться изменить действие в Заказе на перенещение на "отгрузить" + создать Перемещение товаров
			// Если все получилось, то отправить уведомление на склад о необходимости перемещения на склад Гарантийный запчасти - не для продажи
			// Если что-то пошло не так, то сообщение с ошибкой на хелп
			
			ИмпортПроверкиЦепочекДокументовПройденыУспешно = Ложь;
			ПроверкаСозданияДокументаПеремещениеТоваровУспешна = Ложь;
			
			Импорт = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту;
			ИмпортТоварыВПути = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути;
			
			ХозяйственнаяОперация = ЗаказПоставщику.ХозяйственнаяОперация;
			
			Если ХозяйственнаяОперация = Импорт
				ИЛИ ХозяйственнаяОперация = ИмпортТоварыВПути Тогда
				
				ПриобретениеТоваров = Неопределено;
				// ++ 05.12.2020
				ТаможеннаяДекларация = Неопределено;
				ПоступлениеТоваровНаСклад = Неопределено;
				
				ЭтоИмпорт = Истина;
				ИмпортПеремещениеТоваровСозданоУспешно = Ложь;
				// --
				ЕстьПриобретениеТоваров = ЕстьПриобретениеТоваровПоЗаказуПоставщику(ЗаказПоставщику, ПриобретениеТоваров);
				
				Если ЕстьПриобретениеТоваров И ЗначениеЗаполнено(ПриобретениеТоваров) Тогда
					ЕстьТаможеннаяДекларация = ЕстьТаможеннаяДекларацияПоПриобретениюТоваров(ПриобретениеТоваров, ТаможеннаяДекларация);
				КонецЕсли;
				
				Если ХозяйственнаяОперация = ИмпортТоварыВПути Тогда
					Если ЕстьПриобретениеТоваров И ЕстьТаможеннаяДекларация Тогда
						ЕстьПоступлениеТоваров = ЕстьПоступлениеТоваровНаСкладПоЗаказуПоставщику(ЗаказПоставщику, ПоступлениеТоваровНаСклад);
						Если ЕстьПриобретениеТоваров И ЕстьТаможеннаяДекларация И ЕстьПоступлениеТоваров Тогда
							ИмпортПроверкиЦепочекДокументовПройденыУспешно = Истина;
							ИмпортСоздаватьПеремещениеТоваров = Истина;
						КонецЕсли;
						ИмпортСтруктураНаличиеДокументов.Вставить("ЕстьПоступлениеТоваров", ЕстьПоступлениеТоваров);
					КонецЕсли;
				Иначе
					Если ЕстьПриобретениеТоваров И ЕстьТаможеннаяДекларация Тогда
						ИмпортПроверкиЦепочекДокументовПройденыУспешно = Истина;
						ИмпортСоздаватьПеремещениеТоваров = Истина;
					КонецЕсли;					
				КонецЕсли;	
				
				//
				Если НЕ ИмпортПроверкиЦепочекДокументовПройденыУспешно Тогда
					// Отправить сообщение о необходимости проконтролировать Заказ поставщику
					ИмпортОтправитьУведомлениеНаХелпКонтрольЗаказаПоставщику = Истина;
					ИмпортСтруктураНаличиеДокументов.Вставить("ЕстьПриобретениеТоваров", ЕстьПриобретениеТоваров);
					ИмпортСтруктураНаличиеДокументов.Вставить("ЕстьТаможеннаяДекларация", ЕстьТаможеннаяДекларация);
				КонецЕсли;
				
			КонецЕсли;			
		КонецЕсли;
		
		//
	КонецЕсли;
	// -- 25.06.2020
	
	//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт
	//++ смарт:ММ 23.10.2020
	//смартОтправлятьУведомления = Ложь;	 
	//ДопСвойства = Источник.ДополнительныеСвойства;	
	//Если (ДопСвойства.Свойство("ЭтоНовый") И ДопСвойства.ЭтоНовый = Истина)
	//	ИЛИ (ДопСвойства.Свойство("смартОтправлятьУведомления") И ДопСвойства.смартОтправлятьУведомления = Истина) Тогда
	//	смартОтправлятьУведомления = Истина;
	//КонецЕсли;		
	//-- смарт:ММ 23.10.2020
	//-- смарт:ММ 18.11.2020
	
	Пока ВыборкаЗаявкиНаГарантийныйРемонт.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт) Тогда
			//Отказ = Истина;
			//++ смарт:ММ #044 224 16.07.2021 - Заявка на гарантийный ремонт 
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По указанной заявке №" 
			//+ ВыборкаЗаявкиНаГарантийныйРемонт.смартНомерЗаявкиНаГарантийныйРемонт + " не найдена приходуемая позиция " 
			//+ ВыборкаЗаявкиНаГарантийныйРемонт.Номенклатура);
			//Прервать;
			
			ТекстСообщения = "По указанной заявке №" + ВыборкаЗаявкиНаГарантийныйРемонт.смартНомерЗаявкиНаГарантийныйРемонт 
			+ " не найдена приходуемая позиция " + ВыборкаЗаявкиНаГарантийныйРемонт.Номенклатура;
			ЗаписьЖурналаРегистрации("смартОбработкаПодписокНаСобытия.смартОбработкаПроведенияПриходныйОрдер", УровеньЖурналаРегистрации.Ошибка,, Источник.Ссылка, ТекстСообщения);
			
			Продолжить;
			
			//-- смарт:ММ 16.07.2021
			
		КонецЕсли;
		
		//++ смарт:ММ 09.08.2020
		
		//Выборка = ВыборкаЗаявкиНаГарантийныйРемонт.Выбрать();
		ВыборкаНоменклатура = ВыборкаЗаявкиНаГарантийныйРемонт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//++ смарт:ММ 19.10.2020
		Если ПеремещениеНаСкладДляЗапчастейПодЗаказ Тогда
			
			// ++ 16.02.2021
			МассивНомеровСтрокСпециалистПоПретензиям = Новый Массив;
			// --

			СписокНоменклатуры = "";
			// 17.11.2020 - чтобы не было повторов одинаковых номенклатур
			МассивНоменклатуры = Новый Массив;
			//--
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				// ++ 16.02.2021
				Выборка = ВыборкаНоменклатура.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если МассивНомеровСтрокСпециалистПоПретензиям.Найти(Выборка.НомерСтроки) = Неопределено Тогда
						МассивНомеровСтрокСпециалистПоПретензиям.Добавить(Выборка.НомерСтроки);
					КонецЕсли;
				КонецЦикла;
				// --

				// 17.11.2020
				Если МассивНоменклатуры.Найти(ВыборкаНоменклатура.Номенклатура) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				МассивНоменклатуры.Добавить(ВыборкаНоменклатура.Номенклатура);
				// --
				СписокНоменклатуры = СписокНоменклатуры + ?(ЗначениеЗаполнено(СписокНоменклатуры), ", ", "") + ВыборкаНоменклатура.Номенклатура;
			КонецЦикла;
			
			// ++ 23.10.2020 отправлять уведомления только при первом проведении документа
			Если смартОтправлятьУведомления Тогда
				//--
				//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег  
				//ОтправитьУведомлениеПриходНаСкладЗапчастейПодЗаказ(ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт, СписокНоменклатуры);
				Если Источник.Склад.смартОтправлятьОповещенияОПриходеТовара Тогда
					ОтправитьУведомлениеПриходНаСкладЗапчастейПодЗаказ(ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт, СписокНоменклатуры,Источник.Склад);
				Иначе	
					ОтправитьУведомлениеПриходНаСкладЗапчастейПодЗаказ(ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт, СписокНоменклатуры);
				КонецЕсли;
				//-- #1369 смарт: Фролов 06.06.2023
			КонецЕсли;
			
			// ++ 16.02.2021
			// Заполнение склада по умолчанию
			Если МассивНомеровСтрокСпециалистПоПретензиям.Количество() > 0 Тогда
				
				ДокОбъект = ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
				
				БылиИзменения = Ложь;
				
				Для Каждого НомерСтроки Из МассивНомеровСтрокСпециалистПоПретензиям Цикл
					
					ТекСтрока = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям[НомерСтроки - 1];   
                    
                    //++ смарт:Подкин #910 13.04.2022 15:30:40
                    Если ТекСтрока.СтатусПолучения=Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление Тогда
                        ТекСтрока.СтатусПолучения=СтатусПолученоОтПоставщика;   
                        
                        НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, ТекСтрока.НомерПозиции, СтатусПолученоОтПоставщика); 
                        НоваяСтрокаСтатус.НомерПозиции 			= ТекСтрока.НомерПозиции;
                        НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= Источник.Дата;
                        НоваяСтрокаСтатус.Статус 				= СтатусПолученоОтПоставщика;
                        НоваяСтрокаСтатус.ДокументДвижения 		= Источник.Ссылка;
                        
                        БылиИзменения = Истина; 
                        
                    КонецЕсли;
                    //-- смарт:Подкин #910 13.04.2022 15:30:40  
                    
					ИДСтрокиЗаполняетсяИнженером = ТекСтрока.ИДСтрокиЗаполняетсяИнженером;
					
					Отбор = Новый Структура;
					Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
					НайденныеСтроки = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Для Каждого СтрокаИнженер Из НайденныеСтроки Цикл
							Если ЗначениеЗаполнено(СтрокаИнженер.Склад) Тогда
								Продолжить;
							КонецЕсли;
							СтрокаИнженер.Склад = ОсновнойСкладДляЗапчастейПодЗаказ;
							БылиИзменения = Истина;						
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				Если БылиИзменения Тогда					
					ДокОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			// --
			
			Продолжить;
		КонецЕсли;
		//-- смарт:ММ 19.10.2020
		
		ДокОбъект = ВыборкаЗаявкиНаГарантийныйРемонт.ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
		
		// ++ 20.12.2020
		БылиИзменения = Ложь;
		// --
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ОсталосьОтметитьВЗаказе = ВыборкаНоменклатура.Количество;
			
			Выборка = ВыборкаНоменклатура.Выбрать();
			//-- смарт:ММ 09.08.2020
			
			// ++ 20.12.2020
			//БылиИзменения = Ложь;
			
			Пока Выборка.Следующий() Цикл
				
				// ++ 20.12.2020
				Если ОсталосьОтметитьВЗаказе <= 0 Тогда
					Продолжить;
				КонецЕсли;
				// --
				
				ТекСтрока = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям[Выборка.НомерСтроки - 1];
				
				//++ смарт:ММ 16.10.2020
				// Проверить, заполнена ли колонка на вкладке инженера "запчасть, установленная клиенту". 
				// Если она заполнена, то, значит, запчасть уже добыли и установили клиенту -> удаляем строку из заказа на перемещение 
				// или весь заказ если строка одна (к сожалению,  заказ на перемещение на склад запчастей под заказ у нас получился никак 
				// ни к чему не привязанный, найти его можно только по номеру заявки в комментарии или в товарной части)
				// 01.11.2020 - теперь в ТЧ Статусы документа Заявка на гар. ремонт добавлен реквизит ДокументДвиженияДоп, 
				//		в который записывается документ Заказ на перемещение на склад запчастей под заказ
				
                Если УстанавливаемыйСтатус = СтатусПолученоОтПоставщика Тогда 
                    
                    Отбор = Новый Структура;
                    Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекСтрока.ИДСтрокиЗаполняетсяИнженером);
                    
                    НайденныеСтрокиИнженер = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
                    Если НайденныеСтрокиИнженер.Количество() = 0 Тогда
                        // Сюда не должно попасть!
                        Продолжить;
                    КонецЕсли;
                    
                    // ++ 01.11.2020
                    ЗаказНаПеремещение = Неопределено;
                    ОтборСтатус = Новый Структура;
                    ОтборСтатус.Вставить("НомерПозиции", ТекСтрока.НомерПозиции);
                    ОтборСтатус.Вставить("Статус", Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление);
                    СтрокиСтатус = ДокОбъект.Статусы.НайтиСтроки(ОтборСтатус);
                    Если СтрокиСтатус.Количество() > 0 Тогда
                        ЗаказНаПеремещение = СтрокиСтатус[0].ДокументДвиженияДоп;
                    КонецЕсли;	
                    
                    УспехУдаленияСтроки = Ложь;
                    // --
                    
                    
                    СтрокаИнженер = НайденныеСтрокиИнженер[0];
                    // 17.11.2020
                    Номенклатура = ТекСтрока.Номенклатура;
                    Если ЗначениеЗаполнено(ТекСтрока.АналогОтПоставщика) Тогда
                        Номенклатура = ТекСтрока.АналогОтПоставщика;
                    КонецЕсли;
                    //
                    // ++ 20.12.2020
                    Если ТекСтрока.Количество > Выборка.Количество Тогда
                        // В приходном ордере товара меньше, чем в заявке
                        // Разбить строки специалиста и инженера на 2 (включая все зависимые таблицы со статусами и т.д.)
                        
                        ОтправитьУведомлениеОНесоответствииПоступившегоКоличества = Истина;
                        ТекстНесоответствиеКоличества = ТекстНесоответствиеКоличества + ?(ЗначениеЗаполнено(ТекстНесоответствиеКоличества), Символы.ПС, "") 
                        + "запчасть " + Номенклатура + " по заявке №" + ДокОбъект.Номер;
                        
                        НоваяСтрокаИнженер = ДокОбъект.ЗаполняетсяИнженером.Вставить(СтрокаИнженер.НомерСтроки);
                        ЗаполнитьЗначенияСвойств(НоваяСтрокаИнженер, СтрокаИнженер);
                        НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером = ДокОбъект.ПолучитьСледующийИДСтроки();
                        НоваяСтрокаИнженер.Количество = НоваяСтрокаИнженер.Количество - Выборка.Количество; 
                        СтрокаИнженер.Количество = Выборка.Количество;
                        
                        Отбор = Новый Структура;
                        Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", СтрокаИнженер.ИДСтрокиЗаполняетсяИнженером);
                        
                        СтрокиДопДействия = ДокОбъект.ДополнительныеДействияИнженер.НайтиСтроки(Отбор);
                        Для Каждого СтрокаДД Из СтрокиДопДействия Цикл
                            НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействияИнженер.Добавить();
                            ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДД);
                            НоваяСтрокаДопДействия.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;	
                        КонецЦикла;		
                        
                        НоваяСтрокаСпециалист = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.Вставить(ТекСтрока.НомерСтроки);
                        ЗаполнитьЗначенияСвойств(НоваяСтрокаСпециалист, ТекСтрока);
                        НоваяСтрокаСпециалист.НомерПозиции = ДокОбъект.ПолучитьСледующийНомерПозиции();
                        НоваяСтрокаСпециалист.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;
                        НоваяСтрокаСпециалист.Количество = НоваяСтрокаИнженер.Количество;
                        НоваяСтрокаСпециалист.ДатаДобавления = ТекущаяДата();
                        
                        ТекСтрока.Количество = СтрокаИнженер.Количество;
                        
                        Отбор = Новый Структура;
                        Отбор.Вставить("НомерПозиции", ТекСтрока.НомерПозиции);
                        
                        НайденныеСтрокиСтатус = ДокОбъект.Статусы.НайтиСтроки(Отбор);		
                        Для Каждого СтрокаСтатус Из НайденныеСтрокиСтатус Цикл
                            НоваяСтрокаСтатус = ДокОбъект.Статусы.Добавить();
                            ЗаполнитьЗначенияСвойств(НоваяСтрокаСтатус, СтрокаСтатус);
                            НоваяСтрокаСтатус.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
                        КонецЦикла;
                        
                        НайденныеСтрокиИсторияРешений = ДокОбъект.ИсторияРешенийПоставщика.НайтиСтроки(Отбор);
                        Для Каждого СтрокаИстория Из НайденныеСтрокиИсторияРешений Цикл
                            НоваяСтрокаИстория = ДокОбъект.ИсторияРешенийПоставщика.Добавить();
                            ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория, СтрокаИстория);
                            НоваяСтрокаИстория.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
                        КонецЦикла;
                        
                        НайденныеСтрокиДопДействия = ДокОбъект.ДополнительныеДействия.НайтиСтроки(Отбор);
                        Для Каждого СтрокаДопДействия Из НайденныеСтрокиДопДействия Цикл
                            НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействия.Добавить();
                            ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДопДействия);
                            НоваяСтрокаДопДействия.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
                        КонецЦикла;
                    КонецЕсли;
                    // --
                    
                    Если ЗначениеЗаполнено(СтрокаИнженер.НоменклатураУстановленнаяКлиенту) Тогда
                        // 17.11.2020
                        //смартУдалитьСтрокиИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, ТекСтрока.Номенклатура, ЗаказНаПеремещение,,, УспехУдаленияСтроки);
						//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
                        //смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, Номенклатура, ЗаказНаПеремещение,,, УспехУдаленияСтроки);
						смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Ссылка, Номенклатура, ЗаказНаПеремещение,,, УспехУдаленияСтроки);
						//-- #Б1132 смарт: Шляпников 11.11.2024
                    Иначе
                        // Оповещения
                        // 17.11.2020
                        //смартУдалитьСтрокиИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, ТекСтрока.Номенклатура, ЗаказНаПеремещение, Истина, СоответствиеНоменклатурыДляОповещения);
                        // 20.12.2020
                        //смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, Номенклатура, ЗаказНаПеремещение, Истина, СоответствиеНоменклатурыДляОповещения);
						//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
                        //смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, Номенклатура, ЗаказНаПеремещение, Истина, ТаблицаНоменклатурыДляОповещения);
						смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Ссылка, Номенклатура, ЗаказНаПеремещение, Истина, ТаблицаНоменклатурыДляОповещения);
						//-- #Б1132 смарт: Шляпников 11.11.2024
                        
                        // 18.11.2020
                        // 20.12.2020
                        //Если СоответствиеНоменклатурыДляОповещения.Количество() > 0 Тогда
                        Если ТаблицаНоменклатурыДляОповещения.Количество() > 0 Тогда
                            // --
                            
                            ОтправитьУведомлениеСклад = Истина;
                        КонецЕсли;
                        
                    КонецЕсли;
                    
                    // ++ 05.12.2020 - запись в регистр смартЦепочкиДокументовПоставки
                    // Возможно, все-таки нужна детализация по номенклатуре?
                    Если ЭтоИмпорт И НЕ ИмпортСоздаватьПеремещениеТоваров И ЗначениеЗаполнено(ЗаказНаПеремещение) И НЕ УспехУдаленияСтроки Тогда
                        УстановитьПривилегированныйРежим(Истина);
                        МенеджерЗаписи = РегистрыСведений.смартЦепочкиДокументовПоставки.СоздатьМенеджерЗаписи();						
                        МенеджерЗаписи.ЗаказПоставщику = ЗаказПоставщику;
                        МенеджерЗаписи.ХозОперация = ХозяйственнаяОперация;
                        МенеджерЗаписи.ПриобретениеТоваровУслуг = ПриобретениеТоваров;
                        МенеджерЗаписи.ТаможеннаяДекларацияИмпорт = ТаможеннаяДекларация;
                        МенеджерЗаписи.ПоступлениеТоваровНаСклад = ПоступлениеТоваровНаСклад;
                        МенеджерЗаписи.ЗаказНаПеремещение = ЗаказНаПеремещение;
                        //МенеджерЗаписи.ДатаПриходногоОрдера = Источник.Дата;
                        МенеджерЗаписи.Записать(Истина);
                        УстановитьПривилегированныйРежим(Ложь);
                    КонецЕсли;
                    // --
                    
                    
                    // ++ 18.11.2020
                    Если ЗначениеЗаполнено(ЗаказНаПеремещение) И ИмпортЗаказыНаПеремещение.Найти(ЗаказНаПеремещение) = Неопределено Тогда
                        ИмпортЗаказыНаПеремещение.Добавить(ЗаказНаПеремещение);
                    КонецЕсли;
                    //--
                    
                    // ++ 18.11.2020
                    Если ИмпортСоздаватьПеремещениеТоваров И ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
                        // Для импорта (у которого есть все документы в цепочке) необходимо в заказе на перемещение изменить действие на "отгрузить"
                        // А также создать документ Перемещение товаров
                        
                        // ++ 05.12.2020
                        // ++ 20.12.2020
                        //ИмпортПеремещениеТоваровСозданоУспешно = ОбработатьЗаказНаПеремещение(ЗаказНаПеремещение, ЗаказПоставщику, Номенклатура, ДокОбъект.Ссылка);
                        
                        // Только поменять статус у нужной номенклатуры на "Отгрузить". Перемещение товаров на основании заказа будет создано в конце один раз						
                        СоздаватьПеремещениеТоваров = Ложь;
                        // ++ 31.01.2021
                        ЕстьДействиеОтгрузитьДляТекущейНоменклатуры = Ложь;
                        // --
                        Успех = ОбработатьЗаказНаПеремещение(ЗаказНаПеремещение, ЗаказПоставщику, Номенклатура, ДокОбъект.Ссылка, , СоздаватьПеремещениеТоваров,, ЕстьДействиеОтгрузитьДляТекущейНоменклатуры);
                        
                        Если Успех
                            // ++ 31.01.2021
                            И ЕстьДействиеОтгрузитьДляТекущейНоменклатуры 
                            // --
                            Тогда							
                            ОтборИмпорт = Новый Структура;
                            ОтборИмпорт.Вставить("ЗаказНаПеремещение", ЗаказНаПеремещение);
                            ОтборИмпорт.Вставить("ЗаказПоставщику", ЗаказПоставщику);
                            СтрокиИмпорт = ИмпортТаблицаОбработанныхЗаказовНаПеремещение.НайтиСтроки(ОтборИмпорт);
                            Если СтрокиИмпорт.Количество() > 0 Тогда
                                НоваяСтрокаИмпорт = СтрокиИмпорт[0];
                            Иначе
                                НоваяСтрокаИмпорт = ИмпортТаблицаОбработанныхЗаказовНаПеремещение.Добавить();
                                НоваяСтрокаИмпорт.ЗаказНаПеремещение = ЗаказНаПеремещение;
                                НоваяСтрокаИмпорт.ЗаказПоставщику = ЗаказПоставщику;
                            КонецЕсли;
                            
                            НомераЗаявокНаГР = НоваяСтрокаИмпорт.НомераЗаявокНаГР;
                            Если СтрНайти(НомераЗаявокНаГР, ДокОбъект.Номер) = 0 Тогда
                                НомераЗаявокНаГР = "" + НомераЗаявокНаГР + ?(ЗначениеЗаполнено(НомераЗаявокНаГР), ", ", "") + ДокОбъект.Номер;
                                НоваяСтрокаИмпорт.НомераЗаявокНаГР = НомераЗаявокНаГР;
                            КонецЕсли;
                            
                        КонецЕсли;
                        // --
                    КонецЕсли;
                    //--
                    
                    // ++ 01.11.2020
                    // Из истории статусов в ТЧ Заявки на гар. ремонт удалить ссылку на Заказ на перемещение, если номенклатура была удалена из этого заказа
                    // (для того, чтобы, например, эти строки не выводились в отчеты по контролю как ошибочные)
                    Если УспехУдаленияСтроки = Истина И СтрокиСтатус.Количество() > 0 Тогда
                        СтрокиСтатус[0].ДокументДвиженияДоп = Неопределено; 
                        // ++ 20.12.2020
                        БылиИзменения = Истина;
                        // --
                    КонецЕсли;				
                    // --
                    //++ смарт:Подкин #939 23.03.2022 16:54:54
                ИначеЕсли УстанавливаемыйСтатус = СтатусОжидаютсяДействия 
                    И ТипЗнч(Параметры.Источник)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
                    И ТипЗнч(Параметры.Источник.Распоряжение)=Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда    
                    
                    ОтборЗИ = Новый Структура;
                    ОтборЗИ.Вставить("ЗаказНаПеремещениеЗапчастейСИнженера", Выборка.Распоряжение);
                    ОтборЗИ.Вставить("НоменклатураПринятаяОтКлиента", Выборка.Номенклатура); 
                    //++ #Б-2952 смарт: Лопато 01.07.2025 //Заявка на гарантийный ремонт. Доработка. Изменение статуса.  
					//ОтборЗИ.Вставить("Количество", Выборка.Количество);
					ОтборЗИ.Вставить("Количество", 					 ТекСтрока.Количество);
					ОтборЗИ.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекСтрока.ИДСтрокиЗаполняетсяИнженером);
                    //-- #Б-2952 смарт: Лопато 01.07.2025
					
                    НайденныеСтрокиИнженер = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(ОтборЗИ);
                    Если НайденныеСтрокиИнженер.Количество() = 0 Тогда
                        // Сюда не должно попасть!
                        Продолжить;
                    КонецЕсли;
                    
                    Если НайденныеСтрокиИнженер.Количество() = 1 Тогда
                        
                        ОтборСП = Новый Структура;
                        ОтборСП.Вставить("ИДСтрокиЗаполняетсяИнженером", НайденныеСтрокиИнженер[0].ИДСтрокиЗаполняетсяИнженером);
                        
                        НайденныеСпецПоПретензиям = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(ОтборСП);
                        ТекСтрока=НайденныеСпецПоПретензиям[0];
                    КонецЕсли;   
                    //-- смарт:Подкин #939 23.03.2022 16:54:54
                    
                КонецЕсли;
				//-- смарт:ММ 16.10.2020
				
				//++ смарт:ММ 09.08.2020
				Если ОсталосьОтметитьВЗаказе <= 0 
					ИЛИ (УстанавливаемыйСтатус = СтатусПолученоОтПоставщика
					И ТекСтрока.СтатусПолучения = УстанавливаемыйСтатус)
					ИЛИ (УстанавливаемыйСтатус = СтатусОжидаютсяДействия
					И ТекСтрока.Статус = УстанавливаемыйСтатус) Тогда
					Продолжить;
				КонецЕсли;
				//-- смарт:ММ 09.08.2020
				
				
				НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, ТекСтрока.НомерПозиции, УстанавливаемыйСтатус); 
				
				// Не понадобится, т.к. добавлено выше условие на склад Основной, а это было по ГАРАНТИЯ
				//Если ЗначениеЗаполнено(НоваяСтрокаСтатус.ДокументДвижения) Тогда
				//	// Сюда попадает, когда сдается инженером на склад запчасть, замена которой была ранее принята от поставщика ("Нечем заменить у клиента")
				//	Продолжить;
				//КонецЕсли;
				
				НоваяСтрокаСтатус.НомерПозиции 			= ТекСтрока.НомерПозиции;
				НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= Источник.Дата;
				НоваяСтрокаСтатус.Статус 				= УстанавливаемыйСтатус;
				НоваяСтрокаСтатус.ДокументДвижения 		= Источник.Ссылка;
				
				Если УстанавливаемыйСтатус =  Перечисления.смартСтатусыПоГарантии.ОжидаютсяДействия Тогда
					ТекСтрока.Статус = УстанавливаемыйСтатус;
				ИначеЕсли  УстанавливаемыйСтатус =  Перечисления.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика Тогда
					ТекСтрока.СтатусПолучения = УстанавливаемыйСтатус;
				КонецЕсли;
				
				//++ смарт:ММ 09.08.2020
				ОсталосьОтметитьВЗаказе = ОсталосьОтметитьВЗаказе - ТекСтрока.Количество;
				//-- смарт:ММ 09.08.2020
				
				БылиИзменения = Истина;
			КонецЦикла;
			
			//++ смарт:ММ 09.08.2020
		КонецЦикла; // По номенклатуре
		//-- смарт:ММ 09.08.2020
		
		Если НЕ БылиИзменения Тогда
			Продолжить;
		КонецЕсли;
		
		//++ смарт:ММ #025 137 24.03.2020 
		// пока автоматическое закрытие заявок отменяется
		//Если ДокОбъект.ЗаявкуМожноЗакрыть() Тогда
		//	ДокОбъект.Статус = Перечисления.СтатусыКассовойСмены.Закрыта;
		//КонецЕсли;
		//-- смарт:ММ 24.03.2020
		
		СинонимДокумента = ДокОбъект.Метаданные().Синоним;
		
		Попытка 
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменен документ """ + ДокОбъект.Ссылка + """", ДокОбъект.Ссылка);
			
			// ++ 20.12.2020 - перенесено ниже
			////++ смарт:ММ 19.10.2020
			//Если ОтправитьУведомлениеСклад
			//	// ++ 23.10.2020 отправлять уведомления только при первом проведении документа
			//	И смартОтправлятьУведомления
			//	
			//	// ++ 18.11.2020
			//	И ИмпортПеремещениеТоваровСозданоУспешно
			//	И ИмпортПроверкиЦепочекДокументовПройденыУспешно
			//	//--
			//	Тогда
			//	ОтправитьУведомлениеОНеобходимостиПеремещенияЗапчастей(СоответствиеНоменклатурыДляОповещения, ДокОбъект.Номер);
			//КонецЕсли;
			////-- смарт:ММ 19.10.2020
			// --
			
			// ++ 27.11.2020
			Если УстанавливаемыйСтатус = СтатусПолученоОтПоставщика Тогда
				ИзменитьДатуПоступленияВГрузе(ЗаказПоставщику, Источник.Дата);
			КонецЕсли;
			// --
			
			// ++ 20.12.2020
			Если ОтправитьУведомлениеОНесоответствииПоступившегоКоличества Тогда
				ОтправитьУведомлениеОНесоответствииПоступившегоКоличества(ТекстНесоответствиеКоличества);							
			КонецЕсли;
			// --
			
		Исключение
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ТекстСообщения = "Не удалось провести документ """ + СинонимДокумента + """ по причине
			|" + ОписаниеОшибки() + "
			|Документ записан без проведения.";
			
			ЗаписьЖурналаРегистрации("смартОбработкаПодписокНаСобытия.смартОбработкаПроведенияПриходныйОрдер", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
			//|" + ОписаниеОшибки() + "
			//|Документ записан без проведения.", ДокОбъект.Ссылка);
		КонецПопытки;
		
	КонецЦикла;
	
	// ++ 20.12.2020
	// У нужных строк заказов уже установлено действие Отгрузить. Небходимо создать перемещене товаров
	МассивРезультатов = Новый Массив;
	
	Для Каждого ТекСтрокаИмпорт Из ИмпортТаблицаОбработанныхЗаказовНаПеремещение Цикл 
		Успех = ОбработатьЗаказНаПеремещение(ТекСтрокаИмпорт.ЗаказНаПеремещение, ТекСтрокаИмпорт.ЗаказПоставщику, ,, ТекСтрокаИмпорт.НомераЗаявокНаГР, Истина, Ложь);
		МассивРезультатов.Добавить(Успех);
	КонецЦикла;

	ИмпортПеремещениеТоваровСозданоУспешно = Истина;
	
	Для Каждого Рез Из МассивРезультатов Цикл
		Если Рез = Ложь Тогда
			ИмпортПеремещениеТоваровСозданоУспешно = Ложь;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
		
	//++ смарт:ММ 19.10.2020
	Если ОтправитьУведомлениеСклад
		И смартОтправлятьУведомления		
		И ИмпортПеремещениеТоваровСозданоУспешно
		И ИмпортПроверкиЦепочекДокументовПройденыУспешно
		Тогда
		ОтправитьУведомлениеОНеобходимостиПеремещенияЗапчастей(ТаблицаНоменклатурыДляОповещения);
	КонецЕсли;
	//-- смарт:ММ 19.10.2020

    // ++ 18.11.2020
    Если ИмпортОтправитьУведомлениеНаХелпКонтрольЗаказаПоставщику Тогда
        ОтправитьУведомлениеОНеобходимостиКонтроляЗаказаПоставщику(ЗаказПоставщику, ИмпортЗаказыНаПеремещение, ИмпортСтруктураНаличиеДокументов);
    КонецЕсли;
    
    //++ смарт:Подкин #1128 п1 02.08.2022 13:08:12 
    ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
    ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ЗаказыВСтатусРезервНаСкладе",Новый Структура("Источник",Источник),ПараметрыВыполнения);
    //-- смарт:Подкин #1128 п1 02.08.2022 13:08:12
    
КонецПроцедуры //-- смарт:ММ 18.11.2020

//++ смарт:Подкин #1128 п1 13.09.2022 16:01:47
Процедура ЗаказыВСтатусРезервНаСкладе(Параметры, Адрес) Экспорт 
    
    ВнОбработка=смартОбщегоНазначения.ПолучитьВнешнююОбработку("ПриходныйОрдерНаТоварыРезервироватьЗаказыНаСкладе"); 
    ВнешнОбработка = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ВнОбработка);
    
    Если НЕ ВнешнОбработка=Неопределено Тогда
        Если ЗначениеЗаполнено(ВнОбработка.Комментарий) Тогда
            Чтение=Новый ЧтениеJSON;
            Чтение.УстановитьСтроку(ВнОбработка.Комментарий);
            ЗаполнитьЗначенияСвойств(ВнешнОбработка,ПрочитатьJSON(Чтение));
        КонецЕсли;
        ВнешнОбработка.ОбъектСсылка=Параметры.Источник;
        ВнешнОбработка.ИзменениеРезервированияЗаказов();  //ПараметрыВыполнения
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #1128 п1 13.09.2022 16:01:47

//++ смарт:ММ #044 224 05.12.2020 - Заявка на гарантийный ремонт
// Функция вызывается из двух мест: при проведении Приходного ордера с детализацией по номенклатуре 
// или при проверке полноты цепочки документов поставки при проведении таможенной декларации, поступления товаров на склад или приобретения товаров без детализации по номенклатуре
Функция ОбработатьЗаказНаПеремещение(ЗаказНаПеремещение, ЗаказПоставщику, Номенклатура = Неопределено, ЗаявкаНаГарантийныйРемонт = Неопределено, НомераЗаявокНаГР = "", СоздаватьПеремещение = Истина, УстанавливатьДействиеОтгрузить = Истина, ЕстьДействиеОтгрузитьДляТекущейНоменклатуры = Ложь)
	
	Если ЗаказНаПеремещение.ПометкаУдаления ИЛИ ЗаказНаПеремещение.Товары.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстПисьма = "";
	Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
	
	// 1. Попытка в Заказе на перемещение поменять действие на "отгрузить"
	ЗаказНаПеремещениеИзмененУспешно = Истина;
	ПеремещениеТоваровСозданоУспешно = Ложь;
	ИмпортПеремещениеТоваровСозданоУспешно = Ложь;
	
	// ++ 20.12.2020
	Если УстанавливатьДействиеОтгрузить Тогда
	// --
	Попытка
		ЕстьИзменения = Ложь;
		ЗаказНаПеремещениеОбъект = ЗаказНаПеремещение.ПолучитьОбъект();
		Для Каждого Строка Из ЗаказНаПеремещениеОбъект.Товары Цикл
			
			Если Номенклатура <> Неопределено Тогда
				Если Строка.Номенклатура <> Номенклатура 
					//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
					//ИЛИ СокрЛП(Строка.смартНомерЗаявкиНаГарантийныйРемонт) <> СокрЛП(ЗаявкаНаГарантийныйРемонт.Номер) 
					ИЛИ Строка.смартНомерЗаявкиНаГарантийныйРемонтСсылка <> ЗаявкаНаГарантийныйРемонт
					//-- #Б1132 смарт: Шляпников 01.11.2024
					// ++ 31.01.2021
					//ИЛИ Строка.ВариантОбеспечения = Отгрузить Тогда
					Тогда
					// --
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если Строка.ВариантОбеспечения = Отгрузить Тогда
				// ++ 31.01.2021
				ЕстьДействиеОтгрузитьДляТекущейНоменклатуры = Истина;
				// --
				Продолжить;
			КонецЕсли;
			
			Строка.ВариантОбеспечения = Отгрузить;
			ЕстьИзменения = Истина;
			// ++ 31.01.2021
			ЕстьДействиеОтгрузитьДляТекущейНоменклатуры = Истина;
			// --
		КонецЦикла;
		
		Если ЕстьИзменения Тогда
			ЗаказНаПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);//rnp:после изменения документа обязательно перепроводим его
		Иначе
			// или нет строк с нужной номенклатурой, или у них уже действие = отгрузить
			//ТекстПисьма = "В Заказе на перемещение №" + ЗаказНаПеремещение.Номер + " по Заявке на гарантийный ремонт №" + ДокОбъект.Номер + " не обнаружены строки с номенклатурой " + Номенклатура + " для изменения варианта обеспечения на ""Отгрузить""";
		КонецЕсли;
		
	Исключение
		ЗаказНаПеремещениеИзмененУспешно = Ложь;
		ТекстПисьма = "Не удалось установить действие ""Отгрузить"" в заказе на перемещение " + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	// ++ 20.12.2020
	КонецЕсли;
	// --
	
	// ++ 20.12.2020
	Если НЕ СоздаватьПеремещение Тогда
		Возврат Истина;
	КонецЕсли;
	// --
	
	// 2. Попытка создать Перемещение товаров
	Если ЗаказНаПеремещениеИзмененУспешно Тогда
		ТекстОшибки = "";
		// ++ 20.12.2020
		//Если НЕ ЗначениеЗаполнено(НомераЗаявокНаГР) Тогда
		Если НомераЗаявокНаГР = "" Тогда
		// --
			НомераЗаявокНаГР = ЗаявкаНаГарантийныйРемонт.Номер;
		КонецЕсли;
		
		Попытка
			ДокументПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ЗаказНаПеремещение, НомераЗаявокНаГР, ТекстОшибки);
			Если ЗначениеЗаполнено(ДокументПеремещениеТоваров) Тогда
				ПеремещениеТоваровСозданоУспешно = Истина;
			Иначе
				ТекстПисьма = ТекстОшибки;
			КонецЕсли;	
		Исключение
			ТекстОшибки = "Не удалось создать Перемещение товаров на основании Заказа на перемещение №" 
			+ ЗаказНаПеремещение.Номер + " (по Заявке на гарантийный ремонт №" + НомераЗаявокНаГР + ")";
			ЗаписьЖурналаРегистрации("смартОбработкаЗаказаНаПеремещение", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Если ЗаказНаПеремещениеИзмененУспешно И ПеремещениеТоваровСозданоУспешно Тогда							
		ИмпортПеремещениеТоваровСозданоУспешно = Истина;
	КонецЕсли;
	
	Если НЕ ИмпортПеремещениеТоваровСозданоУспешно Тогда
		ОтправитьУведомлениеОбОшибкахСозданияПеремещенияТоваров(ЗаказПоставщику, ЗаказНаПеремещение, ТекстПисьма);
	КонецЕсли;

	Возврат ИмпортПеремещениеТоваровСозданоУспешно;
	
КонецФункции //-- смарт:ММ 05.12.2020

//++ смарт:ММ #044 224 27.11.2020 - Заявка на гарантийный ремонт 
Процедура ИзменитьДатуПоступленияВГрузе(ЗаказПоставщику, ДатаПоступления)
	
	Если ТипЗнч(ЗаказПоставщику) = Тип("ДокументСсылка.ЗаказПоставщику")
		И ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Груз = ЗаказПоставщику.Груз;
		Если ЗначениеЗаполнено(Груз) И Груз.ДатаПоступления <> ДатаПоступления Тогда
		    ГрузОбъект = Груз.ПолучитьОбъект();
			ГрузОбъект.ДатаПоступления = ДатаПоступления;
			Попытка
				ГрузОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 27.11.2020

//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт 
Функция ЕстьПриобретениеТоваровПоЗаказуПоставщику(ЗаказПоставщику, ПриобретениеТоваров)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.ЗаказПоставщику = &ЗаказПоставщику";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Истина;
		ПриобретениеТоваров = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 18.11.2020

//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт 
Функция ЕстьТаможеннаяДекларацияПоПриобретениюТоваров(ПриобретениеТоваров, ТаможеннаяДекларация)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка.Проведен
	|	И ТаможеннаяДекларацияИмпортТовары.ДокументПоступления = &ДокументПоступления";
	
	Запрос.УстановитьПараметр("ДокументПоступления", ПриобретениеТоваров);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// ++ 05.12.2020
		ТаможеннаяДекларация = Выборка.Ссылка;
		// --
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 18.11.2020

//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт 
Функция ЕстьПоступлениеТоваровНаСкладПоЗаказуПоставщику(ЗаказПоставщику, ПоступлениеТоваров)

	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПоступлениеТоваровНаСклад.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровНаСклад КАК ПоступлениеТоваровНаСклад
	|ГДЕ
	|	ПоступлениеТоваровНаСклад.Проведен
	|	И ПоступлениеТоваровНаСклад.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", ЗаказПоставщику);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// ++ 05.12.2020
		ПоступлениеТоваров = Выборка.Ссылка;
		// --
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 18.11.2020

//++ смарт:ММ #044 224 19.11.2020 - Заявка на гарантийный ремонт 
Процедура ОтправитьУведомлениеОНеобходимостиКонтроляЗаказаПоставщику(ЗаказПоставщику, ИмпортЗаказыНаПеремещение, НаличиеДокументов)
	
	ТекстЗаказНаПеремещение = "";
	Для Каждого ЗаказНаПеремещение Из ИмпортЗаказыНаПеремещение Цикл
		ТекстЗаказНаПеремещение = ТекстЗаказНаПеремещение + ?(ЗначениеЗаполнено(ТекстЗаказНаПеремещение), ", ", "") + "Заказ на перемещение №" + ЗаказНаПеремещение.Номер;
	КонецЦикла;
	
	СписокОтсутствующихДокументов = "";
	Если НаличиеДокументов.Свойство("ЕстьПриобретениеТоваров") И НаличиеДокументов.ЕстьПриобретениеТоваров = Ложь Тогда
		СписокОтсутствующихДокументов = "приобретение товаров и услуг";
	КонецЕсли;
	
	Если НаличиеДокументов.Свойство("ЕстьТаможеннаяДекларация") И НаличиеДокументов.ЕстьТаможеннаяДекларация = Ложь Тогда
		СписокОтсутствующихДокументов = СписокОтсутствующихДокументов + ?(ЗначениеЗаполнено(СписокОтсутствующихДокументов), ", ", "") + "таможенная декларация на импорт";
	КонецЕсли;

	Если НаличиеДокументов.Свойство("ЕстьПоступлениеТоваров") И НаличиеДокументов.ЕстьПоступлениеТоваров = Ложь Тогда
		СписокОтсутствующихДокументов = СписокОтсутствующихДокументов + ?(ЗначениеЗаполнено(СписокОтсутствующихДокументов), ", ", "") + "поступление товаров на склад";
	КонецЕсли;
	
	ТекстПисьма = "Необходимо проконтролировать заказ поставщику №" + ЗаказПоставщику.Номер + ", т.к. отсутствуют документы по поставке (" + СписокОтсутствующихДокументов + ") и невозможно обработать " + ТекстЗаказНаПеремещение;
		
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейСообщенийОбОшибках(АдресаДляОтправкиСтрокой);
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);	
	//-- смарт:ММ 03.03.2021

	Если ЗначениеЗаполнено(УчетнаяЗапись) 
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
		И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		//-- смарт:ММ 03.03.2021
		
		ТемаПисьма = "Контроль Заказа поставщику №" + ЗаказПоставщику.Номер; //НомерЗаявки;
								 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		//Если ЭтоТестоваяБаза Тогда
		//	ТестовыеАдреса = ПараметрыПисьма.ТестовыеАдреса;
		//КонецЕсли;
		
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
				
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ЭтоТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о необходимости контроля Заказа поставщику (на ТЕСТОВУЮ почту " + ПараметрыПисьма.ТестовыеАдреса + ". В рабочей отправилось бы на " + АдресаДляОтправкиСтрокой + ")";
			Иначе	
				ТекстСообщения = "Отправлено уведомление о необходимости контроля Заказа поставщику (на почту " +  АдресаДляОтправкиСтрокой + ")";
			КонецЕсли;
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение
			Если ЭтоТестоваяБаза Тогда
				ТекстСообщения = "Не удалось отправить уведомление о необходимости контроля Заказа поставщику на ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + Символы.ПС + ОписаниеОшибки();
			Иначе
				ТекстСообщения = "Не удалось отправить уведомление о необходимости контроля Заказа поставщику" + Символы.ПС + ОписаниеОшибки();
			КонецЕсли;
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказПоставщику,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 19.11.2020

//++ смарт:ММ #044 224 19.11.2020 - Заявка на гарантийный ремонт 
Процедура ОтправитьУведомлениеОбОшибкахСозданияПеремещенияТоваров(ЗаказПоставщику, ЗаказНаПеремещение, ТекстПисьма)
	
	Если ТекстПисьма = "" Тогда
		Возврат;
	КонецЕсли;
	
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейСообщенийОбОшибках(АдресаДляОтправкиСтрокой);
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);	
	//-- смарт:ММ 03.03.2021

	Если ЗначениеЗаполнено(УчетнаяЗапись) 
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
		И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		//-- смарт:ММ 03.03.2021
		
		ТемаПисьма = "Ошибка обработки Заказа поставщику №" + ЗаказПоставщику.Номер; //НомерЗаявки;
		ТекстПисьма = ТекстПисьма;
								 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		ТестовыеАдреса = ТестовыеАдресаСтрока;
		//-- смарт:ММ 03.03.2021
		
		Если ЭтоТестоваяБаза Тогда
			ТестовыеАдреса = ПараметрыПисьма.ТестовыеАдреса;
		КонецЕсли;
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ЭтоТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление об ошибках обработки Заказа поставщику (на ТЕСТОВУЮ почту " + ТестовыеАдреса + ". В рабочей отправилось бы на " + АдресаДляОтправкиСтрокой + ")";
			Иначе	
				ТекстСообщения = "Отправлено уведомление об ошибках обработки Заказа поставщику (на почту " +  АдресаДляОтправкиСтрокой + ")";
			КонецЕсли;
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение
			Если ЭтоТестоваяБаза Тогда
				ТекстСообщения = "Не удалось отправить уведомление об ошибках обработки Заказа поставщику на ТЕСТОВУЮ ПОЧТУ " + ТестовыеАдреса + Символы.ПС + ОписаниеОшибки();
			Иначе
				ТекстСообщения = "Не удалось отправить уведомление об ошибках обработки Заказа поставщику" + Символы.ПС + ОписаниеОшибки();
			КонецЕсли; 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказПоставщику,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 19.11.2020

//++ смарт:ММ #044 224 18.11.2020 - Заявка на гарантийный ремонт 
Функция ПолучитьАдресаПолучателейСообщенийОбОшибках(АдресаДляОтправкиСтрокой = "")
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресаДляОтправкиОшибок;
	
	Возврат смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой, Ложь);
	
КонецФункции //-- смарт:ММ 18.11.2020

//++ смарт:ММ #044 224 19.11.2020 - Заявка на гарантийный ремонт 
Функция СоздатьДокументПеремещениеТоваров(ЗаказНаПеремещение, НомерЗаявкиНаГарантийныйРемонт, ТекстОшибки = "")
		
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказНаПеремещение);

	ДанныеЗаполнения = Новый Структура;
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивЗаказов, "ПеремещениеТоваров");
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	ДокументПеремещение.Заполнить(ДанныеЗаполнения);
	
	//++ #1346 смарт: Фролов 26.04.2023 //Исправить автоматичесое создание перемещений при оприходовании товара 
	//ДокументПеремещение.Дата = ЗаказНаПеремещение.Дата;
	ДокументПеремещение.Дата = ТекущаяДатаСеанса();
	//-- #1346 смарт: Фролов 26.04.2023
	ДокументПеремещение.Комментарий = Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(, НомерЗаявкиНаГарантийныйРемонт);
	
	// ++ 20.12.2020
	//Для Каждого Строка Из ДокументПеремещение.Товары Цикл
	//	Строка.смартНомерЗаявкиНаГарантийныйРемонт = НомерЗаявкиНаГарантийныйРемонт;
	//КонецЦикла;
	
	Для Каждого Строка Из ДокументПеремещение.Товары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("КодСтроки", Строка.КодСтроки);
		НайденныеСтрокиЗаказ = Строка.ЗаказНаПеремещение.Товары.НайтиСтроки(Отбор);
		Если НайденныеСтрокиЗаказ.Количество() > 0 Тогда
			//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
			//Строка.смартНомерЗаявкиНаГарантийныйРемонт = НайденныеСтрокиЗаказ[0].смартНомерЗаявкиНаГарантийныйРемонт;
			Строка.смартНомерЗаявкиНаГарантийныйРемонтСсылка = НайденныеСтрокиЗаказ[0].смартНомерЗаявкиНаГарантийныйРемонтСсылка;
			//-- #Б1132 смарт: Шляпников 14.10.2024
		КонецЕсли;
	КонецЦикла;
	// --
		
	Попытка
		ДокументПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		УстановитьПривилегированныйРежим(Ложь);
		Возврат ДокументПеремещение.Ссылка;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ТекстОшибки = "Не удалось создать Перемещение товаров на основании Заказа на перемещение №" 
		+ ЗаказНаПеремещение.Номер + " (по Заявке на гарантийный ремонт №" + НомерЗаявкиНаГарантийныйРемонт + ")";
		ЗаписьЖурналаРегистрации("смартОбработкаЗаказаНаПеремещение", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
		
КонецФункции //-- смарт:ММ 19.11.2020

//++ смарт:ММ 16.10.2020 #044 224 Продолжение #001
//Процедура смартУдалитьСтрокиИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(НомерЗаявки, Номенклатура, ЗаказНаПеремещение = Неопределено, ТолькоПолучитьНомераДокументов = Ложь, СоответствиеНоменклатуры = Неопределено, Успех = Ложь)
Процедура смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(НомерЗаявки, Номенклатура, ЗаказНаПеремещение = Неопределено, ТолькоПолучитьНомераДокументов = Ложь, СоответствиеНоменклатуры = Неопределено, Успех = Ложь)	
	// ++ 01.11.2020
	Успех = Ложь;
	// --
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка,
	|	ЗаказНаПеремещениеТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказНаПеремещениеТовары.Ссылка.Номер КАК Номер,
	|	ЗаказНаПеремещениеТовары.ВариантОбеспечения КАК ВариантОбеспечения
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	// ++ 01.11.2020
	|	ВЫБОР 
	|		КОГДА &ОтборПоСсылке 
	|			ТОГДА ЗаказНаПеремещениеТовары.Ссылка = &Ссылка 
	|	ИНАЧЕ
	//
	|		ЗаказНаПеремещениеТовары.Ссылка.Проведен
	// ++ 31.01.2020
	//|		И ЗаказНаПеремещениеТовары.смартНомерЗаявкиНаГарантийныйРемонт = &смартНомерЗаявкиНаГарантийныйРемонт
	// --
	|	КОНЕЦ
	// ++ 31.01.2020
	//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
	|	И ЗаказНаПеремещениеТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка = &смартНомерЗаявкиНаГарантийныйРемонт
	//-- #Б1132 смарт: Шляпников 01.11.2024
	// --
	|	И ЗаказНаПеремещениеТовары.Номенклатура = &Номенклатура
	|	И ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель = &СкладПолучатель
	// ++ 23.10.2020
	|	И ВЫБОР 
	|		КОГДА &ОтборПоВариантуОбеспечения 
	|			ТОГДА ЗаказНаПеремещениеТовары.ВариантОбеспечения <> &Отгрузить
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	// --
	|ИТОГИ
	|	МАКСИМУМ(Номер)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("СкладПолучатель", Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	// ++ 31.01.2021
	//Запрос.УстановитьПараметр("смартНомерЗаявкиНаГарантийныйРемонт", НомерЗаявки);
	//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
	//Запрос.УстановитьПараметр("смартНомерЗаявкиНаГарантийныйРемонт", СокрЛП(НомерЗаявки));
	Запрос.УстановитьПараметр("смартНомерЗаявкиНаГарантийныйРемонт", НомерЗаявки);
	//-- #Б1132 смарт: Шляпников 01.11.2024
	// --
	// ++ 23.10.2020
	Запрос.УстановитьПараметр("Отгрузить", Перечисления.ВариантыОбеспечения.Отгрузить);
	Запрос.УстановитьПараметр("ОтборПоВариантуОбеспечения", НЕ ТолькоПолучитьНомераДокументов);
	// ++ 01.11.2020
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаПеремещение);
	Запрос.УстановитьПараметр("ОтборПоСсылке", ?(ЗначениеЗаполнено(ЗаказНаПеремещение), Истина, Ложь));
	
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		Если НЕ ТолькоПолучитьНомераДокументов Тогда
			ДокОбъект = ВыборкаЗаказ.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		// ++ 18.11.2020
		// Если в табличной части Заявки на гарантийный ремонт не был указан заказ на перемещение, но он нашелся в базе, то уведомления отправлять в дальнейшем по нему
		Если ЗаказНаПеремещение = Неопределено Тогда
			ЗаказНаПеремещение = ВыборкаЗаказ.Ссылка;
		КонецЕсли;
		//--
		
		Выборка = ВыборкаЗаказ.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ТолькоПолучитьНомераДокументов Тогда
				// ++ 20.12.2020
				//Соотв = Новый Соответствие();
				//Соотв.Вставить(ВыборкаЗаказ.Номер, Номенклатура);
				//СоответствиеНоменклатуры.Добавить(Соотв);
				НоваяСтрока = СоответствиеНоменклатуры.Добавить();
				НоваяСтрока.ЗаказНаПеремещение = ЗаказНаПеремещение;
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.НомерЗаявкиНаГарантийныйРемонт = НомерЗаявки;
				// --
			Иначе
				Отбор = Новый Структура;
				//Отбор.Вставить("НомерСтроки", Выборка.НомерСтроки);
				// ++ 31.01.2021
				Отбор.Вставить("НомерСтроки", Выборка.НомерСтроки);
				// --
				Отбор.Вставить("Номенклатура", Номенклатура);
				
				СтрокиДляУдаления = ДокОбъект.Товары.НайтиСтроки(Отбор);
				Если СтрокиДляУдаления.Количество() > 0 Тогда
					ДокОбъект.Товары.Удалить(СтрокиДляУдаления[0]);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ТолькоПолучитьНомераДокументов Тогда
			Если ДокОбъект.Товары.Количество() = 0 Тогда
				// Удалить заказ на перемещение
				//ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокОбъект = ВыборкаЗаказ.Ссылка.ПолучитьОбъект(); // Чтобы осталась удаляемая строка в документе
				ДокОбъект.УстановитьПометкуУдаления(Истина);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Помечен на удаление документ " + ДокОбъект.Ссылка, ДокОбъект.Ссылка);
				Успех = Истина;
			Иначе
				Попытка
					// ++ 31.01.2021
					//ДокОбъект.Записать();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					// --
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменен документ " + ДокОбъект.Ссылка, ДокОбъект.Ссылка);
					Успех = Истина;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось изменить документ " + ДокОбъект.Ссылка + Символы.ПС + ОписаниеОшибки(), ДокОбъект.Ссылка);
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 16.10.2020

//++ смарт:ММ 19.10.2020 #044 224 Продолжение #001
Процедура ОтправитьУведомлениеОНеобходимостиПеремещенияЗапчастей(ТаблицаНоменклатурыДляОповещения)
	
	// ++ 20.12.2020
	Если ТаблицаНоменклатурыДляОповещения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНоменклатурыДляОповещения.Свернуть("ЗаказНаПеремещение,Номенклатура,НомерЗаявкиНаГарантийныйРемонт");
	// --
	
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой);
	
	// 26.12.2020
	АдресаДляОтправкиУникальные = Новый Массив;
	Индекс = МассивАдресовДляОтправки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ТекСтруктура = МассивАдресовДляОтправки[Индекс];
		ТекАдрес = ТекСтруктура.Адрес;
		Если АдресаДляОтправкиУникальные.Найти(ТекАдрес) = Неопределено Тогда
			АдресаДляОтправкиУникальные.Добавить(ТекАдрес);
		Иначе
			МассивАдресовДляОтправки.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда

	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021

			
		// ++ 20.12.2020
		//ТекстЗапчасть = "Запчасть ";
		//НомерЗаказаНаПеремещение = "";
		//
		//// ++ 16.11.2020
		//МассивНомеровЗаказовНаПеремещение = Новый Массив;
		//// --
		//Если СоответствиеНоменклатурыДляОповещения.Количество() > 1 Тогда
		//	ТекстЗапчасть = "Запчасти ";
		//КонецЕсли;
		//
		//Сч = 1;
		//Для Каждого ТекСоответствие Из СоответствиеНоменклатурыДляОповещения Цикл
		//	Для Каждого ЭлементСоответствия Из ТекСоответствие Цикл 
		//		Номенклатура = ЭлементСоответствия.Значение;
		//		НомерЗаказа = ЭлементСоответствия.Ключ;
		//		Если Сч > 1 Тогда
		//			ТекстЗапчасть = ТекстЗапчасть + ", " + Номенклатура;
		//			// ++ 16.11.2020
		//			Если МассивНомеровЗаказовНаПеремещение.Найти(НомерЗаказа) = Неопределено Тогда
		//			// --
		//			НомерЗаказаНаПеремещение = НомерЗаказаНаПеремещение + ", " + НомерЗаказа;
		//			// ++ 16.11.2020
		//			КонецЕсли;
		//			// --
		//		Иначе
		//			ТекстЗапчасть = ТекстЗапчасть + Номенклатура;
		//			// ++ 16.11.2020
		//			Если МассивНомеровЗаказовНаПеремещение.Найти(НомерЗаказа) = Неопределено Тогда
		//			// --
		//			НомерЗаказаНаПеремещение = НомерЗаказаНаПеремещение + НомерЗаказа;
		//			// ++ 16.11.2020
		//			КонецЕсли;
		//			// --
		//		КонецЕсли;
		//		
		//		Сч = Сч + 1;
		//	КонецЦикла;
		//КонецЦикла;

		//ТемаПисьма = НомерЗаявки;
							
		//ТекстПисьма = "" + ТекстЗапчасть + " по заявке на гарантийный ремонт " + НомерЗаявки 
		//+ " следует переместить на склад " + Склад + " по документу Заказ на перемещение №" + НомерЗаказаНаПеремещение;

		ТаблицаЗаказовНаПеремещение = ТаблицаНоменклатурыДляОповещения.Скопировать(,"ЗаказНаПеремещение");
		ТаблицаЗаказовНаПеремещение.Свернуть("ЗаказНаПеремещение");
		МассивЗаказовНаПеремещение = ТаблицаЗаказовНаПеремещение.ВыгрузитьКолонку("ЗаказНаПеремещение");
		
		Для Каждого ЗаказНаПеремещение Из МассивЗаказовНаПеремещение Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЗаказНаПеремещение", ЗаказНаПеремещение);
			
			НайденныеСтроки = ТаблицаНоменклатурыДляОповещения.НайтиСтроки(Отбор);
			ЗапчастиДляПеремещенияТекст = "";
			Для Каждого Строка Из НайденныеСтроки Цикл
				ЗапчастиДляПеремещенияТекст = ЗапчастиДляПеремещенияТекст 
				+ ?(ЗначениеЗаполнено(ЗапчастиДляПеремещенияТекст), Символы.ПС, "") 
				+ Строка.Номенклатура + " - " + Строка.НомерЗаявкиНаГарантийныйРемонт;
			КонецЦикла;		
									
			Склад = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
			
			
			ТемаПисьма = "Заказ на перемещение запчастей на склад " + Склад + " №" + ЗаказНаПеремещение.Номер;
			ТекстПисьма = "По заказу на перемещение №" + ЗаказНаПеремещение.Номер + " следует переместить на склад " 
			+ Склад + " следующие запчасти:" + Символы.ПС 
			+ ЗапчастиДляПеремещенияТекст;
		// --
			ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			//-- смарт:ММ 03.03.2021
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
				
				//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
				Если ПараметрыПисьма.ТестоваяБаза Тогда
					ТекстСообщения = "Отправлено уведомление о необходимости перемещения запчастей НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
				Иначе
				//-- смарт:ММ 03.03.2021
				
				ТекстСообщения = "Отправлено уведомление о необходимости перемещения запчастей (на почту " + АдресаДляОтправкиСтрокой + ")";
				
				//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
				КонецЕсли;
				//-- смарт:ММ 03.03.2021
				
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Исключение 
				//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
				смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказНаПеремещение,ТекстПисьма);
				//-- #1416 смарт: Фролов 30.08.2023
				ТекстСообщения = "Не удалось отправить уведомление о необходимости перемещения запчастей" + Символы.ПС + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
			
		// ++ 20.12.2020
		КонецЦикла;
		// --
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 19.10.2020 

//++ смарт:ММ 19.10.2020 #044 224 Продолжение #001
Функция ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой = "") Экспорт
	
	// Уведомление отправляется получаетелям, которые задаются в справочнике смартПредопределенныеЗначения
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресаДляУведомленийОНеобходимостиРаспровестиРасходныйОрдерПриОтменеОтправки;
	
	// Раскомментировать, если в справочнике должны будут храниться пользователи, а не адреса эл. почты
	//Возврат смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	|	И НЕ смартПредопределенныеЗначения.СписокЗначений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений";
	
	Запрос.УстановитьПараметр("ПредопределенноеЗначение", СсылкаНаПредопределенноеЗначение);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- смарт:ММ 19.10.2020

//++ смарт:ММ 19.10.2020 #044 224 Продолжение #001
//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег  
//Процедура ОтправитьУведомлениеПриходНаСкладЗапчастейПодЗаказ(Заявка, СписокНоменклатуры)
Процедура ОтправитьУведомлениеПриходНаСкладЗапчастейПодЗаказ(Заявка, СписокНоменклатуры,СкладГарантия=Неопределено)
//-- #1369 смарт: Фролов 06.06.2023	
	// ++ 26.11.2020 - вызывается еще из обработки смартОприходованиеГарантийныхЗапчастей при поступлении с флагом "Прямая поставка"
	Экспорт
	// --
	
	НомерЗаявки = Заявка.Номер;
	Серия = Заявка.Серия; // смарт Минаева 23.03.2022 #942  
	Контрагент = Заявка.Контрагент;	// смарт Минаева 23.03.2022 #942 
	
	АдресаДляОтправкиСтрокой = "";
	// ++ 27.11.2020
	//МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийПриходНаСкладЗапчастейПодЗаказ(АдресаДляОтправкиСтрокой, Заявка);
	//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег
	//СтруктураАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийПриходНаСкладЗапчастейПодЗаказ(АдресаДляОтправкиСтрокой, Заявка);
	СтруктураАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийПриходНаСкладЗапчастейПодЗаказ(АдресаДляОтправкиСтрокой, Заявка,СкладГарантия);
	//-- #1369 смарт: Фролов 06.06.2023
	МассивАдресовДляОтправки = СтруктураАдресовДляОтправки.АдресаОсновные;
	МассивАдресовДляОтправкиКопия = СтруктураАдресовДляОтправки.АдресаКопия;
	// --
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021

					 
		Склад = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
		ТемаПисьма = НомерЗаявки;
		
		//++ смарт:Минаева #942 24.03.2022 17:29:05 обновлен текс сообщения
		ТекстПисьма = "Запчасть " + СписокНоменклатуры + " по заявке на гарантийный ремонт " + НомерЗаявки 
		+ ", серии " + Серия + ", " + Контрагент + " поступила на склад " + Склад + ". Получите запчасть на складе. Для оформления документов пользуйтесь кнопкой ""Взять на складе"" в заявке на гарантийный ремонт в 1С.";
		//-- смарт:Минаева #942 24.03.2022 17:29:05
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		// ++ 21.11.2020
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, МассивАдресовДляОтправкиКопия);
		//++ #1404 смарт: Фролов 27.07.2023 //контроль отслеживания поступлений и зависших запчастей по гарантии  
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, МассивАдресовДляОтправкиКопия, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		Если Заявка.Статус=Перечисления.СтатусыКассовойСмены.Закрыта Тогда
			ЗаявкаЗакрыта=Истина;
		Иначе
			ЗаявкаЗакрыта=Ложь;
		КонецЕсли;	
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, МассивАдресовДляОтправкиКопия, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза,,,,ЗаявкаЗакрыта);
		//-- #1404 смарт: Фролов 27.07.2023
		//-- смарт:ММ 03.03.2021
		// --
		//++ #1404 смарт: Фролов 27.07.2023 //контроль отслеживания поступлений и зависших запчастей по гарантии 
		//ПараметрыПисьма		
		//-- #1404 смарт: Фролов 27.07.2023
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о поступлении гарантийных запчастей на склад для запчастей под заказ НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
			Иначе
			//-- смарт:ММ 03.03.2021
			
			ТекстСообщения = "Отправлено уведомление о поступлении гарантийных запчастей на склад для запчастей под заказ (на почту " +  АдресаДляОтправкиСтрокой + ")";
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			КонецЕсли;
			//-- смарт:ММ 03.03.2021
			
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,Заявка,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить уведомление о поступлении гарантийных запчастей на склад для запчастей под заказ" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 19.10.2020

//++ смарт:ММ 19.10.2020 #044 224 Продолжение #001
//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег  
//Функция ПолучитьАдресаПолучателейУведомленийПриходНаСкладЗапчастейПодЗаказ(АдресаДляОтправкиСтрокой)
Функция ПолучитьАдресаПолучателейУведомленийПриходНаСкладЗапчастейПодЗаказ(АдресаДляОтправкиСтрокой, Заявка,СкладГарантия=Неопределено)
//-- #1369 смарт: Фролов 06.06.2023

	// Уведомление отправляется получаетелям, которые задаются в справочнике смартПредопределенныеЗначения "Адреса эл. почты для уведомлений об отмене отправки гарантийных запчастей"
	// + надо вытащить ответственного за "склад инженера": в заявке смотрим склад инженера -> в карточке склада находим реквизит Ответственный -> по этому физику находим пользователя -> у пользователя берем рабочую почту 
	// + ответственного за заявку
	
	// ++ 21.11.2020
	// + руководителя СЦ (или руководителя подразделения, если руководитель СЦ не заполнен)  
	// Адреса из предопределенного справочника перенести в копию адресатов, остальных оставить в основных получателях
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("АдресаКопия", Новый Массив);
	СтруктураВозврата.Вставить("АдресаОсновные", Новый Массив);
	//--
	
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресаДляУведомленийОбОтменеОтправкиГарантийныхЗапчастей;
	
	// Раскомментировать, если в справочнике должны будут храниться пользователи, а не адреса эл. почты
	//Возврат смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой);
	
	Запрос = Новый Запрос;
	//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег  
	Если СкладГарантия=Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Склады.ТекущийОтветственный КАК ТекущийОтветственный,
		|	Пользователи.Ссылка КАК ПользовательСклад
		|ПОМЕСТИТЬ ВТ_ПользовательОтветственныйЗаСклад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Склады.ТекущийОтветственный = Пользователи.ФизическоеЛицо
		|ГДЕ
		|	Склады.Ссылка = &СкладИнженера
		// ++ 21.11.2020
		|	И Склады.ТекущийОтветственный <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		// --
		|
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартПредопределенныеЗначения.Значение КАК Значение
		// ++ 21.11.2020
		|	, ""Копия"" КАК ВидПолучателя
		// --
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
		|ГДЕ
		|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
		|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
		|	И НЕ смартПредопределенныеЗначения.СписокЗначений
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	смартПредопределенныеЗначенияЗначения.Значение
		// ++ 21.11.2020
		|	, ""Копия""
		// --
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
		|ГДЕ
		|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
		|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
		|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПользователиСпр.смартРабочаяПочта = """"
		|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
		|		ИНАЧЕ ПользователиСпр.смартРабочаяПочта
		|	КОНЕЦ
		// ++ 21.11.2020
		|	, ""Основной""
		// --
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиСпр
		|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиСпр.Ссылка
		|			И ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя
		|ГДЕ
		|	ПользователиСпр.Ссылка = &Пользователь
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПользователиСпр.смартРабочаяПочта = """"
		|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
		|		ИНАЧЕ ПользователиСпр.смартРабочаяПочта
		|	КОНЕЦ
		// ++ 21.11.2020
		|	, ""Основной""
		// --
		|ИЗ
		|	Справочник.Пользователи КАК ПользователиСпр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиСпр.Ссылка
		|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПользовательОтветственныйЗаСклад КАК ВТ_ПользовательОтветственныйЗаСклад
		|		ПО ПользователиСпр.Ссылка = ВТ_ПользовательОтветственныйЗаСклад.ПользовательСклад";
	
		Запрос.УстановитьПараметр("ПредопределенноеЗначение", СсылкаНаПредопределенноеЗначение); 
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Склады.ТекущийОтветственный КАК ТекущийОтветственный,
		|	Пользователи.Ссылка КАК ПользовательСклад
		|ПОМЕСТИТЬ ВТ_ПользовательОтветственныйЗаСклад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Склады.ТекущийОтветственный = Пользователи.ФизическоеЛицо
		|ГДЕ
		|	Склады.Ссылка = &СкладИнженера
		|	И Склады.ТекущийОтветственный <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладысмартАдресаДляОтправкиОповещенийОПриходеТовара.смартАдресДляОтправкиОповещенияОПриходеТовара КАК Значение,
		|	""Копия"" КАК ВидПолучателя
		|ИЗ
		|	Справочник.Склады.смартАдресаДляОтправкиОповещенийОПриходеТовара КАК СкладысмартАдресаДляОтправкиОповещенийОПриходеТовара
		|ГДЕ
		|	НЕ СкладысмартАдресаДляОтправкиОповещенийОПриходеТовара.Ссылка.ПометкаУдаления
		|	И СкладысмартАдресаДляОтправкиОповещенийОПриходеТовара.Ссылка = &СкладГарантия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПользователиСпр.смартРабочаяПочта = """"
		|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
		|		ИНАЧЕ ПользователиСпр.смартРабочаяПочта
		|	КОНЕЦ,
		|	""Основной""
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиСпр
		|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиСпр.Ссылка
		|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
		|ГДЕ
		|	ПользователиСпр.Ссылка = &Пользователь
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПользователиСпр.смартРабочаяПочта = """"
		|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
		|		ИНАЧЕ ПользователиСпр.смартРабочаяПочта
		|	КОНЕЦ,
		|	""Основной""
		|ИЗ
		|	Справочник.Пользователи КАК ПользователиСпр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО (ПользователиКонтактнаяИнформация.Ссылка = ПользователиСпр.Ссылка)
		|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПользовательОтветственныйЗаСклад КАК ВТ_ПользовательОтветственныйЗаСклад
		|		ПО ПользователиСпр.Ссылка = ВТ_ПользовательОтветственныйЗаСклад.ПользовательСклад";	
	КонецЕсли;
	Запрос.УстановитьПараметр("СкладГарантия", СкладГарантия);
	
	//-- #1369 смарт: Фролов 06.06.2023	
	Запрос.УстановитьПараметр("Пользователь", Заявка.Ответственный);
	Запрос.УстановитьПараметр("СкладИнженера", Заявка.СкладИнженера);
	Запрос.УстановитьПараметр("ПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);

	
	МассивАдресов = Новый Массив;
	// ++ 21.11.2020
	МассивАдресовКопия = Новый Массив;
	// --
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			// ++ 21.11.2020
			Если Выборка.ВидПолучателя = "Копия" Тогда
				МассивАдресовКопия.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			Иначе
			// --
				МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			// ++ 21.11.2020
			КонецЕсли;
		    // --
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
	
	// ++ 21.11.2020
	//Возврат МассивАдресов;
	
	// ++ 23.11.2020
	Подразделение = Заявка.Ответственный.Подразделение;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		АдресаРуководителей = смартОбщегоНазначения.ПолучитьАдресРуководителяПредставительства(Подразделение, АдресаДляОтправкиСтрокой);
		Если ЗначениеЗаполнено(АдресаРуководителей) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивАдресов, АдресаРуководителей, Истина);		
		КонецЕсли;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("АдресаКопия", МассивАдресовКопия);
	СтруктураВозврата.Вставить("АдресаОсновные", МассивАдресов);
	
	Возврат СтруктураВозврата;
	// --
	
КонецФункции //-- смарт:ММ 19.10.2020

//++ смарт:ММ #037 15.03.2020
Процедура смартПометкаУдаленияФискальныеОперацииПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ФискальныеОперации.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|ГДЕ
		|	ФискальныеОперации.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ИмяРС = Метаданные.РегистрыСведений.ФискальныеОперации.Синоним;
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ нельзя пометить на удаление, т.к. по нему есть данные в регистре сведений " + ИмяРС);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 15.03.2020

//++ смарт:ММ #084 407 01.12.2020 - Доработка Заявки на пусконаладку
Процедура смартОбработкаПроведенияРеализацияТиУОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыПроцедуры = Новый Структура();
		ПараметрыПроцедуры.Вставить("Источник", Источник.Ссылка);
						
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.смартОбработкаПроведенияРеализацияТиУ", ПараметрыПроцедуры, ПараметрыВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 01.12.2020

//++ смарт:ММ #084 407 01.12.2020 - Доработка Заявки на пусконаладку
Процедура смартОбработкаПроведенияРеализацияТиУ(Параметры, Адрес) Экспорт
	
	// ++ 08.12.2020
	ОбщегоНазначенияБТС.Пауза(5);
	// --

	// Заполнение серий в связанной Заявке на пусконаладку
	
	РеализацияТоваровУслугСсылка = Параметры.Источник;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_ЗаказКлиента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И РеализацияТоваровУслуг.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И РеализацияТоваровУслуг.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартЗаявкаНаПускоНаладку.Ссылка КАК ЗаявкаНаПускоНаладку
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку КАК смартЗаявкаНаПускоНаладку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
	|		ПО смартЗаявкаНаПускоНаладку.ДокументОснование = ВТ_ЗаказКлиента.ЗаказКлиента";
	
	Запрос.УстановитьПараметр("Ссылка", РеализацияТоваровУслугСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаявкаНаПусконаладку = Выборка.ЗаявкаНаПускоНаладку;
		
		Если ЗначениеЗаполнено(ЗаявкаНаПусконаладку) Тогда
			
			ДокОбъект = ЗаявкаНаПусконаладку.ПолучитьОбъект();
			БылиИзменения = Ложь;
			
			Для Каждого ТекСтрока Из РеализацияТоваровУслугСсылка.Товары Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Оборудование", ТекСтрока.Номенклатура);
				НайденныеСтроки = ДокОбъект.Оборудование.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Серия) 
							И ЗначениеЗаполнено(ТекСтрока.Серия) Тогда
							НайденнаяСтрока.Серия = ТекСтрока.Серия;
							БылиИзменения = Истина;
						КонецЕсли;						
					КонецЦикла;
				КонецЕсли;				
			КонецЦикла;
			
			Если БылиИзменения Тогда
				Попытка 
					ДокОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	//++ смарт:ММ #097 460 01.03.2021 Безвозмездная передача
	
	Если РеализацияТоваровУслугСсылка.смартБезвозмезднаяПередача 
		И ЗначениеЗаполнено(РеализацияТоваровУслугСсылка.ЗаказКлиента) Тогда
		
		// Создание Списания задолженности
		
		Заказ = РеализацияТоваровУслугСсылка.ЗаказКлиента;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеЗадолженностиЗадолженность.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеЗадолженности.Задолженность КАК СписаниеЗадолженностиЗадолженность
		|ГДЕ
		|	СписаниеЗадолженностиЗадолженность.Заказ = &Заказ
		|	И НЕ СписаниеЗадолженностиЗадолженность.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток КАК ДолгОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|			,
		|			ОбъектРасчетов = &Заказ
		|				И РасчетныйДокумент = &Реализация
		|				И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК РасчетыСКлиентамиПоСрокамОстатки";
		
		Запрос.УстановитьПараметр("Заказ", 		Заказ);
		Запрос.УстановитьПараметр("Реализация", РеализацияТоваровУслугСсылка);
		Запрос.УстановитьПараметр("Контрагент", Заказ.Контрагент);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ЗапросДокумент = РезультатЗапроса[РезультатЗапроса.Количество() - 2];
		
		Если ЗапросДокумент.Пустой() Тогда
			
			ВыборкаДолг = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
			
			Если ВыборкаДолг.Следующий() И ВыборкаДолг.ДолгОстаток > 0 Тогда
				
				НовыйДокумент = Документы.СписаниеЗадолженности.СоздатьДокумент();
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.Организация = Заказ.Организация;
				НовыйДокумент.Контрагент = Заказ.Контрагент;
				НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
				НовыйДокумент.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов;
				
				НоваяСтрока = НовыйДокумент.Задолженность.Добавить();
				НоваяСтрока.ТипРасчетов 			= Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
				НоваяСтрока.Партнер 				= Заказ.Партнер;
				НоваяСтрока.Заказ 					= Заказ;
				НоваяСтрока.ВалютаВзаиморасчетов 	= Заказ.Валюта;
				НоваяСтрока.ИдентификаторСтроки 	= Новый УникальныйИдентификатор;
				НоваяСтрока.Сумма 					= ВыборкаДолг.ДолгОстаток;
				
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	//-- смарт:ММ 01.03.2021
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //-- смарт:ММ 01.12.2020

//++ смарт:ММ #044 224 03.12.2020 - Заявка на гарантийный ремонт 
Процедура смартРегистрацияВЦепочкеДокументовПоставкиОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ВыполнятьФоновуюПроверкуЦепочки = Ложь;
	МассивЗаказовДляФоновойПроверки = Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		
		ЗаказПоставщику = Источник.ЗаказПоставщику;
		
		Если ЗначениеЗаполнено(ЗаказПоставщику) И ЗаказПоИмпорту(ЗаказПоставщику) Тогда
			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи = РегистрыСведений.смартЦепочкиДокументовПоставки.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ЗаказПоставщику = ЗаказПоставщику;
			МенеджерЗаписи.ХозОперация = ЗаказПоставщику.ХозяйственнаяОперация;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ПриобретениеТоваровУслуг <> Источник.Ссылка Тогда
				МенеджерЗаписи.ПриобретениеТоваровУслуг = Источник.Ссылка;
				МенеджерЗаписи.Записать();
				ВыполнятьФоновуюПроверкуЦепочки = Истина;
				МассивЗаказовДляФоновойПроверки.Добавить(ЗаказПоставщику);
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;		
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ТаможеннаяДекларацияИмпорт") Тогда
		
		Для Каждого СтрокаТовар Из Источник.Товары Цикл
			
			ДокументПриобретение = СтрокаТовар.ДокументПоступления;
			
			ЗаказПоставщику = ДокументПриобретение.ЗаказПоставщику;
			
			Если ЗначениеЗаполнено(ЗаказПоставщику) И ЗаказПоИмпорту(ЗаказПоставщику) Тогда
				УстановитьПривилегированныйРежим(Истина);
				МенеджерЗаписи = РегистрыСведений.смартЦепочкиДокументовПоставки.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ЗаказПоставщику = ЗаказПоставщику;
				МенеджерЗаписи.ХозОперация = ЗаказПоставщику.ХозяйственнаяОперация;
				МенеджерЗаписи.Прочитать();
				Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ТаможеннаяДекларацияИмпорт <> Источник.Ссылка Тогда
					МенеджерЗаписи.ТаможеннаяДекларацияИмпорт = Источник.Ссылка;
					МенеджерЗаписи.Записать();
					ВыполнятьФоновуюПроверкуЦепочки = Истина;
					МассивЗаказовДляФоновойПроверки.Добавить(ЗаказПоставщику);
				КонецЕсли;
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровНаСклад") Тогда
		
		ЗаказПоставщику = Источник.Распоряжение;
		
		Если ЗначениеЗаполнено(ЗаказПоставщику) 
			И ТипЗнч(ЗаказПоставщику) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ЗаказПоИмпорту(ЗаказПоставщику) Тогда
			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи = РегистрыСведений.смартЦепочкиДокументовПоставки.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ЗаказПоставщику = ЗаказПоставщику;
			МенеджерЗаписи.ХозОперация = ЗаказПоставщику.ХозяйственнаяОперация;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ПоступлениеТоваровНаСклад <> Источник.Ссылка Тогда
				МенеджерЗаписи.ПоступлениеТоваровНаСклад = Источник.Ссылка;
				МенеджерЗаписи.Записать();
				ВыполнятьФоновуюПроверкуЦепочки = Истина;
				МассивЗаказовДляФоновойПроверки.Добавить(ЗаказПоставщику);
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;	
	КонецЕсли;
	
	
	// Шаманство в фоновом режиме
	Если ВыполнятьФоновуюПроверкуЦепочки Тогда
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыПроцедуры = Новый Структура();
		ПараметрыПроцедуры.Вставить("МассивЗаказовДляФоновойПроверки", МассивЗаказовДляФоновойПроверки);
		
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ПроверитьЦепочкуДокументов", ПараметрыПроцедуры, ПараметрыВыполнения);
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 03.12.2020

//++ смарт:ММ #044 224 03.12.2020 - Заявка на гарантийный ремонт 
Функция ЗаказПоИмпорту(ЗаказПоставщика) 
	
	Возврат ЗаказПоставщика.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту
			ИЛИ ЗаказПоставщика.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути;
			
КонецФункции

//++ смарт:ММ #044 224 03.12.2020 - Заявка на гарантийный ремонт 
Процедура ПроверитьЦепочкуДокументов(Параметры, Адрес) Экспорт
	
	// ++ 08.12.2020
	ОбщегоНазначенияБТС.Пауза(5);
	// --

	// ++ 20.12.2020
	ТаблицаНоменклатурыДляОповещения = Новый ТаблицаЗначений;
	ТаблицаНоменклатурыДляОповещения.Колонки.Добавить("ЗаказНаПеремещение");
	ТаблицаНоменклатурыДляОповещения.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатурыДляОповещения.Колонки.Добавить("НомерЗаявкиНаГарантийныйРемонт");
	// --
	Импорт = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту;
	ИмпортТоварыВПути = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути;
	
	МассивЗаказовДляФоновойПроверки = Параметры.МассивЗаказовДляФоновойПроверки;
	УстановитьПривилегированныйРежим(Истина);//rnp: для рег.св смартЦепочкиДокументовПоставки; где выключить?
	Для Каждого ЗаказПоставщику Из МассивЗаказовДляФоновойПроверки Цикл
		
		ОтправитьУведомлениеСклад = Ложь;
		ЦепочкаПолная = Ложь;
		
		МенеджерЗаписи = РегистрыСведений.смартЦепочкиДокументовПоставки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаказПоставщику = ЗаказПоставщику;
		МенеджерЗаписи.ХозОперация = ЗаказПоставщику.ХозяйственнаяОперация;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			Если МенеджерЗаписи.ХозОперация = ИмпортТоварыВПути Тогда
				Если ЗначениеЗаполнено(МенеджерЗаписи.ТаможеннаяДекларацияИмпорт) 
					И ЗначениеЗаполнено(МенеджерЗаписи.ПриобретениеТоваровУслуг)
					И ЗначениеЗаполнено(МенеджерЗаписи.ПоступлениеТоваровНаСклад) Тогда
					ЦепочкаПолная = Истина;
				КонецЕсли;
			ИначеЕсли МенеджерЗаписи.ХозОперация = Импорт Тогда
				Если ЗначениеЗаполнено(МенеджерЗаписи.ТаможеннаяДекларацияИмпорт) 
					И ЗначениеЗаполнено(МенеджерЗаписи.ПриобретениеТоваровУслуг) Тогда
					ЦепочкаПолная = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЦепочкаПолная Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаказНаПеремещение = МенеджерЗаписи.ЗаказНаПеремещение;
		// ++ 20.12.2020
		//СоответствиеНоменклатурыДляОповещения = Новый Массив;
		// --
		НомераЗаявокНаГарантийныйРемонт = "";
		МассивНомеровЗаявокНаГарантийныйРемонт = Новый Массив;
		
		ЗаказНаПеремещениеОбъект = ЗаказНаПеремещение.ПолучитьОбъект();
		МассивСтрокДляУдаления = Новый Массив;
		
		Для Каждого СтрокаТовар Из ЗаказНаПеремещение.Товары Цикл // Вроде как должна быть всего одна номенклатура, но на всякий случай цикл
			
			//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
			//Если НЕ ЗначениеЗаполнено(СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонт) Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонтСсылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаявкаНаГарантийныйРемонт = СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонтСсылка;
			
			//ЗаявкаНаГарантийныйРемонт = НайтиЗаявкуНаГарантийныйРемонт(ЗаказНаПеремещение, СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонт);
			//Если ЗаявкаНаГарантийныйРемонт = Неопределено Тогда
			//	Продолжить;
			//КонецЕсли;
			//-- #Б1132 смарт: Шляпников 01.11.2024
			
			
			ДокОбъект = ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
			ДокументИзменен = Ложь;
			
			// 1. Проверка, надо ли удалить заказ на перемещение (детали по заявке на гарантийный ремонт добыли другим путем)
			// Аналогичная проверка есть при проведении приходного ордера. Нужна ли тут еще?
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументДвиженияДоп", ЗаказНаПеремещение);
			СтрокиСтатус = ДокОбъект.Статусы.НайтиСтроки(Отбор);
			Если СтрокиСтатус.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаСтатус Из СтрокиСтатус Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("НомерПозиции", СтрокаСтатус.НомерПозиции);
				СтрокиСпециалист = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
				Если СтрокиСпециалист.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаСпециалист = Неопределено;
				Для Каждого СтрокаСпец Из СтрокиСпециалист Цикл
					Номенклатура = СтрокаСпец.Номенклатура;
					Если ЗначениеЗаполнено(СтрокаСпец.АналогОтПоставщика) Тогда
						Номенклатура = СтрокаСпец.АналогОтПоставщика;
					КонецЕсли;
					
					Если Номенклатура = СтрокаТовар.Номенклатура Тогда
						СтрокаСпециалист = СтрокаСпец;
						Прервать;
					КонецЕсли;				
				КонецЦикла;
				
				Если СтрокаСпециалист = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ИДСтрокиЗаполняетсяИнженером = СтрокаСпециалист.ИДСтрокиЗаполняетсяИнженером;
				Отбор = Новый Структура;
				Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИДСтрокиЗаполняетсяИнженером);
				СтрокиИнженер = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
				Если СтрокиИнженер.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаИнженер = СтрокиИнженер[0];

				УспехУдаленияСтроки = Ложь;
								
				Если ЗначениеЗаполнено(СтрокаИнженер.НоменклатураУстановленнаяКлиенту) Тогда
					//смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, Номенклатура, ЗаказНаПеремещение,,, УспехУдаленияСтроки);
					МассивСтрокДляУдаления.Добавить(СтрокаТовар);
					ДокументИзменен = Истина;
					СтрокаСтатус.ДокументДвиженияДоп = Неопределено; 					
					
				Иначе
					// Оповещения
					
					//смартУдалитьСтрокиИлиПолучитьСписокНоменклатурыИзЗаказаНаПеремещениеПоЗаявкеНаГарантийныйРемонт(ДокОбъект.Номер, Номенклатура, ЗаказНаПеремещение, Истина, СоответствиеНоменклатурыДляОповещения);
					// ++ 20.12.2020
					//Соотв = Новый Соответствие();
					//Соотв.Вставить(ЗаказНаПеремещение.Номер, СтрокаТовар.Номенклатура);
					//СоответствиеНоменклатурыДляОповещения.Добавить(Соотв);
					НоваяСтрокаОповещение = ТаблицаНоменклатурыДляОповещения.Добавить();
					НоваяСтрокаОповещение.ЗаказНаПеремещение = ЗаказНаПеремещение;
					НоваяСтрокаОповещение.Номенклатура = СтрокаТовар.Номенклатура;
					НоваяСтрокаОповещение.НомерЗаявкиНаГарантийныйРемонт = ДокОбъект.Номер;
					// --
					
					ОтправитьУведомлениеСклад = Истина;
					Если МассивНомеровЗаявокНаГарантийныйРемонт.Найти(ДокОбъект.Номер) = Неопределено Тогда
						НомераЗаявокНаГарантийныйРемонт = НомераЗаявокНаГарантийныйРемонт + ?(ЗначениеЗаполнено(НомераЗаявокНаГарантийныйРемонт), ", ", "") + ДокОбъект.Номер;
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;
						
			Если ДокументИзменен Тогда
				Попытка 
					ДокОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
				
		КонецЦикла; // По товарам заказа на перемещение
		
		Если МассивСтрокДляУдаления.Количество() > 0 Тогда
						
			Если ЗаказНаПеремещениеОбъект.Товары.Количество() = МассивСтрокДляУдаления.Количество() Тогда
				// Оставить все строки в заказе, но пометить его на удаление
				ЗаказНаПеремещениеОбъект.УстановитьПометкуУдаления(Истина);
			Иначе
				Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
					ЗаказНаПеремещениеОбъект.Товары.Удалить(СтрокаДляУдаления);
				КонецЦикла;

				Попытка
					ЗаказНаПеремещениеОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЗаказНаПеремещение.Товары.Количество() > 0 И НЕ ЗаказНаПеремещение.ПометкаУдаления Тогда
			// 2. Обработка заказа на перемещение (всем строкам установить Отгрузить, создать перемещение товаров)
			ОбработатьЗаказНаПеремещение(ЗаказНаПеремещение, ЗаказПоставщику,,, НомераЗаявокНаГарантийныйРемонт);
			
			// 3. Отправка уведомления
			Если ОтправитьУведомлениеСклад Тогда
				// ++ 20.12.2020
				//ОтправитьУведомлениеОНеобходимостиПеремещенияЗапчастей(СоответствиеНоменклатурыДляОповещения, НомераЗаявокНаГарантийныйРемонт);
				ОтправитьУведомлениеОНеобходимостиПеремещенияЗапчастей(ТаблицаНоменклатурыДляОповещения);
				// --
			КонецЕсли;

		КонецЕсли;
		
		// 4. Удалить запись из регистра (?)
		//МенеджерЗаписи.Удалить();
	КонецЦикла;	
		
КонецПроцедуры //-- смарт:ММ 03.12.2020

//++ смарт:ММ #044 224 05.12.2020 - Заявка на гарантийный ремонт 
Функция НайтиЗаявкуНаГарантийныйРемонт(ЗаказНаПеремещение, смартНомерЗаявкиНаГарантийныйРемонт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартЗаявкаНаГарантийныйРемонтСтатусы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартЗаявкаНаГарантийныйРемонт.Статусы КАК смартЗаявкаНаГарантийныйРемонтСтатусы
	|ГДЕ
	|	смартЗаявкаНаГарантийныйРемонтСтатусы.ДокументДвиженияДоп = &ДокументДвиженияДоп
	|	И смартЗаявкаНаГарантийныйРемонтСтатусы.Ссылка.Номер = &Номер";
	
	Запрос.УстановитьПараметр("ДокументДвиженияДоп", ЗаказНаПеремещение);
	Запрос.УстановитьПараметр("Номер", смартНомерЗаявкиНаГарантийныйРемонт);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции //-- смарт:ММ 05.12.2020

//++ смарт:ММ #086 362 06.12.2020 
Процедура смартОповещенияПоЗаказуПоставщикуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
    
    //++#1214 смарт: Лопато 10.10.2022 //Рефакторинг в связи с ошибками  
	////++ смарт:Подкин # 13.09.2022 11:01:46 проверка на копию
	//Копия=Ложь;
	//ИнформацияОБазе=Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить();
	//Если Не ИнформацияОБазе=Неопределено Тогда 
	//    Копия=ИнформацияОБазе.РаботаСВнешнимиРесурсамиЗаблокирована;
	//КонецЕсли;
	//Если Копия Тогда
	//    Возврат;
	//КонецЕсли;
	////-- смарт:Подкин # 13.09.2022 11:01:46
	Если НЕ смартОбщегоНазначения.смартРабочаяБаза() Тогда
		Возврат;
	КонецЕсли;
	//--#1214 смарт: Лопато 10.10.2022
    
	ПроведениеВПервыйРаз = Ложь;
	Если Источник.ДополнительныеСвойства.Свойство("смартПроводитсяВпервые") = Истина Тогда
		ПроведениеВПервыйРаз = Источник.ДополнительныеСвойства.смартПроводитсяВпервые;
	КонецЕсли;
	
	Если НЕ ПроведениеВПервыйРаз Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьПодчиненныеПриобретенияТоваров = ЕстьПриобретениеТоваровПоЗаказуПоставщику(Источник.Ссылка, Неопределено);
	
	Если ЕстьПодчиненныеПриобретенияТоваров Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказПоЗаявкеНаГарантийныйРемонт = Ложь;
	Если СтрНайти(ВРег(Источник.Комментарий), "PRE") <> 0 Тогда
		ЗаказПоЗаявкеНаГарантийныйРемонт = Истина;
	КонецЕсли;
	Если СтрНайти(ВРег(Источник.Комментарий), "TITJ") <> 0 Тогда
		ЗаказПоЗаявкеНаГарантийныйРемонт = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Груз)
		И Источник.Груз.СтатусГруза = Перечисления.СтатусыГрузов.ВПути 
		И НЕ ЗаказПоЗаявкеНаГарантийныйРемонт Тогда
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ПараметрыПроцедуры = Новый Структура();
		ПараметрыПроцедуры.Вставить("ЗаказПоставщику", Источник.Ссылка);
		
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ОтправитьУведомленияПоЗаказуПоставщику", ПараметрыПроцедуры, ПараметрыВыполнения);
		
		//++ #Б-3288 смарт: Фролов 14.05.2025 //Уведомления. По Заказу поставщику. Доработка.
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ОтправитьУведомленияПоЗаказуПоставщикуПоРасходке", ПараметрыПроцедуры, ПараметрыВыполнения);
		//-- #Б-3288 смарт: Фролов 14.05.2025
		
		// ++ 14.12.2020
		Если ЗначениеЗаполнено(Источник.ДокументОснование) И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.смартПредзаказПоставщику") Тогда
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ФЗ2 = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ОтправитьУведомленияПоЗаказуПоставщикуМенеджеруПредзаказа", ПараметрыПроцедуры, ПараметрыВыполнения);
		КонецЕсли;	
		// --
		
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 06.12.2020

//++ смарт:ММ #086 362 06.12.2020 
Процедура ОтправитьУведомленияПоЗаказуПоставщику(Параметры, Адрес) Экспорт

	//++ смарт:ММ #104 488 19.04.2021 
	// Автоматически резервировать товар
	ТаблицаТоварыКРезерву = Новый ТаблицаЗначений;
	ТаблицаТоварыКРезерву.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТаблицаТоварыКРезерву.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	ТаблицаТоварыКРезерву.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоварыКРезерву.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	//-- смарт:ММ 19.04.2021
	
	// Получатели: менеджеры из заказов клиентов + пользователи из предопределенной настройки ПользователиДляРассылкиОПланируемыхПоставках
	
	ОбщегоНазначенияБТС.Пауза(5);

	ИмяСобытияЖР = "смартОтправкаУведомленияПоЗаказуПоставщику";
	
	ЗаказПоставщику = Параметры.ЗаказПоставщику;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказПоставщикуНомер = ЗаказПоставщику.Номер;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаУведомленияПоЗаказуПоставщику(); 
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
	
	// ++ 21.12.2020
	ДатаОтбораЗаказовКлиентов = Справочники.смартПредопределенныеЗначения.ДатаОтбораЗаказовКлиентовДляОповещенияОПланируемыхПоставках.Значение;
	СсылкаНаСправочник = Справочники.смартПредопределенныеЗначения.ГруппаНоменклатурыДляОповещенияОПланируемыхПоставках;
	ГруппыНоменклатуры = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СсылкаНаСправочник, Истина);
	
	Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
	Запрос.УстановитьПараметр("ДатаОтбораЗаказовКлиентов", ДатаОтбораЗаказовКлиентов);
	// --
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивМенеджеров = Новый Массив;
	ТекстНоменклатураМожетеИтог = "";
	ТекстНоменклатураИнформируемИтог = "";
	
	ТекстИтог = "";
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ЕстьЗаказыДляРезерва = Ложь;
		ЕстьЗаказыДляИнформирования = Ложь;
		
		ТекстНоменклатураМожете = "По заказу поставщику №" + ЗаказПоставщикуНомер + " планируется поступление номенклатуры " 
		// ++ 21.12.2020
		//+ ВыборкаНоменклатура.Номенклатура + ". Можете зарезервировать товар для заказов клиента:" + Символы.ПС;
		+ ВыборкаНоменклатура.Номенклатура + " в количестве " + ВыборкаНоменклатура.Количество + ". Можете зарезервировать товар для заказов клиента:" + Символы.ПС;
		// --
		
		ТекстНоменклатураИнформируем = "Информируем, что ждут обеспечения также следующие заказы клиента:" + Символы.ПС;
		
		КоличествоОсталось = ВыборкаНоменклатура.Количество; // Количество из заказа поставщику
	
		Выборка = ВыборкаНоменклатура.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			ТекущееКоличество = Выборка.КоличествоЗаказКлиента;
			
			//++ смарт:ММ #104 488 19.04.2021 
			Оплачен = Ложь;
			//-- смарт:ММ 19.04.2021
			
			// ++ 21.12.2020
			//ШаблонСтроки = "№" + Выборка.Номер + " (" + Выборка.Состояние + ") менеджер " + Выборка.Менеджер + " количество ";
			
			ТекстДатаОплаты = "";
			Если Выборка.Состояние <> "не оплачен" Тогда
				//++ смарт:ММ #104 488 19.04.2021 
				Оплачен = Истина;
				//-- смарт:ММ 19.04.2021
				ТекстДатаОплаты = ", первая дата оплаты " + Формат(Выборка.ДатаОплаты, "ДФ='dd.MM.yyyy ""г.""'");
			КонецЕсли;
			
			//++ #Б-1080 смарт: Лопато 07.03.2025 //Добавить доп текст в оповещения (продолжение задачи 1600) (ИТСМ 1622)  
			ШаблонСтроки = СокрЛП(Выборка.Контрагент) 
						   + " №" + Выборка.Номер 
						   + " от " + Формат(Выборка.ДатаЗаказа, "ДФ='dd.MM.yyyy ""г.""'") 
						   + " (" + Выборка.Состояние +  ТекстДатаОплаты 
						   + ") менеджер " + Выборка.Менеджер + " количество ";
			//-- #Б-1080 смарт: Лопато 07.03.2025
			// --
			
			Если ТекущееКоличество <= КоличествоОсталось Тогда
				
				ТекстНоменклатураМожете = ТекстНоменклатураМожете + ШаблонСтроки + ТекущееКоличество + Символы.ПС;
				КоличествоОсталось = КоличествоОсталось - ТекущееКоличество;
				ЕстьЗаказыДляРезерва = Истина;
				
				//++ смарт:ММ #104 488 19.04.2021 
				Если Оплачен Тогда
					НоваяСтрока = ТаблицаТоварыКРезерву.Добавить();
					НоваяСтрока.ЗаказПоставщику = ЗаказПоставщику;
					НоваяСтрока.ЗаказКлиента = Выборка.ЗаказКлиента;
					НоваяСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					НоваяСтрока.Количество = ТекущееКоличество;
				КонецЕсли;
				//-- смарт:ММ 19.04.2021
				
			ИначеЕсли КоличествоОсталось > 0 Тогда
				
				КоличествоХватило = КоличествоОсталось;
				КоличествоНеХватило = ТекущееКоличество - КоличествоОсталось;
				
				ТекстНоменклатураМожете = ТекстНоменклатураМожете + ШаблонСтроки + КоличествоХватило + " (всего в заказе " + ТекущееКоличество + ")" + Символы.ПС;
				ТекстНоменклатураИнформируем = ТекстНоменклатураИнформируем + ШаблонСтроки + КоличествоНеХватило + Символы.ПС; 
				
				//++ смарт:ММ #104 488 19.04.2021 
				Если Оплачен Тогда
					НоваяСтрока = ТаблицаТоварыКРезерву.Добавить();
					НоваяСтрока.ЗаказПоставщику = ЗаказПоставщику;
					НоваяСтрока.ЗаказКлиента = Выборка.ЗаказКлиента;
					НоваяСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					НоваяСтрока.Количество = ТекущееКоличество;
				КонецЕсли;
				//-- смарт:ММ 19.04.2021
				
				КоличествоОсталось = 0;
				ЕстьЗаказыДляРезерва = Истина;
				ЕстьЗаказыДляИнформирования = Истина;
				
			ИначеЕсли КоличествоОсталось = 0 Тогда
				ТекстНоменклатураИнформируем = ТекстНоменклатураИнформируем + ШаблонСтроки + ТекущееКоличество + Символы.ПС; 
				ЕстьЗаказыДляИнформирования = Истина;
			КонецЕсли;
			
			Если МассивМенеджеров.Найти(Выборка.Менеджер) = Неопределено И ЗначениеЗаполнено(Выборка.Менеджер) Тогда
				МассивМенеджеров.Добавить(Выборка.Менеджер);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЕстьЗаказыДляРезерва Тогда
			ТекстНоменклатураМожете = "";
		Иначе
			ТекстНоменклатураМожете = ТекстНоменклатураМожете + Символы.ПС;
		КонецЕсли;
		Если НЕ ЕстьЗаказыДляИнформирования Тогда
			ТекстНоменклатураИнформируем = "";
		Иначе
			ТекстНоменклатураИнформируем = ТекстНоменклатураИнформируем + Символы.ПС;
		КонецЕсли;
		
		ТекстИтог = ТекстИтог + ?(ЗначениеЗаполнено(ТекстИтог), Символы.ПС + Символы.ПС, "") + ТекстНоменклатураМожете + ТекстНоменклатураИнформируем;
		
	КонецЦикла;
	
	Если ТекстИтог = "" Тогда
		Возврат;
	КонецЕсли;
		
	АдресаДляОтправкиСтрокой = "";
	СсылкаПредопределнноеЗначение = Справочники.смартПредопределенныеЗначения.ПользователиДляРассылкиОПланируемыхПоставках;	
	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаПредопределнноеЗначение, АдресаДляОтправкиСтрокой, Истина);
	
	АдресаМенеджеров = смартОбщегоНазначения.ПолучитьАдресаПользователей(МассивМенеджеров, АдресаДляОтправкиСтрокой);
	
	// ++ 21.12.2020
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивАдресовДляОтправки, АдресаМенеджеров, Истина);
	АдресаДляОтправкиУникальные = Новый Массив;
	Индекс = МассивАдресовДляОтправки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ТекСтруктура = МассивАдресовДляОтправки[Индекс];
		ТекАдрес = ТекСтруктура.Адрес;
		Если АдресаДляОтправкиУникальные.Найти(ТекАдрес) = Неопределено Тогда
			АдресаДляОтправкиУникальные.Добавить(ТекАдрес);
		Иначе
			МассивАдресовДляОтправки.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Для Каждого ТекСтруктура Из АдресаМенеджеров Цикл
		ТекАдрес = ТекСтруктура.Адрес;
		Если АдресаДляОтправкиУникальные.Найти(ТекАдрес) = Неопределено Тогда
			АдресаДляОтправкиУникальные.Добавить(ТекАдрес);
			МассивАдресовДляОтправки.Добавить(ТекСтруктура);
		КонецЕсли;
	КонецЦикла;
	
	АдресаДляОтправкиСтрокой = "";
	Для Каждого ТекАдрес Из АдресаДляОтправкиУникальные Цикл
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ТекАдрес;
	КонецЦикла;
	
	// --
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
		
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
					 
		ТемаПисьма = "Резерв по заказу поставщику №" + ЗаказПоставщикуНомер + " от " + Формат(ЗаказПоставщику.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		ТекстПисьма = ТекстИтог;
		 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о возможности резерва по заказу поставщику №" + ЗаказПоставщикуНомер + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено уведомление о возможности резерва по заказу поставщику №" + ЗаказПоставщикуНомер + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказПоставщику,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить уведомление о возможности резерва по заказу поставщику №" + ЗаказПоставщикуНомер + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	//++ смарт:ММ #104 488 19.04.2021 
	Если ТаблицаТоварыКРезерву.Количество() > 0 Тогда
		ЗарезервироватьТоварыВЗаказахКлиентов(ТаблицаТоварыКРезерву);
	КонецЕсли;
	//-- смарт:ММ 19.04.2021
	
КонецПроцедуры //-- смарт:ММ 06.12.2020

//++ #Б-3288 смарт: Фролов 14.05.2025 //Уведомления. По Заказу поставщику. Доработка.
Процедура ОтправитьУведомленияПоЗаказуПоставщикуПоРасходке(Параметры, Адрес) Экспорт

	// Автоматически резервировать товар
	ТаблицаТоварыКРезерву = Новый ТаблицаЗначений;
	ТаблицаТоварыКРезерву.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТаблицаТоварыКРезерву.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	ТаблицаТоварыКРезерву.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоварыКРезерву.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	// Получатели: менеджеры из заказов клиентов + пользователи из предопределенной настройки ПолучателиРассылокОПланируемыхПоставкахРасходыхМатериалов
	
	ОбщегоНазначенияБТС.Пауза(5);

	ИмяСобытияЖР = "смартОтправкаУведомленияПоЗаказуПоставщикуПоРасходке";
	
	ЗаказПоставщику = Параметры.ЗаказПоставщику;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказПоставщикуНомер = ЗаказПоставщику.Номер;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаУведомленияПоЗаказуПоставщику(); 
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
	
	ДатаОтбораЗаказовКлиентов = Справочники.смартПредопределенныеЗначения.ДатаОтбораЗаказовКлиентовДляОповещенияОПланируемыхПоставках.Значение;
	
	ГруппыНоменклатуры = Новый Массив;
	
	//++ #3980 смарт: Ермаков 05.08.2025 / Ошибка у Лавровой Евгении
	Для Каждого СтрРасходка Из Справочники.смартПредопределенныеЗначения.Настройки.ГруппыНоменклатурыРасходка Цикл
		
		ГруппыНоменклатуры.Добавить(СтрРасходка.ГруппаНоменклатуры);		
		
	КонецЦикла;
	//-- #3980 смарт: Ермаков 05.08.2025
	
	Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
	Запрос.УстановитьПараметр("ДатаОтбораЗаказовКлиентов", ДатаОтбораЗаказовКлиентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивМенеджеров = Новый Массив;
	ТекстНоменклатураМожетеИтог = "";
	ТекстНоменклатураИнформируемИтог = "";
	
	ТекстИтог = "";
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ЕстьЗаказыДляРезерва = Ложь;
		ЕстьЗаказыДляИнформирования = Ложь;
		
		ТекстНоменклатураМожете = "По заказу поставщику №" + ЗаказПоставщикуНомер + " планируется поступление номенклатуры " 
			+ ВыборкаНоменклатура.Номенклатура + " в количестве " + ВыборкаНоменклатура.Количество + ". Можете зарезервировать товар для заказов клиента:" + Символы.ПС;
		
		ТекстНоменклатураИнформируем = "Информируем, что ждут обеспечения также следующие заказы клиента:" + Символы.ПС;
		
		КоличествоОсталось = ВыборкаНоменклатура.Количество; // Количество из заказа поставщику
	
		Выборка = ВыборкаНоменклатура.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			ТекущееКоличество = Выборка.КоличествоЗаказКлиента;
			
			Оплачен = Ложь;
			
			ТекстДатаОплаты = "";
			Если Выборка.Состояние <> "не оплачен" Тогда
				
				Оплачен = Истина;
				ТекстДатаОплаты = ", первая дата оплаты " + Формат(Выборка.ДатаОплаты, "ДФ='dd.MM.yyyy ""г.""'");
				
			КонецЕсли;
			
			ШаблонСтроки = СокрЛП(Выборка.Контрагент) 
						   + " №" + Выборка.Номер 
						   + " от " + Формат(Выборка.ДатаЗаказа, "ДФ='dd.MM.yyyy ""г.""'") 
						   + " (" + Выборка.Состояние +  ТекстДатаОплаты 
						   + ") менеджер " + Выборка.Менеджер + " количество ";
			
			Если ТекущееКоличество <= КоличествоОсталось Тогда
				
				ТекстНоменклатураМожете = ТекстНоменклатураМожете + ШаблонСтроки + ТекущееКоличество + Символы.ПС;
				КоличествоОсталось = КоличествоОсталось - ТекущееКоличество;
				ЕстьЗаказыДляРезерва = Истина;
				
				Если Оплачен Тогда
					
					НоваяСтрока = ТаблицаТоварыКРезерву.Добавить();
					НоваяСтрока.ЗаказПоставщику = ЗаказПоставщику;
					НоваяСтрока.ЗаказКлиента = Выборка.ЗаказКлиента;
					НоваяСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					НоваяСтрока.Количество = ТекущееКоличество;
					
				КонецЕсли;
				
			ИначеЕсли КоличествоОсталось > 0 Тогда
				
				КоличествоХватило = КоличествоОсталось;
				КоличествоНеХватило = ТекущееКоличество - КоличествоОсталось;
				
				ТекстНоменклатураМожете = ТекстНоменклатураМожете + ШаблонСтроки + КоличествоХватило + " (всего в заказе " + ТекущееКоличество + ")" + Символы.ПС;
				ТекстНоменклатураИнформируем = ТекстНоменклатураИнформируем + ШаблонСтроки + КоличествоНеХватило + Символы.ПС; 
				
				Если Оплачен Тогда
					
					НоваяСтрока = ТаблицаТоварыКРезерву.Добавить();
					НоваяСтрока.ЗаказПоставщику = ЗаказПоставщику;
					НоваяСтрока.ЗаказКлиента = Выборка.ЗаказКлиента;
					НоваяСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					НоваяСтрока.Количество = ТекущееКоличество;
					
				КонецЕсли;
				
				КоличествоОсталось = 0;
				ЕстьЗаказыДляРезерва = Истина;
				ЕстьЗаказыДляИнформирования = Истина;
				
			ИначеЕсли КоличествоОсталось = 0 Тогда
				
				ТекстНоменклатураИнформируем = ТекстНоменклатураИнформируем + ШаблонСтроки + ТекущееКоличество + Символы.ПС; 
				ЕстьЗаказыДляИнформирования = Истина;
				
			КонецЕсли;
			
			Если МассивМенеджеров.Найти(Выборка.Менеджер) = Неопределено И ЗначениеЗаполнено(Выборка.Менеджер) Тогда
				
				МассивМенеджеров.Добавить(Выборка.Менеджер);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЕстьЗаказыДляРезерва Тогда
			ТекстНоменклатураМожете = "";
		Иначе
			ТекстНоменклатураМожете = ТекстНоменклатураМожете + Символы.ПС;
		КонецЕсли;
		
		Если НЕ ЕстьЗаказыДляИнформирования Тогда
			ТекстНоменклатураИнформируем = "";
		Иначе
			ТекстНоменклатураИнформируем = ТекстНоменклатураИнформируем + Символы.ПС;
		КонецЕсли;
		
		ТекстИтог = ТекстИтог + ?(ЗначениеЗаполнено(ТекстИтог), Символы.ПС + Символы.ПС, "") + ТекстНоменклатураМожете + ТекстНоменклатураИнформируем;
		
	КонецЦикла;
	
	Если ТекстИтог = "" Тогда
		Возврат;
	КонецЕсли;
		
	МассивПользователей = Справочники.смартПредопределенныеЗначения.Настройки.ПолучателиРассылокОПланируемыхПоставкахРасходыхМатериалов.ВыгрузитьКолонку("Пользователь");
	
	МассивАдресовДляОтправки = Новый Массив;
	АдресаДляОтправкиСтрокой = "";
	
	Для Каждого Пользователь Из МассивПользователей Цикл

		МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", Пользователь.смартРабочаяПочта, Пользователь.смартРабочаяПочта));
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Пользователь.смартРабочаяПочта;
		
	КонецЦикла;
	
	АдресаМенеджеров = смартОбщегоНазначения.ПолучитьАдресаПользователей(МассивМенеджеров, АдресаДляОтправкиСтрокой);
	
	АдресаДляОтправкиУникальные = Новый Массив;
	Индекс = МассивАдресовДляОтправки.Количество() - 1;
	
	Пока Индекс >= 0 Цикл
		
		ТекСтруктура = МассивАдресовДляОтправки[Индекс];
		ТекАдрес = ТекСтруктура.Адрес;
		Если АдресаДляОтправкиУникальные.Найти(ТекАдрес) = Неопределено Тогда
			АдресаДляОтправкиУникальные.Добавить(ТекАдрес);
		Иначе
			МассивАдресовДляОтправки.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Для Каждого ТекСтруктура Из АдресаМенеджеров Цикл
		
		ТекАдрес = ТекСтруктура.Адрес;
		Если АдресаДляОтправкиУникальные.Найти(ТекАдрес) = Неопределено Тогда
			АдресаДляОтправкиУникальные.Добавить(ТекАдрес);
			МассивАдресовДляОтправки.Добавить(ТекСтруктура);
		КонецЕсли;
		
	КонецЦикла;
	
	АдресаДляОтправкиСтрокой = "";
	Для Каждого ТекАдрес Из АдресаДляОтправкиУникальные Цикл
		
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ТекАдрес;
		
	КонецЦикла;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
					 
		ТемаПисьма = "Резерв по заказу поставщику №" + ЗаказПоставщикуНомер + " от " + Формат(ЗаказПоставщику.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		ТекстПисьма = ТекстИтог;
		 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		
		Попытка
			
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о возможности резерва по заказу поставщику №" + ЗаказПоставщикуНомер + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено уведомление о возможности резерва по заказу поставщику №" + ЗаказПоставщикуНомер + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		Исключение 
			
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказПоставщику,ТекстПисьма);
			ТекстСообщения = "Не удалось отправить уведомление о возможности резерва по заказу поставщику №" + ЗаказПоставщикуНомер + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
	КонецЕсли;
	
	Если ТаблицаТоварыКРезерву.Количество() > 0 Тогда
		ЗарезервироватьТоварыВЗаказахКлиентов(ТаблицаТоварыКРезерву);
	КонецЕсли;
	
КонецПроцедуры //-- #Б-3288 смарт: Фролов 14.05.2025


//++ смарт:ММ #086 362 09.12.2020 
Функция ПолучитьТекстЗапросаУведомленияПоЗаказуПоставщику()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	|	ЗаказПоставщикуТовары.Ссылка.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_НоменклатураЗаказПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	// ++ 21.12.2020
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураСправочник.Ссылка
	// --
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	// ++ 21.12.2020
	|	И НоменклатураСправочник.Ссылка В ИЕРАРХИИ (&ГруппыНоменклатуры)
	// --
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Ссылка.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикОтгрузкиТоваров.Номенклатура КАК Номенклатура,
	|	ГрафикОтгрузкиТоваров.КоличествоНеобеспечено КАК КоличествоНеобеспеченоОстаток,
	|	ВЫРАЗИТЬ(ГрафикОтгрузкиТоваров.Регистратор КАК Документ.ЗаказКлиента) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_НоменклатураПоЗаказамКлиентов
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров КАК ГрафикОтгрузкиТоваров
	|ГДЕ
	|	ГрафикОтгрузкиТоваров.Активность
	|	И (ГрафикОтгрузкиТоваров.Номенклатура, ВЫРАЗИТЬ(ГрафикОтгрузкиТоваров.Регистратор КАК Документ.ЗаказКлиента).Организация) В 
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура, 
	|				ВТ.Организация КАК Организация
	|			ИЗ
	|				ВТ_НоменклатураЗаказПоставщику КАК ВТ)
	|	И ГрафикОтгрузкиТоваров.Регистратор ССЫЛКА Документ.ЗаказКлиента
	|	И ГрафикОтгрузкиТоваров.КоличествоНеобеспечено <> 0
	// ++ 21.12.2020
	|	И ВЫРАЗИТЬ(ГрафикОтгрузкиТоваров.Регистратор КАК Документ.ЗаказКлиента).Дата >= &ДатаОтбораЗаказовКлиентов
	// --
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЗаказыКлиентов.Регистратор КАК ЗаказКлиента,
	|	ВЫБОР
	|		КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты = 100
	|			ТОГДА ""оплачен полностью""
	|		КОГДА ЕСТЬNULL(ЗаказКлиентаДок.смартДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""оплачен полностью""
	|		КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты = 0
	|			ТОГДА ""не оплачен""
	|		ИНАЧЕ ""частично оплачен""
	|	КОНЕЦ КАК Состояние,
	|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты
	|ПОМЕСТИТЬ ВТ_ПроцентОплатыЗаказов
	|ИЗ
	|	ВТ_НоменклатураПоЗаказамКлиентов КАК ВТ_ЗаказыКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ПО ВТ_ЗаказыКлиентов.Регистратор = ЗаказКлиентаДок.Ссылка
	|			И ЗаказКлиентаДок.смартДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ВТ_ЗаказыКлиентов.Регистратор = СостоянияЗаказовКлиентов.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПроцентОплатыЗаказов.ЗаказКлиента КАК ЗаказКлиента,
	//|	МИНИМУМ(ЕСТЬNULL(РасчетыСКлиентамиПланОплат.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОплаты
	|	ВЫБОР 
	|		КОГДА МИНИМУМ(ЗаказКлиентаДок.смартДатаОплаты) < МИНИМУМ(ЕСТЬNULL(РасчетыСКлиентамиПланОплат.Период, ДАТАВРЕМЯ(1, 1, 1)))
	|			ТОГДА МИНИМУМ(ЗаказКлиентаДок.смартДатаОплаты)
	|		КОГДА МИНИМУМ(ЕСТЬNULL(РасчетыСКлиентамиПланОплат.Период, ДАТАВРЕМЯ(1, 1, 1))) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА МИНИМУМ(ЗаказКлиентаДок.смартДатаОплаты)
	|		ИНАЧЕ МИНИМУМ(ЕСТЬNULL(РасчетыСКлиентамиПланОплат.Период, ДАТАВРЕМЯ(1, 1, 1)))
	|	КОНЕЦ КАК ДатаОплаты
	|ПОМЕСТИТЬ ВТ_ПервыеДатыОплатыЗаказов
	|ИЗ
	|	ВТ_ПроцентОплатыЗаказов КАК ВТ_ПроцентОплатыЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		    ПО ВТ_ПроцентОплатыЗаказов.ЗаказКлиента = ЗаказКлиентаДок.Ссылка
	|		    И ЗаказКлиентаДок.смартДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПланОплат КАК РасчетыСКлиентамиПланОплат
	|		ПО (ВТ_ПроцентОплатыЗаказов.ЗаказКлиента = (ВЫРАЗИТЬ(РасчетыСКлиентамиПланОплат.ОбъектРасчетов КАК Документ.ЗаказКлиента)))
	|			И (ВЫБОР
	|				КОГДА РасчетыСКлиентамиПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И РасчетыСКлиентамиПланОплат.Оплачено <> 0
	|					ТОГДА ИСТИНА
	|				КОГДА РасчетыСКлиентамиПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И РасчетыСКлиентамиПланОплат.КОплате <> 0
	|						И РасчетыСКлиентамиПланОплат.ВариантОплаты <> ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.ПустаяСсылка)
	|						И НЕ РасчетыСКлиентамиПланОплат.ДокументРегистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	//|	ВТ_ПроцентОплатыЗаказов.ПроцентОплаты <> 0
	|	ВТ_ПроцентОплатыЗаказов.Состояние <> ""не оплачен""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПроцентОплатыЗаказов.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураПоЗаказамКлиентов.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураЗаказПоставщику.Количество КАК Количество,
	|	ВТ_НоменклатураПоЗаказамКлиентов.Регистратор КАК ЗаказКлиента,
	|	ЗаказКлиентаДок.Дата КАК ДатаЗаказа,
	|	ЕСТЬNULL(ВТ_ПроцентОплатыЗаказов.Состояние, """") КАК Состояние,
	|	ЕСТЬNULL(ВТ_ПервыеДатыОплатыЗаказов.ДатаОплаты, ДАТАВРЕМЯ(3999, 1, 1)) КАК ДатаОплаты,
	|	ВТ_НоменклатураПоЗаказамКлиентов.КоличествоНеобеспеченоОстаток КАК КоличествоЗаказКлиента,
	//++ #Б-1080 смарт: Лопато 07.03.2025 //Добавить доп текст в оповещения (продолжение задачи 1600) (ИТСМ 1622)  
	|	ЗаказКлиентаДок.Контрагент КАК Контрагент,
	//-- #Б-1080 смарт: Лопато 07.03.2025
	|	ЗаказКлиентаДок.Менеджер КАК Менеджер,
	|	ЗаказКлиентаДок.Номер КАК Номер
	|ИЗ
	|	ВТ_НоменклатураПоЗаказамКлиентов КАК ВТ_НоменклатураПоЗаказамКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентОплатыЗаказов КАК ВТ_ПроцентОплатыЗаказов
	|		ПО ВТ_НоменклатураПоЗаказамКлиентов.Регистратор = ВТ_ПроцентОплатыЗаказов.ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервыеДатыОплатыЗаказов КАК ВТ_ПервыеДатыОплатыЗаказов
	|		ПО ВТ_НоменклатураПоЗаказамКлиентов.Регистратор = ВТ_ПервыеДатыОплатыЗаказов.ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ПО ВТ_НоменклатураПоЗаказамКлиентов.Регистратор = ЗаказКлиентаДок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатураЗаказПоставщику КАК ВТ_НоменклатураЗаказПоставщику
	|		ПО (ВТ_НоменклатураЗаказПоставщику.Номенклатура = ВТ_НоменклатураПоЗаказамКлиентов.Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты,
	|	ДатаЗаказа
	|ИТОГИ
	|	МАКСИМУМ(Количество)
	|ПО
	|	Номенклатура";
	
	Возврат ТекстЗапроса;
	
КонецФункции //-- смарт:ММ 09.12.2020

//++ смарт:ММ #086 362 14.12.2020 
Процедура ОтправитьУведомленияПоЗаказуПоставщикуМенеджеруПредзаказа(Параметры, Адрес) Экспорт

	// Получатели: менеджер из предзаказа поставщику
	
	ОбщегоНазначенияБТС.Пауза(5);

	ИмяСобытияЖР = "смартОтправкаУведомленияПоЗаказуПоставщикуМенеджеруПредзаказа";
	
	ЗаказПоставщику = Параметры.ЗаказПоставщику;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат;
	КонецЕсли;
	
	Предзаказ = ЗаказПоставщику.ДокументОснование;
	МенеджерПредзаказа = Предзаказ.Менеджер;
	ЗаказПоставщикуНомер = ЗаказПоставщику.Номер;
	ПредзаказНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Предзаказ.Номер);
	
	Если НЕ ЗначениеЗаполнено(МенеджерПредзаказа) Тогда
		Возврат;
	КонецЕсли;
	
	АдресаДляОтправкиСтрокой = "";
	
	МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(МенеджерПредзаказа, АдресаДляОтправкиСтрокой);
		
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
					 
		ТемаПисьма = "Предзаказ поставщику №" + ПредзаказНомер + " от " + Формат(Предзаказ.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		ТекстПисьма = "По предзаказу №" + ПредзаказНомер + " создан заказ поставщику №" + ЗаказПоставщикуНомер + ", в состав которого входит:" + Символы.ПС;
		НоменклатураТекст = "";
		
		Для Каждого СтрокаТовар Из ЗаказПоставщику.Товары Цикл
			ТекСтрока = СтрокаТовар.Номенклатура.Артикул + " " + СтрокаТовар.Номенклатура.Наименование + ", кол-во: " + СтрокаТовар.Количество;
			НоменклатураТекст = НоменклатураТекст + ?(ЗначениеЗаполнено(НоменклатураТекст), Символы.ПС, "") + ТекСтрока;			
		КонецЦикла;
		
		ТекстПисьма = ТекстПисьма + НоменклатураТекст;		
		 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление менеджеру предзаказа поставщику №" + ПредзаказНомер + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено уведомление менеджеру предзаказа поставщику №" + ПредзаказНомер + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение  
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказПоставщику,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить уведомление менеджеру предзаказа поставщику №" + ПредзаказНомер + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 14.12.2020

//++ смарт:ММ #044 224 20.12.2020 - Заявка на гарантийный ремонт  
Процедура ОтправитьУведомлениеОНесоответствииПоступившегоКоличества(ТекстНесоответствиеКоличества)
	
	Если ТекстНесоответствиеКоличества <> "" Тогда
		Возврат;
	КонецЕсли;

	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейСообщенийОбОшибках(АдресаДляОтправкиСтрокой);
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) 
	//	И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда

	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
	
		
		ТемаПисьма = "Несоответствие принятого количества по заявкам на гарантийный ремонт"; 
		ТекстПисьма = "При изменении статуса на получено от поставщика обнаружено несоответствие количества: " + Символы.ПС + ТекстНесоответствиеКоличества;
								 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Если ЭтоТестоваяБаза Тогда
			ТестовыеАдреса = ПараметрыПисьма.ТестовыеАдреса;
		КонецЕсли;
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ЭтоТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о несоответствии принятого количества заявке на гарантийный ремонт (на ТЕСТОВУЮ почту " + ТестовыеАдреса + ". В рабочей отправилось бы на " + АдресаДляОтправкиСтрокой + ")";
			Иначе	
				ТекстСообщения = "Отправлено уведомление о несоответствии принятого количества заявке на гарантийный ремонт (на почту " +  АдресаДляОтправкиСтрокой + ")";
			КонецЕсли;
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение
			Если ЭтоТестоваяБаза Тогда
				ТекстСообщения = "Не удалось отправить уведомление о несоответствии принятого количества заявке на гарантийный ремонт на ТЕСТОВУЮ ПОЧТУ " + ТестовыеАдреса + Символы.ПС + ОписаниеОшибки();
			Иначе
				ТекстСообщения = "Не удалось отправить уведомление о несоответствии принятого количества заявке на гарантийный ремонт" + Символы.ПС + ОписаниеОшибки();
			КонецЕсли; 
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 20.12.2020

//++ смарт:ММ #088 428 23.12.2020 - Рассылка при проведении Приобретения дополнительных услуг и прочих активов
Процедура смартОповещениеОСозданииДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеУслугПрочихАктивов") Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") = Истина
			И Источник.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("ДокументСсылка", Источник.Ссылка);
			
			ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ОтправитьУведомленияОСозданииПриобретенияУслугПрочихАктивов", ПараметрыПроцедуры, ПараметрыВыполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 23.12.2020

//++ смарт:ММ #088 428 23.12.2020 - Рассылка при проведении Приобретения дополнительных услуг и прочих активов
Процедура ОтправитьУведомленияОСозданииПриобретенияУслугПрочихАктивов(Параметры, Адрес) Экспорт

	ОбщегоНазначенияБТС.Пауза(5);

	ИмяСобытияЖР = "смартОтправкаУведомленияОСозданииПриобретенияУслугПрочихАктивов";
	
	ДокументСсылка = Параметры.ДокументСсылка;
	
	АдресаДляОтправкиСтрокой = "";
	СсылкаПредопределнноеЗначение = Справочники.смартПредопределенныеЗначения.ПользователиДляУведомленийОСозданииПриобретенияУслугПоИмпорту;	
	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаПредопределнноеЗначение, АдресаДляОтправкиСтрокой, Истина);

	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) 
	//	И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021

		НомерДокумента = ДокументСсылка.Номер;
		
		ТемаПисьма = "Создан новый документ Приобретение услуг и прочих активов №" + НомерДокумента + " от " + Формат(ДокументСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		ТекстПисьма = "В УТ создан документ Приобретение услуг и прочих активов №" + НомерДокумента + " от " + Формат(ДокументСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'") + " Контрагент " + ДокументСсылка.Контрагент + ", " + ДокументСсылка.Контрагент.ИНН;
				 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о создании Приобретения услуг и прочих активов №" + НомерДокумента + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено уведомление о создании Приобретения услуг и прочих активов №" + НомерДокумента + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение 
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокументСсылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			ТекстСообщения = "Не удалось отправить уведомление о создании Приобретения дополнительных услуг и прочих активов №" + НомерДокумента + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 23.12.2020

//++ смарт:ММ #089 415 23.12.2020 - Оповещения при создании номенклатуры
Процедура смартОповещенияОСозданииЭлементаСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") = Истина
			И Источник.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
			
			// При создании новой номенклатуры надо отправлять уведомление ответственному за дополнение, если:
			// текущий пользователь (кто создал) - смарт предопределенный ПользовательОтветственныйЗаСозданиеНоменклатуры 
			
			ПользовательОтветственныйЗаСозданиеНоменклатуры = Справочники.смартПредопределенныеЗначения.ПользовательОтветственныйЗаСозданиеНоменклатуры.Значение;
			ПользовательОтветственныйЗаДополнениеНоменклатуры = Справочники.смартПредопределенныеЗначения.ПользовательОтветственныйЗаДополнениеНоменклатуры.Значение;
			
			Если ЗначениеЗаполнено(ПользовательОтветственныйЗаСозданиеНоменклатуры)
				И ЗначениеЗаполнено(ПользовательОтветственныйЗаДополнениеНоменклатуры) 
				И ТипЗнч(ПользовательОтветственныйЗаСозданиеНоменклатуры) = Тип("СправочникСсылка.Пользователи")
				И ТипЗнч(ПользовательОтветственныйЗаДополнениеНоменклатуры) = Тип("СправочникСсылка.Пользователи")
				Тогда
				
				Если ПараметрыСеанса.ТекущийПользователь = ПользовательОтветственныйЗаСозданиеНоменклатуры Тогда
					ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
					ПараметрыПроцедуры = Новый Структура();
					ПараметрыПроцедуры.Вставить("СправочникСсылка", Источник.Ссылка);
					ПараметрыПроцедуры.Вставить("Получатель", ПользовательОтветственныйЗаДополнениеНоменклатуры);
					ПараметрыПроцедуры.Вставить("Ответственный", ПользовательОтветственныйЗаСозданиеНоменклатуры);
					
					ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ОтправитьУведомленияОСозданииНоменклатуры", ПараметрыПроцедуры, ПараметрыВыполнения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 23.12.2020

//++ смарт:ММ #089 415 24.12.2020 - Оповещения при создании номенклатуры
Процедура ОтправитьУведомленияОСозданииНоменклатуры(Параметры, Адрес) Экспорт

	ОбщегоНазначенияБТС.Пауза(5);

	ИмяСобытияЖР = "смартОтправкаУведомленияОСозданииНоменклатуры";
	
	СправочникСсылка = Параметры.СправочникСсылка;
	Получатель = Параметры.Получатель;
	Ответственный = Параметры.Ответственный;
	
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(Получатель, АдресаДляОтправкиСтрокой);

	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) 
	//	И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
				
		ТемаПисьма = "Создана новая номенклатура " + СправочникСсылка;
		
		ТекстПисьма = "Создана новая номенклатура " + СправочникСсылка + ", артикул " + СправочникСсылка.Артикул + "." + Символы.ПС
		+ "По регламенту необходимо дозаполнить следующие сведения:" + Символы.ПС 
		+ "- сегмент для дилерских скидок" + Символы.ПС
		+ "- совместные продажи" + Символы.ПС
		+ "- цены";
				 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о создании номенклатуры " + СправочникСсылка + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено уведомление о создании номенклатуры " + СправочникСсылка + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение 
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			ТекстСообщения = "Не удалось отправить уведомление о создании номенклатуры" + СправочникСсылка + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		СоздаватьЗадачу = Справочники.смартПредопределенныеЗначения.СоздаватьЗадачу.Значение;
		
		Если ТипЗнч(СоздаватьЗадачу) = Тип("Булево") 
			И СоздаватьЗадачу = Истина Тогда
			
			ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
			ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
			ЗадачаОбъект.Исполнитель = Получатель;
			ЗадачаОбъект.Предмет = СправочникСсылка;
			
			ЗадачаОбъект.Описание = "Дозаполнить номенклатуру";
			ЗадачаОбъект.Наименование = "Дозаполнить номенклатуру";
			ЗадачаОбъект.Автор = Ответственный;
			ЗадачаОбъект.СрокИсполнения = ЗадачаОбъект.Дата + 86400;
			ЗадачаОбъект.Записать();

			БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(ЗадачаОбъект.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 24.12.2020

//++ смарт:ММ #082 397 24.12.2020 - Выгрузка при создании оборудования 
Процедура смартОбработкаСозданияНовогоЭлементаСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	//++ смарт:Белоусова 610 27.08.2021
	
	//Если ТипЗнч(Источник) = Тип("СправочникОбъект.смартОборудованиеКлиентов") Тогда
	//	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") = Истина
	//		И Источник.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
	//		
	//		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	//		ПараметрыПроцедуры = Новый Структура();
	//		
	//		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ВыгрузитьОборудованиеJSON", ПараметрыПроцедуры, ПараметрыВыполнения);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	//-- смарт:Белоусова 610 27.08.2021
	
КонецПроцедуры //-- смарт:ММ 24.12.2020

//++ смарт:ММ #082 397 24.12.2020 - Выгрузка при создании оборудования
Процедура ВыгрузитьОборудованиеJSON(Параметры, Адрес) Экспорт

	ОбщегоНазначенияБТС.Пауза(5);
	
	ОтправлятьФайлыНаЭлПочту = Истина;
	СохранятьНаFTP = Ложь; //rnp 594 16.08.2021
	смартОбщегоНазначения.ВыгрузитьОборудованиеВJSON(ОтправлятьФайлыНаЭлПочту, СохранятьНаFTP);
		
КонецПроцедуры //-- смарт:ММ 24.12.2020


//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры  смартКонфигурацииЧернил  
Процедура смартОбработкаСозданияНовогоЭлементаПриЗаписи(Источник, Отказ) Экспорт
	
	//++ смарт:Белоусова 610 27.08.2021

	//Если ТипЗнч(Источник) = Тип("СправочникОбъект.смартРастровыеПроцессоры") Тогда
	//	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") = Истина
	//		И Источник.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
	//		
	//		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	//		ПараметрыПроцедуры = Новый Структура();
	//		
	//		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ВыгрузитьсмартРастровыеПроцессорыJSON", ПараметрыПроцедуры, ПараметрыВыполнения);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//Если ТипЗнч(Источник) = Тип("СправочникОбъект.смартКонфигурацииЧернил") Тогда
	//	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") = Истина
	//		И Источник.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
	//		
	//		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	//		ПараметрыПроцедуры = Новый Структура();
	//		
	//		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбработкаПодписокНаСобытия.ВыгрузитьсмартКонфигурацииЧернилJSON", ПараметрыПроцедуры, ПараметрыВыполнения);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	//-- смарт:Белоусова 610 27.08.2021

КонецПроцедуры 

//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры  
Процедура ВыгрузитьсмартРастровыеПроцессорыJSON(Параметры, Адрес) Экспорт

	ОбщегоНазначенияБТС.Пауза(5);
	
	ОтправлятьФайлыНаЭлПочту = Истина;
	СохранятьНаFTP = Ложь; //rnp 594 16.08.2021
	смартОбщегоНазначения.ВыгрузитьсмартРастровыеПроцессорыJSON(ОтправлятьФайлыНаЭлПочту, СохранятьНаFTP);
		
КонецПроцедуры 
 

//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартКонфигурации чернил  
Процедура ВыгрузитьсмартКонфигурацииЧернилJSON(Параметры, Адрес) Экспорт

	ОбщегоНазначенияБТС.Пауза(5);
	
	ОтправлятьФайлыНаЭлПочту = Истина;
	СохранятьНаFTP = Ложь; //rnp 594 16.08.2021
	смартОбщегоНазначения.ВыгрузитьсмартКонфигурацииЧернилJSON(ОтправлятьФайлыНаЭлПочту, СохранятьНаFTP);
		
КонецПроцедуры 

//++ смарт:ММ #090 436 29.12.2020 - Фоновое изменение заявки на пусконаладку при изменении заказа клиента
Процедура ИзменитьЗаявкуНаПусконаладкуПоЗаказуКлиента(Параметры, Адрес) Экспорт

	ИмяСобытияЖР = "смартФоновоеИзменениеЗаявкиНаПусконаладку";
	
	ОбщегоНазначенияБТС.Пауза(5);
	
	ДокументСсылка = Параметры.ДокументСсылка;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаПускоНаладку.Ссылка КАК ЗаявкаНаПусконаладку,
	|	смартЗаявкаНаПускоНаладку.Номер КАК Номер,
	|	смартЗаявкаНаПускоНаладку.Дата КАК Дата,
	|	смартЗаявкаНаПускоНаладку.ДокументОснование КАК ЗаказКлиента,
	|	смартЗаявкаНаПускоНаладку.Организация КАК Организация,
	|	смартЗаявкаНаПускоНаладку.Партнер КАК Партнер,
	|	смартЗаявкаНаПускоНаладку.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Номер КАК ЗаказКлиентаНомер,
	|	ЗаказКлиента.Дата КАК ЗаказКлиентаДата,
	|	ЗаказКлиента.Контрагент КАК ЗаказКлиентаКонтрагент,
	|	ЗаказКлиента.Партнер КАК ЗаказКлиентаПартнер,
	|	ЗаказКлиента.Организация КАК ЗаказКлиентаОрганизация,
	|	ЗаказКлиента.КонтактноеЛицо КАК ЗаказКлиентаКонтактноеЛицо
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку КАК смартЗаявкаНаПускоНаладку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО смартЗаявкаНаПускоНаладку.ДокументОснование = ЗаказКлиента.Ссылка
	|ГДЕ
	|	смартЗаявкаНаПускоНаладку.ДокументОснование = &ДокументОснование
	|	И НЕ смартЗаявкаНаПускоНаладку.ПометкаУдаления
	|	И смартЗаявкаНаПускоНаладку.Статус <> &СтатусЗакрыта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Серия КАК Серия,
	|	смартЗаявкаНаПускоНаладкуОборудование.Оборудование КАК Оборудование
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК смартЗаявкаНаПускоНаладкуОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО смартЗаявкаНаПускоНаладкуОборудование.Оборудование = ЗаказКлиентаТовары.Номенклатура
	|			И смартЗаявкаНаПускоНаладкуОборудование.Серия = ЗаказКлиентаТовары.Серия
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ДокументОснование
	|	И НЕ смартЗаявкаНаПускоНаладкуОборудование.Ссылка.ПометкаУдаления
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.Статус = &СтатусЗакрыта
	|	И ЗаказКлиентаТовары.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартЗаявкаНаПускоНаладкуОборудование.НомерСтроки УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	Запрос.УстановитьПараметр("СтатусЗакрыта", Перечисления.смартСтатусыЗаявокНаПускоНаладку.Размещена); //автоматически изменяем только еще не принятые в работу заявки
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаСтрокиКУдалению = Результат[Результат.Количество() - 1].Выбрать();
	Выборка = Результат[Результат.Количество() - 2].Выбрать();
	
	БылиИзменения = Ложь;
	ТекстСообщения = "";
	ТекстСообщенияДоп = "";
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.ЗаявкаНаПусконаладку.ПолучитьОбъект();
		ЗаказКлиентаСсылка = Выборка.ЗаказКлиента;
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументСсылка.Номер);
		
		ТекстСообщения = "Изменена заявка на пусконаладку №" + НомерДокумента + " от " + Формат(Выборка.Дата, "ДФ='dd.MM.yyyy ""г.""'") 
		+ ", т.к. был изменен заказ клиента №" + Выборка.ЗаказКлиентаНомер + " от " + Формат(Выборка.ЗаказКлиентаДата, "ДФ='dd.MM.yyyy ""г.""'") 
		+ Символы.ПС + "Изменения:" + Символы.ПС;
		
		ИзмененныеРеквизиты = "";
		//организация
		Если Выборка.ЗаказКлиентаОрганизация <> Выборка.Организация Тогда
			ИзмененныеРеквизиты = "Организация";
			ДокОбъект.Организация = Выборка.ЗаказКлиентаОрганизация;
			БылиИзменения = Истина;
		КонецЕсли;
		
		//++ смарт:ММ #093 449 05.02.2021 - Доработка Заявки на ПНР
		Если НЕ ДокОбъект.ИзменитьКонтрагентаИКлиентаВРучномРежиме Тогда
			//-- смарт:ММ 05.02.2021
			
			//партнер
			ИзменилсяПартнер = Ложь;
			Если Выборка.ЗаказКлиентаПартнер <> Выборка.Партнер Тогда
				ИзменилсяПартнер = Истина;
				ИзмененныеРеквизиты = ИзмененныеРеквизиты + ?(ЗначениеЗаполнено(ИзмененныеРеквизиты), Символы.ПС, "") + "- Партнер";
				ДокОбъект.Партнер = Выборка.ЗаказКлиентаПартнер;
				БылиИзменения = Истина;
			КонецЕсли;
			
			//контрагент
			ИзменилсяКонтрагент = Ложь;
			Если Выборка.ЗаказКлиентаКонтрагент <> Выборка.Контрагент Тогда
				
				ИзменилсяКонтрагент = Истина;
				
				ИзмененныеРеквизиты = ИзмененныеРеквизиты + ?(ЗначениеЗаполнено(ИзмененныеРеквизиты), Символы.ПС, "") + "- Контрагент";
				ДокОбъект.Контрагент = Выборка.ЗаказКлиентаКонтрагент;
				
				ДокОбъект.ЗаполнитьРеквизитыПоКонтрагенту();
				
				Если ДокОбъект.АдресВыезда <> Выборка.ЗаявкаНаПусконаладку.АдресВыезда Тогда
					ИзмененныеРеквизиты = ИзмененныеРеквизиты + ?(ЗначениеЗаполнено(ИзмененныеРеквизиты), Символы.ПС, "") + "- Адрес выезда";	
				КонецЕсли;
				
				Если ДокОбъект.НомерТелефонаКонтрагента <> Выборка.ЗаявкаНаПусконаладку.НомерТелефонаКонтрагента Тогда
					ИзмененныеРеквизиты = ИзмененныеРеквизиты + ?(ЗначениеЗаполнено(ИзмененныеРеквизиты), Символы.ПС, "") + "- Номер телефона контрагента";	
				КонецЕсли;
				
				БылиИзменения = Истина;
			КонецЕсли;
		
			// Контактные лица
			КонтактноеЛицо = Выборка.ЗаказКлиентаКонтактноеЛицо;
			
			ИзменилосьКонтактноеЛицо = Ложь;
			//смарт rnp 497 13.04.2021  контактное лицо меняем только если изменился партнер 
			Если ЗначениеЗаполнено(КонтактноеЛицо) И ИзменилсяПартнер Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("КонтактноеЛицо", КонтактноеЛицо);
				НайденныеСтроки = ДокОбъект.КонтактныеЛица.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					Если ДокОбъект.КонтактныеЛица.Количество() = 1 Тогда
						// Если в документе одна строка с контактным лицом и оно не совпало, то подменяется на КЛ из Заказа клиента
						СтрокаКИ = ДокОбъект.КонтактныеЛица[0];
						СтрокаКИ.КонтактноеЛицо = КонтактноеЛицо;
						СтруктураДанныеКонтактногоЛица = ДокОбъект.ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо);			
						СтрокаКИ.ТелефонКонтактногоЛица = СтруктураДанныеКонтактногоЛица.Телефон;
						СтрокаКИ.АдресЭПКонтактногоЛица = СтруктураДанныеКонтактногоЛица.ЭлПочта;
						
						ИзменилосьКонтактноеЛицо = Истина;
						
					Иначе
						// Контактного лица из заказа клиента нет в заявке на пусконаладку, но есть несколько других строк.
						Если ИзменилсяКонтрагент Тогда
							
							ДокОбъект.КонтактныеЛица.Очистить();
							СтрокаКИ = ДокОбъект.КонтактныеЛица.Добавить();
							СтрокаКИ.КонтактноеЛицо = КонтактноеЛицо;
							СтруктураДанныеКонтактногоЛица = ДокОбъект.ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо);			
							СтрокаКИ.ТелефонКонтактногоЛица = СтруктураДанныеКонтактногоЛица.Телефон;
							СтрокаКИ.АдресЭПКонтактногоЛица = СтруктураДанныеКонтактногоЛица.ЭлПочта;
							ИзменилосьКонтактноеЛицо = Истина;
						КонецЕсли;
						
					КонецЕсли;			
				КонецЕсли;
			Иначе
				Если ИзменилсяПартнер Тогда
					ДокОбъект.КонтактныеЛица.Очистить();
					ИзменилосьКонтактноеЛицо = Истина;	
				КонецЕсли;
			КонецЕсли;
			
			Если ИзменилосьКонтактноеЛицо Тогда
				БылиИзменения = Истина;
				ИзмененныеРеквизиты = ИзмененныеРеквизиты + ?(ЗначениеЗаполнено(ИзмененныеРеквизиты), Символы.ПС, "") + "- Контактное лицо";
			КонецЕсли;
			
		//++ смарт:ММ #093 449 05.02.2021 - Доработка Заявки на ПНР
		КонецЕсли;
		//-- смарт:ММ 05.02.2021
	
		// Оборудование
		
		ИзменялосьОборудование = Ложь;
		
		// 1. Удаление из заявки на пусконаладку номенклатуры, которой нет в заказе клиента
		
		ВыборкаСтрокиКУдалению.Сбросить();
		СтруктурПоиска = Новый Структура("Ссылка", Выборка.ЗаявкаНаПусконаладку); 
		Пока ВыборкаСтрокиКУдалению.НайтиСледующий(СтруктурПоиска) Цикл
			ДокОбъект.Оборудование.Удалить(ВыборкаСтрокиКУдалению.НомерСтроки - 1);
	        ИзменялосьОборудование = Истина;
		КонецЦикла;	
		
		// 2. Изменение существующих и добавление новых записей по оборудованию
		
		ТоварыПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
		ГарантийныйСрокНаОборудование = Справочники.смартПредопределенныеЗначения.ГарантийныйСрокНаОборудованиеПоУмолчанию.Значение;		
		ГарантийныйСрокНаПечатающиеГоловки = Справочники.смартПредопределенныеЗначения.ГарантийныйСрокНаПечатающиеГоловкиПоУмолчанию.Значение;
		РастровыйПроцессор = Справочники.смартПредопределенныеЗначения.РастровыйПроцессорПоУмолчанию.Значение;

		ЗапросОборудование = Новый Запрос;
		ЗапросОборудование.Текст = ДокОбъект.ПолучитьТекстЗапросаОборудованиеИзЗаказаКлиента();
		ЗапросОборудование.УстановитьПараметр("ТоварПлоттерыСерии", ТоварыПлоттерыСерии);
		ЗапросОборудование.УстановитьПараметр("ЗаказКлиента", ЗаказКлиентаСсылка);
		ЗапросОборудование.УстановитьПараметр("ОтборНоменклатура", Ложь);
		ЗапросОборудование.УстановитьПараметр("Номенклатура", Неопределено);
		
		ВыборкаТовары = ЗапросОборудование.Выполнить().Выбрать();
				
		Пока ВыборкаТовары.Следующий() Цикл
						
			Отбор = Новый Структура;
			Отбор.Вставить("Оборудование", ВыборкаТовары.Номенклатура);
			//Отбор.Вставить("Серия", ВыборкаТовары.Серия); //смарт rnp 497 13.04.2021, закомментировано, иначе добавляется строка в заявку, если по серии не нашлось оборудование (в момент, когда в заказе указали серию)
			НайденныеСтроки = ДокОбъект.Оборудование.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				
				СтрокаОборудование = НайденныеСтроки[0];
				Если ВыборкаТовары.Отменено Тогда
					// Удалить строку из заявки на пусконаладку
					ДокОбъект.Оборудование.Удалить(СтрокаОборудование);
					ИзменялосьОборудование = Истина;
				Иначе
					Если НачалоДня(СтрокаОборудование.ДатаОтгрузки) <> НачалоДня(ВыборкаТовары.ДатаОтгрузки) Тогда					
						СтрокаОборудование.ДатаОтгрузки = ВыборкаТовары.ДатаОтгрузки;
						ИзменялосьОборудование = Истина;
					КонецЕсли;
					Если СтрокаОборудование.Серия <> ВыборкаТовары.Серия Тогда
						СтрокаОборудование.Серия = ВыборкаТовары.Серия;
						ИзменялосьОборудование = Истина;
					КонецЕсли;					
				КонецЕсли;
			ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
				//смарт rnp 497 13.04.2021
				//!!! доделать если в заявке на ПНР несколько строк с одинаковым оборудованием, надо запомнить, какую строку уже автоматически изменили выше
				ТекстСообщенияДоп = ". В заявке на пусконаладку присутствуют строки с одинаковым оборудованием! Проверьте правильность заполнения даты отгрузки  серийных домеров!!!";
			ИначеЕсли НайденныеСтроки.Количество() = 0 Тогда
				
				НоваяСтрока = ДокОбъект.Оборудование.Добавить();
				НоваяСтрока.Оборудование 						= ВыборкаТовары.Номенклатура;
				
				//++ #Б-2768 смарт: Лопато 21.03.2025 //Заполнение корректного срока гарантии на оборудование и ПГ при формировании ПНР.  
				СтруктураГарантияНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Оборудование, "смартГарантияНаОборудование, смартГарантияНаПечатающиеГоловки");
				
				НоваяСтрока.ГарантийныйСрокНаОборудование 		= ?(ЗначениеЗаполнено(СтруктураГарантияНоменклатуры.смартГарантияНаОборудование), 
																	СтруктураГарантияНоменклатуры.смартГарантияНаОборудование, 
																	ГарантийныйСрокНаОборудование);

				НоваяСтрока.ГарантийныйСрокНаПечатающиеГоловки	= ?(ЗначениеЗаполнено(СтруктураГарантияНоменклатуры.смартГарантияНаПечатающиеГоловки), 
																	СтруктураГарантияНоменклатуры.смартГарантияНаПечатающиеГоловки, 
																	ГарантийныйСрокНаПечатающиеГоловки);
				//-- #Б-2768 смарт: Лопато 21.03.2025
				
				НоваяСтрока.РастровыйПроцессор 					= РастровыйПроцессор;
				НоваяСтрока.ДатаОтгрузки 						= ВыборкаТовары.ДатаОтгрузки;
				НоваяСтрока.Серия 								= ВыборкаТовары.Серия;
				
				ИзменялосьОборудование = Истина;
				
			КонецЕсли;
						
		КонецЦикла;

		Если ИзменялосьОборудование Тогда
			БылиИзменения = Истина;
			ИзмененныеРеквизиты = ИзмененныеРеквизиты + ?(ЗначениеЗаполнено(ИзмененныеРеквизиты), Символы.ПС, "") + "- Оборудование";
		КонецЕсли;
				
		Если БылиИзменения Тогда
			
			ТекстСообщения = ТекстСообщения + ИзмененныеРеквизиты + ТекстСообщенияДоп;
			
			Попытка 
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ОтправитьУведомлениеМенеджеруЗаявкиНаПусконаладку(Выборка.ЗаявкаНаПусконаладку, ТекстСообщения);
			Исключение
				ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,, Выборка.ЗаявкаНаПусконаладку, "Не удалось изменить заявку на пусконаладку при изменении заказа клиента №" + Выборка.ЗаказКлиентаНомер);
			КонецПопытки;			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 29.12.2020

//++ смарт:ММ #090 436 29.12.2020 - Фоновое изменение заявки на пусконаладку при изменении заказа клиента
Процедура ОтправитьУведомлениеМенеджеруЗаявкиНаПусконаладку(ДокументСсылка, ТекстСообщения)
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСобытияЖР = "смартОтправкаУведомленияМенеджеруЗаявкиНаПусконаладку";
		
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(ДокументСсылка.Ответственный);

	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) 
	//	И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументСсылка.Номер);
		
		ТемаПисьма = "Изменение Заявки на пусконаладку" + НомерДокумента + " от " + Формат(ДокументСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		ТекстПисьма = ТекстСообщения;
				 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление об изменении заявки на пусконаладку №" + НомерДокумента + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено уведомление об изменении заявки на пусконаладку №" + НомерДокумента + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокументСсылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			ТекстСообщения = "Не удалось отправить уведомление об изменении заявки на пусконаладку №" + НомерДокумента + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 29.12.2020

//++ смарт:ММ #044 224 15.02.2021 - Заявка на гарантийный ремонт 
Процедура ДобавитьДвиженияПосмартОстаткиНаСкладеГарантийныхЗапчастей(Источник)
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
		ИмяТЧ = "Товары";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
		ВидДвижения = ВидДвиженияНакопления.Расход;
		ИмяТЧ = "ТоварыПоРаспоряжениям";
	Иначе 
		Возврат;		
	КонецЕсли;
	
	ОсновнойСкладДляЗапчастейПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	
	Если Источник.Склад <> ОсновнойСкладДляЗапчастейПодЗаказ Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
		
	ЕстьДвижения = Ложь;
	
	// ++ 18.03.2021
	Услуга = Перечисления.ТипыНоменклатуры.Услуга;
	// --
	
	Для Каждого СтрокаТовар Из Источник[ИмяТЧ] Цикл
		// ++ 18.03.2021
		//Если НЕ ЗначениеЗаполнено(СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонт) Тогда
		//	Продолжить;
		//КонецЕсли;
		Если СтрокаТовар.Номенклатура.ТипНоменклатуры = Услуга Тогда
			Продолжить;
		КонецЕсли;
		// --
			
		Движение = Источник.Движения.смартОстаткиНаСкладеГарантийныхЗапчастей.Добавить();
		Движение.ВидДвижения 	= ВидДвижения;
		Движение.Период 		= Источник.Дата;
		Движение.Номенклатура 	= СтрокаТовар.Номенклатура;
		// ++ 25.02.2021
		//Движение.НомерЗаявки 	= СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонт;
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//Если ВРег(СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонт) = "БЕЗ НОМЕРА" Тогда
		//	Движение.НомерЗаявки = "";
		//Иначе
		//	Движение.НомерЗаявки = СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонт;
		//КонецЕсли;
		// --
		Движение.НомерЗаявки = СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонтСсылка.Номер;
		Движение.Заявка = СтрокаТовар.смартНомерЗаявкиНаГарантийныйРемонтСсылка;
		//-- #Б1132 смарт: Шляпников 14.10.2024

		Движение.Количество 	= СтрокаТовар.Количество;

		ЕстьДвижения = Истина;
		
	КонецЦикла;
	
	Если ЕстьДвижения Тогда
		Источник.Движения.смартОстаткиНаСкладеГарантийныхЗапчастей.Записывать = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
			
КонецПроцедуры //-- смарт:ММ 15.02.2021

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 25.05.2021 17:52:59 Битрикс заполнение фильтров по сегментам
Процедура смартНоменклатураСегментаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Сегмент = Неопределено;
	Номенклатура = Неопределено;
	Для каждого ЭлОтбора Из Источник.Отбор Цикл
		Если ЭлОтбора.Имя="Сегмент" тогда	
			Сегмент = ЭлОтбора.Значение;
		КонецЕсли; 
	КонецЦикла;  
	Если ЗначениеЗаполнено(Сегмент) Тогда
		ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.ДобавлениеФильтровПоСегментам",Новый Структура("СсылкаСегмент,СсылкаНоменклатура,ВклУд",Сегмент,Номенклатура,Неопределено),ПараметрыВыполнения);
	КонецЕсли; 
КонецПроцедуры

//++ смарт:ММ #104 488 19.04.2021 
Процедура ЗарезервироватьТоварыВЗаказахКлиентов(ТаблицаТоварыКРезерву)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ТЗ.ЗаказКлиента КАК ЗаказКлиента,
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЗ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ТЗ.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВТ_ТЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ТЗ.Количество КАК Количество,
	|	ЗаказКлиентаДок.Склад КАК СкладЗаказКлиента,
	|	ЗаказПоставщикуДок.Склад КАК СкладЗаказПоставщику
	|ИЗ
	|	ВТ_ТЗ КАК ВТ_ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщикуДок
	|		ПО ВТ_ТЗ.ЗаказПоставщику = ЗаказПоставщикуДок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ПО ВТ_ТЗ.ЗаказКлиента = ЗаказКлиентаДок.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(СкладЗаказКлиента),
	|	МАКСИМУМ(СкладЗаказПоставщику)
	|ПО
	|	ЗаказКлиента";
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТоварыКРезерву);
	
	ВыборкаЗаказКлиента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	РезервироватьКДате = Перечисления.ВариантыОбеспечения.ИзЗаказов;
	КОбеспечению = Перечисления.ВариантыОбеспечения.Требуется;
	УстановитьПривилегированныйРежим(Истина); //rnp 01.10.2021
	Пока ВыборкаЗаказКлиента.Следующий() Цикл
		
		ДокОбъект = ВыборкаЗаказКлиента.ЗаказКлиента.ПолучитьОбъект();
		
		// 1. Подбор склада в документа Заказ клиента
		СкладЗаказПоставщику = ВыборкаЗаказКлиента.СкладЗаказПоставщику;
		СкладЗаказКлиента = ВыборкаЗаказКлиента.СкладЗаказКлиента;
		
		// Поменять склад, если он не равен складу в Заказе поставщику
		СкладДляСтрокиЗаказаКлиента = Неопределено;
		Если СкладЗаказПоставщику <> СкладЗаказКлиента Тогда
			
			Если СкладЗаказКлиента.ЭтоГруппа 
				И СкладЗаказПоставщику.ПринадлежитЭлементу(СкладЗаказКлиента) Тогда
				// Склад в Заказе клиента менять не надо
			Иначе
				Склад = ПодобратьОбщуюГруппу(СкладЗаказКлиента, СкладЗаказПоставщику);
				ДокОбъект.Склад = Склад;
				СкладДляСтрокиЗаказаКлиента = СкладЗаказПоставщику;
			КонецЕсли;					
		КонецЕсли;
			
		Выборка = ВыборкаЗаказКлиента.Выбрать();
		
		Пока Выборка.Следующий() Цикл // По номенклатуре
			ДатаОтгрузкиРезерва = Выборка.ЗаказПоставщику.ЖелаемаяДатаПоступления;//++смарт:rnp 14.10.2021 всегда ли заполнена???
			КоличествоКРезерву = Выборка.Количество;
			
			Для Каждого СтрокаТовар Из ВыборкаЗаказКлиента.ЗаказКлиента.Товары Цикл  // Обходятся товары в ссылке, а не в объекте, т.к. в теле цикла в объект могут быть добавлены новые строки
				
				Если СтрокаТовар.Отменено Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаТовар.Номенклатура <> Выборка.Номенклатура Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаТовар.ВариантОбеспечения <> КОбеспечению Тогда // Проверять только строки, которые в РН График отгрузки товаров попали в колонку "Количество необеспечено"
					Продолжить;
				КонецЕсли;				
				
				Если КоличествоКРезерву = 0 Тогда
					Прервать;
				КонецЕсли;
								
				СтрокаТоварОбъект = ДокОбъект.Товары[СтрокаТовар.НомерСтроки - 1];
				
				Если СтрокаТовар.Количество > КоличествоКРезерву Тогда
					
					// Разбить строку
					НоваяСтрока = ДокОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
					
					Хвостик = СтрокаТовар.Количество - КоличествоКРезерву; // В строке количество больше, чем надо зарезервировать
					
					НоваяСтрока.Количество = Хвостик;
					НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
					
					ПересчитатьСтрокуЗаказаКлиента(НоваяСтрока, ДокОбъект);
					
					СтрокаТоварОбъект.Количество = КоличествоКРезерву;
					СтрокаТоварОбъект.КоличествоУпаковок = СтрокаТовар.Количество;
					
					ПересчитатьСтрокуЗаказаКлиента(СтрокаТоварОбъект, ДокОбъект);
					
				КонецЕсли;
				
				КоличествоКРезерву = КоличествоКРезерву - СтрокаТоварОбъект.Количество;
				СтрокаТоварОбъект.ВариантОбеспечения = РезервироватьКДате;
				СтрокаТоварОбъект.ДатаОтгрузки = ?(ЗначениеЗаполнено(ДатаОтгрузкиРезерва),ДатаОтгрузкиРезерва, ТекущаяДата());//++смарт:rnp 14.10.2021
				Если ЗначениеЗаполнено(СкладДляСтрокиЗаказаКлиента) Тогда
					СтрокаТоварОбъект.Склад = СкладДляСтрокиЗаказаКлиента;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Попытка
			ДокОбъект.Записать();
			ОбщегоНазначения.СообщитьПользователю("Изменен статус резерва в документе " + ДокОбъект.Ссылка, ДокОбъект.Ссылка);
		Исключение
			ЗаписьЖурналаРегистрации("смартРезервированиеТовараПоЗаказуПоставщику", УровеньЖурналаРегистрации.Ошибка, ,, ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь);//rnp 01.10.2021
КонецПроцедуры //-- смарт:ММ 19.04.2021

//++ смарт:ММ #104 488 19.04.2021 
Процедура ПересчитатьСтрокуЗаказаКлиента(НоваяСтрока, ДокОбъект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокОбъект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		НоваяСтрока.Сумма,
		УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
		ДокОбъект.ЦенаВключаетНДС,
		ДокОбъект.НалогообложениеНДС);
	
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока, СтруктураДействий, Неопределено); 			
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуСУчетомРучнойСкидкиВСтрокеТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
			
КонецПроцедуры //-- смарт:ММ 19.04.2021

//++ смарт:ММ #104 488 19.04.2021 
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
		"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");
	
КонецФункции //-- смарт:ММ 19.04.2021

//++ смарт:ММ #104 488 19.04.2021 
Функция ПодобратьОбщуюГруппу(ЭлементОдин, ЭлементДва)
	
	УровеньЭлементаОдин = ЭлементОдин.Уровень();
	УровеньЭлементаДва = ЭлементДва.Уровень();
	
	ЭлементВышеУровнем = ЭлементОдин;
	ЭлементНижеУровнем = ЭлементДва;
	
	Если УровеньЭлементаОдин > УровеньЭлементаДва Тогда
		ЭлементВышеУровнем = ЭлементДва;
		ЭлементНижеУровнем = ЭлементОдин;
	КонецЕсли;
	
	Возврат НайтиОбщегоРодителяРекурсивно(ЭлементВышеУровнем, ЭлементНижеУровнем);
	
КонецФункции //-- смарт:ММ 19.04.2021

//++ смарт:ММ #104 488 19.04.2021 
Функция НайтиОбщегоРодителяРекурсивно(знач ЭлементВышеУровнем, ЭлементНижеУровнем)
	
	Если ЭлементНижеУровнем.ПринадлежитЭлементу(ЭлементВышеУровнем) Тогда
		Возврат ЭлементВышеУровнем;
	ИначеЕсли НЕ ЗначениеЗаполнено(ЭлементВышеУровнем.Родитель) Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайтиОбщегоРодителяРекурсивно(ЭлементВышеУровнем.Родитель, ЭлементНижеУровнем);
	КонецЕсли;
	
КонецФункции //-- смарт:ММ 19.04.2021

//++ смарт:ММ #104 488 30.06.2021
Процедура ЗарезервироватьТоварПоЗаказуКлиента(ПоступлениеБезналичныхОбъект)
	
	Настройка = Справочники.смартПредопределенныеЗначения.КоличествоМесяцевАктуальностиЗаказаКлиентаДляРезерва;
	КоличествоМесяцевАктуальности = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
	Если Не ЗначениеЗаполнено(КоличествоМесяцевАктуальности) Тогда
		КоличествоМесяцевАктуальности = 0;
	КонецЕсли;
	
	ДатаПроверки = ДобавитьМесяц(НачалоДня(ТекущаяДата()), -КоличествоМесяцевАктуальности);

	МассивЗаказовКлиента = Новый Массив;
	СтатусЗакрыт = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	
	Для Каждого СтрокаТЧ Из ПоступлениеБезналичныхОбъект.РасшифровкаПлатежа Цикл
		
		Заказ = СтрокаТЧ.Заказ;
		
		Если ТипЗнч(Заказ) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Заказ.Дата < ДатаПроверки Тогда
			Продолжить;
		КонецЕсли;
		
		Если Заказ.Статус = СтатусЗакрыт Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Заказ.Проведен Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивЗаказовКлиента.Найти(Заказ) = Неопределено Тогда
			МассивЗаказовКлиента.Добавить(Заказ);	
		КонецЕсли;
		
	КонецЦикла;
	
	РезервироватьСоСклада = Перечисления.ВариантыОбеспечения.СоСклада;
	КОбеспечению = Перечисления.ВариантыОбеспечения.Требуется;

	Для Каждого ЗаказКлиента Из МассивЗаказовКлиента Цикл
		
		ДокОбъект = ЗаказКлиента.ПолучитьОбъект();

		Для Каждого СтрокаТовар Из ДокОбъект.Товары Цикл
			Если СтрокаТовар.Отменено Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТовар.ВариантОбеспечения <> КОбеспечению Тогда 
				Продолжить;
			КонецЕсли;
			
			СтрокаТовар.ВариантОбеспечения = РезервироватьСоСклада;
			
			Попытка				
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокОбъект = ЗаказКлиента.ПолучитьОбъект();
			КонецПопытки;
			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 30.06.2021

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 11.06.2021 11:53:41- Фоновая отправка статусов заказа на сайт битрикс - задача 552
Процедура смартПриЗаписьВРегистрСтатусовПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
КонецПроцедуры

//++#1530 смарт: Лопато 27.10.2023 //Отмена напоминания при повторной записи Заявка на расходование ДС //++ смарт:ПА #815 11.12.2021 18:42:56
Процедура смартЗаявкаНаРасходованиеДСНапоминанияПриЗаписи(Источник) Экспорт
	
	ЕстьЗаписьОсновной = ПолучитьТекЗаписьНапоминания(Источник.КтоЗаявил, Источник.Ссылка);
	
	Если НЕ ЕстьЗаписьОсновной Тогда
		
		ПараметрыНапоминания = Новый Структура;
		ПараметрыНапоминания.Вставить("Пользователь",				Источник.КтоЗаявил);
		ПараметрыНапоминания.Вставить("Источник",					Источник.Ссылка);
		ПараметрыНапоминания.Вставить("Описание",					"Ошибка заполнения документа. Пожалуйста проведите корректировку! " + СокрЛП(Источник.Ссылка));
		ПараметрыНапоминания.Вставить("ВремяСобытия", 				ТекущаяДатаСеанса());
		ПараметрыНапоминания.Вставить("ИнтервалВремениНапоминания", 300);
		ПараметрыНапоминания.Вставить("Идентификатор", 				"ЗаявкаНаРасходованиеДенежныхСредств");
		
		НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания);
		
	КонецЕсли; 
	
	//Доп напоминание фин департамент
	ДопПользователь = Справочники.смартПредопределенныеЗначения.ДопПользовательНапоминания.Значение;
	
	ЕстьЗаписьДоп = ПолучитьТекЗаписьНапоминания(ДопПользователь, Источник.Ссылка);
	
	Если НЕ ЕстьЗаписьДоп И ЗначениеЗаполнено(ДопПользователь) Тогда
		
		ПараметрыНапоминания=Новый Структура;
		ПараметрыНапоминания.Вставить("Пользователь",				ДопПользователь);
		ПараметрыНапоминания.Вставить("Источник",					Источник.Ссылка);
		ПараметрыНапоминания.Вставить("Описание",					"Ошибка заполнения документа. Отправлено на корректировку инициатору! " + СокрЛП(Источник.Ссылка));
		ПараметрыНапоминания.Вставить("ВремяСобытия", 				ТекущаяДатаСеанса());
		ПараметрыНапоминания.Вставить("ИнтервалВремениНапоминания", 900);
		ПараметрыНапоминания.Вставить("Идентификатор", 				"ЗаявкаНаРасходованиеДенежныхСредств");
		
		НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания);
		
	КонецЕсли;
	
КонецПроцедуры //--#1530 смарт: Лопато 27.10.2023

//++ смарт:ПА #815 13.12.2021 10:36:27
Функция ПолучитьТекЗаписьНапоминания(Пользователь,Предмет) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   НапоминанияПользователя.Пользователь КАК Пользователь,
    |   НапоминанияПользователя.Источник КАК Источник,
    |   НапоминанияПользователя.ВремяСобытия КАК ВремяСобытия
    |ИЗ
    |   РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
    |ГДЕ
    |   НапоминанияПользователя.Пользователь = &Пользователь
    |   И НапоминанияПользователя.Источник = &Источник";
    
    Запрос.УстановитьПараметр("Источник", Предмет);
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        Возврат Истина;
    КонецЕсли;
    
    Возврат Ложь;
    
КонецФункции //-- смарт:ПА #815 13.12.2021 10:36:27

//++ смарт:Демичев №1147 22.08.2022(( 
Функция ПолучитьОбъектСчетНаОплату_Ссылку(ЗаказКлиента); 

	// Подразумевается, что на 1 Заказ 1 Счет на оплату
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СчетНаОплатуКлиенту.Ссылка КАК СчетДок,
	|	СчетНаОплатуКлиенту.Организация КАК Организация,
	|	СчетНаОплатуКлиенту.Контрагент КАК Контрагент,
	|	СчетНаОплатуКлиенту.СуммаДокумента КАК СуммаДокумента,
	|	СчетНаОплатуКлиенту.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.Контрагент КАК КонтрагентЗаказ,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокументаЗаказ,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчетЗаказ
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО СчетНаОплатуКлиенту.ДокументОснование = ЗаказКлиента.Ссылка
	|ГДЕ
	|	(ВЫРАЗИТЬ(СчетНаОплатуКлиенту.ДокументОснование КАК Документ.ЗаказКлиента)) = &ДокументОснование
	|	И ЗаказКлиента.Ссылка = &ДокументОснование
	|	И НЕ СчетНаОплатуКлиенту.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мДокСчет = Неопределено;
	
	Если Выборка.Следующий() Тогда
		
		мДокСчет = Выборка.СчетДок;
		
	КонецЕсли;
	
	Возврат мДокСчет;
	  
	  
КонецФункции

//++ смарт:Подкин #1192 23.09.2022 16:08:11
Процедура смартОповещенияПоЗаказуПоставщикуПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
    //++#1214 смарт: Лопато 10.10.2022 //Рефакторинг в связи с ошибками  
	Если НЕ смартОбщегоНазначения.смартРабочаяБаза() Тогда
		Возврат;
	КонецЕсли;
	//--#1214 смарт: Лопато 10.10.2022
        
    ПроведениеВПервыйРаз = Ложь;
    Если Источник.ДополнительныеСвойства.Свойство("смартПроводитсяВпервые") Тогда
    	ПроведениеВПервыйРаз = Источник.ДополнительныеСвойства.смартПроводитсяВпервые;
    КонецЕсли;
    
    Если ПроведениеВПервыйРаз Тогда
        Возврат;
    КонецЕсли;    
    
    Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
        ТзРазницы = смартОпределитьИзмененияВерсийОбъекта(Источник, "Номенклатура, Характеристика, Склад, ДатаПоступления, Количество"); 
        
        Если ТзРазницы.Количество() Тогда
            смартОтправитьОповещенияПоЗаказамКлиентаСбронью(ТзРазницы);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #1192 23.09.2022 16:08:11    

//++ смарт:Подкин #1192 23.09.2022 9:48:54 Нужно сделать универсальной и перенести в общий модуль
&НаСервере
Функция смартОпределитьИзмененияВерсийОбъекта(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации) Экспорт
    
    ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения = РеквизитыРегистрацииТабличнойЧастиДоИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации);
    ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения.Свернуть("Номенклатура, Характеристика, Склад, ДатаПоступления","Количество");
    ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения = РеквизитыРегистрацииТабличнойЧастиПослеИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации);
    ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения.Свернуть("Номенклатура, Характеристика, Склад, ДатаПоступления","Количество");          
    
    ТаблицаРазницы=РазницаТаблицЗначений(ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения, ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения, СтрокаТаблицыРеквизитовРегистрации);
    
    ТаблицаРазницы.Свернуть("Номенклатура, Характеристика, Склад, ДатаПоступления","Количество");
    
    Возврат ТаблицаРазницы; 
    
КонецФункции //-- смарт:Подкин # 23.09.2022 9:48:54

//++ смарт:Подкин #1192 23.09.2022 9:48:54 Нужно сделать универсальной и перенести в общий модуль
&НаСервере
Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения) Экспорт
    
    Отбор = Новый Структура(Измерения);
    
    Ресурсы = Новый Массив;
    Для ИндексКолонки = 0 По Таблица0.Колонки.Количество() - 1 Цикл
        Если НЕ Отбор.Свойство(Таблица0.Колонки[ИндексКолонки].Имя) Тогда
            Ресурсы.Добавить(ИндексКолонки)
        КонецЕсли
    КонецЦикла;
    
    Таблица1.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
    Таблица1.ЗаполнитьЗначения(1, "Знак");
    НовыйИндекс = Таблица1.Индексы.Добавить(Измерения);
    
    Разница = Таблица1.СкопироватьКолонки();
    
    Для Каждого Строка0 Из Таблица0 Цикл
        ЗаполнитьЗначенияСвойств(Отбор, Строка0); 
        Строки1 = Таблица1.НайтиСтроки(Отбор);
        Если Строки1.Количество() = 0 Тогда     
            ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка0)     
        Иначе
            Строка1 = Строки1[0];
            Для Каждого Ресурс Из Ресурсы Цикл 
                Если Строка0[Ресурс] <> Строка1[Ресурс] Тогда    
                    ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка0);
                    ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка1);
                    Прервать 
                КонецЕсли 
            КонецЦикла;
            Строка1.Знак = 0 
        КонецЕсли 
    КонецЦикла;
    
    Для Каждого Строка1 Из Таблица1.НайтиСтроки(Новый Структура("Знак", 1)) Цикл 
        ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка1); 
    КонецЦикла;
    
    Таблица1.Колонки.Удалить("Знак");
    Таблица1.Индексы.Удалить(НовыйИндекс);
        
    Возврат Разница
    
КонецФункции

//++ смарт:Подкин #1192 23.09.2022 9:48:54 Нужно сделать универсальной и перенести в общий модуль
&НаСервере
Функция РеквизитыРегистрацииТабличнойЧастиДоИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ "+ СтрокаТаблицыРеквизитовРегистрации
	+ " ИЗ Документ.ЗаказПоставщику" 
	+ ".Товары КАК ТекущийОбъектИмяТабличнойЧасти
	|ГДЕ
	|   ТекущийОбъектИмяТабличнойЧасти.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ТекОбъект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

//++ смарт:Подкин #1192 23.09.2022 9:48:54 Нужно сделать универсальной и перенести в общий модуль
&НаСервере
Функция РеквизитыРегистрацииТабличнойЧастиПослеИзменения(ТекОбъект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТаблицаРеквизитовРегистрации = ТекОбъект.Товары.Выгрузить(, СтрокаТаблицыРеквизитовРегистрации);
	
	Возврат ТаблицаРеквизитовРегистрации;
	
КонецФункции

//++ смарт:Подкин #1192 23.09.2022 9:53:44
Процедура смартОтправитьОповещенияПоЗаказамКлиентаСбронью(ТЗРазницы)  
    
    Запрос = Новый Запрос;
    
    Запрос.Текст ="ВЫБРАТЬ
    |	ТЗномен.Номенклатура КАК Номенклатура,
    |	ТЗномен.Характеристика КАК Характеристика,
    |	ТЗномен.ДатаПоступления КАК ДатаОтгрузки,
    |	ТЗномен.Склад КАК Склад
    |ПОМЕСТИТЬ ВременнаяТ
    |ИЗ
    |	&ТЗномен КАК ТЗномен
    |;
    
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ГрафикОтгрузкиТоваровОбороты.ДатаОтгрузки КАК ДатаОтгрузки,
    |	МАКСИМУМ(ВЫБОР
    |			КОГДА ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход = 0
    |				ТОГДА ГрафикОтгрузкиТоваровОбороты.КоличествоНеобеспеченоПриход
    |			ИНАЧЕ ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход
    |		КОНЕЦ) КАК КоличествоОтгрузка,
    |	ГрафикОтгрузкиТоваровОбороты.Регистратор КАК Документ,
    |	ГрафикОтгрузкиТоваровОбороты.Регистратор.Дата КАК РегистраторДата,
    |	ГрафикОтгрузкиТоваровОбороты.Номенклатура КАК Номенклатура
    |ИЗ
    |	РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
    |			,
    |			,
    |			Регистратор,
    |			(Номенклатура, Характеристика, ДатаОтгрузки, Склад) В
    |				(ВЫБРАТЬ
    |					ВременнаяТ.Номенклатура,
    |					ВременнаяТ.Характеристика,
    |					ВременнаяТ.ДатаОтгрузки,
    |					ВременнаяТ.Склад
    |				ИЗ
    |					ВременнаяТ)) КАК ГрафикОтгрузкиТоваровОбороты
    |ГДЕ
    |	ВЫБОР
    |			КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиТоваровОбороты.Регистратор) = ТИП(Документ.ЗаказКлиента)
    |				ТОГДА НЕ ГрафикОтгрузкиТоваровОбороты.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
    |			ИНАЧЕ ИСТИНА
    |		КОНЕЦ
    
    |СГРУППИРОВАТЬ ПО
    |	ГрафикОтгрузкиТоваровОбороты.ДатаОтгрузки,
    |	ГрафикОтгрузкиТоваровОбороты.Регистратор,
    |	ГрафикОтгрузкиТоваровОбороты.Регистратор.Дата,
    |	ГрафикОтгрузкиТоваровОбороты.Номенклатура
    
    |УПОРЯДОЧИТЬ ПО
    |	РегистраторДата";
    
    Запрос.УстановитьПараметр("ТЗномен",ТЗРазницы);
    РезультатЗапроса = Запрос.Выполнить(); 
    
    Если НЕ РезультатЗапроса.Пустой() Тогда
    	ТзЗапроса = РезультатЗапроса.Выгрузить();   
        ТзЗапроса.Свернуть("Документ, Номенклатура");
        смартРассылкаОповещенийИзменениеЗаказаПоставщику(ТзЗапроса);
    КонецЕсли;        
    
КонецПроцедуры //-- смарт:Подкин #1192 23.09.2022 9:53:44 

//++ смарт:Подкин #1192 23.09.2022 9:53:44
Процедура смартРассылкаОповещенийИзменениеЗаказаПоставщику(ТзЗапроса) 

	//++#1214 смарт: Лопато 10.10.2022 //Рефакторинг в связи с ошибками  
	//Копия=Ложь;
	//ИнформацияОБазе=Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить();
	//Если Не ИнформацияОБазе=Неопределено Тогда 
	//    Копия=ИнформацияОБазе.РаботаСВнешнимиРесурсамиЗаблокирована;
	//КонецЕсли;	
	Если НЕ смартОбщегоНазначения.смартРабочаяБаза() Тогда
		Возврат;
	КонецЕсли;
	//--#1214 смарт: Лопато 10.10.2022

	Для каждого Стр Из ТзЗапроса Цикл 
		Док = Стр.Документ; 
		//++#1214 смарт: Лопато 10.10.2022 //Рефакторинг в связи с ошибками  
		//Если ЗначениеЗаполнено(Док.Менеджер) Тогда
		//--#1214 смарт: Лопато 10.10.2022
		НавСсылка=ПолучитьНавигационнуюСсылку(Док);
		Менеджер=Справочники.Пользователи.ПустаяСсылка(); 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Док,"Менеджер") И ЗначениеЗаполнено(Док.Менеджер) Тогда  
			Менеджер = Док.Менеджер; 
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Док,"Ответственный") И ЗначениеЗаполнено(Док.Ответственный) Тогда
			Менеджер = Док.Ответственный;                
		КонецЕсли;
		//++ #4400 смарт: Тимофеева 26.09.2025 / смартОтправитьОповещенияПоЗаказамКлиентаСбронью. Доработка.	
		//Если ЗначениеЗаполнено(Менеджер) Тогда 
		Если ЗначениеЗаполнено(Менеджер) 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Менеджер, "Недействителен") 
			И НЕ Менеджер.Недействителен Тогда
		//-- #4400 смарт: Тимофеева 26.09.2025   
		
			//++ #5620 смарт: Тимофеева 18.06.2026 / смартОтправитьОповещенияПоЗаказамКлиентаСбронью. Доработка.
			Если НЕ ЗначениеЗаполнено(Менеджер.смартРабочаяПочта) Тогда
				ОтправитьПисьмоОбОтсутствииРабочейПочтыУМенеджера(Менеджер);
				Продолжить;	
			КонецЕсли;
			//-- #5620 смарт: Тимофеева 18.06.2026
			
			УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
			ДанныеДляОтправки=Новый Структура;
			//++#1214 смарт: Лопато 10.10.2022 //Рефакторинг в связи с ошибками  
			//ДанныеДляОтправки.Вставить("Кому",Док.Менеджер.смартРабочаяПочта); //
			ДанныеДляОтправки.Вставить("Кому",Менеджер.смартРабочаяПочта); //
			//--#1214 смарт: Лопато 10.10.2022
			ДанныеДляОтправки.Вставить("Тема","Внимание!! Возможно слетел ВАШ Резерв!!");
			
			//++ #Б-1080 смарт: Лопато 07.03.2025 //Добавить доп текст в оповещения (продолжение задачи 1600) (ИТСМ 1622)  
			ЕстьКонтрагент = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Док, "Контрагент");
			
			ДанныеДляОтправки.Вставить("Тело", "Коллеги, по вашему " 
											   + ?(ЕстьКонтрагент, СокрЛП(Док.Контрагент) + " ", "")
											   + Док 
											   + " отменена позиция номенклатуры или уменьшено количество на доставку. " + Символы.ПС 
											   + "По номенклатуре: " + Стр.Номенклатура 
											   + " -Артикул: " + Стр.Номенклатура.Артикул 
											   + Символы.ПС + Символы.ПС 
											   + "Навигационная ссылка на документ: " + НавСсылка);
			//-- #Б-1080 смарт: Лопато 07.03.2025
			
			ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
			ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки); 
			
		КонецЕсли;
		//++#1214 смарт: Лопато 10.10.2022 //Рефакторинг в связи с ошибками  
		//КонецЕсли;	
		//--#1214 смарт: Лопато 10.10.2022
	КонецЦикла;
	
КонецПроцедуры //-- смарт:Подкин #1192 23.09.2022 9:53:44

//++ #5620 смарт: Тимофеева 18.06.2026 / смартОтправитьОповещенияПоЗаказамКлиентаСбронью. Доработка.
Процедура ОтправитьПисьмоОбОтсутствииРабочейПочтыУМенеджера(Менеджер) Экспорт	
	УчетнаяЗапись 						= РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	АдресаДляОтправкиСтрокой 			= "";
	СсылкаНаПредопределенноеЗначение 	= Справочники.смартПредопределенныеЗначения.АдресаДляОтправкиОшибок;	
	МассивАдресовДляОтправки 			= смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой, Ложь);
		
	ДанныеДляОтправки					= Новый Структура;
	ДанныеДляОтправки.Вставить("Кому", 		МассивАдресовДляОтправки); 
	ДанныеДляОтправки.Вставить("Тема",		"Внимание! Не заполнен рабочий email!");	
	ДанныеДляОтправки.Вставить("Тело",  	СтрШаблон("У менеджера %1 не заполнена рабочая почта", Менеджер));
	ДанныеДляОтправки.Вставить("ТипТекста",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ДанныеДляОтправки.Вставить("Важность",	ВажностьИнтернетПочтовогоСообщения.Высокая);
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ДанныеДляОтправки);
КонецПроцедуры //-- #5620 смарт: Тимофеева 18.06.2026 
			
//++ #1366 смарт: Фролов 02.06.2023 //Отслеживать появление на складах запчастей, требуемых для выполнения заявок со статусом  
Процедура смартКонтрольПриходаТовараДляОжидаемыхЗапчастейПриПроведенииДокументов(Источник, Отказ, РежимПроведения) Экспорт
	ПроведениеВПервыйРаз = Ложь;
	Если Источник.ДополнительныеСвойства.Свойство("смартТребуетсяРассылкаПоОжидаемымЗЧ") = Истина Тогда
		ПроведениеВПервыйРаз = Источник.ДополнительныеСвойства.смартТребуетсяРассылкаПоОжидаемымЗЧ;
	КонецЕсли;
	
	Если НЕ ПроведениеВПервыйРаз Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	смартОжидаемыеЗапчастиОбороты.Организация КАК Организация,
	                    |	ПриходныйОрдерНаТоварыТовары.Ссылка.Склад КАК Склад,
	                    |	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	                    |	СУММА(ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок) КАК Количество
	                    |ПОМЕСТИТЬ ТабНоменклатура
	                    |ИЗ
	                    |	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары,
	                    |	РегистрНакопления.смартОжидаемыеЗапчасти.Обороты КАК смартОжидаемыеЗапчастиОбороты
	                    |ГДЕ
	                    |	ПриходныйОрдерНаТоварыТовары.Ссылка = &Источник
	                    |	И ПриходныйОрдерНаТоварыТовары.Ссылка.Склад В
	                    |			(ВЫБРАТЬ
	                    |				ДополнительныеСведения.Объект КАК Объект
	                    |			ИЗ
	                    |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                    |			ГДЕ
	                    |				ДополнительныеСведения.Свойство.Имя = &Имя
	                    |				И ДополнительныеСведения.Значение = ИСТИНА)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартОжидаемыеЗапчастиОбороты.Организация,
	                    |	ПриходныйОрдерНаТоварыТовары.Ссылка.Склад,
	                    |	ПриходныйОрдерНаТоварыТовары.Номенклатура
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	смартОжидаемыеЗапчастиОбороты.Организация,
	                    |	ЗаказПоставщикуТовары.Склад,
	                    |	ЗаказПоставщикуТовары.Номенклатура,
	                    |	ЗаказПоставщикуТовары.КоличествоУпаковок
	                    |ИЗ
	                    |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.смартОжидаемыеЗапчасти.Обороты КАК смартОжидаемыеЗапчастиОбороты
	                    |		ПО ЗаказПоставщикуТовары.Номенклатура = смартОжидаемыеЗапчастиОбороты.Номенклатура
	                    |			И ЗаказПоставщикуТовары.Ссылка.Организация = смартОжидаемыеЗапчастиОбороты.Организация
	                    |ГДЕ
	                    |	ЗаказПоставщикуТовары.Ссылка = &Источник
	                    |	И ЗаказПоставщикуТовары.Склад В
	                    |			(ВЫБРАТЬ
	                    |				ДополнительныеСведения.Объект КАК Объект
	                    |			ИЗ
	                    |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                    |			ГДЕ
	                    |				ДополнительныеСведения.Свойство.Имя = &Имя
	                    |				И ДополнительныеСведения.Значение = ИСТИНА)
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ТабНоменклатура.Склад КАК Склад,
	                    |	смартОжидаемыеЗапчастиОбороты.Регистратор КАК Регистратор,
	                    |	смартОжидаемыеЗапчастиОбороты.Номенклатура КАК Номенклатура,
	                    |	СУММА(ТабНоменклатура.Количество) КАК Количество,
	                    |	смартОжидаемыеЗапчастиОбороты.Сотрудник КАК Сотрудник
	                    |ИЗ
	                    |	ТабНоменклатура КАК ТабНоменклатура
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.смартОжидаемыеЗапчасти.Обороты(, , Регистратор, ) КАК смартОжидаемыеЗапчастиОбороты
	                    |		ПО ТабНоменклатура.Номенклатура = смартОжидаемыеЗапчастиОбороты.Номенклатура
	                    |			И ТабНоменклатура.Организация = смартОжидаемыеЗапчастиОбороты.Организация
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартОжидаемыеЗапчастиОбороты.Регистратор,
	                    |	смартОжидаемыеЗапчастиОбороты.Номенклатура,
	                    |	ТабНоменклатура.Склад,
	                    |	смартОжидаемыеЗапчастиОбороты.Сотрудник
	                    |ИТОГИ ПО
	                    |	Сотрудник,
	                    |	Регистратор");  
	Запрос.УстановитьПараметр("Источник",Источник.Ссылка);
	Запрос.УстановитьПараметр("Имя","СкладыДляОжидаемыхЗапчастей");
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока Выборка.Следующий() Цикл
		ТекстДляОтправкиПисьма="";
		ВыборкаЗаявка=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗаявка.Следующий() Цикл
			Если ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") ТОгда
				ТекстДляОтправкиПисьма="По заявке на ремонтные работы № "+ВыборкаЗаявка.Регистратор.Номер+" от "+Формат(ВыборкаЗаявка.Регистратор.Дата,"ДФ=dd.MM.yyyy")+" создан Приходный ордер на следующие запчасти:"+Символы.ПС;
				ТемаПисьма="Появился Приходный ордер по ожидаемым запчастям по заявке №";
			Иначе
			    ТекстДляОтправкиПисьма="По заявке на ремонтные работы № "+ВыборкаЗаявка.Регистратор.Номер+" от "+Формат(ВыборкаЗаявка.Регистратор.Дата,"ДФ=dd.MM.yyyy")+" создан Заказ поставщику на следующие запчасти:"+Символы.ПС;
				ТемаПисьма="Появился Заказ поставщику по ожидаемым запчастям по заявке №";
			КонецЕсли;
			ВыборкаНоменклатура=ВыборкаЗаявка.Выбрать();
			НомПП=1;
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ТекстДляОтправкиПисьма=ТекстДляОтправкиПисьма+НомПП+". "+ВыборкаНоменклатура.Номенклатура+" в количестве "+ВыборкаНоменклатура.Количество+" на склад "+ВыборкаНоменклатура.Склад+Символы.ПС;	
				НомПП=НомПП+1;
			КонецЦикла;
			МассивСообщений = Новый Массив;
			Успех=Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьОповещениеПоОжидаемымЗапчастям(МассивСообщений,ТекстДляОтправкиПисьма,ВыборкаЗаявка.Регистратор,Выборка.Сотрудник,ТемаПисьма);
		КонецЦикла;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	//-- #1366 смарт: Фролов 02.06.2023

//++ #1993 смарт: Лопато 19.08.2024 //Обработка онлайн заказов (переделка)  
Процедура ЗаказКлиентаПодпискаПриЗаписиРаспределениеИМ(Источник, Отказ) Экспорт

	Если НЕ Отказ Тогда
		
		смартИнтернетМагазин.РаспределениеОповещениеПоОнлайнЗаказу(Источник);
		
	КонецЕсли;
	 
КонецПроцедуры //-- #1993 смарт: Лопато 19.08.2024

//++ #1912 смарт: Лопато 28.08.2024 //Синхронизация связки Пользователь + Партнер  
Процедура ПартнерКонтрагентКЛПриЗаписиОтправкаНаСайт(Источник, Отказ) Экспорт

	Если НЕ Отказ
		И НЕ Б_ОбменССайтомСервер.смарт_ЭтоКопияБазы() Тогда

		//++ #Б-1138 смарт: Лопато 15.10.2024 //ИМ. Выгрузка заказов на сайт. Ограничение по дате  
		Если Источник.ДополнительныеСвойства.Свойство("ПропуститьОтправкуНаСайтПриЗаписи") Тогда
			Возврат;
		КонецЕсли;	
		//-- #Б-1138 смарт: Лопато 15.10.2024
		
		Если ТипЗнч(Источник) = Тип("СправочникОбъект.Партнеры") Тогда

			Партнер = Источник.Ссылка;
			ЭтоКлиент = Источник.Клиент;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Контрагенты") Тогда
			
			Партнер = Источник.Партнер;	
			ЭтоКлиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Клиент");
			
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.КонтактныеЛицаПартнеров") Тогда
			
			Если НЕ ЗначениеЗаполнено(Источник.смартЛогинНаСайте) Тогда
				Возврат;
			КонецЕсли;	
			
			Партнер = Источник.Владелец;	
			ЭтоКлиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Клиент");

		КонецЕсли;	
		
	КонецЕсли;
	 
КонецПроцедуры //-- #1912 смарт: Лопато 28.08.2024

//++ #Б-1352 смарт: Лопато 25.11.2024 //Добавить ТЭГ выгрузки в imot.io  
Процедура ИсторияСостоянийОбращенийПриЗаписи(Источник, Отказ, Замещение) Экспорт

	Если НЕ Отказ Тогда
		
		Для Каждого ТекущаяЗаписьСостояния Из Источник Цикл

			Если ТекущаяЗаписьСостояния.Состояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение
				И ТекущаяЗаписьСостояния.Обращение.ПричинаОтказа = Справочники.смартПредопределенныеЗначения.Настройки.ПричинаОтказаПоИнтересамНецелевойКлиент Тогда
			
				СтруктураПараметров = Новый Структура("Период, Интерес, Состояние", 
				   				   					  ТекущаяЗаписьСостояния.Период, 
								   					  ТекущаяЗаписьСостояния.Обращение, 
								   					  ТекущаяЗаписьСостояния.Состояние);
				
				ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.РассчитатьТэгиТелефонногоЗвонкаНецелевойКлиент",
													   СтруктураПараметров, 
													   ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор));
													   
			КонецЕсли;
			
		КонецЦикла;
											   
	КонецЕсли;										   
	 
КонецПроцедуры //-- #Б-1352 смарт: Лопато 25.11.2024

//++ #1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов  
Процедура ИсторияСостоянийОбращенийПередЗаписью(Источник, Отказ, Замещение) Экспорт

	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого ТекущаяЗаписьСостояния Из Источник Цикл

		Если НЕ ЗначениеЗаполнено(ТекущаяЗаписьСостояния.ДатаЗавершения) Тогда
		
			ТекущаяЗаписьСостояния.смартСтатусRoistat 
				= Справочники.смартСтатусыRoistat.РассчитатьСтатусRoistatПоСостояниюИнтереса(ТекущаяЗаписьСостояния.Обращение, 
																							 ТекущаяЗаписьСостояния.Состояние);
				
		КонецЕсли;		
											   
	КонецЦикла;										   
	 
КонецПроцедуры //-- #1538 смарт: Лопато 05.12.2024

//++ #Б-1706 смарт: Лопато 25.12.2024 //Доработка синхронизации УТ СМАРТ-Т РФ - БП СМАРТ-Т РФ  
Процедура смартНоменклатураСегментаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ Отказ Тогда

		Сегмент = Неопределено;

		Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
			
			Если ЭлементОтбора.Имя = "Сегмент" Тогда	
				Сегмент = ЭлементОтбора.Значение;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;  
		
		ЗарегистрироватьНоменклатуруСегментаВОбменДляОбновленияНоменклатурныхГруппБП(Сегмент, Источник);
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-1706 смарт: Лопато 25.12.2024

//++ #Б-1706 смарт: Лопато 25.12.2024 //Доработка синхронизации УТ СМАРТ-Т РФ - БП СМАРТ-Т РФ  
Процедура ЗарегистрироватьНоменклатуруСегментаВОбменДляОбновленияНоменклатурныхГруппБП(Сегмент, Источник)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаНастроекСопоставления = Справочники.смартПредопределенныеЗначения.Настройки.СопоставлениеСегментовИНоменклатурныхГруппБП.Выгрузить();
	
	СтрокаНастройкиСопоставления = ТаблицаНастроекСопоставления.Найти(Сегмент, "СегментНоменклатуры");
	
	Если СтрокаНастройкиСопоставления <> Неопределено Тогда 
		
		Если НЕ ЗначениеЗаполнено(СтрокаНастройкиСопоставления.Узел) Тогда
			Возврат;
		КонецЕсли;	
		
		МассивНоменклатурыСегмента = Источник.ВыгрузитьКолонку("Номенклатура");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	НоменклатураСегмента.Номенклатура КАК Номенклатура
		               |ПОМЕСТИТЬ ВТ_НоменклатураСегмента
		               |ИЗ
		               |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		               |ГДЕ
		               |	НоменклатураСегмента.Сегмент = &Сегмент
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура
		               |ГДЕ
		               |	Ссылка В(&МассивНоменклатурыСегмента)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Номенклатура КАК Номенклатура
		               |ИЗ
		               |	ВТ_НоменклатураСегмента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Номенклатура
					   |
					   |ИМЕЮЩИЕ
					   |	КОЛИЧЕСТВО(Номенклатура) = 1";
		
		Запрос.УстановитьПараметр("Сегмент", Сегмент);
		Запрос.УстановитьПараметр("МассивНоменклатурыСегмента", МассивНоменклатурыСегмента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивНоменклатурыДляРегистрации = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		Если МассивНоменклатурыДляРегистрации.Количество() > 0 Тогда

			Для Каждого ЭлементНоменклатуры Из МассивНоменклатурыДляРегистрации Цикл
				ОбменДаннымиXDTOСервер.ДобавитьОбъектВФильтрРазрешенныхОбъектов(ЭлементНоменклатуры, СтрокаНастройкиСопоставления.Узел);
			КонецЦикла;	
			
			ПланыОбмена.ЗарегистрироватьИзменения(СтрокаНастройкиСопоставления.Узел, МассивНоменклатурыДляРегистрации);
			
		КонецЕсли;	
		
	КонецЕсли;	
		
КонецПроцедуры //-- #Б-1706 смарт: Лопато 25.12.2024

//++ #Б-2858 смарт: Лопато 07.04.2025 //Автозадачи по заказам. Согласование даты отгрузки.  
Процедура ПослеПроведенияЗаказКлиента(Источник, Отказ, РежимПроведения) Экспорт

	УстановитьДатуРезерваЗаказаПоАвтозадачеСогласованиеДатыОгрузки(Источник, Отказ);
		
КонецПроцедуры	//-- #Б-2858 смарт: Лопато 07.04.2025

//++ #Б-2858 смарт: Лопато 07.04.2025 //Автозадачи по заказам. Согласование даты отгрузки.  
Процедура УстановитьДатуРезерваЗаказаПоАвтозадачеСогласованиеДатыОгрузки(Заказ, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если НЕ ЗначениеЗаполнено(Заказ.Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	АвтозадачиДатаНачала = Справочники.смартПредопределенныеЗначения.Настройки.АвтозадачиДатаНачала;

	Если НЕ ЗначениеЗаполнено(АвтозадачиДатаНачала) Тогда
		Возврат;
	КонецЕсли;	

	СвойствоДатаРезерваЗапчастей 
		= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ДатаРезерваЗапчастей");

	Если НЕ ЗначениеЗаполнено(СвойствоДатаРезерваЗапчастей) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Отказ 
		ИЛИ НЕ Заказ.Проведен
		ИЛИ Заказ.СуммаДокумента = 0
		ИЛИ Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		
		Возврат;
		
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	ЗаказКлиентаТовары.Номенклатура
	|ПОМЕСТИТЬ ВТ_НЕУстановленРезервВЗаказе
	|ИЗ 
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка
	|	И (НЕ ЗаказКлиентаТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	   ИЛИ (НЕ ЗаказКлиентаТовары.Отменено
	|			И НЕ (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|				  ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|				  ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))))
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокЗаказ.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ДокЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведения
	|		ПО ДопСведения.Объект = ДокЗаказ.Ссылка 
	|		   И ДопСведения.Свойство = &СвойствоДатаРезерваЗапчастей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.ЗаказКлиента = ДокЗаказ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НЕУстановленРезервВЗаказе КАК ВТ_НЕУстановленРезервВЗаказе
	|		ПО ДокЗаказ.Ссылка = ВТ_НЕУстановленРезервВЗаказе.Заказ	
	|ГДЕ
	|	ДокЗаказ.Ссылка = &Ссылка
	|	И ДокЗаказ.Дата >= &ДатаНачала
	|	И ДокЗаказ.Проведен
	|	И ДокЗаказ.СуммаДокумента <> 0
	|	И ДокЗаказ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|	И НЕ ДокЗаказ.Партнер В (&СписокПартнеровИсключения)
	|	И (ДокЗаказ.Менеджер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	   И ДокЗаказ.Менеджер = ДокЗаказ.Партнер.смартОсновнойМенеджерСервисЦентра)
	|	И ЕСТЬNULL(ДопСведения.Значение, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)  
	|	И ВЫБОР
	|		КОГДА ВТ_НЕУстановленРезервВЗаказе.Заказ ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	  КОНЕЦ
	|	И РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", 					  Заказ.Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала", 				  АвтозадачиДатаНачала);
	Запрос.УстановитьПараметр("СвойствоДатаРезерваЗапчастей", СвойствоДатаРезерваЗапчастей);
	
	Запрос.УстановитьПараметр("СписокПартнеровИсключения", 
		Справочники.смартПредопределенныеЗначения.Настройки.АвтозадачиПартнерыИсключения.ВыгрузитьКолонку("Партнер"));
		
	Запрос.УстановитьПараметр("ВидНоменклатуры", 
		Справочники.смартПредопределенныеЗначения.Настройки.ВидНоменклатурыЗапчастиСервисногоЦентра);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Если РезультатЗапроса.Следующий() Тогда
		
		ЗначенияДополнительныхСвойств = Новый ТаблицаЗначений;
		
		ЗначенияДополнительныхСвойств.Колонки.Добавить("Свойство");
		ЗначенияДополнительныхСвойств.Колонки.Добавить("Значение");
		
		НоваяСтрока = ЗначенияДополнительныхСвойств.Добавить();
		
		НоваяСтрока.Свойство = СвойствоДатаРезерваЗапчастей;
		НоваяСтрока.Значение = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		
		УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Заказ.Ссылка, ЗначенияДополнительныхСвойств);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	//-- #Б-2858 смарт: Лопато 07.04.2025

Процедура смартПриИзмененииКурсовВалютПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Валюты = Новый Массив;
	
	Если Источник.Отбор.Валюта.Использование Тогда
		
		// Пустой набор (часто удаление при Замещение) — валюта из отбора
		ВалютаОтбора = Источник.Отбор.Валюта.Значение;
		
		Если ТипЗнч(ВалютаОтбора) = Тип("СправочникСсылка.Валюты")
			И ЗначениеЗаполнено(ВалютаОтбора) Тогда
			
			Валюты.Добавить(ВалютаОтбора);
			
		ИначеЕсли ТипЗнч(ВалютаОтбора) = Тип("Массив") Тогда
			
			Для Каждого Валюта Из ВалютаОтбора Цикл
				Если Валюты.Найти(Валюта) = Неопределено Тогда
					Валюты.Добавить(Валюта);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли Источник.Количество() > 0 Тогда
		
		// Есть записи в наборе — берём валюты из них
		Для Каждого Запись Из Источник Цикл
			
			Если Валюты.Найти(Запись.Валюта) = Неопределено Тогда
				Валюты.Добавить(Запись.Валюта);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Акции = смартАкцииИСкидки.ПолучитьДействующиеАкции(ТекущаяДата(), Новый Структура("ВалютаАкция,ВозвращатьАкцииБудущего", Валюты, Истина));
	Акции.Свернуть("Ссылка");
	
	Если Акции.Количество() > 0 Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(смартОбменССайтомБитриксСервер.ПолучитьМассивУзловОбменаБитрикс(), Акции.ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;
	
КонецПроцедуры
