
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаГоризонтаПланирования(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.CRM_ГоризонтПланированияВзаимодействий.Форма.НастройкаГоризонтаПланирования",
								Новый Структура("Ссылка", Объект.Ссылка),
								ЭтотОбъект,
								Объект.Ссылка, , НавигационнаяСсылка, , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


#КонецОбласти

