
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтрагентОПФ = Параметры.КонтрагентОПФ;
	КонтрагентСтрана = Параметры.КонтрагентСтрана;
	КонтрагентЮрФизЛицо = Параметры.КонтрагентЮрФизЛицо;	
	
	Если КонтрагентЮрФизЛицо = 1 Тогда
		
		Элементы.Контрагент.ПодсказкаВвода = "Поиск по Наименованию/ИНН"; 			
		Элементы.Поиск.Видимость = Истина;
		Элементы.КонтрагентИНН.Заголовок = "ИНН"; 
		Элементы.КонтрагентИНН.ПодсказкаВвода = "ИНН";
		Элементы.КонтрагентИНН.Маска = "";  			
		
	Иначе
		
		Элементы.Контрагент.ПодсказкаВвода= "ФИО";			
		Элементы.Поиск.Видимость = Ложь; 	
		Элементы.КонтрагентИНН.Заголовок = "Паспорт";
		Элементы.КонтрагентИНН.ПодсказкаВвода = "Серия Номер";  
		Элементы.КонтрагентОПФ.Видимость = Ложь;  						
		
	КонецЕсли; 
	
КонецПроцедуры 
	
&НаКлиенте
Процедура УстановитьМаскуПаспорта() 
	
	Если СокрЛП(КонтрагентСтрана) = "Россия" Тогда 
		
		Элементы.КонтрагентИНН.Маска = "9999 999999";
		
		ЦифрыПаспорта = ТолькоЦифры(КонтрагентИНН);
		КонтрагентИНН = ?(СтрДлина(ЦифрыПаспорта) > 4, Лев(Лев(ЦифрыПаспорта, 4) + " " + Сред(ЦифрыПаспорта, 5), 11), ЦифрыПаспорта);				
		
	Иначе
		
		Элементы.КонтрагентИНН.Маска = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТолькоЦифры(Знач СтрокаДляПроверки)
	
	ЛишниеСимволы = СтрСоединить(СтрРазделить(СтрокаДляПроверки, "0123456789"), "");
	Результат     = СтрСоединить(СтрРазделить(СтрокаДляПроверки, ЛишниеСимволы), "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоискОтправителя(Команда)  
	
	Если СокрЛП(КонтрагентСтрана) = "Россия" Тогда
		
		СписокКонтрагентов = ПолучитьСписокКонтрагентовAPI();
		
		Если СписокКонтрагентов.Количество() = 1 Тогда
			
			КонтрагентНаименование = СписокКонтрагентов[0].Значение.Наименование; 
			КонтрагентИНН = СписокКонтрагентов[0].Значение.ИНН;		
			
		ИначеЕсли СписокКонтрагентов.Количество() > 1 Тогда 
			
			ОО = Новый ОписаниеОповещения("КонтрагентВыборКонтрагентаИзСписка", ЭтаФорма); 
			
			ПоказатьВыборИзСписка(ОО, СписокКонтрагентов, Элементы.Контрагент); 	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСписокКонтрагентовAPI()	
	
	Возврат ДЛ_ДеловыеЛинии.ПолучитьСписокКонтрагентов(КонтрагентНаименование);	
	
КонецФункции 

&НаКлиенте
Процедура КонтрагентВыборКонтрагентаИзСписка(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		КонтрагентНаименование = Результат.Значение.Наименование;
		КонтрагентИНН = Результат.Значение.ИНН;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ПараметрыЗакрытияФормы = Новый Структура();
	
	ПараметрыЗакрытияФормы.Вставить("КонтрагентИНН", КонтрагентИНН);
	ПараметрыЗакрытияФормы.Вставить("КонтрагентНаименование", КонтрагентНаименование);
	ПараметрыЗакрытияФормы.Вставить("КонтрагентОПФ", КонтрагентОПФ);
	ПараметрыЗакрытияФормы.Вставить("КонтрагентСтрана", КонтрагентСтрана);
	
	Закрыть(ПараметрыЗакрытияФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентСтранаПриИзменении(Элемент)   
	
	Если КонтрагентЮрФизЛицо = 1 Тогда	
			
		Элементы.КонтрагентОПФ.Видимость = (СокрЛП(КонтрагентСтрана) <> "Россия");		 
		
	Иначе
		
		УстановитьМаскуПаспорта();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	Если КонтрагентЮрФизЛицо = 1 Тогда
		
		ОткрытьФорму("Справочник.ДЛ_Страны.Форма.ФормаВыбора",  Новый Структура("РежимВыбора", Истина), ЭтаФорма,,,, Новый ОписаниеОповещения("КонтрагентСтранаВыбор", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ОткрытьФорму("Справочник.ДЛ_Страны.Форма.ФормаВыбораСтрана",, ЭтаФорма,,,, Новый ОписаниеОповещения("КонтрагентСтранаВыборФизЛицо", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура КонтрагентСтранаВыборФизЛицо(Результат, ДополнительныеПараметры) Экспорт  	 
	
	Если Результат <> Неопределено Тогда 	
		
		КонтрагентОПФ = Результат;
		КонтрагентСтрана = ПолучитьСтрануПоОПФ(Результат);
		
		УстановитьМаскуПаспорта();
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаКлиенте
Процедура КонтрагентСтранаВыбор(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		КонтрагентСтрана = Результат;	
		
	КонецЕсли;  
	
	КонтрагентСтранаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонтрагентСтранаПриИзменении(Неопределено);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьСтрануПоОПФ(ОПФ) 
	
	Возврат Справочники.ДЛ_Страны.НайтиПоРеквизиту("UID", ОПФ.СтранаUID); 
	
КонецФункции





