
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если НЕ ЭтотОбъект.Ссылка.Пустая() Тогда
		
		Если НЕ ЭтотОбъект.Ссылка.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления Тогда
			
			ДополнительныеСвойства.Вставить("УдалитьДанныеВРегистрах", Истина);
			
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка.Ответственный) И ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
			
			Если НЕ ЭтотОбъект.Ссылка.Ответственный = ЭтотОбъект.Ответственный Тогда
				ДополнительныеСвойства.Вставить("СтарыйМенеджер", ЭтотОбъект.Ссылка.Ответственный);	
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка.Ответственный) И НЕ ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
			
			Если НЕ ЭтотОбъект.Ссылка.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления Тогда
				ДополнительныеСвойства.Вставить("УдалитьДанныеВРегистрах", Истина);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("УдалитьДанныеВРегистрах") Тогда
		
		СтруктураИзменений = Новый Структура;
		СтруктураИзменений.Вставить("СтарыйМенеджер",Ответственный);
		СтруктураИзменений.Вставить("Квалификация",Квалификация);
		СтруктураИзменений.Вставить("Лид",Ссылка);
		СтруктураИзменений.Вставить("УстановленаПометкаУдаления",Истина);
		
		смартСервер.ОтразитьИзмененийЛидаВРегистрах(СтруктураИзменений);
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СтарыйМенеджер") Тогда
		
		СтруктураИзменений = Новый Структура;
		СтруктураИзменений.Вставить("СтарыйМенеджер",ДополнительныеСвойства.СтарыйМенеджер);
		СтруктураИзменений.Вставить("НовыйМенеджер",Ответственный);
		СтруктураИзменений.Вставить("Квалификация",Квалификация);
		СтруктураИзменений.Вставить("Лид",Ссылка);
		СтруктураИзменений.Вставить("СменаМенеджера",Истина);
		
		смартСервер.ОтразитьИзмененийЛидаВРегистрах(СтруктураИзменений);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли

