
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

//++#1605 смарт: Лопато 29.01.2024 //Доработки по интернет-магазину
&Перед("ПередЗаписью")
Процедура смарт_ПередЗаписьюПеред(Отказ)
	
	//++#1605 смарт: Лопато 29.01.2024 //Доработки по интернет-магазину
	смартОбщегоНазначения.смартЗаполнитьФИОКонтактногоЛицаПартнера(ЭтотОбъект);
	//--#1605 смарт: Лопато 29.01.2024
	
КонецПроцедуры

//++ #Б-2464 смарт: Лопато 21.02.2025 //Исправить заполнение полей при копировании Контактного лица  
&Перед("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)
	
	//++ #Б-2464 смарт: Лопато 21.02.2025 //Исправить заполнение полей при копировании Контактного лица  
	смартЛогинНаСайте 			 = Неопределено;
	смартТелефонНаСайте 		 = Неопределено;
	смартЭлектроннаяПочтаНаСайте = Неопределено;
	//-- #Б-2464 смарт: Лопато 21.02.2025
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552 проверка контактного лица на дубль смартЛогинНаСайте
&Вместо("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КлючДанных = ?(ТипЗнч(ЭтотОбъект) = Тип("ФормаКлиентскогоПриложения"), Неопределено, ЭтотОбъект);
	Если ЗначениеЗаполнено(ЭтотОбъект.смартЛогинНаСайте) Тогда 
		
		ВыборкаКонтакт = смартЛогинУжеИспользуетсяВИнформационнойБазе(ЭтотОбъект.смартЛогинНаСайте, Ссылка);
		
		Если ВыборкаКонтакт <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//++#1256 смарт: Лопато 03.06.2024 //Изменить проверку на дубли email при вводе в Контактном лице (продолжение задачи 1012)  
			НСтр("ru='Данный Логин на сайте уже указан для контактного лица %1, ответственный %2.'"),
			ВыборкаКонтакт.Ссылка,
			ВыборкаКонтакт.Автор),
			//--#1256 смарт: Лопато 03.06.2024
			КлючДанных,
			"смартЛогинНаСайте",
			,
			Отказ);
			
		КонецЕсли;
						
	//Иначе
	//	
	//	Если НЕ смартУпрощенныйВводДоступен() Тогда
	//		
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		НСтр("ru = 'Не указан Логин на сайте'"),
	//		КлючДанных,
	//		"смартЛогинНаСайте",
	//		,
	//		Отказ);
	//		
	//	КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552
Функция смартЛогинУжеИспользуетсяВИнформационнойБазе(Логин,ИсключаяСсылку = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
	|	КонтактныеЛицаПартнеров.Автор КАК Автор
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.смартЛогинНаСайте = &Логин
	|	И КонтактныеЛицаПартнеров.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Логин",Логин);
	Запрос.УстановитьПараметр("Ссылка",ИсключаяСсылку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552
Функция смартУпрощенныйВводДоступен() Экспорт
	
	Возврат ПравоДоступа("Добавление", Метаданные.Справочники.КонтактныеЛицаПартнеров) И смартВводИнформацииПоКонтактномуЛицуБезКонтроля();
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552
Функция смартВводИнформацииПоКонтактномуЛицуБезКонтроля(Пользователь = Неопределено) Экспорт
	
	Возврат Пользователи.РолиДоступны("смартВводИнформацииПоКонтактномуЛицуБезКонтроля", Пользователь, Ложь);
	
КонецФункции

#КонецЕсли