
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипОбъекта") Тогда
		Если Параметры.ТипОбъекта = Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка Тогда
			ЭтаФорма.Заголовок = "Введите причину отмены контрольной точки"; 
		ИначеЕсли Параметры.ТипОбъекта = Перечисления.CRM_ТипыЭтапов.Этап Тогда	  
			ЭтаФорма.Заголовок = "Введите причину отмены задачи";
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ЗначениеЗаполнено(ПричинаОтмены) Тогда
		Закрыть(ПричинаОтмены);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо указать причину отказа!';en='It is necessary to specify reason for failure!'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти