//++ смарт:Подкин #1137 18.08.2022 11:30:36
Функция смарт_ТекстЗапросаГрафики() Экспорт 
	
	//++ #1812 смарт: Ермаков 08.05.2024 / Проблема с авторезервированием
	// Оставляем для совместимости
	Возврат смартОбеспечение.РезервыКДатеПолучитьТекстЗапроса();
	//-- #1812 смарт: Ермаков 08.05.2024
	
	//++ #1672 смарт: Ермаков 15.03.2024 / Некорректно распределяются резервы при проведении Заказа поставщику
	Текст =
	"// Поступление
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаСобытия 				КАК ДатаПоступления,
	|	КоличествоИзЗаказовПриход 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад
	|	)
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоступления
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|// Отгрузка
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикОтгрузки.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ГрафикОтгрузки.Регистратор 	КАК Документ,	
	|
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузки.Регистратор) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ГрафикОтгрузки.Регистратор
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузки.Регистратор.ДокументОснование) = ТИП(Документ.ЗаказКлиента) 
	|			  И НЕ ГрафикОтгрузки.Регистратор.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ГрафикОтгрузки.Регистратор.ДокументОснование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказКлиента,
	|	
	|	ГрафикОтгрузки.КоличествоИзЗаказовПриход + ГрафикОтгрузки.КоличествоНеобеспеченоПриход КАК Количество
	|
	|ПОМЕСТИТЬ ГрафикОтгрузкиДокументыВРегистре
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад
	|	) КАК ГрафикОтгрузки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Объединение ниже включает в себя данные:
	|// - заказы клиентов, которые вне графика
	|// - заказы на перемещение, которые вне графика
	|// - заказы на сборку, которые вне графика
	|// - заказы на внутреннее потребление, которые вне грфика
	|
	|// заказы клиентов, которые вне графика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 		КАК ДатаОтгрузки,
	|	Остатки.ЗаказКлиента 	КАК Документ,
	|	Остатки.ЗаказКлиента 	КАК ЗаказКлиента,
	|	Остатки.ЗаказаноОстаток КАК Количество
	|ПОМЕСТИТЬ ГрафикОтгрузкиДокументыВнеРегистра
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(
	|			,
	|			НЕ ЗаказКлиента В (ВЫБРАТЬ ЗаказКлиента ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад
	|	) КАК Остатки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказы
	|	ПО
	|		Заказы.Ссылка = Остатки.ЗаказКлиента
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0
	|
	|ОБЪЕДИНИТЬ 
	|
	|// заказы на перемещение, которые вне графика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 			КАК ДатаОтгрузки,
	|	Остатки.ЗаказНаПеремещение 	КАК Документ,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыНаПеремещения.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	|			  И НЕ ЗаказыНаПеремещения.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ЗаказыКлиентов.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ 						КАК ЗаказКлиента,
	|	
	|	Остатки.ЗаказаноОстаток 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|			,
	|			НЕ ЗаказНаПеремещение В (ВЫБРАТЬ Документ ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ЗаказНаПеремещение.СкладОтправитель = &Склад	 
	|	) КАК Остатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказыНаПеремещения
	|	ПО
	|		ЗаказыНаПеремещения.Ссылка = Остатки.ЗаказНаПеремещение
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		ЗаказыКлиентов.Ссылка = ЗаказыНаПеремещения.ДокументОснование
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0
	|	
	|ОБЪЕДИНИТЬ 
	|
	|// заказы на сборку, которые вне графика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 			КАК ДатаОтгрузки,
	|	Остатки.ЗаказНаСборку 		КАК Документ,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыНаСборку.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	|			  И НЕ ЗаказыНаСборку.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ЗаказыКлиентов.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ 						КАК ЗаказКлиента,
	|	
	|	Остатки.ЗаказаноОстаток 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаСборку.Остатки(
	|			,
	|			НЕ ЗаказНаСборку В (ВЫБРАТЬ Документ ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ЗаказНаСборку.Склад = &Склад	 
	|	) КАК Остатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказыНаСборку
	|	ПО
	|		ЗаказыНаСборку.Ссылка = Остатки.ЗаказНаСборку
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		ЗаказыКлиентов.Ссылка = ЗаказыНаСборку.ДокументОснование
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0
	|	
	|ОБЪЕДИНИТЬ 
	|
	|// заказы на внутреннее потребление, которые вне грфика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 						КАК ДатаОтгрузки,
	|	Остатки.ЗаказНаВнутреннееПотребление 	КАК Документ,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыНаВнутреннееПотребление.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	|			  И НЕ ЗаказыНаВнутреннееПотребление.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ЗаказыКлиентов.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ 									КАК ЗаказКлиента,
	|	
	|	Остатки.ЗаказаноОстаток 				КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки(
	|			,
	|			НЕ ЗаказНаВнутреннееПотребление В (ВЫБРАТЬ Документ ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад	 
	|	) КАК Остатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказыНаВнутреннееПотребление
	|	ПО
	|		ЗаказыНаВнутреннееПотребление.Ссылка = Остатки.ЗаказНаВнутреннееПотребление
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		ЗаказыКлиентов.Ссылка = ЗаказыНаВнутреннееПотребление.ДокументОснование
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Объединение ниже включает в себя данные:
	|// - документы по графику
	|// - документы вне графика
	|
	|// документы по графику
	|ВЫБРАТЬ
	|	ДатаОтгрузки 	КАК ДатаОтгрузки,
	|	Документ 		КАК Документ,
	|	ЗаказКлиента 	КАК ЗаказКлиента,
	|	Количество 		КАК Количество
	|ПОМЕСТИТЬ ГрафикОтгрузкиПолный
	|ИЗ 
	|	ГрафикОтгрузкиДокументыВРегистре
	|
	|ОБЪЕДИНИТЬ 
	|
	|// документы вне графика
	|ВЫБРАТЬ
	|	ДатаОтгрузки 	КАК ДатаОтгрузки,
	|	Документ 		КАК Документ,
	|	ЗаказКлиента 	КАК ЗаказКлиента,
	|	Количество 		КАК Количество
	|ИЗ 
	|	ГрафикОтгрузкиДокументыВнеРегистра
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Фильтрация общего перечня документов
	|ВЫБРАТЬ
	|	ГрафикОтгрузкиПолный.ДатаОтгрузки 			КАК ДатаОтгрузки,
	|	ГрафикОтгрузкиПолный.Документ 				КАК Документ,
	|	ГрафикОтгрузкиПолный.ЗаказКлиента 			КАК ЗаказКлиента,
	|	ГрафикОтгрузкиПолный.Количество 			КАК Количество,
	|	ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) КАК ПроцентОплаты
	|ПОМЕСТИТЬ ГрафикОтгрузкиПредварительный
	|ИЗ
	|	ГрафикОтгрузкиПолный КАК ГрафикОтгрузкиПолный
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		НЕ ГрафикОтгрузкиПолный.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		И ЗаказыКлиентов.Ссылка = ГрафикОтгрузкиПолный.ЗаказКлиента 
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов
	|	ПО
	|		СостоянияЗаказов.Заказ = ГрафикОтгрузкиПолный.ЗаказКлиента		
	|
	|ГДЕ
	|	НЕ ЕСТЬNULL(ЗаказыКлиентов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.ПустаяСсылка))
	|			= ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Получаем минимальные даты оплат по заказа клиентов
	|ВЫБРАТЬ
	|	МИНИМУМ(ДатаВозникновения) 	КАК ДатаОплаты,
	|	ОбъектРасчетов 				КАК ЗаказКлиента,
	|	1 							КАК Приоритет
	|ПОМЕСТИТЬ ОплатыПриоритеты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Обороты(
	|			,
	|			,
	|			, 
	|			ОбъектРасчетов 
	|				В (ВЫБРАТЬ ЗаказКлиента ИЗ ГрафикОтгрузкиПредварительный)
	|			И НЕ ОбъектРасчетов = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	)
	|ГДЕ
	|	КОплатеРасход > 0
	|СГРУППИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Собираем результат
	|// Сортировка документов:
	|// - документы с приоритетом 1 сортируются по датам оплаты - кто первый оплатил, тот первый получает резерв
	|// - документы с приоритетом 2 сортируются по дате документа, обеспечиваются резервом по остаточному принципу
	|ВЫБРАТЬ
	|	ГрафикОтгрузкиПредварительный.ДатаОтгрузки 					КАК ДатаОтгрузки,
	|	ГрафикОтгрузкиПредварительный.Документ 						КАК Документ,
	|	ГрафикОтгрузкиПредварительный.ЗаказКлиента 					КАК ЗаказКлиента,
	|	ГрафикОтгрузкиПредварительный.Количество 					КАК Количество,
	|	ЕСТЬNULL(ОплатыПриоритеты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1))	КАК ДатаОплаты,
	|	ДАТАВРЕМЯ(1, 1, 1)											КАК ДатаСдвига,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиПредварительный.Документ) = ТИП(Документ.ЗаказНаПеремещение)
	|		ТОГДА ГрафикОтгрузкиПредварительный.Документ.СкладПолучатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК СкладПолучательЗаказНаПеремещение,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиПредварительный.Документ) = ТИП(Документ.ЗаказНаСборку)
	|		ТОГДА ГрафикОтгрузкиПредварительный.Документ.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураЗаказНаСборку,	
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиПредварительный.Документ) = ТИП(Документ.ЗаказНаСборку)
	|		ТОГДА ГрафикОтгрузкиПредварительный.Документ.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаЗаказНаСборку,
	|
	|	ВЫБОР
	|		КОГДА НЕ ГрафикОтгрузкиПредварительный.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ГрафикОтгрузкиПредварительный.ПроцентОплаты <= &МинимальныйПроцентОплаты
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроцентОплатыНижеМинимального
	|		
	|ИЗ
	|	ГрафикОтгрузкиПредварительный КАК ГрафикОтгрузкиПредварительный
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОплатыПриоритеты КАК ОплатыПриоритеты
	|	ПО
	|		ОплатыПриоритеты.ЗаказКлиента = ГрафикОтгрузкиПредварительный.ЗаказКлиента
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ОплатыПриоритеты.Приоритет, 2) ВОЗР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОплатыПриоритеты.Приоритет, 2) = 1
	|		ТОГДА ЕСТЬNULL(ОплатыПриоритеты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ГрафикОтгрузкиПредварительный.Документ.Дата
	|	КОНЕЦ ВОЗР
	|";   
	//-- #1672 смарт: Ермаков 15.03.2024
	
	Возврат Текст;

КонецФункции //-- смарт:Подкин #1137 18.08.2022 11:30:36

