
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокВыбораВремени(ПолеВводаФормы, Интервал = 3600) Экспорт
	Взаимодействия.ЗаполнитьСписокВыбораВремени(ПолеВводаФормы, Интервал = 3600);
КонецПроцедуры

// Получает обычный текст из текста HTML.
//
// Параметры:
//  ТекстHTML  - Строка - текст HTML.
//
// Возвращаемое значение:
//   Строка   - обычный текст
//
Функция ПолучитьОбычныйТекстИзHTML(ТекстHTML) Экспорт
	
	Возврат Взаимодействия.ПолучитьОбычныйТекстИзHTML(ТекстHTML);
	
КонецФункции

Функция ЕстьДокументыВзаимодействия(Взаимодействие) Экспорт
	
	Возврат CRM_ВзаимодействияСервер.ЕстьДокументыВзаимодействия(Взаимодействие);
	
КонецФункции

Функция ПолучитьМассивEmail(Контакт) Экспорт
	МассивEmail = Новый Массив;
	Для Каждого ЭлементКИ Из Контакт.КонтактнаяИнформация Цикл
		Если ЭлементКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			СтруктураКИ = Новый Структура;
			СтруктураКИ.Вставить("Значение",		ЭлементКИ.Представление); 
			СтруктураКИ.Вставить("Представление",	ЭлементКИ.Вид.Наименование + ": " + ЭлементКИ.Представление);
			СтруктураКИ.Вставить("Контакт", Контакт);
			Если ЭлементКИ.CRM_ОсновнойДляСвязи Тогда
				МассивEmail.Вставить(0, СтруктураКИ);
			Иначе
				МассивEmail.Добавить(СтруктураКИ);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	Возврат МассивEmail;
КонецФункции

Функция сфпПолучитьМассивТелефонов(МассивКонтактов) Экспорт
	МассивТелефонов = Новый Массив;
	Для Каждого ЭлементМассива Из МассивКонтактов Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Партнеры") Тогда
			ИмяОбъекта = Нстр("ru='Клиент';en='Customer'");
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			ИмяОбъекта = Нстр("ru='Контактное лицо';en='Contact Person'");
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
			ИмяОбъекта = Нстр("ru='Потенциальный клиент';en='Potential Customer'");			
		КонецЕсли;			
		Для Каждого ЭлементКИ Из ЭлементМассива.КонтактнаяИнформация Цикл
			Если ЭлементКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				СтруктураКИ = Новый Структура;
				СтруктураКИ.Вставить("Значение",		ЭлементКИ.Представление); 
				СтруктураКИ.Вставить("Представление",	ЭлементКИ.Вид.Наименование + ": " + ЭлементКИ.Представление + " (" + ЭлементМассива.Наименование + " <" + ИмяОбъекта +">" + ")");
				Если ЭлементКИ.CRM_ОсновнойДляСвязи Тогда
					МассивТелефонов.Вставить(0, СтруктураКИ);
				Иначе
					МассивТелефонов.Добавить(СтруктураКИ);
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	
	Возврат МассивТелефонов;
КонецФункции

Функция ИспользуетсяРолеваяАдресацияОбъекта(Ссылка) Экспорт
	Возврат CRM_ВзаимодействияСервер.ИспользуетсяРолеваяАдресацияОбъекта(Ссылка);
КонецФункции

// +Рарус alexpr

#Область Новые

Функция ПоместитьКартинкуВоВременноеХранилище(Знач ДвоичныеДанные, Знач УникальныйИдентификатор) Экспорт
	
	Картинка = Новый Картинка(ДвоичныеДанные);
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Результат = Новый Структура;
	Результат.Вставить("Расширение", "." + НРег(Строка(Картинка.Формат())));
	Результат.Вставить("Размер", ДвоичныеДанные.Размер());
	Результат.Вставить("АдресВХранилище", АдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// -Рарус alexpr

#КонецОбласти
