
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&После("УстановитьВидимость")
Процедура смарт_УстановитьВидимость()
	//Каратеев + ----> адаптация 30.01.2020
	//Не ограничивать видимость для пользователя с полными правами
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Автор.Заголовок = Объект.Автор;
		ОткрытаАвтором = Объект.Автор = Пользователи.ТекущийПользователь();
		Элементы.ПараметрыОтображения.Видимость = Истина;//ОткрытаАвтором;
		Элементы.ИнформацияОбАвторе.Видимость = Истина;//Не ОткрытаАвтором;
		
		ТолькоПросмотр = Ложь;//Не ОткрытаАвтором;
		Элементы.Содержание.ТолькоПросмотр = Ложь;//Не ОткрытаАвтором;
		Элементы.КоманднаяПанельРедактирования.Видимость = Истина;//ОткрытаАвтором;
	КонецЕсли;
	//Каратеев -
	
	//++ смарт:ММ 643 26.09.2021
	Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда
		
		Если НЕ РольДоступна("ПолныеПрава") 
			И РольДоступна("смартРедактированиеЗаметокТехническоеОбслуживаниеОборудования") Тогда
			
			ТолькоПросмотр = Ложь;
			Элементы.Содержание.ТолькоПросмотр = Ложь;
			Элементы.КоманднаяПанельРедактирования.Видимость = Истина;
		КонецЕсли;		
	КонецЕсли;
	//-- смарт:ММ 26.09.2021
	
	//++ смарт:ММ 655 28.09.2021 
	Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		Если НЕ РольДоступна("ПолныеПрава") 
			И РольДоступна("смартРедактированиеЗаметокРемонтныеРаботы") Тогда
			
			ТолькоПросмотр = Ложь;
			Элементы.Содержание.ТолькоПросмотр = Ложь;
			Элементы.КоманднаяПанельРедактирования.Видимость = Истина;
		КонецЕсли;		
	КонецЕсли;
	//-- смарт:ММ 28.09.2021
	
	//++ смарт:ММ 657 30.09.2021 
	Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку") Тогда
		
		Если НЕ РольДоступна("ПолныеПрава") 
			И РольДоступна("смартРедактированиеЗаметокПусконаладочныеРаботы") Тогда
			
			ТолькоПросмотр = Ложь;
			Элементы.Содержание.ТолькоПросмотр = Ложь;
			Элементы.КоманднаяПанельРедактирования.Видимость = Истина;
		КонецЕсли;		
	КонецЕсли;
	//-- смарт:ММ 30.09.2021

КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ #1313 смарт: Фролов 16.02.2023 //смартСтатусыВзаимоотношенийСКлиентомПоЗаметке
	Запрос=Новый Запрос("ВЫБРАТЬ
				|	смартСтатусыВзаимоотношенийСКлиентами.Ссылка КАК Значение,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(СтатусыВЗаметке.смартСтатусВзаимоотношенийСКлиентом, ЛОЖЬ) = ЛОЖЬ
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК Пометка
				|ИЗ
				|	Справочник.смартСтатусыВзаимоотношенийСКлиентами КАК смартСтатусыВзаимоотношенийСКлиентами
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ЗаметкисмартСтатусыВзаимоотношенийСКлиентами.смартСтатусВзаимоотношенийСКлиентом КАК смартСтатусВзаимоотношенийСКлиентом
				|		ИЗ
				|			Справочник.Заметки.смартСтатусыВзаимоотношенийСКлиентомПоЗаметке КАК ЗаметкисмартСтатусыВзаимоотношенийСКлиентами
				|		ГДЕ
				|			ЗаметкисмартСтатусыВзаимоотношенийСКлиентами.Ссылка = &Ссылка) КАК СтатусыВЗаметке
				|		ПО смартСтатусыВзаимоотношенийСКлиентами.Ссылка = СтатусыВЗаметке.смартСтатусВзаимоотношенийСКлиентом
				|ГДЕ
				|	НЕ смартСтатусыВзаимоотношенийСКлиентами.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		смартСтатусы.Добавить(Выборка.Значение,,Выборка.Пометка);
	КонецЦикла;
	//-- #1313 смарт: Фролов 16.02.2023
КонецПроцедуры 

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//++ #1313 смарт: Фролов 16.02.2023 //смартСтатусыВзаимоотношенийСКлиентомПоЗаметке
	ТекущийОбъект.смартСтатусыВзаимоотношенийСКлиентомПоЗаметке.Очистить();
	Для каждого Стр Из смартСтатусы Цикл
		Если Стр.Пометка Тогда
			СтрСтатусы=ТекущийОбъект.смартСтатусыВзаимоотношенийСКлиентомПоЗаметке.Добавить();	
			СтрСтатусы.смартСтатусВзаимоотношенийСКлиентом=Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	//-- #1313 смарт: Фролов 16.02.2023
КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

//Каратеев +
&НаСервере
Процедура УстановитьДатуЗаметки()
	
	Объект.ДатаИзменения = ТекущаяДатаСеанса();
	
КонецПроцедуры //Каратеев - 

//Каратеев +
&НаКлиенте
Процедура СодержаниеПриИзменении(Элемент)
	
	УстановитьДатуЗаметки();	
	
КонецПроцедуры //Каратеев - 

//++ #1313 смарт: Фролов 16.02.2023 //Добавить в заметки статусы отказов клиентов, чтобы строить отчет с отбором по этим статусам  
&НаКлиенте
Процедура смартСтатусыПометкаПриИзмененииПосле(Элемент)

	ЭтаФорма.Модифицированность=Истина;

КонецПроцедуры //-- #1313 смарт: Фролов 16.02.2023

#КонецОбласти