
&Перед("ОбработкаРасшифровкиСДополнительнымМенюЗавершение")
Процедура смарт_ОбработкаРасшифровкиСДополнительнымМенюЗавершение(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры)
	
	Если (ДополнительныеПараметры.КлючОбъекта="Отчет.ОстаткиИДоступностьТоваров"
		  ИЛИ ДополнительныеПараметры.КлючОбъекта="Отчет.смартОстаткиИДоступностьТоваровТранзит") //++ #Б2222 смарт: Шляпников 24.02.2025 / Разворачивать значения отчета "Остатки и доступность для менеджеров"
		И ДополнительныеПараметры.ПараметрыФормыРасшифровки.Свойство("Номенклатура") 
		И ДополнительныеПараметры.ПараметрыФормыРасшифровки.Свойство("Склад") Тогда 
		Для Каждого Эл Из ДополнительныеПараметры.ПараметрыФормыРасшифровки.Отбор.Элементы Цикл 
			Если Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Номенклатура") 
				Или Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Склад") Тогда
				Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
				Эл.ПравоеЗначение=?(Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Склад"),
									ДополнительныеПараметры.ПараметрыФормыРасшифровки.Склад,
									ДополнительныеПараметры.ПараметрыФормыРасшифровки.Номенклатура);
			КонецЕсли;	
		КонецЦикла;
		Если ДополнительныеПараметры.ПараметрыФормыРасшифровки.Свойство("Номенклатура_Родитель") Тогда 
			ДополнительныеПараметры.ПараметрыФормыРасшифровки.Удалить("Номенклатура_Родитель");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
