
#Область ОбработчикиСобытийФормы

&НаСервере
//++ #Б-4962 смарт: Фролов 12.11.2025 //Доработка справочника Источники Рекламного взаимодействия. 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеРекламныхИсточников") Тогда
	
		Элементы.Код.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Родитель.ТолькоПросмотр = Истина;
		Элементы.Канал.ТолькоПросмотр = Истина;
		Элементы.РазрешеноИспользоватьВЗаказеКлиента.ТолькоПросмотр = Истина;
		Элементы.ДатаНачала.ТолькоПросмотр = Истина;
		Элементы.ДатаОкончания.ТолькоПросмотр = Истина;
		Элементы.ОборудованиеИОператорыПроцент.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-4962 смарт: Фролов 12.11.2025

&НаКлиенте
//++ #Б-4962 смарт: Фролов 12.11.2025 //Доработка справочника Источники Рекламного взаимодействия.
Процедура ОборудованиеИОператорыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.Процент = 1;	
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-4962 смарт: Фролов 12.11.2025

&НаСервере
//++ #Б-5018 смарт: Фролов 19.11.2025 //Корректировка справочника Источники Рекламного взаимодействия
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("Оборудование");
	ТаблицаПроверки.Колонки.Добавить("Партнер");
	
	Для Каждого СтрОборудованиеИОператоры Из Объект.ОборудованиеИОператоры Цикл
		
		СтрокиТаблицаПроверки = ТаблицаПроверки.НайтиСтроки(Новый Структура("Оборудование, Партнер", 
			СтрОборудованиеИОператоры.Оборудование, СтрОборудованиеИОператоры.Партнер));
			
		Если СтрокиТаблицаПроверки.Количество() > 0 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Обнаружены дубли оборудования и партнера, запись не возможна!");
			Отказ = Истина;		
			
		Иначе
			
			СтрТаблицаПроверки = ТаблицаПроверки.Добавить();
			СтрТаблицаПроверки.Оборудование = СтрОборудованиеИОператоры.Оборудование; 
			СтрТаблицаПроверки.Партнер = СтрОборудованиеИОператоры.Партнер;
				
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры //-- #Б-5018 смарт: Фролов 19.11.2025

#КонецОбласти  

&НаСервере
//++ #Б-4962 смарт: Фролов 19.11.2025 //Доработка справочника Источники Рекламного взаимодействия.
Процедура ЗаполнитьИзЗаказовНаСервере()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.РекламноеВоздействие КАК РекламноеВоздействие,
	|	ЗаказКлиентаТовары.Номенклатура КАК Оборудование,
	|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Клиент
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиентаТовары.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|ГДЕ
	|	ЗаказКлиентаТовары.РекламноеВоздействие = &РекламноеВоздействие
	|	И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И СостоянияЗаказовКлиентов.ПроцентОплаты > 0");
	Запрос.УстановитьПараметр("РекламноеВоздействие", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокиОборудование = Объект.ОборудованиеИОператоры.НайтиСтроки(Новый Структура("Оборудование", Выборка.Оборудование));

		Если СтрокиОборудование.Количество() = 0 Тогда
			
			СтрОборудованиеИОператоры = Объект.ОборудованиеИОператоры.Добавить();
			СтрОборудованиеИОператоры.Оборудование = Выборка.Оборудование;
			СтрОборудованиеИОператоры.Процент = 1;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры //-- #Б-4962 смарт: Фролов 19.11.2025

&НаКлиенте
//++ #Б-4962 смарт: Фролов 19.11.2025 //Доработка справочника Источники Рекламного взаимодействия.
Процедура ЗаполнитьИзЗаказов(Команда)
	ЗаполнитьИзЗаказовНаСервере();
КонецПроцедуры //-- #Б-4962 смарт: Фролов 19.11.2025



