
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	CRM_КлассификаторыЭкспортныеМетоды.ЗаполнитьИменаСписковУправленияКлассификацией(Элементы.ИмяСписка.СписокВыбора);	
	ДоступПредставление = ПредставлениеНастроекДоступа(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ИмяСпискаПредставление = Элементы.ИмяСписка.СписокВыбора.НайтиПоЗначению(ТекущийОбъект.ИмяСписка).Представление;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьНастройкиКлассификации", Объект.Ссылка, Объект.ИмяСписка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Описание", НСтр("ru='Описание';en='Description'"));
КонецПроцедуры

&НаКлиенте
Процедура ДоступПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокДоступа = Новый СписокЗначений;
	Для каждого СтрокаПользователь Из Объект.Доступ Цикл
		СписокДоступа.Добавить(СтрокаПользователь.Пользователь);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Автор"		   , Объект.Автор);
	ПараметрыФормы.Вставить("СписокДоступа", СписокДоступа);
	
	Оповещение = Новый ОписаниеОповещения("ПослеРедактированияДоступа", ЭтотОбъект);
	ОткрытьФорму("Справочник.CRM_НастройкиУправленияКлассификацией.Форма.НастройкаДоступа", 
		ПараметрыФормы, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияДоступа(Структура, Контекст) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Доступ.Очистить();
	Для Каждого ЭлементСписка Из Структура.СписокДоступа Цикл
		Объект.Доступ.Добавить().Пользователь = ЭлементСписка.Значение;
	КонецЦикла;
	
	ДоступПредставление = ПредставлениеНастроекДоступа(ЭтотОбъект);
	Модифицированность = Истина;

КонецПроцедуры // ПослеРедактированияДоступа()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеНастроекДоступа(Форма)
	
	Результат = "";
	Для Каждого СтрокаТаблицы Из Форма.Объект.Доступ Цикл
		ПредставлениеСтроки = СокрЛП(Строка(СтрокаТаблицы.Пользователь));
		Если ПредставлениеСтроки <> "" Тогда
			Если Результат = "" Тогда
				Результат = Результат + ПредставлениеСтроки;
			Иначе
				Результат = Результат +", "+ ПредставлениеСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = "" Тогда
		Результат = НСтр("ru='Пользователи не выбраны';en='No users selected'");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

