
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	СинонимЭлемента = "";
	СсылкаНаСправочникДопОбработок = ПолучитьСсылкуНаПредопределенныеЗначения(СинонимЭлемента);
		
	Если НЕ ЗначениеЗаполнено(СсылкаНаСправочникДопОбработок) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В справочнике ""Предопределенные значения (смарт)"" не заполнена ссылка на внешний отчет ""%1"".'"),
			Строка(СинонимЭлемента));
		Возврат;
	КонецЕсли;
	
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СсылкаНаСправочникДопОбработок);
	
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", , );
	
КонецПроцедуры

Функция ПолучитьСсылкуНаПредопределенныеЗначения(СинонимЭлемента)
	
	СсылкаНаПредопределенныеЗначения = Справочники.смартПредопределенныеЗначения.ОтчетЗапчастиПоЗаявкамНаГарантийныйРемонт;
	СинонимЭлемента = СсылкаНаПредопределенныеЗначения.Наименование;
	СсылкаНаСправочникДопОбработок = СсылкаНаПредопределенныеЗначения.Значение;
	
	Возврат СсылкаНаСправочникДопОбработок;
	
КонецФункции
