#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// Получение ФО
	ИспользоватьНесколькоСкладов = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов");
	ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	ИспользоватьРеализациюПоНесколькимЗаказам = ПолучитьФункциональнуюОпцию("ИспользоватьРеализациюПоНесколькимЗаказам");
	ИспользоватьАктыВыполненныхРаботПоНесколькимЗаказам = ПолучитьФункциональнуюОпцию("ИспользоватьАктыВыполненныхРаботПоНесколькимЗаказам");
	ИспользоватьОрдернуюСхемуПриОтгрузке = ПолучитьФункциональнуюОпцию("ИспользоватьОрдернуюСхемуПриОтгрузке");

	// Установка отборов.
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);

	Если СтруктураБыстрогоОтбора <> Неопределено Тогда
		СтруктураБыстрогоОтбора.Свойство("Организация",        Организация);
		СтруктураБыстрогоОтбора.Свойство("Склад",              Склад);
		СтруктураБыстрогоОтбора.Свойство("СостояниеНакладной", СостояниеНакладной);
		СтруктураБыстрогоОтбора.Свойство("СостояниеОрдера",    СостояниеОрдера);
	КонецЕсли;

	Если Не ИспользоватьНесколькоСкладов Тогда
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Склад = Справочники.Склады.СкладПоУмолчанию();
		КонецЕсли;
	КонецЕсли;


	УстановитьОтборПоСкладуСервер();

	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(СписокРаспоряженияНаОформление,
	"СостояниеНакладной",
	?(ЗначениеЗаполнено(СостояниеНакладной), Число(СостояниеНакладной), СостояниеНакладной),
	СтруктураБыстрогоОтбора,,,
	Истина);

	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(СписокРаспоряженияНаОформление,
	"СостояниеОрдера",
	?(ЗначениеЗаполнено(СостояниеОрдера), Число(СостояниеОрдера), СостояниеОрдера),
	СтруктураБыстрогоОтбора,,,
	Истина);

	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(СписокРаспоряженияНаОформление,
	"Организация",
	Организация,
	СтруктураБыстрогоОтбора);

	Элементы.Склад.Видимость = ИспользоватьНесколькоСкладов;

	Элементы.СписокРаспоряженияНаОформлениеСостояниеОрдера.Видимость = ИспользоватьОрдернуюСхемуПриОтгрузке;
	Элементы.СписокРаспоряженияНаОформлениеСостояниеНакладной.Видимость = ИспользоватьРасширенныеВозможностиЗаказаКлиента;

	Элементы.СостояниеОрдера.Видимость = ИспользоватьОрдернуюСхемуПриОтгрузке;
	Элементы.СостояниеНакладной.Видимость = ИспользоватьРасширенныеВозможностиЗаказаКлиента;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"СписокРаспоряженияНаОформлениеОрганизация",
	"Видимость",
	ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций"));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"СписокРаспоряженияНаОформлениеСклад",
	"Видимость",
	ИспользоватьНесколькоСкладов);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"СписокРаспоряженияНаОформлениеСделка",
	"Видимость",
	ПолучитьФункциональнуюОпцию("ИспользоватьСделкиСКлиентами"));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"СписокРаспоряженияНаОформлениеВалюта",
	"Видимость",
	ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют"));

	СписокРаспоряженияНаОформление.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));

	ЕстьПравоЧтенияОстатков = ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ЗаказыКлиентов)
	И ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ТоварыКОтгрузке);

	ЕстьПравоДобавленияПередачиТоваров = Ложь;

	Элементы.СписокРаспоряженияНаОформление.Видимость = ЕстьПравоЧтенияОстатков;

	Элементы.СписокРаспоряженияНаОформлениеОформитьПоЗаказам.Видимость = ЕстьПравоДобавленияПередачиТоваров
	Или ПравоДоступа("Добавление", Метаданные.Документы.АктВыполненныхРабот)
	Или ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг);
	Элементы.СписокРаспоряженияНаОформлениеОформитьПоОтгрузке.Видимость = ЕстьПравоДобавленияПередачиТоваров
	Или ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг);
	Элементы.СписокРаспоряженияНаОформлениеСостояниеВыполнения.Видимость = ПравоДоступа("Просмотр", Метаданные.Отчеты.СостояниеВыполненияДокументов);

	ЗаполнитьСпискиВыбораПоСостояниямОтгрузки();

	#Вставка
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ВЫБОР
																		|КОГДА ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
																		|	ТОГДА ВЫРАЗИТЬ(ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки КАК Документ.ЗаказКлиента).Партнер
																		|КОГДА ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
																		|	ТОГДА ВЫРАЗИТЬ(ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки КАК Документ.ЗаявкаНаВозвратТоваровОтКлиента).Партнер
																		|КОГДА ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
																		|	ТОГДА ВЫРАЗИТЬ(ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки КАК Документ.РеализацияТоваровУслуг)", 
																		 "ВтНовыеОрдера КАК ТоварыКОтгрузкеПереопределяемый", 
																		 "ТоварыКОтгрузкеПереопределяемый.ДокументОтгрузки КАК Ссылка,",
																		 "СписокРаспоряженияНаОформление",
																		 "Партнер КОНЕЦ",
																		 Ложь,
																		 "СписокРаспоряженияНаОформлениеПартнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти