
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ЖурналСозданныхОбъектов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ЖурналСозданныхОбъектов));
	Объект.ЖурналСобытий = Параметры.ЖурналСобытий;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЖурналСозданныхОбъектов

&НаКлиенте
Процедура ЖурналСозданныхОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Элементы.ЖурналСозданныхОбъектов.ТекущиеДанные.ОбъектДанных);
КонецПроцедуры

#КонецОбласти