
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЦветов = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьСписокЦветов();
	ТаблицаЗнач = РеквизитФормыВЗначение("Список");
	Для Каждого Цв Из СписокЦветов Цикл
		НоваяСтрока = ТаблицаЗнач.Добавить();
		НоваяСтрока.Картинка 		= Цв.Ключ;
		НоваяСтрока.Представление 	= Цв.Значение.Представление;
		НоваяСтрока.Красный 		= Цв.Значение.Цвет.Красный;	
		НоваяСтрока.Зеленый 		= Цв.Значение.Цвет.Зеленый;
		НоваяСтрока.Синий  			= Цв.Значение.Цвет.Синий;
	КонецЦикла;
	ТаблицаЗнач.Сортировать("Картинка");
	ЗначениеВРеквизитФормы(ТаблицаЗнач, "Список");
	Элементы.Список.ТекущаяСтрока =  Список.Индекс(Список.НайтиСтроки(Новый Структура("Картинка", Параметры.ТекущийЦвет))[0]);  
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "Выбор" таблицы формы "Список".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Список.НайтиСтроки(Новый Структура("Картинка", Элемент.ТекущиеДанные.Картинка)));
КонецПроцедуры // СписокВыбор() 

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик команды формы "Выбрать".
//
Процедура Выбрать(Команда)
	Закрыть(Список.НайтиСтроки(Новый Структура("Картинка", Элементы.Список.ТекущиеДанные.Картинка)));
КонецПроцедуры // Выбрать()

#КонецОбласти



