

#Область ДоработкиКаратеев

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	//смартПартнер 		= Параметры.Партнер;  ЭтотОбъект.Параметры.Партнер
	//смартДатаДобавления 	= Параметры.ДатаДобавления;
	
	//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента
	Если Параметры.Свойство("смартТипОборудованияКлиента") <> Неопределено
		И ЗначениеЗаполнено(Параметры.смартТипОборудованияКлиента) Тогда
				
		НовыйПараметр = Новый ПараметрВыбора("Отбор.смартТипОборудованияКлиента", Параметры.смартТипОборудованияКлиента);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.смартВыбратьИзОборудованияКлиента.ПараметрыВыбора = НовыеПараметры;
		
		
		Если Параметры.смартТипОборудованияКлиента = Перечисления.смартТипыОборудованияКлиента.Чернила Тогда
			Элементы.ГруппаВыбораОборудованиеКлиента.Заголовок = "Выбор расходного материала";
			ЭтаФорма.Заголовок = "Форма добавления расходного материала клиента";
		КонецЕсли;
		
	КонецЕсли;
	//-- смарт:ММ 23.04.2020
	
КонецПроцедуры

&НаКлиенте
Процедура смартЗаписать(Команда)
	
	Отказ = Ложь;
	
	ПодобранноеОборудование = Новый Массив;
	
	ПараметрыОборудования = Новый Структура;
	
	ПараметрыОборудования.Вставить("смартОборудованиеКлиента", смартВыбратьИзОборудованияКлиента);	
	ПараметрыОборудования.Вставить("смартДатаДобавления", смартДатаДобавления);
	ПараметрыОборудования.Вставить("смартКомментарий", смартКомментарий);

	ПодобранноеОборудование.Добавить(ПараметрыОборудования);
	
	Закрыть(ПодобранноеОборудование);
	
КонецПроцедуры
 
#КонецОбласти 
