
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_Интерес.Ссылка КАК Интерес,
	|	CRM_Интерес.СостояниеИнтереса КАК Этап,
	|	ВЫБОР
	|		КОГДА CRM_Интерес.смартИтоговаяКвалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка)
	|			ТОГДА CRM_Интерес.смартПредварительнаяКвалификация
	|		ИНАЧЕ CRM_Интерес.смартИтоговаяКвалификация
	|	КОНЕЦ КАК Квалификация
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	НЕ CRM_Интерес.ПометкаУдаления
	|	И НЕ CRM_Интерес.Завершен
	|	И CRM_Интерес.Партнер = &Партнер");
	Запрос.УстановитьПараметр("Партнер", ЭтаФорма.Параметры.Партнер);

	ИнтересыПоПартнеру.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ИнтересыПоПартнеру.Количество() = 0 Тогда
		
		Элементы.ИнтересыПоПартнеру.Видимость = Ложь;
		Элементы.ФормаПривязатьКИнтересу.Видимость = Ложь;
		
	КонецЕсли;
	
	Партнер = ЭтаФорма.Параметры.Партнер;
	ЗаказКлиента = ЭтаФорма.Параметры.ЗаказКлиента;
	
КонецПроцедуры

&НаСервере
Процедура ПривязатьКИнтересуНаСервере()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_Интерес.Дата КАК Дата,
	|	CRM_Интерес.Номер КАК Номер,
	|	CRM_Интерес.Тема КАК Тема,
	|	CRM_Интерес.Партнер КАК Партнер,
	|	CRM_Интерес.Ответственный КАК Ответственный,
	|	CRM_Интерес.Подразделение КАК Подразделение,
	|	CRM_Интерес.Организация КАК Организация,
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ИСТИНА КАК ВведенНаОсновании,
	|	ЛОЖЬ КАК ОсновнойИнтерес
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Ссылка = &Интерес");
	Запрос.УстановитьПараметр("Интерес", ВыбранныйИнтерес);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();
	
	ЗаказОбъект.ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов", Результат);
	
	Отказ = Ложь;
	
	CRM_КлиентыСервер.ЗарегистрироватьОбъектВОбщемЖурнале(ЗаказОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьКИнтересу(Команда)
	
	Если ЗначениеЗаполнено(ВыбранныйИнтерес) Тогда
		
		ПривязатьКИнтересуНаСервере();
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Интерес", ВыбранныйИнтерес);
		
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Интерес!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиРегионВерхнегоУровня(Регион)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегионПоиска = Регион;
	Пока ЗначениеЗаполнено(РегионПоиска.Родитель) Цикл
		РегионПоиска = НайтиРегионВерхнегоУровня(РегионПоиска.Родитель);
	КонецЦикла;
	
	Возврат РегионПоиска;
	
КонецФункции

&НаСервере
Функция ВернутьКонтрольныеДатуВремя(Менеджер, Квалификация)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВремяПоГринвичу = Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT;
	
	ПриведеннаяТекущаяДата=ТекущаяДата() + (ВремяПоГринвичу - 3) * 3600;
	Если НачалоДня(ТекущаяДата()) + 3600 * 17 >= ПриведеннаяТекущаяДата Тогда //Определяем не закончился ли рабочий день
		
		//Успеваем сегодня
		Если НачалоДня(ТекущаяДата()) + 3600 * 9 >= ПриведеннаяТекущаяДата ТОгда
			Возврат НачалоДня(ТекущаяДата()) + 3600 * 9 + Квалификация.ВремяРеакции * 3600;
		Иначе	
			Возврат ПриведеннаяТекущаяДата + Квалификация.ВремяРеакции * 3600;
		КонецЕсли;
		
	Иначе
		
		//Переносим на следующий рабочий день
		СледующийРабочийДень = ВернутьСледующуюРабочуюДату(ПриведеннаяТекущаяДата + 24 * 3600);
		КонтрольнаяДата = СледующийРабочийДень + 3600 * 9 - (ВремяПоГринвичу - 3) * 3600 + Квалификация.ВремяРеакции * 3600;
		Возврат КонтрольнаяДата;
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ВернутьСледующуюРабочуюДату(СледующийДень)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ПараметрыПолученияБлижайшихРабочихДат = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат(Календарь);
	ПараметрыПолученияБлижайшихРабочихДат.УчитыватьНерабочиеПериоды = Ложь;
	
	МассивДат = Новый Массив;
	МассивДат.Добавить(СледующийДень);
	СоответствиеДатаЗаказаДатаЗаказаКалендарная = КалендарныеГрафики.БлижайшиеРабочиеДаты(Календарь, МассивДат, ПараметрыПолученияБлижайшихРабочихДат);
	РабочаяДата = СоответствиеДатаЗаказаДатаЗаказаКалендарная.Получить(НачалоДня(СледующийДень));
	
	Возврат РабочаяДата;
	
КонецФункции

&НаСервере
Процедура СоздатьИнтересНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		ДатаКонтроля = ВернутьКонтрольныеДатуВремя(ПараметрыСеанса.ТекущийПользователь, ВыбраннаяКвалификация);
		
		БизнесРегион = НайтиРегионВерхнегоУровня(Партнер.БизнесРегион);
		
		ОбЛид = Документы.смартЛид.СоздатьДокумент();
		ОбЛид.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ОбЛид.Распределил = ПараметрыСеанса.ТекущийПользователь;
		ОбЛид.СостояниеЛида = Перечисления.смартСостоянияЛидов.Распределен;
		ОбЛид.БизнесРегион = БизнесРегион;
		ОбЛид.Квалификация = ВыбраннаяКвалификация;
		ОбЛид.Дата = ТекущаяДата();
		ОбЛид.БизнесРегионТекст = БизнесРегион;
		ОбЛид.Партнер = Партнер;
		ОбЛид.КонтактноеЛицо = ЗаказКлиента.КонтактноеЛицо;
		
		Если ЗаказКлиента.Товары.Количество() > 0 Тогда
			ОбЛид.Тема = ЗаказКлиента.Товары[0].Номенклатура;
			ОбЛид.ТекстИсточника = ЗаказКлиента.Товары[0].Номенклатура;
		Иначе	
			ОбЛид.Тема = "Создан на основании заказа клиента № " + ЗаказКлиента.Номер;
		КонецЕсли;	
			
		ОбЛид.Записать(РежимЗаписиДокумента.Запись);
		
		ОбИнтерес = Документы.CRM_Интерес.СоздатьДокумент();
		ОбИнтерес.Дата=ТекущаяДата();
		ОбИнтерес.ДокументОснование = ОбЛид.Ссылка;
		ОбИнтерес.смартИнтересКанал = ВыбранныйКанал;
		ОбИнтерес.смартИнтересИсточник = ВыбранныйИсточник;
		ОбИнтерес.ЦенаВключаетНДС = Истина;
		ОбИнтерес.КонтактноеЛицо = ЗаказКлиента.КонтактноеЛицо;
		ОбИнтерес.Партнер = Партнер;
		ОбИнтерес.РучнойВводДатыПродажи = Истина;
		ОбИнтерес.ТипУслуги = ВыбраннаяКвалификация.ТипУслуги;
		Если ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда
			ОбИнтерес.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Иначе	
			ОбИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		КонецЕсли;
		ОбИнтерес.смартВоронкаНовые = Истина;
		ОбИнтерес.Тема = ОбЛид.Тема;
		ОбИнтерес.Ответственный = ОбЛид.Ответственный;
		ОбИнтерес.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ОбИнтерес.Ответственный, "ОсновнаяОрганизация");
		ОбИнтерес.смартПредварительнаяКвалификация = ВыбраннаяКвалификация;
		ОбИнтерес.смартИтоговаяКвалификация = ВыбраннаяКвалификация;
		ОбИнтерес.СостояниеИнтереса = ВыбраннаяКвалификация.СтартовыйЭтап;
		ОбИнтерес.СрокРеакции = ДатаКонтроля;
		ОбИнтерес.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
		ОбИнтерес.Офис = ПараметрыСеанса.ТекущийПользователь.Подразделение.CRM_офис;
		ОбИнтерес.смартСозданВручнуюПоЗаказуКлиента = Истина;
		
		Для Каждого СтрТовары Из ЗаказКлиента.Товары Цикл
			
			СтрТоварыИнтерес = ОбИнтерес.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТоварыИнтерес, СтрТовары);
			
		КонецЦикла;	
		
		ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
		
		НаборЗаписей = РегистрыСведений.смартИсторияРаботыСЛидом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лид.Установить(ОбЛид.Ссылка);
		НаборЗаписей.Отбор.Менеджер.Установить(ПараметрыСеанса.ТекущийПользователь);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			СтрНаборЗаписей = НаборЗаписей.Добавить();
		Иначе	
			СтрНаборЗаписей = НаборЗаписей[0];	
		КонецЕсли;
		СтрНаборЗаписей.Лид = ОбЛид.Ссылка;
		СтрНаборЗаписей.Менеджер = ПараметрыСеанса.ТекущийПользователь;
		СтрНаборЗаписей.ДатаВыдачи = ТекущаяДата();
		СтрНаборЗаписей.ДатаКонтроля = ДатаКонтроля;
		СтрНаборЗаписей.ДатаОбработки = Неопределено;
		СтрНаборЗаписей.ПервыйКонтакт = Неопределено;
		НаборЗаписей.Записать(Истина);
		
		ВыбранныйИнтерес = ОбИнтерес.Ссылка;
		ПривязатьКИнтересуНаСервере();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Не удалось создать документы");
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьИнтерес(Команда)
	
	МожноСоздатьИнтерес = Истина;
	
	Если НЕ ЗначениеЗаполнено(ВыбраннаяКвалификация) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена квалификация!", , "ВыбраннаяКвалификация");
		МожноСоздатьИнтерес = Ложь;	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйКанал) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен канал!", , "ВыбранныйКанал");
		МожноСоздатьИнтерес = Ложь;	
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйИсточник) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен источник!", , "ВыбранныйИсточник");
		МожноСоздатьИнтерес = Ложь;	
		
	КонецЕсли;	
	
	Если МожноСоздатьИнтерес Тогда
		
		СоздатьИнтересНаСервере();
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Интерес", ВыбранныйИнтерес);
		
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтересыПоПартнеруПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИнтересыПоПартнеру.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка Тогда
		
		ВыбранныйИнтерес = ТекущиеДанные.Интерес;
		
	Иначе	
		
		ВыбранныйИнтерес = Неопределено;
		
	КонецЕсли;	
	
	Для Каждого СтрИнтересы Из ИнтересыПоПартнеру Цикл
		
		Если НЕ СтрИнтересы.Интерес = ВыбранныйИнтерес Тогда
			
			СтрИнтересы.Пометка = Ложь;
			
		КонецЕсли;	
		
	КонецЦикла;	
		
КонецПроцедуры
