
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьСписокТипов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Строка(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСписокТипов()
	
	Элементы.ТипЗначения.СписокВыбора.Очистить();
	МассивТипов = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка)).Тип.Типы();
	Для Индекс = 0 По МассивТипов.ВГраница() Цикл
		
		Массив = Новый Массив;
		Массив.Добавить(МассивТипов[Индекс]);
		Элементы.ТипЗначения.СписокВыбора.Добавить(Новый ОписаниеТипов(Массив),Строка(МассивТипов[Индекс]));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
