
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура(
			"Отбор, КлючНастроек, СформироватьПриОткрытии",
			Новый Структура("КонтактноеЛицо", ПараметрКоманды),
			"КонтактноеЛицо",
			Истина);

	ОткрытьФорму("Обработка.CRM_ДокументыПоКонтактномуЛицу.Форма.ДокументыПоКонтактномуЛицу",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти
