
&ИзменениеИКонтроль("ВоронкаПродажПолучитьТекстЗапроса")
//++ #Б-7568 смарт: Фролов 27.07.2026 //задачи ком. отдела 21.07. Добавить отбор в отчет Воронка продаж
Функция смарт_ВоронкаПродажПолучитьТекстЗапроса(Форма)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВоронкиПродаж.Ссылка КАК Этап,
	|	ВоронкиПродажСостав.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВоронкиПродаж.РеквизитДопУпорядочивания КАК Порядок
	|ПОМЕСТИТЬ ЭтапыТочекМаршрута
	|ИЗ
	|	Справочник.CRM_ВоронкиПродаж.Состав КАК ВоронкиПродажСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВоронкиПродаж КАК ВоронкиПродаж
	|		ПО (ВоронкиПродаж.Ссылка = ВоронкиПродажСостав.Ссылка)
	|			И (ВоронкиПродаж.Родитель = &Воронка)
	|			И (НЕ ВоронкиПродаж.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CRM_СостоянияВоронкиПродаж.Объект КАК Объект,
	|	МИНИМУМ(CRM_СостоянияВоронкиПродаж.ДатаНачала) КАК ПерваяДата,
	|	МАКСИМУМ(ЭтапыТочекМаршрута.Порядок) КАК ПорядокМакс,
	|	МАКСИМУМ(CRM_СостоянияВоронкиПродаж.Сумма) КАК Сумма
	|ПОМЕСТИТЬ CRM_СостоянияВоронкиПродажОбъекты
	|ИЗ
	|	РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
	|		ПО (ЭтапыТочекМаршрута.ТочкаМаршрута = CRM_СостоянияВоронкиПродаж.Этап)
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|		ПО (ПартнерыСегмента.Партнер = CRM_СостоянияВоронкиПродаж.Партнер)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИсточникиПервичногоИнтересаСрезПоследних.Период КАК Период,
	|			ИсточникиПервичногоИнтересаСрезПоследних.Партнер КАК Партнер,
	|			ИсточникиПервичногоИнтересаСрезПоследних.КаналПервичногоИнтереса КАК ИсточникПривлечения,
	|			ИсточникиПервичногоИнтересаСрезПоследних.ИсточникПервичногоИнтереса КАК ЗначениеИсточникаПривлечения
	|		ИЗ
	|			РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(ИсточникиПервичногоИнтересаСрезПоследних.Период) КАК Период,
	|					ИсточникиПервичногоИнтересаСрезПоследних.Партнер КАК Партнер
	|				ИЗ
	|					РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ИсточникиПервичногоИнтересаСрезПоследних.Партнер) КАК МаксДатыСреза
	|				ПО ИсточникиПервичногоИнтересаСрезПоследних.Период = МаксДатыСреза.Период
	|					И ИсточникиПервичногоИнтересаСрезПоследних.Партнер = МаксДатыСреза.Партнер) КАК СрезПервичногоИнтереса
	|		ПО CRM_СостоянияВоронкиПродаж.Партнер = СрезПервичногоИнтереса.Партнер
	|			И CRM_СостоянияВоронкиПродаж.Объект.Дата >= СрезПервичногоИнтереса.Период}
	|ГДЕ
	|	ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИНАЧЕ ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.ПлановаяДата <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА CRM_СостоянияВоронкиПродаж.ПлановаяДата МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИНАЧЕ ВЫБОР
	|						КОГДА CRM_СостоянияВоронкиПродаж.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА CRM_СостоянияВоронкиПродаж.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ
	|	И (ВЫБОР
	|				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
	|					ТОГДА НЕ ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК Документ.CRM_Интерес).ПометкаУдаления
	|				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
	|					ТОГДА НЕ ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК БизнесПроцесс.CRM_БизнесПроцесс).ПометкаУдаления
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|	И (ВЫБОР
	|				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
	|					ТОГДА ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК Документ.CRM_Интерес).ДатаЗакрытия
	|				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
	|					ТОГДА ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК БизнесПроцесс.CRM_БизнесПроцесс).ДатаЗавершения
	|				ИНАЧЕ CRM_СостоянияВоронкиПродаж.ДатаЗавершения
	|			КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ ВЫБОР
	|				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
	|					ТОГДА ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК Документ.CRM_Интерес).ДатаЗакрытия
	|				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
	|					ТОГДА ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК БизнесПроцесс.CRM_БизнесПроцесс).ДатаЗавершения
	|				ИНАЧЕ CRM_СостоянияВоронкиПродаж.ДатаЗавершения
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1))
	#Вставка
	//++ #Б-7568 смарт: Фролов 27.07.2026 //задачи ком. отдела 21.07. Добавить отбор в отчет Воронка продаж
	|	И ВЫБОР
	|			КОГДА &смартТолькоИнтересыНаОснованииЛида 
	|				ТОГДА 
	|					ВЫБОР КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
	|						ТОГДА CRM_СостоянияВоронкиПродаж.Объект.ДокументОснование ССЫЛКА Документ.смартЛид
	|						ИНАЧЕ ИСТИНА 
	|					КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//-- #Б-7568 смарт: Фролов 27.07.2026
	#КонецВставки
	|{ГДЕ
	|	CRM_СостоянияВоронкиПродаж.Пользователь КАК Пользователь,
	|	CRM_СостоянияВоронкиПродаж.Офис КАК Офис,
	|	CRM_СостоянияВоронкиПродаж.ТипУслуги КАК ТипУслуги,
	|	CRM_СостоянияВоронкиПродаж.Подразделение КАК Подразделение,
	|	CRM_СостоянияВоронкиПродаж.Партнер.БизнесРегион КАК БизнесРегион,
	|	CRM_СостоянияВоронкиПродаж.СостояниеЭтапа КАК СостояниеЭтапа,
	|	ПартнерыСегмента.Сегмент КАК Сегмент,
	|	(CRM_СостоянияВоронкиПродаж.Партнер.ДатаРегистрации > &НачалоПериода
	|			ИЛИ CRM_СостоянияВоронкиПродаж.Партнер ССЫЛКА Справочник.CRM_ПотенциальныеКлиенты) КАК НовыйКлиент,
	|	СрезПервичногоИнтереса.ИсточникПривлечения КАК ИсточникПривлечения,
	|	СрезПервичногоИнтереса.ЗначениеИсточникаПривлечения КАК ЗначениеИсточникаПривлечения,
	|	(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
	|				ТОГДА ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК Документ.CRM_Интерес).Завершен
	|			КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
	|				ТОГДА ВЫРАЗИТЬ(CRM_СостоянияВоронкиПродаж.Объект КАК БизнесПроцесс.CRM_БизнесПроцесс).ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Завершено}
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_СостоянияВоронкиПродаж.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
	|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
	|ПОМЕСТИТЬ КалендарныйГрафик
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(CRM_СостоянияВоронкиПродажОбъекты.ПерваяДата) КАК ПерваяДата
	|		ИЗ
	|			CRM_СостоянияВоронкиПродажОбъекты КАК CRM_СостоянияВоронкиПродажОбъекты) КАК ВложенныйЗапрос
	|		ПО КалендарныеГрафики.ДатаГрафика >= ВложенныйЗапрос.ПерваяДата
	|ГДЕ
	|	КалендарныеГрафики.Календарь = &Календарь
	|	И КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_СостоянияВоронкиПродажОбъекты.Объект КАК Объект,
	|	ЭтапыТочекМаршрута.Этап КАК Этап,
	|	CRM_СостоянияВоронкиПродажОбъекты.ПерваяДата КАК ПерваяДата,
	|	CRM_СостоянияВоронкиПродажОбъекты.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЭтапыОбъектов
	|ИЗ
	|	CRM_СостоянияВоронкиПродажОбъекты КАК CRM_СостоянияВоронкиПродажОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
	|		ПО (ЭтапыТочекМаршрута.Порядок <= CRM_СостоянияВоронкиПродажОбъекты.ПорядокМакс)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыОбъектов.Этап КАК Этап,
	|	ЭтапыОбъектов.ПерваяДата КАК ПерваяДата,
	|	CRM_СостоянияВоронкиПродаж.Объект КАК Объект,
	|	CRM_СостоянияВоронкиПродаж.СостояниеЭтапа КАК СостояниеЭтапа,
	|	CRM_СостоянияВоронкиПродаж.Партнер КАК Партнер,
	|	CRM_СостоянияВоронкиПродаж.Пользователь КАК Пользователь,
	|	CRM_СостоянияВоронкиПродаж.Подразделение КАК Подразделение,
	|	CRM_СостоянияВоронкиПродаж.Офис КАК Офис,
	|	CRM_СостоянияВоронкиПродаж.КартаМаршрута КАК КартаМаршрута,
	|	CRM_СостоянияВоронкиПродаж.ТипУслуги КАК ТипУслуги,
	|	CRM_СостоянияВоронкиПродаж.ДатаНачала КАК ДатаНачала,
	|	CRM_СостоянияВоронкиПродаж.ДатаЗавершения КАК ДатаЗавершения,
	|	CRM_СостоянияВоронкиПродаж.ПлановаяДата КАК ПлановаяДата,
	|	ВЫБОР
	|		КОГДА CRM_СостоянияВоронкиПродаж.Сумма = 0
	|				ИЛИ CRM_СостоянияВоронкиПродаж.Сумма ЕСТЬ NULL
	|			ТОГДА ЭтапыОбъектов.Сумма
	|		ИНАЧЕ CRM_СостоянияВоронкиПродаж.Сумма
	|	КОНЕЦ КАК Сумма,
	|	CRM_СостоянияВоронкиПродаж.СуммаОтгружено КАК СуммаОтгружено,
	|	CRM_СостоянияВоронкиПродаж.СуммаОплачено КАК СуммаОплачено,
	|	CRM_СостоянияВоронкиПродаж.Количество КАК Количество
	|ПОМЕСТИТЬ CRM_СостоянияВоронкиПродажОтбор
	|ИЗ
	|	ЭтапыОбъектов КАК ЭтапыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
	|			ПО CRM_СостоянияВоронкиПродаж.Этап = ЭтапыТочекМаршрута.ТочкаМаршрута
	|		ПО (ЭтапыТочекМаршрута.Этап = ЭтапыОбъектов.Этап)
	|			И ЭтапыОбъектов.Объект = CRM_СостоянияВоронкиПродаж.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыОбъектов.Этап КАК Этап,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.Активный)
	|				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоАктивных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно)
	|				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоУспешных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно)
	|				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоНеудачных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПропущенных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.Активный)
	|				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаАктивных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно)
	|				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУспешных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно)
	|				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНеудачных,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа ЕСТЬ NULL
	|				ТОГДА ЭтапыОбъектов.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПропущенных
	|ПОМЕСТИТЬ ИтогиПоЭтапам
	|ИЗ
	|	ЭтапыОбъектов КАК ЭтапыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			CRM_СостоянияВоронкиПродажОтбор.Этап КАК Этап,
	|			CRM_СостоянияВоронкиПродажОтбор.Объект КАК Объект,
	|			МИНИМУМ(CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа) КАК СостояниеЭтапа,
	|			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.Сумма) КАК Сумма,
	|			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.СуммаОтгружено) КАК СуммаОтгружено,
	|			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.СуммаОплачено) КАК СуммаОплачено,
	|			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.Количество) КАК Количество
	|		ИЗ
	|			CRM_СостоянияВоронкиПродажОтбор КАК CRM_СостоянияВоронкиПродажОтбор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			CRM_СостоянияВоронкиПродажОтбор.Этап,
	|			CRM_СостоянияВоронкиПродажОтбор.Объект) КАК CRM_СостоянияВоронкиПродажОтбор
	|		ПО ЭтапыОбъектов.Объект = CRM_СостоянияВоронкиПродажОтбор.Объект
	|			И ЭтапыОбъектов.Этап = CRM_СостоянияВоронкиПродажОтбор.Этап
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыОбъектов.Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_СостоянияВоронкиПродажОтбор.Этап КАК Этап,
	|	CRM_СостоянияВоронкиПродажОтбор.Объект КАК Объект,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.ДатаНачала <= КалендарныйГрафик.ДатаГрафика
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВремяВыполненияВДнях,
	|	СУММА(ВЫБОР
	|			КОГДА CRM_СостоянияВоронкиПродажОтбор.ПерваяДата <= КалендарныйГрафик.ДатаГрафика
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВремяВыполненияВДняхСНачала
	|ПОМЕСТИТЬ ДлительностьПоЭтапамОбъектов
	|ИЗ
	|	CRM_СостоянияВоронкиПродажОтбор КАК CRM_СостоянияВоронкиПродажОтбор
	|		ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик
	|		ПО CRM_СостоянияВоронкиПродажОтбор.ПерваяДата <= КалендарныйГрафик.ДатаГрафика
	|			И (ВЫБОР
	|				КОГДА CRM_СостоянияВоронкиПродажОтбор.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА &ТекущаяДата
	|				ИНАЧЕ CRM_СостоянияВоронкиПродажОтбор.ДатаЗавершения
	|			КОНЕЦ >= КалендарныйГрафик.ДатаГрафика)
	|			И (КалендарныйГрафик.ДеньВключенВГрафик)
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_СостоянияВоронкиПродажОтбор.Этап,
	|	CRM_СостоянияВоронкиПродажОтбор.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДлительностьПоЭтапамОбъектов.Этап КАК Этап,
	|	СУММА(ДлительностьПоЭтапамОбъектов.ВремяВыполненияВДнях) КАК ВремяВыполненияВДнях,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ДлительностьПоЭтапамОбъектов.Объект) <> 0
	|			ТОГДА СУММА(ДлительностьПоЭтапамОбъектов.ВремяВыполненияВДняхСНачала) / КОЛИЧЕСТВО(ДлительностьПоЭтапамОбъектов.Объект)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВремяВыполненияВДняхСНачалаСред
	|ПОМЕСТИТЬ ДлительностьПоЭтапам
	|ИЗ
	|	ДлительностьПоЭтапамОбъектов КАК ДлительностьПоЭтапамОбъектов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДлительностьПоЭтапамОбъектов.Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыТочекМаршрута.Этап КАК Этап,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоАктивных, 0)) КАК КоличествоАктивных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоУспешных, 0)) КАК КоличествоУспешных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоНеудачных, 0)) КАК КоличествоНеудачных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоПропущенных, 0)) КАК КоличествоПропущенных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаАктивных, 0)) КАК СуммаАктивных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаУспешных, 0)) КАК СуммаУспешных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаНеудачных, 0)) КАК СуммаНеудачных,
	|	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаПропущенных, 0)) КАК СуммаПропущенных,
	|	МАКСИМУМ(ЕСТЬNULL(ДлительностьПоЭтапам.ВремяВыполненияВДнях, 0)) КАК ВремяВыполненияВДнях,
	|	МАКСИМУМ(ЕСТЬNULL(ДлительностьПоЭтапам.ВремяВыполненияВДняхСНачалаСред, 0)) КАК ВремяВыполненияВДняхСНачалаСред,
	|	ЭтапыТочекМаршрута.Порядок КАК Порядок
	|ИЗ
	|	ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоЭтапам КАК ИтогиПоЭтапам
	|		ПО (ИтогиПоЭтапам.Этап = ЭтапыТочекМаршрута.Этап)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПоЭтапам КАК ДлительностьПоЭтапам
	|		ПО (ДлительностьПоЭтапам.Этап = ЭтапыТочекМаршрута.Этап)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыТочекМаршрута.Этап,
	|	ЭтапыТочекМаршрута.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Возврат ТекстЗапроса;

КонецФункции //-- #Б-7568 смарт: Фролов 27.07.2026
