#Область СобытияЭлементовФормы

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;

	СписокНоменклатуры = смартПолучитьНоменклатуруЗаказаКлиента(Объект.Основание);
	
	Если СписокНоменклатуры.Найти(ТекущаяСтрока.Номенклатура) = Неопределено Тогда
		
		ТекущаяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		
		ПоказатьПредупреждение(Неопределено, "Номенклатура не найдена в списке отгруженных!");
		
	КонецЕсли; 
	
	ТекущаяСтрока.Серия = ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");
	ТекущаяСтрока.Количество = 0;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		СтандартнаяОбработка = Ложь;
			
		СписокНоменклатуры = смартПолучитьНоменклатуруЗаказаКлиента(Объект.Основание);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокНоменклатуры);
		
		ПараметрыФормыВыбораНоменклатуры = Новый Структура;
		ПараметрыФормыВыбораНоменклатуры.Вставить("Отбор", Отбор);
		ПараметрыФормыВыбораНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		
		Оповещение = Новый ОписаниеОповещения("смартТоварыНоменклатураПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормыВыбораНоменклатуры, Элемент, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024  

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыНоменклатураПослеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда 
		
		ТекущаяСтрока.Номенклатура = РезультатЗакрытия;
		ТекущаяСтрока.Серия = ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыСерияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;

	СписокСерий = смартПолучитьСериюНоменклатурыЗаказаКлиента(Объект.Основание, ТекущаяСтрока.Номенклатура);
	
	Если СписокСерий.Найти(ТекущаяСтрока.Серия) = Неопределено Тогда
		
		ТекущаяСтрока.Серия = ПредопределенноеЗначение("Справочник.Серия.ПустаяСсылка");
		
		ПоказатьПредупреждение(Неопределено, "Серия не найдена в списке отгруженных!");
		
	КонецЕсли; 
	
	ТекущаяСтрока.Количество = 0;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		ПоказатьПредупреждение(Неопределено, "Перед выбором серии необходимо выбрать номенклатуру!");
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокСерий = смартПолучитьСериюНоменклатурыЗаказаКлиента(Объект.Основание, ТекущаяСтрока.Номенклатура);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокСерий);
		
		ПараметрыФормыВыбораСерии = Новый Структура;
		ПараметрыФормыВыбораСерии.Вставить("Отбор", Отбор);
		ПараметрыФормыВыбораСерии.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы); 
		ПараметрыФормыВыбораСерии.Вставить("ВидНоменклатуры", 
				ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "ВидНоменклатуры")); 
		
		Оповещение = Новый ОписаниеОповещения("смартТоварыСерияПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", ПараметрыФормыВыбораСерии, Элемент, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыСерияПослеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда 
		
		ТекущаяСтрока.Серия = РезультатЗакрытия;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;

	МаксимальноеКоличество = смартПолучитКоличествоЗаказаКлиента(Объект.Основание, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика, ТекущаяСтрока.Серия);
	
	//++ #Б4372 смарт: Шляпников 07.10.2025 / Ошибка ЖР. Справочник Претензии клиентов
	Если МаксимальноеКоличество <> NULL И МаксимальноеКоличество <> Неопределено Тогда
		
		Если ТекущаяСтрока.Количество > МаксимальноеКоличество Тогда
			ТекущаяСтрока.Количество = МаксимальноеКоличество;
		КонецЕсли;
		
	Иначе
		ТекущаяСтрока.Количество = 0;
	КонецЕсли;
	//-- #Б4372 смарт: Шляпников 07.10.2025
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
&НаКлиенте
Процедура смарт_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПретензииКлиентов.Форма.смартФормаПодбораТоваровИЗЗаказа" Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			
			Если Объект.смартТовары.НайтиСтроки(ВыбранноеЗначение).Количество() = 0 Тогда
				
				НоваяСтрока = Объект.смартТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбранноеЗначение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
&НаКлиенте
Процедура смартТоварыХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;

	СписокХарактеристик = смартПолучитьХарактеристикуНоменклатурыЗаказаКлиента(Объект.Основание, ТекущаяСтрока.Номенклатура);
	
	Если СписокХарактеристик.Найти(ТекущаяСтрока.Характеристика) = Неопределено Тогда
		
		ТекущаяСтрока.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		
		ПоказатьПредупреждение(Неопределено, "Характеристика не найдена в списке отгруженных!");
		
	КонецЕсли; 
	
	ТекущаяСтрока.Количество = 0;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
&НаКлиенте
Процедура смартТоварыХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		ПоказатьПредупреждение(Неопределено, "Перед выбором характеристики необходимо выбрать номенклатуру!");
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокХарактеристик = смартПолучитьХарактеристикуНоменклатурыЗаказаКлиента(Объект.Основание, ТекущаяСтрока.Номенклатура);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокХарактеристик);
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("Отбор", Отбор);
		ПараметрыФормыВыбора.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы); 
		ПараметрыФормыВыбора.Вставить("ВидНоменклатуры", 
				ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "ВидНоменклатуры")); 
		
		Оповещение = Новый ОписаниеОповещения("смартТоварыХарактеристикаПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора, Элемент, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&НаКлиенте
Процедура смартТоварыХарактеристикаПослеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ТекущаяСтрока = Элементы.смартТовары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда 
		
		ТекущаяСтрока.Характеристика = РезультатЗакрытия;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024

//++ #Б3202 смарт: Шляпников 24.06.2025 / Претензия клиента. Возврат товара.
&НаКлиенте
Процедура смартПартнерыИКонтактныеЛицаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные;
	Элементы.смартТелефонКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(ПолучитьТелефоныКонтактногоЛица(ТекущаяСтрока.КонтактноеЛицо));

КонецПроцедуры

//++ #Б3202 смарт: Шляпников 24.06.2025 / Претензия клиента. Возврат товара.
&НаКлиенте
Процедура смартКонтактноеЛицоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные;
	Элементы.смартТелефонКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(ПолучитьТелефоныКонтактногоЛица(ТекущаяСтрока.КонтактноеЛицо));

КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерПриИзмененииПосле(Элемент)
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

#КонецОбласти


#Область Команды

//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
&НаКлиенте
Процедура смартПодборТоваров(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаказКлиента", Объект.Основание);
	
	ОткрытьФорму("Справочник.ПретензииКлиентов.Форма.смартФормаПодбораТоваровИЗЗаказа", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервереБезКонтекста
Функция смартПолучитьНоменклатуруЗаказаКлиента(Заказ)  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Заказ", Заказ);
	//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
	//старый код закомментил
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ";
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Товары.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	РегистрНакопления.ТоварыКОтгрузке.Обороты(, , , ДокументОтгрузки = &Заказ) КАК Товары
	//|ГДЕ
	//|	Товары.КОтгрузкеРасход <> 0";
	//-- #Б2802 смарт: Шляпников 15.04.2025
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаСервереБезКонтекста
Функция смартПолучитьСериюНоменклатурыЗаказаКлиента(Заказ, Номенклатура)  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
	//старый код закомментил
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Серия КАК Серия
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ
	|	И ЗаказКлиентаТовары.Номенклатура = &Номенклатура";
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Товары.Серия КАК Серия
	//|ИЗ
	//|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	//|			,
	//|			,
	//|			,
	//|			ДокументОтгрузки = &Заказ
	//|				И Номенклатура = &Номенклатура) КАК Товары
	//|ГДЕ
	//|	Товары.КОтгрузкеРасход <> 0";
	//-- #Б2802 смарт: Шляпников 15.04.2025
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
	
КонецФункции

//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
&НаСервереБезКонтекста
Функция смартПолучитьХарактеристикуНоменклатурыЗаказаКлиента(Заказ, Номенклатура)  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ
	|	И ЗаказКлиентаТовары.Номенклатура = &Номенклатура";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Характеристика");
	
КонецФункции

&НаСервереБезКонтекста
Функция смартПолучитКоличествоЗаказаКлиента(Заказ, Номенклатура, Характеристика, Серия)  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", Серия);
	
	//старый код закомментил
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ                              
	//++ #3986 смарт: Ермаков 06.08.2025 / Претензия из заказа клиента, количество товаров не встает корректно 
	// Отключил код
	//|	ЗаказКлиентаТовары.Количество КАК Количество
	// Добавил код
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ
	|	И ЗаказКлиентаТовары.Номенклатура = &Номенклатура
	|	И ЗаказКлиентаТовары.Характеристика = &Характеристика
	|	И ЗаказКлиентаТовары.Серия = &Серия";
	//-- #3986 смарт: Ермаков 06.08.2025
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Товары.КОтгрузкеРасход КАК Количество
	//|ИЗ
	//|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	//|			,
	//|			,
	//|			,
	//|			ДокументОтгрузки = &Заказ
	//|				И Номенклатура = &Номенклатура
	//|				И Серия = &Серия) КАК Товары
	//|ГДЕ
	//|	Товары.КОтгрузкеРасход <> 0";
	//-- #Б2802 смарт: Шляпников 15.04.2025
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Количество;  
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

//++ #Б3202 смарт: Шляпников 24.06.2025 / Претензия клиента. Возврат товара.
&НаСервереБезКонтекста
Функция ПолучитьТелефоныКонтактногоЛица(КонтактноеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Представление");	
	
КонецФункции

#КонецОбласти
