#Область Интерфейс

Процедура ВывестиПредупреждениеОНаличииТоваровСМаркировкой(ЗНАЧ Документ) Экспорт
	
	Если НЕ смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Документ.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокСообщения = Новый Массив;
	МассивСтрокСообщенияЭМ = Новый Массив;
	МассивСтрокСообщенияЭМ.Добавить("В документе содержится товар Экспериментального режима маркировки:");
	
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		МассивСтрокСообщения.Добавить("Предупреждение!
									  |ВНИМАНИЕ! В документе есть товар подлежащий маркировке, при продаже таких товаров, отгрузочные документы УПД должны обязательно подписываться через ЭДО.
									  |Пожалуйста предупредите клиента и согласуйте заранее возможность подписания документов через любого оператора ЭДО.");
		
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		МассивСтрокСообщения.Добавить("Предупреждение!
									  |ВНИМАНИЕ! В документе есть товар подлежащей маркировке, при обработке документов необходимо следовать установленному регламенту.");
		
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		МассивСтрокСообщения.Добавить("Предупреждение!
									  |ВНИМАНИЕ! В документе есть товар подлежащей маркировке, при обработке документов необходимо следовать установленному регламенту.");
		
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		
		МассивСтрокСообщения.Добавить("Предупреждение!
									  |ВНИМАНИЕ! В документе есть товар подлежащей маркировке, при обработке документов необходимо следовать установленному регламенту.");
		
	КонецЕсли;
	
	Для каждого стрТовары Из Документ.Товары Цикл
		
		Если стрТовары.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		Если смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			МассивСтрокСообщения.Добавить(СтрШаблон("'%1' входит в группу маркируемых и имеет признак обязательной маркировки.", стрТовары.Номенклатура));
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокСообщения.Количество() > 1 Тогда
		Если НЕ смартМаркировка.ПредупреждениеПоДокументуБылоОтправленоРанее(Документ) Тогда
			ПоказатьПредупреждение(, СтрСоединить(МассивСтрокСообщения, Символы.ПС));
			смартМаркировка.ЗаписатьИнформациюОбОтправленномПредупрежденииПоДокументу(Документ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСообщениеОНаличииТоваровСОбязательнойМаркировкой(ЗНАЧ Документ) Экспорт
	
	Если НЕ смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Документ.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокСообщения = Новый Массив;
	МассивСтрокСообщения.Добавить("В заказе присутствует маркируемый товар:");
	
	Для каждого стрТовары Из Документ.Товары Цикл
		
		Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Если стрТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			МассивСтрокСообщения.Добавить(СтрШаблон("'%1'", стрТовары.Номенклатура));
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокСообщения.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(МассивСтрокСообщения, Символы.ПС), Документ.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСообщениеОНеобходимостиСканированияТоваровСОбязательнойМаркировкой(ЗНАЧ Документ) Экспорт
	
	Если НЕ смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Документ.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокСообщения = Новый Массив;
	
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		ТЧ = Документ.ОтгружаемыеТовары;
	Иначе
		ТЧ = Документ.Товары;
	КонецЕсли;
	
	Для каждого стрТовары Из ТЧ Цикл
		
		Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Если стрТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			
			Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
				Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			МассивСтрокСообщения.Добавить("В документе содержится маркируемый товар. Необходимо отсканировать марку товара.");
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокСообщения.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(МассивСтрокСообщения, Символы.ПС), Документ.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСообщениеОБудущейМаркировкеНоменклатурыПоДокументу(ЗНАЧ Документ) Экспорт
	
	Если НЕ смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Документ.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	МассивХарактеристик = Новый Массив;
	
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ТЧ = Документ.ВозвращаемыеТовары;
	Иначе
		ТЧ = Документ.Товары;
	КонецЕсли;
	
	Для каждого стрТовары Из ТЧ Цикл
		
		Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Если стрТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		МассивНоменклатуры.Добавить(стрТовары.Номенклатура);
		МассивХарактеристик.Добавить(стрТовары.Характеристика);
			
	КонецЦикла;
	
	Текст = смартМаркировка.ПолучитьСообщениеОБудущейМаркировкеНоменклатуры(МассивНоменклатуры, МассивХарактеристик, Документ.Дата);
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст, Документ.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(ЗНАЧ Документ) Экспорт
	
	Если НЕ смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Документ.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокСообщенияЭМ = Новый Массив;
	МассивСтрокСообщенияЭМ.Добавить("В документе содержится товар Экспериментального режима маркировки:");
	
	МассивСтрокСообщенияБудущейМаркировки = Новый Массив;
	МассивСтрокСообщенияБудущейМаркировки.Добавить("В документе содержится маркируемый товар:");
	
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		ТЧ = Документ.ОтгружаемыеТовары;
	Иначе
		ТЧ = Документ.Товары;
	КонецЕсли;
	
	Для каждого стрТовары Из ТЧ Цикл
		
		Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Если стрТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если смартМаркировка.НоменклатураПодлежитЭксперементальнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			МассивСтрокСообщенияЭМ.Добавить(СтрШаблон("'%1' количество %2", стрТовары.Номенклатура, стрТовары.Количество));
		КонецЕсли;
		
		ДатаБудущейМаркировки = смартМаркировка.НоменклатураПодлежитОбязательнойМаркировкеВБудущем(стрТовары.Номенклатура, Документ.Дата);
		Если ЗначениеЗаполнено(ДатаБудущейМаркировки) Тогда
			Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
				МассивСтрокСообщенияБудущейМаркировки.Добавить(СтрШаблон("'%1'. С %2 необходимо указывать коды маркировки отгружаемого товара.", стрТовары.Номенклатура, Формат(ДатаБудущейМаркировки, "ДФ=dd.MM.yyyy")));
			ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				МассивСтрокСообщенияБудущейМаркировки.Добавить(СтрШаблон("'%1'. С %2 документ подписывается только по ЭДО!", стрТовары.Номенклатура, Формат(ДатаБудущейМаркировки, "ДФ=dd.MM.yyyy")));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокСообщенияЭМ.Количество() > 1 Тогда
		
		Если НЕ смартМаркировка.ПредупреждениеПоДокументуБылоОтправленоРанее(Документ) Тогда
			МассивСтрокСообщенияЭМ.Добавить("Никаких дополнительных действий не требуется.");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(МассивСтрокСообщенияЭМ, Символы.ПС), Документ.Ссылка);
			смартМаркировка.ЗаписатьИнформациюОбОтправленномПредупрежденииПоДокументу(Документ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивСтрокСообщенияБудущейМаркировки.Количество() > 1 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(МассивСтрокСообщенияБудущейМаркировки, Символы.ПС), Документ.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностьПеремещенияМаркированныхТоваров(ЗНАЧ Документ, Отказ, ОписаниеОповещенияПродолжение) Экспорт
	
	ТекстСообщения = "";
	ТекстОшибки = смартМаркировка.ПроверитьВозможностьПеремещенияТоваров(Документ, ТекстСообщения);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Если НЕ смартОбщегоНазначения.ЭтоПолноправныйПользователь() Тогда
			
			ТекстСообщения = СтрШаблон("Перемещение между складами %1 - %2 запрещено для маркированной продукции: %3%4", Документ.СкладОтправитель, Документ.СкладПолучатель, Символы.ПС, ТекстОшибки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		Иначе
			
			Отказ = Истина;
			ТекстВопроса = СтрШаблон("Перемещение между складами %1 - %2 запрещено для маркированной продукции: 
									   |%3
									   |Вы все равно хотите продолжить ?", Документ.СкладОтправитель, Документ.СкладПолучатель, ТекстОшибки);
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ОписаниеОповещенияПродолжение", ОписаниеОповещенияПродолжение);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьВозможностьПеремещенияМаркированныхТоваровЗавершение", смартМаркировкаКлиент, ДопПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекстСообщения) Тогда
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностьПеремещенияМаркированныхТоваровЗавершение(Результат, ДопПараметры) Экспорт
	
	ВыполнитьОбработкуОповещения(ДопПараметры.ОписаниеОповещенияПродолжение, Результат = КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти