#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ТекстЗапросаОстатков")
Функция смарт_ТекстЗапросаОстатков(ИспользоватьКорректировку, Разделы)

	Если Не ИспользоватьКорректировку Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Номенклатура           КАК Номенклатура,
		|	Т.Характеристика         КАК Характеристика,
		|	Т.Склад                  КАК Склад,
		|
		|	Т.ВНаличииОстаток
		|		- Т.ВРезервеСоСкладаОстаток
		|		- Т.ВРезервеПодЗаказОстаток КАК Количество
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		|	, Т.смартВНаличииГарантийныеОстаток
		|		- Т.смартВРезервеСоСкладаГарантийныеОстаток
		|		- Т.смартВРезервеПодЗаказГарантийныеОстаток КАК КоличествоГарантийные
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		|
		|ПОМЕСТИТЬ ВтОстаткиСклада
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(,
		|		(Номенклатура, Характеристика, Склад) В(
		|			ВЫБРАТЬ
		|				Ключи.Номенклатура   КАК Номенклатура,
		|				Ключи.Характеристика КАК Характеристика,
		|				Ключи.Склад          КАК Склад
		|			ИЗ
		|				ВтТовары КАК Ключи
		|		)) КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////////////////////
		|";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НаборДанных.Номенклатура           КАК Номенклатура,
		|	НаборДанных.Характеристика         КАК Характеристика,
		|	НаборДанных.Склад                  КАК Склад,
		|
		|	СУММА(НаборДанных.Количество)      КАК Количество
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		|	, СУММА(НаборДанных.КоличествоГарантийные)      КАК КоличествоГарантийные
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		|
		|ПОМЕСТИТЬ ВтОстаткиСклада
		|ИЗ (
		|	ВЫБРАТЬ
		|		Т.Номенклатура           КАК Номенклатура,
		|		Т.Характеристика         КАК Характеристика,
		|		Т.Склад                  КАК Склад,
		|
		|		Т.ВНаличииОстаток
		|			- Т.ВРезервеСоСкладаОстаток
		|			- Т.ВРезервеПодЗаказОстаток КАК Количество
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		|		, Т.смартВНаличииГарантийныеОстаток
		|			- Т.смартВРезервеСоСкладаГарантийныеОстаток
		|			- Т.смартВРезервеПодЗаказГарантийныеОстаток КАК КоличествоГарантийные
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		|
		|	ИЗ
		|		РегистрНакопления.СвободныеОстатки.Остатки(,
		|			(Номенклатура, Характеристика, Склад) В(
		|				ВЫБРАТЬ
		|					Ключи.Номенклатура   КАК Номенклатура,
		|					Ключи.Характеристика КАК Характеристика,
		|					Ключи.Склад          КАК Склад
		|				ИЗ
		|					ВтТовары КАК Ключи
		|			)) КАК Т
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Т.Номенклатура            КАК Номенклатура,
		|		Т.Характеристика          КАК Характеристика,
		|		Т.Склад                   КАК Склад,
		|
		|		- Т.ВРезерве - Т.КОтгрузке КАК Количество
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		|		, - Т.смартВРезервеГарантийные - Т.смартКОтгрузкеГарантийные КАК КоличествоГарантийные
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		|
		|	ИЗ
		|		ВтТоварыКОтгрузкеКорректировка КАК Т
		|	ГДЕ
		|		Т.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|
		|	) КАК НаборДанных
		|
		|СГРУППИРОВАТЬ ПО
		|	НаборДанных.Номенклатура, НаборДанных.Характеристика, НаборДанных.Склад
		|ИМЕЮЩИЕ
		|	СУММА(НаборДанных.Количество) <> 0
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		|	ИЛИ СУММА(НаборДанных.КоличествоГарантийные) <> 0
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////////////////////
		|";
	КонецЕсли;

	Если Разделы <> Неопределено Тогда
		Разделы.Добавить("ТаблицаОстаткиСклада");
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаСторноЗаписейЗаказаВРезервеИКОтгрузке")
Функция смарт_ТекстЗапросаСторноЗаписейЗаказаВРезервеИКОтгрузке()

	Текст =
	"ВЫБРАТЬ
	|	Таблица.Номенклатура     КАК Номенклатура,
	|	Таблица.Характеристика   КАК Характеристика,
	|	Таблица.Склад            КАК Склад,
	|
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|				- Таблица.ВНаличии
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ КАК КОтгрузке,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				- Таблица.ВРезервеСоСклада
	|			ИНАЧЕ
	|				Таблица.ВРезервеСоСклада
	|		КОНЕЦ КАК ВРезерве
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|				- Таблица.смартВНаличииГарантийные
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ КАК КОтгрузкеГарантийные,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				- Таблица.смартВРезервеСоСкладаГарантийные
	|			ИНАЧЕ
	|				Таблица.смартВРезервеСоСкладаГарантийные
	|		КОНЕЦ КАК ВРезервеГарантийные
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки КАК Таблица
	|
	|ГДЕ
	|	Таблица.Активность
	|	И Таблица.Регистратор В(&Ссылка)
	#Удаление //++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	И (Таблица.ВНаличии <> 0 ИЛИ Таблица.ВРезервеСоСклада <> 0)
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	И (Таблица.ВНаличии <> 0 ИЛИ Таблица.ВРезервеСоСклада <> 0 ИЛИ Таблица.смартВНаличииГарантийные <> 0 ИЛИ Таблица.смартВРезервеСоСкладаГарантийные <> 0)
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	И &Отбор
	|;
	|
	|//////////////////////////////////////////////////
	|";

	Возврат Текст;

КонецФункции

#КонецОбласти