#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("СформироватьТаблицуИсходныхДвижений")
Процедура смарт_СформироватьТаблицуИсходныхДвижений()

	// Текущее состояние набора помещается во временную таблицу "ДвиженияПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Номенклатура                                  КАК Номенклатура,
	|	Таблица.Характеристика                                КАК Характеристика,
	|	Таблица.Склад                                         КАК Склад,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-Таблица.ВНаличии
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК ВНаличииПередЗаписьюРасход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			-Таблица.ВНаличии
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК ВНаличииПередЗаписьюПриход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-Таблица.ВРезервеПодЗаказ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК ВРезервеПодЗаказПередЗаписьюРасход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			-Таблица.ВРезервеСоСклада
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК ВРезервеСоСкладаПередЗаписьюПриход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-Таблица.ВРезервеСоСклада
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК ВРезервеСоСкладаПередЗаписьюРасход
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-Таблица.смартВНаличииГарантийные
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК смартВНаличииГарантийныеПередЗаписьюРасход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			-Таблица.смартВНаличииГарантийные
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК смартВНаличииГарантийныеПередЗаписьюПриход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-Таблица.смартВРезервеПодЗаказГарантийные
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК смартВРезервеПодЗаказГарантийныеПередЗаписьюРасход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			-Таблица.смартВРезервеСоСкладаГарантийные
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК смартВРезервеСоСкладаГарантийныеПередЗаписьюПриход,
	|
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			-Таблица.смартВРезервеСоСкладаГарантийные
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                                 КАК смартВРезервеСоСкладаГарантийныеПередЗаписьюРасход
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|ПОМЕСТИТЬ СвободныеОстаткиПередЗаписью
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки КАК Таблица
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|		 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|		 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО Таблица.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый
	|	И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|		ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|		НастройкаСклад.Контролировать))";

	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьТаблицуИзмененийДвижений")
Процедура смарт_СформироватьТаблицуИзмененийДвижений()

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Номенклатура                  КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика                КАК Характеристика,
	|	ТаблицаИзменений.Склад                         КАК Склад,
	|	СУММА(ТаблицаИзменений.ВНаличииРасход)         КАК ВНаличииРасход,
	|	СУММА(ТаблицаИзменений.ВРезервеПодЗаказРасход) КАК ВРезервеПодЗаказРасход,
	|	СУММА(ТаблицаИзменений.ВРезервеСоСкладаРасход) КАК ВРезервеСоСкладаРасход,
	|	СУММА(ТаблицаИзменений.ВРезервеСоСкладаПриход) КАК ВРезервеСоСкладаПриход
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, СУММА(ТаблицаИзменений.смартВНаличииГарантийныеРасход)         КАК смартВНаличииГарантийныеРасход,
	|	СУММА(ТаблицаИзменений.смартВРезервеПодЗаказГарантийныеРасход) КАК смартВРезервеПодЗаказГарантийныеРасход,
	|	СУММА(ТаблицаИзменений.смартВРезервеСоСкладаГарантийныеРасход) КАК смартВРезервеСоСкладаГарантийныеРасход,
	|	СУММА(ТаблицаИзменений.смартВРезервеСоСкладаГарантийныеПриход) КАК смартВРезервеСоСкладаГарантийныеПриход
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|ПОМЕСТИТЬ ДвиженияСвободныеОстаткиИзменение
	|ИЗ(
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура                       КАК Номенклатура,
	|		Таблица.Характеристика                     КАК Характеристика,
	|		Таблица.Склад                              КАК Склад,
	|
	|		Таблица.ВНаличииПередЗаписьюРасход         КАК ВНаличииРасход,
	|		Таблица.ВНаличииПередЗаписьюПриход         КАК ВНаличииПриход,
	|
	|		Таблица.ВРезервеСоСкладаПередЗаписьюПриход КАК ВРезервеСоСкладаПриход,
	|		Таблица.ВРезервеСоСкладаПередЗаписьюРасход КАК ВРезервеСоСкладаРасход,
	|
	|		Таблица.ВРезервеПодЗаказПередЗаписьюРасход КАК ВРезервеПодЗаказРасход
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		, Таблица.смартВНаличииГарантийныеПередЗаписьюРасход         КАК смартВНаличииГарантийныеРасход,
	|		Таблица.смартВНаличииГарантийныеПередЗаписьюПриход         КАК смартВНаличииГарантийныеПриход,
	|
	|		Таблица.смартВРезервеСоСкладаГарантийныеПередЗаписьюПриход КАК смартВРезервеСоСкладаГарантийныеПриход,
	|		Таблица.смартВРезервеСоСкладаГарантийныеПередЗаписьюРасход КАК смартВРезервеСоСкладаГарантийныеРасход,
	|
	|		Таблица.смартВРезервеПодЗаказГарантийныеПередЗаписьюРасход КАК смартВРезервеПодЗаказГарантийныеРасход
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|	ИЗ
	|		СвободныеОстаткиПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура                       КАК Номенклатура,
	|		Таблица.Характеристика                     КАК Характеристика,
	|		Таблица.Склад                              КАК Склад,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|					Таблица.ВНаличии
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК ВНаличииРасход,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					Таблица.ВНаличии
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК ВНаличииПриход,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					Таблица.ВРезервеСоСклада
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК ВРезервеСоСкладаПриход,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|					Таблица.ВРезервеСоСклада
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК ВРезервеСоСкладаРасход,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|					Таблица.ВРезервеПодЗаказ
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК ВРезервеПодЗаказРасход
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		, ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|					Таблица.смартВНаличииГарантийные
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК смартВНаличииГарантийныеРасход,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					Таблица.смартВНаличииГарантийные
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК смартВНаличииГарантийныеПриход,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					Таблица.смартВРезервеСоСкладаГарантийные
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК смартВРезервеСоСкладаГарантийныеПриход,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|					Таблица.смартВРезервеСоСкладаГарантийные
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК смартВРезервеСоСкладаГарантийныеРасход,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|					Таблица.смартВРезервеПодЗаказГарантийные
	|				ИНАЧЕ 0
	|		КОНЕЦ                                      КАК смартВРезервеПодЗаказГарантийныеРасход
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	ИЗ
	|		РегистрНакопления.СвободныеОстатки КАК Таблица
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|			ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|			 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|			 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|			ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|			 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|			 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|			ПО Таблица.Склад = НастройкаСклад.Склад
	|			 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|			 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	|		И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|			ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|			НастройкаСклад.Контролировать))
	|
	|	) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Склад
	|
	|ИМЕЮЩИЕ
	#Удаление
	|	СУММА(ТаблицаИзменений.ВНаличииРасход) > 0 И СУММА(ТаблицаИзменений.ВНаличииПриход - ТаблицаИзменений.ВНаличииРасход) < 0
	|		ИЛИ СУММА(ТаблицаИзменений.ВНаличииРасход - ТаблицаИзменений.ВРезервеПодЗаказРасход) > 0
	|		ИЛИ СУММА(ТаблицаИзменений.ВРезервеСоСкладаПриход) > 0
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	( СУММА(ТаблицаИзменений.ВНаличииРасход) > 0 И СУММА(ТаблицаИзменений.ВНаличииПриход - ТаблицаИзменений.ВНаличииРасход) < 0
	|		ИЛИ СУММА(ТаблицаИзменений.ВНаличииРасход - ТаблицаИзменений.ВРезервеПодЗаказРасход) > 0
	|		ИЛИ СУММА(ТаблицаИзменений.ВРезервеСоСкладаПриход) > 0 )
	|	ИЛИ ( СУММА(ТаблицаИзменений.смартВНаличииГарантийныеРасход) > 0 И СУММА(ТаблицаИзменений.смартВНаличииГарантийныеПриход - ТаблицаИзменений.смартВНаличииГарантийныеРасход) < 0
	|		ИЛИ СУММА(ТаблицаИзменений.смартВНаличииГарантийныеРасход - ТаблицаИзменений.смартВРезервеПодЗаказГарантийныеРасход) > 0
	|		ИЛИ СУММА(ТаблицаИзменений.смартВРезервеСоСкладаГарантийныеПриход) > 0 )
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ СвободныеОстаткиПередЗаписью
	|";

	Результат = Запрос.ВыполнитьПакет();

	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	Выборка = Результат[0].Выбрать();
	Выборка.Следующий();
	СтруктураВременныеТаблицы.Вставить("ДвиженияСвободныеОстаткиИзменение", Выборка.Количество > 0);

КонецПроцедуры

#КонецОбласти