
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтложитьНаДату = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтложитьНачалоЭтапаПриИзменении(Элемент)
	
	Если ОтложитьНачалоЭтапаДней = 0 И ОтложитьНачалоЭтапаЧасов = 0 И ОтложитьНачалоЭтапаМинут = 0 Тогда
		ОтложитьНаДату = Дата("00010101");
	Иначе
		ОтложитьНаДату = НачалоДня(ТекущаяДата()) + (ОтложитьНачалоЭтапаДней*86400) + (ОтложитьНачалоЭтапаЧасов*3600) + (ОтложитьНачалоЭтапаМинут*60);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьНачалоЭтапаДнейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораДаты", ЭтотОбъект, );
		ПоказатьВводДаты(Оповещение, ?(ЗначениеЗаполнено(ОтложитьНаДату),ОтложитьНаДату,ТекущаяДата()), "Укажите дату", ЧастиДаты.Дата);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ЭтотОбъект.Закрыть(ОтложитьНаДату);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтотОбъект.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьНаДатуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораДаты", ЭтотОбъект, );
	ПоказатьВводДаты(Оповещение, ?(ЗначениеЗаполнено(ОтложитьНаДату),ОтложитьНаДату,ТекущаяДата()), "Укажите дату", ЧастиДаты.Дата);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбораДаты(ВыбраннаяДата, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяДата) Тогда
		
		Если ВыбраннаяДата < ТекущаяДата() Тогда
			ТекстСообщения = НСтр("ru='Укажите дату больше или равную текущей!';en='Please enter a date greater than or equal to the current date!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ОтложитьНаДату			= ВыбраннаяДата + (ОтложитьНачалоЭтапаЧасов*3600) + (ОтложитьНачалоЭтапаМинут*60);
			ОтложитьНачалоЭтапаДней	= (ДеньГода(ВыбраннаяДата) - ДеньГода(ТекущаяДата()));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти