#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками
 
&Перед("ЗаписатьОбъект")
Процедура смарт_ЗаписатьОбъект(ОбъектДляЗаписи, РежимЗаписи, СтрокаДокумента)
	// Фролов+  
	ОбъектДляЗаписи.Дата=КонецДня(ОбъектДляЗаписи.Дата);
	Если ТипЗнч(ОбъектДляЗаписи)=Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") 
		И (ОбъектДляЗаписи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
		ИЛИ ОбъектДляЗаписи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика) Тогда 
		Для Каждого Стр Из ОбъектДляЗаписи.РасшифровкаПлатежа Цикл 
			Стр.СуммаНДС=УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(Стр.Сумма,УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС));
		КонецЦикла;	
	КонецЕсли;
	// Фролов-
КонецПроцедуры

&Вместо("СнятьПризнакПроведения")
Процедура смарт_СнятьПризнакПроведения(ДокументыКЗагрузке, БанковскийСчет, ЗаголовокВыписки)
	//+- смарт 914 02.03.2022: Каратеев // Процедура перенесена пустой для пробы отключения Отмены проведения документов по выписки.
	//Должно сильно ускорить загрузку выписки из банка
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Смарт Фролов+ 
// Процедура проверки правильности загрузки из Клиент-банка документов Поступление ДС с видом операции "Поступление оплаты от клиента"
// Ошибки:
// 1. Если в расшифровке платежа более 1 строки
// 2. Если полученный из расшифровки платежа номер не свпадает с номером основания
// 3. Если валюта платежа руб. и валюта основания платежа руб. тогда должный быть равны сумма платежа, сумма основания платежа и сумма взаиморасчетов
// 4. Если валюта платежа руб. а валюта взаиморасчетов не руб. тогда дожно быть равенство суммы платежа и суммы взаиморасчетов умноженной на курс
// 5. Если сумма НДС не равна расчетной, исходя из суммы платежа и ставки НДС
Процедура ВыполнитьПроверкиНаОшибкиЗагрузки(ТЗ)
	Ошибки=Новый Структура("ПоКоличеству,ПоНомеру,ПоСуммам,ПоКурсу,ПоНДС",Новый Массив,Новый Массив,Новый Массив,Новый Массив,Новый Массив);

	Для Каждого Док Из ТЗ Цикл
		Если Док.Документ.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда 
			// Ошибка №1
			Если Док.Документ.РасшифровкаПлатежа.Количество()>1 Тогда 
				// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева
				Ошибки.ПоКоличеству.Добавить(Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" количество строк в расшифровке платежа = "+Док.Документ.РасшифровкаПлатежа.Количество());
			КонецЕсли;
			
			Для Каждого Стр Из Док.Документ.РасшифровкаПлатежа  Цикл
				Если ЗначениеЗаполнено(Стр.ОснованиеПлатежа) Тогда 
					СокрНомерОснования=ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.ОснованиеПлатежа.Номер);
					Если СтрНайти(Док.Документ.НазначениеПлатежа,СокрНомерОснования)=0 Тогда
						// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева
						ТекстОшибки=Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" не верно найдено основание платежа.";
						
						ТекстОшибки=ТекстОшибки+Символы.ПС+"	Список номеров из назначения платежа: "+НайтиНомераОснованияПлатежа(Док.Документ.НазначениеПлатежа)+" в строке "+Стр.НомерСтроки;
						Ошибки.ПоНомеру.Добавить(ТекстОшибки); // Ошибка №2
					КонецЕсли;
				КонецЕсли;
				
				Если Док.Документ.Валюта=Константы.ВалютаРегламентированногоУчета.Получить() Тогда
					Если (ЗначениеЗаполнено(Стр.ОснованиеПлатежа) И ТипЗнч(Стр.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента")) //смарт Каратеев №390 1.10.2020 добавил условие проверки типа метаданных основания платежа
							И Док.Документ.Валюта=Стр.ОснованиеПлатежа.Валюта Тогда
							Если Не Стр.Сумма=Стр.ОснованиеПлатежа.СуммаДокумента Тогда
							// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева
							Ошибки.ПоСуммам.Добавить(Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" Сумма платежа не равна сумме основания платежа в строке "+Стр.НомерСтроки+".");	// Ошибка №3				
						КонецЕсли;
						Если Не Стр.Сумма=Стр.СуммаВзаиморасчетов Тогда
							// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева
							Ошибки.ПоСуммам.Добавить(Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" Сумма платежа не равна сумме взаиморасчетов в строке "+Стр.НомерСтроки+".");      // Ошибка №3
						КонецЕсли;
						Если Не Стр.ОснованиеПлатежа.СуммаДокумента=Стр.СуммаВзаиморасчетов Тогда
							// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева
							Ошибки.ПоСуммам.Добавить(Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" Сумма взаиморасчетов не равна сумме основания платежа в строке "+Стр.НомерСтроки+"."); // Ошибка №3
						КонецЕсли;	
					Иначе
						Если ЗначениеЗаполнено(Стр.ВалютаВзаиморасчетов) Тогда 
							ДанныеВалютыДок=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Док.Документ.Валюта,?(Док.Документ.ПроведеноБанком,Док.Документ.ДатаПроведенияБанком,Док.Документ.Дата));
							ДанныеВалютыВзаиморасчетов=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.ВалютаВзаиморасчетов,?(Док.Документ.ПроведеноБанком,Док.Документ.ДатаПроведенияБанком,Док.Документ.Дата));
							
							Если Не Стр.СуммаВзаиморасчетов=РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Сумма,ДанныеВалютыДок,ДанныеВалютыВзаиморасчетов) Тогда
								// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева 
								Ошибки.ПоКурсу.Добавить(Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" Сумма платежа не равна сумме взаиморасчетов с учетом курса в строке "+Стр.НомерСтроки+"."); // Ошибки №4
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.СтавкаНДС) И Не Стр.СуммаНДС=УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(Стр.Сумма,УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)) Тогда
					// #943 В поле вывода добавлена наименование организации 18.03.2022 Минаева
					Ошибки.ПоНДС.Добавить(Строка(Док.Документ.Организация)+", в документе, "+Док.Документ+" в строке "+Стр.НомерСтроки+" не верно расчитана сумма НДС.");  // Ошибка №5
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Тело=ПолучитьФорматированныйТекст(Ошибки);
	
	//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
	//Если Не Тело=Неопределено И смартСервер.смартРабочаяБаза() Тогда //смарт Каратеев №390 01.10.2020 - добавил проверку, что это не копия базы
	//	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПолучитьПараметрыОтправки(Тело));
	//КонецЕсли;	
	
	АдресаДляОтправкиСтрокой = "";
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресаДляОтправкиОшибок;	
	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой, Ложь);

	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
		И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) 
		И Тело <> Неопределено Тогда
				
		ТемаПисьма = "Ошибки при загрузке документов из Клиент-банка";
		ТекстПисьма = Тело;
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		// ++ 22.03.2021
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза, ВажностьИнтернетПочтовогоСообщения.Высокая);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, 
																			ДанныеОтправки,
																			, 
																			ТестовыеАдресаМассив, 
																			ТестовыеАдресаСтрока, 
																			ЭтоТестоваяБаза, 
																			ВажностьИнтернетПочтовогоСообщения.Высокая, 
																			Ложь);
		// --
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление об ошибках при загрузке документов из Клиент-банка НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
			Иначе				
				ТекстСообщения = "Отправлено уведомление об ошибках при загрузке документов из Клиент-банка на почту: " + АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось отправить уведомление об ошибках при загрузке документов из Клиент-банк" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;			
	//-- смарт:ММ 04.03.2021
	
КонецПроцедуры	

// Смарт Фролов+
// Функция выбирающая номера основания платеда из строки Основание платежа
// В связи с тем, что строка не регламентированная, точность поиска не гарантирована
Функция НайтиНомераОснованияПлатежа(Стр)
	НомераОснования="";
	
	КолНомеров=СтрЧислоВхождений(Стр,"ЦБ-");
	Если КолНомеров=0 Тогда
		КолНомеров=СтрЧислоВхождений(Стр,"№");
	КонецЕсли;

	Для н=1 По КолНомеров Цикл
		Начало=СтрНайти(Стр,"ЦБ-",,,н);
		Если Начало=0 Тогда
			Начало=СтрНайти(Стр,"№",,,н);
		КонецЕсли;
		
		Конец=СтрНайти(Стр," от",,Начало);
		Если Конец=0 Тогда
			Конец=СтрНайти(Стр,"от",,Начало);
		КонецЕсли;
		Если Конец=0 Тогда
			Конец=СтрНайти(Стр," ОТ",,Начало);
		КонецЕсли;
		Если Конец=0 Тогда
			Конец=СтрНайти(Стр,"ОТ",,Начало);
		КонецЕсли;
		Если Конец=0 Тогда
			Конец=СтрНайти(Стр," (",,Начало);
		КонецЕсли;
		Если Конец=0 Тогда
			Конец=СтрНайти(Стр,"(",,Начало);
		КонецЕсли;
		
		НомераОснования=НомераОснования+"	"+Сред(Стр,Начало,Конец-Начало);
	КонецЦикла;
	
	Возврат НомераОснования;
КонецФункции	

// Сарт Фролов+
// Функция формирует текст для письма из объекта Ошибки
Функция ПолучитьФорматированныйТекст(Ошибки)
	Док=Новый ФорматированныйДокумент;
	
	Если Ошибки.ПоКоличеству.Количество() 
		Или Ошибки.ПоНомеру.Количество() 
		Или Ошибки.ПоСуммам.Количество() 
		Или Ошибки.ПоКурсу.Количество()
		Или Ошибки.ПоНДС.Количество() Тогда 
		
		Заголовок=Док.Добавить("Внимание!",ТипЭлементаФорматированногоДокумента.Текст);
		Заголовок.Шрифт=Новый Шрифт("Arial",16,Истина);
		
		Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
		Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
		
		Если Ошибки.ПоКоличеству.Количество() Тогда 
			Текст=Док.Добавить("Документы, в которых в расшифровке платежа более 1 строки:",ТипЭлементаФорматированногоДокумента.Текст);
			Текст.Шрифт=Новый Шрифт("Arial",12,Истина);
			Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			Для Каждого Ошибка Из Ошибки.ПоКоличеству Цикл 
				Текст=Док.Добавить(Символы.Таб+"- "+Ошибка,ТипЭлементаФорматированногоДокумента.Текст);
				Текст.Шрифт=Новый Шрифт("Arial",12);
				Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			КонецЦикла;	
		КонецЕсли;
		
		Если Ошибки.ПоНомеру.Количество() Тогда 
			Текст=Док.Добавить("Документы, в которых не верно найдено основание платежа по номеру:",ТипЭлементаФорматированногоДокумента.Текст);
			Текст.Шрифт=Новый Шрифт("Arial",12,Истина);
			Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			Для Каждого Ошибка Из Ошибки.ПоНомеру Цикл 
				Текст=Док.Добавить(Символы.Таб+"- "+Ошибка,ТипЭлементаФорматированногоДокумента.Текст);
				Текст.Шрифт=Новый Шрифт("Arial",12);
				Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			КонецЦикла;	
		КонецЕсли;
		
		Если Ошибки.ПоСуммам.Количество() Тогда 
			Текст=Док.Добавить("Документы, в которых не равны суммы платежа, основания платежа или суммы взаиморасчетов:",ТипЭлементаФорматированногоДокумента.Текст);
			Текст.Шрифт=Новый Шрифт("Arial",12,Истина);
			Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			Для Каждого Ошибка Из Ошибки.ПоСуммам Цикл 
				Текст=Док.Добавить(Символы.Таб+"- "+Ошибка,ТипЭлементаФорматированногоДокумента.Текст);
				Текст.Шрифт=Новый Шрифт("Arial",12);
				Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			КонецЦикла;	
		КонецЕсли;
		
		Если Ошибки.ПоКурсу.Количество() Тогда 
			Текст=Док.Добавить("Документы, в которых сумма платежа не ровна сумме взаиморасчетов с учетом курса:",ТипЭлементаФорматированногоДокумента.Текст);
			Текст.Шрифт=Новый Шрифт("Arial",12,Истина);
			Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			Для Каждого Ошибка Из Ошибки.ПоКурсу Цикл 
				Текст=Док.Добавить(Символы.Таб+"- "+Ошибка,ТипЭлементаФорматированногоДокумента.Текст);
				Текст.Шрифт=Новый Шрифт("Arial",12);
				Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			КонецЦикла;	
		КонецЕсли;
		
		Если Ошибки.ПоНДС.Количество() Тогда 
			Текст=Док.Добавить("Документы, в которых не верно расчитан НДС:",ТипЭлементаФорматированногоДокумента.Текст);
			Текст.Шрифт=Новый Шрифт("Arial",12,Истина);
			Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			Для Каждого Ошибка Из Ошибки.ПоНДС Цикл 
				Текст=Док.Добавить(Символы.Таб+"- "+Ошибка,ТипЭлементаФорматированногоДокумента.Текст);
				Текст.Шрифт=Новый Шрифт("Arial",12);
				Док.Добавить("",ТипЭлементаФорматированногоДокумента.ПереводСтроки);
			КонецЦикла;	
		КонецЕсли;
						
		Возврат Док;
	КонецЕсли;	
	
	Возврат Неопределено;	
КонецФункции	


//Смарт {[+](фрагмент ДОБАВЛЕН), Администратор 20.01.2020 15:09:24
&Перед("ПодготовитьСтрокиВыписки")
Процедура смарт_ПодготовитьСтрокиВыписки(ДокументыКЗагрузке, БанковскийСчет, НомерСчета)
	Для каждого СтрокаДокумента Из ДокументыКЗагрузке Цикл
		Если СтрокаДокумента.Очередность="0" тогда
			СтрокаДокумента.Очередность="5";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//++ Смарт:  Демичев №809 21.12.2021
&После("ЗаполнитьЗначениеЭкспорта")
Процедура смарт_ЗаполнитьЗначениеЭкспорта(СтрокаЭкспорта, ВыборкаДляЭкспорта)
	
	//Используется типовой метод, тк банк не распознает буквинный код в номере
	СтрокаЭкспорта.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать_ТиповойМетодУТ(ВыборкаДляЭкспорта.Номер, Истина, Истина);
	
КонецПроцедуры
//-- Смарт:  Демичев №809 21.12.2021))
 
#КонецОбласти

#Область ПеренесеноВременноДляИсправленияОшибки

//&Вместо("ЗаполнитьРеквизитыПоступления")
//Процедура смарт_ЗаполнитьРеквизитыПоступления(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект, СоздаватьКонтрагентов, ПроводитьДокументы)
//		
//	Перем РеквизитыВсе, РеквизитыХозОперации;
//	
//	УстановитьСвойство(ДокументОбъект, "Дата", ДокументОбъект.ДатаВходящегоДокумента);
//	
//	Если НачалоДня(ДокументОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
//		ДокументОбъект.Дата = ТекущаяДатаСеанса();
//	Иначе
//		ДокументОбъект.Дата = КонецДня(ДокументОбъект.Дата);
//	КонецЕсли;
//	
//	// Хоз. операция
//	//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
//	//смартКаратеев ++
//	//Если ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) Тогда

//	Если СтрокаДокумента.ПлательщикИНН = "7707083893"
//			И СтрокаДокумента.ПлательщикБИК = "044525225"
//			И СтрНачинаетсяС(СтрокаДокумента.НазначениеПлатежа,"Возмещение оплаты товаров и услуг Мерчант") Тогда
//		ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте;
//		СтрокаДокумента.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
//	ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) Тогда	
//	//Каратеев --
//	//-- смарт:ММ 27.03.2020
//	
//		ХозяйственнаяОперация = СтрокаДокумента.ВидОперации;
//	Иначе
//		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
//	КонецЕсли;
//	УстановитьСвойство(ДокументОбъект, "ХозяйственнаяОперация", ХозяйственнаяОперация);
//	
//	// Статья по умолчанию
//	Если Не ЗначениеЗаполнено(СтрокаДокумента.СтатьяДвиженияДенежныхСредств) Тогда
//		СтрокаДокумента.СтатьяДвиженияДенежныхСредств =
//			Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ХозяйственнаяОперация);
//	КонецЕсли;
//	
//	Документы.ПоступлениеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
//		ХозяйственнаяОперация,
//		РеквизитыВсе,
//		РеквизитыХозОперации);
//		
//	// Контрагент
//	Если РеквизитыХозОперации.Найти("Контрагент") <> Неопределено Тогда
//		Если ЗначениеЗаполнено(СтрокаДокумента.Контрагент) Тогда
//			УстановитьСвойство(ДокументОбъект, "Контрагент", СтрокаДокумента.Контрагент);
//		ИначеЕсли СоздаватьКонтрагентов И СтрокаДокумента.СоздаватьКонтрагента Тогда
//			УстановитьСвойство(ДокументОбъект, "Контрагент", СоздатьКонтрагента(ДокументыКЗагрузке, СтрокаДокумента));
//		Иначе
//			УстановитьСвойство(ДокументОбъект, "ИмяКонтрагента", СтрокаДокумента.ИмяКонтрагента);
//		КонецЕсли;
//	КонецЕсли;
//	
//	// Счет контрагента
//	Если РеквизитыХозОперации.Найти("БанковскийСчетКонтрагента") <> Неопределено Тогда
//		Если ЗначениеЗаполнено(СтрокаДокумента.СчетКонтрагента) Тогда
//			УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента", СтрокаДокумента.СчетКонтрагента);
//		ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
//			УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента",
//				СоздатьБанковскийСчетКонтрагента(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект.Контрагент));
//		КонецЕсли;
//	КонецЕсли;
//	
//	// Подотчетное лицо
//	Если РеквизитыХозОперации.Найти("ПодотчетноеЛицо") <> Неопределено Тогда
//		Если СтрокаДокумента.НайденКонтрагент Тогда
//			УстановитьСвойство(ДокументОбъект, "ПодотчетноеЛицо", СтрокаДокумента.Контрагент);
//		Иначе
//			УстановитьСвойство(ДокументОбъект, "ПодотчетноеЛицо", СтрокаДокумента.ПодотчетноеЛицо);
//		КонецЕсли;
//	КонецЕсли;
//	
//	// Банковский счет отправитель
//	Если РеквизитыХозОперации.Найти("БанковскийСчетОтправитель") <> Неопределено Тогда
//		УстановитьСвойство(ДокументОбъект, "БанковскийСчетОтправитель", СтрокаДокумента.СчетКонтрагента);
//	КонецЕсли;
//	
//	// Прочие реквизиты
//	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента,
//		"СтатьяДвиженияДенежныхСредств, Подразделение, КассаОтправитель");
//	
//	// Расшифровка платежа
//	Если РеквизитыХозОперации.Найти("РасшифровкаПлатежа") <> Неопределено Тогда
//		//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 24.06.2021 16:53:49 задача 365
//		//
//		//Если СтрокаДокумента.НайденоОснованиеПлатежа Тогда // УИП
//		//	
//		//	СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//		//	ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента, "Партнер, ОснованиеПлатежа, СтатьяДвиженияДенежныхСредств");
//		//	СтрокаРасшифровки.Заказ = СтрокаДокумента.ОбъектРасчетов;
//		//	СтрокаРасшифровки.Сумма = ДокументОбъект.СуммаДокумента;
//		//Смарт }Подкин Алексей Иванович 24.06.2021 16:53:49
//		
//		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.03.2021 12:17:57 задача 365
//		СтрокаПлатежа=СокрЛП(НайтиНомераОснованияПлатежаНовая(СтрокаДокумента.НазначениеПлатежа));
//		СтрокаПлатежа=СтрЗаменить(СтрокаПлатежа,","," ");
//		ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПлатежа," ");
//		МассивНомеров=Новый Массив;
//		Н=0;
//		ТекстЗаказ="";
//		Для каждого СтрЧасть Из ЧастиИмени Цикл
//			СтрокаПроверки = СокрЛП(СтрЧасть);
//			Длина = СтрДлина(СтрокаПроверки);
//			
//			Для а = 1 По Длина Цикл
//				НомерВСтроке=СтрНайти("0123456789", Сред(СтрокаПроверки, а, 1));
//				Если НомерВСтроке = 0 Тогда
//					Продолжить;
//				иначе
//					СтрЧасть=Прав(СтрЧасть,Длина-а+1);//НомерВСтроке поменял на "а"
//					МассивНомеров.Добавить("%"+СтрЧасть+"%");
//					Н=Н+1;
//					ТекстЗаказ=?(ЗначениеЗаполнено(ТекстЗаказ),ТекстЗаказ+" ИЛИ ЗаказКлиента.Номер ПОДОБНО ""%"+СтрЧасть+"%""","ЗаказКлиента.Номер ПОДОБНО ""%"+СтрЧасть+"%""");
//					Прервать;
//				КонецЕсли; 
//				
//			КонецЦикла;
//			
//		КонецЦикла; 
//		
//		СписокЗаказов=Новый СписокЗначений;
//		 
//		Если Н>0 И ЗначениеЗаполнено(ТекстЗаказ) Тогда
//			ЗапросЗаказ=Новый Запрос;
//			ЗапросЗаказ.Текст="ВЫБРАТЬ Первые НомерВывода
//			|	ЗаказКлиента.Ссылка КАК Заказ
//			|ИЗ
//			|	Документ.ЗаказКлиента КАК ЗаказКлиента
//			|ГДЕ
//			| ЗаказКлиента.Организация = &Организация И
//			| ЗаказКлиента.Контрагент = &Контрагент И
//			|УсловиеСписок
//			|		
//			|УПОРЯДОЧИТЬ ПО
//			|	Ссылка УБЫВ
//			|АВТОУПОРЯДОЧИВАНИЕ";
//			ЗапросЗаказ.Текст=СтрЗаменить(ЗапросЗаказ.Текст,"НомерВывода",Н);
//			ЗапросЗаказ.Текст=СтрЗаменить(ЗапросЗаказ.Текст,"УсловиеСписок",ТекстЗаказ);
//			ЗапросЗаказ.УстановитьПараметр("Организация",ДокументОбъект.Организация);
//			ЗапросЗаказ.УстановитьПараметр("Контрагент",ДокументОбъект.Контрагент);

//			РезультатЗапроса=ЗапросЗаказ.Выполнить();
//			Выборка=РезультатЗапроса.Выбрать();
//			Пока Выборка.Следующий() Цикл
//				
//				//++ смарт 914 02.03.2022: Каратеев // Берем только заказы, которые попадают под условие В.А.	
//				Если ТипЗнч(Выборка.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") 
//						И Выборка.Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
//					ДокументОбъект.ОшибкиЗагрузки = Символы.ПС+Строка(Выборка.Заказ)+" Документ основания со статусом Закрыт!";
//					Продолжить;
//				ИначеЕсли НачалоДня(Выборка.Заказ.Дата) < НачалоДня(СтрокаДокумента.ДатаПроведения) Тогда
//					ДокументОбъект.ОшибкиЗагрузки = Символы.ПС+Строка(Выборка.Заказ)+" Дата документа основания меньше даты платежа!";
//				КонецЕсли;
//				//-- смарт 914 02.03.2022: Каратеев //
//				
//				СписокЗаказов.Добавить(Выборка.заказ);	
//			КонецЦикла; 
//		КонецЕсли; 
//		
//		Если СписокЗаказов.Количество()>1 Тогда
//			Реквизиты = Новый Структура;
//			Реквизиты.Вставить("Дата", ДокументОбъект.Дата);
//			Реквизиты.Вставить("Организация", ДокументОбъект.Организация);
//			Реквизиты.Вставить("СуммаДокумента", 0);
//			Реквизиты.Вставить("Валюта", ДокументОбъект.Валюта);
//			Реквизиты.Вставить("Контрагент", ДокументОбъект.Контрагент);
//			Реквизиты.Вставить("Партнер", Неопределено);
//			Реквизиты.Вставить("ХозяйственнаяОперация", ДокументОбъект.ХозяйственнаяОперация);
//			
//			АдресПлатежейВХранилище = "";
//			ТаблицаОстатковРасчетов = Неопределено;
//			
//			ВзаиморасчетыСервер.ЗаполнитьТаблицуОстатковРасчетов(Реквизиты, АдресПлатежейВХранилище, ТаблицаОстатковРасчетов);
//			ТаблицаОстатковРасчетов.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
//			ТаблицаОстатковРасчетов.Колонки.Добавить("ОснованиеПлатежа");
//			
//			ТЗотбор=ТаблицаОстатковРасчетов.СкопироватьКолонки();
//			Для каждого СтрЗ Из СписокЗаказов Цикл
//				СтруктураОтбора=Новый Структура("Заказ",СтрЗ.Значение);
//				МассивСтрок= ТаблицаОстатковРасчетов.НайтиСтроки(СтруктураОтбора);
//				Если МассивСтрок.Количество()>0 Тогда
//					НоваяСтрока=ТЗотбор.Добавить();
//					ЗаполнитьЗначенияСвойств(НоваяСтрока,МассивСтрок[0]);
//				КонецЕсли; 
//			КонецЦикла; 
//			
//			ТаблицаОстатковРасчетов=ТЗотбор.Скопировать(); //Скопировать ТЗ
//			
//			РаспределяемаяСумма = ДокументОбъект.СуммаДокумента;
//			
//			Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
//				
//				Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаТаблицы.Заказ)) Тогда
//					
//					//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.10.2020 13:18:16 задача 365
//					НомерДокументаРасчетов = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТаблицы.Номер, Истина, Истина);
//					МассивНазначения=СтрРазделить(СтрокаДокумента.НазначениеПлатежа," ",);
//					МассивРезультат = Новый Массив;
//					Для Каждого СтрНазн из МассивНазначения Цикл
//						СтрНазн=смартОбщегоНазначения.УдаляемНечисла(СтрНазн);
//						Если ЗначениеЗаполнено(СтрНазн) тогда
//							МассивРезультат.Добавить(СокрЛП(СтрНазн));
//						КонецЕсли;
//					КонецЦикла;
//					МассивНазначения = Новый Массив;
//					Если МассивРезультат.Найти(НомерДокументаРасчетов)<>Неопределено Тогда
//						//Смарт }Подкин Алексей Иванович 01.10.2020 13:18:16
//						
//						СтрокаТаблицы.ОснованиеПлатежа = СтрокаТаблицы.Заказ;
//						
//						//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 01.10.2020 13:17:57  Задача 365
//						//НомерДокументаРасчетов = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТаблицы.Номер, Истина, Истина);
//						//Если СтрЧислоВхождений(СтрокаДокумента.НазначениеПлатежа, НомерДокументаРасчетов) > 0 Тогда
//						//Смарт }Подкин Алексей Иванович 01.10.2020 13:17:57
//						
//						СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//						
//						СуммаСтроки = Мин(РаспределяемаяСумма, окр(СтрокаТаблицы.Сумма,2)); //Алексей 30.03.2021 добавил округление сумм из таблицы выборки
//						РаспределяемаяСумма = РаспределяемаяСумма - окр(СтрокаТаблицы.Сумма,2); //Алексей 30.03.2021 добавил округление сумм из таблицы выборки

//						
//						ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаТаблицы,, "Сумма");
//						СтрокаРасшифровки.Сумма = СуммаСтроки;
//						
//						СтрокаТаблицы.Обработано = Истина;
//                        Если РаспределяемаяСумма <= 0 Тогда
//                            Прервать;
//                        КонецЕсли;
//                        
//					КонецЕсли;
//				КонецЕсли;
//			КонецЦикла;
//			
//			Если ПроводитьДокументы И РаспределяемаяСумма > 0 Тогда // Подбор объектов расчетов
//				
//				Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
//					
//					Если ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
//						
//						Если СтрокаТаблицы.Обработано Тогда
//							Продолжить;
//						КонецЕсли;
//						
//						СтрокаТаблицы.ОснованиеПлатежа = СтрокаТаблицы.Заказ;
//						
//						СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();

//                        СуммаСтроки = Мин(РаспределяемаяСумма, окр(СтрокаТаблицы.Сумма,2)); //Алексей 01.12.2021 добавил округление сумм из таблицы выборки
//                        РаспределяемаяСумма = РаспределяемаяСумма - окр(СтрокаТаблицы.Сумма,2); //Алексей 01.12.2021 добавил округление сумм из таблицы выборки

//						ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаТаблицы,, "Сумма");
//						СтрокаРасшифровки.Сумма = СуммаСтроки;
//						
//						СтрокаТаблицы.Обработано = Истина;
//                        Если РаспределяемаяСумма <= 0 Тогда
//							Прервать;
//						КонецЕсли;
//						
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//            
//            Если РаспределяемаяСумма > 0 Или Не ДокументОбъект.РасшифровкаПлатежа.Количество() Тогда

//				СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента, "Партнер, СтатьяДвиженияДенежныхСредств");
//				
//				//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 02.10.2020 9:58:55  Задача 365
//				Если СтрокаДокумента.ОбъектРасчетов=Неопределено 
//					И НЕ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации Тогда //Каратеев +- //29.07.2021/ Добавлено условие, требуется адоптировать поиск договора для этой хоз. операции
//					СтрокаДокумента.ОбъектРасчетов=смартОбщегоНазначения.ПолучитьДоговор(Реквизиты.Организация, Реквизиты.Контрагент, Перечисления.ТипыДоговоров.СПокупателем);
//					СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств=Справочники.смартПредопределенныеЗначения.СтатьяДДСДог.Значение;
//				КонецЕсли;
//				//Смарт }Подкин Алексей Иванович 02.10.2020 9:58:55
//				
//				СтрокаРасшифровки.ОснованиеПлатежа = СтрокаДокумента.ОбъектРасчетов;
//				СтрокаРасшифровки.Заказ = СтрокаДокумента.ОбъектРасчетов;
//				СтрокаРасшифровки.Сумма = РаспределяемаяСумма;
//			КонецЕсли;
//			
//			ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(
//			ДокументОбъект.РасшифровкаПлатежа,
//			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(
//			ДокументОбъект.Дата, ДокументОбъект.Валюта, ДокументОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ОснованиеПлатежа"), Истина));

//		Иначе
//			
//			Если СтрокаДокумента.НайденоОснованиеПлатежа ИЛИ СписокЗаказов.Количество()=1 Тогда // УИП  //Подкин добавил ИЛИ СписокЗаказов.Количество()=1
//				
//				СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//				//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.04.2021 9:52:11 задача 365
//				Если СписокЗаказов.Количество()>0 И ЗначениеЗаполнено(СписокЗаказов[0].Значение) Тогда
//					ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента, "СтатьяДвиженияДенежныхСредств");
//					СтрокаРасшифровки.Партнер=СписокЗаказов[0].Значение.Партнер;
//					СтрокаРасшифровки.ОснованиеПлатежа=СписокЗаказов[0].Значение;
//					СтрокаРасшифровки.Заказ = СписокЗаказов[0].Значение;
//					СтрокаРасшифровки.Сумма = ДокументОбъект.СуммаДокумента;
//				иначе
//					ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента, "Партнер, ОснованиеПлатежа, СтатьяДвиженияДенежныхСредств");
//					СтрокаРасшифровки.Заказ = СтрокаДокумента.ОбъектРасчетов;
//					СтрокаРасшифровки.Сумма = ДокументОбъект.СуммаДокумента;
//				КонецЕсли; 
//				//Смарт }Подкин Алексей Иванович 01.04.2021 9:52:11
//				
//			ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(
//				ДокументОбъект.РасшифровкаПлатежа,
//				ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(
//					ДокументОбъект.Дата, ДокументОбъект.Валюта, ДокументОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ОснованиеПлатежа"), Истина));
//					
//		ИначеЕсли РеквизитыХозОперации.Найти("РасшифровкаПлатежа.ДоговорКредитаДепозита") <> Неопределено Тогда
//			
//			СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//			
//			Запрос = Новый Запрос;
//			Запрос.Текст = "
//			|ВЫБРАТЬ
//			|	ДанныеРегистра.ОбъектОплаты КАК ДоговорКредитаДепозита,
//			|	ВЫРАЗИТЬ(ДанныеРегистра.ОбъектОплаты КАК Справочник.ДоговорыКредитовИДепозитов).Партнер КАК Партнер,
//			|	ВЫРАЗИТЬ(ДанныеРегистра.ОбъектОплаты КАК Справочник.ДоговорыКредитовИДепозитов).СтатьяДДСПоступленияВыдачи КАК СтатьяДвиженияДенежныхСредств
//			|ИЗ
//			|	РегистрСведений.ГрафикПлатежей КАК ДанныеРегистра
//			|ГДЕ
//			|	ДанныеРегистра.БанковскийСчетКасса = &БанковскийСчет
//			|	И ДанныеРегистра.ПлательщикПолучатель = &Контрагент
//			|	И ДанныеРегистра.ПоступлениеСписание = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
//			|	И ДанныеРегистра.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоКредитам)
//			|СГРУППИРОВАТЬ ПО
//			|	ДанныеРегистра.ОбъектОплаты
//			|ИМЕЮЩИЕ
//			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.ОбъектОплаты) = 1
//			|";
//			
//			Запрос.УстановитьПараметр("БанковскийСчет", ДокументОбъект.БанковскийСчет);
//			Запрос.УстановитьПараметр("Контрагент", ДокументОбъект.Контрагент);
//			
//			Выборка = Запрос.Выполнить().Выбрать();
//			Если Выборка.Следующий() Тогда
//				ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, Выборка);
//			Иначе
//				СтрокиКЗагрузке = Новый Массив;
//				СтрокиКЗагрузке.Добавить(СтрокаДокумента);
//				ЗаполнитьПоКосвеннымДанным(СтрокиКЗагрузке, ДокументОбъект.БанковскийСчет);
//				ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента,
//					"Партнер, СтатьяДвиженияДенежныхСредств, ТипСуммыКредитаДепозита, ДоговорКредитаДепозита");
//			КонецЕсли;
//			
//			СтрокаРасшифровки.Сумма = СтрокаДокумента.СуммаДокумента;
//			
//		ИначеЕсли РеквизитыХозОперации.Найти("РасшифровкаПлатежа.Заказ") = Неопределено Тогда // Прочие платежи
//			
//			СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента,
//				"Партнер, СтатьяДвиженияДенежныхСредств, ДоговорКредитаДепозита, СтатьяДоходов, АналитикаДоходов, АналитикаАктивовПассивов, Подразделение");
//			СтрокаРасшифровки.Сумма = СтрокаДокумента.СуммаДокумента;
//		
//		Иначе
//			
//			Реквизиты = Новый Структура;
//			Реквизиты.Вставить("Дата", ДокументОбъект.Дата);
//			Реквизиты.Вставить("Организация", ДокументОбъект.Организация);
//			Реквизиты.Вставить("СуммаДокумента", 0);
//			Реквизиты.Вставить("Валюта", ДокументОбъект.Валюта);
//			Реквизиты.Вставить("Контрагент", ДокументОбъект.Контрагент);
//			Реквизиты.Вставить("Партнер", Неопределено);
//			Реквизиты.Вставить("ХозяйственнаяОперация", ДокументОбъект.ХозяйственнаяОперация);
//			
//			АдресПлатежейВХранилище = "";
//			ТаблицаОстатковРасчетов = Неопределено;
//			
//			ВзаиморасчетыСервер.ЗаполнитьТаблицуОстатковРасчетов(Реквизиты, АдресПлатежейВХранилище, ТаблицаОстатковРасчетов);
//			
//			ТаблицаОстатковРасчетов.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
//			ТаблицаОстатковРасчетов.Колонки.Добавить("ОснованиеПлатежа");
//			
//			РаспределяемаяСумма = ДокументОбъект.СуммаДокумента;
//			
//			Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
//				
//				Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаТаблицы.Заказ)) Тогда
//					
//					//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.10.2020 13:18:16 задача 365
//					НомерДокументаРасчетов = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТаблицы.Номер, Истина, Истина);
//					МассивНазначения=СтрРазделить(СтрокаДокумента.НазначениеПлатежа," ",);
//					МассивРезультат = Новый Массив;
//					Для Каждого СтрНазн из МассивНазначения Цикл
//						СтрНазн=смартОбщегоНазначения.УдаляемНечисла(СтрНазн);
//						Если ЗначениеЗаполнено(СтрНазн) тогда
//							МассивРезультат.Добавить(СокрЛП(СтрНазн));
//						КонецЕсли;
//					КонецЦикла;
//					МассивНазначения = Новый Массив;
//					Если МассивРезультат.Найти(НомерДокументаРасчетов)<>Неопределено Тогда
//						//Смарт }Подкин Алексей Иванович 01.10.2020 13:18:16
//						
//						СтрокаТаблицы.ОснованиеПлатежа = СтрокаТаблицы.Заказ;
//						
//						//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 01.10.2020 13:17:57 задача 365
//						//НомерДокументаРасчетов = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТаблицы.Номер, Истина, Истина);
//						//Если СтрЧислоВхождений(СтрокаДокумента.НазначениеПлатежа, НомерДокументаРасчетов) > 0 Тогда
//						//Смарт }Подкин Алексей Иванович 01.10.2020 13:17:57
//						
//						СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//						
//						СуммаСтроки = Мин(РаспределяемаяСумма, Окр(СтрокаТаблицы.Сумма,2)); //Алексей 01.12.2021 добавил округление сумм 
//						РаспределяемаяСумма = РаспределяемаяСумма - Окр(СтрокаТаблицы.Сумма,2); //Алексей 01.12.2021 добавил округление сумм 
//                        
//						ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаТаблицы,, "Сумма");
//						СтрокаРасшифровки.Сумма = СуммаСтроки;
//						
//						СтрокаТаблицы.Обработано = Истина;
//                        Если РаспределяемаяСумма <= 0 Тогда 


//                            Прервать;
//                        КонецЕсли;
//					    
//					КонецЕсли;
//				КонецЕсли;
//			КонецЦикла;
//			//смарт rnp 365 26.02.2021 закомментировано, т.к. подстановка по остаткам не требуется, оплата строго по назначению платежа 
//			//Если ПроводитьДокументы И РаспределяемаяСумма > 0 Тогда // Подбор объектов расчетов
//			//	
//			//	Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
//			//		
//			//		Если ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
//			//			
//			//			Если СтрокаТаблицы.Обработано Тогда
//			//				Продолжить;
//			//			КонецЕсли;
//			//			
//			//			СтрокаТаблицы.ОснованиеПлатежа = СтрокаТаблицы.Заказ;
//			//			
//			//			СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//			//			
//			//			СуммаСтроки = Мин(РаспределяемаяСумма, СтрокаТаблицы.Сумма);
//			//			РаспределяемаяСумма = РаспределяемаяСумма - СтрокаТаблицы.Сумма;
//			//			
//			//			ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаТаблицы,, "Сумма");
//			//			СтрокаРасшифровки.Сумма = СуммаСтроки;
//			//			
//			//			СтрокаТаблицы.Обработано = Истина;
//			//			
//			//			Если РаспределяемаяСумма <= 0 Тогда
//			//				Прервать;
//			//			КонецЕсли;
//			//			
//			//		КонецЕсли;
//			//	КонецЦикла;
//			//КонецЕсли;
//            
//            Если РаспределяемаяСумма > 0 Или Не ДокументОбъект.РасшифровкаПлатежа.Количество() Тогда

//				СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаДокумента, "Партнер, СтатьяДвиженияДенежныхСредств");
//				
//				//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 02.10.2020 9:58:55 задача 365
//				Если СтрокаДокумента.ОбъектРасчетов=Неопределено 
//					И НЕ ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации Тогда //Каратеев +- //29.07.2021/ Добавлено условие, требуется адоптировать поиск договора для этой хоз. операции
//					СтрокаДокумента.ОбъектРасчетов=смартОбщегоНазначения.ПолучитьДоговор(Реквизиты.Организация, Реквизиты.Контрагент, Перечисления.ТипыДоговоров.СПокупателем);
//					СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств=Справочники.смартПредопределенныеЗначения.СтатьяДДСДог.Значение;
//				КонецЕсли;
//				//Смарт }Подкин Алексей Иванович 02.10.2020 9:58:55
//				
//				СтрокаРасшифровки.ОснованиеПлатежа = СтрокаДокумента.ОбъектРасчетов;
//				СтрокаРасшифровки.Заказ = СтрокаДокумента.ОбъектРасчетов;
//				СтрокаРасшифровки.Сумма = РаспределяемаяСумма;
//			КонецЕсли;
//			
//			ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(
//			ДокументОбъект.РасшифровкаПлатежа,
//			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(
//			ДокументОбъект.Дата, ДокументОбъект.Валюта, ДокументОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ОснованиеПлатежа"), Истина));
//		КонецЕсли; 
//		//Смарт }Подкин Алексей Иванович 29.03.2021 12:17:57
//	КонецЕсли;
//КонецЕсли;

//КонецПроцедуры

#КонецОбласти
#КонецЕсли