//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыОткрытияФормы", Новый ОписаниеТипов));	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	ЭтаФорма.ПараметрыОткрытияФормы = Новый Структура;
	Если Параметры.Свойство("Потребность_Номенклатура") Тогда
		ЭтаФорма.ПараметрыОткрытияФормы.Вставить("Номенклатура", Параметры.Потребность_Номенклатура);
	КонецЕсли;
	Если Параметры.Свойство("Потребность_Серия") Тогда
		ЭтаФорма.ПараметрыОткрытияФормы.Вставить("Серия", Параметры.Потребность_Серия);
	КонецЕсли;
	
	НоваяКоманда = Команды.Добавить("смартВыводТовараИзОборота");
	НоваяКоманда.Заголовок = "Вывод товара из оборота";
	НоваяКоманда.Действие = "смартВыводТовараИзОборота";
	
	НовыйЭлемент = Элементы.Добавить("ФормасмартВыводТовараИзОборота", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "смартВыводТовараИзОборота";
	НовыйЭлемент.Заголовок = "Вывод товара из оборота";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура смартВыводТовараИзОборота(Команда) 
	
	ПараметрыФормы  = Новый Структура("Номенклатура, Серия");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтаФорма.ПараметрыОткрытияФормы);
	
	ОткрытьФорму("Справочник.Назначения.Форма.смартФормаСозданияНазначения", ПараметрыФормы,,,,, 
		Новый ОписаниеОповещения("ВыводТовараИзОборотаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыводТовараИзОборотаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ОповеститьОВыборе(Результат);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
//-- #5030 смарт: Тимофеева 02.02.26
