
#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокТелефонов.СписокВыбора.ЗагрузитьЗначения(Параметры.НайденныеТелефоны);
	Элементы.СписокВыбораЭлектроннойПочты.СписокВыбора.ЗагрузитьЗначения(Параметры.НайденнаяЭП);
	
КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	Если ЗначениеЗаполнено(ВыбранныйТелефон) И ЗначениеЗаполнено(ВыбраннаяЭП) Тогда
	
		ЭтаФорма.ВладелецФормы.ТелефонДляЛК = ВыбранныйТелефон;
		ЭтаФорма.ВладелецФормы.ЭлектроннаяПочтаДляЛК = ВыбраннаяЭП;
	
	Иначе
		
		ЭтаФорма.ВладелецФормы.КонтактноеЛицоДляЛК = Неопределено;
		ЭтаФорма.ВладелецФормы.ТелефонДляЛК = Неопределено;
		ЭтаФорма.ВладелецФормы.ЭлектроннаяПочтаДляЛК = Неопределено;
	
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.ВладелецФормы.КонтактноеЛицоДляЛК = Неопределено;
	ЭтаФорма.ВладелецФормы.ТелефонДляЛК = Неопределено;
	ЭтаФорма.ВладелецФормы.ЭлектроннаяПочтаДляЛК = Неопределено;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТелефоновОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ВыбранныйТелефон = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораЭлектроннойПочтыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ВыбраннаяЭП = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
//++ #Б-2748 смарт: Фролов 20.03.2025 //Доработка формы создания договора
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если НЕ ЗначениеЗаполнено(ВыбранныйТелефон) И НЕ ЗначениеЗаполнено(ВыбраннаяЭП) Тогда
	
		ЭтаФорма.ВладелецФормы.КонтактноеЛицоДляЛК = Неопределено;
		ЭтаФорма.ВладелецФормы.ТелефонДляЛК = Неопределено;
		ЭтаФорма.ВладелецФормы.ЭлектроннаяПочтаДляЛК = Неопределено;
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-2748 смарт: Фролов 20.03.2025

#КонецОбласти