#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	Отказ = ПроверкаПоДаннымПредопределенный();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаПоДаннымПредопределенный()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &min >= CRM_ИнтервалыВремениНаСайте.min
		|				И &min <= CRM_ИнтервалыВремениНаСайте.max
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МинимальноеЧисло,
		|	ВЫБОР
		|		КОГДА &max >= CRM_ИнтервалыВремениНаСайте.min
		|				И &max <= CRM_ИнтервалыВремениНаСайте.max
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МаксимальноеЧисло
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.CRM_ИнтервалыВремениНаСайте КАК CRM_ИнтервалыВремениНаСайте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.МинимальноеЧисло КАК МинимальноеЧисло,
		|	ВТ.МаксимальноеЧисло КАК МаксимальноеЧисло
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	(ВТ.МинимальноеЧисло
		|			ИЛИ ВТ.МаксимальноеЧисло)";
	
	Запрос.УстановитьПараметр("max", max);
	Запрос.УстановитьПараметр("min", min);
	
	РезультатЗапроса = Запрос.Выполнить().Пустой();
	
	Если НЕ РезультатЗапроса Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заданные числа пересекаются с другими показателями, необходимо изменить значения");
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли