
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	// +CRM
	УстановитьПараметрыОтбораФормуВыбора(Параметры, Список.Отбор);
	// -CRM
	
КонецПроцедуры

// +CRM

// Устанавливает параметры отбора в отбор динамического списка
//
// Параметры
//  Параметры                - Структура - параметры, переданные форме
//  ОтборДинамическогоСписка - Отбор - Отбор динамического списка,
//                             в который устанавливаются параметры отбора.
&НаСервере
Процедура УстановитьПараметрыОтбораФормуВыбора(Параметры,ОтборДинамическогоСписка)
	Если Параметры.Свойство("МассивОтбора") = Истина Тогда
		Для Каждого ЭлементМассиваОтбора Из Параметры.МассивОтбора Цикл
			ЭлементОтбораДанных = ОтборДинамическогоСписка.Элементы.Добавить(ЭлементМассиваОтбора.ТипОтбора);
			ЭлементОтбораДанных.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЭлементМассиваОтбора.ЛевоеЗначение);
			ЭлементОтбораДанных.Использование  = Истина;
			ЭлементОтбораДанных.ВидСравнения   = ЭлементМассиваОтбора.ВидСравнения;
			ЭлементОтбораДанных.ПравоеЗначение = ЭлементМассиваОтбора.ПравоеЗначение;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

// -CRM

#КонецОбласти
