
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПоляПоиска") Тогда
		Для Каждого ПолеПоиска Из Параметры.ПоляПоиска Цикл
			ПоляПоиска.Добавить(ПолеПоиска.Значение, ПолеПоиска.Представление, ПолеПоиска.Пометка);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляПоиска

&НаКлиенте
Процедура ПоляПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоляПоиска[ВыбраннаяСтрока].Пометка = НЕ ПоляПоиска[ВыбраннаяСтрока].Пометка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	Закрыть(ПоляПоиска);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
