
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("стрHTML") Тогда
		ПолеHTML_gl = Параметры.стрHTML;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеHTML_glДокументСформирован(Элемент)
	
	стрUrl = Элемент.Документ.URLUnencoded; 
	
	Если СтрНайти(стрUrl,"code=") Тогда
		стрUrl = СтрЗаменить(Прав(стрUrl,(СтрДлина(стрUrl) - СтрНайти(стрUrl,"code=")+1)),"code=","");
		СтруктураВозврПараметров = Новый Структура;
		СтруктураВозврПараметров.Вставить("Code", стрUrl);
		Закрыть(СтруктураВозврПараметров);
	КонецЕсли;
	            
КонецПроцедуры

#КонецОбласти