#Область ПеренесеноСДоработкамиСмарт

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	смартДобавитьЭлементыПрограммно();
	
	//подтянем из заказа данные контейнера
	СтруктураПоискаБезСерии = Новый Структура("Номенклатура, Характеристика, КодСтроки, ЗаказПоставщику, Склад");
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.ТаблицаТоваров Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоискаБезСерии, СтрокаТаблицы);	
		СтрокаТаблицы.смартКонтейнер = смартПолучитьСтрокуКонтейнераНаСервере(СтруктураПоискаБезСерии);
	КонецЦикла;	
КонецПроцедуры//--#1374 смарт: Балашов 21.06.2023

#КонецОбласти

#Область ДоработкиСмарт 

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смартДобавитьЭлементыПрограммно()

	МассивДобавляемыхРеквизитов = Новый Массив;
	Реквизит_Контейнер = Новый РеквизитФормы("смартКонтейнер", Новый ОписаниеТипов("Строка"),"ТаблицаТоваров", "смартКонтейнер");
	МассивДобавляемыхРеквизитов.Добавить(Реквизит_Контейнер); 

	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	НоваяКолонка = Элементы.Добавить("смартКонтейнер", Тип("ПолеФормы"), Элементы.ТаблицаТоваров); 
	НоваяКолонка.Заголовок = "смартКонтейнер"; 
	НоваяКолонка.ПутьКДанным = "ТаблицаТоваров.смартКонтейнер"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
	НоваяКолонка.АвтоВысотаЯчейки = истина; 

КонецПроцедуры//--#1374 смарт: Балашов 21.06.2023

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартПолучитьСтрокуКонтейнераНаСервере(СтруктураПоискаБезСерии)
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ Ссылка, смартКонтейнер, Ссылка.Груз, Номенклатура 
		|ИЗ Документ.ЗаказПоставщику.Товары КАК ЗПТ 
		|ГДЕ 
		|	Ссылка = &ЗаказПоставщику 
		|	И Номенклатура = &Номенклатура
		|	И КодСтроки = &КодСтроки
		|	И Склад = &Склад
		|	И Характеристика = &Характеристика";                  
	ПараметрыЗапроса = Запрос.НайтиПараметры(); 
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Имя, СтруктураПоискаБезСерии[ПараметрЗапроса.Имя]);
	КонецЦикла;	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатЗапроса = Выборка.смартКонтейнер;
		//проверим полученный результат на возможность использования в документе
		Заказ = Выборка.Ссылка;
		Номенклатура = Выборка.Номенклатура;
		Груз = Выборка.Груз;
		Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
			МассивКонтейнеров = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(РезультатЗапроса);
			Если ТипЗнч(МассивКонтейнеров) = Тип("Массив") Тогда
				Для Каждого Контейнер Из МассивКонтейнеров Цикл
					НовыйGUID = Новый УникальныйИдентификатор(Контейнер.Ссылка);
					СсылкаКонтейнер = Справочники.смартКонтейнеры.ПолучитьСсылку(НовыйGUID);
					КЗаполению = смартПроверитьКонтейнерДляЗаполнения(Заказ, Номенклатура, Груз, СсылкаКонтейнер); 
					Если Не КЗаполению или Не Контейнер.Пометка Тогда
						МассивКонтейнеров.Удалить(МассивКонтейнеров.Найти(Контейнер));
					КонецЕсли;	
				КонецЦикла;	
				Если МассивКонтейнеров.Количество() > 0 Тогда
					РезультатЗапроса = смартОбщегоНазначения.смартЗаписатьВыбраныеКонтейнерыВJSON(МассивКонтейнеров);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	Иначе
		РезультатЗапроса = "";
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции//--#1374 смарт: Балашов 21.06.2023

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
Функция смартПроверитьКонтейнерДляЗаполнения(Заказ, Номенклатура, Груз, Контейнер)
	Результат = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	смартГрузыКОформлениюОстатки.Заказ КАК Заказ,
		|	смартГрузыКОформлениюОстатки.Номенклатура КАК Номенклатура,
		|	смартГрузыКОформлениюОстатки.Груз КАК Груз,
		|	смартГрузыКОформлениюОстатки.Контейнер КАК Контейнер,
		|	смартГрузыКОформлениюОстатки.КОформлениюОстаток КАК КОформлениюОстаток,
		|	смартГрузыКОформлениюОстатки.КПриемкеОстаток КАК КПриемкеОстаток
		|ИЗ
		|	РегистрНакопления.смартГрузыКОформлению.Остатки КАК смартГрузыКОформлениюОстатки
		|ГДЕ
		|	смартГрузыКОформлениюОстатки.Заказ = &Заказ
		|	И смартГрузыКОформлениюОстатки.Номенклатура = &Номенклатура
		|	И смартГрузыКОформлениюОстатки.Груз = &Груз
		|	И смартГрузыКОформлениюОстатки.Контейнер = &Контейнер	
		|	";
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Груз",Груз);
	Запрос.УстановитьПараметр("Контейнер",Контейнер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.КОформлениюОстаток;
	КонецЕсли;	
	Возврат Результат;
КонецФункции//--#1374 смарт: Балашов 21.06.2023

#КонецОбласти

