
#Область ДоработкиСмарт

// Смарт Фролов+
// Функция возвращает данные есть ли у Контрагента движения по документам и создан ли договор
// Входные параметры: Контрагент - сыылка на элемент справочника контрагенты
// Выходные данные: Структура 
Функция УКонтрагентаЕстьДокументыДоговор(Контрагент) Экспорт 
	ВозвращаемыеДанные=Новый Структура("Документ,Договор",Ложь,Ложь);
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеестрДокументов.Ссылка, ИСТИНА) = ИСТИНА
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Документ,
	|	NULL КАК Договор
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|ГДЕ
	|	(ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты)) = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	NULL,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыКонтрагентов.Ссылка, ИСТИНА) = ИСТИНА
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВТ.Документ), ЛОЖЬ) КАК Документ,
	|	ЕСТЬNULL(МАКСИМУМ(ВТ.Договор), ЛОЖЬ) КАК Договор
	|ИЗ
	|	ВТ КАК ВТ";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез=Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Если Рез.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ВозвращаемыеДанные,Рез);
	КонецЕсли;
	
	Возврат ВозвращаемыеДанные;
КонецФункции
// Фролов-

#КонецОбласти