
&НаКлиенте
Процедура КопироватьДругимИЗакрыть(Команда)
	
	МассивРезультат = Новый Массив;
	
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		Если МассивРезультат.Найти(ТекСтрока.Номенклатура) = Неопределено Тогда
			МассивРезультат.Добавить(ТекСтрока.Номенклатура);	
		КонецЕсли;		
	КонецЦикла;
	
	Закрыть(МассивРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
		
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимВыбора", Истина, Истина, Истина);
	ФормаПодбора = ПолучитьФорму("Справочник.смартIECHOКомплектующие.ФормаВыбора", ПараметрыПодбора, ЭтаФорма.Элементы.СписокНоменклатуры);	
	ФормаПодбора.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.смартIECHOКомплектующие") Тогда
		
		НоваяСтрока = СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого Номенклатура Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;			
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

