#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТолькоСвои", ТолькоСвои);
	Параметры.Свойство("КоличествоВыводимых", КоличествоВыводимых);
	Параметры.Свойство("ОбщаяСтатистика", ОбщаяСтатистика);
	Если КоличествоВыводимых = 0 Тогда
		КоличествоВыводимых = 10;
	КонецЕсли;
    ЗаполнитьСписокГрупп(Параметры.Фильтр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ТекФильтр = Новый СписокЗначений;
	Для каждого Элемент из Фильтр Цикл
		Если Элемент.Пометка Тогда
			ТекФильтр.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	Результат = Новый Структура("ТолькоСвои, Фильтр,КоличествоВыводимых,ОбщаяСтатистика"
		, ТолькоСвои, ТекФильтр, КоличествоВыводимых, ОбщаяСтатистика);
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокГрупп(ТекФильтр)

	Фильтр.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_Решения.Ссылка КАК Ссылка,
	                      |	CRM_Решения.Ссылка В (&Фильтр) КАК Пометка
	                      |ИЗ
	                      |	Справочник.CRM_Решения КАК CRM_Решения
	                      |ГДЕ
	                      |	CRM_Решения.ЭтоГруппа
	                      |	И CRM_Решения.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_Решения.ПустаяСсылка)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_Решения.Наименование");

	Запрос.УстановитьПараметр("Фильтр", ТекФильтр);
	Запрос.УстановитьПараметр("ПустойФильр", (ТекФильтр.Количество() = 0));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Фильтр.Добавить(Выборка.Ссылка, , Выборка.Пометка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
