#Область ПрограммныйИнтерфейс

#Область НастройкаСистемы

// Возвращает признак использования учета прослеживаемых, импортных товаров на указанную дату.
//
// Параметры:
//	Дата - Дата - дата, на которую нужно получить значение возможности использования учета прослеживаемых, импортных
//					товаров.
//
// Возвращаемое значение:
//	Булево - Истина означает, что доступна возможность учета прослеживаемых, импортных товаров.
//
Функция ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата) Экспорт
	
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = Ложь;
	//++ Локализация
	ДатаПроверкиФО = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров")
		И НачалоМесяца(ДатаПроверкиФО) >= ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров() Тогда
		
		ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = Истина;
		
	КонецЕсли;
	//-- Локализация
	Возврат ИспользоватьУчетПрослеживаемыхИмпортныхТоваров;
	
КонецФункции

// Возвращает значение даты начала использования учета прослеживаемых, импортных товаров.
//
// Возвращаемое значение:
//	Дата - дата начала использования учета прослеживаемых, импортных товаров.
//
Функция ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров() Экспорт
	
	ДатаНачалаУчета = Дата(2399, 1, 1);
	//++ Локализация
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров") Тогда
		ДатаНачалаУчета = НачалоМесяца(Константы.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров.Получить());
	КонецЕсли;
	//-- Локализация
	Возврат ДатаНачалаУчета;
	
КонецФункции

// Вычисляет значение константы ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД.
// Значение Истина будет установлена в том случае, если существует номенклатурная позиция, в которой
// единица измерения и единица измерения ТНВЭД заполнены и не равны друг другу.
//
Процедура УстановитьФОИспользуетсяУчетВЕдиницеИзмеренияТНВЭД() Экспорт
	
	//++ Локализация
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Номенклатура.ЕдиницаИзмеренияТНВЭД <> Номенклатура.ЕдиницаИзмерения
	|			И Номенклатура.ЕдиницаИзмеренияТНВЭД <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕстьРазницаЕдиниц
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.ЕстьРазницаЕдиниц КАК ЕстьРазницаЕдиниц,
	|	ВтТовары.ЕстьРазницаЕдиниц <> ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД.Значение КАК ТребуетсяПерезаписьКонстанты
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД КАК ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ВтТовары.ЕстьРазницаЕдиниц ЕСТЬ NULL";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()
		И Выборка.ТребуетсяПерезаписьКонстанты Тогда
		Константы.ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД.Установить(Выборка.ЕстьРазницаЕдиниц);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеКБСП

// См. ОбщийМодуль.СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании()
//
Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	//++ Локализация
	Объекты.Добавить(Метаданные.Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	//-- Локализация
	
КонецПроцедуры

// См. ОбщийМодуль.ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов()
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	//++ Локализация
	Объекты.Добавить(Метаданные.Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	//-- Локализация
	
КонецПроцедуры

// См. ОбщийМодуль.УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа()
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ Локализация
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеПрослеживаемыхТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ПрослеживаемостьУведомления, Истина);
	//-- Локализация
	
КонецПроцедуры

// Дополняет профиль ролями доступа к метаданным подсистемы прослеживаемости.
//
// Параметры:
//	ОписаниеПрофиля - Структура - Описание профиля. 
//                                Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
Процедура ДобавитьДобавлениеИзменениеУведомленийПрослеживаемыхТоваров(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийПрослеживаемыхТоваров");
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыКомплектации

// Возвращает параметры проверки комплекта товаров.
//
// Возвращаемое значение:
//	Структура - параметры проверки комплекта, содержащие следующие свойства:
//		* Дата - Дата - дата объекта, на которую осуществляется работа с комплектом.
//		* СборкаКомплекта - Булево - признак того, что осуществляется сборка комплекта. Значение по умолчанию Истина.
//		* Номенклатура - СправочникСсылка.Номенклатура,
//							Неопределено - номенклатура комплекта. Значение по умолчанию Неопределено.
//		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры,
//							Неопределено - характеристика комплекта. Значение по умолчанию Неопределено.
//		* НоменклатураОсновногоКомпонента -СправочникСсылка.Номенклатура,
//											Неопределено - номенклатура основного компонента.
//											Значение по умолчанию Неопределено.
//		* ХарактеристикаОсновногоКомпонента - СправочникСсылка.ХарактеристикиНоменклатуры,
//												Неопределено - характеристика основного компонента.
//																Значение по умолчанию Неопределено.
//		* ИмяТЧ - Строка - имя табличной части объекта.
//		* Контролировать - Булево - признак того, что требуется проверить комплект.
//
Функция ПараметрыПроверкиКорректностиКомплекта() Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Дата",				Дата(1, 1, 1));
	ПараметрыПроверки.Вставить("СборкаКомплекта",	Истина);
	
	ПараметрыПроверки.Вставить("Номенклатура");
	ПараметрыПроверки.Вставить("Характеристика");
	
	ПараметрыПроверки.Вставить("НоменклатураОсновногоКомпонента");
	ПараметрыПроверки.Вставить("ХарактеристикаОсновногоКомпонента");
	
	ПараметрыПроверки.Вставить("ИмяТЧ", "Товары");
	
	ПараметрыПроверки.Вставить("Контролировать", Истина);
	
	Возврат ПараметрыПроверки;
	
КонецФункции

// Выполняет проверку корректности содержимого комплекта в части учета прослеживаемых товаров по РНПТ.
//
// Параметры:
//	Объект - СправочникОбъект, ДокументОбъект - объект, для которого выполняется проверка.
//	Отказ - Булево - признак продолжения дальнейшей обработки проверяемого объекта в информационной базе.
//	ПараметрыПроверки - см. ПараметрыПроверкиКорректностиКомплекта.
//
Процедура ПроверитьКорректностьКомплекта(Объект, Отказ, ПараметрыПроверки) Экспорт
	
	//++ Локализация
	Если ПараметрыПроверки = Неопределено Тогда
		ПараметрыПроверки = ПараметрыПроверкиКорректностиКомплекта();
	КонецЕсли;
	
	Если Не ПараметрыПроверки.Контролировать Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОбъекта = ПараметрыПроверки.Дата;
	
	Если Не ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(ДатаОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧастьОбъекта	= Объект[ПараметрыПроверки.ИмяТЧ]; // ТабличнаяЧасть
	Комплектующие			= ТабличнаяЧастьОбъекта.Выгрузить();
	РедактированиеНабора	= Комплектующие.Колонки.Найти("Отменено") <> Неопределено;
	
	Если РедактированиеНабора Тогда
		ПараметрыОтбора	= Новый Структура("Отменено", Ложь);
		Комплектующие	= Объект[ПараметрыПроверки.ИмяТЧ].Выгрузить(ПараметрыОтбора);
	КонецЕсли;
	
	Если Комплектующие.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СборкаКомплекта = ПараметрыПроверки.СборкаКомплекта;
	
	Номенклатура	= ПараметрыПроверки.Номенклатура;
	Характеристика	= ПараметрыПроверки.Характеристика;
	
	НоменклатураОсновногоКомпонента		= ПараметрыПроверки.НоменклатураОсновногоКомпонента;
	ХарактеристикаОсновногоКомпонента	= ПараметрыПроверки.ХарактеристикаОсновногоКомпонента;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Комплектующие",						Комплектующие);
	Запрос.УстановитьПараметр("СборкаКомплекта",					СборкаКомплекта);
	Запрос.УстановитьПараметр("НоменклатураКомплект",				Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаКомплект",				Характеристика);
	Запрос.УстановитьПараметр("НоменклатураОсновногоКомпонента",	НоменклатураОсновногоКомпонента);
	Запрос.УстановитьПараметр("ХарактеристикаОсновногоКомпонента",	ХарактеристикаОсновногоКомпонента);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаВТДанныеКомплекта());
	ТекстыЗапросов.Добавить(ТекстЗапросаВТКомплектующие());
	ТекстыЗапросов.Добавить(ТекстЗапросаВТПрослеживаемыеКомплектующие());
	ТекстыЗапросов.Добавить(ТекстЗапросаВТПрослеживаемыеКомплектующиеСгруппированная());
	ТекстыЗапросов.Добавить(ТекстЗапросаПроверокКомплекта());
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ДанныеКомплекта = РезультатЗапроса[0].Выбрать();
	ДанныеКомплекта.Следующий();
	
	ОшибкиПроверки		= РезультатЗапроса[4].Выбрать();
	ЕстьОшибкиПроверки	= Ложь;
	КлючДанных			= ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	
	Если ОшибкиПроверки.Следующий() Тогда
		
		ТекстСообщения = "";
		
		Если ОшибкиПроверки.НепрослеживаемыйКомплект Тогда
			
			ПрослеживаемыеКомплектующие	= РезультатЗапроса[2].Выгрузить();
			ПредставлениеКомплектующих	= ПредставлениеПрослеживаемыхКомплектующих(ПрослеживаемыеКомплектующие);
			
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНепрослеживаемогоКомплекта(ДанныеКомплекта.ТипНоменклатуры),
										Номенклатура,
										ПредставлениеКомплектующих);
			
		Иначе
			
			Если ОшибкиПроверки.ОтличаютсяКодыТНВЭДСборки Тогда
				Если ЗначениеЗаполнено(НоменклатураОсновногоКомпонента) Тогда
					ПредставлениеОсновнойКомплектующей = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
															НоменклатураОсновногоКомпонента,
															ХарактеристикаОсновногоКомпонента);
					
					ТекстСообщения = СтрШаблон(ШаблонСообщенияОтличияКодовТНВЭДСборки(ДанныеКомплекта.ТипНоменклатуры),
												Номенклатура,
												ПредставлениеОсновнойКомплектующей);
				Иначе
					ТекстСообщения = СтрШаблон(ШаблонСообщенияЗаполненияОсновнойКомплектующей(ДанныеКомплекта.ТипНоменклатуры),
												Номенклатура);
				КонецЕсли;
			ИначеЕсли ОшибкиПроверки.ОтличаютсяКодыТНВЭДРазборки Тогда
				ПрослеживаемыеКомплектующие	= РезультатЗапроса[3].Выгрузить();
				ДанныеКомплектующей			= ПрослеживаемыеКомплектующие[0];
				
				ПредставлениеОсновнойКомплектующей = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
														ДанныеКомплектующей.Номенклатура,
														ДанныеКомплектующей.Характеристика);
				
				ТекстСообщения = СтрШаблон(ШаблонСообщенияОтличияКодовТНВЭДРазборки(ДанныеКомплекта.ТипНоменклатуры),
											Номенклатура,
											ПредставлениеОсновнойКомплектующей);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ЕстьОшибкиПроверки = Истина;
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, "", "", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьОшибкиПроверки Тогда
		Возврат;
	КонецЕсли;
	
	ПрослеживаемыеКомплектующие = РезультатЗапроса[3].Выгрузить();
	
	Если Не СборкаКомплекта
		И ДанныеКомплекта.ПрослеживаемыйТовар Тогда
		
		ЕстьОшибкиПроверки = Истина;
		
		Если Не ПрослеживаемыеКомплектующие.Количество() Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНепрослеживаемыеКомплектующие(), Номенклатура);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, "", "", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ПрослеживаемыеКомплектующие.Количество() > 1 Тогда
		ЕстьОшибкиПроверки = Истина;
		
		ПредставлениеКомплектующих = ПредставлениеПрослеживаемыхКомплектующих(ПрослеживаемыеКомплектующие, Ложь);
		
		ШаблонСообщения	= ШаблонСообщенияРазличныеПрослеживаемыеКомплектующие(ДанныеКомплекта.ТипНоменклатуры,
																				СборкаКомплекта,
																				РедактированиеНабора);
		ТекстСообщения	= СтрШаблон(ШаблонСообщения, Номенклатура, ПредставлениеКомплектующих);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, "", "", Отказ);
	КонецЕсли;
	
	Если ЕстьОшибкиПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКомплекта.ОшибкаВеденияУчетаПоГТД Тогда
		ШаблонСообщения	= ШаблонСообщенияКорректностиНастроекПрослеживаемостиНоменклатуры(ДанныеКомплекта.ТипНоменклатуры,
																							Истина);
		ТекстСообщения	= СтрШаблон(ШаблонСообщения, Номенклатура);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, "", "", Отказ);
	КонецЕсли;
	
	Если Не СборкаКомплекта Тогда
		ОтборСтрок		= Новый Структура("ОшибкаВеденияУчетаПоГТД", Истина);
		СтрокиСОшибками	= ПрослеживаемыеКомплектующие.НайтиСтроки(ОтборСтрок);
		
		Для Каждого СтрокаОшибки Из СтрокиСОшибками Цикл
			ШаблонСообщения	= ШаблонСообщенияКорректностиНастроекПрослеживаемостиНоменклатуры(Перечисления.ТипыНоменклатуры.Товар);
			ТекстСообщения	= СтрШаблон(ШаблонСообщения, СтрокаОшибки.Номенклатура);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, "", "", Отказ);
		КонецЦикла;
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

// Возвращает признак наличия в документе прослеживаемых товаров по РНПТ.
//
// Параметры:
//	Ссылка - ДокументСсылка - документ, в котором выполняется проверка наличия прослеживаемых товаров по РНПТ.
//
// Возвращаемое значение:
//	Булево - Истина означает, что проверяемый документ содержит прослеживаемые товары по РНПТ.
//
Функция ЕстьПрослеживаемыйТоварВДокументе(Ссылка) Экспорт
	
	//++ Локализация
	ЕстьПрослеживаемыйТовар	= Ложь;
	ИмяТаблицыИсточника		= "";
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда
		ИмяТаблицыИсточника = "Документ.ОтчетКомиссионераОСписании.Товары";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		ИмяТаблицыИсточника = "Документ.ОтчетКомиссионера.Товары";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		ИмяТаблицыИсточника = "Документ.ОтчетКомитенту.ВидыЗапасов";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетКомитентуОСписании") Тогда
		ИмяТаблицыИсточника = "Документ.ОтчетКомитентуОСписании.ВидыЗапасов";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ИмяТаблицыИсточника = "Документ.РеализацияТоваровУслуг.ВидыЗапасов";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ИмяТаблицыИсточника = "Документ.ВозвратТоваровПоставщику.ВидыЗапасов";
	КонецЕсли;
	
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата(1, 1, 1));
	
	Если ИмяТаблицыИсточника <> ""
		И ИспользоватьУчетПрослеживаемыхИмпортныхТоваров Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЗаполненРНПТвГТД
		|ИЗ
		|	&ИмяТаблицыИсточника КАК Товары
		|
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И ЕСТЬNULL(Товары.НомерГТД.РНПТ, ЛОЖЬ)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыИсточника", ИмяТаблицыИсточника);
		
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЕстьПрослеживаемыйТовар = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьПрослеживаемыйТовар;
	//-- Локализация
	
КонецФункции

// Дополняет параметры проверки заполнения в таблице поля 'КоличествоПоРНПТ'.
//
Процедура ДополнитьПараметрыПроверкиЗаполненияКоличестваПоРНПТ(ПараметрыПроверки) Экспорт
	
	//++ Локализация
	ПараметрыПроверки.Вставить("ПутьКДаннымТаблицы",		"Объект");
	ПараметрыПроверки.Вставить("ИмяПоляДата",				"Дата");
	ПараметрыПроверки.Вставить("ИмяТЧ",						"Товары");
	ПараметрыПроверки.Вставить("ПредставлениеТЧ",			"");
	ПараметрыПроверки.Вставить("ИмяКолонкиНоменклатура",	"Номенклатура");
	ПараметрыПроверки.Вставить("СписокСтрок",				Неопределено);
	ПараметрыПроверки.Вставить("ОтборПроверяемыхСтрок",		Новый Структура);
	//-- Локализация
	
КонецПроцедуры

// Проверяет заполнение в таблице поля 'КоличествоПоРНПТ'.
//
// Параметры:
//	Объект - ДокументОбъект, Структура, ФормаКлиентскогоПриложения - объект, в табличной части которого выполняется проверка и который содержит:
//		* Ссылка - ДокументСсылка - ссылка на документ информационной базы.
//	Отказ - Булево - Истина, признак того, что в табличной части объекта не заполнено проверяемое поле.
//	ПараметрыПроверки - Структура, Неопределено - параметры проверки.
//
Процедура ПроверитьЗаполнениеКоличестваПоРНПТ(Объект, Отказ, ПараметрыПроверки) Экспорт
	
	//++ Локализация
	Если ПараметрыПроверки = Неопределено Тогда
		ПараметрыПроверки = Новый Структура;
		
		ДополнитьПараметрыПроверкиЗаполненияКоличестваПоРНПТ(ПараметрыПроверки);
	КонецЕсли;
	
	ДатаОбъекта = ТекущаяДатаСеанса();
	ИмяПоляДата = ПараметрыПроверки.ИмяПоляДата;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяПоляДата) Тогда
		ДатаОбъекта = Объект[ИмяПоляДата];
	КонецЕсли;
	
	Если Не ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(ДатаОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = ПараметрыПроверки.ИмяТЧ;
	ОтборСтрокДляПроверки = ПараметрыПроверки.СписокСтрок;
	
	Если ОтборСтрокДляПроверки = Неопределено
		И ПараметрыПроверки.ОтборПроверяемыхСтрок.Количество() > 0 Тогда
		
		ОтборСтрокДляПроверки = ПараметрыПроверки.ОтборПроверяемыхСтрок;
		
	КонецЕсли;
	
	ИмяКолонкиНоменклатура = ПараметрыПроверки.ИмяКолонкиНоменклатура;
	ВыгружаемыеКолонки = "НомерСтроки, КоличествоПоРНПТ, " + ИмяКолонкиНоменклатура;
	
	ТаблицаТоваров = Объект[ИмяТЧ].Выгрузить(ОтборСтрокДляПроверки, ВыгружаемыеКолонки);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТоваров.КоличествоПоРНПТ КАК КоличествоПоРНПТ
	|ПОМЕСТИТЬ ТаблицаТоварыДляЗапроса
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	&ПроверитьКоличествоПоРНПТ
	|		И ТаблицаТоваров.КоличествоПоРНПТ = 0
	|		И ЕСТЬNULL(ТаблицаНоменклатуры.ВестиУчетПоГТД, ЛОЖЬ)
	|		И ЕСТЬNULL(ТаблицаНоменклатуры.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ) КАК ПустоеКоличествоПоРНПТ
	|ИЗ
	|	ТаблицаТоварыДляЗапроса КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = ТаблицаНоменклатуры.Ссылка
	|			И ТаблицаНоменклатуры.ТипНоменклатуры В(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|													ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	
	|ГДЕ
	|	&ПроверитьКоличествоПоРНПТ
	|	И ТаблицаТоваров.КоличествоПоРНПТ = 0
	|	И ЕСТЬNULL(ТаблицаНоменклатуры.ВестиУчетПоГТД, ЛОЖЬ)
	|	И ЕСТЬNULL(ТаблицаНоменклатуры.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&Номенклатура", "ТаблицаТоваров." + ИмяКолонкиНоменклатура);
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ПроверитьКоличествоПоРНПТ",
								ПолучитьФункциональнуюОпцию("ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОшибкаЗаполненияКоличестваПоРНПТ = НСтр("ru='Не заполнена колонка ""Количество по РНПТ"" в строке %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	Иначе
		МетаданныеОбъекта = Объект.Метаданные();
	КонецЕсли;
	
	ПредставлениеТЧ		= ?(Не ПараметрыПроверки.Свойство("ПредставлениеТЧ")
								Или Не ЗначениеЗаполнено(ПараметрыПроверки.ПредставлениеТЧ),
							МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Синоним,
							ПараметрыПроверки.ПредставлениеТЧ);
	КлючДанных			= ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	ПутьКДаннымТаблицы	= ПараметрыПроверки.ПутьКДаннымТаблицы;
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрЗаменить(ОшибкаЗаполненияКоличестваПоРНПТ, "%НомерСтроки%", Выборка.НомерСтроки);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", ПредставлениеТЧ);
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, Выборка.НомерСтроки, "КоличествоПоРНПТ");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, ПутьКДаннымТаблицы, Отказ);
	КонецЦикла;
	//-- Локализация
	
КонецПроцедуры

// Устанавливаем условное оформление количества по РНПТ
//
// Параметры:
//	Форма - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - содержит данные формы, которая содержит:
//		* Элементы - ВсеЭлементыФормы - элементы формы клиентского приложения.
//		* УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - условное оформление компановки данных элементов формы.
//	ИмяПоляВводаКоличествоПоРНПТ - строка - наименование элемента формы, содержащего количество по РНПТ, если оно 
//											отличается от "ТоварыКоличествоПоРНПТ".
//	ПутьКПолюОтбора - Строка - путь к реквизиту "ВедетсяУчетПоРНПТ", если он отличается от "Объект.Товары.ВедетсяУчетПоРНПТ".
//	ПутьКПолюДатаДокумента - Строка - путь к реквизиту "Дата", если он отличается от значения "Объект.Дата".
//
Процедура УстановитьУсловноеОформлениеКоличестваПоРНПТ(Форма,
														ИмяПоляВводаКоличествоПоРНПТ = "ТоварыКоличествоПоРНПТ",
														ПутьКПолюОтбора = "Объект.Товары.ВедетсяУчетПоРНПТ",
														ПутьКПолюДатаДокумента = "Объект.Дата") Экспорт

	ДатаНачалаПрослеживаемости = ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров();
	
	ЭлементыФормы		= Форма.Элементы;
	УсловноеОформление	= Форма.УсловноеОформление;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаКоличествоПоРНПТ].Имя);
	
	ГруппаОтбора1 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюДатаДокумента);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ДатаНачалаПрослеживаемости;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<товар не прослеживается>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь)
	
КонецПроцедуры

// Устанавливаем условное оформление номеров ГТД
//
// Параметры:
//	Форма - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - содержит данные формы, которая содержит:
//		* Элементы - ВсеЭлементыФормы - элементы формы клиентского приложения.
//		* УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - условное оформление компановки данных элементов формы.
//	ИмяПоляВводаНомераГТД - Строка - наименование элемента формы, содержащего номер ГТД, если оно отличается 
//										от "ТоварыНомерГТД".
//	ПутьКПолюОтбора - Строка - путь к реквизиту "ВедетсяУчетПоРНПТ", если он отличается от "Объект.Товары.ВедетсяУчетПоРНПТ".
//	ПутьКПолюДатаДокумента - Строка - путь к реквизиту "Дата", если он отличается от "Объект.Дата".
//	ПутьКПолюНомерГТД - Строка - путь к реквизиту "НомерГТД", если он отличается от "Объект.Товары.НомерГТД".
//
Процедура УстановитьУсловноеОформлениеНомераГТД(Форма,
												ИмяПоляВводаНомераГТД = "ТоварыНомерГТД",
												ПутьКПолюОтбора = "Объект.Товары.ВедетсяУчетПоРНПТ",
												ПутьКПолюДатаДокумента = "Объект.Дата",
												ПутьКПолюНомерГТД  = "Объект.Товары.НомерГТД") Экспорт
	
	ДатаНачалаПрослеживаемости = ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров();
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаНомераГТД].Имя);
	
	ГруппаОтбора1 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюДатаДокумента);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = ДатаНачалаПрослеживаемости;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюНомерГТД);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

// Устанавливает видимость колонки 'КоличествоПоРНПТ' в соответствующей таблице документа.
//
// Параметры:
//	Форма - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - содержит данные формы, которая содержит:
//		* Элементы - ВсеЭлементыФормы - элементы формы клиентского приложения.
//	ДатаДокумента - Дата - дата документа, необходимая для проверки возможности использования учета прослеживаемых,
//							импортных товаров.
//	ЭлементГруппаРНТП - Строка - имя соответствующего элемента формы.
//
Процедура УстановитьВидимостьКоличестваРНПТ(Форма,
											ДатаДокумента,
											ЭлементГруппаРНТП = "ТоварыГруппаКоличествоПоРНПТ") Экспорт
	
	ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД = Ложь;
	//++ Локализация
	ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД = ПолучитьФункциональнуюОпцию("ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД");
	//-- Локализация
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(ДатаДокумента);
	
	Форма.Элементы[ЭлементГруппаРНТП].Видимость = ИспользуетсяУчетВЕдиницеИзмеренияТНВЭД
													И ИспользоватьУчетПрослеживаемыхИмпортныхТоваров;
	
КонецПроцедуры

// Устанавливает условное оформление для колонок 'НомерГТД', 'СтранаПроисхождения' в соответствующей таблице документа.
//
// Параметры:
//	Форма - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - содержит данные формы, которая содержит:
//
Процедура УстановитьУсловноеОформлениеВДокументеПриобретениеТоваровУслуг(Форма) Экспорт
	
	//++ Локализация
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	#Область ДоступностьГТД
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНомерГТД.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНомерГТДСтранаПроисхождения.Имя);
		
	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВедетсяУчетПоРНПТ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ХозяйственныеОперацииЗакупкиВСтранахЕАЭС = Новый СписокЗначений;
	ХозяйственныеОперацииЗакупкиВСтранахЕАЭС.ЗагрузитьЗначения(ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС));	
	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = ХозяйственныеОперацииЗакупкиВСтранахЕАЭС;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	//-- Локализация
	
КонецПроцедуры

// Очистить данные о номере ГТД по прослеживаемым товарам.
//
// Параметры:
//	Объект - ДокументОбъект - объект, в табличной части которого выполняется очистка данных.
//
Процедура ОчиститьНомерГТДУПрослеживаемыхТоваровВДокументеПриобретениеТоваровУслуг(Объект) Экспорт
	
	//++ Локализация
	Если Не ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Объект.Дата)
		Или ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС).Найти(Объект.ХозяйственнаяОперация) = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки		КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТовары.НомерГТД			КАК НомерГТД
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары	
	|
	|ГДЕ
	|	НЕ (ТаблицаТовары.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	|	И ЕСТЬNULL(ТаблицаТовары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ)";
	
	ВыгружаемыеКолонки = "НомерСтроки, Номенклатура, НомерГТД";
	
	Запрос.УстановитьПараметр("ТаблицаТовары",	Объект.Товары.Выгрузить(, ВыгружаемыеКолонки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Товары[Выборка.НомерСтроки - 1].НомерГТД			= Неопределено;
	КонецЦикла;
	//-- Локализация
	
КонецПроцедуры

// Устанавливает видимость колонки 'КоличествоПоРНПТ' в соответствующей таблице документа.
//
// Параметры:
//	Форма - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - содержит данные формы, которая содержит:
//
Процедура УстановитьУсловноеОформлениеУчетаПоГТДВДокументахКомиссионера(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	#Область ВидимостьГТДиРНПТ
	
	// Настройки получаются из соглашения
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоПоРНПТ.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатураЕдиницаИзмеренияТНВЭД.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНомерГТД.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНомерГТДСтранаПроисхождения.Имя);
	
	ГруппаИли = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КомиссионерНеВедетУчетПоРНПТ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	#КонецОбласти
	
	#Область ДоступностьГТД
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНомерГТД.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНомерГТДСтранаПроисхождения.Имя);
	
	ГруппаИли = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВедетсяУчетПоГТД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВедетсяУчетПоРНПТ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	#КонецОбласти
	
КонецПроцедуры

// Очистить данные по импортным товарам.
//
// Параметры:
//	Объект - ДокументОбъект - объект, в табличной части которого выполняется очистка данных.
//	КомиссионерВедетУчетПоРНПТБезСоглашения - Булево - признак того, что учет комиссионных прослеживаемых товаров
//														осуществляется без использования соглашения.
//														Значение по умолчанию Ложь.
//
Процедура ОчиститьДанныеПоИмпортнымТоварамВДокументахКомиссионера(Объект,
																	КомиссионерВедетУчетПоРНПТБезСоглашения = Ложь) Экспорт
	
	//++ Локализация
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки		КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТовары.КоличествоПоРНПТ	КАК КоличествоПоРНПТ,
	|	ТаблицаТовары.НомерГТД			КАК НомерГТД
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СпрСоглашения
	|		ПО СпрСоглашения.Ссылка = &Соглашение
	|
	|ГДЕ
	|	НЕ ((&КомиссионерВедетУчетПоРНПТБезСоглашения
	|			ИЛИ ЕСТЬNULL(СпрСоглашения.КомиссионерВедетУчетПоРНПТ, ЛОЖЬ))
	|		И &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|		И &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров <= &Дата
	|		И ЕСТЬNULL(ТаблицаТовары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ))
	|	И НЕ (ТаблицаТовары.КоличествоПоРНПТ = 0
	|		И ТаблицаТовары.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))";
	
	ВыгружаемыеКолонки = "НомерСтроки, Номенклатура, КоличествоПоРНПТ, НомерГТД";
	
	Соглашение = ?(КомиссионерВедетУчетПоРНПТБезСоглашения,
					Неопределено,
					Объект.Соглашение);
	
	Запрос.УстановитьПараметр("ТаблицаТовары",	Объект.Товары.Выгрузить(, ВыгружаемыеКолонки));
	Запрос.УстановитьПараметр("Соглашение",		Соглашение);
	Запрос.УстановитьПараметр("Дата",			Объект.Дата);
	Запрос.УстановитьПараметр("КомиссионерВедетУчетПоРНПТБезСоглашения", КомиссионерВедетУчетПоРНПТБезСоглашения);
	
	УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Товары[Выборка.НомерСтроки - 1].КоличествоПоРНПТ	= 0;
		Объект.Товары[Выборка.НомерСтроки - 1].НомерГТД			= Неопределено;
	КонецЦикла;
	//-- Локализация
	
КонецПроцедуры

// Проверяет заполнение в таблице поля 'НомерГТД'.
//
// Параметры:
//	Объект - ДокументОбъект - объект, в табличной части которого выполняется проверка.
//	Отказ - Булево - Истина, признак того, что в табличной части объекта не заполнено проверяемое поле.
//	КомиссионерВедетУчетПоРНПТ - Булево - Истина, признак того, что комиссионер ведет учет по РНПТ.
//
Процедура ПроверитьЗаполнениеНомераГТДВДокументахКомиссионера(Объект, Отказ, КомиссионерВедетУчетПоРНПТ = Истина) Экспорт
	
	//++ Локализация
	Если Не КомиссионерВедетУчетПоРНПТ
		Или Не ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Объект.Дата)Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.НомерГТД КАК Справочник.НомераГТД) КАК НомерГТД
	|ПОМЕСТИТЬ ТаблицаТоварыДляЗапроса
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТаблицаТоварыДляЗапроса КАК ТаблицаТоваров
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|	ПО ТаблицаТоваров.Номенклатура = ТаблицаНоменклатуры.Ссылка
	|ГДЕ
	|	ТаблицаТоваров.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И ЕСТЬNULL(ТаблицаНоменклатуры.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ)
	|	И ТаблицаНоменклатуры.ТипНоменклатуры В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", Объект.Товары.Выгрузить(, "НомерСтроки, НомерГТД, Номенклатура"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ШаблонТекстаОшибки	= НСтр("ru='Не заполнена колонка ""Номер ГТД"" в строке %НомерСтроки% списка ""Товары"".'");
	КлючДанных			= ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения	= СтрЗаменить(ШаблонТекстаОшибки, "%НомерСтроки%", Выборка.НомерСтроки);
		Поле			= ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "НомерГТД");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, "Объект", Отказ);
	КонецЦикла;
	//-- Локализация
	
КонецПроцедуры

// Заполняет КоличествоПоРНПТ в переданной табличной части.
//
// Параметры:
//	ПараметрыПересчета - см. УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ПараметрыПолученияКоэффициентаРНПТ.
//	Товары - ДанныеФормыКоллекция - Таблица товаров документа со следующими обязательными полями:
//		* Номенклатура - СправочникСсылка.Номенклатура - товар.
//		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика товара.
//		* МестоХранения - СправочникСсылка.Склады, СправочникСсылка.Партнеры, СправочникСсылка.ДоговорыКонтрагентов - склад, поле требуется если склад указан в табличной части.
//		* Количество - Число - количество товара.
//		* КоличествоПоРНПТ - Число - прослеживаемое количество товара.
//
Процедура ЗаполнитьКоличествоПоРНПТВТабличнойЧасти(ПараметрыПересчета, Товары) Экспорт
	
	//++ Локализация
	Организация			= ПараметрыПересчета.Организация;
	Соглашение			= ПараметрыПересчета.Соглашение;
	ИсключаемыйДокумент	= ПараметрыПересчета.ИсключаемыйДокумент;
	
	ТоварыКЗапросуРНПТ = Товары.Выгрузить();
	
	Если ПараметрыПересчета.МестоХраненияВТабличнойЧасти
		И ПараметрыПересчета.ИмяПоляМестоХранения <> "МестоХранения" Тогда
		
		ТоварыКЗапросуРНПТ.Колонки[ПараметрыПересчета.ИмяПоляМестоХранения].Имя = "МестоХранения";
		
	ИначеЕсли Не ПараметрыПересчета.МестоХраненияВТабличнойЧасти Тогда
		ТоварыКЗапросуРНПТ.Колонки.Добавить("МестоХранения", Новый ОписаниеТипов("СправочникСсылка.Склады,
																				|СправочникСсылка.Партнеры,
																				|СправочникСсылка.ДоговорыКонтрагентов,
																				|СправочникСсылка.Организации"));
		
		ТоварыКЗапросуРНПТ.ЗаполнитьЗначения(ПараметрыПересчета.МестоХранения, "МестоХранения");
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		ТекущаяСтрока.КоличествоПоРНПТ = 0;
	КонецЦикла;
	
	Если ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(ПараметрыПересчета.Дата) Тогда
		
		Коэффициенты = ПолучитьКоэффициентыПрослеживаемыхТоваров(ИсключаемыйДокумент,
																Организация,
																ТоварыКЗапросуРНПТ,
																Соглашение);
		Коэффициенты.Колонки.МестоХранения.Имя = ПараметрыПересчета.ИмяПоляМестоХранения;
		
		ИменаКолонок = "Номенклатура, Характеристика, НомерГТД";
		Если ПараметрыПересчета.МестоХраненияВТабличнойЧасти Тогда
			ИменаКолонок = ИменаКолонок + ", " + ПараметрыПересчета.ИмяПоляМестоХранения;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура(ИменаКолонок);
		
		Для Каждого СтрокаКоэффициента Из Коэффициенты Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаКоэффициента);
			
			НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
				ТекущаяСтрока.КоличествоПоРНПТ = ТекущаяСтрока.Количество * СтрокаКоэффициента.Коэффициент;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Проверяет наличие прослеживаемого товара в табличной части, и то, что дата документа
// после начала прослеживаемости импортного товара.
//
// Параметры:
//	Товары - ДанныеФормыКоллекция - Таблица товаров документа со следующими обязательными полями:
//		* Номенклатура - СправочникСсылка.Номенклатура - товар.
//	ДатаДокумента - Дата - дата документа, для проверки использования его в прослеживаемости.
//	ИмяКолонкиНоменклатура - Строка - имя реквизита Номенклатура в табличной части.
//
// Возвращаемое значение:
//	Булево - Истина означает, что документ содержит прослеживаемые товары в табличной части и то, что дата документа
//				больше даты начала учета прослеживаемых импортных товаров.
//
Функция ЭтоПрослеживаемыйДокумент(Товары, ДатаДокумента, ИмяКолонкиНоменклатура = "Номенклатура") Экспорт
	
	Результат = Ложь;
	
	//++ Локализация
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(ДатаДокумента);
	
	Если ИспользоватьУчетПрослеживаемыхИмпортныхТоваров Тогда
		СводнаяИнформацияОТоварахРНПТ = СводнаяИнформацияОТоварахРНПТ(Товары, ИмяКолонкиНоменклатура);
		
		Результат = СводнаяИнформацияОТоварахРНПТ.ЕстьТоварРНПТ;
	КонецЕсли;
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

// Показывает сообщение пользователю, в случае если включен учет прослеживаемых импортных товаров,
// и при этом в таблице товаров имеется прослеживаемая номенклатура, с выключенным учетом по номерам ГТД.
//
// Параметры:
//	Объект - ДокументОбъект, Структура - объект, в табличной части которого выполняется проверка.
//	Товары - ДанныеФормыКоллекция - таблица товаров документа со следующими обязательными полями:
//		* Номенклатура - СправочникСсылка.Номенклатура - товар.
//	ДатаДокумента - Дата - дата документа, для проверки использования его в прослеживаемости.
//	ИмяТабличнойЧасти - Строка - имя табличной части для подсветки в ней ячейки с ошибкой.
//	ИмяНоменклатурыТабличнойЧасти - Строка - имя реквизита табличной части для подсветки ошибки в нем.
//
Процедура ПроверитьКорректностьНастроекТоваровРНПТ(Объект,
													Товары,
													ДатаДокумента,
													ИмяТабличнойЧасти = "Товары",
													ИмяНоменклатурыТабличнойЧасти = "Номенклатура") Экспорт
	
	//++ Локализация
	ИспользоватьУчетПрослеживаемыхИмпортныхТоваров = ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(ДатаДокумента);
	
	Если ИспользоватьУчетПрослеживаемыхИмпортныхТоваров Тогда
		
		ТоварыДляЗапроса = Товары.Выгрузить(, ИмяНоменклатурыТабличнойЧасти + ", НомерСтроки");
		ТоварыДляЗапроса.Колонки[ИмяНоменклатурыТабличнойЧасти].Имя = "Номенклатура";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки	КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура	КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаТоварыДляЗапроса
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаТоваров.НомерСтроки	КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура	КАК Номенклатура
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|		ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|		ЕСТЬNULL(ТаблицаНоменклатуры.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ) КАК ПрослеживаемыйТовар,
		|		ЕСТЬNULL(ТаблицаНоменклатуры.ВестиУчетПоГТД, ЛОЖЬ) КАК ВестиУчетПоГТД
		|	ИЗ
		|		ТаблицаТоварыДляЗапроса КАК ТаблицаТоваров
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
		|			ПО ТаблицаТоваров.Номенклатура = ТаблицаНоменклатуры.Ссылка
		|				И ТаблицаНоменклатуры.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|														ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|	
		|	) КАК ТаблицаТоваров
		|
		|ГДЕ
		|	ТаблицаТоваров.ПрослеживаемыйТовар
		|		И НЕ ТаблицаТоваров.ВестиУчетПоГТД
		|";
		
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТоварыДляЗапроса);
		
		ШаблонТекстаОшибки = НСтр("ru='Для номенклатуры ""%1"" задан прослеживаемый код ТН ВЭД, но выключен учет по номерам ГТД.
									|Для учета товара как прослеживаемого, требуется взвести флаг учета по номерам ГТД.'");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, Выборка.Номенклатура);
			
			ПутьКПолюНоменклатура = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти,
																					Выборка.НомерСтроки,
																					ИмяНоменклатурыТабличнойЧасти);
				
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект, ПутьКПолюНоменклатура);
		КонецЦикла;
		
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Устанавливает параметры запроса, необходимые для определения использования в системе учета прослеживаемых товаров.
//
// Параметры:
//	Запрос - Запрос - запрос, для которого осуществляется установка параметров.
//
Процедура УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос) Экспорт
	
	Если Запрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьУчет = Ложь;
	//++ Локализация
	ИспользоватьУчет = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров");
	//-- Локализация
	Если Не Запрос.Параметры.Свойство("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров") Тогда
		Запрос.УстановитьПараметр("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров", ИспользоватьУчет);
	КонецЕсли;
	
	Если Не Запрос.Параметры.Свойство("ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров") Тогда
		ДатаНачалаУчета = Дата(2399, 1, 1);
		//++ Локализация
		Если ИспользоватьУчет Тогда
			ДатаНачалаУчета = НачалоМесяца(Константы.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров.Получить());
		КонецЕсли;
		//-- Локализация
		Запрос.УстановитьПараметр("ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров", ДатаНачалаУчета);
	КонецЕсли;

	//++ Локализация
	Запрос.УстановитьПараметр("ИдентификаторУведомлениеОВвозеПрослеживаемыхТоваров", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.УведомлениеОВвозеПрослеживаемыхТоваров")); 
	//-- Локализация
	
КонецПроцедуры

// Возвращает коэффициенты по РНПТ для указанной Организации и списка товаров.
//
// Параметры:
//	ИсключаемыйДокумент - ДокументСсылка - документ, движения которого исключаются при расчета коэффициента по РНПТ.
//	Организация - СправочникСсылка.Организации - организация, для которой рассчитываются коэффициенты по РНПТ.
//	Товары - ТаблицаЗначений - таблица, содержащая сведения о товарах.
//	Соглашение - СправочникСсылка.СоглашенияСКлиентами - соглашение, для которого рассчитываются коэффициенты по РНПТ.
//	
// Возвращаемое значение:
//	ТаблицаЗначений - содержит следующие колонки:
//		* Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для которой необходимо получить значение
//															коэффициента по РНПТ.
//		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика номенклатуры, для которой
//																			необходимо получить значение коэффициента
//																			по РНПТ.
//		* МестоХранения - СправочникСсылка.Склады, СправочникСсылка.Партнеры, СправочникСсылка.ДоговорыКонтрагентов -
//											место хранения, где хранится номенклатура, для которой необходимо получить
//											значение коэффициента по РНПТ.
//		* Коэффициент - Число - значение коэффициента по РНПТ.
//
Функция ПолучитьКоэффициентыПрослеживаемыхТоваров(ИсключаемыйДокумент, Организация, Товары, Соглашение = Неопределено) Экспорт
	
	КлючеваяОперация	= "УчетПрослеживаемыхТоваровЛокализация.ПолучитьКоэффициентыПрослеживаемыхТоваров";
	ОписаниеЗамера		= ОценкаПроизводительности.НачатьЗамерДлительнойОперации(КлючеваяОперация);
	
	ВозвращаемоеЗначение = КоэффициентыПрослеживаемыхТоваров(ИсключаемыйДокумент, Организация, Соглашение, Товары);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ВозвращаемоеЗначение.Количество());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает идентификатор объекта метаданных для документа ТаможеннаяДекларацияИмпорт.
//
// Возвращаемое значение:
//	СправочникСсылка.ИдентификаторыОбъектовМетаданных - .
//
Функция ИдентификаторТаможеннаяДекларацияИмпорт() Экспорт
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ТаможеннаяДекларацияИмпорт");
КонецФункции

// Возвращает количество распоряжений к оформлению уведомлений.
// 
// Параметры:
//  ТипыУведомлений - Массив из Тип, Неопределено - перечень типов уведомлений, если Неопределено, то данные получаются по всем типам.
//  Организация - СправочникСсылка.Организации, Неопределено - Организация, по которой нужно получить данные, если передано Неопределено, то по всем организациям.
//
// Возвращаемое значение:
//  Соответствие - Количество распоряжений к оформлению по типу уведомления
//
Функция КоличествоРаспоряженийКОформлениюУведомлений(ТипыУведомлений = Неопределено, Организация = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	//++ Локализация
	Если ТипыУведомлений = Неопределено Тогда
		ТипыУведомлений = Новый Массив;
		ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров"));
		ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров"));
		ТипыУведомлений.Добавить(Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТипыКОбработке = Новый Массив;
	ТекстыЗапросов = Новый Массив;
	Для Каждого ТипУведомления Из ТипыУведомлений Цикл
		
		Если ТипУведомления = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
			ТекстЗапроса = "ВЫБРАТЬ
							|	КОЛИЧЕСТВО(*) КАК Количество
							|ИЗ
							|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
							|		ТоварыКОформлениюДокументовИмпортаОстатки.Организация КАК Организация,
							|		ТоварыКОформлениюДокументовИмпортаОстатки.АналитикаУчетаНоменклатуры.Номенклатура.КодТНВЭД КАК КодТНВЭД,
							|		ТоварыКОформлениюДокументовИмпортаОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
							|		ТоварыКОформлениюДокументовИмпортаОстатки.ТипДокументаИмпорта КАК ТипДокументаИмпорта,
							|		ТоварыКОформлениюДокументовИмпортаОстатки.ДокументПоступления КАК ДокументПоступления
							|	ИЗ
							|		РегистрНакопления.ТоварыКОформлениюДокументовИмпорта.Остатки(, ТипДокументаИмпорта В (&ТипыДокументаИмпорта)
							|		И (НЕ &ИспользоватьОтборПоОрганизации
							|		ИЛИ &ИспользоватьОтборПоОрганизации
							|		И Организация = &Организация)) КАК ТоварыКОформлениюДокументовИмпортаОстатки
							|	ГДЕ
							|		ТоварыКОформлениюДокументовИмпортаОстатки.КоличествоОстаток > 0) КАК Остатки";
			
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			ТипыКОбработке.Добавить(ТипУведомления);	
		ИначеЕсли ТипУведомления = Тип("ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров") Тогда
			ТекстЗапроса = "ВЫБРАТЬ
                          |	КОЛИЧЕСТВО(*) КАК Количество
                          |ИЗ
                          |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
                          |		ТоварыКОформлениюДокументовИмпортаОстатки.Организация КАК Организация,
                          |		ТоварыКОформлениюДокументовИмпортаОстатки.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
                          |		ТоварыКОформлениюДокументовИмпортаОстатки.СопроводительныйДокумент КАК СопроводительныйДокумент
                          |	ИЗ
                          |		РегистрНакопления.ПрослеживаемыеТоварыОтгруженныеВЕАЭС.Остатки(
                          |				,
                          |				НЕ &ИспользоватьОтборПоОрганизации
                          |					ИЛИ &ИспользоватьОтборПоОрганизации
                          |						И Организация = &Организация) КАК ТоварыКОформлениюДокументовИмпортаОстатки
                          |	ГДЕ
                          |		ТоварыКОформлениюДокументовИмпортаОстатки.КоличествоОстаток > 0) КАК Остатки";
			
			ТекстыЗапросов.Добавить(ТекстЗапроса);			
			ТипыКОбработке.Добавить(ТипУведомления);
		ИначеЕсли ТипУведомления = Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров") Тогда
			
			Запрос.УстановитьПараметр("КоличествоУведомленийОбОстатках",
				Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров.КоличествоУведомленийКОформлению(Организация));
			
			ТекстЗапроса = "ВЫБРАТЬ
							|&КоличествоУведомленийОбОстатках КАК Количество";
			
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			ТипыКОбработке.Добавить(ТипУведомления);
			
		КонецЕсли;
		
		Результат.Вставить(ТипУведомления, 0);		
		
	КонецЦикла;
	
	Если ТипыКОбработке.Количество() > 0 Тогда
		
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ";");
		
		ТипыДокументаИмпорта = Новый СписокЗначений;
		ТипыДокументаИмпорта.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.УведомлениеОВвозеПрослеживаемыхТоваров"));
		Запрос.УстановитьПараметр("ТипыДокументаИмпорта", ТипыДокументаИмпорта);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ИспользоватьОтборПоОрганизации", ЗначениеЗаполнено(Организация));

		УстановитьПривилегированныйРежим(Истина);
				
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		УстановитьПривилегированныйРежим(Ложь);
			
		Для Каждого ТипКОбработке Из ТипыКОбработке Цикл
			ИндексРезультатаЗапроса = ТипыКОбработке.Найти(ТипКОбработке);
			Если Не ИндексРезультатаЗапроса = Неопределено Тогда
				Результат[ТипКОбработке] = РезультатЗапроса[ИндексРезультатаЗапроса].Выгрузить()[0][0];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//-- Локализация
	
	Возврат Результат;
		
КонецФункции

// Возвращает количество возвратов к оформлению.
//  
// Возвращаемое значение:
//  Число - Количество возвратов к оформлению
//
Функция КоличествоВозвратовКОформлению() Экспорт
	
	КоличествоДокументов = 0;
	
	//++ Локализация
	
	Запрос = Новый Запрос;
	Запрос.Текст = Обработки.ПанельАдминистрированияУчетПрослеживаемыхТоваров.СформироватьТекстЗапросаТаблицаВозвратыТоваровОтКомиссионеров();
	
	Запрос.УстановитьПараметр("ДатаПрослеживаемости", ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров());
	
	РезультатЗапроса = Запрос.Выполнить();
	КоличествоДокументов = РезультатЗапроса.Выгрузить().Количество();
	
	//-- Локализация
	
	Возврат КоличествоДокументов;
	
КонецФункции

// Возвращает количество отчетов к оформлению.
//  
// Возвращаемое значение:
//  Число - Количество отчетов к оформлению
//
Функция КоличествоОтчетовКОформлению() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыПереданные.Организация КАК Организация,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.МестоХранения КАК Комиссионер,
		|	ТоварыПереданные.Соглашение КАК Соглашение,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ТоварыПереданныеОстатки.КоличествоОстаток, 0) > 0
		|					И ТоварыПереданные.КоличествоОстаток > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ТоварыПереданныеОстатки.КоличествоОстаток, 0) < ТоварыПереданные.КоличествоОстаток
		|							ТОГДА ЕСТЬNULL(ТоварыПереданныеОстатки.КоличествоОстаток, 0)
		|						ИНАЧЕ ТоварыПереданные.КоличествоОстаток
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ТоварыПереданныеОстатки.КоличествоОстаток, 0) < 0
		|					И ТоварыПереданные.КоличествоОстаток < 0
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(-ТоварыПереданныеОстатки.КоличествоОстаток, 0) < -ТоварыПереданные.КоличествоОстаток
		|							ТОГДА ЕСТЬNULL(-ТоварыПереданныеОстатки.КоличествоОстаток, 0)
		|						ИНАЧЕ -ТоварыПереданные.КоличествоОстаток
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоВозврат
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(
		|			&Граница,
		|			АналитикаУчетаНоменклатуры.МестоХранения <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|				И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)) КАК ТоварыПереданные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(
		|				,
		|				АналитикаУчетаНоменклатуры.МестоХранения <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|					И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)) КАК ТоварыПереданныеОстатки
		|		ПО ТоварыПереданные.Организация = ТоварыПереданныеОстатки.Организация
		|			И ТоварыПереданные.АналитикаУчетаНоменклатуры = ТоварыПереданныеОстатки.АналитикаУчетаНоменклатуры
		|			И ТоварыПереданные.Соглашение = ТоварыПереданныеОстатки.Соглашение
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыПереданные.Организация,
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры.МестоХранения,
		|	ТоварыПереданные.Соглашение";
	
	Граница = Новый Граница(КонецДня(ТекущаяДатаСеанса()), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Граница", Граница);
	
	КоличествоОтчетов = Запрос.Выполнить().Выгрузить().Количество();
	
	Возврат КоличествоОтчетов;
	
КонецФункции

// Заполняет 'РНПТ' в таблице ИмяТЧ.
//
// Параметры:
//	Объект - ДокументОбъект - объект, в табличной части которого заполняются РНПТ
//	ВидыЗапасов - ТаблицаЗначений - содержит следующие колонки:
//		* СтранаПроисхождения - СправочникСсылка.СтраныМира - страна, в разрезе которой 
//											должны быть заполнены РНПТ в ИмяТЧ .
//		* РНПТ - СправочникСсылка.НомераГТД - номера РНПТ для создания/подбора
//	ИмяТЧ - строка - имя ТЧ (Товары/ВидыЗапасов), в которой заполняем реквизит
//	ИмяРеквизита - строка - имя реквизита РНПТ (НомерГТД/РНПТ) для заполнения
//
Процедура ЗаполнитьНомера(Объект, ВидыЗапасов, ИмяТЧ = "Товары", ИмяРеквизита = "НомерГТД") Экспорт
	//++ Локализация
	// Создаем новые номера
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВидыЗапасов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВидыЗапасов.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаВидыЗапасов.НомерГТД КАК РНПТ
	|
	|ПОМЕСТИТЬ ВидыЗапасов
	|ИЗ
	|	&ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|";
	
	Запрос.УстановитьПараметр("ТаблицаВидыЗапасов", ВидыЗапасов);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&РегистрационныйНомер		КАК Код,
	|	&РегистрационныйНомер		КАК РегистрационныйНомер,
	|	ВидыЗапасов.СтранаПроисхождения	КАК СтранаПроисхождения,
	|	ИСТИНА						КАК РНПТ
	|	
	|ИЗ
	|	ВидыЗапасов КАК ВидыЗапасов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НомераГТД КАК УказанныеРНПТ
	|	ПО
	|		УказанныеРНПТ.Ссылка = ВидыЗапасов.РНПТ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НомераГТД КАК ПодобранныеРНПТ
	|	ПО
	|		ПодобранныеРНПТ.СтранаПроисхождения = ВидыЗапасов.СтранаПроисхождения
	|		И ПодобранныеРНПТ.РегистрационныйНомер = &РегистрационныйНомер
	|		И НЕ ПодобранныеРНПТ.ПометкаУдаления
	|		И ПодобранныеРНПТ.РНПТ
	|ГДЕ
	|	УказанныеРНПТ.Ссылка ЕСТЬ NULL
	|	И ПодобранныеРНПТ.Ссылка ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("РегистрационныйНомер", Объект.РНПТ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НомерГТД = Справочники.НомераГТД.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НомерГТД, Выборка);
		НомерГТД.Записать();
	КонецЦикла;
	
	// Подбираем номера РНПТ в виды запасов.
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыЗапасов.НомерСтроки,
	|	ВидыЗапасов.СтранаПроисхождения,
	|
	|	ПодобранныеРНПТ.Ссылка КАК РНПТ
	|ИЗ
	|	ВидыЗапасов КАК ВидыЗапасов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НомераГТД КАК УказанныеРНПТ
	|	ПО
	|		УказанныеРНПТ.Ссылка = ВидыЗапасов.РНПТ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.НомераГТД КАК ПодобранныеРНПТ
	|	ПО
	|		ПодобранныеРНПТ.СтранаПроисхождения = ВидыЗапасов.СтранаПроисхождения
	|		И НЕ ПодобранныеРНПТ.ПометкаУдаления
	|		И ПодобранныеРНПТ.РегистрационныйНомер = &РегистрационныйНомер
	|		И ПодобранныеРНПТ.РНПТ
	|ГДЕ
	|	УказанныеРНПТ.Ссылка ЕСТЬ NULL
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЗапасов.НомерСтроки
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// слияние упорядоченных массивов, |Выборки| <= |ВидыЗапасов|
		Для Каждого Стр Из Объект[ИмяТЧ] Цикл
			Если ЗначениеЗаполнено(Стр[ИмяРеквизита]) Или Стр.НомерСтроки < Выборка.НомерСтроки Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Выборка.РНПТ) Тогда
				ВызватьИсключение НСтр("ru='Обнаружены проблемы в подборе номеров РНПТ.'");
			КонецЕсли;
			
			Стр[ИмяРеквизита] = Выборка.РНПТ;

			Если Не Выборка.Следующий() Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

// Возвращает коллекцию свойств, описывающих уведомления о ввозе товаров, зарегистрированных на основании документа поступления
//
// Параметры:
// 	ПараметрыРегистрации - см. Документы.ПриобретениеТоваровУслуг.ПараметрыРегистрацииУведомленийОВвозеПрослеживаемыхТоваров
// 
// Возвращаемое значение:
// 	Структура - Структура с ключами
//		* ПредставлениеРаспоряженияКОформлению - Строка, ФорматированнаяСтрока - описание распоряжений к оформлению на основании документа поступления.
//		* ПредставлениеУведомленияОВвозе - Строка, ФорматированнаяСтрока - описание документов, зарегистрированных на основании документа поступления.
//		* УведомленияОВвозе - Массив - ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров - ссылки на уведомление о ввозе товаров.
//		* УведомлениеОВвозеТребуется - Булево - признак необходимости ввода хотя бы одного документа УведомлениеОВвозеПрослеживаемыхТоваров по основанию
//		* ЕстьПравоИнтерактивногоДобавленияУведомленияОВвозе - Булево - признак наличия права для интерактивного добавления документа по основанию.
Функция УведомленияОВвозеПрослеживаемыхТоваровПоДокументуПоступления(ПараметрыРегистрации) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПредставлениеРаспоряженияКОформлению", "");
	Результат.Вставить("ПредставлениеУведомленияОВвозе", "");	
	Результат.Вставить("УведомленияОВвозе",  Новый Массив);
	Результат.Вставить("УведомлениеОВвозеТребуется",  Ложь);
	Результат.Вставить("КоличествоРаспоряженийКОформлению",  0);
	Результат.Вставить("ЕстьПравоИнтерактивногоДобавленияУведомленияОВвозе", Ложь);
	
	//++ Локализация
	
	Если ПараметрыРегистрации.ВвозТоваровИзТаможенногоСоюза
		И ПараметрыРегистрации.ВедетсяУчетПоРНПТ Тогда
	
		ТекстРаспоряженияКОформлению = "";
		НавигационнаяСсылкаРаспоряженияКОформлению = "";
		
		ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.УведомлениеОВвозеПрослеживаемыхТоваров);
		
		ТаблицаРаспоряженийКОформлению = Документы.УведомлениеОВвозеПрослеживаемыхТоваров.РаспоряженияКОформлениюУведомленийОВвозеПоОснованию(ПараметрыРегистрации.Ссылка);	
		КоличествоРаспоряженийКОформлению = ТаблицаРаспоряженийКОформлению.Количество();
		ДокументПоОснованиюТребуется = (КоличествоРаспоряженийКОформлению>0);
	
		Если КоличествоРаспоряженийКОформлению = 1 Тогда
			Если ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию Тогда
				ТекстРаспоряженияКОформлению = НСтр("ru = 'Оформить уведомление по ПТ'");
				НавигационнаяСсылкаРаспоряженияКОформлению = "ВвестиНовыйУведомлениеОВвозеПрослеживаемыхТоваров";
			Иначе
				ТекстРаспоряженияКОформлению = НСтр("ru = 'Уведомление о ввозе ПТ не оформлено'"); 
			КонецЕсли;
		ИначеЕсли КоличествоРаспоряженийКОформлению > 1 Тогда
			Если ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию Тогда
				ТекстРаспоряженияКОформлению = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Оформить уведомления по ПТ (%1)'"), 
											Строка(КоличествоРаспоряженийКОформлению));
				НавигационнаяСсылкаРаспоряженияКОформлению = "ОткрытьФормированиеУведомленийОВвозеПеремещении";				
			Иначе
				ТекстРаспоряженияКОформлению = НСтр("ru = 'Уведомления о ввозе ПТ не оформлены'"); 
			КонецЕсли;				
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НавигационнаяСсылкаРаспоряженияКОформлению) Тогда
			ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
		Иначе
			ЦветТекста = Неопределено;
		КонецЕсли;

		ПредставлениеРаспоряженияКОформлению = Новый ФорматированнаяСтрока(ТекстРаспоряженияКОформлению, , ЦветТекста, , НавигационнаяСсылкаРаспоряженияКОформлению);
		
		ТекстУведомленияОВвозе = "";
		НавигационнаяСсылкаУведомленияОВвозе = "";
		
		ТаблицаУведомленийОВвозе = Документы.УведомлениеОВвозеПрослеживаемыхТоваров.УведомленияОВвозеПрослеживаемыхТоваровПоОснованию(ПараметрыРегистрации.Ссылка, Истина);
		
		Если ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию Тогда		
			Если ТаблицаУведомленийОВвозе.Количество() = 1 Тогда
				УведомлениеОВвозе = ТаблицаУведомленийОВвозе[0];
				ТекстУведомленияОВвозе = Документы.УведомлениеОВвозеПрослеживаемыхТоваров.ПредставлениеУведомленияОВвозеПрослеживаемыхТоваров(
				                         УведомлениеОВвозе.Номер,
				                         УведомлениеОВвозе.Дата,
				                         УведомлениеОВвозе.Проведен);
				НавигационнаяСсылкаУведомленияОВвозе = "ОткрытьУведомлениеОВвозеПрослеживаемыхТоваров";
			ИначеЕсли ТаблицаУведомленийОВвозе.Количество() > 1 Тогда
				ТекстУведомленияОВвозе = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				                      НСтр("ru = 'Уведомления по ПТ (%1)'"),
				                      Строка(ТаблицаУведомленийОВвозе.Количество()));
				НавигационнаяСсылкаУведомленияОВвозе = "ОткрытьСписокУведомленийОВвозеПрослеживаемыхТоваров";
				
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НавигационнаяСсылкаУведомленияОВвозе) Тогда
			ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
		Иначе
			ЦветТекста = Неопределено;
		КонецЕсли;

		ПредставлениеУведомленияОВвозе = Новый ФорматированнаяСтрока(ТекстУведомленияОВвозе, , ЦветТекста, , НавигационнаяСсылкаУведомленияОВвозе);
			
		Результат = Новый Структура;
		Результат.Вставить("ПредставлениеРаспоряженияКОформлению", ПредставлениеРаспоряженияКОформлению);
		Результат.Вставить("ПредставлениеУведомленияОВвозе", ПредставлениеУведомленияОВвозе);	
		Результат.Вставить("УведомленияОВвозе",  ТаблицаУведомленийОВвозе.ВыгрузитьКолонку("Ссылка"));
		Результат.Вставить("УведомлениеОВвозеТребуется",  ДокументПоОснованиюТребуется);
		Результат.Вставить("КоличествоРаспоряженийКОформлению",  КоличествоРаспоряженийКОформлению);
		Результат.Вставить("ЕстьПравоИнтерактивногоДобавленияУведомленияОВвозе", ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию);
		
	КонецЕсли;
	
	//-- Локализация
	
	Возврат Результат;

КонецФункции

// Возвращает коллекцию свойств, описывающих уведомления о перемещении товаров, зарегистрированных на основании документа реализации
//
// Параметры:
// 	ПараметрыРегистрации - см. Документы.РеализацияТоваровУслуг.ПараметрыРегистрацииУведомленийОПеремещенииПрослеживаемыхТоваров
// 
// Возвращаемое значение:
// 	Структура - Структура с ключами
//		* ПредставлениеРаспоряженияКОформлению - Строка, ФорматированнаяСтрока - описание распоряжений к оформлению на основании документа реализации.
//		* ПредставлениеУведомленияОПеремещении - Строка, ФорматированнаяСтрока - описание документов, зарегистрированных на основании документа реализации.
//		* УведомленияОПеремещении - Массив - ДокументСсылка.УведомлениеОПеремещенииПрослеживаемыхТоваров - ссылки на уведомление о перемещении товаров.
//		* УведомлениеОПеремещенииТребуется - Булево - признак необходимости ввода хотя бы одного документа УведомлениеОПеремещенииПрослеживаемыхТоваров по основанию
//		* ЕстьПравоИнтерактивногоДобавленияУведомленияОПеремещении - Булево - признак наличия права для интерактивного добавления документа по основанию.
Функция УведомленияОПеремещенииПрослеживаемыхТоваровПоДокументуРеализации(ПараметрыРегистрации) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПредставлениеРаспоряженияКОформлению", "");
	Результат.Вставить("ПредставлениеУведомленияОПеремещении", "");	
	Результат.Вставить("УведомленияОПеремещении",  Новый Массив);
	Результат.Вставить("УведомлениеОПеремещенииТребуется",  Ложь);
	Результат.Вставить("КоличествоРаспоряженийКОФормлению",  0);
	Результат.Вставить("ЕстьПравоИнтерактивногоДобавленияУведомленияОПеремещении", Ложь);
	
	//++ Локализация
	
	Если ПараметрыРегистрации.ПродажаВСтраныТаможенногоСоюза
		И ПараметрыРегистрации.ВедетсяУчетПоРНПТ Тогда
	
		ТекстРаспоряженияКОфомлению = "";
		НавигационнаяСсылкаРаспоряженияКОфомлению = "";
		
		ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);
		
		ТаблицаРаспоряженийКОформлению = Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров.РаспоряженияКОформлениюУведомленийОПеремещенииПоОснованию(ПараметрыРегистрации.Ссылка);	
		КоличествоРаспоряженийКОформлению = ТаблицаРаспоряженийКОформлению.Количество();
		ДокументПоОснованиюТребуется = (КоличествоРаспоряженийКОформлению>0);

		ТаблицаУведомленийОПеремещении = Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров.УведомленияОПеремещенииПрослеживаемыхТоваровПоОснованию(ПараметрыРегистрации.Ссылка, Истина);
			
		Если КоличествоРаспоряженийКОформлению > 0 И ТаблицаУведомленийОПеремещении.Количество() = 0 Тогда
			Если ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию Тогда
				ТекстРаспоряженияКОфомлению = НСтр("ru = 'Оформить уведомление по ПТ'");
				НавигационнаяСсылкаРаспоряженияКОфомлению = "ВвестиНовыйУведомлениеОПеремещенииПрослеживаемыхТоваров";
			Иначе
				ТекстРаспоряженияКОфомлению = НСтр("ru = 'Уведомление о перемещении ПТ не оформлено'"); 
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НавигационнаяСсылкаРаспоряженияКОфомлению) Тогда
			ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
		Иначе
			ЦветТекста = Неопределено;
		КонецЕсли;

		ПредставлениеРаспоряженияКОформлению = Новый ФорматированнаяСтрока(ТекстРаспоряженияКОфомлению, , ЦветТекста, , НавигационнаяСсылкаРаспоряженияКОфомлению);
		
		ТекстУведомленияОПеремещении = "";
		НавигационнаяСсылкаУведомленияОПеремещении = "";
		
		Если ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию
			И ТаблицаУведомленийОПеремещении.Количество() Тогда
			УведомлениеОПеремещении = ТаблицаУведомленийОПеремещении[0];
			ТекстУведомленияОПеремещении = Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров.ПредставлениеУведомленияОПеремещенииПрослеживаемыхТоваров(
			                         УведомлениеОПеремещении.Номер,
			                         УведомлениеОПеремещении.Дата,
			                         УведомлениеОПеремещении.Проведен,
			                         ДокументПоОснованиюТребуется);
			НавигационнаяСсылкаУведомленияОПеремещении = "ОткрытьУведомлениеОПеремещенииПрослеживаемыхТоваров";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НавигационнаяСсылкаУведомленияОПеремещении) Тогда
			Если ДокументПоОснованиюТребуется Тогда
				ЦветТекста = ЦветаСтиля.ПросроченныеДанныеЦвет;
			Иначе	
				ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
			КонецЕсли;
		Иначе
			ЦветТекста = Неопределено;
		КонецЕсли;

		ПредставлениеУведомленияОПеремещении = Новый ФорматированнаяСтрока(ТекстУведомленияОПеремещении, , ЦветТекста, , НавигационнаяСсылкаУведомленияОПеремещении);
			
		Результат = Новый Структура;
		Результат.Вставить("ПредставлениеРаспоряженияКОформлению", ПредставлениеРаспоряженияКОформлению);
		Результат.Вставить("ПредставлениеУведомленияОПеремещении", ПредставлениеУведомленияОПеремещении);	
		Результат.Вставить("УведомленияОПеремещении",  ТаблицаУведомленийОПеремещении.ВыгрузитьКолонку("Ссылка"));
		Результат.Вставить("УведомлениеОПеремещенииТребуется",  ДокументПоОснованиюТребуется);
		Результат.Вставить("КоличествоРаспоряженийКОФормлению",  КоличествоРаспоряженийКОформлению);
		Результат.Вставить("ЕстьПравоИнтерактивногоДобавленияУведомленияОПеремещении", ЕстьПравоИнтерактивногоДобавленияДокументаПоОснованию);
		
	КонецЕсли;
	
	//-- Локализация
	
	Возврат Результат;

КонецФункции

// Возвращает количество передач к оформлению.
//  
// Параметры:
//	Склад - СправочникСсылка.Склады - Склад прослеживаемости.
//
// Возвращаемое значение:
//  Число - Количество передач к оформлению
//
Функция КоличествоПередачКОформлению(Склад) Экспорт
	
	КоличествоДокументов = 0;
	
	//++ Локализация
	
	Запрос = Новый Запрос;
	Запрос.Текст = Обработки.ПанельАдминистрированияУчетПрослеживаемыхТоваров.СформироватьТекстЗапросаТаблицаКОформлениюПередач();
	
	ТекстУсловиеКОформлению = "
	|ГДЕ
	|ЕСТЬNULL(ВТПередачи.КолВоПередач, 0) = 0";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "// УсловиеКОформлению", ТекстУсловиеКОформлению);
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ХОПередачаНаКомиссию", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	
	РезультатЗапроса = Запрос.Выполнить();
	КоличествоДокументов = РезультатЗапроса.Выгрузить().Количество();
	
	Возврат КоличествоДокументов;
	
	//-- Локализация
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыЗаписиДвиженийВРегистр

//++ Локализация
Процедура ОтразитьПрослеживаемыеТоварыОтгруженныеВЕАЭС(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПрослеживаемыеТоварыОтгруженныеВЕАЭС;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ПрослеживаемыеТоварыОтгруженныеВЕАЭС.Записывать = Истина;
	Движения.ПрослеживаемыеТоварыОтгруженныеВЕАЭС.Загрузить(Таблица);
	
КонецПроцедуры
//-- Локализация

#КонецОбласти

#КонецОбласти

#Область СлужебныйИнтерфейс

//++ Локализация
Функция ПараметрыСводнаяИнформацияОТоварахРНПТ()
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьТоварРНПТ", Ложь);
	Результат.Вставить("ЕстьТоварНеРНПТ", Ложь);
	Результат.Вставить("ЕстьТоварРНПТСОтличающейсяЕдиницей", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СводнаяИнформацияОТоварахРНПТ(Товары, ИмяКолонкиНоменклатура = "Номенклатура")
	
	ПараметрыСводнаяИнформацияОТоварахРНПТ = ПараметрыСводнаяИнформацияОТоварахРНПТ();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ (&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&ВходящаяТаблица КАК ВходящаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(Товары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ)
	|		И ЕСТЬNULL(Товары.Номенклатура.ВестиУчетПоГТД, ЛОЖЬ) КАК ПрослеживаемыйТовар,
	|	(Товары.Номенклатура.ЕдиницаИзмерения <> Товары.Номенклатура.ЕдиницаИзмеренияТНВЭД) КАК ЕстьРазницаЕдиниц
	|ПОМЕСТИТЬ ВТНаличиеПрослеживемыхТоваров
	|ИЗ
	|	ВТТовары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Товары.ЕстьПрослеживаемыеТовары) КАК ЕстьТоварРНПТ,
	|	МАКСИМУМ(Товары.ЕстьНеПрослеживаемыеТовары) КАК ЕстьТоварНеРНПТ,
	|	МАКСИМУМ(Товары.ЕстьРазницаЕдиниц) КАК ЕстьТоварРНПТСОтличающейсяЕдиницей
	|ПОМЕСТИТЬ ВТСводнаяИнформация
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИСТИНА КАК ЕстьПрослеживаемыеТовары,
	|		ЛОЖЬ КАК ЕстьНеПрослеживаемыеТовары,
	|		Товары.ЕстьРазницаЕдиниц КАК ЕстьРазницаЕдиниц
	|	ИЗ
	|		ВТНаличиеПрослеживемыхТоваров КАК Товары
	|	ГДЕ
	|		Товары.ПрослеживаемыйТовар
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ КАК ЕстьПрослеживаемыеТовары,
	|		ИСТИНА КАК ЕстьНеПрослеживаемыеТовары,
	|		Товары.ЕстьРазницаЕдиниц КАК ЕстьРазницаЕдиниц
	|	ИЗ
	|		ВТНаличиеПрослеживемыхТоваров КАК Товары
	|	ГДЕ
	|		НЕ Товары.ПрослеживаемыйТовар
	|	
	|	) КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Товары.ЕстьТоварРНПТ, ЛОЖЬ) КАК ЕстьТоварРНПТ,
	|	ЕСТЬNULL(Товары.ЕстьТоварНеРНПТ, ЛОЖЬ) КАК ЕстьТоварНеРНПТ,
	|	ЕСТЬNULL(Товары.ЕстьТоварРНПТСОтличающейсяЕдиницей, ЛОЖЬ) КАК ЕстьТоварРНПТСОтличающейсяЕдиницей
	|ИЗ
	|	ВТСводнаяИнформация КАК Товары";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Номенклатура", "ВходящаяТаблица." + ИмяКолонкиНоменклатура);
	Запрос.УстановитьПараметр("ВходящаяТаблица", Товары);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСводнаяИнформацияОТоварахРНПТ, Выборка);
	КонецЕсли;
	
	Возврат ПараметрыСводнаяИнформацияОТоварахРНПТ;
	
КонецФункции

Функция КоэффициентыПрослеживаемыхТоваров(ИсключаемыйДокумент, Организация, Соглашение, Товары)
	
	ВозвращаемоеЗначение = Новый ТаблицаЗначений;
	ВозвращаемоеЗначение.Колонки.Добавить("Номенклатура",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВозвращаемоеЗначение.Колонки.Добавить("Характеристика",	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВозвращаемоеЗначение.Колонки.Добавить("МестоХранения",	Новый ОписаниеТипов("СправочникСсылка.Склады,
																				|СправочникСсылка.Партнеры,
																				|СправочникСсылка.ДоговорыКонтрагентов,
																				|СправочникСсылка.Организации"));
	ВозвращаемоеЗначение.Колонки.Добавить("Коэффициент",	Новый ОписаниеТипов("Число"));
	
	//++ Локализация
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(Товары.НомерГТД КАК Справочник.НомераГТД) КАК НомерГТД,
	|	Товары.МестоХранения КАК МестоХранения
	|ПОМЕСТИТЬ ВТВходящаяТаблица
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура		КАК Номенклатура,
	|	Товары.Характеристика	КАК Характеристика,
	|	Товары.МестоХранения	КАК МестоХранения,
	|	Товары.НомерГТД			КАК НомерГТД
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	ВТВходящаяТаблица КАК Товары
	|
	|ГДЕ
	|	ЕСТЬNULL(Товары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар, ЛОЖЬ)
	|	И Товары.Номенклатура.ВестиУчетПоГТД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	МестоХранения,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаНоменклатуры.КлючАналитики КАК Аналитика,
	|	ВТТовары.НомерГТД
	|ПОМЕСТИТЬ ВТАналитикиУчетаНоменклатуры
	|ИЗ
	|	РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТовары
	|		ПО АналитикаУчетаНоменклатуры.Номенклатура = ВТТовары.Номенклатура
	|			И АналитикаУчетаНоменклатуры.Характеристика = ВТТовары.Характеристика
	|			И АналитикаУчетаНоменклатуры.МестоХранения = ВТТовары.МестоХранения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборДанных.Номенклатура КАК Номенклатура,
	|	НаборДанных.Характеристика КАК Характеристика,
	|	НаборДанных.МестоХранения КАК МестоХранения,
	|	НаборДанных.НомерГТД КАК НомерГТД,
	|	НаборДанных.КоличествоРНПТ / НаборДанных.Количество КАК Коэффициент
	|ПОМЕСТИТЬ ВТКоэффициентыТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
	|		ТоварыОстатки.НомерГТД КАК НомерГТД,
	|		ТоварыОстатки.КоличествоОстаток КАК Количество,
	|		ТоварыОстатки.КоличествоПоРНПТОстаток КАК КоличествоРНПТ
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			,
	|			Организация = &Организация
	|			И (АналитикаУчетаНоменклатуры, НомерГТД) В
	|					(ВЫБРАТЬ
	|						ДанныеАналитики.Аналитика,
	|						ДанныеАналитики.НомерГТД
	|					ИЗ
	|						ВТАналитикиУчетаНоменклатуры КАК ДанныеАналитики)
	|		
	|		) КАК ТоварыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
	|		ТоварыСторно.НомерГТД КАК НомерГТД,
	|		-ТоварыСторно.Количество КАК Количество,
	|		-ТоварыСторно.КоличествоПоРНПТ КАК КоличествоРНПТ
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций КАК ТоварыСторно
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиУчетаНоменклатуры КАК ДанныеАналитики
	|			ПО ТоварыСторно.АналитикаУчетаНоменклатуры = ДанныеАналитики.Аналитика
	|				И ТоварыСторно.НомерГТД = ДанныеАналитики.НомерГТД
	|	
	|	ГДЕ
	|		ТоварыСторно.Регистратор = &ИсключаемыйДокумент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
	|		ТоварыОстатки.НомерГТД КАК НомерГТД,
	|		ТоварыОстатки.КоличествоОстаток КАК Количество,
	|		ТоварыОстатки.КоличествоПоРНПТОстаток КАК КоличествоРНПТ
	|	ИЗ
	|		РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(
	|			,
	|			Организация = &Организация
	|			И Соглашение = &Соглашение
	|			И (АналитикаУчетаНоменклатуры, НомерГТД) В
	|					(ВЫБРАТЬ
	|						ДанныеАналитики.Аналитика,
	|						ДанныеАналитики.НомерГТД
	|					ИЗ
	|						ВТАналитикиУчетаНоменклатуры КАК ДанныеАналитики)
	|		
	|		) КАК ТоварыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
	|		ТоварыСторно.НомерГТД КАК НомерГТД,
	|		-ТоварыСторно.Количество КАК Количество,
	|		-ТоварыСторно.КоличествоПоРНПТ КАК КоличествоРНПТ
	|	ИЗ
	|		РегистрНакопления.ТоварыПереданныеНаКомиссию КАК ТоварыСторно
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиУчетаНоменклатуры КАК ДанныеАналитики
	|			ПО ТоварыСторно.АналитикаУчетаНоменклатуры = ДанныеАналитики.Аналитика
	|			И ТоварыСторно.НомерГТД = ДанныеАналитики.НомерГТД
	|	
	|	ГДЕ
	|		ТоварыСторно.Регистратор = &ИсключаемыйДокумент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ТоварыОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
	|		ТоварыОстатки.НомерГТД КАК НомерГТД,
	|		ВЫБОР
	|			КОГДА &ЭтоОтчетОСписании
	|				ТОГДА ТоварыОстатки.КоличествоСписаноОстаток
	|			ИНАЧЕ ТоварыОстатки.КоличествоОстаток
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА &ЭтоОтчетОСписании
	|				ТОГДА ТоварыОстатки.КоличествоСписаноКОформлениюПоРНПТОстаток
	|			ИНАЧЕ ТоварыОстатки.КоличествоКОформлениюПоРНПТОстаток
	|		КОНЕЦ КАК КоличествоРНПТ
	|	ИЗ
	|		РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Остатки(
	|			,
	|			(АналитикаУчетаНоменклатуры, НомерГТД) В
	|					(ВЫБРАТЬ
	|						ДанныеАналитики.Аналитика,
	|						ДанныеАналитики.НомерГТД
	|					ИЗ
	|						ВТАналитикиУчетаНоменклатуры КАК ДанныеАналитики)
	|		
	|		) КАК ТоварыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.Номенклатура,
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.Характеристика,
	|		ТоварыСторно.АналитикаУчетаНоменклатуры.МестоХранения,
	|		ТоварыСторно.НомерГТД КАК НомерГТД,
	|		ВЫБОР
	|			КОГДА &ЭтоОтчетОСписании
	|				ТОГДА -ТоварыСторно.КоличествоСписано
	|			ИНАЧЕ -ТоварыСторно.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА &ЭтоОтчетОСписании
	|				ТОГДА -ТоварыСторно.КоличествоСписаноКОформлениюПоРНПТ
	|			ИНАЧЕ -ТоварыСторно.КоличествоКОформлениюПоРНПТ
	|		КОНЕЦ КАК КоличествоРНПТ
	|	ИЗ
	|		РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту КАК ТоварыСторно
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиУчетаНоменклатуры КАК ДанныеАналитики
	|			ПО ТоварыСторно.АналитикаУчетаНоменклатуры = ДанныеАналитики.Аналитика
	|				И ТоварыСторно.НомерГТД = ДанныеАналитики.НомерГТД
	|	
	|	ГДЕ
	|		ТоварыСторно.Регистратор = &ИсключаемыйДокумент
	|	
	|	) КАК НаборДанных
	|
	|ГДЕ
	|	НаборДанных.КоличествоРНПТ <> 0
	|	И НаборДанных.Количество <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	МестоХранения,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура		КАК Номенклатура,
	|	Товары.Характеристика	КАК Характеристика,
	|	Товары.МестоХранения	КАК МестоХранения,
	|	Товары.НомерГТД			КАК НомерГТД,
	|	1						КАК Коэффициент
	|ПОМЕСТИТЬ ВТКоэффициентыДляТоваровБезОстатка
	|ИЗ
	|	ВТТовары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыТоваров КАК КоэффициентыТоваров
	|		ПО Товары.Номенклатура = КоэффициентыТоваров.Номенклатура
	|			И Товары.Характеристика = КоэффициентыТоваров.Характеристика
	|			И Товары.МестоХранения = КоэффициентыТоваров.МестоХранения
	|			И Товары.НомерГТД = КоэффициентыТоваров.НомерГТД
	|
	|ГДЕ
	|	КоэффициентыТоваров.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТоваров.Номенклатура		КАК Номенклатура,
	|	ДанныеТоваров.Характеристика	КАК Характеристика,
	|	ДанныеТоваров.МестоХранения		КАК МестоХранения,
	|	ДанныеТоваров.НомерГТД			КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ДанныеТоваров.Коэффициент > 0
	|			ТОГДА ДанныеТоваров.Коэффициент
	|		ИНАЧЕ -ДанныеТоваров.Коэффициент
	|	КОНЕЦ								КАК Коэффициент
	|ИЗ
	|	ВТКоэффициентыТоваров КАК ДанныеТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеТоваров.Номенклатура		КАК Номенклатура,
	|	ДанныеТоваров.Характеристика	КАК Характеристика,
	|	ДанныеТоваров.МестоХранения		КАК МестоХранения,
	|	ДанныеТоваров.НомерГТД			КАК НомерГТД,
	|	ДанныеТоваров.Коэффициент		КАК Коэффициент
	|ИЗ
	|	ВТКоэффициентыДляТоваровБезОстатка КАК ДанныеТоваров";
	
	Запрос.УстановитьПараметр("ИсключаемыйДокумент",	ИсключаемыйДокумент);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Товары",					Товары);
	Запрос.УстановитьПараметр("Соглашение",				Соглашение);
	Запрос.УстановитьПараметр("ЭтоОтчетОСписании",
								ТипЗнч(ИсключаемыйДокумент) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациямиОСписании"));
	
	УстановитьПривилегированныйРежим(Истина);
	ВозвращаемоеЗначение = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	//-- Локализация
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область ВариантыКомплектации

Функция ТекстЗапросаВТДанныеКомплекта()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.Ссылка			КАК Номенклатура,
	|	Товары.ТипНоменклатуры	КАК ТипНоменклатуры,
	|	Товары.КодТНВЭД			КАК КодТНВЭД,
	|	ЕСТЬNULL(Классификатор.ПрослеживаемыйТовар, ЛОЖЬ) КАК ПрослеживаемыйТовар,
	|	ВЫРАЗИТЬ(&ХарактеристикаКомплект КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	НЕ Товары.ВестиУчетПоГТД
	|		И Товары.ТипНоменклатуры В
	|				(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|		И ЕСТЬNULL(Классификатор.ПрослеживаемыйТовар, ЛОЖЬ) КАК ОшибкаВеденияУчетаПоГТД
	|ПОМЕСТИТЬ ДанныеКомплекта
	|ИЗ
	|	Справочник.Номенклатура КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК Классификатор
	|		ПО Товары.КодТНВЭД = Классификатор.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &НоменклатураКомплект";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКомплектующие()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Комплектующие.НомерСтроки		КАК НомерСтроки,
	|	Комплектующие.Номенклатура		КАК Номенклатура,
	|	Комплектующие.Характеристика	КАК Характеристика
	|ПОМЕСТИТЬ КомплектующиеДляЗапроса
	|ИЗ
	|	&Комплектующие КАК Комплектующие";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПрослеживаемыеКомплектующие()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Комплектующие.НомерСтроки					КАК НомерСтроки,
	|	Комплектующие.Номенклатура					КАК Номенклатура,
	|	ЕСТЬNULL(Товары.КодТНВЭД, НЕОПРЕДЕЛЕНО)		КАК КодТНВЭД,
	|	Комплектующие.Характеристика				КАК Характеристика,
	|	Комплектующие.Номенклатура = &НоменклатураОсновногоКомпонента
	|		И Комплектующие.Характеристика = &ХарактеристикаОсновногоКомпонента КАК ОсновнаяКомплектующая,
	|	НЕ ЕСТЬNULL(Товары.ВестиУчетПоГТД, ЛОЖЬ)	КАК ОшибкаВеденияУчетаПоГТД
	|ПОМЕСТИТЬ ПрослеживаемыеКомплектующие
	|ИЗ
	|	КомплектующиеДляЗапроса КАК Комплектующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО Комплектующие.Номенклатура = Товары.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК Классификатор
	|		ПО Товары.КодТНВЭД = Классификатор.Ссылка
	|
	|ГДЕ
	|	ЕСТЬNULL(Классификатор.ПрослеживаемыйТовар, ЛОЖЬ)
	|	И ЕСТЬNULL(Товары.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПрослеживаемыеКомплектующиеСгруппированная()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Комплектующие.Номенклатура				КАК Номенклатура,
	|	Комплектующие.Характеристика			КАК Характеристика,
	|	Комплектующие.ОшибкаВеденияУчетаПоГТД	КАК ОшибкаВеденияУчетаПоГТД
	|ПОМЕСТИТЬ ПрослеживаемыеКомплектующиеСгруппированная
	|ИЗ
	|	ПрослеживаемыеКомплектующие КАК Комплектующие";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПроверокКомплекта()
	
	ТекстыПроверок = Новый Массив;
	ТекстыПроверок.Добавить(ТекстЗапросаПроверкиНепрослеживаемогоКомплекта());
	ТекстыПроверок.Добавить(ТекстЗапросаПроверкиОтличияКодовТНВЭДСборки());
	ТекстыПроверок.Добавить(ТекстЗапросаПроверкиОтличияКодовТНВЭДРазборки());
	
	ТекстЗапроса = СтрСоединить(ТекстыПроверок, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПроверкиНепрослеживаемогоКомплекта()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА	КАК НепрослеживаемыйКомплект,
	|	ЛОЖЬ	КАК ОтличаютсяКодыТНВЭДСборки,
	|	ЛОЖЬ	КАК ОтличаютсяКодыТНВЭДРазборки
	|ИЗ
	|	ДанныеКомплекта КАК ДанныеКомплекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПрослеживаемыеКомплектующие КАК Комплектующие
	|		ПО ИСТИНА
	|
	|ГДЕ
	|	НЕ ДанныеКомплекта.ПрослеживаемыйТовар
	|	И НЕ Комплектующие.Номенклатура ЕСТЬ NULL";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПроверкиОтличияКодовТНВЭДСборки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЛОЖЬ	КАК НепрослеживаемыйКомплект,
	|	ИСТИНА	КАК ОтличаютсяКодыТНВЭДСборки,
	|	ЛОЖЬ	КАК ОтличаютсяКодыТНВЭДРазборки
	|ИЗ
	|	ДанныеКомплекта КАК ДанныеКомплекта
	|
	|ГДЕ
	|	&СборкаКомплекта
	|	И ДанныеКомплекта.ПрослеживаемыйТовар
	|	И НЕ ДанныеКомплекта.КодТНВЭД В
	|		(ВЫБРАТЬ
	|			Комплектующие.КодТНВЭД КАК КодТНВЭД
	|		ИЗ
	|			ПрослеживаемыеКомплектующие КАК Комплектующие
	|		ГДЕ
	|			Комплектующие.ОсновнаяКомплектующая)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПроверкиОтличияКодовТНВЭДРазборки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЛОЖЬ	КАК НепрослеживаемыйКомплект,
	|	ЛОЖЬ	КАК ОтличаютсяКодыТНВЭДСборки,
	|	ИСТИНА	КАК ОтличаютсяКодыТНВЭДРазборки
	|ИЗ
	|	ДанныеКомплекта КАК ДанныеКомплекта
	|
	|ГДЕ
	|	НЕ &СборкаКомплекта
	|	И ДанныеКомплекта.ПрослеживаемыйТовар
	|	И НЕ ДанныеКомплекта.КодТНВЭД В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			Комплектующие.КодТНВЭД КАК КодТНВЭД
	|		ИЗ
	|			ПрослеживаемыеКомплектующие КАК Комплектующие)
	|	И ИСТИНА В
	|		(ВЫБРАТЬ
	|			ИСТИНА
	|		ИЗ
	|			ПрослеживаемыеКомплектующиеСгруппированная КАК Комплектующие
	|		ИМЕЮЩИЕ
	|			КОЛИЧЕСТВО(*) = 1)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонСообщенияНепрослеживаемогоКомплекта(ТипНоменклатуры)
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ТекстШаблона = НСтр("ru='Непрослеживаемый по РНПТ набор ""%1"" не должен содержать прослеживаемые комплектующие:
							|%2.'");
	Иначе
		ТекстШаблона = НСтр("ru='Непрослеживаемый по РНПТ комплект ""%1"" не должен содержать прослеживаемые комплектующие:
							|%2.'");
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСообщенияОтличияКодовТНВЭДСборки(ТипНоменклатуры)
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ТекстШаблона = НСтр("ru='Отличаются коды ТН ВЭД прослеживаемого по РНПТ набора ""%1"" и основной комплектующей ""%2"".
							|Для ведения корректного учета прослеживаемых по РНПТ наборов необходимо указать основную комплектующую с кодом ТН ВЭД аналогичным коду набора.'");
	Иначе
		ТекстШаблона = НСтр("ru='Отличаются коды ТН ВЭД прослеживаемого по РНПТ комплекта ""%1"" и основной комплектующей ""%2"".
							|Для ведения корректного учета прослеживаемых по РНПТ комплектов необходимо указать основную комплектующую с кодом ТН ВЭД аналогичным коду комплекта.'");
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСообщенияЗаполненияОсновнойКомплектующей(ТипНоменклатуры)
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ТекстШаблона = НСтр("ru='Не указана основная комплектующая для прослеживаемого по РНПТ набора ""%1"".
							|Для ведения корректного учета прослеживаемых по РНПТ наборов необходимо указать основную комплектующую с кодом ТН ВЭД аналогичным коду набора.'");
	Иначе
		ТекстШаблона = НСтр("ru='Не указана основная комплектующая для прослеживаемого по РНПТ комплекта ""%1"".
							|Для ведения корректного учета прослеживаемых по РНПТ комплектов необходимо указать основную комплектующую с кодом ТН ВЭД аналогичным коду комплекта.'");
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСообщенияОтличияКодовТНВЭДРазборки(ТипНоменклатуры)
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ТекстШаблона = НСтр("ru='Отличаются коды ТН ВЭД прослеживаемого по РНПТ набора ""%1"" и комплектующей ""%2"".
							|Для ведения корректного учета прослеживаемых по РНПТ наборов необходимо указать комплектующую с кодом ТН ВЭД аналогичным коду набора.'");
	Иначе
		ТекстШаблона = НСтр("ru='Отличаются коды ТН ВЭД прослеживаемого по РНПТ комплекта ""%1"" и комплектующей ""%2"".
							|Для ведения корректного учета прослеживаемых по РНПТ комплектов необходимо указать комплектующую с кодом ТН ВЭД аналогичным коду комплекта.'");
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСообщенияНепрослеживаемыеКомплектующие()
	
	ТекстШаблона = НСтр("ru='Прослеживаемый по РНПТ комплект ""%1"" не содержит прослеживаемую комплектующую.
						|Для ведения корректного учета прослеживаемых по РНПТ комплектов необходимо указать комплектующую с кодом ТН ВЭД аналогичным коду комплекта.'");
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСообщенияРазличныеПрослеживаемыеКомплектующие(ТипНоменклатуры, СборкаКомплекта, РедактированиеНабора)
	
	ПереносТекста = "
					|";
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ТекстШаблона = НСтр("ru='Прослеживаемый по РНПТ набор ""%1"" не должен содержать различные прослеживаемые комплектующие:
							|%2.'");
		
		Если Не РедактированиеНабора Тогда
			ТекстШаблона = ТекстШаблона + ПереносТекста + НСтр("ru='Оставьте в составе набора одну прослеживаемую по РНПТ комплектующую и укажите ее в качестве основной.'");
		КонецЕсли;
	Иначе
		ТекстШаблона = НСтр("ru='Прослеживаемый по РНПТ комплект ""%1"" не должен содержать различные прослеживаемые комплектующие:
							|%2.'");
		
		Если СборкаКомплекта Тогда
			ТекстШаблона = ТекстШаблона + ПереносТекста + НСтр("ru='Оставьте в составе набора одну прослеживаемую по РНПТ комплектующую и укажите ее в качестве основной.'");
		Иначе
			ТекстШаблона = ТекстШаблона + ПереносТекста + НСтр("ru='Оставьте в составе комплекта одну прослеживаемую по РНПТ комплектующую.'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСообщенияКорректностиНастроекПрослеживаемостиНоменклатуры(ТипНоменклатуры, ЭтоКомплект = Ложь)
	
	Если ЭтоКомплект Тогда
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
			ТекстШаблона = НСтр("ru='Для набора ""%1"" задан прослеживаемый код ТН ВЭД, но выключен учет по номерам ГТД.
								|Для учета набора как прослеживаемого, требуется взвести флаг учета по номерам ГТД.'");
		Иначе
			ТекстШаблона = НСтр("ru='Для комплекта ""%1"" задан прослеживаемый код ТН ВЭД, но выключен учет по номерам ГТД.
								|Для учета комплекта как прослеживаемого, требуется взвести флаг учета по номерам ГТД.'");
		КонецЕсли;
	Иначе
		ТекстШаблона = НСтр("ru='Для комплектующей ""%1"" задан прослеживаемый код ТН ВЭД, но выключен учет по номерам ГТД.
								|Для учета комплектующей как прослеживаемой, требуется взвести флаг учета по номерам ГТД.'");
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ШаблонСтрокиПрослеживаемойКомплектующей(ВыводитьНомера)
	
	Если Не ВыводитьНомера Тогда
		ТекстШаблона = НСтр("ru = '""%1"" списка ""Комплектующие""'");
	Иначе
		ТекстШаблона = НСтр("ru = '""%1"" в строке %2 списка ""Комплектующие""'");
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

Функция ПредставлениеПрослеживаемыхКомплектующих(Товары, ВыводитьНомера = Истина)
	
	ТекстыПредставлений = Новый Массив;
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Если ВыводитьНомера Тогда
			ПредставлениеСтроки = СтрШаблон(ШаблонСтрокиПрослеживаемойКомплектующей(ВыводитьНомера),
											СтрокаТоваров.Номенклатура,
											СтрокаТоваров.НомерСтроки);
		Иначе
			ПредставлениеТовара = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаТоваров.Номенклатура,
																					СтрокаТоваров.Характеристика);
			ПредставлениеСтроки = СтрШаблон(ШаблонСтрокиПрослеживаемойКомплектующей(ВыводитьНомера), ПредставлениеТовара);
		КонецЕсли;
		
		ТекстыПредставлений.Добавить(ПредставлениеСтроки);
	КонецЦикла;
	
	РазделительСтрок = ";
						|";
	ПредставлениеКомплектующих = СтрСоединить(ТекстыПредставлений, РазделительСтрок);
	
	Возврат ПредставлениеКомплектующих;
	
КонецФункции

#КонецОбласти
//-- Локализация

#КонецОбласти
