
#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму партнера со старым или новым интерфейсом
//
// Параметры:
//	Форма - УправляемаяФорма - форма, из которой вызывается обработчик.
//		Если вызывается вне формы, тогда значение Неопределено;
//	СтруктураПараметры - Структура - параметры;
//
Процедура ОткрытьФормуПартнераСоответствующуюИнтерфейсу(Форма, СтруктураПараметры) Экспорт
	
	ВыбраннаяФорма = "CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая";
	ОткрытьФорму("Справочник.Партнеры.Форма."+ВыбраннаяФорма, СтруктураПараметры, Форма);
	
КонецПроцедуры// ОткрытьФормуПартнераСоответствующуюИнтерфейсу(Форма, Результат) Экспорт

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
