
#Область ПеренесеноСДоработками

&После("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)
	// Фролов+
	ВыполнитьДвиженияПоУслугамСЦ(Отказ,РежимПроведения,смартСервер.ПолучитьДатуВнедренияФункционала());
	// Фролов-
КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Фролов+
Процедура ВыполнитьДвиженияПоУслугамСЦ(Отказ,РежимПроведения,ДатаВнедренияФункционала)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.ВидыНоменклатуры.ПолучитьВидыНоменклатурыСЦ());
	Запрос.УстановитьПараметр("ДатаВнедрения",ДатаВнедренияФункционала);
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	             |	Таблица.Ссылка.Дата КАК Период,
	             |	Таблица.Ссылка КАК Регистратор,
	             |	Таблица.Ссылка.ЗаказКлиента КАК Заказ,
				 |  Таблица.Ссылка.ЗаказКлиента.ДатаЗакрытия КАК ДатаЗакрытия,
				 |	Таблица.Ссылка.ЗаказКлиента.смартИсполнительРаботПоЗаказу КАК Инженер,
	             |	Таблица.Ссылка.ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт) КАК ЗаказЗакрыт,
	             |	Таблица.Номенклатура КАК Номенклатура,
	             |	Таблица.Количество КАК Количество,
	             |	Таблица.СуммаСНДС КАК Сумма,
	             |	Таблица.Ссылка.Валюта КАК Валюта
	             |ИЗ
	             |	Документ.АктВыполненныхРабот.Услуги КАК Таблица
	             |ГДЕ
	             |	Таблица.Ссылка = &Ссылка
				 |	И Таблица.Ссылка.ЗаказКлиента Ссылка Документ.ЗаказКлиента
	             |	И Таблица.Номенклатура.ВидНоменклатуры В(&ВидНоменклатуры)
				 |  И Таблица.Ссылка.ЗаказКлиента.Дата >= &ДатаВнедрения";
	Движение=Движения.смартРаботыСервисногоЦентра;
	Движение.Записывать=Истина;
	Движение.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	
// Фролов-

#КонецОбласти