
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ЗаполнитьРасчетНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов КАК Оборудование,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер КАК Инженер,
	|	СУММА(ЕСТЬNULL(ASP_ТарифыЗапускаСрезПоследних.Тариф, 0)) КАК Тариф,
	|	МАКСИМУМ(ЕСТЬNULL(ASP_ТарифыЗапускаСрезПоследних.КоличествоИнженеров, 0)) КАК Колво,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка КАК Заявка,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер2 = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК КолвоВЗаявке
	|ПОМЕСТИТЬ ПодгТабл
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК смартЗаявкаНаПускоНаладкуОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ТарифыЗапуска.СрезПоследних(&ДатаКонца, ) КАК ASP_ТарифыЗапускаСрезПоследних
	|		ПО смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов = ASP_ТарифыЗапускаСрезПоследних.Оборудование
	|ГДЕ
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.Маркетинг = ИСТИНА
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.БонусЗаПНРНачислен <> ИСТИНА
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.Статус В (&Статус)
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.смартASP_ПомещенВХранилище = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка,
	|	смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер2 = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер2,
	|	СУММА(ЕСТЬNULL(ASP_ТарифыЗапускаСрезПоследних.Тариф, 0)),
	|	МАКСИМУМ(ЕСТЬNULL(ASP_ТарифыЗапускаСрезПоследних.КоличествоИнженеров, 0)),
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер2 = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК смартЗаявкаНаПускоНаладкуОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ТарифыЗапуска.СрезПоследних(&ДатаКонца, ) КАК ASP_ТарифыЗапускаСрезПоследних
	|		ПО смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов = ASP_ТарифыЗапускаСрезПоследних.Оборудование
	|ГДЕ
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.Маркетинг = ИСТИНА
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.БонусЗаПНРНачислен <> ИСТИНА
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.Статус В (&Статус)
	|	И смартЗаявкаНаПускоНаладкуОборудование.Ссылка.смартASP_ПомещенВХранилище = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.НазначенныйНаЗапускИнженер2,
	|	смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодгТабл.Оборудование КАК Оборудование,
	|	ПодгТабл.Инженер КАК Инженер,
	|	ПодгТабл.Тариф КАК Тариф,
	|	ПодгТабл.Колво КАК Колво,
	|	ПодгТабл.Заявка КАК Заявка,
	|	ПодгТабл.КолвоВЗаявке КАК КолвоВЗаявке
	|ИЗ
	|	ПодгТабл КАК ПодгТабл";
	
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(Объект.Дата));
	масСтатус = Новый Массив;
	масСтатус.Добавить(Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена);
	масСтатус.Добавить(Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно);
	Запрос.УстановитьПараметр("Статус", масСтатус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	Объект.РасчетБонусов.Очистить();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Инженер) Тогда
			НовСтр=Объект.РасчетБонусов.Добавить();
			НовСтр.Инженер=Выборка.Инженер;
			НовСтр.ЗаявкаНазапуск=Выборка.Заявка;
			НовСтр.Оборудование=Выборка.Оборудование;
			Если Выборка.Тариф>0 и Выборка.Колво>0  Тогда
				НовСтр.Тариф=Выборка.Тариф;
				НовСтр.Бонус=Выборка.Тариф/Выборка.КолвоВЗаявке*Выборка.Колво;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров
	Модифицированность = Истина;
	//--#1288 смарт: Лопато 29.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ЗаполнитьРасчет(Команда)  
	Если Объект.РасчетБонусов.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Таблица расчетов будет очищена.Продолжить?';"
						+ " en = 'Do you want to continue?'"), Режим, 0);
	Иначе
		ЗаполнитьРасчетНаСервере();
	КонецЕсли;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьРасчетНаСервере();
	КонецЕсли;
	//--#1288 смарт: Лопато 29.12.2022
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если НЕ ЗначениеЗаполнено(Объект.смартСтатусРасчетаБонусов) Тогда
		Объект.смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	УстановитьДоступностьПоСтатусуРасчета();
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = ""
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура УстановитьДоступностьПоСтатусуРасчета()

	смартASP_ОбщийМодуль.смартУстановитьТолькоПросмотрФормыРасчетЗавершен(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусуРасчета();

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#Область ПодключаемыеКоманды

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиКомандФормы

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти