
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МероприятиеПриИзменении(Элемент)
	МероприятиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИДКамерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКамерыОкончание", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ФильтрКамер, ИсключатьСписок", ПолучитьМассивКамер(), Ложь);
	Открытьформу("Справочник.CRM_Камеры.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	СтруктураВозврата = Новый структура("Камера,Мероприятие,НаименованиеСтенда1,НаименованиеСтенда2,ИнфоНадписьПервоеПосещениеНовыйКлиент,ИнфоНадписьНеПервоеПосещениеНовыйКлиент,ИнфоНадписьПервоеПосещениеНеНовыйКлиент,ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент", 
							Объект.Камера, Объект.Мероприятие, Объект.НаименованиеСтенда1, Объект.НаименованиеСтенда2, Объект.ИнфоНадписьПервоеПосещениеНовыйКлиент, Объект.ИнфоНадписьНеПервоеПосещениеНовыйКлиент, Объект.ИнфоНадписьПервоеПосещениеНеНовыйКлиент, Объект.ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент);
	ЭтотОбъект.Закрыть(СтруктураВозврата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура МероприятиеПриИзмененииНаСервере()
	//ЗаполнитьЗначенияСвойств(Объект, Объект.Мероприятие, "ИнфоНадписьПервоеПосещениеНовыйКлиент,ИнфоНадписьНеПервоеПосещениеНовыйКлиент,ИнфоНадписьПервоеПосещениеНеНовыйКлиент,ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент");
	Объект.ИнфоНадписьПервоеПосещениеНовыйКлиент = Объект.Мероприятие.CRM_ИнфоНадписьПервоеПосещениеНовыйКлиент;
	Объект.ИнфоНадписьНеПервоеПосещениеНовыйКлиент = Объект.Мероприятие.CRM_ИнфоНадписьНеПервоеПосещениеНовыйКлиент;
	Объект.ИнфоНадписьПервоеПосещениеНеНовыйКлиент = Объект.Мероприятие.CRM_ИнфоНадписьПервоеПосещениеНеНовыйКлиент;
	Объект.ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент = Объект.Мероприятие.CRM_ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКамер()
	Возврат Объект.Мероприятие.CRM_КамерыВидеофиксации.Выгрузить().ВыгрузитьКолонку("Камера");
КонецФункции
&НаКлиенте

Процедура ВыборКамерыОкончание(ДанныеВыбора, ДопПараметры) Экспорт
	Объект.Камера = ДанныеВыбора;	
КонецПроцедуры

#КонецОбласти



