#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Календари

// Функция - Событие календаря по идентификатору
//  Функция возвращает запись регистра сведений CRM_СобытияКалендаря.
//
// Параметры:
//  Идентификатор	 - Строка					 - Идентификатор события.
//  Пользователь	 - СправочникСсылка.Пользователи - Пользователь, для которого записано событие.
// 
// Возвращаемое значение:
//  ЗаписьРегистра - Запись регистра сведений CRM_СобытияКалендаря.
//
Функция СобытиеКалендаряПоИдентификатору(Идентификатор, Пользователь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаря.Объект КАК Ссылка
	|ИЗ
	|	РегистрСведений.CRM_СобытияКалендаря КАК ЗаписиКалендаря
	|ГДЕ
	|	ЗаписиКалендаря.Ключ = &Ключ
	|	И ЗаписиКалендаря.Пользователь = &Пользователь
	|	И ЗаписиКалендаря.Объект ССЫЛКА Документ.CRM_Взаимодействие");
	
	Запрос.УстановитьПараметр("Ключ", CRM_СинхронизацияКалендарей.КлючИзИдентификатора(
		Идентификатор, "РегистрыСведений.CRM_СобытияКалендаря.ОбъектПоИдентификатору()"));
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Документы.CRM_Взаимодействие.СоздатьДокумент();
		Результат.Заполнить(Новый Структура);
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка.ПолучитьОбъект();
	
КонецФункции

// Функция - Идентификаторы по событию календаря
//
// Параметры:
//  Объект		 - Ссылка						 - Событие календаря.
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, для которого записано событие.
// 
// Возвращаемое значение:
//  Результат - Структура - Структура идентификаторов события.
//
Функция ИдентификаторыПоСобытиюКалендаря(Объект, Пользователь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор",				"");
	Результат.Вставить("ETag",						"");
	Результат.Вставить("ИндексЦвета",				"");
	Результат.Вставить("Гиперссылка",				"");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаря.Идентификатор КАК Идентификатор,
	|	ЗаписиКалендаря.ETag КАК ETag,
	|	ЗаписиКалендаря.ИндексЦвета КАК ИндексЦвета,
	|	ЗаписиКалендаря.Гиперссылка КАК Гиперссылка
	|ИЗ
	|	РегистрСведений.CRM_СобытияКалендаря КАК ЗаписиКалендаря
	|ГДЕ
	|	ЗаписиКалендаря.Пользователь = &Пользователь
	|	И ЗаписиКалендаря.Объект = &Объект");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли