
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Если ЭтоЛичнаяЗадача(ПараметрКоманды) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Нстр("ru='Описание бизнес-процесса недоступно для личных задач!';en='The description of the business process is not available for personal tasks!'");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;			
		ОткрытьФорму("ОбщаяФорма.CRM_ОписаниеБизнесПроцесса",Новый Структура("ОбъектОтбора", ВернутьСсылкуНаБизнесПроцесс(ПараметрКоманды)),
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
				ПараметрыВыполненияКоманды.Окно);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВернутьСсылкуНаБизнесПроцесс(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Возврат ПараметрКоманды.БизнесПроцесс;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		Возврат ПараметрКоманды;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоЛичнаяЗадача(ПараметрКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если ПараметрКоманды.CRM_Личная Тогда
			Возврат Истина;
		КонецЕсли;			
	КонецЕсли;			
	Возврат Ложь;	
КонецФункции


#КонецОбласти

