#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаСсылка) Экспорт

	//Если ТочкаМаршрутаСсылка = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СогласоватьСКлиентом Тогда
		ИмяФормы = "БизнесПроцесс.смартIECHOПродажа.Форма.ФормаЗадачи";
	//КонецЕсли;

	ПараметрыФормы = Новый Структура("Ключ", ЗадачаСсылка);
	
	Возврат Новый Структура(
		"ПараметрыФормы, ИмяФормы", ПараметрыФормы, ИмяФормы);

КонецФункции

// Вызывается при выполнении задачи из формы списка.
//
// Параметры:
//   ЗадачаСсылка.ЗадачаИсполнителя - задача, для которой выполняется обработка 
//   ТочкаМаршрутаСсылка - точка маршрута.
//
Процедура ОбработкаВыполненияПоУмолчанию(ЗадачаСсылка, БизнесПроцессСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецЕсли
