
////////////////////////////////////////////////////////////////////////////////
// Хранилище настроек повторное использование
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция Загрузить(КлючОбъекта, КлючНастроек = "", ОписаниеНастроек = Неопределено, Знач ИмяПользователя = Неопределено) Экспорт
	Возврат CRM_ХранилищеНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
КонецФункции

#КонецОбласти