
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) //++ #1443 смарт: Ермаков 26.09.2023
	
	//++ #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
	// Добавляем сервисные реквизиты для формы. Требуется для корректной выборки Заметок
	Если Форма.ИмяФормы = "Обработка.CRM_АРМ_МоиПродажи.Форма.Форма" Тогда
		
		//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
		МассивДобавляемыхРеквизитов = Новый Массив;                   
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("extCRM_ПоискАвтор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), ""));
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);       
		//--#1542 смарт: Лопато 03.11.2023
		
		//++ #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТекущийПартнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСписокТаблиц", Новый ОписаниеТипов("СписокЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТекущийИнтерес", Новый ОписаниеТипов("ДокументСсылка.CRM_Интерес")));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		//-- #1443 смарт: Ермаков 26.09.2023
		
		//++ #1761 смарт: Ермаков 17.04.2024 / Оптимизация и доработка CRM Канбан "Мои продажи"
		// Меняется позиция кнопки Обновить
		Форма.Элементы.Переместить(Форма.Элементы.Обновить, Форма.Элементы.ГруппаКомандыОтбораНовая); // Кнопка Обновить переезжает справа от фильтра		
		
		// На форму добавляется флаг, при изменении которого меняется масштаб формы
		Форма.Команды.Добавить("смартКомпактно");
				
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКомпактно", Новый ОписаниеТипов("Булево"),, "Компактно", Истина));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		
		// Рисуем поле флажка Компактно. При изменении - меняется масштаб формы.
		НовыйЭлемент = Форма.Элементы.Добавить("смартКомпактно", Тип("ПолеФормы"), Форма.Элементы.ГруппаКомандыОтбораНовая);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "смартКомпактно";
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		
		// Загружаем сохраненные настройки для масштаба формы
		ЗначениеХранилища = ХранилищеНастроекДанныхФорм.Загрузить("Обработка.CRM_АРМ_МоиПродажи.Форма.Форма_смартКомпактно");
		ЗначениеХранилища = ?(ЗначениеХранилища = Неопределено, Ложь, ЗначениеХранилища);	
		
		Форма.смартКомпактно = ЗначениеХранилища;
		Форма.Масштаб = ?(ЗначениеХранилища, 60, 100);
		//-- #1761 смарт: Ермаков 17.04.2024
		
		//++ #1808 смарт: Ермаков 06.05.2024 / Доработка обработки Мои продажи - отбор по квалификациям.
		// Выводим фильтр по клиенту на основную форму
		Форма.Команды.Добавить("смартПоискКлиент");
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартПоискКлиент", Тип("ПолеФормы"), Форма.Элементы.ГруппаКомандыОтбораНовая, Форма.Элементы.ОткрытьФильтр);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ПоискКлиент";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.КнопкаОчистки = Истина;
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.ПодсказкаВвода = "Клиент";
		НовыйЭлемент.МаксимальнаяШирина = 24;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;	
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");		
		
		// Добавлеем фильтр по квалификации
		Форма.Команды.Добавить("смартКвалификация");
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКвалификация", Новый ОписаниеТипов("СписокЗначений"),, "Квалификация", Истина));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		
		Форма.смартКвалификация.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.смартКвалификацииМенеджеров");
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартКвалификация", Тип("ПолеФормы"), Форма.Элементы.ГруппаКомандыОтбораНовая, Форма.Элементы.ОткрытьФильтр);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартКвалификация";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.КнопкаОчистки = Истина;              	
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.ПодсказкаВвода = "Квалификация"; 
		НовыйЭлемент.МаксимальнаяШирина = 24;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;	
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");		
		
		// Добавляем фильтр по новым и старым воронкам
		Форма.Команды.Добавить("смартНовые");
		Форма.Команды.Добавить("смартСтарые");
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартНовые", Новый ОписаниеТипов("Булево"),, "Новые", Истина));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСтарые", Новый ОписаниеТипов("Булево"),, "Старые", Истина));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		
		Для Каждого Реквизит Из МассивРеквизитов Цикл
			
			НовыйЭлемент = Форма.Элементы.Вставить(Реквизит.Имя, Тип("ПолеФормы"), Форма.Элементы.ГруппаКомандыОтбораНовая, Форма.Элементы.ОткрытьФильтр);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = Реквизит.Имя;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");				
			
		КонецЦикла;
		//-- #1808 смарт: Ермаков 06.05.2024
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая" Тогда
		
		//++ #1830 смарт: Фролов 24.05.2024 //Приведение механизма Заметок в Интересе и Партнере к общему виду.
		// Размещаем кнопку для создания заметок
		//ЗаметкиКоманда = Форма.Команды.Добавить("смартСоздатьЗаметку");
		//ЗаметкиКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
		//ЗаметкиКоманда.Отображение = ОтображениеКнопки.Текст;
		//
		//Заметки = Форма.Элементы.Вставить("смартСоздатьЗаметку", Тип("КнопкаФормы"), Форма.Элементы.ГруппаКоманднаяПанель, Форма.Элементы.Декорация5);
		//Заметки.ИмяКоманды = "смартСоздатьЗаметку";
		//Заметки.Заголовок = "Создать заметку (смарт)";  
		//-- #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
		
		ЗаметкиКоманда = Форма.Команды.Добавить("смартЗаметки");
		ЗаметкиКоманда.Действие = "смартОткрытьЗаметки";
		ЗаметкиКоманда.Отображение = ОтображениеКнопки.Текст;
		
		Заметки = Форма.Элементы.Вставить("смартЗаметки", Тип("КнопкаФормы"), Форма.Элементы.ГруппаКоманднаяПанель, Форма.Элементы.Декорация5);
		Заметки.ИмяКоманды = "смартЗаметки";
		Заметки.Заголовок = "Заметки (смарт)";
		//-- #1830 смарт: Фролов 24.05.2024
		
		//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
		Форма.Элементы.Оценка.Видимость = Ложь;
		Форма.Элементы.ДекорацияКомментарийОценки.Видимость = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("extCRM_ДекорацияОценки", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаОценка);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "extCRM_ДекорацияОценкиОбработкаНавигационнойСсылки");
		
		//++ #Б-3566 смарт: Фролов 25.06.2025 //Описание
		//НовыйЭлемент = Форма.Элементы.Добавить("extCRM_ДекорацияЗаказ", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаДатаПродажи);
		НовыйЭлемент = Форма.Элементы.Вставить("extCRM_ДекорацияЗаказ", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаВыручка);
		//-- #Б-3566 смарт: Фролов 25.06.2025
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "";
		//--#1542 смарт: Лопато 03.11.2023
		
		//++Перенесено из расширения CRM
		// Поддержка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CRM_ДанныеОбратнойСвязи.Оценка КАК Оценка,
		               |	CRM_ДанныеОбратнойСвязи.Шаблон КАК Шаблон,
		               |	CRM_ДанныеОбратнойСвязи.Комментарий КАК Комментарий
		               |ИЗ
		               |	РегистрСведений.extCRM_ДанныеОбратнойСвязи КАК CRM_ДанныеОбратнойСвязи
		               |ГДЕ
		               |	CRM_ДанныеОбратнойСвязи.Объект = &Объект
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Шаблон,
		               |	CRM_ДанныеОбратнойСвязи.ДатаОценки УБЫВ
		               |ИТОГИ ПО
		               |	Шаблон";
		Запрос.УстановитьПараметр("Объект", Форма.Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Форма.Элементы.ГруппаОценка.Видимость = (Выборка.Количество()>0);
		МассивОценок = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ВыборкаОценка = Выборка.Выбрать();
			Если ВыборкаОценка.Следующий() Тогда
				Оценка = ВыборкаОценка.Оценка;
				КомментарийОценки = СокрЛП(ВыборкаОценка.Комментарий);
				ПозицияПС = СтрНайти(КомментарийОценки, Символы.ПС);
				Если ПозицияПС > 0 Тогда
					КомментарийСокр = Лев(КомментарийОценки, ПозицияПС - 1);
				Иначе
					КомментарийСокр = КомментарийОценки;
				КонецЕсли;
				КомментарийСокр = ?(СтрДлина(КомментарийСокр) > 45, Лев(КомментарийСокр, 42)+"...", КомментарийСокр);
				Если МассивОценок.Количество()>0 Тогда
					МассивОценок.Добавить(Символы.ПС);
				КонецЕсли;
				МассивОценок.Добавить(Новый ФорматированнаяСтрока(ВыборкаОценка.Шаблон.Наименование + ": " 
					+ Строка(Оценка)+ "   " ,
					Новый ФорматированнаяСтрока(КомментарийСокр,, ЦветаСтиля.ЦветГиперссылки,,КомментарийОценки)));
			КонецЕсли;
			Форма.Элементы.extCRM_ДекорацияОценки.Заголовок = Новый ФорматированнаяСтрока(МассивОценок);
			Форма.Элементы.extCRM_ДекорацияОценки.Высота = (МассивОценок.Количество()+1)/2;
		КонецЦикла;	
		// Конец Поддержка
		
		//++ #Б-3860 смарт: Фролов 15.08.2025 //CRM. Продажа оборудования. Дополнительные условия на этапе
		НовыйЭлемент = Форма.Элементы.Добавить("смартДатаОтправкиДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаДатаПродажи); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДатаОтправкиДоговора";
		НовыйЭлемент.Заголовок = "Дата отправки договора"; 
		//-- #Б-3860 смарт: Фролов 15.08.2025
		
		//+ Отображение заказа в интересе
		//++ #1690 смарт: Фролов 26.03.2024 //Небольшие доработки CRM по результатам эксплуатации.
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_ЖурналДокументов.Объект КАК Объект,
		|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
		|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
		|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентДолга, 0) КАК ПроцентДолга
		|ИЗ
		|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|		ПО CRM_ЖурналДокументов.Объект = СостоянияЗаказовКлиентов.Заказ
		|ГДЕ
		|	CRM_ЖурналДокументов.CRM_Интерес = &CRM_Интерес
		|	И CRM_ЖурналДокументов.ГлавнаяЗапись
		|	И CRM_ЖурналДокументов.Объект ССЫЛКА Документ.ЗаказКлиента");
		
		//-- #1690 смарт: Фролов 26.03.2024
		
		Запрос.УстановитьПараметр("CRM_Интерес", Форма.Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Форма.Элементы.extCRM_ДекорацияЗаказ.Заголовок = Новый ФорматированнаяСтрока(Строка(Выборка.Объект),,,, ПолучитьНавигационнуюСсылку(Выборка.Объект));
			
			//++ #1690 смарт: Фролов 22.03.2024 //Небольшие доработки CRM по результатам эксплуатации.
			Если ЗначениеЗаполнено(Выборка.Объект.Договор) Тогда
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартДекорацияДоговорПодписан", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаДатаПродажи);
				НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
				НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
				
				Если Выборка.Объект.Договор.смартДоговорПодписан Тогда
					НовыйЭлемент.Заголовок = "   Договор подписан";
					НовыйЭлемент.ЦветТекста = Новый Цвет(0,128,0);
				Иначе
					НовыйЭлемент.Заголовок = "   Договор не подписан";
					НовыйЭлемент.ЦветТекста = Новый Цвет(255,0,0);
				КонецЕсли;
			
			КонецЕсли;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДекорацияСостоянияЗаказа", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаВыручка);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
			НовыйЭлемент.ЦветТекста = Новый Цвет(0,128,0);
			
			НовыйЭлемент.Заголовок = "   Оплачено - " + Выборка.ПроцентОплаты + "%, " + "Отгружено - " + Выборка.ПроцентОтгрузки + "%, "
				+ "Долг - " + Выборка.ПроцентДолга + "%";
			//-- #1690 смарт: Фролов 22.03.2024
			
		КонецЕсли;
		//- Отображение заказа в интересе
		//--Перенесено из расширения CRM    
		
		//++ #1615 смарт: Мосолов 25.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
		
		НовыйЭлементГруппа = Форма.Элементы.Вставить("смартНеобходимыеРеквизитыГруппа", Тип("ГруппаФормы"), 
												Форма.Элементы.ГруппаКонтейнерФормРегистрации, Форма.Элементы.ГруппаЗаписатьОтмена); 
												
		НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
		НовыйЭлементГруппа.Видимость = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартНеобходимыеРеквизитыДекорация", Тип("ДекорацияФормы"), НовыйЭлементГруппа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Высота = 1;
		НовыйЭлемент.Шрифт = Новый Шрифт(,1);
		НовыйЭлемент.ЦветРамки = Новый Цвет(199, 199, 199);
		НовыйЭлемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху, 1);
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("БизнесРегион", Тип("ПолеФормы"), НовыйЭлементГруппа); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "Клиент_Объект.БизнесРегион";
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Истина;
		НовыйЭлемент.Заголовок 					= "Бизнес-регион"; 

		НовыйЭлемент = Форма.Элементы.Добавить("смартМенеджерПоРасходнымМатериалам", Тип("ПолеФормы"), НовыйЭлементГруппа); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "Клиент_Объект.смартМенеджерПоРасходнымМатериалам";
		//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Ложь;
		//--#1615 смарт: Лопато 08.02.2024
		НовыйЭлемент.Заголовок 					= "Менеджер по расходным материалам"; 

		НовыйЭлемент = Форма.Элементы.Добавить("смартОсновнойМенеджерСервисЦентра", Тип("ПолеФормы"), НовыйЭлементГруппа); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "Клиент_Объект.смартОсновнойМенеджерСервисЦентра";
		НовыйЭлемент.Заголовок 					= "Основной менеджер сервис-центра"; 
		
		//-- #1615 смарт: Мосолов 25.01.2024       
		
		//++ #1656 смарт: Фролов 28.02.2024 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.
		НовыйЭлемент = Форма.Элементы.Добавить("смартОписаниеЭтапаНадпись", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаНиз);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.Заголовок = "Что сделать на этапе?";
		НовыйЭлемент.УстановитьДействие("Нажатие", "смартОписаниеЭтапаНадписьОбработкаНавигационнойСсылки");
        //-- #1656 смарт: Фролов 28.02.2024
		
		//++ #1665 смарт: Фролов 04.03.2024 //1C:CRM Доработки 
		//++ #1845 смарт: Фролов 06.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов. Добавлена проверка на тип CRM_Заявка
		//Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) И (ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.смартЛид") Тогда
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) И (ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.смартЛид")
			ИЛИ ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Заявка")) Тогда 
		//-- #1845 смарт: Фролов 10.06.2024	
			ДокЛид = Форма.Объект.ДокументОснование;
			
			ОписаниеСтроки150 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));
			
			ОписаниеСтроки15 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15));
			
			ОписаниеСтроки100 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100));
			
			ОписаниеСтроки50 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
			
			МассивРеквизитов = Новый Массив;
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартБизнесРегионТекст", ОписаниеСтроки100));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартПродукт", ОписаниеСтроки150));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИмя", ОписаниеСтроки150));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТипТовара", ОписаниеСтроки15));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТелефонЛид", ОписаниеСтроки50));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЭлектроннаяПочтаЛид", ОписаниеСтроки50));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТекстИсточника", Новый ОписаниеТипов("Строка")));
			
			//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
			МассивРеквизитов.Добавить(Новый РеквизитФормы("БыстрыйВвод_ЗадачаСмартВидЗадачи", 
				Новый ОписаниеТипов("СправочникСсылка.смартВидыЗадач"), , "Вид задачи"));
			//-- #1929 смарт: Фролов 23.07.2024	
				
			Форма.ИзменитьРеквизиты(МассивРеквизитов);
			
			//++ #1845 смарт: Фролов 06.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.
			//Для разных типов разные реквизиты
			Если ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.смартЛид") Тогда
				
				Форма.смартБизнесРегионТекст = ДокЛид.БизнесРегионТекст;
				Форма.смартПродукт = ДокЛид.Продукт;
				Форма.смартИмя = ДокЛид.Имя;
				Форма.смартТипТовара = ДокЛид.ТипТовара;
				Форма.смартТелефонЛид = ДокЛид.Телефон;
				Форма.смартЭлектроннаяПочтаЛид = ДокЛид.ЭлектроннаяПочта;
				
				//++ #1733 смарт: Фролов 02.04.2024 //При открытии некоторых интересов у Грацкова Дмитрия - нехватает прав.
				// Добывлен привилегированный ррежим для просмотра почты
				УстановитьПривилегированныйРежим(Истина);
				
				//++ #1739 смарт: Фролов 12.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.
				Если ТипЗнч(ДокЛид.ДокументОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
					
					Если ДокЛид.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
						Форма.смартТекстИсточника = Взаимодействия.ПолучитьОбычныйТекстИзHTML(ДокЛид.ТекстИсточника);
					Иначе	
						Форма.смартТекстИсточника = ДокЛид.ТекстИсточника;
					КонецЕсли;
					
				Иначе
					
					Форма.смартТекстИсточника = ДокЛид.ТекстИсточника;
					
				КонецЕсли;
				
			Иначе	

				Форма.смартБизнесРегионТекст = ДокЛид.смартБизнесРегионТекст;
				Форма.смартПродукт = ДокЛид.смартПродукт;
				Форма.смартИмя = ДокЛид.Наименование;
				Форма.смартТипТовара = ДокЛид.смартТипТовара;
				Форма.смартТелефонЛид = ДокЛид.Телефон;
				Форма.смартЭлектроннаяПочтаЛид = ДокЛид.ЭлектроннаяПочта;
				
				//++ #1733 смарт: Фролов 02.04.2024 //При открытии некоторых интересов у Грацкова Дмитрия - нехватает прав.
				// Добывлен привилегированный ррежим для просмотра почты
				УстановитьПривилегированныйРежим(Истина);
				
				//++ #1739 смарт: Фролов 12.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.
				Если ТипЗнч(ДокЛид.ДокументОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
					
					Если ДокЛид.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
						Форма.смартТекстИсточника = Взаимодействия.ПолучитьОбычныйТекстИзHTML(ДокЛид.Комментарий);
					Иначе	
						Форма.смартТекстИсточника = ДокЛид.Комментарий;
					КонецЕсли;
					
				Иначе
					
					Форма.смартТекстИсточника = ДокЛид.Комментарий;
					
				КонецЕсли;
				
			КонецЕсли;	
			//-- #1739 смарт: Фролов 12.04.2024
			
			
			УстановитьПривилегированныйРежим(Ложь);
			//-- #1733 смарт: Фролов 02.04.2024
			
			ГруппаДанныеЛида = Форма.Элементы.Добавить("смартГруппаДанныеЛида", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновное);
			ГруппаДанныеЛида.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеЛида.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
			//++ #1654 смарт: Фролов 15.03.2024 //Изменение внешнего вида док. Интерес
			Если Форма.Объект.СостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое Тогда
				ГруппаДанныеЛида.Показать();
			Иначе
				ГруппаДанныеЛида.Скрыть();
			КонецЕсли;
			//-- #1654 смарт: Фролов 15.03.2024
			ГруппаДанныеЛида.Заголовок = "Данные из обращения";
			ГруппаДанныеЛида.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаДанныеЛида.ШрифтЗаголовка = Новый Шрифт( , 9, , , Истина);
			ГруппаДанныеЛида.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
			ГруппаДанныеЛида.ЦветФона = WEBЦвета.Белый;
			
			ГруппаДанныеЛидаГоризонтальная = Форма.Элементы.Добавить("смартГруппаДанныеЛидаГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаДанныеЛида);
			ГруппаДанныеЛидаГоризонтальная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеЛидаГоризонтальная.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеЛидаГоризонтальная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			ГруппаДанныеЛидаЛево = Форма.Элементы.Добавить("смартГруппаДанныеЛидаЛево", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаДанныеЛидаГоризонтальная);
			ГруппаДанныеЛидаЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеЛидаЛево.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеЛидаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартПродукт", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛидаЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартПродукт";
			НовыйЭлемент.Заголовок = "Продукт";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартБизнесРегионТекст", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛидаЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартБизнесРегионТекст";
			НовыйЭлемент.Заголовок = "Бизнес-регион";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартТипТовара", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛидаЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартТипТовара";
			НовыйЭлемент.Заголовок = "Тип товара"; 
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			ГруппаДанныеЛидаПраво = Форма.Элементы.Добавить("смартГруппаДанныеЛидаПраво", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаДанныеЛидаГоризонтальная);
			ГруппаДанныеЛидаПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеЛидаПраво.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеЛидаПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИмя", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛидаПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИмя";
			НовыйЭлемент.Заголовок = "Имя";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			ГруппаДанныеЛидаТелефон = Форма.Элементы.Добавить("смартГруппаДанныеЛидаТелефон", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаДанныеЛидаПраво);
			ГруппаДанныеЛидаТелефон.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеЛидаТелефон.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеЛидаТелефон.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаДанныеЛидаТелефон.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартТелефонЛид", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛидаТелефон); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартТелефонЛид";
			НовыйЭлемент.Заголовок = "Телефон"; 
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			ПозвонитьКоманда = Форма.Команды.Добавить("смартПозвонить");
			ПозвонитьКоманда.Действие = "смартПозвонить";
			ПозвонитьКоманда.Отображение = ОтображениеКнопки.Картинка;
			КнопкаПозвонить = Форма.Элементы.Добавить("смартПозвонить", Тип("КнопкаФормы"), Форма.Элементы.смартГруппаДанныеЛидаТелефон);
			КнопкаПозвонить.ИмяКоманды = "смартПозвонить";
			КнопкаПозвонить.Картинка = БиблиотекаКартинок.CRM_ТелефонныйЗвонокСоздать;
			КнопкаПозвонить.Ширина = 3;
			КнопкаПозвонить.Высота = 1;
			
			ГруппаДанныеЛидаПочта = Форма.Элементы.Добавить("смартГруппаДанныеЛидаПочта", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаДанныеЛидаПраво);
			ГруппаДанныеЛидаПочта.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеЛидаПочта.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеЛидаПочта.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаДанныеЛидаПочта.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЭлектроннаяПочтаЛид", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛидаПочта); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартЭлектроннаяПочтаЛид";
			НовыйЭлемент.Заголовок = "E-mail"; 
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			НаписатьПисьмоКоманда = Форма.Команды.Добавить("смартНаписатьПисьмо");
			НаписатьПисьмоКоманда.Действие = "смартНаписатьПисьмо";
			НаписатьПисьмоКоманда.Отображение = ОтображениеКнопки.Картинка;
			КнопкаНаписатьПисьмо = Форма.Элементы.Добавить("смартНаписатьПисьмо", Тип("КнопкаФормы"), Форма.Элементы.смартГруппаДанныеЛидаПочта);
			КнопкаНаписатьПисьмо.ИмяКоманды = "смартНаписатьПисьмо";
			КнопкаНаписатьПисьмо.Картинка = БиблиотекаКартинок.CRM_НаписатьПисьмо;
			КнопкаНаписатьПисьмо.Ширина = 3;
			КнопкаНаписатьПисьмо.Высота = 1;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартТекстИсточника", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДанныеЛида); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартТекстИсточника";
			НовыйЭлемент.Заголовок = "Текст источника";
			НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
			НовыйЭлемент.Ширина = 100;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		Иначе
			
			МассивРеквизитов = Новый Массив;
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы("БыстрыйВвод_ЗадачаСмартВидЗадачи", 
				Новый ОписаниеТипов("СправочникСсылка.смартВидыЗадач"), , "Вид задачи"));
				
			Форма.ИзменитьРеквизиты(МассивРеквизитов);
		//-- #1929 смарт: Фролов 23.07.2024	
		
		КонецЕсли;
		//-- #1665 смарт: Фролов 04.03.2024
		
		//++ #1654 смарт: Фролов 07.03.2024 //Изменение внешнего вида док. Интерес
		Форма.Элементы.ОжидаемаяВыручка.Заголовок = "Ожидаемая выручка";
		Форма.Элементы.Описание.Заголовок = "Описание потребности";
		Форма.Элементы.Переместить(Форма.Элементы.Описание, Форма.Элементы.ГруппаОсновное, Форма.Элементы.ГруппаОтветственный);

		ГруппаВыручкаТеги = Форма.Элементы.Добавить("смартГруппаВыручкаТеги", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновное);
		ГруппаВыручкаТеги.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаВыручкаТеги.ОтображатьЗаголовок = Ложь;
		ГруппаВыручкаТеги.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаВыручкаТеги.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		ГруппаВыручкаТеги.РастягиватьПоГоризонтали = Истина;

		Форма.Элементы.Переместить(Форма.Элементы.ГруппаВыручка, Форма.Элементы.смартГруппаВыручкаТеги);
		Форма.Элементы.Переместить(Форма.Элементы.ОблакоТегов, Форма.Элементы.смартГруппаВыручкаТеги);
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаВыручкаТеги, Форма.Элементы.ГруппаОсновное, Форма.Элементы.ГруппаВыручка);

		Форма.Элементы.ГруппаВыручка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		Форма.Элементы.ОблакоТегов.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		//-- #1654 смарт: Фролов 07.03.2024
		
		//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
		НовыйЭлемент = Форма.Элементы.Вставить("смартДокументыСЦ", 
			Тип("ПолеФормы"), 
			Форма.Элементы.Описание.Родитель, 
			Форма.Элементы.Описание); 	
			
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДокументыСЦ";
		НовыйЭлемент.Видимость = 
			Форма.Объект.ТипУслуги = ПредопределенноеЗначение("Справочник.CRM_ТипУслуги.ПоставкаРегламентноеОбслуживаниеКлиентов"); 
        //-- #Б-1136 смарт: Мосолов 15.10.2024
		//++ #Б1322 смарт: Шляпников 08.11.2024 / РТО доработки в рамках Доп. гарантии
		НовыйЭлемент.ФормаВыбора = "Документ.смартЗаявкаНаРемонтныеРаботы.Форма.ФормаВыбора";
		//-- #Б1322 смарт: Шляпников 08.11.2024
		
		//++ #1683 смарт: Фролов 14.03.2024 //Быстрое создание Партнера из Интереса.
		ГруппаКлиентИСоздание = Форма.Элементы.Вставить("смартГруппаКлиентИСоздание", Тип("ГруппаФормы"), Форма.Элементы.ГруппаКлиент, Форма.Элементы.ГруппаКИПартнера);
		ГруппаКлиентИСоздание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКлиентИСоздание.ОтображатьЗаголовок = Ложь;
		ГруппаКлиентИСоздание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Форма.Элементы.Переместить(Форма.Элементы.Партнер, Форма.Элементы.смартГруппаКлиентИСоздание);
		Форма.Элементы.Переместить(Форма.Элементы.СоздатьНовогоКлиента, Форма.Элементы.смартГруппаКлиентИСоздание);
		Форма.Элементы.СоздатьНовогоКлиента.Видимость = НЕ ЗначениеЗаполнено(Форма.Объект.Партнер);
		//-- #1683 смарт: Фролов 14.03.2024
		
		//++ #1785 смарт: Фролов 19.04.2024 //Доработка помошника создания Интереса.
		ГруппаВыручкаТеги = Форма.Элементы.Добавить("смартГруппаТипИКвалификация", Тип("ГруппаФормы"), Форма.Элементы.ГруппаТема);
		ГруппаВыручкаТеги.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаВыручкаТеги.ОтображатьЗаголовок = Ложь;
		ГруппаВыручкаТеги.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаВыручкаТеги.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		ГруппаВыручкаТеги.РастягиватьПоГоризонтали = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартИтоговаяКвалификация", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТипИКвалификация); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартИтоговаяКвалификация";
		НовыйЭлемент.Заголовок = "Итоговая квалификация";
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартИтоговаяКвалификацияПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартПредварительнаяКвалификация", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартПредварительнаяКвалификация";
		НовыйЭлемент.Заголовок = "Квалификация"; 
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартИнтересКанал", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартИнтересКанал";
		НовыйЭлемент.Заголовок = "Канал (Интерес)"; 
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартИнтересИсточник", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартИнтересИсточник";
		НовыйЭлемент.Заголовок = "Источник (Интерес)"; 
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		//-- #1785 смарт: Фролов 19.04.2024
		
		//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте
		смартГруппаРегистрацияПользователя = Форма.Элементы.Вставить("смартГруппаРегистрацияПользователя", Тип("ГруппаФормы"), Форма.Элементы.ГруппаКлиент, Форма.Элементы.ГруппаКИПартнера);
		смартГруппаРегистрацияПользователя.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		смартГруппаРегистрацияПользователя.ОтображатьЗаголовок = Ложь;
		смартГруппаРегистрацияПользователя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Форма.Элементы.Переместить(Форма.Элементы.Партнер, смартГруппаРегистрацияПользователя);
		
		ЗаметкиКоманда = Форма.Команды.Добавить("смартПодтвердить");
		ЗаметкиКоманда.Действие = "смартПодтвердитьПользователя";
		ЗаметкиКоманда.Отображение = ОтображениеКнопки.Текст;
		
		Заметки = Форма.Элементы.Добавить("смартПодтвердить", Тип("КнопкаФормы"), смартГруппаРегистрацияПользователя);
		Заметки.ИмяКоманды = "смартПодтвердить";
		Заметки.Заголовок = "Подтвердить";
		
		ЗаметкиКоманда = Форма.Команды.Добавить("смартОтклонить");
		ЗаметкиКоманда.Действие = "смартОтклонитьПользователя";
		ЗаметкиКоманда.Отображение = ОтображениеКнопки.Текст;
		
		Заметки = Форма.Элементы.Добавить("смартОтклонить", Тип("КнопкаФормы"), смартГруппаРегистрацияПользователя);
		Заметки.ИмяКоманды = "смартОтклонить";
		Заметки.Заголовок = "Отклонить";
		
		Если (Форма.Объект.смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте
			ИЛИ Форма.Объект.смартПредварительнаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте)
			И Форма.Объект.смартСтатусРегистрацияПользователяНаСайте = 0 Тогда
			
			Форма.Элементы.смартПодтвердить.Видимость = Истина;
			Форма.Элементы.смартОтклонить.Видимость = Истина;
			
		Иначе
			
			Форма.Элементы.смартПодтвердить.Видимость = Ложь;
			Форма.Элементы.смартОтклонить.Видимость = Ложь;
			
		КонецЕсли;
		//-- #Б-986 смарт: Фролов 23.09.2024
		
		//++ #1884 смарт: Фролов 01.07.2024 //Изменение логики Новый/Старый при ручном создании Интереса на основании партнера
		НовыйЭлемент = Форма.Элементы.Добавить("смартВоронкаНовыеСтарые", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаОсновное);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		
		Если Форма.Объект.смартВоронкаНовые Тогда
			НовыйЭлемент.Заголовок = "Воронка Новые";
		Иначе	
			НовыйЭлемент.Заголовок = "Воронка Старые";
		КонецЕсли;	
		
		НовыйЭлемент.Шрифт = Новый Шрифт( , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 128, 0);
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		//-- #1884 смарт: Фролов 01.07.2024
		
		//++ #1748 смарт: Фролов 05.04.2024 //Переход на единую воронку
		Форма.Элементы.Переместить(Форма.Элементы.ТипУслуги, Форма.Элементы.смартГруппаТипИКвалификация, Форма.Элементы.смартИтоговаяКвалификация);
		Форма.Элементы.ТипУслуги.Вид = ВидПоляФормы.ПолеНадписи;
		Форма.Элементы.ТипУслуги.ШрифтЗаголовка = Новый Шрифт( , , Истина);
		Форма.Элементы.ТипУслуги.Шрифт = Новый Шрифт( , , Истина);
		//-- #1748 смарт: Фролов 05.04.2024
		
		//++ #1813 смарт: Фролов 08.05.2024 //Доработки для удобства использования WhatsApp
		Форма.Элементы.БыстрыйВвод_Чат.Заголовок = "WhatsApp";
		НовыйЭлемент = Форма.Элементы.Добавить("смартДекорацияНетПолучателейЧата", Тип("ДекорацияФормы"), Форма.Элементы.БыстрыйВвод_СтраницаЧат);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "   Нет возможности отправить сообщение WhatsApp!" + Символы.ПС
			+ "Нет Контактных лиц партнера с указанным мобильным телефом!";
		НовыйЭлемент.ЦветТекста = Новый Цвет(255,0,0);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		//-- #1813 смарт: Фролов 08.05.2024
		
		//++ #1830 смарт: Фролов 23.05.2024 //Приведение механизма Заметок в Интересе и Партнере к общему виду.
		Форма.Элементы.БыстрыйВвод_Примечание.Заголовок = "Заметки";
		//-- #1830 смарт: Фролов 23.05.2024
		
		
		
		//++ #1853 смарт: Фролов 06.06.2024 //На форме Интереса переместить реквизит Квалификация.
		ГруппаВыручкаТеги = Форма.Элементы.Вставить("смартГруппаОснованиеИКвалификация", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновное, Форма.Элементы.ДокументОснование);
		ГруппаВыручкаТеги.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаВыручкаТеги.ОтображатьЗаголовок = Ложь;
		ГруппаВыручкаТеги.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаВыручкаТеги.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		ГруппаВыручкаТеги.РастягиватьПоГоризонтали = Истина;
		
		Форма.Элементы.Переместить(Форма.Элементы.ДокументОснование, Форма.Элементы.смартГруппаОснованиеИКвалификация, Неопределено);
		Форма.Элементы.Переместить(Форма.Элементы.смартПредварительнаяКвалификация, Форма.Элементы.смартГруппаОснованиеИКвалификация, Неопределено);
		Форма.Элементы.смартПредварительнаяКвалификация.ТолькоПросмотр = Истина;
		
		Если НЕ ЗначениеЗаполнено(Форма.Объект.ДокументОснование) Тогда
			Форма.Элементы.смартГруппаОснованиеИКвалификация.Видимость = Ложь;	
		КонецЕсли;	
		//-- #1853 смарт: Фролов 06.06.2024
		
		//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаУсловияДопГарантии", Тип("ГруппаФормы"), Форма.Элементы.ГруппаРеквизиты, Форма.Элементы.ГруппаБизнесПроцессаОбъекта);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ЦветФона = WebЦвета.Лимонный;
		НоваяГруппа.Видимость = Ложь;
		
		НоваяДекорация = Форма.Элементы.Добавить("смартКартинкаДопУсловий", Тип("ДекорацияФормы"), НоваяГруппа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Картинка;
		НоваяДекорация.Картинка = БиблиотекаКартинок.CRM_ТипОбращения14;
		НоваяДекорация.РазмерКартинки = РазмерКартинки.РеальныйРазмер; 
		НоваяДекорация.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр; 
		
		НоваяДекорация = Форма.Элементы.Добавить("смартТекстДопУсловий", Тип("ДекорацияФормы"), НоваяГруппа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.РастягиватьПоГоризонтали = Истина;			
		НоваяДекорация.АвтоМаксимальнаяШирина = Ложь;			
		НоваяДекорация.УстановитьДействие("ОбработкаНавигационнойСсылки", "смартТекстДопУсловийОбработкаНавигационнойСсылки"); 
		
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) 
			И ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда   
			
			Если Форма.Элементы.Найти("смартПредварительнаяКвалификация") <> Неопределено Тогда
				Форма.Элементы.смартПредварительнаяКвалификация.Видимость = Ложь;
			КонецЕсли;
			
			Если Форма.Элементы.Найти("смартИтоговаяКвалификация") <> Неопределено Тогда
				Форма.Элементы.смартИтоговаяКвалификация.Видимость = Ложь;
			КонецЕсли;
			
			Если Форма.Элементы.Найти("смартВоронкаНовыеСтарые") <> Неопределено Тогда
				Форма.Элементы.смартВоронкаНовыеСтарые.Видимость = Ложь;
			КонецЕсли;
			
			ДокументОснование = Форма.Объект.ДокументОснование;
			
			ОписаниеСтроки150 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));
			ОписаниеСтроки50 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
			ОписаниеСтроки10 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10));
			
			МассивРеквизитов = Новый Массив;
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКлиент", ОписаниеСтроки150));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКонтрагент", ОписаниеСтроки150));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартОборудование", ОписаниеСтроки150));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСерия", ОписаниеСтроки150));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДатаЗапуска", ОписаниеСтроки50));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДатаТОУКлиента", ОписаниеСтроки50));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартНазваниеТО", ОписаниеСтроки50));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСписокРегламентныхЗапчастей", Новый ОписаниеТипов("ТаблицаЗначений"))); 
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗапчастиНомерСтроки", ОписаниеСтроки10, "смартСписокРегламентныхЗапчастей"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗапчастиАртикул", ОписаниеСтроки50, "смартСписокРегламентныхЗапчастей"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗапчастиНаименование", ОписаниеСтроки150, "смартСписокРегламентныхЗапчастей"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗапчастиКоличество", ОписаниеСтроки10, "смартСписокРегламентныхЗапчастей"));
			
			Форма.ИзменитьРеквизиты(МассивРеквизитов); 
			
			Форма.смартКлиент = ДокументОснование.Клиент;
			Форма.смартКонтрагент = ДокументОснование.Контрагент;
			Форма.смартОборудование = ДокументОснование.Оборудование;
			Форма.смартСерия = ДокументОснование.Серия;
			Форма.смартДатаЗапуска = Формат(ДокументОснование.ДатаПодписанияАктаНаПНР, "ДФ=dd.MM.yyyy"); 
			Форма.смартДатаТОУКлиента = Формат(ДокументОснование.ДатаТОУКлиента, "ДФ=dd.MM.yyyy"); 
			Форма.смартНазваниеТО = ДокументОснование.СрокЗамены; 
			
			Для Каждого СтрокаЗапчастей Из ДокументОснование.Запчасти Цикл
				
				СтрокаФормы = Форма.смартСписокРегламентныхЗапчастей.Добавить();
				СтрокаФормы.смартЗапчастиНомерСтроки = Строка(СтрокаЗапчастей.НомерСтроки);
				СтрокаФормы.смартЗапчастиАртикул = Строка(СтрокаЗапчастей.Запчасть.Артикул);
				СтрокаФормы.смартЗапчастиНаименование = Строка(СтрокаЗапчастей.Запчасть.Наименование);
				СтрокаФормы.смартЗапчастиКоличество = Формат(СтрокаЗапчастей.Количество, "ЧДЦ=3");   
				
			КонецЦикла;
			
			ГруппаДанныеРТО = Форма.Элементы.Добавить("смартГруппаДанныеРТО", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновное);
			ГруппаДанныеРТО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеРТО.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
			ГруппаДанныеРТО.Показать();
			ГруппаДанныеРТО.Заголовок = "Данные из РТО";
			ГруппаДанныеРТО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаДанныеРТО.ШрифтЗаголовка = Новый Шрифт( , 9, , , Истина);
			ГруппаДанныеРТО.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
			ГруппаДанныеРТО.ЦветФона = WEBЦвета.Белый;
			
			ГруппаДанныеРТОГоризонтальная = Форма.Элементы.Добавить("смартГруппаДанныеРТОГоризонтальная", Тип("ГруппаФормы"), ГруппаДанныеРТО);
			ГруппаДанныеРТОГоризонтальная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеРТОГоризонтальная.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеРТОГоризонтальная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			ГруппаДанныеРТОЛево = Форма.Элементы.Добавить("смартГруппаДанныеРТОЛево", Тип("ГруппаФормы"), ГруппаДанныеРТОГоризонтальная);
			ГруппаДанныеРТОЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеРТОЛево.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеРТОЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКлиент", Тип("ПолеФормы"), ГруппаДанныеРТОЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКлиент";
			НовыйЭлемент.Заголовок = "Клиент";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКонтрагент", Тип("ПолеФормы"), ГруппаДанныеРТОЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКонтрагент";
			НовыйЭлемент.Заголовок = "Контрагент";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартОборудование", Тип("ПолеФормы"), ГруппаДанныеРТОЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартОборудование";
			НовыйЭлемент.Заголовок = "Оборудование";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартСерия", Тип("ПолеФормы"), ГруппаДанныеРТОЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартСерия";
			НовыйЭлемент.Заголовок = "Серия";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);
			
			ГруппаДанныеРТОПраво = Форма.Элементы.Добавить("смартГруппаДанныеРТОПраво", Тип("ГруппаФормы"), ГруппаДанныеРТОГоризонтальная);
			ГруппаДанныеРТОПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеРТОПраво.ОтображатьЗаголовок = Ложь;
			ГруппаДанныеРТОПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДатаЗапуска", Тип("ПолеФормы"), ГруппаДанныеРТОПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартДатаЗапуска";
			НовыйЭлемент.Заголовок = "Дата" + Символы.НПП + "запуска";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);   
			НовыйЭлемент.РастягиватьПоГоризонтали = Истина;

			НовыйЭлемент = Форма.Элементы.Добавить("смартДатаТОУКлиента", Тип("ПолеФормы"), ГруппаДанныеРТОПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартДатаТОУКлиента";
			НовыйЭлемент.Заголовок = "Дата" + Символы.НПП + "ТО" + Символы.НПП + "у" + Символы.НПП + "клиента";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);   
			НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартНазваниеТО", Тип("ПолеФормы"), ГруппаДанныеРТОПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартНазваниеТО";
			НовыйЭлемент.Заголовок = "Название" + Символы.НПП + "ТО";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт( , 9);
			НовыйЭлемент.Шрифт = Новый Шрифт( , 9);   
			НовыйЭлемент.РастягиватьПоГоризонтали = Истина;

			ГруппаДанныеРТОЗапчасти = Форма.Элементы.Добавить("смартГруппаДанныеРТОЗапчасти", Тип("ГруппаФормы"), ГруппаДанныеРТО);
			ГруппаДанныеРТОЗапчасти.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДанныеРТОЗапчасти.ОтображатьЗаголовок = Истина;
			ГруппаДанныеРТОЗапчасти.Заголовок = "Запчасти"; 

			ТаблицаЗапчастей = Форма.Элементы.Добавить("смартСписокРегламентныхЗапчастей", Тип("ТаблицаФормы"), ГруппаДанныеРТОЗапчасти);
			ТаблицаЗапчастей.ПутьКДанным = "смартСписокРегламентныхЗапчастей";
			ТаблицаЗапчастей.Заголовок = "Запчасти"; 
			ТаблицаЗапчастей.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
			ТаблицаЗапчастей.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиНомерСтроки", Тип("ПолеФормы"), ТаблицаЗапчастей); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартСписокРегламентныхЗапчастей.смартЗапчастиНомерСтроки";
			НовыйЭлемент.Заголовок = "№";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиАртикул", Тип("ПолеФормы"), ТаблицаЗапчастей); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартСписокРегламентныхЗапчастей.смартЗапчастиАртикул";
			НовыйЭлемент.Заголовок = "Артикул";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиНаименование", Тип("ПолеФормы"), ТаблицаЗапчастей); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартСписокРегламентныхЗапчастей.смартЗапчастиНаименование";
			НовыйЭлемент.Заголовок = "Наименование";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиКоличество", Тип("ПолеФормы"), ТаблицаЗапчастей); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартСписокРегламентныхЗапчастей.смартЗапчастиКоличество";
			НовыйЭлемент.Заголовок = "Количество";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		//-- #1944 смарт: Мосолов 26.07.2024
		
		//++ #2059 смарт: Мосолов 19.09.2024 // Подсказка для документов Интерес и Заказ клиента при первоначальной продажи Доп. гарантии 
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаПодсказкаДопГарантии", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаУсловияДопГарантии);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Заголовок = Символы.НПП;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
		НоваяГруппа.Объединенная = Истина; 
		
		НоваяДекорация = Форма.Элементы.Добавить("смартТекстПодсказкиДопУсловий", Тип("ДекорацияФормы"), НоваяГруппа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;  
		
		//++ #Б-1248 смарт: Мосолов 29.10.2024 // Дополнить текст Подсказки Доп гарантии
		НоваяДекорация.Заголовок = "Услуга по продлению срока гарантийных условий в отношении поставляемого Оборудования,"
			+ Символы.ПС
			+ "в соответствии с разделом 6 Гарантийные обязательства Договора купли-продажи";
		//-- #Б-1248 смарт: Мосолов 29.10.2024 
			
		НоваяГруппа.Скрыть();
		//-- #2059 смарт: Мосолов 19.09.2024  
		
		//++ #Б-1170 смарт: Фролов 18.10.2024 //Сделать возможным быстрое отражение состоявшегося взаимодействия
		МассивРеквизитов = Новый Массив;
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартПереключательСтатусаВзаимодействия", Новый ОписаниеТипов("Число")));
		
		
		//++ #Б-3588 смарт: Фролов 19.06.2025 //Реализовать инструмент для работы отдела контроля качества. 
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДатаНачалаИнтереса", Новый ОписаниеТипов("Дата", , , , ,  
			Новый КвалификаторыДаты(ЧастиДаты.Дата)), , "ДатаНачала"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДатаЗавершенияИнтереса", Новый ОписаниеТипов("Дата", , , , ,  
			Новый КвалификаторыДаты(ЧастиДаты.Дата)), , "ДатаЗавершенияИнтереса"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДатаАудита", Новый ОписаниеТипов("Дата", , , , ,  
			Новый КвалификаторыДаты(ЧастиДаты.Дата)), , "ДатаАудита"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДнейВРаботке", Новый ОписаниеТипов("Число"), , "ДнейВРаботке"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКоличествоКасаний", Новый ОписаниеТипов("Число"), , "КоличествоКасаний"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКвалификацияПройдена", Новый ОписаниеТипов("Булево"), , "КвалификацияПройдена"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрытСКорректногоЭтапа", Новый ОписаниеТипов("Булево"), , "ЗакрытСКорректногоЭтапа"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВозраженияОтработаны", Новый ОписаниеТипов("Булево"), , "ВозраженияОтработаны"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКомментарийСоответствуетСутиЗвонка", Новый ОписаниеТипов("Булево"), , "КомментарийСоответствуетСутиЗвонка"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартПричинаПровалаКорректна", Новый ОписаниеТипов("Булево"), , "ПричинаПровалаКорректна"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВернутьНаДоработку", Новый ОписаниеТипов("Булево"), , "ВернутьНаДоработку"));
		//++ #Б-3814 смарт: Фролов 14.07.2025 //Доработка механизма Аудита интересов.
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСделкаНаКорректномЭтапеЭтапКвалификации", Новый ОписаниеТипов("Булево"), , "СделкаНаКорректномЭтапе"));
		//-- #Б-3814 смарт: Фролов 14.07.2025
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЧтоСталоПричинойПровала", 
		//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
			//Новый ОписаниеТипов("Справочникссылка.CRM_ПричиныОтказов"), , "ЧтоСталоПричинойПровала"));
			Новый ОписаниеТипов("СписокЗначений"), , "ВыявленныеНарушения"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСледующееКасаниеЗапланировано", Новый ОписаниеТипов("Булево"), , "СледующееКасаниеЗапланировано"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВозраженияОтработаныВедетсяРабота", Новый ОписаниеТипов("Булево"), , "ВозраженияОтработаны"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСделкаНаКорректномЭтапе", Новый ОписаниеТипов("Булево"), , "СделкаНаКорректномЭтапе"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартПрезентацияПроведена", Новый ОписаниеТипов("Булево"), , "ПрезентацияПроведена"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗапланированоАктуальноеВзаимодействие", Новый ОписаниеТипов("Булево"), , "ЗапланированоАктуальноеВзаимодействие"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКомментарийАудитораЭтапКвалификации", 
			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024)), , "смартКомментарийАудитораЭтапКвалификации"));	
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКомментарийАудитораЭтапВедетсяРабота", 
			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024)), , "КомментарийАудитораЭтапВедетсяРабота"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЭтапАудита", 
			Новый ОписаниеТипов("СправочникСсылка.CRM_СостоянияИнтересов"), , "ЭтапАудита"));
			//-- #Б-3718 смарт: Фролов 09.07.2025
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВозраженияКлиента", 
			Новый ОписаниеТипов("Справочникссылка.CRM_ПричиныОтклоненияОбращений"), , "ВозраженияКлиента"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКвалификацияОборудования", 
			Новый ОписаниеТипов("Справочникссылка.смартКвалификацииМенеджеров"), , "КвалификацияОборудования"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСКакогоЭтапаЗакрыт", 
			Новый ОписаниеТипов("СправочникСсылка.CRM_СостоянияИнтересов"), , "СКакогоЭтапаЗакрыт"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКорректныйЭтапВоронки", 
			Новый ОписаниеТипов("СправочникСсылка.CRM_СостоянияИнтересов"), , "КорректныйЭтапВоронки"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВыбраннаяМенеджеромПричинаПровала", 
			Новый ОписаниеТипов("СправочникСсылка.CRM_ПричиныОтказаПоИнтересам"), , "ВыбраннаяМенеджеромПричинаПровала"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВыбраннаяМенеджеромКомментарийПровала", Новый ОписаниеТипов("Строка"), , "ПоследнийКоментарийИзСделки"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВыбраннаяАудиторомПричинаПровала", 
			Новый ОписаниеТипов("СправочникСсылка.CRM_ПричиныОтказаПоИнтересам"), , "ВыбраннаяАудиторомПричинаПровала"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартПоследнийКоментарийИзСделки", Новый ОписаниеТипов("Строка"), , "ПоследнийКоментарийИзСделки"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКомментарийАудитора", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024)), , "КомментарийАудитораx"));
		//-- #Б-3588 смарт: Фролов 20.06.2025
		
		//++ #Б-4170 смарт: Фролов 01.09.2025 //Загрузка в 1С аналитики по звонкам из сервиса DEERAY.
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAY", Новый ОписаниеТипов("ТаблицаЗначений"))); 
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYДата", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), "смартЗвонкиDEERAY", "Дата"));		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYДлительность", Новый ОписаниеТипов("Число"), "смартЗвонкиDEERAY" , "Длительность"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYЦелевой", Новый ОписаниеТипов("Булево"), "смартЗвонкиDEERAY" , "Целевой"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYНапревление", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , "Напревление"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYЭтап", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , "Этап"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYТелефон", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , "Телефон"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYКонтакт", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY", "Контакт"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYСсылка", Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), "смартЗвонкиDEERAY", "Ссылка"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартРезюмеDEERAY", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , ""));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартРезюмеHTMLПредварительныйDEERAY", Новый ОписаниеТипов("Строка"), , ""));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартРезюмеHTMLDEERAY", Новый ОписаниеТипов("Строка"), , ""));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВыбранныйДляПрослушиванияЗвонок", Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), , ""));
		//-- #Б-4170 смарт: Фролов 01.09.2025
		
		//++ #Б-4854 смарт: Фролов 28.10.2025 //Вывод информации по сценариям DEERAY в интересе.
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартРасшифровкаРазговораDEERAY", Новый ОписаниеТипов("ТабличныйДокумент")));
		//++ #Б-5686 смарт: Фролов 11.02.2026 //Доработка отображения данных в 1С из DEERAY.
		//МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТабличныйДокументРезюмеDEERAY", Новый ОписаниеТипов("ТабличныйДокумент")));
		//-- #Б-5686 смарт: Фролов 11.02.2026
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработки", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиСценарий", 
			Новый ОписаниеТипов("СправочникСсылка.смартСценарииDeeray"), "смартДанныеСценариевDEERAYДляОбработки" , "Сценарий"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок", 
			Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), "смартДанныеСценариевDEERAYДляОбработки" , "Телефонный звонок"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиРезюме", 
			Новый ОписаниеТипов("Строка"), "смартДанныеСценариевDEERAYДляОбработки" , "Резюме"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиПроцент", 
			Новый ОписаниеТипов("Число"), "смартДанныеСценариевDEERAYДляОбработки" , "Процент"));
			
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAY", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYСценарий", 
			Новый ОписаниеТипов("СправочникСсылка.смартСценарииDeeray"), "смартДанныеСценариевDEERAY" , "Сценарий"));
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИдентификаторыЗвонковDEERAY", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСценарииDEERAYЗвонок", 
			Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), "смартИдентификаторыЗвонковDEERAY" , "Звонок"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСценарииDEERAYИдентификатор", 
			Новый ОписаниеТипов("Строка"), "смартИдентификаторыЗвонковDEERAY" , "ИмяКолонки"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСценарииDEERAYЗаголовок", 
			Новый ОписаниеТипов("Строка"), "смартИдентификаторыЗвонковDEERAY" , "Заголовок"));
			
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСписокСценариевDEERAY", Новый ОписаниеТипов("СписокЗначений")));
		
		ЗапросСценарии = Новый Запрос(
		"ВЫБРАТЬ
		|	смартДанныеDEERAY.ТелефонныйЗвонок КАК смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок,
		|	смартДанныеСценариевDeeray.Сценарий КАК смартДанныеСценариевDEERAYДляОбработкиСценарий,
		|	смартДанныеDEERAY.Резюме КАК смартДанныеСценариевDEERAYДляОбработкиРезюме,
		|	смартДанныеСценариевDeeray.Процент КАК смартДанныеСценариевDEERAYДляОбработкиПроцент
		|ИЗ
		|	РегистрСведений.смартДанныеDEERAY КАК смартДанныеDEERAY
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартДанныеСценариевDeeray КАК смартДанныеСценариевDeeray
		|		ПО смартДанныеDEERAY.ТелефонныйЗвонок = смартДанныеСценариевDeeray.ТелефонныйЗвонок
		|ГДЕ
		|	смартДанныеDEERAY.ПервыйКонтакт
		|	И смартДанныеDEERAY.Интерес = &Интерес 
		//++ #Б-4956 смарт: Фролов 11.11.2025 //Корректировка отображения данных по сценариям Deeray.
		//|	И НЕ смартДанныеСценариевDeeray.Сценарий.ПометкаУдаления
		//|	И смартДанныеСценариевDeeray.Сценарий.Активно 
		//-- #Б-4956 смарт: Фролов 11.11.2025
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартДанныеDEERAY.ТелефонныйЗвонок.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартСценарииDeeray.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартСценарииDeeray КАК смартСценарииDeeray
		|ГДЕ
		|	НЕ смартСценарииDeeray.ПометкаУдаления
		|	И смартСценарииDeeray.Активно
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартСценарииDeeray.Наименование");
		ЗапросСценарии.УстановитьПараметр("Интерес", Форма.Объект.Ссылка);
		
		МассивРезультатов = ЗапросСценарии.ВыполнитьПакет();
		
		МассивЗвонковПредварительный = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок");
		МассивЗвонков = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗвонковПредварительный);
		
		смартТаблицаЗвонковВременная = Новый ТаблицаЗначений;
		смартТаблицаЗвонковВременная.Колонки.Добавить("смартСценарииDEERAYЗвонок");
		смартТаблицаЗвонковВременная.Колонки.Добавить("смартСценарииDEERAYИдентификатор");
		смартТаблицаЗвонковВременная.Колонки.Добавить("смартСценарииDEERAYЗаголовок");
		
		ИтогоСекунд = 0;
		
		Для Каждого СтрМассивЗвонков Из МассивЗвонков Цикл
			
			СтрсмартТаблицаЗвонковВременная = смартТаблицаЗвонковВременная.Добавить();
			СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYЗвонок = СтрМассивЗвонков;
			СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYИдентификатор = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
			СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYЗаголовок = "" + Формат(СтрМассивЗвонков.Дата, "ДФ=dd.MM.yyyy") 
				+ Символы.ПС + СтрМассивЗвонков.сфпДлительностьЗвонка + " сек";
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы("КолонкаЗвонок_" + СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYИдентификатор,
				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)), "смартДанныеСценариевDEERAY", СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYЗаголовок));
				
			ИтогоСекунд = ИтогоСекунд + СтрМассивЗвонков.сфпДлительностьЗвонка;	
		
		КонецЦикла;
				
		МассивРеквизитов.Добавить(Новый РеквизитФормы("КолонкаЗвонок_Итог",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)), "смартДанныеСценариевDEERAY", ));
		//-- #Б-4854 смарт: Фролов 28.10.2025
		
		//++ #Б-5664 смарт: Фролов 11.02.2026 //Сделать механизм контроля эффективности работы ОКК
		ЗапросВидыИнцидентов = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Наименование КАК Наименование,
		|	Код КАК Код
		|ИЗ
		|	Справочник.смартВидыИнцидентов
		|ГДЕ
		|	Использовать
		//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		|	И Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИнцидентов.ДляИнтересов))
		//-- #Б-5762 смарт: Фролов 18.02.2026
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");

		ВидыИнцидентов = ЗапросВидыИнцидентов.Выполнить().Выбрать();
		Пока ВидыИнцидентов.Следующий() Цикл
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВидИнцидента" + ВидыИнцидентов.Код, Новый ОписаниеТипов("Булево"), , ВидыИнцидентов.Наименование));		
			
		КонецЦикла;
		
		ЗапросВидыРеакций = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Наименование КАК Наименование,
		|	Код КАК Код
		|ИЗ
		|	Справочник.смартВидыРеакцийНаИнцидент
		|ГДЕ
		|	Использовать
		//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		|	И Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыРеакцийНаИнцидент.ДляИнтересов))
		//-- #Б-5762 смарт: Фролов 18.02.2026
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");

		ВидыРеакций = ЗапросВидыРеакций.Выполнить().Выбрать();
		Пока ВидыРеакций.Следующий() Цикл
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВидРеакции" + ВидыРеакций.Код, Новый ОписаниеТипов("Булево"), , ВидыРеакций.Наименование));		
			
		КонецЦикла;
		
		//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
		ЗапросВидыРезультатов = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Наименование КАК Наименование,
		|	Код КАК Код
		|ИЗ
		|	Справочник.смартВидыИтоговыхРезультатовИнцидентов
		|ГДЕ
		|	Использовать
		|	И Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИтоговыхРезультатовИнцидентов.ДляИнтересов))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");

		ВидыРезультатов = ЗапросВидыРезультатов.Выполнить().Выбрать();
		Пока ВидыРезультатов.Следующий() Цикл
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВидРезультата" + ВидыРезультатов.Код, Новый ОписаниеТипов("Булево"), , ВидыРезультатов.Наименование));		
			
		КонецЦикла;
		//-- #Б-6288 смарт: Фролов 02.04.2026
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентУточнение", Новый ОписаниеТипов("Строка"), , "Уточнение")); 
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКтоБудетОповещен", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "КтоБудетОповещен")); 
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКтоОповестил", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "КтоОповестил"));
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентДатаОповещения", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), , "ДатаОповещения"));
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДокументИнцидент", Новый ОписаниеТипов("ДокументСсылка.смартИнцидент"), , "Инцидент"));
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентПринятоеРешение", Новый ОписаниеТипов("Строка"), , "ПринятоеРешение"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентНовыйИнтерес", Новый ОписаниеТипов("ДокументСсылка.CRM_Интерес"), , "НовыйИнтерес"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКтоОтреагировал", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "КтоОтреагировал"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентДатаРеакции", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), , "ДатаРеакции"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентОценкаРаботыОКК", Новый ОписаниеТипов("ПеречислениеСсылка.УровниПроизводительности"), , "ОценкаРаботыОКК"));
		//++ #Б-5762 смарт: Фролов 19.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКомментарийКОценке", Новый ОписаниеТипов("Строка"), , "КомментарийКОценке"));
		//-- #Б-5762 смарт: Фролов 19.02.2026
		//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентИтоговыйРезультат", Новый ОписаниеТипов("Строка"), , "ИтоговыйРезультат"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентДатаРезультата", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), , "ДатаРезультата"));
		//-- #Б-5928 смарт: Фролов 04.03.2026
		//-- #Б-5664 смарт: Фролов 11.02.2026
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов); 
			
		//++ #Б-4854 смарт: Фролов 28.10.2025 //Вывод информации по сценариям DEERAY в интересе.
		Форма.смартДанныеСценариевDEERAYДляОбработки.Загрузить(МассивРезультатов[0].Выгрузить()); 
		
		Для Каждого СтрсмартТаблицаЗвонковВременная Из смартТаблицаЗвонковВременная Цикл
			
			СтрсмартИдентификаторыЗвонковDEERAY = Форма.смартИдентификаторыЗвонковDEERAY.добавить();
			ЗаполнитьЗначенияСвойств(СтрсмартИдентификаторыЗвонковDEERAY, СтрсмартТаблицаЗвонковВременная);
			
		КонецЦикла;
		
		Форма.смартСписокСценариевDEERAY.ЗагрузитьЗначения(МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("Ссылка"));
		//-- #Б-4854 смарт: Фролов 28.10.2025
		
		НовыйЭлемент = Форма.Элементы.Добавить("БыстрыйВвод_ПереключательСтатусаВзаимодействия",Тип("ПолеФормы"), Форма.Элементы.БыстрыйВвод_СтраницаВзаимодействиеОбложка3);
		НовыйЭлемент.ПутьКДанным = "смартПереключательСтатусаВзаимодействия";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
		НовыйЭлемент.Заголовок = " ";
		НовыйЭлемент.ВидПереключателя = ВидПереключателя.Тумблер;
		НовыйЭлемент.ЦветТекста = Новый Цвет(192, 192, 192);
		НовыйЭлемент.ЦветФона = Новый Цвет(248, 248, 255);
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.КоличествоКолонок=2;
		НовыйЭлемент.СписокВыбора.добавить(1,"Запланировать");
		НовыйЭлемент.СписокВыбора.добавить(2,"Отразить результат");
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартПереключательСтатусаВзаимодействияПриИзменении");
		
		Форма.смартПереключательСтатусаВзаимодействия = 2;
		//-- #Б-1170 смарт: Фролов 18.10.2024
		
		//++ #Б-2470 смарт: Фролов 21.02.2025 //Вывод состояния Партнера в Интересе.
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаСостояниеОтветвенного", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаКлиент, Форма.Элементы.ГруппаКИПартнера);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		НоваяГруппа.ЦветФона = Новый Цвет(240, 255, 240);
		
		Форма.Элементы.Переместить(Форма.Элементы.Партнер, Форма.Элементы.смартГруппаСостояниеОтветвенного);
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственногоЗаголовок", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Состояние";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Видимость = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственного", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Видимость = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободнымЗаголовок", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Станет свободным через:";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Видимость = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободным", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Видимость = Ложь;
		//-- #Б-2470 смарт: Фролов 21.02.2025 
		
		//++ #Б-4120 смарт: Фролов 22.08.2025 //Указывать в Партнерах и Интересах, на против ответственных информацию о их отпусках
		НовыйЭлемент = Форма.Элементы.Вставить("смартОтпуск", Тип("ДекорацияФормы"), 
			Форма.Элементы.ГруппаОтветственный);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		ДатаОкончанияОтпуска = смартОбщегоНазначения.смартОпределитьДатуОкончанияОтпуска(Форма.Объект.Ответственный);
		
		Если ЗначениеЗаполнено(ДатаОкончанияОтпуска) Тогда
			
			НовыйЭлемент.Заголовок = "В отпуске до " + Формат(ДатаОкончанияОтпуска, "ДФ=dd.MM.yyyy");
			
		Иначе
			
			НовыйЭлемент.Заголовок = "";
		
		КонецЕсли;
		//++ #Б-4120 смарт: Фролов 22.08.2025 //Описание
				
		//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
		НовыйЭлемент = Форма.Элементы.Вставить("смартПредупреждениеОПревышенииПредельногоСрока", Тип("ДекорацияФормы"), 
			Форма.Элементы.БыстрыйВвод_СтраницаВзаимодействие, Форма.Элементы.БыстрыйВвод_СтраницаВзаимодействиеОбложка4);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Выбранная дата больше " + смартОбщегоНазначения.ПулучитьПредельныйСрокВзаимодействияПоПартнеру(Форма.Объект.Партнер) 
			+ " дней. Взаимодействие будет согласовано РОПом.";
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(255, 0, 0);
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Видимость = Ложь;
		//-- #Б-2208 смарт: Фролов 25.02.2025
		
		//++ #Б-3588 смарт: Фролов 19.06.2025 //Реализовать инструмент для работы отдела контроля качества. 
		Если Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества, смартРуководительCRM") Тогда
		
			НоваяСтраница = Форма.Элементы.Вставить("смартБыстрыйВвод_СтраницаАудит", Тип("ГруппаФормы"), Форма.Элементы.Лента_ПанельКоманд,
				Форма.Элементы.Лента_КомандыЛево);
			НоваяСтраница.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяСтраница.Заголовок = "Аудит";
			НоваяСтраница.Поведение = ПоведениеОбычнойГруппы.Всплывающая;	
			НоваяСтраница.Видимость = Истина;
			НоваяСтраница.ОтображатьЗаголовок = Истина;
			НоваяСтраница.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			НоваяСтраница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяСтраница.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
			НоваяСтраница.ЦветТекстаЗаголовка = Новый Цвет(0, 160, 242);
			НоваяСтраница.ШрифтЗаголовка = Новый Шрифт(Форма.Элементы.БыстрыйВвод_Взаимодействие.Шрифт, 8);
			НоваяСтраница.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			//++ #Б-5664 смарт: Фролов 11.02.2026 //Сделать механизм контроля эффективности работы ОКК
			//++ #Б-3628 смарт: Фролов 25.06.2025 //Ошибка. Не доступна форма "Аудит" в Интересе.
			//НоваяСтраница.ТолькоПросмотр = РольДоступна("смартРуководительCRM");
			//НоваяСтраница.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			//-- #Б-3628 смарт: Фролов 25.06.2025
			//-- #Б-5664 смарт: Фролов 13.02.2026
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Данные по интересу";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 45;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДатаНачалаИнтереса", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитГоризонтальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартДатаНачалаИнтереса";
			НовыйЭлемент.Заголовок = "Дата начала";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДатаЗавершенияИнтереса", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитГоризонтальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартДатаЗавершенияИнтереса";
			НовыйЭлемент.Заголовок = "Дата завершения";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДнейВРаботке", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитГоризонтальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартДнейВРаботке";
			НовыйЭлемент.Заголовок = "В обработке";
			НовыйЭлемент.Ширина = 3;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКоличествоКасаний", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитГоризонтальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКоличествоКасаний";
			НовыйЭлемент.Заголовок = "Касаний";
			НовыйЭлемент.Ширина = 3;
			
			//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницыАудит", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.Страницы;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаАудитКвалификация", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Квалификация";
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаАудитВедетсяРабота", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Ведется работа";
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаАудитЗавершенные", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Завершенные"; 
			
			//++ #Б-5664 смарт: Фролов 11.02.2026 //Сделать механизм контроля эффективности работы ОКК 
			Форма.Элементы.смартГруппаАудитГоризонтальная.ТолькоПросмотр 
				= НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			Форма.Элементы.смартСтраницаАудитКвалификация.ТолькоПросмотр 
				= НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			Форма.Элементы.смартСтраницаАудитВедетсяРабота.ТолькоПросмотр 
				= НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			Форма.Элементы.смартСтраницаАудитЗавершенные.ТолькоПросмотр 
				= НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаАудитИнцидент", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Инцидент";
			
			Форма.Элементы.смартСтраницыАудит.УстановитьДействие("ПриСменеСтраницы", "смартСтраницыАудитПриСменеСтраницы");
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Оповестить об инциденте";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяГруппа.ЦветФона = Новый Цвет(237, 249, 255);
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 70;
			НоваяГруппа.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИнцидентыПробел", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 70;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДокументИнцидент", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИнцидентыПробел); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.ПутьКДанным = "смартДокументИнцидент";
			НовыйЭлемент.Заголовок = "Инцидент";
			НовыйЭлемент.Гиперссылка = Истина;

			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Реакция на инцидент";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяГруппа.ЦветФона = Новый Цвет(255, 237, 233);
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 70;
			НоваяГруппа.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM");
			
			//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИнцидентыПробел2", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 70;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Итоговый результат";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.ЦветФона = Новый Цвет(215, 240, 199);
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 70;
			НоваяГруппа.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM");
			
			//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.	
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатВертикальная1", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентИтоговыйРезультат", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная);
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентИтоговыйРезультат", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная1);
			//-- #Б-6288 смарт: Фролов 03.04.2026
			
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентИтоговыйРезультат";
			НовыйЭлемент.Заголовок = "Итоговый результат";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.Высота = 5;
			НовыйЭлемент.Ширина = 30;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			//-- #Б-5928 смарт: Фролов 04.03.2026
			
			ВидыИнцидентов.Сбросить();
			
			Пока ВидыИнцидентов.Следующий() Цикл
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартВидИнцидента" + ВидыИнцидентов.Код, Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПутьКДанным = "смартВидИнцидента" + ВидыИнцидентов.Код;
				НовыйЭлемент.Заголовок = ВидыИнцидентов.Наименование;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
				
			КонецЦикла;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентУточнение", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентУточнение";
			НовыйЭлемент.Заголовок = "Уточнение";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.Ширина = 35;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеВертикальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКтоБудетОповещен", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная2); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентКтоБудетОповещен";
			НовыйЭлемент.Заголовок = "Кто будет оповещен";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКтоОповестил", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная2); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентКтоОповестил";
			НовыйЭлемент.Заголовок = "Кто оповестил";
			
			//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеГоризонтальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная2);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентДатаОповещения", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная2); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентДатаОповещения";
			НовыйЭлемент.Заголовок = "Дата оповещения";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			Команда = Форма.Команды.Добавить("смартКнопкаОповеститьОбИнциденте");
			Команда.Действие = "смартОповеститьОбИнциденте";
			Команда.Отображение = ОтображениеКнопки.Текст;
			
			смартОповеститьОбИнцидентеКнопка = Форма.Элементы.Вставить("смартКнопкаОповеститьОбИнциденте", Тип("КнопкаФормы"), 
				Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная2);
			смартОповеститьОбИнцидентеКнопка.ИмяКоманды = "смартКнопкаОповеститьОбИнциденте";
			смартОповеститьОбИнцидентеКнопка.Заголовок = "Оповестить";
			смартОповеститьОбИнцидентеКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			смартОповеститьОбИнцидентеКнопка.Доступность = Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
			//-- #Б-5928 смарт: Фролов 04.03.2026
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентПринятоеРешение", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентПринятоеРешение";
			НовыйЭлемент.Заголовок = "Принятое решение";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.Ширина = 30;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			ВидыРеакций.Сбросить();
			
			Пока ВидыРеакций.Следующий() Цикл
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартВидРеакции" + ВидыРеакций.Код, Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная2); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПутьКДанным = "смартВидРеакции" + ВидыРеакций.Код;
				НовыйЭлемент.Заголовок = ВидыРеакций.Наименование;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
				
			КонецЦикла;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентНовыйИнтерес", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентНовыйИнтерес";
			НовыйЭлемент.Заголовок = "Новый интерес";
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентГоризонтальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная3", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная2);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКтоОтреагировал", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная3); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентКтоОтреагировал";
			НовыйЭлемент.Заголовок = "Кто отреагировал";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентДатаРеакции", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная3);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентДатаРеакции";
			НовыйЭлемент.Заголовок = "Дата реакции";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная4", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная2);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
			ВидыРезультатов.Сбросить();
			
			Пока ВидыРезультатов.Следующий() Цикл
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартВидРезультата" + ВидыРезультатов.Код, Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПутьКДанным = "смартВидРезультата" + ВидыРезультатов.Код;
				НовыйЭлемент.Заголовок = ВидыРезультатов.Наименование;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
				
			КонецЦикла;
			
			//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
			//++ #Б-5762 смарт: Фролов 20.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
			//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная4);
			//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная3);
			//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная);
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная1);
			//-- #Б-5928 смарт: Фролов 04.03.2026
			//-- #Б-6288 смарт: Фролов 02.04.2026
			
			//-- #Б-5762 смарт: Фролов 20.02.2026
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентОценкаРаботыОКК";
			НовыйЭлемент.Заголовок = "Оценка работы ОКК";
			НовыйЭлемент.РежимВыбораИзСписка = Истина;
			
			//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
			//НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Идеально, "Идеально");
			//-- #Б-5762 смарт: Фролов 19.02.2026
			НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Отлично, "Отлично");
			НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Хорошо, "Хорошо");
			НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Удовлетворительно, "Удовлетворительно");
			НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Плохо, "Плохо");
			
			//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
			//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
			//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКомментарийКОценке", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная4);
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКомментарийКОценке", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная);
			//-- #Б-5928 смарт: Фролов 04.03.2026
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентКомментарийКОценке";
			НовыйЭлемент.Заголовок = "Комментарий к оценке работы";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.Высота = 3;
			//-- #Б-5762 смарт: Фролов 19.02.2026
			
			Команда = Форма.Команды.Добавить("смартКнопкаОтреагироватьНаИнцидент");
			Команда.Действие = "смартОтреагироватьНаИнцидент";
			Команда.Отображение = ОтображениеКнопки.Текст;
			
			смартОповеститьОбИнцидентеКнопка = Форма.Элементы.Вставить("смартКнопкаОтреагироватьНаИнцидент", Тип("КнопкаФормы"), 
				Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная);
			смартОповеститьОбИнцидентеКнопка.ИмяКоманды = "смартКнопкаОтреагироватьНаИнцидент";
			смартОповеститьОбИнцидентеКнопка.Заголовок = "Отреагировать";
			смартОповеститьОбИнцидентеКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			смартОповеститьОбИнцидентеКнопка.Доступность = Пользователи.РолиДоступны("смартРуководительCRM"); 
			
			//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатГоризонтальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентДатаРезультата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная2); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартИнцидентДатаРезультата";
			НовыйЭлемент.Заголовок = "Дата результата";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			Команда = Форма.Команды.Добавить("смартКнопкаЗаписатьИтоговыйРезультат");
			Команда.Действие = "смартЗаписатьИтоговыйРезультат";
			Команда.Отображение = ОтображениеКнопки.Текст;
			
			смартОповеститьОбИнцидентеКнопка = Форма.Элементы.Вставить("смартКнопкаЗаписатьИтоговыйРезультат", Тип("КнопкаФормы"), 
				Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная2);
			смартОповеститьОбИнцидентеКнопка.ИмяКоманды = "смартКнопкаЗаписатьИтоговыйРезультат";
			смартОповеститьОбИнцидентеКнопка.Заголовок = "Сохранить";
			смартОповеститьОбИнцидентеКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			смартОповеститьОбИнцидентеКнопка.Доступность = Пользователи.РолиДоступны("смартРуководительCRM");
			//-- #Б-5928 смарт: Фролов 04.03.2026
			
			Если НЕ Форма.Объект.Ссылка.Пустая() Тогда
				
				ЗапросДокументИнцидент = Новый Запрос(
				"ВЫБРАТЬ
				|	смартИнцидент.Ссылка КАК Ссылка,
				|	смартИнцидент.Описание КАК Описание,
				|	смартИнцидент.Ответственный КАК Ответственный,
				|	смартИнцидент.Адресат КАК Адресат,
				|	смартИнцидент.Дата КАК Дата,
				|	смартИнцидент.Решение КАК Решение,
				|	смартИнцидент.Оценка КАК Оценка,
				//++ #Б-5762 смарт: Фролов 19.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
				|	смартИнцидент.КомментарийКОценке КАК КомментарийКОценке, 
				//-- #Б-5762 смарт: Фролов 19.02.2026
				//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
				|	смартИнцидент.ИтоговыйРезультат КАК ИтоговыйРезультат,
				|	смартИнцидент.ДатаРезультата КАК ДатаРезультата,
				//-- #Б-5928 смарт: Фролов 05.03.2026
				|	смартИнцидент.НовыйИнтерес КАК НовыйИнтерес,
				|	смартИнцидент.ДатаРеакции КАК ДатаРеакции,
				|	смартИнцидент.КтоОтреагировал КАК КтоОтреагировал,
				|	смартИнцидент.ВидыИнцидентов.(
				|		Ссылка КАК Ссылка,
				|		НомерСтроки КАК НомерСтроки,
				|		ВидИнцидента КАК ВидИнцидента,
				|		ВидИнцидента.Код КАК ВидИнцидентаКод
				|	) КАК ВидыИнцидентов,
				|	смартИнцидент.ВидыРеакцииНаИнцидент.(
				|		Ссылка КАК Ссылка,
				|		НомерСтроки КАК НомерСтроки,
				|		ВидРеакцииНаИнцидент КАК ВидРеакцииНаИнцидент,
				|		ВидРеакцииНаИнцидент.Код КАК ВидРеакцииНаИнцидентКод
				|	) КАК ВидыРеакцииНаИнцидент,
				//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
				|	смартИнцидент.ВидыРезультатов.(
				|		Ссылка КАК Ссылка,
				|		НомерСтроки КАК НомерСтроки,
				|		ВидРезультата КАК ВидРезультата,
				|		ВидРезультата.Код КАК ВидРезультатаКод
				|	) КАК ВидыРезультатов
				//-- #Б-6288 смарт: Фролов 02.04.2026
				|ИЗ
				|	Документ.смартИнцидент КАК смартИнцидент
				|ГДЕ
				|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
				|	И НЕ смартИнцидент.ПометкаУдаления");
				ЗапросДокументИнцидент.УстановитьПараметр("ОбъектИнцидента", Форма.Объект.Ссылка);
				
				Выборка = ЗапросДокументИнцидент.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					Форма.смартИнцидентУточнение = Выборка.Описание;
					Форма.смартИнцидентКтоОповестил = Выборка.Ответственный;
					Форма.смартИнцидентКтоБудетОповещен = Выборка.Адресат;
					Форма.смартИнцидентДатаОповещения = Выборка.Дата;
					Форма.смартИнцидентПринятоеРешение = Выборка.Решение;
					Форма.смартИнцидентОценкаРаботыОКК = Выборка.Оценка;
					//++ #Б-5762 смарт: Фролов 19.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
					Форма.смартИнцидентКомментарийКОценке = Выборка.КомментарийКОценке;
					//-- #Б-5762 смарт: Фролов 19.02.2026
					//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
					Форма.смартИнцидентИтоговыйРезультат = Выборка.ИтоговыйРезультат;
					Форма.смартИнцидентДатаРезультата = Выборка.ДатаРезультата;
					//-- #Б-5928 смарт: Фролов 05.03.2026
					Форма.смартИнцидентНовыйИнтерес = Выборка.НовыйИнтерес;
					Форма.смартИнцидентДатаРеакции = Выборка.ДатаРеакции;
					Форма.смартИнцидентКтоОтреагировал = Выборка.КтоОтреагировал;
					Форма.смартДокументИнцидент = Выборка.Ссылка;
					
					ВыборкаВидыИнцидентов = Выборка.ВидыИнцидентов.Выбрать();
					
					Пока ВыборкаВидыИнцидентов.Следующий() Цикл
						
						Форма["смартВидИнцидента" + ВыборкаВидыИнцидентов.ВидИнцидентаКод] = Истина;	
						
					КонецЦикла;
					
					ВыборкаВидыРеакцииНаИнцидент = Выборка.ВидыРеакцииНаИнцидент.Выбрать();
					
					Пока ВыборкаВидыРеакцииНаИнцидент.Следующий() Цикл
						
						Форма["смартВидРеакции" + ВыборкаВидыРеакцииНаИнцидент.ВидРеакцииНаИнцидентКод] = Истина;	
						
					КонецЦикла;
					
					//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
					ВыборкаВидыРезультатов = Выборка.ВидыРезультатов.Выбрать();
					
					Пока ВыборкаВидыРезультатов.Следующий() Цикл
						
						Форма["смартВидРезультата" + ВыборкаВидыРезультатов.ВидРезультатаКод] = Истина;	
						
					КонецЦикла;	
					//-- #Б-6288 смарт: Фролов 02.04.2026
					
					Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная.ТолькоПросмотр = Истина;
					Форма.Элементы.смартКнопкаОповеститьОбИнциденте.Доступность = Ложь;
					
					Если ЗначениеЗаполнено(Форма.смартИнцидентДатаРеакции) Тогда
						
						Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная.ТолькоПросмотр = Истина;
						Форма.Элементы.смартКнопкаОтреагироватьНаИнцидент.Доступность = Ложь;
						
					КонецЕсли;	
					
				Иначе	
					
					Форма.Элементы.смартДокументИнцидент.Видимость = Ложь;
					Форма.смартИнцидентКтоОповестил = Пользователи.ТекущийПользователь();
					
					Если ЗначениеЗаполнено(Форма.Объект.Ответственный) Тогда
						
						ЗапросРуководитель = Новый Запрос(
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
						|ИЗ
						|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
						|		ПО (Пользователи.Подразделение.смартИсполнительОтПодразделения = ИсполнителиЗадач.РольИсполнителя)
						|ГДЕ
						|	Пользователи.Ссылка = &Ссылка");
						ЗапросРуководитель.УстановитьПараметр("Ссылка", Форма.Объект.Ответственный);
						
						ВыборкаРуководитель = ЗапросРуководитель.Выполнить().Выбрать();
						
						Если ВыборкаРуководитель.Следующий() Тогда
							
							Форма.смартИнцидентКтоБудетОповещен = ВыборкаРуководитель.Исполнитель;		
							
						КонецЕсли;	
							
					КонецЕсли;	
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Форма.смартИнцидентОценкаРаботыОКК) Тогда
					Форма.смартИнцидентОценкаРаботыОКК = Перечисления.УровниПроизводительности.Хорошо;
				КонецЕсли;	
				
			КонецЕсли;
			//-- #Б-5664 смарт: Фролов 11.02.2026
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитКритерииОцениванияКвалификация", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитКвалификация);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Критерии оценивания";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКвалификацияПройденаКвалификация", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияКвалификация); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартКвалификацияПройдена";
			НовыйЭлемент.Заголовок = "Квалификация пройдена";
			
			//++ #Б-3814 смарт: Фролов 14.07.2025 //Доработка механизма Аудита интересов.
			НовыйЭлемент = Форма.Элементы.Добавить("смартСделкаНаКорректномЭтапеЭтапКвалификации", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияКвалификация); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартСделкаНаКорректномЭтапеЭтапКвалификации";
			НовыйЭлемент.Заголовок = "Сделка на корректном этапе";
			//-- #Б-3814 смарт: Фролов 14.07.2025	

			НовыйЭлемент = Форма.Элементы.Добавить("смартСледующееКасаниеЗапланировано", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияКвалификация); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартСледующееКасаниеЗапланировано";
			НовыйЭлемент.Заголовок = "Следующее касание запланировано";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКомментарийАудитораЭтапКвалификации", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияКвалификация); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКомментарийАудитораЭтапКвалификации";
			НовыйЭлемент.Заголовок = "Комментарий аудитора";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитКритерииОцениванияВедетсяРабота", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитВедетсяРабота);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Критерии оценивания";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартСделкаНаКорректномЭтапе", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияВедетсяРабота); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартСделкаНаКорректномЭтапе";
			НовыйЭлемент.Заголовок = "Сделка на корректном этапе";

			НовыйЭлемент = Форма.Элементы.Добавить("смартПрезентацияПроведена", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияВедетсяРабота); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартПрезентацияПроведена";
			НовыйЭлемент.Заголовок = "Презентация проведена";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВозраженияОтработаныВедетсяРабота", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияВедетсяРабота); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартВозраженияОтработаныВедетсяРабота";
			НовыйЭлемент.Заголовок = "Возражения отработаны";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапланированоАктуальноеВзаимодействие", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияВедетсяРабота); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартЗапланированоАктуальноеВзаимодействие";
			НовыйЭлемент.Заголовок = "Запланировано актуальное взаимодействие";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКомментарийАудитораЭтапВедетсяРабота", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОцениванияВедетсяРабота); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКомментарийАудитораЭтапВедетсяРабота";
			НовыйЭлемент.Заголовок = "Комментарий аудитора";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			//-- #Б-3718 смарт: Фролов 09.07.2025
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитКритерииОценивания", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитЗавершенные);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Критерии оценивания";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКвалификацияПройдена", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОценивания); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартКвалификацияПройдена";
			НовыйЭлемент.Заголовок = "Квалификация пройдена";

			НовыйЭлемент = Форма.Элементы.Добавить("смартЗакрытСКорректногоЭтапа", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОценивания); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартЗакрытСКорректногоЭтапа";
			НовыйЭлемент.Заголовок = "Закрыт с корректного этапа";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВозраженияОтработаны", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОценивания); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартВозраженияОтработаны";
			НовыйЭлемент.Заголовок = "Возражения отработаны";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКомментарийСоответствуетСутиЗвонка", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОценивания); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартКомментарийСоответствуетСутиЗвонка";
			НовыйЭлемент.Заголовок = "Комментарий соответствует сути звонка"; 
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартПричинаПровалаКорректна", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитКритерииОценивания); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартПричинаПровалаКорректна";
			НовыйЭлемент.Заголовок = "Причина провала корректна";
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитОтметкиАудитора", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитЗавершенные);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Отметки аудитора";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Верх;
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 70;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитОтметкиАудитораЛево", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитора);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитОтметкиАудитораПраво", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитора);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКвалификацияОборудования", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКвалификацияОборудования";
			НовыйЭлемент.Заголовок = "Квалификация оборудования";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартСКакогоЭтапаЗакрыт", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартСКакогоЭтапаЗакрыт";
			НовыйЭлемент.Заголовок = "С какого этапа закрыт";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЧтоСталоПричинойПровала", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартЧтоСталоПричинойПровала";
			НовыйЭлемент.Заголовок = "Выявленные нарушения";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартКорректныйЭтапВоронки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКорректныйЭтапВоронки";
			НовыйЭлемент.Заголовок = "Корректный этап воронки";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВыбраннаяМенеджеромПричинаПровала", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартВыбраннаяМенеджеромПричинаПровала";
			НовыйЭлемент.Заголовок = "Выбранная менеджером причина провала";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВыбраннаяАудиторомПричинаПровала", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартВыбраннаяАудиторомПричинаПровала";
			НовыйЭлемент.Заголовок = "Выбранная аудитором причина провала";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВозраженияКлиента", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартВозраженияКлиента";
			НовыйЭлемент.Заголовок = "Возражения клиента";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартПоследнийКоментарийИзСделки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартПоследнийКоментарийИзСделки";
			НовыйЭлемент.Заголовок = "Последний коментарий из сделки";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВыбраннаяМенеджеромКомментарийПровала", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораЛево); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартВыбраннаяМенеджеромКомментарийПровала";
			НовыйЭлемент.Заголовок = "Комментарий провала";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;

			НовыйЭлемент = Форма.Элементы.Добавить("смартКомментарийАудитора", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитОтметкиАудитораПраво); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартКомментарийАудитора";
			НовыйЭлемент.Заголовок = "Комментарий аудитора";
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.Высота = 3;
			НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаАудитНиз", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаАудит);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартДатаАудита", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитНиз); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "смартДатаАудита";
			НовыйЭлемент.Заголовок = "Дата аудита";
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВернутьНаДоработку", Тип("ПолеФормы"), Форма.Элементы.смартГруппаАудитНиз); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "смартВернутьНаДоработку";
			НовыйЭлемент.Заголовок = "Вернуть на доработку";
			
			Команда = Форма.Команды.Добавить("смартКнопкаСохранитьРезультатыАудита");
			Команда.Действие = "смартСохранитьРезультатыАудита";
			Команда.Отображение = ОтображениеКнопки.Текст;
			
			смартСоздатьЗаметкуКнопка = Форма.Элементы.Вставить("смартКнопкаСохранитьРезультатыАудита", Тип("КнопкаФормы"), Форма.Элементы.смартГруппаАудитНиз);
			смартСоздатьЗаметкуКнопка.ИмяКоманды = "смартКнопкаСохранитьРезультатыАудита";
			смартСоздатьЗаметкуКнопка.Заголовок = "Сохранить результаты";
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	смартАудитИнтересовСрезПоследних.КвалификацияПройдена КАК смартКвалификацияПройдена,
			|	смартАудитИнтересовСрезПоследних.ЗакрытСКорректногоЭтапа КАК смартЗакрытСКорректногоЭтапа,
			|	смартАудитИнтересовСрезПоследних.ВозраженияОтработаны КАК смартВозраженияОтработаны,
			|	смартАудитИнтересовСрезПоследних.КомментарийСоответствуетСутиЗвонка КАК смартКомментарийСоответствуетСутиЗвонка,
			|	смартАудитИнтересовСрезПоследних.ПричинаПровалаКорректна КАК смартПричинаПровалаКорректна,
			|	смартАудитИнтересовСрезПоследних.ВернутьНаДоработку КАК смартВернутьНаДоработку,
			|	смартАудитИнтересовСрезПоследних.КвалификацияОборудования КАК смартКвалификацияОборудования,
			|	смартАудитИнтересовСрезПоследних.СКакогоЭтапаЗакрыт КАК смартСКакогоЭтапаЗакрыт,
			|	смартАудитИнтересовСрезПоследних.КорректныйЭтапВоронки КАК смартКорректныйЭтапВоронки,
			|	смартАудитИнтересовСрезПоследних.ВыбраннаяМенеджеромПричинаПровала КАК смартВыбраннаяМенеджеромПричинаПровала,
			|	смартАудитИнтересовСрезПоследних.ВыбраннаяАудиторомПричинаПровала КАК смартВыбраннаяАудиторомПричинаПровала,
			|	смартАудитИнтересовСрезПоследних.КомментарийАудитора КАК смартКомментарийАудитора,
			|	смартАудитИнтересовСрезПоследних.ЧтоСталоПричинойПровала КАК смартЧтоСталоПричинойПровала,
			|	смартАудитИнтересовСрезПоследних.ВозраженияКлиента КАК смартВозраженияКлиента,
			|	смартАудитИнтересовСрезПоследних.Период КАК смартДатаАудита,
			//++ #Б-3814 смарт: Фролов 14.07.2025 //Доработка механизма Аудита интересов.
			|	смартАудитИнтересовСрезПоследних.СделкаНаКорректномЭтапеЭтапКвалификации КАК смартСделкаНаКорректномЭтапеЭтапКвалификации,
			//-- #Б-3814 смарт: Фролов 14.07.2025
			//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
			|	смартАудитИнтересовСрезПоследних.ВозраженияОтработаныВедетсяРабота КАК смартВозраженияОтработаныВедетсяРабота,
			|	смартАудитИнтересовСрезПоследних.СледующееКасаниеЗапланировано КАК смартСледующееКасаниеЗапланировано,
			|	смартАудитИнтересовСрезПоследних.КомментарийАудитораЭтапКвалификации КАК смартКомментарийАудитораЭтапКвалификации,
			|	смартАудитИнтересовСрезПоследних.СделкаНаКорректномЭтапе КАК смартСделкаНаКорректномЭтапе,
			|	смартАудитИнтересовСрезПоследних.ПрезентацияПроведена КАК смартПрезентацияПроведена,
			|	смартАудитИнтересовСрезПоследних.ЗапланированоАктуальноеВзаимодействие КАК смартЗапланированоАктуальноеВзаимодействие,
			|	смартАудитИнтересовСрезПоследних.КомментарийАудитораЭтапВедетсяРабота КАК смартКомментарийАудитораЭтапВедетсяРабота
			//-- #Б-3718 смарт: Фролов 09.07.2025
			|ИЗ
			|	РегистрСведений.смартАудитИнтересов.СрезПоследних(, Интерес = &Интерес) КАК смартАудитИнтересовСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТелефонныйЗвонок.Ссылка) КАК Ссылка
			|ИЗ
			|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
			|ГДЕ
			|	НЕ ТелефонныйЗвонок.ПометкаУдаления
			|	И ТелефонныйЗвонок.Ответственный = &Менеджер
			|	И (ТелефонныйЗвонок.АбонентКонтакт = &Партнер
			|			ИЛИ ТелефонныйЗвонок.АбонентКонтакт.Владелец = &Партнер)
			|	И ТелефонныйЗвонок.Дата >= &ДатаНачала
			|	И ТелефонныйЗвонок.сфпДлительностьЗвонка > 30
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	CRM_СостоянияИнтересов.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
			|ИЗ
			|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
			|ГДЕ
			|	CRM_СостоянияИнтересов.Родитель = &Родитель
			|	И CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.смартКвалификация)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	CRM_ИсторияСостоянийОбращенийСрезПоследних.Состояние КАК смартСКакогоЭтапаЗакрыт,
			|	CRM_ИсторияСостоянийОбращенийСрезПоследних.Состояние.РеквизитДопУпорядочивания КАК ПредыдущееСостояниеРеквизитДопУпорядочивания
			|ИЗ
			|	РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних(
			|			,
			|			(Обращение.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение)
			|				ИЛИ Обращение.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение))
			|				И НЕ ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
			|				И Обращение = &Интерес) КАК CRM_ИсторияСостоянийОбращенийСрезПоследних
			|
			|СГРУППИРОВАТЬ ПО
			|	CRM_ИсторияСостоянийОбращенийСрезПоследних.Состояние,
			|	CRM_ИсторияСостоянийОбращенийСрезПоследних.Состояние.РеквизитДопУпорядочивания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	CRM_Интерес.Дата КАК смартДатаНачалаИнтереса,
			|	CRM_Интерес.ДатаЗакрытия КАК смартДатаЗавершенияИнтереса,
			|	ВЫБОР
			|		КОГДА CRM_Интерес.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(CRM_Интерес.Дата, CRM_Интерес.ДатаЗакрытия, ДЕНЬ)
			|	КОНЕЦ КАК смартДнейВРаботке,
			|	CRM_Интерес.смартИтоговаяКвалификация КАК смартКвалификацияОборудования,
			|	CRM_Интерес.ПричинаОтказа КАК смартВыбраннаяМенеджеромПричинаПровала,
			|	CRM_Интерес.ПричинаОтказаКомментарий КАК смартВыбраннаяМенеджеромКомментарийПровала
			|ИЗ
			|	Документ.CRM_Интерес КАК CRM_Интерес
			|ГДЕ
			|	CRM_Интерес.Ссылка = &Интерес
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия) КАК ДатаЗавершенияВзаимодействия
			|ПОМЕСТИТЬ ПоследнееВзаимодействие
			|ИЗ
			|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
			|ГДЕ
			|	НЕ CRM_Взаимодействие.ПометкаУдаления
			|	И CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
			|	И CRM_Взаимодействие.Ответственный = &Менеджер
			|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
			|	И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия >= &ДатаНачала
			|	И CRM_Взаимодействие.Партнер = &Партнер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	CRM_Взаимодействие.Результат КАК смартПоследнийКоментарийИзСделки
			|ИЗ
			|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследнееВзаимодействие КАК ПоследнееВзаимодействие
			|		ПО CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ПоследнееВзаимодействие.ДатаЗавершенияВзаимодействия
			|ГДЕ
			|	НЕ CRM_Взаимодействие.ПометкаУдаления
			|	И CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
			|	И CRM_Взаимодействие.Ответственный = &Менеджер
			|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
			|	И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия >= &ДатаНачала
			|	И CRM_Взаимодействие.Партнер = &Партнер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	смартСписокНарушенийПоИнтересу.ЧтоСталоПричинойПровала КАК ЧтоСталоПричинойПровала
			|ИЗ
			|	РегистрСведений.смартСписокНарушенийПоИнтересу КАК смартСписокНарушенийПоИнтересу
			|ГДЕ
			|	смартСписокНарушенийПоИнтересу.Интерес = &Интерес");
			Запрос.УстановитьПараметр("СостояниеИнтереса", Форма.Объект.СостояниеИнтереса);
			//-- #Б-3718 смарт: Фролов 09.07.2025
			Запрос.УстановитьПараметр("Интерес", Форма.Объект.Ссылка);
			Запрос.УстановитьПараметр("Партнер", Форма.Объект.Партнер);
			Запрос.УстановитьПараметр("Менеджер", Форма.Объект.Ответственный);
			Запрос.УстановитьПараметр("ДатаНачала", Форма.Объект.Дата);
			Запрос.УстановитьПараметр("Родитель", Справочники.смартПредопределенныеЗначения.Настройки.ОсновнойСценарийИнтереса);
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			ВыборкаОсновная = МассивРезультатов[0].Выбрать();
			ВыборкаКасания = МассивРезультатов[1].Выбрать();
			ВыборкаКвалификация = МассивРезультатов[2].Выбрать();
			ВыборкаЭтапЗакрытия = МассивРезультатов[3].Выбрать();
			ВыборкаИнтерес = МассивРезультатов[4].Выбрать();
			ВыборкаКомментарий = МассивРезультатов[6].Выбрать();
						
			//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
			Форма.смартЧтоСталоПричинойПровала.ТипЗначения = Новый ОписаниеТипов("Справочникссылка.CRM_ПричиныОтказов");

			Форма.смартЧтоСталоПричинойПровала.ЗагрузитьЗначения(МассивРезультатов[7].Выгрузить().ВыгрузитьКолонку("ЧтоСталоПричинойПровала"));
			//-- #Б-3718 смарт: Фролов 09.07.2025
			
			//++ #Б-3874 смарт: Фролов 22.07.2025 //Ошибка в работе с интересами, Аудит
			Если ВыборкаКвалификация.Следующий() Тогда 
				
				ЭтапКвалификация = ВыборкаКвалификация.РеквизитДопУпорядочивания;
				
			Иначе
				
				ЭтапКвалификация = 100000;
				
			КонецЕсли;	
			
			Если ВыборкаЭтапЗакрытия.Следующий() Тогда
				
				ЗаполнитьЗначенияСвойств(Форма, ВыборкаЭтапЗакрытия); 
				
				Если ЗначениеЗаполнено(ЭтапКвалификация) И ЗначениеЗаполнено(ВыборкаЭтапЗакрытия.ПредыдущееСостояниеРеквизитДопУпорядочивания) Тогда
					
					Если ЭтапКвалификация <= ВыборкаЭтапЗакрытия.ПредыдущееСостояниеРеквизитДопУпорядочивания Тогда
						
						Форма.смартКвалификацияПройдена = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			//-- #Б-3874 смарт: Фролов 22.07.2025
			
			Если ВыборкаОсновная.Следующий() Тогда
				
				ЗаполнитьЗначенияСвойств(Форма, ВыборкаОсновная, , "смартЧтоСталоПричинойПровала");
				
				Если НЕ ЗначениеЗаполнено(Форма.смартДатаАудита) Тогда
					
					Форма.смартДатаАудита = ТекущаяДата();
					
				КонецЕсли;
				
				//++ #Б-3718 смарт: Фролов 09.07.2025 //Расширение механизма Аудита Интересов. Аудит на разных этапах.
				Если Форма.смартЧтоСталоПричинойПровала.Количество() = 0 И ЗначениеЗаполнено(ВыборкаОсновная.смартЧтоСталоПричинойПровала) Тогда
					
					Форма.смартЧтоСталоПричинойПровала.Добавить(ВыборкаОсновная.смартЧтоСталоПричинойПровала);	
					
				КонецЕсли;
				//-- #Б-3718 смарт: Фролов 09.07.2025
				
			КонецЕсли;
			
			Если ВыборкаКасания.Следующий() Тогда
				
				Форма.смартКоличествоКасаний = ВыборкаКасания.Ссылка;
				
			КонецЕсли;
			
			Если ВыборкаИнтерес.Следующий() Тогда
				
				ЗаполнитьЗначенияСвойств(Форма, ВыборкаИнтерес);
				
			КонецЕсли;
			
			Если ВыборкаКомментарий.Следующий() Тогда 
				
				ЗаполнитьЗначенияСвойств(Форма, ВыборкаКомментарий);
				
			КонецЕсли;
			
			//++ #Б-4170 смарт: Фролов 01.09.2025 //Загрузка в 1С аналитики по звонкам из сервиса DEERAY.
			НоваяСтраница = Форма.Элементы.Вставить("смартБыстрыйВвод_СтраницаDEERAY", Тип("ГруппаФормы"), Форма.Элементы.Лента_ПанельКоманд,
				Форма.Элементы.Лента_КомандыЛево);
			НоваяСтраница.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяСтраница.Заголовок = "DEERAY";
			НоваяСтраница.Поведение = ПоведениеОбычнойГруппы.Всплывающая;	
			НоваяСтраница.Видимость = Истина;
			НоваяСтраница.ОтображатьЗаголовок = Истина;
			НоваяСтраница.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			НоваяСтраница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяСтраница.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
			НоваяСтраница.ЦветТекстаЗаголовка = Новый Цвет(0, 160, 242);
			НоваяСтраница.ШрифтЗаголовка = Новый Шрифт(Форма.Элементы.БыстрыйВвод_Взаимодействие.Шрифт, 8);
			НоваяСтраница.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
			НоваяСтраница.ТолькоПросмотр = Истина;
			
			//++ #Б-4854 смарт: Фролов 28.10.2025 //Вывод информации по сценариям DEERAY в интересе.
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницыDEERAY", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
			НоваяГруппа.Вид = ВидГруппыФормы.Страницы;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYКвалификация", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAY);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Квалификация";

			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYДанные", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAY);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Все звонки";
			
			//смартТаблицаDEERAY = Форма.Элементы.Добавить("смартТаблицаDEERAY", Тип("ТаблицаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
			смартТаблицаDEERAY = Форма.Элементы.Добавить("смартТаблицаDEERAY", Тип("ТаблицаФормы"), Форма.Элементы.смартСтраницаDEERAYДанные);
			смартТаблицаDEERAY.ПутьКДанным = "смартЗвонкиDEERAY";
			смартТаблицаDEERAY.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
			смартТаблицаDEERAY.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
			смартТаблицаDEERAY.АвтоМаксимальнаяВысота = Ложь;
			смартТаблицаDEERAY.МаксимальнаяВысота = 9;
			смартТаблицаDEERAY.Высота = 9;
			смартТаблицаDEERAY.РастягиватьПоГоризонтали = Ложь;
			смартТаблицаDEERAY.Ширина = 75;
			смартТаблицаDEERAY.РастягиватьПоВертикали = Ложь;
			смартТаблицаDEERAY.Подвал = Ложь;
			смартТаблицаDEERAY.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
			смартТаблицаDEERAY.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина); 
			смартТаблицаDEERAY.Шрифт = Новый Шрифт("Arial", 8);
			смартТаблицаDEERAY.УстановитьДействие("ПриАктивизацииСтроки", "смартТаблицаDEERAYПриАктивизацииСтроки");
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYДата", "смартТаблицаDEERAY", "Дата", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYДата");
			Форма.Элементы.смартЗвонкиDEERAYДата.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYДата.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYДлительность", "смартТаблицаDEERAY", "Длительность", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYДлительность");
			Форма.Элементы.смартЗвонкиDEERAYДлительность.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYДлительность.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYЦелевой", "смартТаблицаDEERAY", "Целевой", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYЦелевой");
			Форма.Элементы.смартЗвонкиDEERAYЦелевой.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYЦелевой.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYНапревление", "смартТаблицаDEERAY", "Напревление", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYНапревление");
			Форма.Элементы.смартЗвонкиDEERAYНапревление.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYНапревление.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYЭтап", "смартТаблицаDEERAY", "Этап", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYЭтап");
			Форма.Элементы.смартЗвонкиDEERAYЭтап.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYЭтап.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYТелефон", "смартТаблицаDEERAY", "Телефон", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYТелефон");
			Форма.Элементы.смартЗвонкиDEERAYТелефон.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYТелефон.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYКонтакт", "смартТаблицаDEERAY", "Контакт", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYКонтакт");
			Форма.Элементы.смартЗвонкиDEERAYКонтакт.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗвонкиDEERAYКонтакт.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартРезюмеDEERAY", "смартТаблицаDEERAY", "Резюме", 1, "смартЗвонкиDEERAY.смартРезюмеDEERAY");
			Форма.Элементы.смартРезюмеDEERAY.Видимость = Ложь;
			Форма.Элементы.смартРезюмеDEERAY.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартПрослушатьРазговорDEERAY", Тип("ДекорацияФормы"), 
				Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
			НовыйЭлемент.Заголовок = "Прослушать разговор";
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.Гиперссылка = Истина; 
			НовыйЭлемент.УстановитьДействие("Нажатие", "смартПрослушатьРазговорНажатие");
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницыDEERAYНиз", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
			НоваяГруппа.Вид = ВидГруппыФормы.Страницы;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYРезюме", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAYНиз);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Резюме";

			НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYРасшифровкаРазговора", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAYНиз);
			НоваяГруппа.Вид = ВидГруппыФормы.Страница;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Расшифровка разговора";
			
			//смартФормированиеИнтерфейса.СздПоле(Форма, "смартРезюмеHTMLDEERAY", "смартСтраницаDEERAYРезюме", "", 6, "смартРезюмеHTMLDEERAY");
			//Форма.Элементы.смартРезюмеHTMLDEERAY.АвтоМаксимальнаяШирина = Ложь;
			//Форма.Элементы.смартРезюмеHTMLDEERAY.РастягиватьПоГоризонтали = Ложь;
			//Форма.Элементы.смартРезюмеHTMLDEERAY.Ширина = 75;
			//Форма.Элементы.смартРезюмеHTMLDEERAY.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
			//++ #Б-5686 смарт: Фролов 11.02.2026 //Доработка отображения данных в 1С из DEERAY.
			//НовыйЭлемент = Форма.Элементы.Добавить("смартТабличныйДокументРезюмеDEERAYПоле", Тип("ПолеФормы"), Форма.Элементы.смартСтраницаDEERAYРезюме); 	
			//НовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
			//НовыйЭлемент.ПутьКДанным = "смартТабличныйДокументРезюмеDEERAY"; 
			НовыйЭлемент = Форма.Элементы.Добавить("смартРезюмеHTMLDEERAYПоле", Тип("ПолеФормы"), Форма.Элементы.смартСтраницаDEERAYРезюме); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			НовыйЭлемент.ПутьКДанным = "смартРезюмеHTMLDEERAY";
			//-- #Б-5686 смарт: Фролов 11.02.2026
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.Ширина = 75;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартРасшифровкаРазговораDEERAYТабДок", Тип("ПолеФормы"), Форма.Элементы.смартСтраницаDEERAYРасшифровкаРазговора); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
			НовыйЭлемент.ПутьКДанным = "смартРасшифровкаРазговораDEERAY";
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.Ширина = 75;
			
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	смартДанныеDEERAY.ТелефонныйЗвонок.Дата КАК смартЗвонкиDEERAYДата,
			|	смартДанныеDEERAY.ТелефонныйЗвонок.сфпДлительностьЗвонка КАК смартЗвонкиDEERAYДлительность,
			|	смартДанныеDEERAY.ЦелевойЗвонок КАК смартЗвонкиDEERAYЦелевой,
			|	смартДанныеDEERAY.ЭтапИнтереса КАК смартЗвонкиDEERAYЭтап,
			|	ВЫБОР
			|		КОГДА смартДанныеDEERAY.ТелефонныйЗвонок.Входящий
			|			ТОГДА ""Входящий""
			|		ИНАЧЕ ""Исходящий""
			|	КОНЕЦ КАК смартЗвонкиDEERAYНапревление,
			|	смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКакСвязаться КАК смартЗвонкиDEERAYТелефон,
			|	ПРЕДСТАВЛЕНИЕ(смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт) КАК смартЗвонкиDEERAYКонтакт,
			|	смартДанныеDEERAY.Резюме КАК смартРезюмеDEERAY,
			|	смартДанныеDEERAY.ТелефонныйЗвонок.Ссылка КАК смартЗвонкиDEERAYСсылка
			|ИЗ
			|	РегистрСведений.смартДанныеDEERAY КАК смартДанныеDEERAY
			|ГДЕ
			|	смартДанныеDEERAY.Интерес = &Интерес
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартДанныеDEERAY.ТелефонныйЗвонок.Дата");
			Запрос.УстановитьПараметр("Интерес", Форма.Объект.Ссылка);
			
			Форма.смартЗвонкиDEERAY.Загрузить(Запрос.Выполнить().Выгрузить());
			
			Форма.смартРезюмеHTMLПредварительныйDEERAY = "
			|<!DOCTYPE html>
			|<html>
			|<head>
			|    <style>
			|        body { font-family: Arial, sans-serif; margin: 4px; }
			|        h1 { color: #2e6c80; }
			|    </style>
			|</head>
			|<body>
			|    <p>ТекстРезюмеHTMLDEERAY</p> 
			|</body>
			|</html>";
			//-- #Б-4170 смарт: Фролов 01.09.2025
			
			смартТаблицаDEERAY = Форма.Элементы.Добавить("смартТаблицаДанныеСценариевDEERAY", Тип("ТаблицаФормы"), Форма.Элементы.смартСтраницаDEERAYКвалификация);
			смартТаблицаDEERAY.ПутьКДанным = "смартДанныеСценариевDEERAY";
			смартТаблицаDEERAY.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
			смартТаблицаDEERAY.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
			смартТаблицаDEERAY.АвтоМаксимальнаяВысота = Ложь;
			смартТаблицаDEERAY.МаксимальнаяВысота = 9;
			смартТаблицаDEERAY.ВысотаШапки = 3;
			смартТаблицаDEERAY.Высота = 9;
			смартТаблицаDEERAY.ТолькоПросмотр = Истина;
			смартТаблицаDEERAY.РастягиватьПоГоризонтали = Ложь;
			смартТаблицаDEERAY.Ширина = 75;
			смартТаблицаDEERAY.РастягиватьПоВертикали = Ложь;
			смартТаблицаDEERAY.Подвал = Ложь;
			смартТаблицаDEERAY.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
			смартТаблицаDEERAY.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина); 
			смартТаблицаDEERAY.Шрифт = Новый Шрифт("Arial", 8);
			смартТаблицаDEERAY.УстановитьДействие("ПриАктивизацииПоля", "смартТаблицаДанныеСценариевDEERAYПриАктивизацииПоля");
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартДанныеСценариевDEERAYСценарий", "смартТаблицаДанныеСценариевDEERAY", "Сценарий", 
				1, "смартДанныеСценариевDEERAY.смартДанныеСценариевDEERAYСценарий");
			Форма.Элементы.смартДанныеСценариевDEERAYСценарий.ТолькоПросмотр = Истина;
			Форма.Элементы.смартДанныеСценариевDEERAYСценарий.ВысотаЗаголовка = 3;
			Форма.Элементы.смартДанныеСценариевDEERAYСценарий.Шрифт = Новый Шрифт("Arial", 8, Истина);
			Форма.Элементы.смартДанныеСценариевDEERAYСценарий.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);		
		
			Для Каждого СтрсмартИдентификаторыЗвонковDEERAY Из Форма.смартИдентификаторыЗвонковDEERAY Цикл
			
				ДобавленныйЗвонок = Форма.Элементы.Добавить("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор, 
					Тип("ПолеФормы"), Форма.Элементы.смартТаблицаДанныеСценариевDEERAY);
				ДобавленныйЗвонок.Вид = ВидПоляФормы.ПолеВвода;
				ДобавленныйЗвонок.ВысотаЗаголовка = 3;
				ДобавленныйЗвонок.Заголовок = СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYЗаголовок; 
				ДобавленныйЗвонок.ПутьКДанным = "смартДанныеСценариевDEERAY" + "." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор;
				ДобавленныйЗвонок.Видимость = Истина;
				ДобавленныйЗвонок.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				ДобавленныйЗвонок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				ДобавленныйЗвонок.РастягиватьПоГоризонтали = Ложь;
				ДобавленныйЗвонок.Шрифт = Новый Шрифт( , 8, Истина);
				ДобавленныйЗвонок.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				ДобавленныйЗвонок.Ширина = 9;
				ДобавленныйЗвонок.АвтоМаксимальнаяШирина = Ложь;
				
				ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор);
				
				ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = 100;
				ЭлементОтбора.Использование = Истина;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 75;
				ЭлементОтбора.Использование = Истина;
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(107, 219, 107)); 
				ЭлементОформления.Использование = Истина;
				
				ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор);
				
				ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = 75;
				ЭлементОтбора.Использование = Истина;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 50;
				ЭлементОтбора.Использование = Истина;
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(177, 241, 177)); 
				ЭлементОформления.Использование = Истина;
				
				ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор);
				
				ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = 50;
				ЭлементОтбора.Использование = Истина;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 25;
				ЭлементОтбора.Использование = Истина;
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(234, 250, 234)); 
				ЭлементОформления.Использование = Истина;
				
			КонецЦикла;
			
			ДобавленныйЗвонок = Форма.Элементы.Добавить("Звонок_Итог", 
				Тип("ПолеФормы"), Форма.Элементы.смартТаблицаДанныеСценариевDEERAY);
			ДобавленныйЗвонок.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйЗвонок.ВысотаЗаголовка = 3;
			ДобавленныйЗвонок.Заголовок = "Итог" + Символы.ПС + Форма.смартИдентификаторыЗвонковDEERAY.Количество() 
				+ Символы.ПС + ИтогоСекунд + " сек."; 
			ДобавленныйЗвонок.ПутьКДанным = "смартДанныеСценариевDEERAY" + "." + "КолонкаЗвонок_Итог";
			ДобавленныйЗвонок.Видимость = Истина;
			ДобавленныйЗвонок.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйЗвонок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйЗвонок.РастягиватьПоГоризонтали = Ложь;
			ДобавленныйЗвонок.Шрифт = Новый Шрифт( , 8, Истина);
			ДобавленныйЗвонок.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
			ДобавленныйЗвонок.Ширина = 9;
			ДобавленныйЗвонок.АвтоМаксимальнаяШирина = Ложь;
			
			ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_Итог");
			
			ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ЭлементОтбора.ПравоеЗначение = 100;
			ЭлементОтбора.Использование = Истина;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементОтбора.ПравоеЗначение = 75;
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(107, 219, 107)); 
			ЭлементОформления.Использование = Истина;
			
			ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_Итог");
			
			ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ЭлементОтбора.ПравоеЗначение = 75;
			ЭлементОтбора.Использование = Истина;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементОтбора.ПравоеЗначение = 50;
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(177, 241, 177)); 
			ЭлементОформления.Использование = Истина;
			
			ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_Итог");
			
			ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ЭлементОтбора.ПравоеЗначение = 50;
			ЭлементОтбора.Использование = Истина;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементОтбора.ПравоеЗначение = 25;
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(234, 250, 234)); 
			ЭлементОформления.Использование = Истина;
			
			Для Каждого СтрсмартСписокСценариевDEERAY Из Форма.смартСписокСценариевDEERAY Цикл
				
				ИтогПроцент = 0;
				
				СтрсмартДанныеСценариевDEERAY = Форма.смартДанныеСценариевDEERAY.Добавить();
				СтрсмартДанныеСценариевDEERAY.смартДанныеСценариевDEERAYСценарий = СтрсмартСписокСценариевDEERAY.Значение;
				
				Для Каждого СтрсмартИдентификаторыЗвонковDEERAY Из Форма.смартИдентификаторыЗвонковDEERAY Цикл
				
					СтрокисмартДанныеСценариевDEERAYДляОбработки = Форма.смартДанныеСценариевDEERAYДляОбработки.НайтиСтроки(
						Новый Структура("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок, смартДанныеСценариевDEERAYДляОбработкиСценарий",
							СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYЗвонок, СтрсмартСписокСценариевDEERAY.Значение)); 
							
						Если СтрокисмартДанныеСценариевDEERAYДляОбработки.Количество() > 0 Тогда
								
							СтрсмартДанныеСценариевDEERAY["КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор] 
								= СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиПроцент;
								
							ИтогПроцент = ?(ИтогПроцент < СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиПроцент, 
								СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиПроцент, ИтогПроцент);
									
						КонецЕсли;	
						
				КонецЦикла;
					
				СтрсмартДанныеСценариевDEERAY["КолонкаЗвонок_Итог"] = ИтогПроцент;
				
				
			КонецЦикла;
			//-- #Б-4854 смарт: Фролов 28.10.2025
			
			//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
			Форма.Элементы.смартТаблицаДанныеСценариевDEERAY.видимость = Ложь;
			//-- #Б-6082 смарт: Фролов 16.03.2026 
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-3588 смарт: Фролов 20.06.2025

	//++ #1465 смарт: Фролов 20.12.2023 //Доработать карточку интереса, заблокировать ЮрФиз
	Если Форма.ИмяФормы="Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая" ТОгда
		ИскомыйЭлемент = Форма.Элементы.Найти("СтрокаПоиска");
		Если ИскомыйЭлемент <> Неопределено Тогда 
			ИскомыйЭлемент.УстановитьДействие("Очистка", "Подключаемый_СвойстваВыполнитьКоманду");
		КонецЕсли;
		Форма.РежимВводаНовогоКлиента=0;
		
		//++ #1785 смарт: Фролов 19.04.2024 //Доработка помошника создания Интереса.
		Форма.Элементы.Переместить(Форма.Элементы.ГруппаРеквизитыИнтересаПравая, Форма.Элементы.ГруппаРеквизитыИнтереса, Форма.Элементы.ГруппаРеквизитыИнтересаЛевая);
		Форма.Элементы.Переместить(Форма.Элементы.Содержание, Форма.Элементы.ГруппаИнтерес, Форма.Элементы.ГруппаСоздатьИнтересКнопка);
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИтоговаяКвалификация", Новый ОписаниеТипов("СправочникСсылка.смартКвалификацииМенеджеров")));
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартИтоговаяКвалификацияПолеФормы", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитыИнтересаПравая, Форма.Элементы.Проект); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартИтоговаяКвалификация";
		НовыйЭлемент.Заголовок 					= "Итоговая квалификация";
		НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		
		Форма.Элементы.Содержание.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.Тема.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.ОжидаемаяДатаПродажи.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.ОжидаемаяВыручка.АвтоОтметкаНезаполненного = Истина;
		//-- #1785 смарт: Фролов 19.04.2024
		
		//++ #1793 смарт: Фролов 25.04.2024 //Доработка помошника создания Интереса, добавление возможности выбора валюты.
		Форма.Элементы.Валюта.Вид = ВидПоляФормы.ПолеВвода;
		Форма.Элементы.Валюта.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.Валюта.Ширина = 5;
		Форма.Элементы.Валюта.РастягиватьПоГоризонтали = Ложь;
		Форма.Элементы.Валюта.АвтоМаксимальнаяШирина = Ложь;
		
		Если Форма.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда
			Форма.смартИтоговаяКвалификация = смартОбщегоНазначения.ВернутьКвалификациюПоТипуПродукта(Справочники.смартТипыПродуктов.Запчасти);	
		ИначеЕсли Форма.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаРасходныеМатериалы Тогда	
			Форма.смартИтоговаяКвалификация = смартОбщегоНазначения.ВернутьКвалификациюПоТипуПродукта(Справочники.смартТипыПродуктов.Расходка);
		Иначе	
			Форма.смартИтоговаяКвалификация = Неопределено;
		КонецЕсли;	
		
		//-- #1793 смарт: Фролов 25.04.2024
		
		//++ #Б-3500 смарт: Фролов 07.07.2025 //Создание интереса в ручную, дубли контрагентов
		Форма.Элементы.Контрагент_ОбъектЮрФизЛицо.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM");
		Форма.Элементы.Переместить(Форма.Элементы.БизнесРегион, Форма.Элементы.ГруппаРеквизитыКлиентаПравая);
		Форма.Элементы.БизнесРегион.АвтоМаксимальнаяШирина = Истина;
		//-- #Б-3500 смарт: Фролов 07.07.2025
		
	КонецЕсли;
	//-- #Задача смарт: Фролов 20.12.2023
	
	//++ #1607 смарт: Фролов 18.01.2024 //Ограничения в форме интереса на установку цен
	Если Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая" Тогда
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(Новый ПараметрВыбора("ВыводитьПроизвольныйВидЦен", Ложь));
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ИспользоватьПриПродаже", Истина));
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыДействияВидовЦен.Действует));
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Форма.Элементы.ТоварыВидЦены.ПараметрыВыбора = НовыеПараметры;
		Форма.Элементы.ГруппаПерезаполнитьОжидаемуюВыручку.Видимость = Ложь;
	КонецЕсли;
	//-- #1607 смарт: Фролов 18.01.2024  
	
	//++ #1615 смарт: Мосолов 25.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартМенеджерПоРасходнымМатериалам", Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартОсновнойМенеджерСервисЦентра", Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);   
		
		//Частное лицо
		НовыйЭлемент = Форма.Элементы.Вставить("смартМенеджерПоРасходнымМатериаламЧастноеЛицо", Тип("ПолеФормы"), 
											Форма.Элементы.ГруппаМенеджерБизнесРегионЧастноеЛицо, Форма.Элементы.БизнесРегионЧастноеЛицо); 
											
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартМенеджерПоРасходнымМатериалам";
		//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Ложь;
		//--#1615 смарт: Лопато 08.02.2024
		НовыйЭлемент.Заголовок 					= "Менеджер по расходным материалам"; 
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОсновнойМенеджерСервисЦентраЧастноеЛицо", Тип("ПолеФормы"), 
											Форма.Элементы.ГруппаМенеджерБизнесРегионЧастноеЛицо, Форма.Элементы.БизнесРегионЧастноеЛицо); 
											
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартОсновнойМенеджерСервисЦентра";
		НовыйЭлемент.Заголовок 					= "Основной менеджер сервис-центра";
		
		//Компания
		НовыйЭлемент = Форма.Элементы.Вставить("смартМенеджерПоРасходнымМатериаламКомпания", Тип("ПолеФормы"), 
											Форма.Элементы.ГруппаОсновнойМенеджерРодитель, Форма.Элементы.Родитель); 
											
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартМенеджерПоРасходнымМатериалам";
		//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Ложь;
		//--#1615 смарт: Лопато 08.02.2024
		НовыйЭлемент.Заголовок 					= "Менеджер по расходным материалам"; 
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОсновнойМенеджерСервисЦентраКомпания", Тип("ПолеФормы"), 
											Форма.Элементы.ГруппаОсновнойМенеджерРодитель, Форма.Элементы.Родитель); 
											
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартОсновнойМенеджерСервисЦентра";
		НовыйЭлемент.Заголовок 					= "Основной менеджер сервис-центра"; 
		
		Форма.Элементы.ОсновнойМенеджерЧастноеЛицо.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.ОсновнойМенеджер.АвтоОтметкаНезаполненного 			 = Истина;
		Форма.Элементы.БизнесРегионЧастноеЛицо.АвтоОтметкаНезаполненного 	 = Истина;
		Форма.Элементы.БизнесРегион.АвтоОтметкаНезаполненного 			     = Истина; 
		
		Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			Форма.Элементы.ЭтоКомпания.Видимость 			     		     = Ложь; 
		КонецЕсли;
		
	КонецЕсли; 	
	//-- #1615 смарт: Мосолов 25.01.2024
	
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаБыстрогоВвода" Тогда
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартМенеджерПоРасходнымМатериалам", Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартОсновнойМенеджерСервисЦентра", Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);   
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартМенеджерПоРасходнымМатериаламКомпания", Тип("ПолеФормы"), Форма.Элементы.ГруппаОтрасльМенеджер); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартМенеджерПоРасходнымМатериалам";
		//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Ложь;
		//--#1615 смарт: Лопато 08.02.2024
		НовыйЭлемент.Заголовок 					= "Менеджер по расходным материалам"; 
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОсновнойМенеджерСервисЦентраКомпания", Тип("ПолеФормы"), Форма.Элементы.ГруппаОтрасльМенеджер); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартОсновнойМенеджерСервисЦентра";
		НовыйЭлемент.Заголовок 					= "Основной менеджер сервис-центра"; 
		
		Форма.Элементы.БизнесРегион.АвтоОтметкаНезаполненного 			     = Истина;
		Форма.Элементы.ОсновнойМенеджер.АвтоОтметкаНезаполненного 			 = Истина;
		
		Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			Форма.Элементы.ВидПартнера.Видимость 			 				 = Ложь; 
		КонецЕсли;
		
	КонецЕсли; 	
	//-- #1615 смарт: Мосолов 29.01.2024
	
	//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы 
	// Для бизнес-регионов определим действия
	ИскомыйЭлемент = Форма.Элементы.Найти("БизнесРегион");
	
	Если ИскомыйЭлемент <> Неопределено И ИскомыйЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда 
		
		ИскомыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_СвойстваВыполнитьКоманду");  
		ИскомыйЭлемент.УстановитьДействие("АвтоПодбор", "смартБизнесРегионАвтоПодбор");  
		ИскомыйЭлемент.УстановитьДействие("ОбработкаВыбора", "смартБизнесРегионОбработкаВыбора"); 
		ИскомыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
	КонецЕсли; 
	//-- #1537 смарт: Мосолов 26.12.2023    
	
	//++ #1692 смарт: Мосолов 21.03.2024 // Добавить возможность выбирать контактное лицо другого клиента в Заказе
	Если Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаВыбора" Тогда
		
		МассивРеквизитов = Новый Массив; 
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДобавлятьКонтактыДругогоКлиента", Новый ОписаниеТипов("Булево"), "", "из другого клиента"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКлиентНеПоДокументу", Новый ОписаниеТипов("СправочникСсылка.партнеры"), "", "Клиент"));

		Форма.ИзменитьРеквизиты(МассивРеквизитов); 
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартДобавлятьКонтактыДругогоКлиента", Тип("ПолеФормы"));
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКданным = "смартДобавлятьКонтактыДругогоКлиента";
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартДобавлятьКонтактыДругогоКлиентаПриИзменении"); 
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартКлиентНеПоДокументу", Тип("ПолеФормы"));
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКданным = "смартКлиентНеПоДокументу";
        НовыйЭлемент.Видимость = Ложь;
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартКлиентНеПоДокументуПриИзменении"); 
		
	КонецЕсли;
	//-- #1692 смарт: Мосолов 21.03.2024 
	
	//++ #1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц
	Если Форма.ИмяФормы = "Справочник.Пользователи.Форма.CRM_ФормаЭлемента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартДоступныДанныеВнутреннихФизическихЛиц", Тип("ПолеФормы"), Форма.Элементы.ГруппаНаименование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДоступныДанныеВнутреннихФизическихЛиц";
		НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартДоступныДанныеВнешнихФизическихЛиц", Тип("ПолеФормы"), Форма.Элементы.ГруппаНаименование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДоступныДанныеВнешнихФизическихЛиц";
		НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;

	КонецЕсли;
	//-- #1644 смарт: Ермаков 19.04.2024  
	
	//++ #1686 смарт: Мосолов 18.03.2024 // Создать механизм ручного резервирования товаров (временного вывода из оборота) 
	Если Форма.ИмяФормы = "Документ.КорректировкаРегистров.Форма.ФормаСписка" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартВыводТоваровИзОборота", Тип("ПолеФормы"), Форма.Элементы.Список);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Список.смартВыводТоваровИзОборота";

	КонецЕсли;
	//-- #1686 смарт: Мосолов 18.03.2024 
	
	//++ #1813 смарт: Фролов 08.05.2024 //Доработки для удобства использования WhatsApp
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая" Тогда
		
		Форма.Элементы.БыстрыйВвод_Чат.Заголовок = "WhatsApp";
		НовыйЭлемент = Форма.Элементы.Добавить("смартДекорацияНетПолучателейЧата", Тип("ДекорацияФормы"), Форма.Элементы.БыстрыйВвод_СтраницаЧат);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "   Нет возможности отправить сообщение WhatsApp!" + Символы.ПС
			+ "Нет Контактных лиц партнера с указанным мобильным телефом!";
		НовыйЭлемент.ЦветТекста = Новый Цвет(255,0,0);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		
		//++ #1830 смарт: Фролов 23.05.2024 //Приведение механизма Заметок в Интересе и Партнере к общему виду.
		Форма.Элементы.БыстрыйВвод_Примечание.Заголовок = "Заметки";
		//-- #1830 смарт: Фролов 23.05.2024
		
		//++ #1920 смарт: Фролов 12.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрепленОтветственный", Новый ОписаниеТипов("Булево"), , "Закреплен"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрепленОтветственныйПоРасхМатериалам", Новый ОписаниеТипов("Булево"), , "Закреплен"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрепленОтветственныйСервЦентра", Новый ОписаниеТипов("Булево"), , "Закреплен"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрепленОтветственныйДата", Новый ОписаниеТипов("Дата", , , КвалификаторыДаты), , ));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрепленОтветственныйРМДата", Новый ОписаниеТипов("Дата", , , КвалификаторыДаты), , ));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗакрепленОтветственныйСЦДата", Новый ОписаниеТипов("Дата", , , КвалификаторыДаты), , ));
		//++ #Б-5472 смарт: Фролов 27.01.2026 //Создание механизма приоритезации партнеров.
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартПриоритетОтветственный", Новый ОписаниеТипов("СправочникСсылка.Приоритеты"), , "Приоритет"));
		//-- #Б-5472 смарт: Фролов 27.01.2026
		
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("БыстрыйВвод_ЗадачаСмартВидЗадачи", 
			Новый ОписаниеТипов("СправочникСсылка.смартВидыЗадач"), , "Вид задачи"));
		//-- #1929 смарт: Фролов 23.07.2024	
		
		//++ #Б-1008 смарт: Фролов 01.10.2024 //Доработка функционала Рабочего стола сотрудника
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартКлючОткрываемойАктивности", 
			Новый ОписаниеТипов(), , "Ключ открываемой активости (смарт)"));
		//-- #Б-1008 смарт: Фролов 01.10.2024	
		
		//++ #Б-1170 смарт: Фролов 18.10.2024 //Сделать возможным быстрое отражение состоявшегося взаимодействия
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартПереключательСтатусаВзаимодействия", Новый ОписаниеТипов("Число")));
		//-- #Б-1170 смарт: Фролов 18.10.2024
		
		//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
		ЗапросВидыИнцидентов = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Наименование КАК Наименование,
		|	Код КАК Код
		|ИЗ
		|	Справочник.смартВидыИнцидентов
		|ГДЕ
		|	Использовать
		|	И Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИнцидентов.ДляПартнеров))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");

		ВидыИнцидентов = ЗапросВидыИнцидентов.Выполнить().Выбрать();
		Пока ВидыИнцидентов.Следующий() Цикл
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартВидИнцидента" + ВидыИнцидентов.Код, Новый ОписаниеТипов("Булево"), , ВидыИнцидентов.Наименование));		
			
		КонецЦикла;
		
		ЗапросВидыРеакций = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Наименование КАК Наименование,
		|	Код КАК Код
		|ИЗ
		|	Справочник.смартВидыРеакцийНаИнцидент
		|ГДЕ
		|	Использовать
		|	И Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыРеакцийНаИнцидент.ДляПартнеров))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");

		ВидыРеакций = ЗапросВидыРеакций.Выполнить().Выбрать();
		Пока ВидыРеакций.Следующий() Цикл
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартВидРеакции" + ВидыРеакций.Код, Новый ОписаниеТипов("Булево"), , ВидыРеакций.Наименование));		
			
		КонецЦикла;
		
		//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
		ЗапросВидыРезультатов = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Наименование КАК Наименование,
		|	Код КАК Код
		|ИЗ
		|	Справочник.смартВидыИтоговыхРезультатовИнцидентов
		|ГДЕ
		|	Использовать
		|	И Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИтоговыхРезультатовИнцидентов.ДляПартнеров))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");

		ВидыРезультатов = ЗапросВидыРезультатов.Выполнить().Выбрать();
		Пока ВидыРезультатов.Следующий() Цикл
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартВидРезультата" + ВидыРезультатов.Код, Новый ОписаниеТипов("Булево"), , ВидыРезультатов.Наименование));		
			
		КонецЦикла;
		//-- #Б-6288 смарт: Фролов 02.04.2026
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентУточнение", Новый ОписаниеТипов("Строка"), , "Уточнение")); 
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКтоБудетОповещен", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "КтоБудетОповещен")); 
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКтоОповестил", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "КтоОповестил"));
			КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентДатаОповещения", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), , "ДатаОповещения"));
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДокументИнцидент", Новый ОписаниеТипов("ДокументСсылка.смартИнцидент"), , "Инцидент"));
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентПринятоеРешение", Новый ОписаниеТипов("Строка"), , "ПринятоеРешение"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКтоОтреагировал", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "КтоОтреагировал"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентДатаРеакции", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), , "ДатаРеакции"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентОценкаРаботыОКК", Новый ОписаниеТипов("ПеречислениеСсылка.УровниПроизводительности"), , "ОценкаРаботыОКК"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентКомментарийКОценке", Новый ОписаниеТипов("Строка"), , "КомментарийКОценке"));
		//-- #Б-5762 смарт: Фролов 18.02.2026
		//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентИтоговыйРезультат", Новый ОписаниеТипов("Строка"), , "ИтоговыйРезультат"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИнцидентДатаРезультата", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), , "ДатаРезультата"));
		//-- #Б-5928 смарт: Фролов 04.03.2026
		
		//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAY", Новый ОписаниеТипов("ТаблицаЗначений"))); 
			КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYДата", Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты), "смартЗвонкиDEERAY", "Дата"));		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYДлительность", Новый ОписаниеТипов("Число"), "смартЗвонкиDEERAY" , "Длительность"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYЦелевой", Новый ОписаниеТипов("Булево"), "смартЗвонкиDEERAY" , "Целевой"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYНапревление", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , "Напревление"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYЭтап", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , "Этап"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYТелефон", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , "Телефон"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYКонтакт", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY", "Контакт"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартЗвонкиDEERAYСсылка", Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), "смартЗвонкиDEERAY", "Ссылка"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартРезюмеDEERAY", Новый ОписаниеТипов("Строка"), "смартЗвонкиDEERAY" , ""));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартРезюмеHTMLПредварительныйDEERAY", Новый ОписаниеТипов("Строка"), , ""));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартРезюмеHTMLDEERAY", Новый ОписаниеТипов("Строка"), , ""));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартВыбранныйДляПрослушиванияЗвонок", Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), , ""));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартРасшифровкаРазговораDEERAY", Новый ОписаниеТипов("ТабличныйДокумент")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработки", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиСценарий", 
			Новый ОписаниеТипов("СправочникСсылка.смартСценарииDeeray"), "смартДанныеСценариевDEERAYДляОбработки" , "Сценарий"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок", 
			Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), "смартДанныеСценариевDEERAYДляОбработки" , "Телефонный звонок"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиРезюме", 
			Новый ОписаниеТипов("Строка"), "смартДанныеСценариевDEERAYДляОбработки" , "Резюме"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYДляОбработкиПроцент", 
			Новый ОписаниеТипов("Число"), "смартДанныеСценариевDEERAYДляОбработки" , "Процент"));
			
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAY", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДанныеСценариевDEERAYСценарий", 
			Новый ОписаниеТипов("СправочникСсылка.смартСценарииDeeray"), "смартДанныеСценариевDEERAY" , "Сценарий"));
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартИдентификаторыЗвонковDEERAY", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартСценарииDEERAYЗвонок", 
			Новый ОписаниеТипов("ДокументСсылка.ТелефонныйЗвонок"), "смартИдентификаторыЗвонковDEERAY" , "Звонок"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартСценарииDEERAYИдентификатор", 
			Новый ОписаниеТипов("Строка"), "смартИдентификаторыЗвонковDEERAY" , "ИмяКолонки"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартСценарииDEERAYЗаголовок", 
			Новый ОписаниеТипов("Строка"), "смартИдентификаторыЗвонковDEERAY" , "Заголовок"));
			
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартСписокСценариевDEERAY", Новый ОписаниеТипов("СписокЗначений")));
		
		//++ #Б-6100 смарт: Фролов 18.03.2026 //Документ Телефонный звонок. Ошибка доступа.
		УстановитьПривилегированныйРежим(Истина);
		//-- #Б-6100 смарт: Фролов 18.03.2026
		
		ЗапросСценарии = Новый Запрос(
		"ВЫБРАТЬ
		|	смартДанныеDEERAY.ТелефонныйЗвонок КАК смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок,
		|	смартДанныеСценариевDeeray.Сценарий КАК смартДанныеСценариевDEERAYДляОбработкиСценарий,
		|	смартДанныеDEERAY.Резюме КАК смартДанныеСценариевDEERAYДляОбработкиРезюме,
		|	смартДанныеСценариевDeeray.Процент КАК смартДанныеСценариевDEERAYДляОбработкиПроцент
		|ИЗ
		|	РегистрСведений.смартДанныеDeeray КАК смартДанныеDEERAY
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартДанныеСценариевDeeray КАК смартДанныеСценариевDeeray
		|		ПО смартДанныеDEERAY.ТелефонныйЗвонок = смартДанныеСценариевDeeray.ТелефонныйЗвонок
		|ГДЕ
		|	смартДанныеDEERAY.ПервыйКонтакт
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт) = ТИП(Справочник.КонтактныеЛицаПартнеров)
		|				ТОГДА смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт.Владелец = &Партнер
		|			ИНАЧЕ смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт = &Партнер
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартДанныеDEERAY.ТелефонныйЗвонок.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартСценарииDeeray.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартСценарииDeeray КАК смартСценарииDeeray
		|ГДЕ
		|	НЕ смартСценарииDeeray.ПометкаУдаления
		|	И смартСценарииDeeray.Активно
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартСценарииDeeray.Наименование");
		ЗапросСценарии.УстановитьПараметр("Партнер", Форма.Объект.Ссылка);
		
		МассивРезультатов = ЗапросСценарии.ВыполнитьПакет();
		
		МассивЗвонковПредварительный = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок");
		МассивЗвонков = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗвонковПредварительный);
		
		смартТаблицаЗвонковВременная = Новый ТаблицаЗначений;
		смартТаблицаЗвонковВременная.Колонки.Добавить("смартСценарииDEERAYЗвонок");
		смартТаблицаЗвонковВременная.Колонки.Добавить("смартСценарииDEERAYИдентификатор");
		смартТаблицаЗвонковВременная.Колонки.Добавить("смартСценарииDEERAYЗаголовок");
		
		ИтогоСекунд = 0;
		
		Для Каждого СтрМассивЗвонков Из МассивЗвонков Цикл
			
			СтрсмартТаблицаЗвонковВременная = смартТаблицаЗвонковВременная.Добавить();
			СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYЗвонок = СтрМассивЗвонков;
			СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYИдентификатор = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
			СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYЗаголовок = "" + Формат(СтрМассивЗвонков.Дата, "ДФ=dd.MM.yyyy") 
				+ Символы.ПС + СтрМассивЗвонков.сфпДлительностьЗвонка + " сек";
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("КолонкаЗвонок_" + СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYИдентификатор,
				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)), "смартДанныеСценариевDEERAY", СтрсмартТаблицаЗвонковВременная.смартСценарииDEERAYЗаголовок));
				
			ИтогоСекунд = ИтогоСекунд + СтрМассивЗвонков.сфпДлительностьЗвонка;	
		
		КонецЦикла;
		
		//++ #Б-6100 смарт: Фролов 18.03.2026 //Документ Телефонный звонок. Ошибка доступа.
		УстановитьПривилегированныйРежим(Ложь);
		//-- #Б-6100 смарт: Фролов 18.03.2026
				
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("КолонкаЗвонок_Итог",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)), "смартДанныеСценариевDEERAY", ));
		//-- #Б-Задача смарт: Фролов 16.03.2026
			
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
		Форма.смартДанныеСценариевDEERAYДляОбработки.Загрузить(МассивРезультатов[0].Выгрузить()); 
		
		Для Каждого СтрсмартТаблицаЗвонковВременная Из смартТаблицаЗвонковВременная Цикл
			
			СтрсмартИдентификаторыЗвонковDEERAY = Форма.смартИдентификаторыЗвонковDEERAY.добавить();
			ЗаполнитьЗначенияСвойств(СтрсмартИдентификаторыЗвонковDEERAY, СтрсмартТаблицаЗвонковВременная);
			
		КонецЦикла;
		//-- #Б-6082 смарт: Фролов 16.03.2026
		
		Форма.смартСписокСценариевDEERAY.ЗагрузитьЗначения(МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		//++ #Б-1170 смарт: Фролов 18.10.2024 //Сделать возможным быстрое отражение состоявшегося взаимодействия
		НовыйЭлемент = Форма.Элементы.Добавить("БыстрыйВвод_ПереключательСтатусаВзаимодействия",Тип("ПолеФормы"), Форма.Элементы.БыстрыйВвод_СтраницаВзаимодействиеОбложка3);
		НовыйЭлемент.ПутьКДанным = "смартПереключательСтатусаВзаимодействия";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
		НовыйЭлемент.Заголовок = " ";
		НовыйЭлемент.ВидПереключателя = ВидПереключателя.Тумблер;
		НовыйЭлемент.ЦветТекста = Новый Цвет(192, 192, 192);
		НовыйЭлемент.ЦветФона = Новый Цвет(248, 248, 255);
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.КоличествоКолонок=2;
		НовыйЭлемент.СписокВыбора.добавить(1,"Запланировать");
		НовыйЭлемент.СписокВыбора.добавить(2,"Отразить результат");
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартПереключательСтатусаВзаимодействияПриИзменении");
		
		Форма.смартПереключательСтатусаВзаимодействия = 2;
		//-- #Б-1170 смарт: Фролов 18.10.2024
		
		//++ #Б-1008 смарт: Фролов 01.10.2024 //Доработка функционала Рабочего стола сотрудника
		Если Форма.Параметры.Свойство("ПозиционироватьНаВзаимодействие") Тогда
			Форма.смартКлючОткрываемойАктивности = Форма.Параметры.ПозиционироватьНаВзаимодействие;
		КонецЕсли;
		//-- #Б-1008 смарт: Фролов 01.10.2024
		
		//++ #Б-5258 смарт: Фролов 16.12.2025 //Создание механизма сегментации партнеров.
		Если Константы.смартИспользоватьМеханизмСегментацииПартнеров.Получить() Тогда
			
			Форма.Элементы.ГруппаНаименование.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаВидыДеятельностиОбщая", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаНаименование);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			Форма.Элементы.Переместить(Форма.Элементы.НаименованиеПолноеКомпания, Форма.Элементы.ГруппаНаименование, Форма.Элементы.ГруппаРедактированиеФИО);
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартПустаяДекорацияДляНаименования", Тип("ДекорацияФормы"), 
			Форма.Элементы.ГруппаНаименование, Форма.Элементы.НаименованиеПолноеКомпания);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаВидыДеятельности", Тип("ГруппаФормы"),
			Форма.Элементы.смартГруппаВидыДеятельностиОбщая);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Истина;
			НоваяГруппа.Заголовок = "Виды деятельности";
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
			НоваяГруппа.Ширина = 35;
			НоваяГруппа.ШрифтЗаголовка = Новый Шрифт(НовыйЭлемент.Шрифт, , 9, Истина);
			
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаВидыДеятельностиПравая", Тип("ГруппаФормы"),
			Форма.Элементы.смартГруппаВидыДеятельностиОбщая);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			Форма.Элементы.Переместить(Форма.Элементы.Код, Форма.Элементы.смартГруппаВидыДеятельностиПравая);
			Форма.Элементы.Переместить(Форма.Элементы.ОблакоТегов, Форма.Элементы.ГруппаСведения); //Форма.Элементы.смартГруппаВидыДеятельностиПравая); 
			
			//++ #Б-6636 смарт: Фролов 22.04.2026 //В спр.Партнеры реализовать возможность отражения посещения наших мероприятий/выставок.
			ГруппаМероприятий = Форма.Элементы.Добавить("смартГруппаМероприятий", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаВидыДеятельностиПравая);
			ГруппаМероприятий.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаМероприятий.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
			ГруппаМероприятий.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаМероприятий.ОтображатьЗаголовок = Истина;
			ГруппаМероприятий.Заголовок = "Участие в наших мероприятиях (" + Форма.Объект.смартТаблицаМероприятий.Количество() + ")";
			ГруппаМероприятий.Высота = 5;
			ГруппаМероприятий.ШрифтЗаголовка = Новый Шрифт("Arial", 9, Истина);
			ГруппаМероприятий.ЦветТекстаЗаголовка = Новый Цвет(28, 85, 174);
			
			Форма.Элементы.смартГруппаМероприятий.Скрыть();
			
			смартТаблицаМероприятий = Форма.Элементы.Добавить("смартТаблицаМероприятий", 
				Тип("ТаблицаФормы"), ГруппаМероприятий);
			смартТаблицаМероприятий.ПутьКДанным = "Объект.смартТаблицаМероприятий";
			смартТаблицаМероприятий.Отображение = ОтображениеТаблицы.Список;
			смартТаблицаМероприятий.Ширина = 50;
			смартТаблицаМероприятий.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
			смартТаблицаМероприятий.Высота = 1;
			смартТаблицаМероприятий.ВысотаВСтрокахТаблицы = 1;
			смартТаблицаМероприятий.РастягиватьПоГоризонтали = Ложь;
			смартТаблицаМероприятий.Шапка = Ложь;
			смартТаблицаМероприятий.ТолькоПросмотр = НЕ (Пользователи.РолиДоступны("смартМенеджерБэкОфис, смартРуководительCRM") 
				ИЛИ Форма.Объект.ОсновнойМенеджер = Пользователи.ТекущийПользователь());
			
			смартТаблицаМероприятий.УстановитьДействие("ПриИзменении", "смартТаблицаМероприятийПриИзменении");
			
			КолонкаМероприятие = Форма.Элементы.Добавить("смартМероприятие", 
				Тип("ПолеФормы"), смартТаблицаМероприятий);
			КолонкаМероприятие.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаМероприятие.ПутьКДанным = "Объект.смартТаблицаМероприятий.Мероприятие"; 
			
			НоваяКолонка = Форма.Элементы.Добавить("смартМероприятиеДатаНачала", 
				Тип("ПолеФормы"), смартТаблицаМероприятий);
			НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонка.ПутьКДанным = "Объект.смартТаблицаМероприятий.Мероприятие.ДатаНачала";
			НоваяКолонка.Ширина = 7;
			НоваяКолонка.ТолькоПросмотр = Истина;

			НоваяКолонка = Форма.Элементы.Добавить("смартМероприятиеДатаОкончания", 
				Тип("ПолеФормы"), смартТаблицаМероприятий);
			НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонка.ПутьКДанным = "Объект.смартТаблицаМероприятий.Мероприятие.ДатаОкончания";
			НоваяКолонка.Ширина = 7;
			НоваяКолонка.ТолькоПросмотр = Истина;
			//-- #Б-6636 смарт: Фролов 23.04.2026
			
			смартВидыДеятельности = Форма.Элементы.Добавить("смартВидыДеятельности", Тип("ТаблицаФормы"), Форма.Элементы.смартГруппаВидыДеятельности);
			смартВидыДеятельности.ПутьКДанным = "Объект.смартВидыДеятельности";
			смартВидыДеятельности.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
			смартВидыДеятельности.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
			смартВидыДеятельности.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			смартВидыДеятельности.Шапка = Ложь;
			смартВидыДеятельности.ВысотаВСтрокахТаблицы = 1;
			смартВидыДеятельности.АвтоМаксимальнаяВысота = Ложь;
			смартВидыДеятельности.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Истина;
			смартВидыДеятельности.Высота = 1;
			смартВидыДеятельности.РастягиватьПоВертикали = Ложь;
			смартВидыДеятельности.Ширина = 25;
			смартВидыДеятельности.Подвал = Ложь;
			смартВидыДеятельности.ЦветРамки = Новый Цвет(245, 245, 245);
			смартВидыДеятельности.ЦветФона = Новый Цвет(255, 160, 122);
			смартВидыДеятельности.ТолькоПросмотр = Истина;
			смартВидыДеятельности.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
			смартВидыДеятельности.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартВидДеятельности", Тип("ПолеФормы"), Форма.Элементы.смартВидыДеятельности); 	
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартВидыДеятельности.ВидДеятельности";
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ЦветФона = Новый Цвет(255, 160, 122);
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартРедактироватьВидыДеятельности", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаВидыДеятельности);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , 8, Истина);
			НовыйЭлемент.Заголовок = "редактировать";
			НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.Гиперссылка = Истина;
			НовыйЭлемент.Доступность = Форма.Объект.ОсновнойМенеджер = Пользователи.ТекущийПользователь()
				ИЛИ Пользователи.РолиДоступны("смартРуководительCRM");
			НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			НовыйЭлемент.УстановитьДействие("Нажатие", "смартРедактироватьВидыДеятельности");
			
			Форма.Элементы.ГруппаНаименование.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			Форма.Элементы.НаименованиеПолноеКомпания.ВысотаЗаголовка = 0;
			
			ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.смартВидыДеятельности.Имя);
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.смартВидыДеятельности.ВидДеятельности");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловия.Использование = Истина;
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(230, 230, 250)); 
			
		КонецЕсли;	
		//-- #Б-5258 смарт: Фролов 16.12.2025
		
		//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
		НовыйЭлемент = Форма.Элементы.Вставить("смартПредупреждениеОПревышенииПредельногоСрока", Тип("ДекорацияФормы"), 
			Форма.Элементы.БыстрыйВвод_СтраницаВзаимодействие, Форма.Элементы.БыстрыйВвод_СтраницаВзаимодействиеОбложка4);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Выбранная дата больше " + смартОбщегоНазначения.ПулучитьПредельныйСрокВзаимодействияПоПартнеру(Форма.Объект.Ссылка) 
			+ " дней. Взаимодействие будет согласовано РОПом.";
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(255, 0, 0);
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Видимость = Ложь;
		//-- #Б-2208 смарт: Фролов 25.02.2025
		
		Форма.Элементы.ГруппаМенеджер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОтветственныйИЗакрепленный", Тип("ГруппаФормы"), Форма.Элементы.ГруппаМенеджер, Форма.Элементы.ОсновнойМенеджер);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартЗакрепленОтветственный", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленный);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.ПутьКДанным = "смартЗакрепленОтветственный";
		НовыйЭлемент.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.ОсновнойМенеджер);
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартЗакрепленОтветственныйПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗакрепленОтветственныйДата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленный);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗакрепленОтветственныйДата";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.Ширина = 6;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		Форма.Элементы.Переместить(Форма.Элементы.ОсновнойМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленный, Форма.Элементы.смартЗакрепленОтветственный);
		
		//++ #Б-5472 смарт: Фролов 27.01.2026 //Создание механизма приоритезации партнеров.
		НовыйЭлемент = Форма.Элементы.Вставить("смартПриоритетОтветственный", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленный);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;	
		НовыйЭлемент.ПутьКДанным = "Объект.смартПриоритетОтветственный";
		НовыйЭлемент.Ширина = 6;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.Заголовок = "Приоритет";
		НовыйЭлемент.ТолькоПросмотр = НЕ Форма.Объект.ОсновнойМенеджер = Пользователи.ТекущийПользователь() И НЕ Пользователи.ЭтоПолноправныйПользователь();
		
		Форма.Элементы.смартЗакрепленОтветственный.Видимость = Ложь;
		Форма.Элементы.смартЗакрепленОтветственныйДата.Видимость = Ложь; 
		Форма.Элементы.смартГруппаОтветственныйИЗакрепленный.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Верх;
		
		ПутьКРеквизитуПриоритет = "Объект.смартПриоритетОтветственный";
	
		УсловноеОформление = Форма.УсловноеОформление;
		ЭлементыФормы = Форма.Элементы;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы["смартПриоритетОтветственный"].Имя);

		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКРеквизитуПриоритет);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьВысшийПриоритет();

		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ВысокийПриоритетДокумента);

		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы["смартПриоритетОтветственный"].Имя);

		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКРеквизитуПриоритет);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьНизшийПриоритет();

		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НизкийПриоритетДокумента);
		//-- #Б-5472 смарт: Фролов 27.01.2026
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОтветственныйИЗакрепленныйРМ", Тип("ГруппаФормы"), Форма.Элементы.ГруппаМенеджер);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартМенеджерПоРасходнымМатериалам", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;	
		НовыйЭлемент.ПутьКДанным = "Объект.смартМенеджерПоРасходнымМатериалам";
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартЗакрепленОтветственныйПоРасхМатериалам", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.ПутьКДанным = "смартЗакрепленОтветственныйПоРасхМатериалам";
		НовыйЭлемент.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.смартМенеджерПоРасходнымМатериалам);
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартЗакрепленОтветственныйРМПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗакрепленОтветственныйРМДата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗакрепленОтветственныйРМДата";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.Ширина = 6;
		НовыйЭлемент.ТолькоПросмотр = Истина;

		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОтветственныйИЗакрепленныйСЦ", Тип("ГруппаФормы"), Форма.Элементы.ГруппаМенеджер);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОсновнойМенеджерСервисЦентра", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ);
		НовыйЭлемент.Заголовок = "Основной менеджер СЦ (смарт)";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;	
		НовыйЭлемент.ПутьКДанным = "Объект.смартОсновнойМенеджерСервисЦентра";
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартЗакрепленОтветственныйСервЦентра", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.ПутьКДанным = "смартЗакрепленОтветственныйСервЦентра";
		НовыйЭлемент.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.смартОсновнойМенеджерСервисЦентра);
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартЗакрепленОтветственныйСЦПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗакрепленОтветственныйСЦДата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗакрепленОтветственныйСЦДата";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.Ширина = 6;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		Форма.Элементы.ОсновнойМенеджер.УстановитьДействие("ПриИзменении", "смартОсновнойМенеджерПриИзменении");
		Форма.Элементы.смартМенеджерПоРасходнымМатериалам.УстановитьДействие("ПриИзменении", "смартМенеджерПоРасходнымМатериаламПриИзменении");
		Форма.Элементы.смартОсновнойМенеджерСервисЦентра.УстановитьДействие("ПриИзменении", "смартОсновнойМенеджерСервисЦентраПриИзменении");
		
		//++ #Б-5472 смарт: Фролов 27.01.2026 //Создание механизма приоритезации партнеров.
		Форма.Элементы.ОсновнойМенеджер.КнопкаОткрытия = Ложь;
		Форма.Элементы.смартМенеджерПоРасходнымМатериалам.КнопкаОткрытия = Ложь;
		Форма.Элементы.смартОсновнойМенеджерСервисЦентра.КнопкаОткрытия = Ложь;
		//-- #Б-5472 смарт: Фролов 27.01.2026
		
		//++ #Б-4120 смарт: Фролов 22.08.2025 //Указывать в Партнерах и Интересах, на против ответственных информацию о их отпусках
		НовыйЭлемент = Форма.Элементы.Вставить("смартОтпуск", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаОтветственныйИЗакрепленный);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		ДатаОкончанияОтпуска = смартОбщегоНазначения.смартОпределитьДатуОкончанияОтпуска(Форма.Объект.ОсновнойМенеджер);
		
		Если ЗначениеЗаполнено(ДатаОкончанияОтпуска) Тогда
			
			НовыйЭлемент.Заголовок = "В отпуске до " + Формат(ДатаОкончанияОтпуска, "ДФ=dd.MM.yyyy");
			
		Иначе
			
			НовыйЭлемент.Заголовок = "";
		
		КонецЕсли;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОтпускРМ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь; 
		
		ДатаОкончанияОтпуска = смартОбщегоНазначения.смартОпределитьДатуОкончанияОтпуска(Форма.Объект.смартМенеджерПоРасходнымМатериалам);
		
		Если ЗначениеЗаполнено(ДатаОкончанияОтпуска) Тогда
			
			НовыйЭлемент.Заголовок = "В отпуске до " + Формат(ДатаОкончанияОтпуска, "ДФ=dd.MM.yyyy");
			
		Иначе
			
			НовыйЭлемент.Заголовок = "";
		
		КонецЕсли;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОтпускСЦ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		ДатаОкончанияОтпуска = смартОбщегоНазначения.смартОпределитьДатуОкончанияОтпуска(Форма.Объект.смартОсновнойМенеджерСервисЦентра);
		
		Если ЗначениеЗаполнено(ДатаОкончанияОтпуска) Тогда
			
			НовыйЭлемент.Заголовок = "В отпуске до " + Формат(ДатаОкончанияОтпуска, "ДФ=dd.MM.yyyy");
			
		Иначе
			
			НовыйЭлемент.Заголовок = "";
		
		КонецЕсли;
		//-- #Б-4120 смарт: Фролов 22.08.2025
		
		Если Пользователи.РолиДоступны("смартРуководительCRM") Тогда
			
			Форма.Элементы.смартЗакрепленОтветственный.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.ОсновнойМенеджер);
			Форма.Элементы.смартЗакрепленОтветственныйПоРасхМатериалам.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.смартМенеджерПоРасходнымМатериалам);
			Форма.Элементы.смартЗакрепленОтветственныйСервЦентра.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.смартОсновнойМенеджерСервисЦентра);
			
		Иначе
			
			Форма.Элементы.смартЗакрепленОтветственный.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗакрепленОтветственныйПоРасхМатериалам.ТолькоПросмотр = Истина;
			Форма.Элементы.смартЗакрепленОтветственныйСервЦентра.ТолькоПросмотр = Истина;
			
			Если Форма.Объект.ОсновнойМенеджер = ПараметрыСеанса.ТекущийПользователь Тогда
				Форма.Элементы.смартЗакрепленОтветственный.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.ОсновнойМенеджер);
			КонецЕсли;
			
			Если Форма.Объект.смартМенеджерПоРасходнымМатериалам = ПараметрыСеанса.ТекущийПользователь Тогда
				Форма.Элементы.смартЗакрепленОтветственныйПоРасхМатериалам.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.смартМенеджерПоРасходнымМатериалам);
			КонецЕсли;
			
			Если Форма.Объект.смартОсновнойМенеджерСервисЦентра = ПараметрыСеанса.ТекущийПользователь Тогда
				Форма.Элементы.смартЗакрепленОтветственныйСервЦентра.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Форма.Объект.смартОсновнойМенеджерСервисЦентра);
			КонецЕсли;
			
		КонецЕсли;
		
		//++ Временно, до принятия решения отключаем функционал 
		Форма.Элементы.смартЗакрепленОтветственныйПоРасхМатериалам.ТолькоПросмотр = Истина;
		Форма.Элементы.смартЗакрепленОтветственныйСервЦентра.ТолькоПросмотр = Истина;
		Форма.Элементы.смартЗакрепленОтветственный.ТолькоПросмотр = Истина;
		//--
		
		//-- #1920 смарт: Фролов 12.07.2024 
		
		//++ #Б-2354 смарт: Фролов 17.02.2025 //Ввод нового регламента. Вывод данных из регистра состояние партнеров.
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаСостояниеОтветвенного", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленный);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		НоваяГруппа.ЦветФона = Новый Цвет(240, 255, 240);
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственногоЗаголовок", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Состояние";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственного", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободнымЗаголовок", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Станет свободным через:";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободным", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенного);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		//-- #Б-2354 смарт: Фролов 18.02.2025 
			
		//++ #Б-2484 смарт: Фролов 05.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаСостояниеОтветвенногоСЦ", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		НоваяГруппа.ЦветФона = Новый Цвет(240, 255, 240);
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственногоЗаголовокСЦ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоСЦ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Состояние";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственногоСЦ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоСЦ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		//++ #Б-2852 смарт: Фролов 08.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ 
		НовыйЭлемент.Гиперссылка = Истина; 
		НовыйЭлемент.УстановитьДействие("Нажатие", "смартУбратьВАрхивНажатие");
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартПричинаАрхивированияКлиентаСЦ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоСЦ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.ЦветТекста = Новый Цвет(255, 0, 0);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		//-- #Б-2852 смарт: Фролов 08.04.2025
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободнымЗаголовокСЦ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоСЦ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Станет свободным через:";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободнымСЦ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоСЦ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		//-- #Б-2484 смарт: Фролов 05.03.2025
		
		//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаСостояниеОтветвенногоРМ", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		НоваяГруппа.ЦветФона = Новый Цвет(240, 255, 240);
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственногоЗаголовокРМ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоРМ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Состояние";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартСостояниеОтветственногоРМ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоРМ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободнымЗаголовокРМ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоРМ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Станет свободным через:";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйСтанетСвободнымРМ", Тип("ДекорацияФормы"), 
			Форма.Элементы.смартГруппаСостояниеОтветвенногоРМ);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
		НовыйЭлемент.Заголовок = "";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		//-- #Б-2782 смарт: Фролов 25.03.2025
		
		//++ #Б-2754 смарт: Фролов 20.03.2025 //Доработка рабочего места сотрудника.
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаВеделениеСостояниеОтветвенного", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленный);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.ЦветФона = Новый Цвет(255, 228, 225);
		НоваяГруппа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		Форма.Элементы.смартГруппаОтветственныйИЗакрепленный.ЦветФона = Новый Цвет(240, 255, 240);
		
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаОтветственныйИЗакрепленный, Форма.Элементы.смартГруппаВеделениеСостояниеОтветвенного);
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаСостояниеОтветвенного, Форма.Элементы.смартГруппаВеделениеСостояниеОтветвенного);
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаВеделениеСостояниеОтветвенногоСЦ", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.ЦветФона = Новый Цвет(255, 228, 225);
		НоваяГруппа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ.ЦветФона = Новый Цвет(240, 255, 240);
		
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйСЦ, Форма.Элементы.смартГруппаВеделениеСостояниеОтветвенногоСЦ);
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаСостояниеОтветвенногоСЦ, Форма.Элементы.смартГруппаВеделениеСостояниеОтветвенногоСЦ);
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаВеделениеСостояниеОтветвенногоРМ", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаМенеджер, Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяГруппа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ, Форма.Элементы.смартГруппаВеделениеСостояниеОтветвенногоРМ);
		//-- #Б-2754 смарт: Фролов 20.03.2025
		
		//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
		Форма.Элементы.смартГруппаОтветственныйИЗакрепленныйРМ.ЦветФона = Новый Цвет(240, 255, 240);
		Форма.Элементы.Переместить(Форма.Элементы.смартГруппаСостояниеОтветвенногоРМ, Форма.Элементы.смартГруппаВеделениеСостояниеОтветвенногоРМ);
		//-- #Б-2782 смарт: Фролов 25.03.2025
		
		//++ #Б-2816 смарт: Фролов 27.03.2025 //Внешнее оформление ответственных в партнере.
		Форма.Элементы.ОсновнойМенеджер.ШрифтЗаголовка = Новый Шрифт(, , Истина);
		Форма.Элементы.смартОсновнойМенеджерСервисЦентра.ШрифтЗаголовка = Новый Шрифт(, , Истина);
		Форма.Элементы.смартМенеджерПоРасходнымМатериалам.ШрифтЗаголовка = Новый Шрифт(, , Истина);
		
		Форма.Элементы.смартМенеджерПоРасходнымМатериалам.Заголовок = "Ответственный РМ";
		Форма.Элементы.смартОсновнойМенеджерСервисЦентра.Заголовок = "Ответственный СЦ";
		//-- #Б-2816 смарт: Фролов 27.03.2025
		
		//++ #Б-7658 смарт: Фролов 03.08.2026 //Проверить какая роль запрещает менять ответственного РМ и СЦ
		Форма.Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("CRM_ПередачаДелОтветственному");
		Форма.Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("CRM_ПередачаДелОтветственному");
		//-- #Б-7658 смарт: Фролов 03.08.2026
		
		Если НЕ Форма.Объект.Ссылка.Пустая() Тогда
			
			//++ #Б-2354 смарт: Фролов 17.02.2025 //Ввод нового регламента. Вывод данных из регистра состояние партнеров.
			СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Форма.Объект.Ссылка);
			
			Если НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
				
				
				Форма.Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Истина;
				Форма.Элементы.смартОтветственныйСтанетСвободным.Видимость = Истина;
				//-- #Б-Задача смарт: Фролов 18.02.2025
				
				Форма.Элементы.ОсновнойМенеджер.ТолькоПросмотр = НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.НеСвободен
				И НЕ Пользователи.ЭтоПолноправныйПользователь();
				
				//++ #Б-2134 смарт: Лопато 07.02.2025 //Ввод нового регламента. Исключение совершения действий в карточке партнера для не основного менеджера.  
				Если Справочники.смартПредопределенныеЗначения.Настройки.ЗапретВзаимодействийНеОсновнымПользователям Тогда
					
					Если НЕ (Пользователи.РолиДоступны("смартРуководительCRM")
						ИЛИ ПараметрыСеанса.ТекущийПользователь = Форма.Объект.ОсновнойМенеджер
						ИЛИ ПараметрыСеанса.ТекущийПользователь = Форма.Объект.смартМенеджерПоРасходнымМатериалам
						ИЛИ ПараметрыСеанса.ТекущийПользователь = Форма.Объект.смартОсновнойМенеджерСервисЦентра) Тогда
						
						Форма.Элементы.БыстрыйВвод_Взаимодействие.Доступность = Ложь;
						
					КонецЕсли;
					
				КонецЕсли;
				//-- #Б-2134 смарт: Лопато 07.02.2025
				
				//++ #Б-2372 смарт: Фролов 18.02.2025 //Пересчет регистра состояние партнеров при проведении Взаимодействия.	
			Иначе
				
				Форма.Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Ложь;
				Форма.Элементы.смартОтветственныйСтанетСвободным.Видимость = Ложь;
				//-- #Б-2354 смарт: Фролов 18.02.2025
				
			КонецЕсли;	
			
			//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
			//++ #Б-2484 смарт: Фролов 05.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
			//СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Форма.Объект.Ссылка, Истина);
			СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Форма.Объект.Ссылка, "СЦ");
			//-- #Б-2782 смарт: Фролов 25.03.2025
			
			Если НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
				
				Форма.Элементы.смартОтветственныйСтанетСвободнымЗаголовокСЦ.Видимость = Истина;
				Форма.Элементы.смартОтветственныйСтанетСвободнымСЦ.Видимость = Истина;
				
			Иначе
				
				Форма.Элементы.смартОтветственныйСтанетСвободнымЗаголовокСЦ.Видимость = Ложь;
				Форма.Элементы.смартОтветственныйСтанетСвободнымСЦ.Видимость = Ложь;
				
			КонецЕсли;	
			//-- #Б-2484 смарт: Фролов 05.03.2025
			
			//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
			СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Форма.Объект.Ссылка, "РМ");
			
			Если НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
				
				Форма.Элементы.смартОтветственныйСтанетСвободнымЗаголовокРМ.Видимость = Истина;
				Форма.Элементы.смартОтветственныйСтанетСвободнымРМ.Видимость = Истина;
				
			Иначе
				
				Форма.Элементы.смартОтветственныйСтанетСвободнымЗаголовокРМ.Видимость = Ложь;
				Форма.Элементы.смартОтветственныйСтанетСвободнымРМ.Видимость = Ложь;
				
			КонецЕсли;	
			//-- #Б-2782 смарт: Фролов 25.03.2025
			
			//++ #Б-5056 смарт: Фролов 26.11.2025 //Ошибка. Доступ к реквизиту. Ответственному РМ при переводе ответственного.
			//++ #Б-2822 смарт: Фролов 27.03.2025 //Запрет изменения менеджера по РМ всем кроме руководителей.
			//Форма.Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM")
			//	И ЗначениеЗаполнено(Форма.Объект.смартМенеджерПоРасходнымМатериалам);
			Форма.Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM")
				И СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.НеСвободен;
			//-- #Б-2822 смарт: Фролов 27.03.2025
			//-- #Б-5056 смарт: Фролов 26.11.2025
			
			//++ #Б-3128 смарт: Фролов 18.04.2025 //Вывод в 1С информации о участии клиентов в профильных ассоциациях.
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Ассоциация.Наименование КАК АссоциацияНаименование
			|ИЗ
			|	РегистрСведений.смартСоставПрофильныхАссоциаций
			|ГДЕ
			|	Партнер = &Партнер");
			Запрос.УстановитьПараметр("Партнер", Форма.Объект.Ссылка);
			
			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				
				ГруппаИнформацияОбАссоциацияхОбщая = Форма.Элементы.Вставить("ГруппаИнформацияОбАссоциацияхОбщая", Тип("ГруппаФормы"), Форма.Элементы.ГруппаСведения, Форма.Элементы.ГруппаГоловнойКонтрагент);
				ГруппаИнформацияОбАссоциацияхОбщая.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаИнформацияОбАссоциацияхОбщая.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ГруппаИнформацияОбАссоциацияхОбщая.Отображение          = ОтображениеОбычнойГруппы .Нет;
				
				ТекстДекорации = "Клиент является участником следующих ассоциаций:";
				
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ТекстДекорации = ТекстДекорации + Символы.ПС + """" + Выборка.АссоциацияНаименование + """";		
					
				КонецЦикла;	
				
				ГруппаИнформацияОбАссоциациях = Форма.Элементы.Добавить("ГруппаИнформацияОбАссоциациях", Тип("ГруппаФормы"), ГруппаИнформацияОбАссоциацияхОбщая);
				ГруппаИнформацияОбАссоциациях.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаИнформацияОбАссоциациях.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ГруппаИнформацияОбАссоциациях.ЦветФона 			 = Новый Цвет(204, 255, 204);
				ГруппаИнформацияОбАссоциациях.ОтображатьЗаголовок = Ложь;
				
				ГруппаИнформацияОбАссоциацияхДанные = Форма.Элементы.Добавить("ГруппаИнформацияОбАссоциацияхДанные", Тип("ГруппаФормы"), ГруппаИнформацияОбАссоциациях);
				ГруппаИнформацияОбАссоциацияхДанные.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаИнформацияОбАссоциацияхДанные.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ГруппаИнформацияОбАссоциацияхДанные.ЦветФона 			  = Новый Цвет(255, 255, 255); 
				ГруппаИнформацияОбАссоциацияхДанные.ОтображатьЗаголовок = Ложь;
				
				НоваяДекорацияЗаголовок = Форма.Элементы.Добавить("ДекорацияИнформацияОбАссоциациях", Тип("ДекорацияФормы"), ГруппаИнформацияОбАссоциацияхДанные);
				НоваяДекорацияЗаголовок.Заголовок = ТекстДекорации;
				НоваяДекорацияЗаголовок.Шрифт 	  = Новый Шрифт(, , Истина);
				НоваяДекорацияЗаголовок.Ширина = 70;
				НоваяДекорацияЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			
			КонецЕсли;
			//-- #Б-1644 смарт: Фролов 12.12.2024
			
			//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
			Если Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества, смартРуководительCRM") Тогда
				
				НоваяСтраница = Форма.Элементы.Вставить("смартБыстрыйВвод_СтраницаАудит", Тип("ГруппаФормы"), Форма.Элементы.Лента_ПанельКоманд,
				Форма.Элементы.Лента_КомандыЛево);
				НоваяСтраница.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяСтраница.Заголовок = "Аудит";
				НоваяСтраница.Поведение = ПоведениеОбычнойГруппы.Всплывающая;	
				НоваяСтраница.Видимость = Истина;
				НоваяСтраница.ОтображатьЗаголовок = Истина;
				НоваяСтраница.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
				НоваяСтраница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				НоваяСтраница.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
				НоваяСтраница.ЦветТекстаЗаголовка = Новый Цвет(0, 160, 242);
				НоваяСтраница.ШрифтЗаголовка = Новый Шрифт(Форма.Элементы.БыстрыйВвод_Взаимодействие.Шрифт, 8);
				НоваяСтраница.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницыАудит", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаАудит);
				НоваяГруппа.Вид = ВидГруппыФормы.Страницы;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаАудитИнцидент", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыАудит);
				НоваяГруппа.Вид = ВидГруппыФормы.Страница;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Инцидент";
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Оповестить об инциденте";
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				НоваяГруппа.ЦветФона = Новый Цвет(237, 249, 255);
				НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
				НоваяГруппа.Ширина = 70;
				НоваяГруппа.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИнцидентыПробел", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
				НоваяГруппа.Ширина = 70;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартДокументИнцидент", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИнцидентыПробел); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
				НовыйЭлемент.ПутьКДанным = "смартДокументИнцидент";
				НовыйЭлемент.Заголовок = "Инцидент";
				НовыйЭлемент.Гиперссылка = Истина;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Реакция на инцидент";
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				НоваяГруппа.ЦветФона = Новый Цвет(255, 237, 233);
				НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
				НоваяГруппа.Ширина = 70;
				НоваяГруппа.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM");
				
				//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИнцидентыПробел2", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
				НоваяГруппа.Ширина = 70;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницаАудитИнцидент);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Итоговый результат";
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				НоваяГруппа.ЦветФона = Новый Цвет(215, 240, 199);
				НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
				НоваяГруппа.Ширина = 70;
				НоваяГруппа.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартРуководительCRM"); 
				
				//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатВертикальная1", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентИтоговыйРезультат", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная); 
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентИтоговыйРезультат", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная1);
				//-- #Б-6288 смарт: Фролов 03.04.2026
				
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентИтоговыйРезультат";
				НовыйЭлемент.Заголовок = "Итоговый результат";
				НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
				НовыйЭлемент.МногострочныйРежим = Истина;
				НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
				НовыйЭлемент.РастягиватьПоВертикали = Ложь;
				НовыйЭлемент.Высота = 5;
				НовыйЭлемент.Ширина = 30;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				//-- #Б-5928 смарт: Фролов 04.03.2026
				
				ВидыИнцидентов.Сбросить();
				
				Пока ВидыИнцидентов.Следующий() Цикл
					
					НовыйЭлемент = Форма.Элементы.Добавить("смартВидИнцидента" + ВидыИнцидентов.Код, Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная); 	
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
					НовыйЭлемент.ПутьКДанным = "смартВидИнцидента" + ВидыИнцидентов.Код;
					НовыйЭлемент.Заголовок = ВидыИнцидентов.Наименование;
					НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
					
				КонецЦикла;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентУточнение", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентУточнение";
				НовыйЭлемент.Заголовок = "Уточнение";
				НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
				НовыйЭлемент.МногострочныйРежим = Истина;
				НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
				НовыйЭлемент.РастягиватьПоВертикали = Ложь;
				НовыйЭлемент.Высота = 3;
				НовыйЭлемент.Ширина = 35;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеВертикальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКтоБудетОповещен", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная2); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентКтоБудетОповещен";
				НовыйЭлемент.Заголовок = "Кто будет оповещен";
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКтоОповестил", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная2); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентКтоОповестил";
				НовыйЭлемент.Заголовок = "Кто оповестил";
				
				//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаОповеститьОбИнцидентеГоризонтальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная2);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентДатаОповещения", Тип("ПолеФормы"), Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная2); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентДатаОповещения";
				НовыйЭлемент.Заголовок = "Дата оповещения";
				НовыйЭлемент.ТолькоПросмотр = Истина;
				
				Команда = Форма.Команды.Добавить("смартКнопкаОповеститьОбИнциденте");
				Команда.Действие = "смартОповеститьОбИнциденте";
				Команда.Отображение = ОтображениеКнопки.Текст;
				
				смартОповеститьОбИнцидентеКнопка = Форма.Элементы.Вставить("смартКнопкаОповеститьОбИнциденте", Тип("КнопкаФормы"), 
				Форма.Элементы.смартГруппаОповеститьОбИнцидентеГоризонтальная2);
				смартОповеститьОбИнцидентеКнопка.ИмяКоманды = "смартКнопкаОповеститьОбИнциденте";
				смартОповеститьОбИнцидентеКнопка.Заголовок = "Оповестить";
				смартОповеститьОбИнцидентеКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
				смартОповеститьОбИнцидентеКнопка.Доступность = Пользователи.РолиДоступны("смартАудиторОтделаКонтроляКачества, смартРуководительОтделаКонтроляКачества");
				//-- #Б-5928 смарт: Фролов 04.03.2026
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентПринятоеРешение", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентПринятоеРешение";
				НовыйЭлемент.Заголовок = "Принятое решение";
				НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
				НовыйЭлемент.МногострочныйРежим = Истина;
				НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
				НовыйЭлемент.РастягиватьПоВертикали = Ложь;
				НовыйЭлемент.Высота = 3;
				НовыйЭлемент.Ширина = 30;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				ВидыРеакций.Сбросить();
				
				Пока ВидыРеакций.Следующий() Цикл
					
					НовыйЭлемент = Форма.Элементы.Добавить("смартВидРеакции" + ВидыРеакций.Код, Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная2); 	
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
					НовыйЭлемент.ПутьКДанным = "смартВидРеакции" + ВидыРеакций.Код;
					НовыйЭлемент.Заголовок = ВидыРеакций.Наименование;
					НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
					
				КонецЦикла;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентГоризонтальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная3", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная2);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКтоОтреагировал", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная3); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентКтоОтреагировал";
				НовыйЭлемент.Заголовок = "Кто отреагировал";
				НовыйЭлемент.ТолькоПросмотр = Истина;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентДатаРеакции", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная3); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентДатаРеакции";
				НовыйЭлемент.Заголовок = "Дата реакции";
				НовыйЭлемент.ТолькоПросмотр = Истина;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаРеакцияНаИнцидентВертикальная4", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентГоризонтальная2);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
				ВидыРезультатов.Сбросить();
				
				Пока ВидыРезультатов.Следующий() Цикл
					
					НовыйЭлемент = Форма.Элементы.Добавить("смартВидРезультата" + ВидыРезультатов.Код, Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная); 	
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
					НовыйЭлемент.ПутьКДанным = "смартВидРезультата" + ВидыРезультатов.Код;
					НовыйЭлемент.Заголовок = ВидыРезультатов.Наименование;
					НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
					
				КонецЦикла;
				
				//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
				//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная3); 	
				//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная);
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентОценкаРаботыОКК", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная1);
				//-- #Б-6288 смарт: Фролов 02.04.2026
				
				//-- #Б-5928 смарт: Фролов 05.03.2026
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентОценкаРаботыОКК";
				НовыйЭлемент.Заголовок = "Оценка работы ОКК";
				НовыйЭлемент.РежимВыбораИзСписка = Истина;
				
				НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Отлично, "Отлично");
				НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Хорошо, "Хорошо");
				НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Удовлетворительно, "Удовлетворительно");
				НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УровниПроизводительности.Плохо, "Плохо");
				
				//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
				//НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКомментарийКОценке", Тип("ПолеФормы"), Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная4);
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентКомментарийКОценке", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная);
				//-- #Б-5928 смарт: Фролов 05.03.2026
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентКомментарийКОценке";
				НовыйЭлемент.Заголовок = "Комментарий к оценке работы";
				НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
				НовыйЭлемент.МногострочныйРежим = Истина;
				НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
				НовыйЭлемент.РастягиватьПоВертикали = Ложь;
				НовыйЭлемент.Высота = 3;
				
				Команда = Форма.Команды.Добавить("смартКнопкаОтреагироватьНаИнцидент");
				Команда.Действие = "смартОтреагироватьНаИнцидент";
				Команда.Отображение = ОтображениеКнопки.Текст;
				
				смартОповеститьОбИнцидентеКнопка = Форма.Элементы.Вставить("смартКнопкаОтреагироватьНаИнцидент", Тип("КнопкаФормы"), 
				Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная);
				смартОповеститьОбИнцидентеКнопка.ИмяКоманды = "смартКнопкаОтреагироватьНаИнцидент";
				смартОповеститьОбИнцидентеКнопка.Заголовок = "Отреагировать";
				смартОповеститьОбИнцидентеКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
				смартОповеститьОбИнцидентеКнопка.Доступность = Пользователи.РолиДоступны("смартРуководительCRM");
				
				//++ #Б-5928 смарт: Фролов 04.03.2026 //Доработка механизма Инциденты.
				НоваяГруппа = Форма.Элементы.Вставить("смартГруппаИтоговыйРезультатГоризонтальная2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатВертикальная);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
				НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
				НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартИнцидентДатаРезультата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная2); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "смартИнцидентДатаРезультата";
				НовыйЭлемент.Заголовок = "Дата результата";
				НовыйЭлемент.ТолькоПросмотр = Истина;
				
				Команда = Форма.Команды.Добавить("смартКнопкаЗаписатьИтоговыйРезультат");
				Команда.Действие = "смартЗаписатьИтоговыйРезультат";
				Команда.Отображение = ОтображениеКнопки.Текст;
				
				смартОповеститьОбИнцидентеКнопка = Форма.Элементы.Вставить("смартКнопкаЗаписатьИтоговыйРезультат", Тип("КнопкаФормы"), 
				Форма.Элементы.смартГруппаИтоговыйРезультатГоризонтальная2);
				смартОповеститьОбИнцидентеКнопка.ИмяКоманды = "смартКнопкаЗаписатьИтоговыйРезультат";
				смартОповеститьОбИнцидентеКнопка.Заголовок = "Сохранить";
				смартОповеститьОбИнцидентеКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
				смартОповеститьОбИнцидентеКнопка.Доступность = Пользователи.РолиДоступны("смартРуководительCRM");
				//-- #Б-5928 смарт: Фролов 04.03.2026
				
				Если НЕ Форма.Объект.Ссылка.Пустая() Тогда
					
					ЗапросДокументИнцидент = Новый Запрос(
					"ВЫБРАТЬ
					|	смартИнцидент.Ссылка КАК Ссылка,
					|	смартИнцидент.Описание КАК Описание,
					|	смартИнцидент.Ответственный КАК Ответственный,
					|	смартИнцидент.Адресат КАК Адресат,
					|	смартИнцидент.Дата КАК Дата,
					|	смартИнцидент.Решение КАК Решение,
					|	смартИнцидент.Оценка КАК Оценка,
					|	смартИнцидент.ДатаРеакции КАК ДатаРеакции,
					//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
					|	смартИнцидент.ИтоговыйРезультат КАК ИтоговыйРезультат,
					|	смартИнцидент.ДатаРезультата КАК ДатаРезультата,
					//-- #Б-5928 смарт: Фролов 05.03.2026
					|	смартИнцидент.КтоОтреагировал КАК КтоОтреагировал,
					|	смартИнцидент.КомментарийКОценке КАК КомментарийКОценке,
					|	смартИнцидент.ВидыИнцидентов.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ВидИнцидента КАК ВидИнцидента,
					|		ВидИнцидента.Код КАК ВидИнцидентаКод
					|	) КАК ВидыИнцидентов,
					|	смартИнцидент.ВидыРеакцииНаИнцидент.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ВидРеакцииНаИнцидент КАК ВидРеакцииНаИнцидент,
					|		ВидРеакцииНаИнцидент.Код КАК ВидРеакцииНаИнцидентКод
					|	) КАК ВидыРеакцииНаИнцидент,
					//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
					|	смартИнцидент.ВидыРезультатов.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ВидРезультата КАК ВидРезультата,
					|		ВидРезультата.Код КАК ВидРезультатаКод
					|	) КАК ВидыРезультатов
					//-- #Б-6288 смарт: Фролов 02.04.2026
					|ИЗ
					|	Документ.смартИнцидент КАК смартИнцидент
					|ГДЕ
					|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
					|	И НЕ смартИнцидент.ПометкаУдаления");
					ЗапросДокументИнцидент.УстановитьПараметр("ОбъектИнцидента", Форма.Объект.Ссылка);
					
					Выборка = ЗапросДокументИнцидент.Выполнить().Выбрать();
					
					Если Выборка.Следующий() Тогда
						
						Форма.смартИнцидентУточнение = Выборка.Описание;
						Форма.смартИнцидентКтоОповестил = Выборка.Ответственный;
						Форма.смартИнцидентКтоБудетОповещен = Выборка.Адресат;
						Форма.смартИнцидентДатаОповещения = Выборка.Дата;
						Форма.смартИнцидентПринятоеРешение = Выборка.Решение;
						Форма.смартИнцидентОценкаРаботыОКК = Выборка.Оценка;
						Форма.смартИнцидентДатаРеакции = Выборка.ДатаРеакции;
						//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
						Форма.смартИнцидентИтоговыйРезультат = Выборка.ИтоговыйРезультат;
						Форма.смартИнцидентДатаРезультата = Выборка.ДатаРезультата;
						//-- #Б-5928 смарт: Фролов 05.03.2026
						Форма.смартИнцидентКомментарийКОценке = Выборка.КомментарийКОценке;
						Форма.смартИнцидентКтоОтреагировал = Выборка.КтоОтреагировал;
						Форма.смартДокументИнцидент = Выборка.Ссылка;
						
						ВыборкаВидыИнцидентов = Выборка.ВидыИнцидентов.Выбрать();
						
						Пока ВыборкаВидыИнцидентов.Следующий() Цикл
							
							Форма["смартВидИнцидента" + ВыборкаВидыИнцидентов.ВидИнцидентаКод] = Истина;	
							
						КонецЦикла;
						
						ВыборкаВидыРеакцииНаИнцидент = Выборка.ВидыРеакцииНаИнцидент.Выбрать();
						
						Пока ВыборкаВидыРеакцииНаИнцидент.Следующий() Цикл
							
							Форма["смартВидРеакции" + ВыборкаВидыРеакцииНаИнцидент.ВидРеакцииНаИнцидентКод] = Истина;	
							
						КонецЦикла;
						
						//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
						ВыборкаВидыРезультатов = Выборка.ВидыРезультатов.Выбрать();
						
						Пока ВыборкаВидыРезультатов.Следующий() Цикл
							
							Форма["смартВидРезультата" + ВыборкаВидыРезультатов.ВидРезультатаКод] = Истина;	
							
						КонецЦикла;	
						//-- #Б-6288 смарт: Фролов 02.04.2026
						
						Форма.Элементы.смартГруппаОповеститьОбИнцидентеВертикальная.ТолькоПросмотр = Истина;
						Форма.Элементы.смартКнопкаОповеститьОбИнциденте.Доступность = Ложь;
						
						Если ЗначениеЗаполнено(Форма.смартИнцидентДатаРеакции) Тогда
							
							Форма.Элементы.смартГруппаРеакцияНаИнцидентВертикальная.ТолькоПросмотр = Истина;
							Форма.Элементы.смартКнопкаОтреагироватьНаИнцидент.Доступность = Ложь;
							
						КонецЕсли;	
						
					Иначе	
						
						Форма.Элементы.смартДокументИнцидент.Видимость = Ложь;
						Форма.смартИнцидентКтоОповестил = Пользователи.ТекущийПользователь();
						
						Если ЗначениеЗаполнено(Форма.Объект.ОсновнойМенеджер) Тогда
							
							ЗапросРуководитель = Новый Запрос(
							"ВЫБРАТЬ ПЕРВЫЕ 1
							|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
							|ИЗ
							|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
							|		ПО (Пользователи.Подразделение.смартИсполнительОтПодразделения = ИсполнителиЗадач.РольИсполнителя)
							|ГДЕ
							|	Пользователи.Ссылка = &Ссылка");
							ЗапросРуководитель.УстановитьПараметр("Ссылка", Форма.Объект.ОсновнойМенеджер);
							
							ВыборкаРуководитель = ЗапросРуководитель.Выполнить().Выбрать();
							
							Если ВыборкаРуководитель.Следующий() Тогда
								
								Форма.смартИнцидентКтоБудетОповещен = ВыборкаРуководитель.Исполнитель;		
								
							КонецЕсли;	
							
						КонецЕсли;	
						
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(Форма.смартИнцидентОценкаРаботыОКК) Тогда
						Форма.смартИнцидентОценкаРаботыОКК = Перечисления.УровниПроизводительности.Хорошо;
					КонецЕсли;	
					
				КонецЕсли;
				
				//++ #Б-6100 смарт: Фролов 18.03.2026 //Документ Телефонный звонок. Ошибка доступа.
				//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
				НоваяСтраница = Форма.Элементы.Вставить("смартБыстрыйВвод_СтраницаDEERAY", Тип("ГруппаФормы"), Форма.Элементы.Лента_ПанельКоманд,
				Форма.Элементы.Лента_КомандыЛево);
				НоваяСтраница.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяСтраница.Заголовок = "DEERAY";
				НоваяСтраница.Поведение = ПоведениеОбычнойГруппы.Всплывающая;	
				НоваяСтраница.Видимость = Истина;
				НоваяСтраница.ОтображатьЗаголовок = Истина;
				НоваяСтраница.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
				НоваяСтраница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				НоваяСтраница.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
				НоваяСтраница.ЦветТекстаЗаголовка = Новый Цвет(0, 160, 242);
				НоваяСтраница.ШрифтЗаголовка = Новый Шрифт(Форма.Элементы.БыстрыйВвод_Взаимодействие.Шрифт, 8);
				НоваяСтраница.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
				НоваяСтраница.ТолькоПросмотр = Истина;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницыDEERAY", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
				НоваяГруппа.Вид = ВидГруппыФормы.Страницы;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYКвалификация", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAY);
				НоваяГруппа.Вид = ВидГруппыФормы.Страница;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Квалификация";
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYДанные", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAY);
				НоваяГруппа.Вид = ВидГруппыФормы.Страница;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Все звонки";
				
				смартТаблицаDEERAY = Форма.Элементы.Добавить("смартТаблицаDEERAY", Тип("ТаблицаФормы"), Форма.Элементы.смартСтраницаDEERAYДанные);
				смартТаблицаDEERAY.ПутьКДанным = "смартЗвонкиDEERAY";
				смартТаблицаDEERAY.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
				смартТаблицаDEERAY.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
				смартТаблицаDEERAY.АвтоМаксимальнаяВысота = Ложь;
				смартТаблицаDEERAY.МаксимальнаяВысота = 9;
				смартТаблицаDEERAY.Высота = 9;
				смартТаблицаDEERAY.РастягиватьПоГоризонтали = Ложь;
				смартТаблицаDEERAY.Ширина = 75;
				смартТаблицаDEERAY.РастягиватьПоВертикали = Ложь;
				смартТаблицаDEERAY.Подвал = Ложь;
				смартТаблицаDEERAY.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
				смартТаблицаDEERAY.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина); 
				смартТаблицаDEERAY.Шрифт = Новый Шрифт("Arial", 8);
				смартТаблицаDEERAY.УстановитьДействие("ПриАктивизацииСтроки", "смартТаблицаDEERAYПриАктивизацииСтроки");
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYДата", "смартТаблицаDEERAY", "Дата", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYДата");
				Форма.Элементы.смартЗвонкиDEERAYДата.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYДата.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYДлительность", "смартТаблицаDEERAY", "Длительность", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYДлительность");
				Форма.Элементы.смартЗвонкиDEERAYДлительность.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYДлительность.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYЦелевой", "смартТаблицаDEERAY", "Целевой", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYЦелевой");
				Форма.Элементы.смартЗвонкиDEERAYЦелевой.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYЦелевой.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYНапревление", "смартТаблицаDEERAY", "Напревление", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYНапревление");
				Форма.Элементы.смартЗвонкиDEERAYНапревление.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYНапревление.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYЭтап", "смартТаблицаDEERAY", "Этап", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYЭтап");
				Форма.Элементы.смартЗвонкиDEERAYЭтап.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYЭтап.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYТелефон", "смартТаблицаDEERAY", "Телефон", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYТелефон");
				Форма.Элементы.смартЗвонкиDEERAYТелефон.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYТелефон.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартЗвонкиDEERAYКонтакт", "смартТаблицаDEERAY", "Контакт", 1, "смартЗвонкиDEERAY.смартЗвонкиDEERAYКонтакт");
				Форма.Элементы.смартЗвонкиDEERAYКонтакт.ТолькоПросмотр = Истина;
				Форма.Элементы.смартЗвонкиDEERAYКонтакт.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартРезюмеDEERAY", "смартТаблицаDEERAY", "Резюме", 1, "смартЗвонкиDEERAY.смартРезюмеDEERAY");
				Форма.Элементы.смартРезюмеDEERAY.Видимость = Ложь;
				Форма.Элементы.смартРезюмеDEERAY.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				
				НовыйЭлемент = Форма.Элементы.Вставить("смартПрослушатьРазговорDEERAY", Тип("ДекорацияФормы"), 
				Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
				НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
				НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
				НовыйЭлемент.Заголовок = "Прослушать разговор";
				НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
				НовыйЭлемент.Гиперссылка = Истина; 
				НовыйЭлемент.УстановитьДействие("Нажатие", "смартПрослушатьРазговорНажатие");
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницыDEERAYНиз", Тип("ГруппаФормы"), Форма.Элементы.смартБыстрыйВвод_СтраницаDEERAY);
				НоваяГруппа.Вид = ВидГруппыФормы.Страницы;
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYРезюме", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAYНиз);
				НоваяГруппа.Вид = ВидГруппыФормы.Страница;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Резюме";
				
				НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаDEERAYРасшифровкаРазговора", Тип("ГруппаФормы"), Форма.Элементы.смартСтраницыDEERAYНиз);
				НоваяГруппа.Вид = ВидГруппыФормы.Страница;
				НоваяГруппа.ОтображатьЗаголовок = Истина;
				НоваяГруппа.Заголовок = "Расшифровка разговора";
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартРезюмеHTMLDEERAYПоле", Тип("ПолеФормы"), Форма.Элементы.смартСтраницаDEERAYРезюме); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеHTMLДокумента;
				НовыйЭлемент.ПутьКДанным = "смартРезюмеHTMLDEERAY";
				
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
				НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
				НовыйЭлемент.Ширина = 75;
				
				НовыйЭлемент = Форма.Элементы.Добавить("смартРасшифровкаРазговораDEERAYТабДок", Тип("ПолеФормы"), Форма.Элементы.смартСтраницаDEERAYРасшифровкаРазговора); 	
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
				НовыйЭлемент.ПутьКДанным = "смартРасшифровкаРазговораDEERAY";
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
				НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
				НовыйЭлемент.Ширина = 75;
				
				УстановитьПривилегированныйРежим(Истина);
				
				Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	смартДанныеDEERAY.ТелефонныйЗвонок.Дата КАК смартЗвонкиDEERAYДата,
				|	смартДанныеDEERAY.ТелефонныйЗвонок.сфпДлительностьЗвонка КАК смартЗвонкиDEERAYДлительность,
				|	смартДанныеDEERAY.ЦелевойЗвонок КАК смартЗвонкиDEERAYЦелевой,
				|	смартДанныеDEERAY.ЭтапИнтереса КАК смартЗвонкиDEERAYЭтап,
				|	ВЫБОР
				|		КОГДА смартДанныеDEERAY.ТелефонныйЗвонок.Входящий
				|			ТОГДА ""Входящий""
				|		ИНАЧЕ ""Исходящий""
				|	КОНЕЦ КАК смартЗвонкиDEERAYНапревление,
				|	смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКакСвязаться КАК смартЗвонкиDEERAYТелефон,
				|	ПРЕДСТАВЛЕНИЕ(смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт) КАК смартЗвонкиDEERAYКонтакт,
				|	смартДанныеDEERAY.Резюме КАК смартРезюмеDEERAY,
				|	смартДанныеDEERAY.ТелефонныйЗвонок.Ссылка КАК смартЗвонкиDEERAYСсылка
				|ИЗ
				|	РегистрСведений.смартДанныеDeeray КАК смартДанныеDEERAY
				|ГДЕ
				|	ВЫБОР
				|			КОГДА ТИПЗНАЧЕНИЯ(смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт) = ТИП(Справочник.КонтактныеЛицаПартнеров)
				|				ТОГДА смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт.Владелец = &Партнер
				|			ИНАЧЕ смартДанныеDEERAY.ТелефонныйЗвонок.АбонентКонтакт = &Партнер
				|		КОНЕЦ
				|
				|УПОРЯДОЧИТЬ ПО
				|	смартДанныеDEERAY.ТелефонныйЗвонок.Дата");
				Запрос.УстановитьПараметр("Партнер", Форма.Объект.Ссылка);
				
				Форма.смартЗвонкиDEERAY.Загрузить(Запрос.Выполнить().Выгрузить());
				
				УстановитьПривилегированныйРежим(Ложь);
				
				Форма.смартРезюмеHTMLПредварительныйDEERAY = "
				|<!DOCTYPE html>
				|<html>
				|<head>
				|    <style>
				|        body { font-family: Arial, sans-serif; margin: 4px; }
				|        h1 { color: #2e6c80; }
				|    </style>
				|</head>
				|<body>
				|    <p>ТекстРезюмеHTMLDEERAY</p> 
				|</body>
				|</html>";
				
				смартТаблицаDEERAY = Форма.Элементы.Добавить("смартТаблицаДанныеСценариевDEERAY", Тип("ТаблицаФормы"), Форма.Элементы.смартСтраницаDEERAYКвалификация);
				смартТаблицаDEERAY.ПутьКДанным = "смартДанныеСценариевDEERAY";
				смартТаблицаDEERAY.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
				смартТаблицаDEERAY.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
				смартТаблицаDEERAY.АвтоМаксимальнаяВысота = Ложь;
				смартТаблицаDEERAY.МаксимальнаяВысота = 9;
				смартТаблицаDEERAY.ВысотаШапки = 3;
				смартТаблицаDEERAY.Высота = 9;
				смартТаблицаDEERAY.ТолькоПросмотр = Истина;
				смартТаблицаDEERAY.РастягиватьПоГоризонтали = Ложь;
				смартТаблицаDEERAY.Ширина = 75;
				смартТаблицаDEERAY.РастягиватьПоВертикали = Ложь;
				смартТаблицаDEERAY.Подвал = Ложь;
				смартТаблицаDEERAY.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
				смартТаблицаDEERAY.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина); 
				смартТаблицаDEERAY.Шрифт = Новый Шрифт("Arial", 8);
				смартТаблицаDEERAY.УстановитьДействие("ПриАктивизацииПоля", "смартТаблицаДанныеСценариевDEERAYПриАктивизацииПоля");
				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартДанныеСценариевDEERAYСценарий", "смартТаблицаДанныеСценариевDEERAY", "Сценарий", 
				1, "смартДанныеСценариевDEERAY.смартДанныеСценариевDEERAYСценарий");
				Форма.Элементы.смартДанныеСценариевDEERAYСценарий.ТолькоПросмотр = Истина;
				Форма.Элементы.смартДанныеСценариевDEERAYСценарий.ВысотаЗаголовка = 3;
				Форма.Элементы.смартДанныеСценариевDEERAYСценарий.Шрифт = Новый Шрифт("Arial", 8, Истина);
				Форма.Элементы.смартДанныеСценариевDEERAYСценарий.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);		
				
				Для Каждого СтрсмартИдентификаторыЗвонковDEERAY Из Форма.смартИдентификаторыЗвонковDEERAY Цикл
					
					ДобавленныйЗвонок = Форма.Элементы.Добавить("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор, 
					Тип("ПолеФормы"), Форма.Элементы.смартТаблицаДанныеСценариевDEERAY);
					ДобавленныйЗвонок.Вид = ВидПоляФормы.ПолеВвода;
					ДобавленныйЗвонок.ВысотаЗаголовка = 3;
					ДобавленныйЗвонок.Заголовок = СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYЗаголовок; 
					ДобавленныйЗвонок.ПутьКДанным = "смартДанныеСценариевDEERAY" + "." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор;
					ДобавленныйЗвонок.Видимость = Истина;
					ДобавленныйЗвонок.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
					ДобавленныйЗвонок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
					ДобавленныйЗвонок.РастягиватьПоГоризонтали = Ложь;
					ДобавленныйЗвонок.Шрифт = Новый Шрифт( , 8, Истина);
					ДобавленныйЗвонок.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
					ДобавленныйЗвонок.Ширина = 9;
					ДобавленныйЗвонок.АвтоМаксимальнаяШирина = Ложь;
					
					ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
					ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор);
					
					ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
					ЭлементОтбора.ПравоеЗначение = 100;
					ЭлементОтбора.Использование = Истина;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
					ЭлементОтбора.ПравоеЗначение = 75;
					ЭлементОтбора.Использование = Истина;
					ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(107, 219, 107)); 
					ЭлементОформления.Использование = Истина;
					
					ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
					ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор);
					
					ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
					ЭлементОтбора.ПравоеЗначение = 75;
					ЭлементОтбора.Использование = Истина;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
					ЭлементОтбора.ПравоеЗначение = 50;
					ЭлементОтбора.Использование = Истина;
					ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(177, 241, 177)); 
					ЭлементОформления.Использование = Истина;
					
					ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
					ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор);
					
					ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
					ЭлементОтбора.ПравоеЗначение = 50;
					ЭлементОтбора.Использование = Истина;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор); 
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
					ЭлементОтбора.ПравоеЗначение = 25;
					ЭлементОтбора.Использование = Истина;
					ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(234, 250, 234)); 
					ЭлементОформления.Использование = Истина;
					
				КонецЦикла;
				
				ДобавленныйЗвонок = Форма.Элементы.Добавить("Звонок_Итог", 
				Тип("ПолеФормы"), Форма.Элементы.смартТаблицаДанныеСценариевDEERAY);
				ДобавленныйЗвонок.Вид = ВидПоляФормы.ПолеВвода;
				ДобавленныйЗвонок.ВысотаЗаголовка = 3;
				ДобавленныйЗвонок.Заголовок = "Итог" + Символы.ПС + Форма.смартИдентификаторыЗвонковDEERAY.Количество() 
				+ Символы.ПС + ИтогоСекунд + " сек."; 
				ДобавленныйЗвонок.ПутьКДанным = "смартДанныеСценариевDEERAY" + "." + "КолонкаЗвонок_Итог";
				ДобавленныйЗвонок.Видимость = Истина;
				ДобавленныйЗвонок.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				ДобавленныйЗвонок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				ДобавленныйЗвонок.РастягиватьПоГоризонтали = Ложь;
				ДобавленныйЗвонок.Шрифт = Новый Шрифт( , 8, Истина);
				ДобавленныйЗвонок.ШрифтЗаголовка = Новый Шрифт("Arial", 8, Истина);
				ДобавленныйЗвонок.Ширина = 9;
				ДобавленныйЗвонок.АвтоМаксимальнаяШирина = Ложь;
				
				ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_Итог");
				
				ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = 100;
				ЭлементОтбора.Использование = Истина;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 75;
				ЭлементОтбора.Использование = Истина;
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(107, 219, 107)); 
				ЭлементОформления.Использование = Истина;
				
				ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_Итог");
				
				ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = 75;
				ЭлементОтбора.Использование = Истина;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 50;
				ЭлементОтбора.Использование = Истина;
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(177, 241, 177)); 
				ЭлементОформления.Использование = Истина;
				
				ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
				ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Звонок_Итог");
				
				ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = 50;
				ЭлементОтбора.Использование = Истина;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("смартДанныеСценариевDEERAY." + "КолонкаЗвонок_Итог"); 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = 25;
				ЭлементОтбора.Использование = Истина;
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(234, 250, 234)); 
				ЭлементОформления.Использование = Истина;
				
				Для Каждого СтрсмартСписокСценариевDEERAY Из Форма.смартСписокСценариевDEERAY Цикл
					
					ИтогПроцент = 0;
					
					СтрсмартДанныеСценариевDEERAY = Форма.смартДанныеСценариевDEERAY.Добавить();
					СтрсмартДанныеСценариевDEERAY.смартДанныеСценариевDEERAYСценарий = СтрсмартСписокСценариевDEERAY.Значение;
					
					Для Каждого СтрсмартИдентификаторыЗвонковDEERAY Из Форма.смартИдентификаторыЗвонковDEERAY Цикл
						
						СтрокисмартДанныеСценариевDEERAYДляОбработки = Форма.смартДанныеСценариевDEERAYДляОбработки.НайтиСтроки(
						Новый Структура("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок, смартДанныеСценариевDEERAYДляОбработкиСценарий",
						СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYЗвонок, СтрсмартСписокСценариевDEERAY.Значение)); 
						
						Если СтрокисмартДанныеСценариевDEERAYДляОбработки.Количество() > 0 Тогда
							
							СтрсмартДанныеСценариевDEERAY["КолонкаЗвонок_" + СтрсмартИдентификаторыЗвонковDEERAY.смартСценарииDEERAYИдентификатор] 
							= СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиПроцент;
							
							ИтогПроцент = ?(ИтогПроцент < СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиПроцент, 
							СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиПроцент, ИтогПроцент);
							
						КонецЕсли;	
						
					КонецЦикла;
					
					СтрсмартДанныеСценариевDEERAY["КолонкаЗвонок_Итог"] = ИтогПроцент;
					
				КонецЦикла; 
				
				Форма.Элементы.смартТаблицаДанныеСценариевDEERAY.Видимость = Ложь;
				//-- #Б-6082 смарт: Фролов 16.03.2026
				//-- #Б-6100 смарт: Фролов 18.03.2026
				
			КонецЕсли;
			//-- #Б-5762 смарт: Фролов 18.02.2026
						
		КонецЕсли;	
		
	КонецЕсли;	
	//-- #1813 смарт: Фролов 08.05.2024
	
	//++ #1809 смарт: Ермаков 13.05.2024 / Доработка списка документов Интересы - отбор по квалификациям.
	Если Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаСписка" Тогда
		
		//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
		//Форма.Элементы.СмартГруппаЗаметки.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		//Форма.Элементы.СмартГруппаЗаметки.Скрыть();
		//-- #Б-976 смарт: Фролов 23.10.2024
		
		Форма.Элементы.ОтборПроект.Видимость = Ложь;
		
		Форма.Команды.Добавить("смартКвалификация");
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКвалификация", Новый ОписаниеТипов("СписокЗначений"),, "Квалификация", Истина));
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		
		Форма.смартКвалификация.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.смартКвалификацииМенеджеров");
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартКвалификация", Тип("ПолеФормы"), Форма.Элементы.ГруппаФильтры, Форма.Элементы.ОтборПроект);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартКвалификация";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.КнопкаОчистки = Истина;              	
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.ПодсказкаВвода = "Квалификация"; 
		НовыйЭлемент.МаксимальнаяШирина = 24;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;	
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");			
		
		// Добавляем фильтр по новым и старым воронкам
		Форма.Команды.Добавить("смартНовые");
		Форма.Команды.Добавить("смартСтарые");
		
		МассивРеквизитов = Новый Массив;
		
		//++ #Б-5684 смарт: Фролов 20.02.2026 //Документ и Список Интерес. Оптимизация.
		Форма.Список.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	CRM_Интерес.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ИсточникиПервичногоИнтереса.Период) КАК Период,
		|	ВЫБОР
		|		КОГДА CRM_Интерес.Партнер <> ЗНАЧЕНИЕ(СПравочник.Партнеры.ПустаяСсылка)
		|			ТОГДА CRM_Интерес.Партнер
		|		ИНАЧЕ CRM_Интерес.ПотенциальныйКлиент
		|	КОНЕЦ КАК Партнер
		|ПОМЕСТИТЬ МаксДатыСделок
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		|		ПО CRM_Интерес.Ссылка = ИсточникиПервичногоИнтереса.Сделка
		|			И (ВЫБОР
		|				КОГДА CRM_Интерес.Партнер <> ЗНАЧЕНИЕ(СПравочник.Партнеры.ПустаяСсылка)
		|					ТОГДА CRM_Интерес.Партнер = ИсточникиПервичногоИнтереса.Партнер
		|				ИНАЧЕ CRM_Интерес.ПотенциальныйКлиент = ИсточникиПервичногоИнтереса.Партнер
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Ссылка,
		|	ВЫБОР
		|		КОГДА CRM_Интерес.Партнер <> ЗНАЧЕНИЕ(СПравочник.Партнеры.ПустаяСсылка)
		|			ТОГДА CRM_Интерес.Партнер
		|		ИНАЧЕ CRM_Интерес.ПотенциальныйКлиент
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(КалендарныеГрафики.ДатаГрафика) КАК СрокНаЭтапе
		|ПОМЕСТИТЬ ДлительностиАктивныхЭтапов
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних КАК CRM_ИсторияСостоянийОбращенийСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|			ПО CRM_ИсторияСостоянийОбращенийСрезПоследних.Период <= КалендарныеГрафики.ДатаГрафика
		|				И (КалендарныеГрафики.ДеньВключенВГрафик)
		|				И (КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата)
		|				И (КалендарныеГрафики.Календарь = &Календарь)
		|		ПО CRM_Интерес.Ссылка = CRM_ИсторияСостоянийОбращенийСрезПоследних.Обращение
		|ГДЕ
		|	НЕ CRM_Интерес.Завершен
		|	И НЕ CRM_Интерес.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксДатыСделок.Ссылка КАК Сделка,
		|	ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса,
		|	ИсточникиПервичногоИнтереса.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтереса,
		|	МаксДатыСделок.Партнер КАК Партнер
		|ПОМЕСТИТЬ КаналыИИсточники
		|ИЗ
		|	МаксДатыСделок КАК МаксДатыСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		|		ПО МаксДатыСделок.Ссылка = ИсточникиПервичногоИнтереса.Сделка
		|			И МаксДатыСделок.Период = ИсточникиПервичногоИнтереса.Период
		|			И МаксДатыСделок.Партнер = ИсточникиПервичногоИнтереса.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_ИнтересыНаКонтролеСрезПоследних.Объект КАК Объект,
		|	CRM_ИнтересыНаКонтролеСрезПоследних.Пользователь КАК Пользователь,
		|	CRM_ИнтересыНаКонтролеСрезПоследних.СтатусКонтроля КАК СтатусКонтроля
		|ПОМЕСТИТЬ ИнтересыНаКонтролеСраз
		|ИЗ
		|	РегистрСведений.CRM_ИнтересыНаКонтроле.СрезПоследних КАК CRM_ИнтересыНаКонтролеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнтересыНаКонтролеСраз.Объект КАК Объект
		|ПОМЕСТИТЬ ИнтересыДляКонтроля
		|ИЗ
		|	ИнтересыНаКонтролеСраз КАК ИнтересыНаКонтролеСраз
		|ГДЕ
		|	ИнтересыНаКонтролеСраз.СтатусКонтроля = &смартСтатусНаКонтроле
		|	И ИнтересыНаКонтролеСраз.Пользователь = &смартНаблюдает
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнтересыНаКонтролеСраз.Объект КАК Объект,
		|	ИСТИНА КАК Контроль
		|ПОМЕСТИТЬ ИнтересыНаКонтроле
		|ИЗ
		|	ИнтересыНаКонтролеСраз КАК ИнтересыНаКонтролеСраз
		|ГДЕ
		|	ИнтересыНаКонтролеСраз.СтатусКонтроля = &смартСтатусНаКонтроле
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументCRM_Интерес.Ссылка КАК Ссылка,
		|	ДокументCRM_Интерес.ПометкаУдаления КАК ПометкаУдаления,
		|	ДокументCRM_Интерес.Номер КАК Номер,
		|	ДокументCRM_Интерес.Дата КАК Дата,
		|	ДокументCRM_Интерес.Проведен КАК Проведен,
		|	ДокументCRM_Интерес.Автор КАК Автор,
		|	ДокументCRM_Интерес.ВероятностьСделки КАК ВероятностьСделки,
		|	ДокументCRM_Интерес.ДокументОснование КАК ДокументОснование,
		|	ДокументCRM_Интерес.Завершен КАК Завершен,
		|	ДокументCRM_Интерес.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ДокументCRM_Интерес.ОжидаемаяВыручка КАК ОжидаемаяВыручка,
		|	ДокументCRM_Интерес.смартОжидаемаяВыручкаВВалютеДокумента КАК смартОжидаемаяВыручкаВВалютеДокумента,
		|	ДокументCRM_Интерес.Валюта КАК Валюта,
		|	ДокументCRM_Интерес.Описание КАК Описание,
		|	ДокументCRM_Интерес.Организация КАК Организация,
		|	ДокументCRM_Интерес.Ответственный КАК Ответственный,
		|	ДокументCRM_Интерес.Офис КАК Офис,
		|	ВЫБОР
		|		КОГДА ДокументCRM_Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|			ТОГДА ДокументCRM_Интерес.ПотенциальныйКлиент
		|		ИНАЧЕ ДокументCRM_Интерес.Партнер
		|	КОНЕЦ КАК Партнер,
		|	ДокументCRM_Интерес.Подразделение КАК Подразделение,
		|	ДокументCRM_Интерес.ПотенциальныйКлиент КАК ПотенциальныйКлиент,
		|	ДокументCRM_Интерес.ПричинаОтказа КАК ПричинаОтказа,
		|	ДокументCRM_Интерес.ТипУслуги КАК ТипУслуги,
		|	ДокументCRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ДокументCRM_Интерес.СостояниеИнтереса.Родитель КАК Сценарий,
		|	ДокументCRM_Интерес.Тема КАК Тема,
		|	ДокументCRM_Интерес.ДатаЗакрытия КАК ДатаЗакрытия,
		|	ДокументCRM_Интерес.МоментВремени КАК МоментВремени,
		|	ВЫБОР
		|		КОГДА ДокументCRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение)
		|			ТОГДА 1
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументCRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|					ТОГДА 2
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК КартинкаСостояния,
		|	ВложенныйЗапрос.ПланируемаяДата КАК ДатаСледующейАктивности,
		|	ВЫБОР
		|		КОГДА CRM_ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 25
		|			ТОГДА 0
		|		КОГДА CRM_ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 50
		|			ТОГДА 1
		|		КОГДА CRM_ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 75
		|			ТОГДА 2
		|		КОГДА CRM_ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий < 90
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК ЗаполненностьИнформации,
		|	КаналыИИсточники.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса,
		|	КаналыИИсточники.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтереса,
		|	ДокументCRM_Интерес.ТипОбращения КАК ТипОбращения,
		|	ДокументCRM_Интерес.Избранный КАК Избранный,
		|	ДлительностиАктивныхЭтапов.СрокНаЭтапе КАК СрокНаЭтапе,
		|	ИнтересыНаКонтроле.Контроль КАК Контроль
		|ИЗ
		|	Документ.CRM_Интерес КАК ДокументCRM_Интерес
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			CRM_ЗапланированныеАктивности.Объект КАК Объект,
		|			МИНИМУМ(CRM_ЗапланированныеАктивности.ПланируемаяДата) КАК ПланируемаяДата
		|		ИЗ
		|			РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					CRM_ЗапланированныеАктивности.Объект КАК Объект,
		|					МИНИМУМ(CRM_ЗапланированныеАктивности.ПланируемаяДата) КАК ПланируемаяДата
		|				ИЗ
		|					РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
		|				
		|				СГРУППИРОВАТЬ ПО
		|					CRM_ЗапланированныеАктивности.Объект) КАК ВложенныйЗапрос
		|				ПО CRM_ЗапланированныеАктивности.Объект = ВложенныйЗапрос.Объект
		|					И CRM_ЗапланированныеАктивности.ПланируемаяДата = ВложенныйЗапрос.ПланируемаяДата
		|		
		|		СГРУППИРОВАТЬ ПО
		|			CRM_ЗапланированныеАктивности.Объект) КАК ВложенныйЗапрос
		|		ПО ДокументCRM_Интерес.Ссылка = ВложенныйЗапрос.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
		|		ПО (CRM_ЗаполненностьРеквизитовОбъектов.Объект = ДокументCRM_Интерес.Партнер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ КаналыИИсточники КАК КаналыИИсточники
		|		ПО ДокументCRM_Интерес.Ссылка = КаналыИИсточники.Сделка
		|			И (ВЫБОР
		|				КОГДА ДокументCRM_Интерес.Партнер <> ЗНАЧЕНИЕ(СПравочник.Партнеры.ПустаяСсылка)
		|					ТОГДА ДокументCRM_Интерес.Партнер
		|				ИНАЧЕ ДокументCRM_Интерес.ПотенциальныйКлиент
		|			КОНЕЦ = КаналыИИсточники.Партнер)
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДлительностиАктивныхЭтапов КАК ДлительностиАктивныхЭтапов
		|		ПО ДокументCRM_Интерес.Ссылка = ДлительностиАктивныхЭтапов.Ссылка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИнтересыНаКонтроле КАК ИнтересыНаКонтроле
		|		ПО ДокументCRM_Интерес.Ссылка = ИнтересыНаКонтроле.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &смартНаКонтроле
		|				ТОГДА ДокументCRM_Интерес.Ссылка В
		|						(ВЫБРАТЬ
		|							ИнтересыДляКонтроля.Объект
		|						ИЗ
		|							ИнтересыДляКонтроля)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		//-- #Б-5684 смарт: Фролов 20.02.2026
		Форма.Список.Параметры.УстановитьЗначениеПараметра("смартСтатусНаКонтроле", Перечисления.CRM_СтатусыКонтроляИнтереса.НаКонтроле);
		
		Форма.Команды.Добавить("смартНаКонтроле");
		Форма.Команды.Добавить("смартНаблюдает");
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартНаКонтроле", Новый ОписаниеТипов("Булево"), , "На контроле"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартНаблюдает", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "Наблюдает"));
		//-- #1867 смарт: Фролов 18.06.2024
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартНовые", Новый ОписаниеТипов("Булево"),, "Новые", Истина));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСтарые", Новый ОписаниеТипов("Булево"),, "Старые", Истина));

		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		
		Для Каждого Реквизит Из МассивРеквизитов Цикл
			
			//++ #1867 смарт: Фролов 18.06.2024 //Доработка списка Интересов и Воронки продаж - отбор по взятым на контроль
			//НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			Если Реквизит.Имя = "смартНаКонтроле" Тогда
				НовыйЭлемент = Форма.Элементы.Вставить(Реквизит.Имя, Тип("ПолеФормы"), Форма.Элементы.ГруппаФильтры, Форма.Элементы.ОтборКонтрагент);
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
			ИначеЕсли Реквизит.Имя = "смартНаблюдает" Тогда
				НовыйЭлемент = Форма.Элементы.Вставить(Реквизит.Имя, Тип("ПолеФормы"), Форма.Элементы.ГруппаФильтры, Форма.Элементы.ОтборКонтрагент);
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовыйЭлемент.КнопкаОткрытия = Ложь;
				НовыйЭлемент.КнопкаОчистки = Истина;
				//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
				НовыйЭлемент.ПодсказкаВвода = "Наблюдает"; 
				//-- #1910 смарт: Лопато 07.08.2024
			Иначе	
				НовыйЭлемент = Форма.Элементы.Вставить(Реквизит.Имя, Тип("ПолеФормы"), Форма.Элементы.ГруппаФильтры, Форма.Элементы.ОтборПроект);
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			КонецЕсли;
			НовыйЭлемент.ПутьКДанным = Реквизит.Имя;
			//-- #1867 смарт: Фролов 18.06.2024
			
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");				
			
		КонецЦикла;
		
		//++ #1867 смарт: Фролов 18.06.2024 //Доработка списка Интересов и Воронки продаж - отбор по взятым на контроль
		Форма.смартНаблюдает = ПараметрыСеанса.ТекущийПользователь;	
		Форма.Список.Параметры.УстановитьЗначениеПараметра("смартНаКонтроле", Ложь);
		Форма.Список.Параметры.УстановитьЗначениеПараметра("смартНаблюдает", Форма.смартНаблюдает);
		
		ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.Список.Имя);
		ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Контроль");
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.Использование = Истина;
		ЭлементУсловия.ПравоеЗначение = Истина;
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 245, 170));
		//-- #1867 смарт: Фролов 18.06.2024
		
		//++ #1909 смарт: Фролов 09.07.2024 //Организовать корректный пересчет валют в Интересе.
		НовыйЭлемент = Форма.Элементы.Вставить("смартОжидаемаяВыручкаВВалютеДокумента", Тип("ПолеФормы"), Форма.Элементы.Список, Форма.Элементы.Подразделение);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Ожидаемая выручка";
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ПутьКДанным = "Список.смартОжидаемаяВыручкаВВалютеДокумента";
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартВалюта", Тип("ПолеФормы"), Форма.Элементы.Список, Форма.Элементы.Подразделение);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Валюта";
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ПутьКДанным = "Список.Валюта";
		
		Форма.Элементы.ОжидаемаяВыручка.Заголовок = "Ожидаемая выручка в вал. упр. учета";
		Форма.Элементы.ОжидаемаяВыручка.Видимость = Ложь;
		//-- #1909 смарт: Фролов 09.07.2024
		
		//++ #Б-5684 смарт: Фролов 20.02.2026 //Документ и Список Интерес. Оптимизация.
		//++ #1942 смарт: Фролов 22.07.2024 //В список Интересов добавить колонку с датой последней заметки
		//НовыйЭлемент = Форма.Элементы.Вставить("смартДатаЗаметки", Тип("ПолеФормы"), Форма.Элементы.Список);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.Заголовок = "Дата заметки";
		//НовыйЭлемент.Видимость = Истина;
		//НовыйЭлемент.ПутьКДанным = "Список.смартДатаЗаметки";
		//
		//УсловноеОформлениеКД = Форма.УсловноеОформление;
		//ЭлементУсловногоОформления = УсловноеОформлениеКД.Элементы.Добавить();
		//ЭлементУсловногоОформления.Использование = Истина;
		//
		//ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("смартДатаЗаметки");
		//
		//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=dd.MM.yyyy");
		//-- #1942 смарт: Фролов 22.07.2024
		//-- #Б-5684 смарт: Фролов 20.02.2026
		
		//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТипУслуги", Новый ОписаниеТипов("СписокЗначений"),, "Тип услуги", Истина));
		
		//++ #Б-976 смарт: Фролов 22.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЗаметки", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "смартЗаметки" , "Автор"));		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ДатаЗаметки", Новый ОписаниеТипов("Дата"), "смартЗаметки" , "ДатаЗаметки"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Интерес", Новый ОписаниеТипов("ДокументСсылка.CRM_Интерес"), "смартЗаметки" , "Интерес"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Предмет", Новый ОписаниеТипов("СправочникСсылка.Партнеры"), "смартЗаметки" , "Предмет"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Содержание", Новый ОписаниеТипов("Строка"), "смартЗаметки" , "Содержание"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Ссылка", Новый ОписаниеТипов("СправочникСсылка.Заметки"), "смартЗаметки" , "Ссылка"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТолькоМоиЗаметки", Новый ОписаниеТипов("Булево")));
		//-- #Б-976 смарт: Фролов 22.10.2024
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);

		Форма.смартТипУслуги.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CRM_ТипУслуги");
		
		Форма.Команды.Добавить("смартТипУслуги");
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартТипУслуги", Тип("ПолеФормы"), Форма.Элементы.ГруппаФильтры, Форма.Элементы.смартНовые);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартТипУслуги";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.КнопкаОчистки = Истина;              	
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.ПодсказкаВвода = "Тип услуги"; 
		НовыйЭлемент.МаксимальнаяШирина = 24;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;	
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");			
		//-- #1910 смарт: Лопато 07.08.2024
		
		//++ #Б-5684 смарт: Фролов 20.02.2026 //Документ и Список Интерес. Оптимизация.
		//++ #Б-976 смарт: Фролов 22.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
		//НовыйЭлементГруппа = Форма.Элементы.Вставить("смартГруппаЗаказКлиента", Тип("ГруппаФормы"), Форма.Элементы.Список, Форма.Элементы.смартДатаЗаметки); 
		//										
		//НовыйЭлементГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
		//НовыйЭлементГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
		//НовыйЭлементГруппа.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента .Центр;
		//НовыйЭлементГруппа.ОтображатьВШапке = Истина;
		//НовыйЭлементГруппа.ОтображатьЗаголовок = Истина;
		//НовыйЭлементГруппа.Заголовок = "Заказ клиента";
		//
		//НовыйЭлемент = Форма.Элементы.Вставить("смартПроцентОплаты", Тип("ПолеФормы"), Форма.Элементы.смартГруппаЗаказКлиента);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		//НовыйЭлемент.Заголовок = "Оплачено, %";
		//НовыйЭлемент.Видимость = Истина;
		//НовыйЭлемент.ПутьКДанным = "Список.ПроцентОплаты";
		//
		//НовыйЭлемент = Форма.Элементы.Вставить("смартПроцентОтгрузки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаЗаказКлиента);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		//НовыйЭлемент.Заголовок = "Отгружено, %";
		//НовыйЭлемент.Видимость = Истина;
		//НовыйЭлемент.ПутьКДанным = "Список.ПроцентОтгрузки";
		//
		//НовыйЭлемент = Форма.Элементы.Вставить("смартПроцентДолга", Тип("ПолеФормы"), Форма.Элементы.смартГруппаЗаказКлиента);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		//НовыйЭлемент.Заголовок = "Долг, %";
		//НовыйЭлемент.Видимость = Истина;
		//НовыйЭлемент.ПутьКДанным = "Список.ПроцентДолга";
		//-- #Б-5684 смарт: Фролов 20.02.2026
		
		НовыйЭлемент = Форма.Элементы.Вставить("ТипУслуги", Тип("ПолеФормы"), Форма.Элементы.Список, Форма.Элементы.СостояниеИнтереса);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = "Тип услуги";
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ПутьКДанным = "Список.ТипУслуги";
		
		НовыйЭлементГруппа = Форма.Элементы.Добавить("смартГруппасмартЗаметки", Тип("ГруппаФормы"), Форма.Элементы.ГруппаСписок); 
												
		НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлементГруппа.ОтображатьЗаголовок = Истина;
		НовыйЭлементГруппа.Заголовок = "Заметки";
		НовыйЭлементГруппа.РастягиватьПоВертикали = Ложь;
		НовыйЭлементГруппа.Высота = 6;
		НовыйЭлементГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		НовыйЭлементГруппа.Скрыть();
		
		ТаблицасмартЗаметки = Форма.Элементы.Добавить("ТаблицасмартЗаметки", Тип("ТаблицаФормы"), Форма.Элементы.смартГруппасмартЗаметки);
		ТаблицасмартЗаметки.ПутьКДанным = "смартЗаметки";
		ТаблицасмартЗаметки.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
		ТаблицасмартЗаметки.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
		ТаблицасмартЗаметки.АвтоМаксимальнаяВысота = Ложь;
		ТаблицасмартЗаметки.МаксимальнаяВысота = 6;
		ТаблицасмартЗаметки.Высота = 5;
		ТаблицасмартЗаметки.РастягиватьПоВертикали = Ложь;
		ТаблицасмартЗаметки.Подвал = Ложь;
		ТаблицасмартЗаметки.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
		ТаблицасмартЗаметки.УстановитьДействие("Выбор", "смартЗаметкиВыбор");
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартАвтор", Тип("ПолеФормы"), Форма.Элементы.ТаблицасмартЗаметки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗаметки.Автор";
		НовыйЭлемент.Заголовок = "Автор";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ДатаЗаметки", Тип("ПолеФормы"), Форма.Элементы.ТаблицасмартЗаметки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗаметки.ДатаЗаметки";
		НовыйЭлемент.Заголовок = "Дата заметки";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартИнтерес", Тип("ПолеФормы"), Форма.Элементы.ТаблицасмартЗаметки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗаметки.Интерес";
		НовыйЭлемент.Заголовок = "Интерес";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартПредмет", Тип("ПолеФормы"), Форма.Элементы.ТаблицасмартЗаметки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗаметки.Предмет";
		НовыйЭлемент.Заголовок = "Предмет";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартСодержание", Тип("ПолеФормы"), Форма.Элементы.ТаблицасмартЗаметки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗаметки.Содержание";
		НовыйЭлемент.Заголовок = "Содержание";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартСсылка", Тип("ПолеФормы"), Форма.Элементы.ТаблицасмартЗаметки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартЗаметки.Ссылка";
		НовыйЭлемент.Заголовок = "Ссылка";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		НовыйЭлементГруппа = Форма.Элементы.Добавить("смартГруппаЗаметкиНастройки", Тип("ГруппаФормы"), Форма.Элементы.смартГруппасмартЗаметки); 
												
		НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НовыйЭлементГруппа.ОтображатьЗаголовок = Истина;
		НовыйЭлементГруппа.Заголовок = "Настройки заметок";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартТолькоМоиЗаметки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаЗаметкиНастройки); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "смартТолькоМоиЗаметки";
		НовыйЭлемент.Заголовок = "Только мои заметки";
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартТолькоМоиЗаметкиПриИзменении");
		
		Команда = Форма.Команды.Добавить("смартСоздатьЗаметку");
		Команда.Действие = "смартСоздатьЗаметку";
		Команда.Отображение = ОтображениеКнопки.Текст;
		
		смартСоздатьЗаметкуКнопка = Форма.Элементы.Вставить("смартСоздатьЗаметку", Тип("КнопкаФормы"), Форма.Элементы.смартГруппасмартЗаметки,
			Форма.Элементы.ТаблицасмартЗаметки);
		смартСоздатьЗаметкуКнопка.ИмяКоманды = "смартСоздатьЗаметку";
		смартСоздатьЗаметкуКнопка.Заголовок = "Создать заметку";
		//-- #Б-976 смарт: Фролов 22.10.2024
		
	КонецЕсли;
	//-- #1809 смарт: Ермаков 13.05.2024
	
	//++ #1914 смарт: Фролов 10.07.2024 //Доработка формы Мои задачи для коммерческого отдела.
	Если Форма.ИмяФормы = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаСписка" Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаПоказателей", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Показатель", Новый ОписаниеТипов("Строка"), "ТаблицаПоказателей" , "Показатель"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)), "ТаблицаПоказателей" , "Количество"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЭтоИсполнитель", Новый ОписаниеТипов("Булево"), "ТаблицаПоказателей" , "ЭтоИсполнитель"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "ТаблицаПоказателей" , "Пользователь"));
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартОтборАвтор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), , "Автор"));
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		ПолеТаблицаПоказателей = Форма.Элементы.Вставить("смартТаблицаПоказателей", Тип("ТаблицаФормы"),
		Форма.Элементы.ГруппаПолеОтображенияСодержания, Форма.Элементы.ПолеОтображениеСодержания);
		ПолеТаблицаПоказателей.ПутьКДанным = "ТаблицаПоказателей";
		ПолеТаблицаПоказателей.Отображение = ОтображениеТаблицы.Список;
		ПолеТаблицаПоказателей.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ПолеТаблицаПоказателей.ТолькоПросмотр = Истина;
		ПолеТаблицаПоказателей.ЦветФона = Новый Цвет(255, 255, 255);
		ПолеТаблицаПоказателей.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеТаблицаПоказателей.Шапка = Ложь;
		ПолеТаблицаПоказателей.ЧередованиеЦветовСтрок = Ложь;
		ПолеТаблицаПоказателей.Ширина = 28;
		ПолеТаблицаПоказателей.АвтоМаксимальнаяШирина = Ложь;
		ПолеТаблицаПоказателей.ГоризонтальныеЛинии = Ложь;
		ПолеТаблицаПоказателей.РастягиватьПоГоризонтали = Ложь;
		ПолеТаблицаПоказателей.ЦветРамки = Новый Цвет(250, 250, 250);
		ПолеТаблицаПоказателей.ЦветФона = Новый Цвет(240, 240, 240);
		ПолеТаблицаПоказателей.УстановитьДействие("Выбор", "смартТаблицаПоказателейВыбор");
		
		НоваяКолонка = Форма.Элементы.Добавить("ТаблицаПоказателейПоказатель", Тип("ПолеФормы"), Форма.Элементы.смартТаблицаПоказателей);
		НоваяКолонка.Заголовок = "Показатель";
		НоваяКолонка.ПутьКДанным = "ТаблицаПоказателей.Показатель";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Ширина = 25;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 10, Истина, , Истина);
		НоваяКолонка.ЦветТекста = Новый Цвет(28, 85, 174);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("ТаблицаПоказателейКоличество", Тип("ПолеФормы"), Форма.Элементы.смартТаблицаПоказателей);
		НоваяКолонка.Заголовок = "Количество";
		НоваяКолонка.ПутьКДанным = "ТаблицаПоказателей.Количество";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Ширина = 3;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 10, Истина, , Истина);
		НоваяКолонка.ЦветТекста = Новый Цвет(28, 85, 174);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		//НовыйЭлемент = Форма.Элементы.Вставить("смартТаблицаПоказателейЗаголовок", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаПолеОтображенияСодержания, Форма.Элементы.смартТаблицаПоказателей);
		//НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		//НовыйЭлемент.Заголовок = "Быстрые отборы";
		//НовыйЭлемент.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 12, Истина, ,Ложь);
		//НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартОтборАвтор", Тип("ПолеФормы"), Форма.Элементы.ГруппаФильтры, Форма.Элементы.ОтборИсполнитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Автор";
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.КнопкаОчистки = Истина;
		НовыйЭлемент.КнопкаОткрытия = Ложь;
		НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
		НовыйЭлемент.ПутьКДанным = "смартОтборАвтор";
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартАвторПриЗменении");
		НовыйЭлемент.УстановитьДействие("Очистка", "смартАвторОчистка");
		
		ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
		
		ГруппаЭлементовОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаЭлементовОтбора.Использование = Истина;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПоказателей.Количество"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;  
		ЭлементОтбора.ПравоеЗначение = 0;
		ЭлементОтбора.Использование = Истина;
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("смартТаблицаПоказателей");
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
		ПолеОформления.Использование = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартНадписьКрайнийСрок", Тип("ДекорацияФормы"), Форма.Элементы.ЗначенияОтбораПериод);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Крайний срок:";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтборКрайнийСрокСегодня", Тип("ДекорацияФормы"), Форма.Элементы.ЗначенияОтбораПериод);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "сегодня";
		НовыйЭлемент.Гиперссылка = Истина; 
		НовыйЭлемент.УстановитьДействие("Нажатие", "смартОтборКрайнийСрокСегодняНажатие");

		НовыйЭлемент = Форма.Элементы.Добавить("смартОтборКрайнийСрокЗавтра", Тип("ДекорацияФормы"), Форма.Элементы.ЗначенияОтбораПериод);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "завтра";
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.УстановитьДействие("Нажатие", "смартОтборКрайнийСрокЗавтраНажатие");

		НовыйЭлемент = Форма.Элементы.Добавить("смартОтборКрайнийСрокНеделя", Тип("ДекорацияФормы"), Форма.Элементы.ЗначенияОтбораПериод);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "до конца недели";
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.УстановитьДействие("Нажатие", "смартОтборКрайнийСрокНеделяНажатие");
		
		Команда = Форма.Команды.Добавить("смартКрайнийСрокОчистка");
		Команда.Действие = "смартОтборКрайнийСрокОчистить";
		Команда.Отображение = ОтображениеКнопки.Текст;
		
		КрайнийСрокОчистить = Форма.Элементы.Вставить("смартКрайнийСрокОчистка", Тип("КнопкаФормы"), Форма.Элементы.ЗначенияОтбораПериод);
		КрайнийСрокОчистить.ИмяКоманды = "смартКрайнийСрокОчистка";
		КрайнийСрокОчистить.Заголовок = "Х";
		
		Форма.ОтборСозданы.Добавить(Новый СтандартныйПериод(НачалоДня(ТекущаяДата() + 86400), КонецДня(ТекущаяДата() + 86400)));
		Форма.ОтборСозданы.Добавить(Новый СтандартныйПериод(НачалоДня(ТекущаяДата()), КонецНедели(ТекущаяДата())));
		Форма.ОтборСозданы.Добавить(Новый СтандартныйПериод(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата())));
		
		Форма.Элементы.ОтборПроект.Видимость = Ложь;
		
		//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
		ПодключаемыеКоманды.ПриСозданииНаСервере(Форма);
		//-- #1989 смарт: Лопато 15.08.2024
		
	КонецЕсли;
	//-- #1914 смарт: Фролов 10.07.2024
	
	//++ #1916 смарт: Фролов 15.07.2024 //При создании задачи на основании телефонного звонка не указывается предмет.
	Если Форма.ИмяФормы = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи" Тогда	
		
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) 
			И НЕ ЗначениеЗаполнено(Форма.Объект.Предмет) И Форма.Параметры.Свойство("Основание") Тогда
			
			Форма.Объект.Предмет = Форма.Параметры.Основание;
			Форма.Объект.ПредметСтрокой = Форма.Параметры.Основание;
			
			Форма.Элементы.ПредметСтрокой.Гиперссылка = Истина;
			Форма.Элементы.ПредметСтрокой.Видимость = Истина;
			
		КонецЕсли;
		
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		НовыйЭлемент = Форма.Элементы.Вставить("смартВидЗадачи", Тип("ПолеФормы"), Форма.Элементы.Содержание, Форма.Элементы.Наименование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Вид задачи";
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ПутьКДанным = "Объект.смартВидЗадачи";
		
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			Форма.Объект.смартРучноеДобавление = Истина;	
		КонецЕсли;	
		//-- #1929 смарт: Фролов 23.07.2024
		
		//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
		Форма.Элементы.Переместить(Форма.Элементы.ФормаСоздатьНаОсновании, Форма.Элементы.КоманднаяПанельНапоминания);
		//-- #1989 смарт: Лопато 15.08.2024
		
	КонецЕсли;
	//-- #1916 смарт: Фролов 15.07.2024	
	
	//++ #1929 смарт: Фролов 25.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
	Если Форма.ИмяФормы = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачиКраткая" Тогда
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартВидЗадачи", Тип("ПолеФормы"), Форма, Форма.Элементы.Исполнитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Вид задачи";
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ПутьКДанным = "Объект.смартВидЗадачи";
		
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			Форма.Объект.смартРучноеДобавление = Истина;	
		КонецЕсли;	

		//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
		ПодключаемыеКоманды.ПриСозданииНаСервере(Форма);
		//-- #1989 смарт: Лопато 15.08.2024
		
	КонецЕсли;
	//-- #1929 смарт: Фролов 27.07.2024
	
	//++ #1984 смарт: Фролов 13.08.2024 //Запрет на привязку более одного заказа клиента к Интересу.
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		
		//++ #Б-3276 смарт: Фролов 12.05.2025 //Создание Интереса после создания Заказа клиента.
		Если Форма.CRM_ТаблицаИнтересов.Количество() = 0 Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("смартСоздатьИнтерес");
			НоваяКоманда.Действие = "смартСоздатьИнтерес";
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартСоздатьИнтересПробел", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаСтрокаИнтереса, Форма.Элементы.ОткрытьИнтерес);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = " ";
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартСоздатьИнтерес", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСтрокаИнтереса, Форма.Элементы.ОткрытьИнтерес);
			НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			НовыйЭлемент.ИмяКоманды = "смартСоздатьИнтерес";
			НовыйЭлемент.Заголовок = "Создать интерес";
			
		//++ #Б-3578 смарт: Фролов 19.06.2025 //Ошибка. В Заказ Клиента автоматом подставляется некорректный Интерес. 
		ИначеЕсли ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
			
			Форма.CRM_ТаблицаИнтересов.Очистить();
			Форма.ЕстьИнтересыДляВыбора = Ложь;
			Форма.CRM_ИнтересСтрокой = "";
		//-- #Б-3578 смарт: Фролов 19.06.2025
		
		КонецЕсли;
		//-- #Б-3276 смарт: Фролов 12.05.2025
		
		//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
		СписокИсполнителей = CRM_БизнесПроцессыСервер.ПолучитьВозможныхИсполнителейПоРоли(
								Справочники.РолиИсполнителей.смартСогласователиПродажСНПЧ);
									
		смартЭлементДекорацияСогласованиеСНПЧ = Форма.Элементы.Вставить("смартДекорацияСогласованиеСНПЧ", Тип("ДекорацияФормы"), 
			Форма.Элементы.ГруппаДатаОтгрузкиНеОтгружатьЧастями, Форма.Элементы.ЖелаемаяДатаОтгрузки);
		смартЭлементДекорацияСогласованиеСНПЧ.Вид = ВидДекорацииФормы.Надпись;
		смартЭлементДекорацияСогласованиеСНПЧ.Видимость = Ложь;	
			
		Если Форма.Объект.смартСогласованиеПродажиСНПЧ = Перечисления.РезультатыСогласования.Согласовано Тогда
			
			смартЭлементДекорацияСогласованиеСНПЧ.Заголовок = "Согласовано СНПЧ";
			смартЭлементДекорацияСогласованиеСНПЧ.ЦветТекста = Новый Цвет(0, 150, 70);
			смартЭлементДекорацияСогласованиеСНПЧ.Видимость = Истина;
			
		ИначеЕсли Форма.Объект.смартСогласованиеПродажиСНПЧ = Перечисления.РезультатыСогласования.НеСогласовано Тогда
			
			смартЭлементДекорацияСогласованиеСНПЧ.Заголовок = "Не согласовано СНПЧ";
			смартЭлементДекорацияСогласованиеСНПЧ.ЦветТекста = Новый Цвет(255, 0, 0);
			смартЭлементДекорацияСогласованиеСНПЧ.Видимость = Истина;
									
		КонецЕсли;		
				
		Если СписокИсполнителей.НайтиПоЗначению(Пользователи.ТекущийПользователь()) = Неопределено Тогда
				
			Если Форма.Объект.смартСогласованиеПродажиСНПЧ = Перечисления.РезультатыСогласования.НаСогласовании Тогда	
				
				смартЭлементДекорацияСогласованиеСНПЧ.Заголовок = "На согласовании СНПЧ";
				смартЭлементДекорацияСогласованиеСНПЧ.ЦветТекста = Новый Цвет(28, 85, 174);
				смартЭлементДекорацияСогласованиеСНПЧ.Видимость = Истина;
				
			Иначе
				
				НоваяКоманда = Форма.Команды.Добавить("смартОтправитьНаСогласованиеСНПЧ");
				НоваяКоманда.Действие = "смартОтправитьНаСогласованиеСНПЧ";
				
				НовыйЭлемент = Форма.Элементы.Вставить("смартОтправитьНаСогласованиеСНПЧ", Тип("КнопкаФормы"), Форма.Элементы.Товары.КоманднаяПанель);
				НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
				НовыйЭлемент.ИмяКоманды = "смартОтправитьНаСогласованиеСНПЧ";
				НовыйЭлемент.Заголовок = "Отправить на согласование СНПЧ";
				
			КонецЕсли;	
			
		Иначе	
			
			Если Форма.Объект.смартСогласованиеПродажиСНПЧ = Перечисления.РезультатыСогласования.НаСогласовании Тогда	
				
				НоваяКоманда = Форма.Команды.Добавить("смартСогласоватьСНПЧ");
				НоваяКоманда.Действие = "смартСогласоватьСНПЧ";
				
				НовыйЭлемент = Форма.Элементы.Вставить("смартСогласоватьСНПЧ", Тип("КнопкаФормы"), Форма.Элементы.Товары.КоманднаяПанель);
				НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
				НовыйЭлемент.ИмяКоманды = "смартСогласоватьСНПЧ";
				НовыйЭлемент.Заголовок = "Согласовать СНПЧ";
				НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
				
				НоваяКоманда = Форма.Команды.Добавить("смартНЕСогласоватьСНПЧ");
				НоваяКоманда.Действие = "смартНЕСогласоватьСНПЧ";
				
				НовыйЭлемент = Форма.Элементы.Вставить("смартНЕСогласоватьСНПЧ", Тип("КнопкаФормы"), Форма.Элементы.Товары.КоманднаяПанель);
				НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
				НовыйЭлемент.ИмяКоманды = "смартНЕСогласоватьСНПЧ";
				НовыйЭлемент.Заголовок = "НЕ согласовать СНПЧ";
				НовыйЭлемент.ЦветТекста = Новый Цвет(255, 0, 0);
				
			КонецЕсли;	
			
		КонецЕсли;	
		//-- #Б-3430 смарт: Фролов 01.06.2025
		
		Если Форма.Объект.Ссылка.Пустая() Тогда
		
			Если Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
				
				ВыбранныйИнтерес = Форма.CRM_ТаблицаИнтересов[0].Ссылка;
				
				НайденныйЗаказ = смартОбщегоНазначения.ПроверитьНаличиеЗаказаПоИнтересу(ВыбранныйИнтерес);
				
				Если ЗначениеЗаполнено(НайденныйЗаказ) Тогда
					
					ОбщегоНазначения.СообщитьПользователю("К интересу " + ВыбранныйИнтерес + " уже привязан заказ " + НайденныйЗаказ);
					Форма.CRM_Интерес_Клиент = Неопределено;
					Форма.CRM_Интерес_Контакт = Неопределено;
					Форма.CRM_ИнтересСтрокой = Неопределено;
					//++ #Б-5176 смарт: Фролов 23.12.2025 //Заявка на ПНР не привязывается к заказу клиента	
					Если ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
						Форма.Объект.ДокументОснование = Неопределено;
					КонецЕсли;
					//Форма.Объект.ДокументОснование = Неопределено;
					//-- #Б-5176 смарт: Фролов 23.12.2025
					
					Форма.CRM_ТаблицаИнтересов.Очистить();
					
					Если Форма.Параметры.Свойство("Основание") Тогда
						
						Если ТипЗнч(Форма.Параметры.Основание) = Тип("ДокументСсылка.CRM_Интерес") Тогда
							
							Форма.Параметры.Основание = Неопределено;
							
						КонецЕсли;	
							
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
			
		//++ #Б-3472 смарт: Фролов 04.06.2025 //Заказ клиента. Доставка. Доработка.
		Иначе
			
			Если НЕ Пользователи.РолиДоступны("ДобавлениеИзменениеЗаданийНаПеревозку") Тогда
				
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
				|	СУММА(ВЫБОР
				|			КОГДА ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
				|				ТОГДА 1
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК Отгрузка,
				|	СУММА(0) КАК Адмирал,
				|	СУММА(0) КАК ЗаданиеНаПеревозку
				|ПОМЕСТИТЬ ИсходныеДанные
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|ГДЕ
				|	ЗаказКлиентаТовары.Ссылка = &Ссылка
				|	И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиентаТовары.Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаказКлиента.Ссылка,
				|	СУММА(0),
				|	СУММА(ВЫБОР
				|			КОГДА СТРНАЙТИ(ЗаказКлиента.Склад.Наименование, ""Адмирал"") = 0
				|				ТОГДА 0
				|			ИНАЧЕ 1
				|		КОНЕЦ),
				|	СУММА(0)
				|ИЗ
				|	Документ.ЗаказКлиента КАК ЗаказКлиента
				|ГДЕ
				|	ЗаказКлиента.Ссылка = &Ссылка
				|	И НЕ ЗаказКлиента.Ссылка.ПометкаУдаления
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиента.Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение,
				|	СУММА(0),
				|	СУММА(0),
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка)
				|ИЗ
				|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
				|ГДЕ
				|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение ССЫЛКА Документ.ЗаказКлиента
				|	И НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
				|	И ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Ссылка = &Ссылка
				|	И НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ПометкаУдаления
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаказКлиентаТовары.Ссылка,
				|	СУММА(0),
				|	СУММА(ВЫБОР
				|			КОГДА СТРНАЙТИ(ЗаказКлиентаТовары.Склад.Наименование, ""Адмирал"") = 0
				|				ТОГДА 0
				|			ИНАЧЕ 1
				|		КОНЕЦ),
				|	СУММА(0)
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|ГДЕ
				|	ЗаказКлиентаТовары.Ссылка = &Ссылка
				|	И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиентаТовары.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ИсходныеДанные.ЗаказКлиента КАК ЗаказКлиента,
				|	СУММА(ИсходныеДанные.Отгрузка) КАК Отгрузка,
				|	СУММА(ИсходныеДанные.Адмирал) КАК Адмирал,
				|	СУММА(ЕСТЬNULL(ИсходныеДанные.ЗаданиеНаПеревозку, 0)) КАК ЗаданиеНаПеревозку
				|ИЗ
				|	ИсходныеДанные КАК ИсходныеДанные
				|
				|СГРУППИРОВАТЬ ПО
				|	ИсходныеДанные.ЗаказКлиента");
				Запрос.УстановитьПараметр("Ссылка", Форма.Объект.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда 
					
					Если Выборка.Отгрузка > 0 И Выборка.Адмирал > 0 И Выборка.ЗаданиеНаПеревозку > 0 Тогда
						
						Форма.Элементы.СпособДоставки.ТолькоПросмотр = Истина;
						
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//-- #Б-3472 смарт: Фролов 04.06.2025
		
		//++ #Б-3832 смарт: Фролов 16.07.2025 //Возможность смены менеджера в Заказе клиента в рамках регионального представительства.
	    Если НЕ РольДоступна("ПолныеПрава") Тогда
			
			Если ЗначениеЗаполнено(Форма.Объект.Менеджер) Тогда
			
				Если Форма.Объект.Менеджер.Подразделение.ТекущийРуководитель = Пользователи.ТекущийПользователь().ФизическоеЛицо Тогда
					
					Запрос = Новый Запрос(
					"ВЫБРАТЬ
					|	Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Пользователи
					|ГДЕ
					|	Подразделение.ТекущийРуководитель = &ТекущийРуководитель
					|
					|УПОРЯДОЧИТЬ ПО
					|	Наименование");
					Запрос.УстановитьПараметр("ТекущийРуководитель", Пользователи.ТекущийПользователь().ФизическоеЛицо);
					
					Форма.Элементы.Менеджер.РежимВыбораИзСписка = Истина;
					Форма.Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
					
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		//-- #Б-3832 смарт: Фролов 16.07.2025
		
		//++ #Б-3846 смарт: Фролов 17.07.2025 //Выбор в заказе клиента только разрешенных Источников рекламного взаимодействия. 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартИсточникиРекламногоВоздействия
		|ГДЕ
		|	РазрешеноИспользоватьВЗаказеКлиента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование");
		
		Форма.Элементы.ТоварыРекламноеВоздействие.РежимВыбораИзСписка = Истина;
		Форма.Элементы.ТоварыРекламноеВоздействие.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		//-- #Б-3846 смарт: Фролов 17.07.2025
	
	КонецЕсли;
	//-- #1984 смарт: Фролов 13.08.2024
	
	//++ #1982 смарт: Ермаков 14.08.2024 / Добавить возможность прикладывать файл в документ Заказ на перемещение
	Если Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаСписка" Тогда
		
		// Добавляем "Скрепку" в список документов
		
		ТекстЗапроса = Форма.Список.ТекстЗапроса;
		
		ТекстЗапроса = 
			СтрЗаменить(
				ТекстЗапроса, 
				"ИЗ",
				",
				|	ДокументЗаказНаПеремещение.МоментВремени,
				|
				|	// ++ #1982 смарт: Ермаков 14.08.2024 / Добавить возможность прикладывать файл в документ Заказ на перемещение
				|	ВЫБОР
				|		КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы ЕСТЬ NULL
				|			ТОГДА 1
				|		КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы 
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК ЕстьФайлы
				|	//-- #1982 смарт: Ермаков 14.08.2024
				|
				|ИЗ
				|");
				
		ТекстЗапроса = 
			ТекстЗапроса + "
			|               
			|		// ++ #1982 смарт: Ермаков 14.08.2024 / Добавить возможность прикладывать файл в документ Заказ на перемещение			
			|		ЛЕВОЕ СОЕДИНЕНИЕ
			|			РегистрСведений.НаличиеФайлов КАК НаличиеПрисоединенныхФайлов
			|		ПО
			|			ДокументЗаказНаПеремещение.Ссылка = НаличиеПрисоединенныхФайлов.ОбъектСФайлами
			|		//-- #1982 смарт: Ермаков 14.08.2024			
			|";

		Форма.Список.ТекстЗапроса = ТекстЗапроса;
		
		НовыйЭлемент = 
			Форма.Элементы.Вставить(
				"ЕстьФайлы", 
				Тип("ПолеФормы"), 
				Форма.Элементы.Список, 
				Форма.Элементы.ХозяйственнаяОперация);
				
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;
		НовыйЭлемент.ПутьКданным = "Список.ЕстьФайлы";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.Скрепка;
		НовыйЭлемент.КартинкаЗначений = БиблиотекаКартинок.Скрепка;
		НовыйЭлемент.Видимость = Истина;
		
	КонецЕсли;
	//-- #1982 смарт: Ермаков 14.08.2024
	
	//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
	Если Форма.ИмяФормы = "Справочник.CRM_ПричиныОтказаПоИнтересам.Форма.ФормаЭлемента" Тогда 
		
		Форма.Элементы.ТипОбращения.Видимость			= Истина;
		Форма.Элементы.Сценарий.Видимость 				= Истина;
		Форма.Элементы.ОтображатьПоУмолчанию.Видимость 	= Истина; 
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.CRM_ПричиныОтказаПоИнтересам.Форма.ФормаВыбора" Тогда 
		
		Форма.Список.ПроизвольныйЗапрос = Истина; 
		
		Если Форма.Параметры.Свойство("Сценарий") И Форма.Параметры.Свойство("ТипОбращения") Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПричиныОтказаПоИнтересам.Ссылка КАК Ссылка,
			|	ПричиныОтказаПоИнтересам.ПометкаУдаления КАК ПометкаУдаления,
			|	ПричиныОтказаПоИнтересам.Родитель КАК Родитель,
			|	ПричиныОтказаПоИнтересам.ЭтоГруппа КАК ЭтоГруппа,
			|	ПричиныОтказаПоИнтересам.Код КАК Код,
			|	ПричиныОтказаПоИнтересам.Наименование КАК Наименование,
			|	ПричиныОтказаПоИнтересам.ТипОбращения КАК ТипОбращения,
			|	ПричиныОтказаПоИнтересам.Сценарий КАК Сценарий,
			|	ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию КАК ОтображатьПоУмолчанию,
			|	ПричиныОтказаПоИнтересам.Предопределенный КАК Предопределенный,
			|	ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	ПричиныОтказаПоИнтересам.ВерсияДанных КАК ВерсияДанных
			|ИЗ
			|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныОтказаПоИнтересам
			|ГДЕ
			|	ПричиныОтказаПоИнтересам.ТипОбращения = &ТипОбращения
			|	И ПричиныОтказаПоИнтересам.Сценарий = &Сценарий
			|	И НЕ ПричиныОтказаПоИнтересам.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ПричиныОтказаПоИнтересам.Ссылка,
			|	ПричиныОтказаПоИнтересам.ПометкаУдаления,
			|	ПричиныОтказаПоИнтересам.Родитель,
			|	ПричиныОтказаПоИнтересам.ЭтоГруппа,
			|	ПричиныОтказаПоИнтересам.Код,
			|	ПричиныОтказаПоИнтересам.Наименование,
			|	ПричиныОтказаПоИнтересам.ТипОбращения,
			|	ПричиныОтказаПоИнтересам.Сценарий,
			|	ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию,
			|	ПричиныОтказаПоИнтересам.Предопределенный,
			|	ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных,
			|	ПричиныОтказаПоИнтересам.ВерсияДанных
			|ИЗ
			|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныОтказаПоИнтересам
			|ГДЕ
			|	ПричиныОтказаПоИнтересам.ТипОбращения = &ТипОбращения
			|	И ПричиныОтказаПоИнтересам.Сценарий = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
			|	И НЕ ПричиныОтказаПоИнтересам.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ПричиныОтказаПоИнтересам.Ссылка,
			|	ПричиныОтказаПоИнтересам.ПометкаУдаления,
			|	ПричиныОтказаПоИнтересам.Родитель,
			|	ПричиныОтказаПоИнтересам.ЭтоГруппа,
			|	ПричиныОтказаПоИнтересам.Код,
			|	ПричиныОтказаПоИнтересам.Наименование,
			|	ПричиныОтказаПоИнтересам.ТипОбращения,
			|	ПричиныОтказаПоИнтересам.Сценарий,
			|	ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию,
			|	ПричиныОтказаПоИнтересам.Предопределенный,
			|	ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных,
			|	ПричиныОтказаПоИнтересам.ВерсияДанных
			|ИЗ
			|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныОтказаПоИнтересам
			|ГДЕ
			|	ПричиныОтказаПоИнтересам.ТипОбращения = ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.ПустаяСсылка)
			|	И ПричиныОтказаПоИнтересам.Сценарий = &Сценарий
			|	И НЕ ПричиныОтказаПоИнтересам.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ПричиныОтказаПоИнтересам.Ссылка,
			|	ПричиныОтказаПоИнтересам.ПометкаУдаления,
			|	ПричиныОтказаПоИнтересам.Родитель,
			|	ПричиныОтказаПоИнтересам.ЭтоГруппа,
			|	ПричиныОтказаПоИнтересам.Код,
			|	ПричиныОтказаПоИнтересам.Наименование,
			|	ПричиныОтказаПоИнтересам.ТипОбращения,
			|	ПричиныОтказаПоИнтересам.Сценарий,
			|	ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию,
			|	ПричиныОтказаПоИнтересам.Предопределенный,
			|	ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных,
			|	ПричиныОтказаПоИнтересам.ВерсияДанных
			|ИЗ
			|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныОтказаПоИнтересам
			|ГДЕ
			|	ПричиныОтказаПоИнтересам.ТипОбращения = ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.ПустаяСсылка)
			|	И ПричиныОтказаПоИнтересам.Сценарий = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
			|	И НЕ ПричиныОтказаПоИнтересам.ПометкаУдаления";
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);

			Если ЗначениеЗаполнено(Форма.Параметры.Сценарий) Тогда
				Форма.Список.Параметры.УстановитьЗначениеПараметра("Сценарий", Форма.Параметры.Сценарий);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Форма.Параметры.ТипОбращения) Тогда
				Форма.Список.Параметры.УстановитьЗначениеПараметра("ТипОбращения", Форма.Параметры.ТипОбращения);
			КонецЕсли;
			
		Иначе 
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПричиныОтказаПоИнтересам.Ссылка КАК Ссылка,
			|	ПричиныОтказаПоИнтересам.ПометкаУдаления КАК ПометкаУдаления,
			|	ПричиныОтказаПоИнтересам.Родитель КАК Родитель,
			|	ПричиныОтказаПоИнтересам.ЭтоГруппа КАК ЭтоГруппа,
			|	ПричиныОтказаПоИнтересам.Код КАК Код,
			|	ПричиныОтказаПоИнтересам.Наименование КАК Наименование,
			|	ПричиныОтказаПоИнтересам.ТипОбращения КАК ТипОбращения,
			|	ПричиныОтказаПоИнтересам.Сценарий КАК Сценарий,
			|	ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию КАК ОтображатьПоУмолчанию,
			|	ПричиныОтказаПоИнтересам.Предопределенный КАК Предопределенный,
			|	ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	ПричиныОтказаПоИнтересам.ВерсияДанных КАК ВерсияДанных
			|ИЗ
			|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныОтказаПоИнтересам";
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Форма.Элементы.Список, СвойстваСписка);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-1136 смарт: Мосолов 15.10.2024 

	//++ #Б-1138 смарт: Лопато 15.10.2024 //ИМ. Выгрузка заказов на сайт. Ограничение по дате  
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая" Тогда
			 
		НовыйЭлемент = Форма.Элементы.Вставить("смартДатаНачалаОбменаДокументамиИМ", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно, Форма.Элементы.Ссылка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДатаНачалаОбменаДокументамиИМ";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	//-- #Б-1138 смарт: Лопато 15.10.2024 
	
	//++ #4050 смарт: Тимофеева 19.08.2025 / Контрагент поставщика СМАРТ-Т Группа Компаний  
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая" Тогда
			 
		НовыйЭлемент = Форма.Элементы.Вставить("смартКонтрагентПоУмолчанию", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно, Форма.Элементы.Ссылка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартКонтрагентПоУмолчанию";
			
	КонецЕсли;	
	//-- #4050 смарт: Тимофеева 19.08.2025
	
	//++ #Б-1184 смарт: Фролов 05.11.2024 //Добавить реквизиты в справочник "CRM_СостоянияИнтересов"
	Если Форма.ИмяФормы = "Справочник.CRM_СостоянияИнтересов.Форма.ФормаЭлементаСценария" Тогда
			
		НовыйЭлемент = Форма.Элементы.Добавить("смартЧасовНаКвалификацию", Тип("ПолеФормы"), Форма.Элементы.ГруппаЛево); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЧасовНаКвалификацию";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.Заголовок = "Часов на квалификацию (смарт)";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЧасовНаВыставлениеКП", Тип("ПолеФормы"), Форма.Элементы.ГруппаЛево); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЧасовНаВыставлениеКП";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.Заголовок = "Часов на выставление КП (смарт)"; 

		НовыйЭлемент = Форма.Элементы.Добавить("смартЧасовНаСогласованиеКП", Тип("ПолеФормы"), Форма.Элементы.ГруппаЛево); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЧасовНаСогласованиеКП";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.Заголовок = "Часов на согласование КП (смарт)"; 

		НовыйЭлемент = Форма.Элементы.Добавить("смартЧасовНаВыставлениеСчета", Тип("ПолеФормы"), Форма.Элементы.ГруппаПраво); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЧасовНаВыставлениеСчета";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.Заголовок = "Часов на выставление счета (смарт)"; 
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЧасовНаОплату", Тип("ПолеФормы"), Форма.Элементы.ГруппаПраво); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЧасовНаОплату";
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.Заголовок = "Часов на оплату (смарт)"; 
		
	КонецЕсли;
	//-- #Б-1184 смарт: Фролов 05.11.2024

	//++ #1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов  
	Если Форма.ИмяФормы = "РегистрСведений.CRM_ИсторияСостоянийОбращений.Форма.ФормаСписка" Тогда

		НоваяКолонка = Форма.Элементы.Добавить("смартСтатусRoistat", Тип("ПолеФормы"), Форма.Элементы.Список);
		НоваяКолонка.Заголовок = "Статус Roistat";
		НоваяКолонка.ПутьКДанным = "Список.смартСтатусRoistat";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	//-- #1538 смарт: Лопато 05.12.2024

	//++ #Б-2128 смарт: Лопато 07.02.2025 //Ввод нового регламента. Убрать возможность оставлять заметки в Партнере и Интересе.  
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая"
		ИЛИ Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая" Тогда

		Форма.Элементы.БыстрыйВвод_Примечание.Видимость = Ложь;
		Форма.Элементы.БыстрыйВвод_ПримечаниеТема.Видимость = Ложь;
		
	КонецЕсли;
	//-- #Б-2128 смарт: Лопато 07.02.2025
	
	//++ #Б-3096 смарт: Фролов 16.04.2025 //Доработка документа Коммерческое предложение клиенту.
	Если Форма.ИмяФормы = "Документ.КоммерческоеПредложениеКлиенту.Форма.CRM_Модуль_ФормаДокумента" Тогда
		
		НоваяСтраница = Форма.Элементы.Вставить("смартСтраницаСопутствующиеТовары", Тип("ГруппаФормы"), Форма.Элементы.СтраницыФормы, Форма.Элементы.СтраницаДополнительно);
		НоваяСтраница.Вид = ВидГруппыФормы.Страница;
		НоваяСтраница.Заголовок = "Сопутствующие товары (смарт)";
		НоваяСтраница.Видимость = Истина;
		
		ПолеСопутствующиеТовары = Форма.Элементы.Добавить("смартСопутствующиеТоварыТаблица", Тип("ТаблицаФормы"),
			Форма.Элементы.смартСтраницаСопутствующиеТовары);
		ПолеСопутствующиеТовары.ПутьКДанным = "Объект.смартСопутствующиеТовары";
		ПолеСопутствующиеТовары.Отображение = ОтображениеТаблицы.Список;
		ПолеСопутствующиеТовары.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартНоменклатура", Тип("ПолеФормы"), Форма.Элементы.смартСопутствующиеТоварыТаблица);
		НоваяКолонка.Заголовок = "Номенклатура";
		НоваяКолонка.ПутьКДанным = "Объект.смартСопутствующиеТовары.Номенклатура";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартЦена", Тип("ПолеФормы"), Форма.Элементы.смартСопутствующиеТоварыТаблица);
		НоваяКолонка.Заголовок = "Цена";
		НоваяКолонка.ПутьКДанным = "Объект.смартСопутствующиеТовары.Цена";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартВалюта", Тип("ПолеФормы"), Форма.Элементы.смартСопутствующиеТоварыТаблица);
		НоваяКолонка.Заголовок = "Валюта";
		НоваяКолонка.ПутьКДанным = "Объект.смартСопутствующиеТовары.Валюта";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		
		//++ #Б-3502 смарт: Фролов 06.06.2025 //Доработка НСИ Конструктора КП
		Форма.Элементы.ГруппаМенюВариантов.Видимость = Ложь;
		Форма.Элементы.КоманднаяПанельВариантов.Видимость = Ложь; 
		Форма.Элементы.ТоварыДобавитьРазделитель.Видимость = Ложь;
		Форма.Элементы.ГруппаОписаниеИтоги.Видимость = Ложь;
		//-- #Б-3502 смарт: Фролов 06.06.2025
		
	КонецЕсли;
	//-- #Б-3096 смарт: Фролов 16.04.2025
	
	//++ #Б-3334 смарт: Фролов 20.05.2025 //Ошибка. В рабочем столе сотрудника взаимодействия по заказу клиента не корректно открываются.
	//Ликвидирована процедура после в самом документе, доработки перенесены сюда
	Если Форма.ИмяФормы = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента" Тогда
		
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			Форма.Объект.смартРучноеДобавление = Истина;	
		КонецЕсли;
		//-- #1929 смарт: Фролов 23.07.2024
		
		//++ #Б-2208 смарт: Фролов 26.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
		Если Форма.Объект.смартСогласованоУвеличенияПлановогоСрока Тогда
			
			Форма.Элементы.ГруппаПериодВзаимодействия.Доступность = Ложь;
			Форма.Элементы.ГруппаПериодическое.Доступность = Ложь;
			
		КонецЕсли;
		//-- #Б-2208 смарт: Фролов 26.02.2025
		
		//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
		Если ЗначениеЗаполнено(Форма.Объект.смартВидЗадачи) И Форма.Объект.смартВидЗадачи.Акция Тогда
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартОписаниеАкции", Тип("ПолеФормы"), Форма.Элементы.ГруппаФормаЛевая, Форма.Элементы.ГруппаТема);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартВидЗадачи.ОписаниеАкции";
			НовыйЭлемент.Заголовок = "Описание акции";
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			
		КонецЕсли;
		//-- #Б-4382 смарт: Фролов 22.09.2025
		
		//++ #Б-3748 смарт: Фролов 15.07.2025 //Вывод предмета взаимодействия на форму и ленту.
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) Тогда
			
			//++ #Б-3902 смарт: Фролов 24.07.2025 //Сделать привязку автоматически формируемых взаимодействий к счету.
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаДокументы", Тип("ГруппаФормы"), Форма.Элементы.ГруппаФормаЛевая, Форма.Элементы.ГруппаТема);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			НоваяГруппа.РастягиватьПоГоризонтали = Истина;
			
			//НовыйЭлемент = Форма.Элементы.Вставить("смартДокументОснование", Тип("ПолеФормы"), Форма.Элементы.ГруппаФормаЛевая, Форма.Элементы.ГруппаТема);
			НовыйЭлемент = Форма.Элементы.Добавить("смартДокументОснование", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДокументы);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ДокументОснование";
			НовыйЭлемент.КнопкаВыбора = Ложь;
			НовыйЭлемент.КнопкаОткрытия = Истина;
			НовыйЭлемент.Заголовок = "Документ основание";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗаказКлиента", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДокументы);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартЗаказКлиента";
			НовыйЭлемент.КнопкаВыбора = Ложь;
			НовыйЭлемент.КнопкаОткрытия = Истина;
			НовыйЭлемент.Заголовок = "Заказ клиента";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			//-- #Б-3902 смарт: Фролов 24.07.2025
			
			//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
			Если ЗначениеЗаполнено(Форма.Объект.смартВидЗадачи) И Форма.Объект.смартВидЗадачи.Акция Тогда
				
				Форма.Элементы.смартДокументОснование.Видимость = Ложь;
				Форма.Элементы.смартЗаказКлиента.Видимость = Ложь;
				
			КонецЕсли;
			//-- #Б-4382 смарт: Фролов 22.09.2025
			
		КонецЕсли;
		//-- #Б-3748 смарт: Фролов 15.07.2025
		
		//++ #Б-4382 смарт: Фролов 23.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартТаблицаБлижайшиеВзаимодействия", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Дата", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Дата"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Акция", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Акция"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тема", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Тема"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Содержание", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Содержание"));
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаГоризонтальная", Тип("ГруппаФормы"), Форма.Элементы.ГруппаФормаЛевая, Форма.Элементы.Описание);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаВертикальнаяЛево", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаГоризонтальная);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		Форма.Элементы.Переместить(Форма.Элементы.Описание, Форма.Элементы.смартГруппаВертикальнаяЛево);
		Форма.Элементы.Переместить(Форма.Элементы.Результат, Форма.Элементы.смартГруппаВертикальнаяЛево);
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаГоризонтальнаяПраво", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаГоризонтальная);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Заголовок = "Ближайшие взаимодействия";
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		НоваяГруппа.ЦветФона = Новый Цвет(60, 179, 113);
		НоваяГруппа.ЦветТекстаЗаголовка = Новый Цвет(255, 255, 255);
		НоваяГруппа.ШрифтЗаголовка = Новый Шрифт(НоваяГруппа.ШрифтЗаголовка, "Arial", 9, Истина);
		
		ПолеТаблицаПоказателей = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействия", Тип("ТаблицаФормы"), Форма.Элементы.смартГруппаГоризонтальнаяПраво);
		ПолеТаблицаПоказателей.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия";
		ПолеТаблицаПоказателей.Отображение = ОтображениеТаблицы.Список;
		ПолеТаблицаПоказателей.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ПолеТаблицаПоказателей.ТолькоПросмотр = Истина;
		ПолеТаблицаПоказателей.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеТаблицаПоказателей.Шапка = Ложь;
		ПолеТаблицаПоказателей.ЧередованиеЦветовСтрок = Ложь;
		ПолеТаблицаПоказателей.АвтоМаксимальнаяШирина = Ложь;
		ПолеТаблицаПоказателей.ГоризонтальныеЛинии = Ложь;
		ПолеТаблицаПоказателей.РастягиватьПоГоризонтали = Ложь;
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаТаблицаВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартТаблицаБлижайшиеВзаимодействия);
		НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Группировка = ГруппировкаКолонок.Вертикальная;
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаТаблицаГоризонтальная1", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаТаблицаВертикальная);
		НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияДата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаГоризонтальная1);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Дата";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9, Истина);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 0, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияАкция", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаГоризонтальная1);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Акция";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9, Истина);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 0, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияТема", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаВертикальная);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Тема";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9, Истина);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 0, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияСодержание", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаВертикальная);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Содержание";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.МногострочныйРежим = Истина;
		НоваяКолонка.ВариантУправленияВысотой = ВариантУправленияВысотойЭлемента.ПоСодержимому;
		НоваяКолонка.АвтоМаксимальнаяВысота = Ложь;
		НоваяКолонка.РастягиватьПоВертикали = Истина;
		НоваяКолонка.МаксимальнаяВысота = 5;
		НоваяКолонка.Высота = 4;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 225, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) И ЗначениеЗаполнено(Форма.Объект.Партнер) Тогда
			
			ТаблицаВзаимодействий = смартПолучитьДанныеБлижайшихВзаимодействий(Форма.Объект.Партнер, Форма.Объект.Ответственный, Форма.Объект.Ссылка, Форма.Объект.ПлановаяДата);
			
			Для Каждого СтрТаблицы Из ТаблицаВзаимодействий Цикл
				
				СтрсмартТаблицаБлижайшиеВзаимодействия = Форма.смартТаблицаБлижайшиеВзаимодействия.Добавить();
				ЗаполнитьЗначенияСвойств(СтрсмартТаблицаБлижайшиеВзаимодействия, СтрТаблицы);
				СтрсмартТаблицаБлижайшиеВзаимодействия.Дата = Формат(СтрТаблицы.ПлановаяДата, "ДФ=dd.MM.yyyy") + " - " + СтрТаблицы.Дней + "дн.";
				
			КонецЦикла;
			
		КонецЕсли;
		
		//++ #Б-6332 смарт: Фролов 07.04.2026 //Запрет на редактирование не своих взаимодействий
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			
			Если НЕ Форма.Объект.Ответственный = Пользователи.ТекущийПользователь()
				//++ #Б-6480 смарт: Фролов 15.04.2026 //Для бэк-офиса надо сделать исключение
				//И НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
				И НЕ Пользователи.РолиДоступны("смартМенеджерБэкОфис, смартРуководительCRM") Тогда
				//-- #Б-6480 смарт: Фролов 15.04.2026
			
				Форма.ТолькоПросмотр = Истина;
				
			КонецЕсли;	
			
		КонецЕсли;
		//-- #Б-6332 смарт: Фролов 07.04.2026
		
		Если Форма.смартТаблицаБлижайшиеВзаимодействия.Количество() = 0 Тогда
			
			Форма.Элементы.смартГруппаГоризонтальнаяПраво.Видимость = Ложь;	
			
		КонецЕсли;	
		//-- #Б-4382 смарт: Фролов 23.09.2025
		
		//++ #Б-6346 смарт: Фролов 13.05.2026 //Взаимодействие. Внедрение контроля за встречами со связями к интересам.
		НовыйЭлемент = Форма.Элементы.Вставить("смартРезультатВстречи", Тип("ПолеФормы"), Форма.Элементы.ГруппаФормаЛевая, Форма.Элементы.ГруппаОповещений);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартРезультатВстречи";
		НовыйЭлемент.Заголовок = "Результат встречи";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
		НовыйЭлемент.Ширина = 35;
		//-- #Б-6346 смарт: Фролов 13.05.2026
		
		//++ #Б-6638 смарт: Фролов 19.06.2026 //Указание причины переноса взаимодействия. Пока только для СЦ.
		НовыйЭлемент = Форма.Элементы.Вставить("смартПричинаПереносаСрока", Тип("ПолеФормы"), Форма.Элементы.ГруппаТема);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартПричинаПереносаСрока";
		НовыйЭлемент.Заголовок = "Причина переноса сроков";
		//-- #Б-6638 смарт: Фролов 19.06.2026
		
	КонецЕсли;
	//-- #Б-3334 смарт: Фролов 20.05.2025
	
	//++ #Б-3748 смарт: Фролов 15.07.2025 //Вывод предмета взаимодействия на форму и ленту.
	Если Форма.ИмяФормы = "Документ.CRM_Взаимодействие.Форма.ФормаДокументаКраткая" Тогда
		
		//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
		Форма.УстановитьДействие("ПередЗаписьюНаСервере", "смарт_ПередЗаписьюНаСервере");
		
		Если ЗначениеЗаполнено(Форма.Объект.смартВидЗадачи) И Форма.Объект.смартВидЗадачи.Акция Тогда
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартОписаниеАкции", Тип("ПолеФормы"), Форма, Форма.Элементы.Тема);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартВидЗадачи.ОписаниеАкции";
			НовыйЭлемент.Заголовок = "Описание акции";
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			
		КонецЕсли;
		//-- #Б-4382 смарт: Фролов 22.09.2025
		
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) Тогда
			
			//++ #Б-3902 смарт: Фролов 24.07.2025 //Сделать привязку автоматически формируемых взаимодействий к счету.
			НоваяГруппа = Форма.Элементы.Вставить("смартГруппаДокументы", Тип("ГруппаФормы"), Форма, Форма.Элементы.Тема);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			НоваяГруппа.РастягиватьПоГоризонтали = Истина;
			
			//НовыйЭлемент = Форма.Элементы.Вставить("смартДокументОснование", Тип("ПолеФормы"), Форма, Форма.Элементы.Тема);
			НовыйЭлемент = Форма.Элементы.Вставить("смартДокументОснование", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДокументы);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ДокументОснование";
			НовыйЭлемент.КнопкаВыбора = Ложь;
			НовыйЭлемент.КнопкаОткрытия = Истина;
			НовыйЭлемент.Заголовок = "Документ основание";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			//++ #Б-3926 смарт: Лопато 28.07.2025 //Ошибка. При открытии взаимодействия в Интересе.
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗаказКлиента", Тип("ПолеФормы"), Форма.Элементы.смартГруппаДокументы);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартЗаказКлиента";
			НовыйЭлемент.КнопкаВыбора = Ложь;
			НовыйЭлемент.КнопкаОткрытия = Истина;
			НовыйЭлемент.Заголовок = "Заказ клиента";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			//-- #Б-3926 смарт: Лопато 28.07.2025
			//-- #Б-3902 смарт: Фролов 24.07.2025
			
			//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
			Если ЗначениеЗаполнено(Форма.Объект.смартВидЗадачи) И Форма.Объект.смартВидЗадачи.Акция Тогда
				
				Форма.Элементы.смартДокументОснование.Видимость = Ложь;
				Форма.Элементы.смартЗаказКлиента.Видимость = Ложь;
				
			КонецЕсли;
			//-- #Б-4382 смарт: Фролов 22.09.2025
			
		КонецЕсли;
		
		//++ #Б-4382 смарт: Фролов 23.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартТаблицаБлижайшиеВзаимодействия", Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Дата", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Дата"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Акция", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Акция"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тема", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Тема"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Содержание", Новый ОписаниеТипов("Строка"), "смартТаблицаБлижайшиеВзаимодействия" , "Содержание"));
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаГоризонтальная", Тип("ГруппаФормы"), Форма, Форма.Элементы.Содержание);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаВертикальнаяЛево", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаГоризонтальная);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		
		Форма.Элементы.Переместить(Форма.Элементы.Содержание, Форма.Элементы.смартГруппаВертикальнаяЛево);
		Форма.Элементы.Переместить(Форма.Элементы.Результат, Форма.Элементы.смартГруппаВертикальнаяЛево);
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаГоризонтальнаяПраво", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаГоризонтальная);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Заголовок = "Ближайшие взаимодействия";
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		НоваяГруппа.ЦветФона = Новый Цвет(60, 179, 113);
		НоваяГруппа.ЦветТекстаЗаголовка = Новый Цвет(255, 255, 255);
		НоваяГруппа.ШрифтЗаголовка = Новый Шрифт(НоваяГруппа.ШрифтЗаголовка, "Arial", 9, Истина);
		
		ПолеТаблицаПоказателей = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействия", Тип("ТаблицаФормы"), Форма.Элементы.смартГруппаГоризонтальнаяПраво);
		ПолеТаблицаПоказателей.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия";
		ПолеТаблицаПоказателей.Отображение = ОтображениеТаблицы.Список;
		ПолеТаблицаПоказателей.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ПолеТаблицаПоказателей.ТолькоПросмотр = Истина;
		ПолеТаблицаПоказателей.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеТаблицаПоказателей.Шапка = Ложь;
		ПолеТаблицаПоказателей.ЧередованиеЦветовСтрок = Ложь;
		ПолеТаблицаПоказателей.АвтоМаксимальнаяШирина = Ложь;
		ПолеТаблицаПоказателей.ГоризонтальныеЛинии = Ложь;
		ПолеТаблицаПоказателей.РастягиватьПоГоризонтали = Ложь;
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаТаблицаВертикальная", Тип("ГруппаФормы"), Форма.Элементы.смартТаблицаБлижайшиеВзаимодействия);
		НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Группировка = ГруппировкаКолонок.Вертикальная;
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаТаблицаГоризонтальная1", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаТаблицаВертикальная);
		НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияДата", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаГоризонтальная1);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Дата";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9, Истина);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 0, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияАкция", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаГоризонтальная1);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Акция";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9, Истина);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 0, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияТема", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаВертикальная);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Тема";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9, Истина);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 0, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НоваяКолонка = Форма.Элементы.Добавить("смартТаблицаБлижайшиеВзаимодействияСодержание", Тип("ПолеФормы"), Форма.Элементы.смартГруппаТаблицаВертикальная);
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.ОтображатьВПодвале = Ложь;
		НоваяКолонка.ПутьКДанным = "смартТаблицаБлижайшиеВзаимодействия.Содержание";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.МногострочныйРежим = Истина;
		НоваяКолонка.ВариантУправленияВысотой = ВариантУправленияВысотойЭлемента.ПоСодержимому;
		НоваяКолонка.АвтоМаксимальнаяВысота = Ложь;
		НоваяКолонка.РастягиватьПоВертикали = Истина;
		НоваяКолонка.МаксимальнаяВысота = 5;
		НоваяКолонка.Высота = 4;
		НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 9);
		НоваяКолонка.ЦветФона = Новый Цвет(255, 225, 0);
		НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) И ЗначениеЗаполнено(Форма.Объект.Партнер) Тогда
			
			ТаблицаВзаимодействий = смартПолучитьДанныеБлижайшихВзаимодействий(Форма.Объект.Партнер, Форма.Объект.Ответственный, Форма.Объект.Ссылка, Форма.Объект.ПлановаяДата);
			
			Для Каждого СтрТаблицы Из ТаблицаВзаимодействий Цикл
				
				СтрсмартТаблицаБлижайшиеВзаимодействия = Форма.смартТаблицаБлижайшиеВзаимодействия.Добавить();
				ЗаполнитьЗначенияСвойств(СтрсмартТаблицаБлижайшиеВзаимодействия, СтрТаблицы);
				СтрсмартТаблицаБлижайшиеВзаимодействия.Дата = Формат(СтрТаблицы.ПлановаяДата, "ДФ=dd.MM.yyyy") + " - " + СтрТаблицы.Дней + "дн.";
				
			КонецЦикла;	
			
		КонецЕсли;
		
		//++ #Б-6332 смарт: Фролов 07.04.2026 //Запрет на редактирование не своих взаимодействий
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			
			Если НЕ Форма.Объект.Ответственный = Пользователи.ТекущийПользователь()
				//++ #Б-6480 смарт: Фролов 15.04.2026 //Для бэк-офиса надо сделать исключение
				//И НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
				И НЕ Пользователи.РолиДоступны("смартМенеджерБэкОфис, смартРуководительCRM") Тогда
				//-- #Б-6480 смарт: Фролов 15.04.2026
			
				Форма.ТолькоПросмотр = Истина;
				
			КонецЕсли;	
			
		КонецЕсли;
		//-- #Б-6332 смарт: Фролов 07.04.2026
		
		Если Форма.смартТаблицаБлижайшиеВзаимодействия.Количество() = 0 Тогда
			
			Форма.Элементы.смартГруппаГоризонтальнаяПраво.Видимость = Ложь;	
			
		КонецЕсли;	
		//-- #Б-4382 смарт: Фролов 23.09.2025
		
		//++ #Б-6572 смарт: Фролов 22.04.2026 //Поле Подразделение не заполняется во взаимодействиях и выдает ошибку.
		НовыйЭлемент = Форма.Элементы.Вставить("Подразделение", Тип("ПолеФормы"), Форма.Элементы.ГруппаЗаголовок);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.Подразделение";
		НовыйЭлемент.Заголовок = "Подразделение";
		//-- #Б-6572 смарт: Фролов 22.04.2026
		
		//++ #Б-6346 смарт: Фролов 13.05.2026 //Взаимодействие. Внедрение контроля за встречами со связями к интересам.
		НовыйЭлемент = Форма.Элементы.Вставить("смартРезультатВстречи", Тип("ПолеФормы"), Форма.ЭтаФорма, Форма.Элементы.ГруппаКоманды);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартРезультатВстречи";
		НовыйЭлемент.Заголовок = "Результат встречи";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
		НовыйЭлемент.Ширина = 35;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		//-- #Б-6346 смарт: Фролов 13.05.2026
		
		//++ #Б-6638 смарт: Фролов 19.06.2026 //Указание причины переноса взаимодействия. Пока только для СЦ.
		НовыйЭлемент = Форма.Элементы.Вставить("смартПричинаПереносаСрока", Тип("ПолеФормы"), Форма, Форма.Элементы.ГруппаЗаголовок);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартПричинаПереносаСрока";
		НовыйЭлемент.Заголовок = "Причина переноса сроков";
		//-- #Б-6638 смарт: Фролов 19.06.2026
		
	КонецЕсли;
	//-- #Б-3748 смарт: Фролов 15.07.2025
	
	//++ #6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия
	Если Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая" Тогда
		
		//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(Форма, "смартГруппаМаркетинговыеМероприятия", "ГруппаДополнительно", 3,,,, "Ссылка");
		
		События = Новый Структура("ПриИзменении", "смартМаркетинговоеМероприятиеПриИзменении");
		Элемент = смартФормированиеИнтерфейса.СздПоле(Форма, "смартМаркетинговоеМероприятие", "смартГруппаМаркетинговыеМероприятия", "Маркетинговое мероприятие", 1, "Объект.смартМаркетинговоеМероприятие",, События);
		
		ПараметрыВыбораММ = Новый Массив;
		ПараметрыВыбораММ.Добавить(Новый ПараметрВыбора("Отбор.смартИнтерес", Документы.CRM_Интерес.ПустаяСсылка()));
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораММ);
		
		смартФормированиеИнтерфейса.СоздатьКоманду(Форма, "смартПоказатьМаркетинговыеМероприятия", ПолучитьЗаголовокКомандыСпискаМркетинговыхМероприятий(Форма.Объект.Ссылка), "смартПоказатьМаркетинговыеМероприятия");
		смартФормированиеИнтерфейса.СздКнопка(Форма, "смартПоказатьМаркетинговыеМероприятия", "смартГруппаМаркетинговыеМероприятия",, "смартПоказатьМаркетинговыеМероприятия", 2);
		//-- #Б7290 смарт: Шляпников 09.07.2026

	КонецЕсли;
	//-- #6224 смарт: Тимофеева 13.04.2026 

КонецПроцедуры //-- #1443 смарт: Ермаков 26.09.2023

&После("ПослеЗаписиНаСервере")
//++ #Б-3286 смарт: Фролов 13.05.2025 //Закрывать процесс согласования при отмене взаимодействия.
Процедура смарт_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи)
	
	//++ #Б-3286 смарт: Фролов 13.05.2025 //Закрывать процесс согласования при отмене взаимодействия.
	Если Форма.ИмяФормы = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента" Тогда
		
		Если ТекущийОбъект.СтатусВзаимодействия=Справочники.CRM_СостоянияСобытий.Отменено
			ИЛИ ТекущийОбъект.СтатусВзаимодействия=Справочники.CRM_СостоянияСобытий.Завершено
			ИЛИ ТекущийОбъект.ПометкаУдаления Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Ссылка КАК Ссылка
			|ИЗ
			|	Задача.ЗадачаИсполнителя
			|ГДЕ
			|	Предмет = &Предмет
			|	И НЕ Выполнена");
			Запрос.УстановитьПараметр("Предмет", ТекущийОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ОбъектЗадача = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектЗадача.Выполнена = Истина;
				ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
				ОбъектЗадача.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	//-- #Б-3286 смарт: Фролов 13.05.2025
	
КонецПроцедуры //-- #Б-3286 смарт: Фролов 13.05.2025

#Область Служебные

//++ #Б-4382 смарт: Фролов 24.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
Функция смартПолучитьДанныеБлижайшихВзаимодействий(Партнер, Ответственный, ВзаимодействиеСсылка, ДатаВзаимодействия)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_Взаимодействие.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
	|			ТОГДА CRM_Взаимодействие.ВидВзаимодействия
	|		ИНАЧЕ ВЫБОР
	|				КОГДА CRM_Взаимодействие.смартВидЗадачи.Акция
	|					ТОГДА ""АКЦИЯ""
	|				ИНАЧЕ CRM_Взаимодействие.ВидВзаимодействия
	|			КОНЕЦ
	|	КОНЕЦ КАК Акция,
	|	ВЫБОР
	|		КОГДА CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
	|			ТОГДА CRM_Взаимодействие.Тема
	|		ИНАЧЕ ВЫБОР
	|				КОГДА CRM_Взаимодействие.смартВидЗадачи.Акция
	|					ТОГДА CRM_Взаимодействие.смартВидЗадачи.Наименование
	|				ИНАЧЕ CRM_Взаимодействие.Тема
	|			КОНЕЦ
	|	КОНЕЦ КАК Тема,
	|	ВЫБОР
	|		КОГДА CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
	|			ТОГДА ПОДСТРОКА(CRM_Взаимодействие.Содержание, 0, 250)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА CRM_Взаимодействие.смартВидЗадачи.Акция
	|					ТОГДА CRM_Взаимодействие.смартВидЗадачи.Наименование
	|				ИНАЧЕ ПОДСТРОКА(CRM_Взаимодействие.Содержание, 0, 250)
	|			КОНЕЦ
	|	КОНЕЦ КАК Содержание,
	|	РАЗНОСТЬДАТ(&ТекущаяДата, CRM_Взаимодействие.ПлановаяДата, ДЕНЬ) КАК Дней,
	|	CRM_Взаимодействие.ПлановаяДата КАК ПлановаяДата
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|	И CRM_Взаимодействие.Партнер = &Партнер
	|	И CRM_Взаимодействие.Ответственный = &Ответственный
	|	И НЕ CRM_Взаимодействие.Ссылка = &ВзаимодействиеСсылка
	|	И (CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.ВРаботе)
	|			ИЛИ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано))
	|	И CRM_Взаимодействие.ПлановаяДата МЕЖДУ &ТекущаяДата И ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, &КоличествоДней)");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаВзаимодействия);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("КоличествоДней", 10);
	Запрос.УстановитьПараметр("ВзаимодействиеСсылка", ВзаимодействиеСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //-- #Б-4382 смарт: Фролов 24.09.2025	

//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
Функция ПолучитьЗаголовокКомандыСпискаМркетинговыхМероприятий(Интерес)
	
	Если НЕ ЗначениеЗаполнено(Интерес) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркетинговыеМероприятияДокумент.Ссылка) КАК Количество
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.смартИнтерес = &Интерес
	|	И НЕ МаркетинговыеМероприятияДокумент.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Интерес", Интерес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество <> NULL Тогда
		Возврат СтрШаблон("Дополнительно создано (%1) маркетинговых мероприятий", Выборка.Количество);
	КонецЕсли;
	
	Возврат "Дополнительных маркетинговых мероприятий нет";
	
КонецФункции

#КонецОбласти