///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Служит для переопределения действия по клику на приложение в форме "Приложения 1C:CRM".
//
// Переопределение должно выполняться в партнерском расширении.
//
// ВАЖНО! Переопределение должно выполняться в режиме "После", с обязательной проверкой
// параметра "ИмяПриложения" и установкой флага СтандартнаяОбработка в значение "Ложь".
// Это необходимо в связи с тем, что несколько партнерских расширений будут переопределять
// данный метод.
// ИмяПриложения соответствует имени самого расширения.
//
// Параметры:
//	ИмяПриложения		 - Строка - Имя партнерского расширения
//	СтандартнаяОбработка - Булево - признак стандартной обработки действия
//
Процедура ВыполнитьДействиеПриКликеНаПриложение(ИмяПриложения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Истина;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
