#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТранспортнаяНакладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						"ТранспортнаяНакладная", НСтр("ru = 'Транспортная накладная'"),
						СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, КомплектыПечати = Неопределено) Экспорт
	
	ТипДокументов = ТипЗнч(МассивОбъектов[0]);

	Если ТипДокументов <> Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда 
		
		СтруктураВозврата = УправлениеПечатьюУТВызовСервераЛокализация.ПолучитьТранспортныеНакладныеНаПечать(МассивОбъектов);
		ТранспортныеНакладныеНаПечать = СтруктураВозврата.ТранспортныеНакладныеНаПечать;
		
		Для Каждого Документ Из СтруктураВозврата.МассивДокументовБезНакладных Цикл
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для документа %1 не создана ""Транспортная накладная"". Печать документа ""Транспортная накладная"" невозможна.'"),
					Документ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					Текст,
					Документ)
					
		КонецЦикла	
			
	Иначе
		ТранспортныеНакладныеНаПечать = МассивОбъектов;	
	КонецЕсли;
	
	ТаблицаНакладныхНаПечать = Новый ТаблицаЗначений;
	ОписаниеТипаТранспортнаяНакладная = Новый ОписаниеТипов("ДокументСсылка.ТранспортнаяНакладная");
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	ТаблицаНакладныхНаПечать.Колонки.Добавить("ТранспортнаяНакладная", ОписаниеТипаТранспортнаяНакладная);
	ТаблицаНакладныхНаПечать.Колонки.Добавить("ПорядковыйНомер", ОписаниеТипаЧисло);
	
	ПорядковыйНомер = 0;
	Для Каждого Накладная Из ТранспортныеНакладныеНаПечать Цикл 
		СтрокаТаблицы = ТаблицаНакладныхНаПечать.Добавить();	
		СтрокаТаблицы.ТранспортнаяНакладная = Накладная;
		СтрокаТаблицы.ПорядковыйНомер = ПорядковыйНомер;
		ПорядковыйНомер = ПорядковыйНомер  + 1;
	КонецЦикла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
		
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.ТранспортнаяНакладная");
	ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(ТаблицаНакладныхНаПечать);
		
	ЗаполнитьТабличныйДокументТН(
			ТабличныйДокумент,
			ДанныеДляПечати,
			ОбъектыПечати,
			КомплектыПечати);

	Возврат ТабличныйДокумент;
	
КонецФункции

//++ смарт:ММ 572 11.08.2021
//Процедура ЗаполнитьТабличныйДокументТН(ТабличныйДокумент, СтруктураДанных, ОбъектыПечати, КомплектыПечати)
Процедура ЗаполнитьТабличныйДокументТН(ТабличныйДокумент, СтруктураДанных, ОбъектыПечати, КомплектыПечати, смартДляАдмирал = Ложь) Экспорт
    //-- смарт:ММ 07.08.2021
    
    Макет1529 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная_ru");
    Макет2200 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная_2200_ru"); 
    //++ смарт:Подкин #1181 19.09.2022 9:44:02 новая форма ТН из релиза УТ 11_4_14_140
    Макет2200_1 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная_2200_1_ru");
    //-- смарт:Подкин #1181 19.09.2022 9:44:02
    
    Макет1529.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
    Макет2200.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
    Макет2200_1.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
    
    ТаблицаДанныхДляПечати = СтруктураДанных.ТаблицаРезультата;
    ДанныеСсылкиДокументов = СтруктураДанных.РезультатИменаТоваров.Выбрать();
    
    ПервыйДокумент = Истина;
    
    Для Каждого ДанныеПечати Из ТаблицаДанныхДляПечати Цикл
        
        //Если ДействуетПостановлениеНомер2200(ДанныеПечати.Дата) Тогда
        //	Макет = Макет2200;
        //Иначе
        //	Макет = Макет1529;
        //КонецЕсли;
        
        Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        
        ПервыйДокумент    = Ложь;
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
        
        // Если ТТН с доставкой и нашли связанные с доставкой ошибки - перейдем к следующему документу.
        СтруктураЗаданиеНаПеревозку = Новый Структура("НеНайденоЗаданиеНаПеревозку,
        |БолееОдногоВхожденияВЗаданияНаПеревозку,
        |РаспоряжениеНеПроведено",
        Ложь,Ложь,Ложь);
        ЕстьОшибкиДоставки = Ложь;
        ЗаполнитьЗначенияСвойств(СтруктураЗаданиеНаПеревозку,ДанныеПечати);
        
        Если СтруктураЗаданиеНаПеревозку.НеНайденоЗаданиеНаПеревозку Тогда
            Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            НСтр("ru = 'Для документа %1 не найдено задание на перевозку. 
            |Печать формы 1-Т для документов с доставкой возможна после включения документа в задание на перевозку.'"),
            ДанныеПечати.Ссылка);
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
            Текст,
            ДанныеПечати.Ссылка);
            ЕстьОшибкиДоставки = Истина;
        КонецЕсли;
        
        Если СтруктураЗаданиеНаПеревозку.БолееОдногоВхожденияВЗаданияНаПеревозку Тогда
            Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            НСтр("ru = 'Невозможно напечатать форму 1-Т для %1, т.к. найдено более одного задания на перевозку, 
            |в которые включен этот документ.'"),
            ДанныеПечати.Ссылка);
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
            Текст,
            ДанныеПечати.Ссылка);
            ЕстьОшибкиДоставки = Истина;
        КонецЕсли;
        
        Если СтруктураЗаданиеНаПеревозку.РаспоряжениеНеПроведено Тогда
            Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            НСтр("ru = 'Документ %1 не проведен. Печать товарно - транспортной накладной не будет выполнена.'"),
            ДанныеПечати.Ссылка);
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
            Текст,
            ДанныеПечати.Ссылка);
            ЕстьОшибкиДоставки = Истина;
        КонецЕсли;
        
        Если ЕстьОшибкиДоставки Тогда
            Продолжить;
        КонецЕсли;
        
        Если ДанныеПечати.ЕстьНепроведенныеДокументыОснования Тогда
            
            Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            НСтр("ru = 'В документе %1 присутствуют непроведенные документы-основания. Печать транспортной накладной невозможна.'"),
            ДанныеПечати.Ссылка);
            
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
            Текст,
            ДанныеПечати.Ссылка);
            
            Продолжить;
            
        КонецЕсли;
        
        //++ смарт:Подкин #1181 19.09.2022 9:44:02 новая форма ТН из релиза УТ 11_4_14_140
        Если ДанныеПечати.Дата < '20210101' Тогда
            ЗаполнитьТабличныйДокументТНВерсияДо2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет1529);
        ИначеЕсли ДанныеПечати.Дата < '20220301' Тогда
            ЗаполнитьТабличныйДокументТНВерсияДо2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет2200, смартДляАдмирал);
        Иначе
            ЗаполнитьТабличныйДокументТНВерсияС2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет2200_1, смартДляАдмирал);
        КонецЕсли;
        //-- смарт:Подкин #1181 19.09.2022 9:44:02
        
    КонецЦикла;
    
КонецПроцедуры

//++ смарт:Подкин #1181 19.09.2022 9:44:02 новая форма ТН из релиза УТ 11_4_14_140
Процедура ЗаполнитьТабличныйДокументТНВерсияДо2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет, смартДляАдмирал = Ложь)
    
    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
    
    ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
    ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
    
    ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
    
    СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
    СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
    СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата);
    СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Водитель, ДанныеПечати.Дата);
    
    ПредставлениеГрузоотправителя = "";
    ПредставлениеПеревозчика      = "";
    ПредставлениеПеревозчика16_7  = "";
    Перевозчик                    = "";
    Грузоотправитель              = "";
    
    РеквизитыМакета = Новый Структура;
    РеквизитыМакета.Вставить("Пункт0_4", ДанныеПечати.Дата);
    РеквизитыМакета.Вставить("Пункт0_5", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер));
    
    Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда 
        Если СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
            Или СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
            РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
            "ПолноеНаименование,ИНН,ЮридическийАдрес"));
        Иначе
            //++ смарт:ММ 698 03.11.2021 
            Если смартДляАдмирал Тогда
                Если ЗначениеЗаполнено(ДанныеПечати.СкладПолучатель) Тогда
                    
                    ПунктПредставление = ДанныеПечати.ПунктРазгрузки;
                    
                    Телефоны = ФормированиеПечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(ДанныеПечати.СкладПолучатель);
                    
                    Если ЗначениеЗаполнено(Телефоны) Тогда
                        ПунктПредставление = ПунктПредставление + ", " + Телефоны;
                    КонецЕсли;
                    РеквизитыМакета.Вставить("Пункт2_2", ПунктПредставление);
                Иначе
                    РеквизитыМакета.Вставить("Пункт2_2", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
                    "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"));
                КонецЕсли;
            Иначе
                //-- смарт:ММ 03.11.2021
                
                РеквизитыМакета.Вставить("Пункт2_2", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
                "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"));
                
                //++ смарт:ММ 698 03.11.2021 
            КонецЕсли;
            //-- смарт:ММ 03.11.2021
        КонецЕсли;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда 
        Если СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
            Или СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
            ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
            "ПолноеНаименование,ИНН,ЮридическийАдрес");
            РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
            Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
        Иначе
            //++ смарт:ММ 572 11.08.2021
            Если смартДляАдмирал Тогда
                
                //++ смарт:ММ 698 03.11.2021 
                Если ЗначениеЗаполнено(ДанныеПечати.СкладОтправитель) Тогда
                    
                    ПунктПредставление = ДанныеПечати.ПунктПогрузки;
                    
                    Телефоны = ФормированиеПечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(ДанныеПечати.СкладОтправитель);
                    
                    Если ЗначениеЗаполнено(Телефоны) Тогда
                        ПунктПредставление = ПунктПредставление + ", " + Телефоны;
                    КонецЕсли;
                    РеквизитыМакета.Вставить("Пункт1_2", ПунктПредставление);
                Иначе
                    //-- смарт:ММ 03.11.2021
                    
                    // Необходимо указать адрес склада Адмирал
                    ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН");
                    
					//++ #1353 смарт: Фролов 16.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
					//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь);
					//
					////++ смарт:Подкин #1121 03.08.2022 15:51:20
					//СкладАдмиралКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмиралКовчег", Ложь); 
					//Если ДанныеПечати.СкладОтправитель = СкладАдмиралКовчег Тогда
					//    СкладАдмирал = СкладАдмиралКовчег;
					//КонецЕсли;
                    //-- смарт:Подкин #1121 03.08.2022 15:51:20
					Если ДанныеПечати.СкладОтправитель.смартАвтоматическиФормироватьДокументы Тогда
						СкладАдмирал=ДанныеПечати.СкладОтправитель;	
					КонецЕсли;	
					//-- #1353 смарт: Фролов 16.05.2023
                    АдресСклада = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(СкладАдмирал, "", ДанныеПечати.Дата);
                    ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + ", " + АдресСклада;
                    
                    Телефоны = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "Телефоны");
                    Если ЗначениеЗаполнено(Телефоны) Тогда
                        ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + ", " + Телефоны;
                    КонецЕсли;
                    
                    РеквизитыМакета.Вставить("Пункт1_2", ПредставлениеГрузоотправителя);
                    //++ смарт:ММ 698 03.11.2021 
                КонецЕсли;
                //-- смарт:ММ 03.11.2021
            Иначе
                //-- смарт:ММ 11.08.2021
                ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
                "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
                РеквизитыМакета.Вставить("Пункт1_2", ПредставлениеГрузоотправителя);
                //++ смарт:ММ 572 11.08.2021
            КонецЕсли;
            //-- смарт:ММ 11.08.2021
            Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
        КонецЕсли;
    КонецЕсли;
    
    
    СтруктураПоиска = Новый Структура("ПорядковыйНомер", ДанныеПечати.ПорядковыйНомер);
    
    ИменаТоваров = "";
    Пока ДанныеСсылкиДокументов.НайтиСледующий(СтруктураПоиска) Цикл								
        ИменаТоваров = ИменаТоваров + ДанныеСсылкиДокументов.НаименованиеВидаНоменклатуры + ", ";
    КонецЦикла;			
    
    Если СтрДлина(ИменаТоваров) >= 2 Тогда
        ИменаТоваров = Лев(ИменаТоваров, СтрДлина(ИменаТоваров) - 2);
    КонецЕсли;
    
    РеквизитыМакета.Вставить("Пункт3_1", ИменаТоваров);
    РеквизитыМакета.Вставить("Пункт6_1", ДанныеПечати.ПунктПогрузки);
    РеквизитыМакета.Вставить("Пункт7_1", ДанныеПечати.ПунктРазгрузки);
    
    МассаБруттоСтрока = НСтр("ru = '%МассаБрутто% кг'", Метаданные.Языки.Русский.КодЯзыка);
    МассаБруттоСтрока = СтрЗаменить(МассаБруттоСтрока, "%МассаБрутто%", ДанныеПечати.МассаБрутто);
    
    РеквизитыМакета.Вставить("Пункт6_5", МассаБруттоСтрока);
    
    //++ смарт:ММ 572 27.08.2021
    Если смартДляАдмирал = Истина Тогда
        РеквизитыМакета.Вставить("Пункт0_2", ДанныеПечати.ЗаказКлиентаДата);
        РеквизитыМакета.Вставить("Пункт0_3", ДанныеПечати.ЗаказКлиентаНомер);//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.ЗаказКлиентаНомер));			
    КонецЕсли;
    //-- смарт:ММ 27.08.2021
    
    ОбластьМакета.Параметры.Заполнить(РеквизитыМакета);
    
    ТабличныйДокумент.Вывести(ОбластьМакета);
    //++ смарт:ММ 572 12.08.2021
    //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
    //-- смарт:ММ 12.08.2021
    
    РеквизитыМакета.Очистить();
    
    Если ЗначениеЗаполнено(ДанныеПечати.Перевозчик) Тогда 
        Если СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
            Или СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
            ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
            "ПолноеНаименование,ФактическийАдрес,Телефоны");
            
            РеквизитыМакета.Вставить("Пункт10_1", ПредставлениеПеревозчика);
        Иначе
            ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
            "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
            
            РеквизитыМакета.Вставить("Пункт10_2", ПредставлениеПеревозчика);
        КонецЕсли;
        Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
        ПредставлениеПеревозчика16_7 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
        "ПолноеНаименование,ИНН,ЮридическийАдрес");
    КонецЕсли;
    
    ПредставлениеВодителя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Водитель, ДанныеПечати.Дата);
    
    РеквизитыМакета.Вставить("Пункт10_3", ПредставлениеВодителя);
    
    ГрузоподъемностьВТоннахАвтомобиля      = Формат(ДанныеПечати.ГрузоподъемностьВТоннахАвтомобиля,"");
    ВместимостьВКубическихМетрахАвтомобиля = Формат(ДанныеПечати.ВместимостьВКубическихМетрахАвтомобиля,"");
    
    ИнформацияОбАвтомобиле = ""
    + ?(ПустаяСтрока(ДанныеПечати.ТипАвтомобиля),"",Строка(ДанныеПечати.ТипАвтомобиля) + ", ")
    + ?(ПустаяСтрока(ДанныеПечати.МаркаАвтомобиля),"",ДанныеПечати.МаркаАвтомобиля  + ", ")
    + ?(ПустаяСтрока(ГрузоподъемностьВТоннахАвтомобиля),"",ГрузоподъемностьВТоннахАвтомобиля + " " + НСтр("ru = 'т'", Метаданные.Языки.Русский.КодЯзыка)  + ", ")
    + ?(ПустаяСтрока(ВместимостьВКубическихМетрахАвтомобиля),"",ВместимостьВКубическихМетрахАвтомобиля + " " + НСтр("ru = 'куб. м'", Метаданные.Языки.Русский.КодЯзыка));
    
    ИнформацияОбАвтомобиле = СокрЛП(ИнформацияОбАвтомобиле);
    
    Пока Прав(ИнформацияОбАвтомобиле,1) = "," Цикл
        ИнформацияОбАвтомобиле = Лев(ИнформацияОбАвтомобиле, СтрДлина(ИнформацияОбАвтомобиле)-1)
    КонецЦикла;
    
    ОтветственноеЛицо = СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеПечати.ДолжностьКладовщика, ДанныеПечати.Кладовщик);
    
    РеквизитыМакета.Вставить("Пункт11_1", ИнформацияОбАвтомобиле);
    РеквизитыМакета.Вставить("Пункт11_2", ДанныеПечати.ГосНомерАвтомобиля);
    
    СведенияОПлательщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Плательщик, ДанныеПечати.Дата,,ДанныеПечати.БанковскийСчетПлательщика);
    
    //++ смарт:ММ 572 11.08.2021
    Если НЕ смартДляАдмирал Тогда
        //-- смарт:ММ 11.08.2021
        
        РеквизитыМакета.Вставить("Пункт15_6", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПлательщике, 
        "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет"));
        
        РеквизитыМакета.Вставить("Пункт16_1", Грузоотправитель);
        РеквизитыМакета.Вставить("Пункт16_2", Перевозчик);
        РеквизитыМакета.Вставить("Пункт16_7", ПредставлениеПеревозчика16_7);
        РеквизитыМакета.Вставить("Пункт16_3", ОтветственноеЛицо);
        
        РеквизитыМакета.Вставить("Пункт16_11", ДанныеПечати.Дата);
        РеквизитыМакета.Вставить("Пункт16_21", ДанныеПечати.Дата);
        
        //++ смарт:ММ 572 11.08.2021
    КонецЕсли;
    //-- смарт:ММ 11.08.2021
    
    ОбластьМакетаОборотная.Параметры.Заполнить(РеквизитыМакета);
    
    ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
    
    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
    
КонецПроцедуры //-- смарт:Подкин #1181 19.09.2022 9:44:02

//++ смарт:Подкин #1181 19.09.2022 9:44:02 новая форма ТН из релиза УТ 11_4_14_140
Процедура ЗаполнитьТабличныйДокументТНВерсияС2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет, смартДляАдмирал = Ложь)
    
    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
    
    ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
    ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
    
    ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
    
    СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
    СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
    СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата);
    
    ПредставлениеГрузоотправителя = "";
    ПредставлениеПеревозчика      = "";
    ПредставлениеПеревозчика12_6  = "";
    Грузоотправитель              = "";
    
    РеквизитыМакета = Новый Структура;
    РеквизитыМакета.Вставить("Пункт0_4", ДанныеПечати.Дата);
    РеквизитыМакета.Вставить("Пункт0_5", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер));
    
    Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда 
        Если СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
            Или СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
            ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
            "ПолноеНаименование,ИНН,ЮридическийАдрес");
            РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
            Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
        Иначе
            //======================================================================================================================
            //++ смарт:ММ 572 11.08.2021
            Если смартДляАдмирал Тогда
                
                //++ смарт:ММ 698 03.11.2021 
                Если ЗначениеЗаполнено(ДанныеПечати.СкладОтправитель) Тогда
                    
                    ПунктПредставление = ДанныеПечати.ПунктПогрузки;
                    
                    Телефоны = ФормированиеПечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(ДанныеПечати.СкладОтправитель);
                    
                    Если ЗначениеЗаполнено(Телефоны) Тогда
                        ПунктПредставление = ПунктПредставление + ", " + Телефоны;
                    КонецЕсли;
                    РеквизитыМакета.Вставить("Пункт1_1", ПунктПредставление);
                Иначе
                    //-- смарт:ММ 03.11.2021 
					
                    //++ #1353 смарт: Фролов 16.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
                    // Необходимо указать адрес склада Адмирал
					ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование,ИНН");
					//
					//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь);
					//
					////++ смарт:Подкин #1121 03.08.2022 15:51:20
					//СкладАдмиралКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмиралКовчег", Ложь); 
					//Если ДанныеПечати.СкладОтправитель = СкладАдмиралКовчег Тогда
					//    СкладАдмирал = СкладАдмиралКовчег;
					//КонецЕсли;
					////-- смарт:Подкин #1121 03.08.2022 15:51:20
					Если ДанныеПечати.СкладОтправитель.смартАвтоматическиФормироватьДокументы Тогда
						СкладАдмирал=ДанныеПечати.СкладОтправитель;	
					КонецЕсли;	
					//-- #1353 смарт: Фролов 16.05.2023 
					
                    АдресСклада = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(СкладАдмирал, "", ДанныеПечати.Дата);
                    ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + ", " + АдресСклада;
                    
                    Телефоны = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "Телефоны");
                    Если ЗначениеЗаполнено(Телефоны) Тогда
                        ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + ", " + Телефоны;
                    КонецЕсли;
                    
                    РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
                    //++ смарт:ММ 698 03.11.2021 
                КонецЕсли;
                //-- смарт:ММ 03.11.2021
            Иначе
                //-- смарт:ММ 11.08.2021
                ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
                "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
                РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
                //++ смарт:ММ 572 11.08.2021
            КонецЕсли;
            //-- смарт:ММ 11.08.2021
            Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
        КонецЕсли;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда 
        Если СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
            Или СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
            РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
            "ПолноеНаименование,ИНН,ЮридическийАдрес"));
        Иначе 
            
            //++ смарт:ММ 698 03.11.2021 
            Если смартДляАдмирал Тогда
                Если ЗначениеЗаполнено(ДанныеПечати.СкладПолучатель) Тогда
                    
                    ПунктПредставление = ДанныеПечати.ПунктРазгрузки;
                    
                    Телефоны = ФормированиеПечатныхФорм.ПолучитьТелефонИзКонтактнойИнформации(ДанныеПечати.СкладПолучатель);
                    
                    Если ЗначениеЗаполнено(Телефоны) Тогда
                        ПунктПредставление = ПунктПредставление + ", " + Телефоны;
                    КонецЕсли;
                    РеквизитыМакета.Вставить("Пункт2_1", ПунктПредставление);
                Иначе
                    РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
                    "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"));
                    
                КонецЕсли;
            Иначе
                //-- смарт:ММ 03.11.2021
                
                РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
                "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"));
                
                //++ смарт:ММ 698 03.11.2021 
            КонецЕсли;
            //-- смарт:ММ 03.11.2021
        КонецЕсли;
    КонецЕсли;
    РеквизитыМакета.Вставить("Пункт2_2", ДанныеПечати.ПунктРазгрузки);
    СтруктураПоиска = Новый Структура("ПорядковыйНомер", ДанныеПечати.ПорядковыйНомер);
    
    ИменаТоваров = "";
    Пока ДанныеСсылкиДокументов.НайтиСледующий(СтруктураПоиска) Цикл
        ИменаТоваров = ИменаТоваров + ДанныеСсылкиДокументов.НаименованиеВидаНоменклатуры + ", ";
    КонецЦикла;			
    
    Если СтрДлина(ИменаТоваров) >= 2 Тогда
        ИменаТоваров = Лев(ИменаТоваров, СтрДлина(ИменаТоваров) - 2);
    КонецЕсли;
    
    РеквизитыМакета.Вставить("Пункт3_1", ИменаТоваров);
    
    Если ЗначениеЗаполнено(ДанныеПечати.Перевозчик) Тогда 
        Если СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
            Или СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
            ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
            "ПолноеНаименование,ФактическийАдрес,Телефоны");
            РеквизитыМакета.Вставить("Пункт6_1", ПредставлениеПеревозчика);
        Иначе
            ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
            "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
            РеквизитыМакета.Вставить("Пункт6_1", ПредставлениеПеревозчика);
        КонецЕсли;
        ПредставлениеПеревозчика12_6 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН,ЮридическийАдрес");
    КонецЕсли;
    
    ГрузоподъемностьВТоннахАвтомобиля      = Формат(ДанныеПечати.ГрузоподъемностьВТоннахАвтомобиля,"");
    ВместимостьВКубическихМетрахАвтомобиля = Формат(ДанныеПечати.ВместимостьВКубическихМетрахАвтомобиля,"");
    
    ИнформацияОбАвтомобиле = ""
    + ?(ПустаяСтрока(ДанныеПечати.ТипАвтомобиля),"",Строка(ДанныеПечати.ТипАвтомобиля) + ", ")
    + ?(ПустаяСтрока(ДанныеПечати.МаркаАвтомобиля),"",ДанныеПечати.МаркаАвтомобиля  + ", ")
    + ?(ПустаяСтрока(ГрузоподъемностьВТоннахАвтомобиля),"",ГрузоподъемностьВТоннахАвтомобиля + " " + НСтр("ru = 'т'", Метаданные.Языки.Русский.КодЯзыка)  + ", ")
    + ?(ПустаяСтрока(ВместимостьВКубическихМетрахАвтомобиля),"",ВместимостьВКубическихМетрахАвтомобиля + " " + НСтр("ru = 'куб. м'", Метаданные.Языки.Русский.КодЯзыка));
    
    ИнформацияОбАвтомобиле = СокрЛП(ИнформацияОбАвтомобиле);
    
    Пока Прав(ИнформацияОбАвтомобиле,1) = "," Цикл
        ИнформацияОбАвтомобиле = Лев(ИнформацияОбАвтомобиле, СтрДлина(ИнформацияОбАвтомобиле)-1)
    КонецЦикла;
    
    РеквизитыМакета.Вставить("Пункт7_1", ИнформацияОбАвтомобиле);
    РеквизитыМакета.Вставить("Пункт7_2", ДанныеПечати.ГосНомерАвтомобиля);
    
    //++ смарт:ММ 572 27.08.2021
    Если смартДляАдмирал = Истина Тогда
        РеквизитыМакета.Вставить("Пункт0_2", ДанныеПечати.ЗаказКлиентаДата);
        РеквизитыМакета.Вставить("Пункт0_3", ДанныеПечати.ЗаказКлиентаНомер);//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.ЗаказКлиентаНомер));			
    КонецЕсли;
    //-- смарт:ММ 27.08.2021
    
    ОбластьМакета.Параметры.Заполнить(РеквизитыМакета);
    
    ТабличныйДокумент.Вывести(ОбластьМакета);
    //++ смарт:ММ 572 12.08.2021
    //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
    //-- смарт:ММ 12.08.2021	
    РеквизитыМакета.Очистить();
    
    РеквизитыМакета.Вставить("Пункт8_1", ПредставлениеГрузоотправителя);
    РеквизитыМакета.Вставить("Пункт8_2", ДанныеПечати.ПунктПогрузки);
    
    МассаБруттоСтрока = НСтр("ru = '%МассаБрутто% кг'", Метаданные.Языки.Русский.КодЯзыка);
    МассаБруттоСтрока = СтрЗаменить(МассаБруттоСтрока, "%МассаБрутто%", ДанныеПечати.МассаБрутто);
    РеквизитыМакета.Вставить("Пункт8_5", МассаБруттоСтрока);
    
    ПредставлениеВодителя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Водитель, ДанныеПечати.Дата);
    РеквизитыМакета.Вставить("Пункт8_8", ПредставлениеВодителя);
    
    
    РеквизитыМакета.Вставить("Пункт10_1", ДанныеПечати.ПунктРазгрузки);
    РеквизитыМакета.Вставить("Пункт10_6", МассаБруттоСтрока);
    РеквизитыМакета.Вставить("Пункт10_9", ПредставлениеВодителя);
    
    СведенияОПлательщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Плательщик, ДанныеПечати.Дата,,ДанныеПечати.БанковскийСчетПлательщика);
    //++ смарт:ММ 572 11.08.2021
    Если НЕ смартДляАдмирал Тогда
        //-- смарт:ММ 11.08.2021
        
        РеквизитыМакета.Вставить("Пункт12_10", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПлательщике, 
        "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет"));
        
        РеквизитыМакета.Вставить("Пункт12_7", Грузоотправитель);
        РеквизитыМакета.Вставить("Пункт12_6", ПредставлениеПеревозчика12_6);
        РеквизитыМакета.Вставить("Пункт12_12", ДанныеПечати.Кладовщик);
        
        РеквизитыМакета.Вставить("Пункт12_13", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
        МассивСтрок = Новый Массив;
        Если Не ПустаяСтрока(ДанныеПечати.ДолжностьКладовщика) Тогда
            МассивСтрок.Добавить(ДанныеПечати.ДолжностьКладовщика);
        КонецЕсли;
        МассивСтрок.Добавить(Формат(ДанныеПечати.Дата, "ДЛФ=D"));
        РеквизитыМакета.Вставить("Пункт12_14", СтрСоединить(МассивСтрок, ", "));
        //++ смарт:ММ 572 11.08.2021
    КонецЕсли;
    //-- смарт:ММ 11.08.2021
    
    ОбластьМакетаОборотная.Параметры.Заполнить(РеквизитыМакета);
    
    ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
    
    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);  
    
КонецПроцедуры //-- смарт:Подкин #1181 19.09.2022 9:44:02

#КонецОбласти

#КонецОбласти

#КонецЕсли
