
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку") Тогда
		// Заполнение шапки
		Инженер = ДанныеЗаполнения.НазначенныйНаЗапускИнженер;
		ДокументОснование = ДанныеЗаполнения.Ссылка; 
		Код=ДанныеЗаполнения.Номер;
		Наименование="Отчет запуска Мимаки (смарт) №"+ДанныеЗаполнения.Номер+" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		Если ДанныеЗаполнения.Оборудование.Количество()>0 Тогда
			Серия=ДанныеЗаполнения.Оборудование[0].Серия;	
			Оборудование=ДанныеЗаполнения.Оборудование[0].Оборудование;
			Чернила=ДанныеЗаполнения.Оборудование[0].ТипЧернилОборудование;
			ДатаУстановки=ДанныеЗаполнения.Оборудование[0].ДатаПодписанияАктаНаПНР;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
