
////////////////////////////////////////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ "УПРАВЛЕНИЕ ПРОЕКТАМИ"

#Область ПрограммныйИнтерфейс

// Возвращает разность дат в секундах.
//
// Параметры:
//	Дата1 - Дата - первая дата.
//	Дата2 - Дата - вторая дата.
//
// Возвращаемое значение:
//	Число - разность дат в секундах.
//
Функция РазностьДатВСекундах(Дата1, Дата2) Экспорт

	Возврат НачалоДня(Дата1) - НачалоДня(Дата2);
	
КонецФункции //РазностьДатВСекундах()

// Возвращает разность дат в днях.
//
// Параметры:
//	Дата1 - Дата - первая дата.
//	Дата2 - Дата - вторая дата.
//
// Возвращаемое значение:
//	Число - разность дат в днях.
//
Функция РазностьДатВДнях(Дата1, Дата2) Экспорт

	Возврат Цел((НачалоДня(Дата1) - НачалоДня(Дата2))) / 86400;
	
КонецФункции //РазностьДатВДнях()

#КонецОбласти