
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуСоответствиеОбъектовСервер(ТаблицаСинхронизируемыхОбъектов1С, ПрограммаOutlook, ПоОбъектамMSOutlook = Ложь)
	СоответствиеОбъектов.Очистить();
	МассивСсылок = Новый Массив();
	Для Каждого СтрокаТаблицы Из ТаблицаСинхронизируемыхОбъектов1С Цикл
		Если ПоОбъектамMSOutlook Тогда
			МассивСсылок = ТаблицаСинхронизируемыхОбъектов1С;
		Иначе
			Если ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) Тогда
				МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если МассивСсылок.Количество() > 0 Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СобственнаяСсылка КАК СобственнаяСсылка,
		|	СсылкаВOutlook КАК СсылкаВOutlook,
		|	ВЫРАЗИТЬ(СобственнаяСсылка КАК Документ.CRM_Взаимодействие).ПлановаяДата КАК Дата
		|ИЗ
		|	РегистрСведений.CRM_СоответствиеОбъектовOutlook
		|ГДЕ
		|	ПрограммаOutlook = &ПрограммаOutlook
		|	И " + ?(ПоОбъектамMSOutlook, "СсылкаВOutlook В (&МассивСсылок)", "СобственнаяСсылка В (&МассивСсылок)") + "
		|");
		Запрос.УстановитьПараметр("ПрограммаOutlook", ПрограммаOutlook);
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		Таблица = Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(Таблица, "СоответствиеОбъектов");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтактыСобытийСервер(События)
	МассивСобытий = Новый Массив();
	Для Каждого СтрокаТаблицы Из События Цикл
		Если СтрокаТаблицы.Пометка И ЗначениеЗаполнено(СтрокаТаблицы.Объект_1С) Тогда
			МассивСобытий.Добавить(СтрокаТаблицы.Объект_1С);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_ВзаимодействиеСторонниеЛица.Ссылка КАК Событие,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер
	|	КОНЕЦ КАК Контакт,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.Наименование
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.CRM_Фамилия
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.CRM_Фамилия
	|	КОНЕЦ КАК CRM_Фамилия,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.CRM_Имя
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.CRM_Имя
	|	КОНЕЦ КАК CRM_Имя,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.CRM_Отчество
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.CRM_Отчество
	|	КОНЕЦ КАК CRM_Отчество,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.ПометкаУдаления
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.Владелец
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер
	|	КОНЕЦ КАК Владелец
	|ИЗ
	|	Документ.CRM_Взаимодействие.СторонниеЛица КАК CRM_ВзаимодействиеСторонниеЛица
	|ГДЕ
	|	CRM_ВзаимодействиеСторонниеЛица.Ссылка В(&События)
	|	И (CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо) <> ТИП(СТРОКА)
	|			ИЛИ CRM_ВзаимодействиеСторонниеЛица.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))");
	Запрос.УстановитьПараметр("События", МассивСобытий);
	Таблица = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Таблица, "КонтактыСобытий");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСоответствиеОбъектов(ТаблицаСинхронизируемыхОбъектов1С, ПрограммаOutlook, ПоОбъектамMSOutlook = Ложь) Экспорт // АПК:78 - исключить из проверки.
	Если ПоОбъектамMSOutlook Тогда
		МассивСсылок = Новый Массив();
		Для Каждого СтрокаТаблицы Из ТаблицаСинхронизируемыхОбъектов1С Цикл
			МассивСсылок.Добавить(СтрокаТаблицы.ОбъектOutlook.ОбъектOutlook.EntryID);
		КонецЦикла;
		ЗаполнитьТаблицуСоответствиеОбъектовСервер(МассивСсылок, ПрограммаOutlook, ПоОбъектамMSOutlook);
	Иначе
		ЗаполнитьТаблицуСоответствиеОбъектовСервер(ТаблицаСинхронизируемыхОбъектов1С, ПрограммаOutlook, ПоОбъектамMSOutlook);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуКонтактыСобытий(События) Экспорт // АПК:78 - исключить из проверки.
	ЗаполнитьТаблицуКонтактыСобытийСервер(События);
КонецПроцедуры

#КонецОбласти
