
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор = Новый Структура();
	Отбор.Вставить("Проект", ПараметрКоманды);
	Отбор.Вставить("КартаМаршрута", ПолучитьКартуМаршрута(ПараметрКоманды));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ПараметрыФормы.Вставить("СкрытьПодменюВидСписка");
	ПараметрыФормы.Вставить("СкрытьБыстрыеОтборы");
	ПараметрыФормы.Вставить("СкрытьПоказКартыМаршрута");
	
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.ФормаСписка",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьКартуМаршрута(Проект)
	
	Возврат Проект.CRM_КартаМаршрута;
	
КонецФункции

#КонецОбласти

