
&НаКлиенте
&ИзменениеИКонтроль("ДобавитьТоварыПоОтбору")
Процедура смарт_ДобавитьТоварыПоОтбору(Команда)

	ПараметрыФормы = Новый Структура("УникальныйИдентификатор, ВестиУчетСертификатовНоменклатуры",
				УникальныйИдентификатор,
				Истина);
	АдресВоВременномХранилище = Неопределено;
	#Вставка 
	//++ #5196 смарт: Тимофеева 02.02.26 / Автозаказ. Дополнительные требования. 
	ПараметрыФормы.Вставить("ОтключитьХарактеристики", Истина);
	//-- #5196 смарт: Тимофеева 02.02.26
	#КонецВставки

	ОткрытьФорму("Обработка.ПодборТоваровПоОтбору.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("ДобавитьТоварыПоОтборуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
