
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если Не ПроведениеСерверУТ.ЗаписыватьПодчиненныеДанные(ДополнительныеСвойства, "СостоянияЗаказов") Тогда
		ПроведениеСерверУТ.ДобавитьСтруктуруЗаписиПодчиненныхДанных(ДополнительныеСвойства, "СостоянияЗаказов");
	КонецЕсли;

	ДополнитьМассивЗаказовДляРасчетаСостояний(ДополнительныеСвойства);

	Если Не ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	БлокироватьДляИзменения = Истина;

	// Текущее состояние набора помещается во временную таблицу "ДвиженияТоварыКОтгрузкеПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Назначение     КАК Назначение,
	|	Таблица.Номенклатура   КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Склад          КАК Склад,
	|	Таблица.КонтролироватьТолькоНаличиеПодЗаказ
	|		ИЛИ Таблица.Назначение.КонтролироватьТолькоНаличие КАК КонтролироватьТолькоНаличиеПодЗаказ,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.Потребность
	|		ИНАЧЕ
	|			-Таблица.Потребность
	|	КОНЕЦ                  КАК ПотребностьПередЗаписью,
	|
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.НаличиеПодЗаказ
	|		ИНАЧЕ
	|			-Таблица.НаличиеПодЗаказ
	|	КОНЕЦ                  КАК НаличиеПередЗаписью,
	|
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|
	|			Таблица.КЗаказу
	|		ИНАЧЕ
	|			-Таблица.КЗаказу
	|	КОНЕЦ                  КАК ЗаказатьПередЗаписью
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.смартПотребностьГарантийные
	|		ИНАЧЕ
	|			-Таблица.смартПотребностьГарантийные
	|	КОНЕЦ                  КАК смартПотребностьГарантийныеПередЗаписью,
	|
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.смартНаличиеПодЗаказГарантийные
	|		ИНАЧЕ
	|			-Таблица.смартНаличиеПодЗаказГарантийные
	|	КОНЕЦ                  КАК смартНаличиеПодЗаказГарантийныеПередЗаписью,
	|
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|
	|			Таблица.смартКЗаказуГарантийные
	|		ИНАЧЕ
	|			-Таблица.смартКЗаказуГарантийные
	|	КОНЕЦ                  КАК смартКЗаказуГарантийныеПередЗаписью
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|ПОМЕСТИТЬ РезервыТоваровПередЗаписью
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|		 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|		 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО Таблица.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|		И НЕ &ЭтоНовый
	|		И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|			ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|			НастройкаСклад.Контролировать))";

	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();

КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ПроведениеСерверУТ.ЗаписыватьПодчиненныеДанные(ДополнительныеСвойства, "СостоянияЗаказов") Тогда
		ПроведениеСерверУТ.ДобавитьСтруктуруЗаписиПодчиненныхДанных(ДополнительныеСвойства, "СостоянияЗаказов");
	КонецЕсли;

	ДополнитьМассивЗаказовДляРасчетаСостояний(ДополнительныеСвойства);

	Если Не ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;

	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ОбособлениеСверхПотребности",
	ПолучитьФункциональнуюОпцию("РазрешитьОбособлениеТоваровСверхПотребности"));
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзмененийПослеГруппировки.Назначение           КАК Назначение,
	|	ТаблицаИзмененийПослеГруппировки.Номенклатура         КАК Номенклатура,
	|	ТаблицаИзмененийПослеГруппировки.Характеристика       КАК Характеристика,
	|	ТаблицаИзмененийПослеГруппировки.Склад                КАК Склад,
	|	ТаблицаИзмененийПослеГруппировки.НаличиеИзменение     КАК НаличиеИзменение,
	|	ВЫБОР КОГДА ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|		ТОГДА 0
	|		ИНАЧЕ ТаблицаИзмененийПослеГруппировки.ПотребностьИзменение
	|	КОНЕЦ                                                 КАК ПотребностьИзменение,
	|	ВЫБОР КОГДА ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|		ТОГДА 0
	|		ИНАЧЕ ТаблицаИзмененийПослеГруппировки.ЗаказатьИзменение
	|	КОНЕЦ                                                 КАК ЗаказатьИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ТаблицаИзмененийПослеГруппировки.смартНаличиеПодЗаказГарантийныеИзменение     КАК смартНаличиеПодЗаказГарантийныеИзменение,
	|	ВЫБОР КОГДА ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|		ТОГДА 0
	|		ИНАЧЕ ТаблицаИзмененийПослеГруппировки.смартПотребностьГарантийныеИзменение
	|	КОНЕЦ                                                 КАК смартПотребностьГарантийныеИзменение,
	|	ВЫБОР КОГДА ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|		ТОГДА 0
	|		ИНАЧЕ ТаблицаИзмененийПослеГруппировки.смартКЗаказуГарантийныеИзменение
	|	КОНЕЦ                                                 КАК смартКЗаказуГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ПОМЕСТИТЬ ОбеспечениеЗаказовИзменение
	|ИЗ(
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.Назначение                      КАК Назначение,
	|		ТаблицаИзменений.Номенклатура                    КАК Номенклатура,
	|		ТаблицаИзменений.Характеристика                  КАК Характеристика,
	|		ТаблицаИзменений.Склад                           КАК Склад,
	|		СУММА(ТаблицаИзменений.НаличиеИзменение)         КАК НаличиеИзменение,
	|		СУММА(ТаблицаИзменений.ПотребностьИзменение)     КАК ПотребностьИзменение,
	|		СУММА(ТаблицаИзменений.ЗаказатьИзменение)        КАК ЗаказатьИзменение,
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		СУММА(ТаблицаИзменений.смартНаличиеПодЗаказГарантийныеИзменение)         КАК смартНаличиеПодЗаказГарантийныеИзменение,
	|		СУММА(ТаблицаИзменений.смартПотребностьГарантийныеИзменение)     КАК смартПотребностьГарантийныеИзменение,
	|		СУММА(ТаблицаИзменений.смартКЗаказуГарантийныеИзменение)        КАК смартКЗаказуГарантийныеИзменение,
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|		
	|		МАКСИМУМ(ТаблицаИзменений.КонтролироватьТолькоНаличиеПодЗаказ) КАК КонтролироватьТолькоНаличиеПодЗаказ
	|	ИЗ(
	|		ВЫБРАТЬ
	|			Таблица.Назначение                  КАК Назначение,
	|			Таблица.КонтролироватьТолькоНаличиеПодЗаказ
	|				ИЛИ (Таблица.Назначение.Заказ <> НЕОПРЕДЕЛЕНО И &ОбособлениеСверхПотребности) КАК КонтролироватьТолькоНаличиеПодЗаказ,
	|			Таблица.Номенклатура                КАК Номенклатура,
	|			Таблица.Характеристика              КАК Характеристика,
	|			Таблица.Склад                       КАК Склад,
	|			Таблица.НаличиеПередЗаписью         КАК НаличиеИзменение,
	|			Таблица.ПотребностьПередЗаписью     КАК ПотребностьИзменение,
	|			Таблица.ЗаказатьПередЗаписью        КАК ЗаказатьИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|			, Таблица.смартНаличиеПодЗаказГарантийныеПередЗаписью         КАК смартНаличиеПодЗаказГарантийныеИзменение,
	|			Таблица.смартПотребностьГарантийныеПередЗаписью     КАК смартПотребностьГарантийныеИзменение,
	|			Таблица.смартКЗаказуГарантийныеПередЗаписью        КАК смартКЗаказуГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|		ИЗ
	|			РезервыТоваровПередЗаписью КАК Таблица
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Таблица.Назначение             КАК Назначение,
	|			Таблица.КонтролироватьТолькоНаличиеПодЗаказ
	|				ИЛИ Таблица.Назначение.КонтролироватьТолькоНаличие
	|				ИЛИ (Таблица.Назначение.Заказ <> НЕОПРЕДЕЛЕНО И &ОбособлениеСверхПотребности) КАК КонтролироватьТолькоНаличиеПодЗаказ,
	|			Таблица.Номенклатура           КАК Номенклатура,
	|			Таблица.Характеристика         КАК Характеристика,
	|			Таблица.Склад                  КАК Склад,
	|			ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					-Таблица.НаличиеПодЗаказ
	|				ИНАЧЕ
	|					Таблица.НаличиеПодЗаказ
	|			КОНЕЦ                          КАК НаличиеИзменение,
	|			ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					-Таблица.Потребность
	|				ИНАЧЕ
	|					Таблица.Потребность
	|			КОНЕЦ                          КАК ПотребностьИзменение,
	|			ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					-Таблица.КЗаказу
	|				ИНАЧЕ
	|					Таблица.КЗаказу
	|			КОНЕЦ                          КАК ЗаказатьИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|			, ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					-Таблица.смартНаличиеПодЗаказГарантийные
	|				ИНАЧЕ
	|					Таблица.смартНаличиеПодЗаказГарантийные
	|			КОНЕЦ                          КАК смартНаличиеПодЗаказГарантийныеИзменение,
	|			ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					-Таблица.смартПотребностьГарантийные
	|				ИНАЧЕ
	|					Таблица.смартПотребностьГарантийные
	|			КОНЕЦ                          КАК смартПотребностьГарантийныеИзменение,
	|			ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|					-Таблица.смартКЗаказуГарантийные
	|				ИНАЧЕ
	|					Таблица.смартКЗаказуГарантийные
	|			КОНЕЦ                          КАК смартКЗаказуГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|		ИЗ
	|			РегистрНакопления.ОбеспечениеЗаказов КАК Таблица
	|				
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|				ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|				 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|				 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|				
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|				ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|				 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|				 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|				
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|				ПО Таблица.Склад = НастройкаСклад.Склад
	|				 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|				 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|		ГДЕ
	|			Таблица.Регистратор = &Регистратор
	|				И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|					ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|					НастройкаСклад.Контролировать))
	|	) КАК ТаблицаИзменений
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаИзменений.Назначение,
	|		ТаблицаИзменений.Номенклатура,
	|		ТаблицаИзменений.Характеристика,
	|		ТаблицаИзменений.Склад) КАК ТаблицаИзмененийПослеГруппировки
	|
	|ГДЕ
	#Удаление //++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	ТаблицаИзмененийПослеГруппировки.НаличиеИзменение > 0
	|		ИЛИ НЕ ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|			И(	ТаблицаИзмененийПослеГруппировки.ПотребностьИзменение <> 0
	|				ИЛИ ТаблицаИзмененийПослеГруппировки.НаличиеИзменение < 0
	|				ИЛИ ТаблицаИзмененийПослеГруппировки.ЗаказатьИзменение > 0)
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	( ТаблицаИзмененийПослеГруппировки.НаличиеИзменение > 0
	|		ИЛИ НЕ ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|			И(	ТаблицаИзмененийПослеГруппировки.ПотребностьИзменение <> 0
	|				ИЛИ ТаблицаИзмененийПослеГруппировки.НаличиеИзменение < 0
	|				ИЛИ ТаблицаИзмененийПослеГруппировки.ЗаказатьИзменение > 0) )
	|	ИЛИ ( ТаблицаИзмененийПослеГруппировки.смартНаличиеПодЗаказГарантийныеИзменение > 0
	|		ИЛИ НЕ ТаблицаИзмененийПослеГруппировки.КонтролироватьТолькоНаличиеПодЗаказ
	|			И(	ТаблицаИзмененийПослеГруппировки.смартПотребностьГарантийныеИзменение <> 0
	|				ИЛИ ТаблицаИзмененийПослеГруппировки.смартНаличиеПодЗаказГарантийныеИзменение < 0
	|				ИЛИ ТаблицаИзмененийПослеГруппировки.смартНаличиеПодЗаказГарантийныеИзменение > 0) )
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаИзмененийПослеГруппировки.Назначение,
	|	ТаблицаИзмененийПослеГруппировки.Номенклатура,
	|	ТаблицаИзмененийПослеГруппировки.Характеристика,
	|	ТаблицаИзмененийПослеГруппировки.Склад
	|;
	|УНИЧТОЖИТЬ РезервыТоваровПередЗаписью";

	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();

	СтруктураВременныеТаблицы.Вставить("ОбеспечениеЗаказовИзменение", Выборка.Количество > 0);

КонецПроцедуры

&ИзменениеИКонтроль("ДополнитьМассивЗаказовДляРасчетаСостояний")
Процедура смарт_ДополнитьМассивЗаказовДляРасчетаСостояний(ДополнительныеСвойства)

	Если Не ДополнительныеСвойства.Свойство("ДляЗаписиПодчиненныхДанных") Тогда
		Возврат;
	КонецЕсли;

	Если Не ПроведениеСерверУТ.ЗаписыватьПодчиненныеДанные(ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных, "СостоянияЗаказов") Тогда
		ПроведениеСерверУТ.ДобавитьСтруктуруЗаписиПодчиненныхДанных(ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных, "СостоянияЗаказов");
	КонецЕсли;

	СтруктураДляРасчетаСостояний = ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных.СтруктураДляРасчетаСостояний;

	// Заказы из текущего состояния набора добавляем к общему массиву заказов.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("МассивЗаказов", СтруктураДляРасчетаСостояний.МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДокумента.Назначение     КАК Назначение,
	|	ДвиженияДокумента.Номенклатура   КАК Номенклатура,
	|	ДвиженияДокумента.Характеристика КАК Характеристика,
	|	ДвиженияДокумента.Склад          КАК Склад
	|ПОМЕСТИТЬ ВтДвиженияДокумента
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов КАК ДвиженияДокумента
	|ГДЕ
	|	ДвиженияДокумента.Регистратор = &Регистратор
	|	И ДвиженияДокумента.Активность
	|;
	|
	|///////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДвиженияНазначения.Регистратор    КАК Регистратор,
	|	ВсеДвиженияНазначения.Назначение     КАК Назначение,
	|	ВсеДвиженияНазначения.Номенклатура   КАК Номенклатура,
	|	ВсеДвиженияНазначения.Характеристика КАК Характеристика,
	|	ВсеДвиженияНазначения.Склад          КАК Склад
	|ПОМЕСТИТЬ ВтВсеДвиженияНазначения
	|ИЗ
	|	ВтДвиженияДокумента КАК ДвиженияДокумента
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбеспечениеЗаказов КАК ВсеДвиженияНазначения
	|		ПО ВсеДвиженияНазначения.Назначение        = ДвиженияДокумента.Назначение
	|			И ВсеДвиженияНазначения.Номенклатура   = ДвиженияДокумента.Номенклатура
	|			И ВсеДвиженияНазначения.Характеристика = ДвиженияДокумента.Характеристика
	|			И ВсеДвиженияНазначения.Склад          = ДвиженияДокумента.Склад
	|ГДЕ
	|	ВсеДвиженияНазначения.Активность
	#Удаление //++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	И ВсеДвиженияНазначения.Потребность > 0
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	И ( ВсеДвиженияНазначения.Потребность > 0
	|	ИЛИ ВсеДвиженияНазначения.смартПотребностьГарантийные > 0 )
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	И ВсеДвиженияНазначения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ ВсеДвиженияНазначения.Регистратор В(&МассивЗаказов)
	|;
	|
	|///////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикОтгрузки.Регистратор КАК Заказ
	|ИЗ
	|	ВтВсеДвиженияНазначения КАК ВсеДвиженияНазначения
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикОтгрузкиТоваров КАК ГрафикОтгрузки
	|		ПО ГрафикОтгрузки.Регистратор       = ВсеДвиженияНазначения.Регистратор
	|			И ГрафикОтгрузки.Назначение     = ВсеДвиженияНазначения.Назначение
	|			И ГрафикОтгрузки.Номенклатура   = ВсеДвиженияНазначения.Номенклатура
	|			И ГрафикОтгрузки.Характеристика = ВсеДвиженияНазначения.Характеристика
	|			И ГрафикОтгрузки.Склад          = ВсеДвиженияНазначения.Склад
	|ГДЕ
	|	ГрафикОтгрузки.Активность";
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтруктураДляРасчетаСостояний.МассивЗаказов, МассивЗаказов);

КонецПроцедуры
