#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
// Добавляет команду создания документа "Интерес".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.CRM_Интерес) Тогда

		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.CRM_Интерес.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.CRM_Интерес);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции //-- #1989 смарт: Лопато 15.08.2024

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Задачи.ЗадачаИсполнителя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры //-- #1989 смарт: Лопато 15.08.2024

//++ #Б-2168 смарт: Лопато 07.02.2025 //Создание интереса из заявки на ремонтное обслуживание  
&ИзменениеИКонтроль("ОбработкаПолученияФормы")
Процедура смарт_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	#Вставка
	//++ #Б-2168 смарт: Лопато 07.02.2025 //Создание интереса из заявки на ремонтное обслуживание  
	Если ВидФормы = "ФормаОбъекта"
		И Параметры.Свойство("Основание")
        //++ #Б-2322 смарт: Лопато 17.02.2025 //Создания интереса из "Заявки на ремонтные работы"  
		И (ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов")
		   ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы")) Тогда
		//-- #Б-2322 смарт: Лопато 17.02.2025
		
		Возврат;
		
    КонецЕсли;
	//-- #Б-2168 смарт: Лопато 07.02.2025
	
	//++ #6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия
	Если ВидФормы = "ФормаОбъекта"
		И Параметры.Свойство("Основание")
       	И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.МаркетинговыеМероприятияДокумент")
		Тогда
			
		Возврат;
		
	КонецЕсли;
	//-- #6224 смарт: Тимофеева 13.04.2026 
	#КонецВставки
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если НЕ Параметры.Свойство("Ключ") Тогда
			СтандартнаяОбработка = Ложь;
			Основание = Неопределено;
			Если Параметры.Свойство("Основание", Основание)  Тогда
				Если ТипЗнч(Основание) = Тип("СправочникСсылка.Партнеры") Тогда
					Параметры.Вставить("Партнер", Основание);
				КонецЕсли;
			ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда	
				Если Параметры.ЗначенияЗаполнения.Свойство("Партнер") Тогда
					Параметры.Вставить("Партнер", Параметры.ЗначенияЗаполнения.Партнер);
				КонецЕсли;
			КонецЕсли;
			ВыбраннаяФорма = "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли