
//++ смарт:ММ #044 224 16.02.2021 - Заявка на гарантийный ремонт 
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	смартСписокСкладов = Новый Массив;
	
	Если Параметры.Свойство("смартСписокСкладов", смартСписокСкладов) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", смартСписокСкладов, ВидСравненияКомпоновкиДанных.ВСписке, "Только склады с доступным остатком", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, "смартОтборСклад");
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 16.02.2021

