
//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.07.2020 14:52:33   Добавим регистр 
&НаСервере
&Вместо("ПолучитьСписокСправочников")
Функция смарт_ПолучитьСписокСправочников()
	ТекВыгрСправочники = ВыгружаемыеСправочники.Выгрузить(, "Справочник").ВыгрузитьКолонку("Справочник");
	
	СписокСправочников = Новый Массив;
	
	Для Каждого ТекСтр из Метаданные.Справочники Цикл
		
		Если ТекВыгрСправочники.Найти(ТекСтр.Имя) = Неопределено тогда
			СписокСправочников.Добавить(ТекСтр.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.07.2020 14:53:34
	     СписокСправочников.Добавить("НоменклатураПродаваемаяСовместно");
		 СписокСправочников.Добавить("СмартФактОтчетБитрикс");
		 СписокСправочников.Добавить("СмартДебиторскаяЗадолженностьБитрикс");
	//Смарт }Подкин Алексей Иванович 06.07.2020 14:53:34

	//++#1323 смарт: Лопато 06.04.2023 //Восстановить и переделать механизм индивидуальных скидок
	СписокСправочников.Добавить("СмартИндивидуальныеСкидкиКлиентов");
	//--#1323 смарт: Лопато 06.04.2023	
	
	Возврат СписокСправочников;	

КонецФункции

&НаСервере
&Вместо("ОбновлениеПолейСправочника")
Процедура смарт_ОбновлениеПолейСправочника(пСправочник)
	
	Если пСправочник <> Неопределено тогда
		ТекСправочник = пСправочник; 
	Иначе
		ТекСправочник = "";	
	КонецЕсли;                            
	
	Если ТекСправочник <> Неопределено тогда
		
		НайденныеРекОбъекта = ВыгружаемыеПоляСправочников.НайтиСтроки(Новый Структура("Справочник", ТекСправочник));
		
		ВыгружаемыеПоляСправочникаФ.Очистить();
		
		Если НайденныеРекОбъекта.Количество() = 0 тогда
			
			Если ЗначениеЗаполнено(ТекСправочник) тогда
				
				ТекСпр = Метаданные.Справочники.Найти(ТекСправочник);
				
				//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.07.2020 15:14:10
				Если ТекСпр=Неопределено тогда
					ТекСпр = Метаданные.РегистрыСведений.Найти(ТекСправочник);
				КонецЕсли;
				//Смарт }Подкин Алексей Иванович 06.07.2020 15:14:10
				
				НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
				НовСтр.Поле = "Код";
				НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();	
				НовСтр.Поле = "Наименование";
				НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();	
				НовСтр.Поле	= "ПометкаУдаления";
				НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();	
				НовСтр.Поле	= "Владелец";
				НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();	
				НовСтр.Поле	= "Родитель";
				Для каждого ТекРек из ТекСпр.Реквизиты Цикл
					НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();	
					НовСтр.Поле = ТекРек.Имя;
				КонецЦикла;
				
			КонецЕсли;
		Иначе
			
			Для каждого ТекРек из НайденныеРекОбъекта Цикл
				НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();	
				НовСтр.Поле 				= ТекРек.Поле;
				НовСтр.Выгружаемо 			= ТекРек.Выгружаемо;
				НовСтр.ВыгружатьКакСтрока 	= ТекРек.ВыгружатьКакСтрока;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.05.2020 12:49:11

	Если пСправочник ="Контрагенты" тогда
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДменеджера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДменеджера";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ЮрАдрес"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ЮрАдрес";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ФактАдрес"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ФактАдрес";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","Телефон"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Телефон";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ЭлПочта"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ЭлПочта";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ПаспДанныеФЛ"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ПаспДанныеФЛ";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДДопМенеджера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДДопМенеджера";
		КонецЕсли;

		//++#1615 смарт: Лопато 02.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "ГУИДРасходМенеджера"));
		Если МассивНайден.Количество() = 0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДРасходМенеджера";
		КонецЕсли;
		//--#1615 смарт: Лопато 02.02.2024
		
	ИначеЕсли пСправочник ="Партнеры" тогда
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДменеджера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДменеджера";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДДопМенеджера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДДопМенеджера";
		КонецЕсли;
		
		//++#1615 смарт: Лопато 02.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "ГУИДРасходМенеджера"));
		Если МассивНайден.Количество() = 0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДРасходМенеджера";
		КонецЕсли;
		//--#1615 смарт: Лопато 02.02.2024
		
	ИначеЕсли пСправочник ="СоглашенияСКлиентами" тогда
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДпартнера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДпартнера";
		КонецЕсли;
		
	ИначеЕсли пСправочник ="КонтактныеЛицаПартнеров" тогда
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДпартнера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДпартнера";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","Телефон"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Телефон";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","РольКонтактногоЛица"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "РольКонтактногоЛица";
		КонецЕсли;

	ИначеЕсли пСправочник ="Пользователи" Тогда

		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","Телефон"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Телефон";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ЭлПочта"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ЭлПочта";
		КонецЕсли;
		
		//++ #Б-1088 смарт: Лопато 04.03.2025 //ИМ. Выгрузка КИ менеджеров в ИМ (ИТСМ 1763)  
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "МобильныйТелефон"));
		Если МассивНайден.Количество() = 0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "МобильныйТелефон";
		КонецЕсли;

		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "РабочийТелефон"));
		Если МассивНайден.Количество() = 0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "РабочийТелефон";
		КонецЕсли;
		//-- #Б-1088 смарт: Лопато 04.03.2025
		
	ИначеЕсли пСправочник ="НоменклатураПродаваемаяСовместно" тогда
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДтовара"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДтовара";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДСопутствующегоТовара"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДСопутствующегоТовара";
		КонецЕсли;
		
	ИначеЕсли пСправочник ="СмартФактОтчетБитрикс" тогда
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДпартнера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДпартнера";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","Валюта"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Валюта";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","Сумма"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Сумма";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","Дата"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Дата";
		КонецЕсли;
		
	ИначеЕсли пСправочник ="СмартДебиторскаяЗадолженностьБитрикс" тогда
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДпартнера"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДпартнера";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДконтрагента"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДконтрагента";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ОбщаяЗадолженность"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ОбщаяЗадолженность";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ПросроченнаяЗадолженность"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ПросроченнаяЗадолженность";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ГУИДзаказа"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДзаказа";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","НомерЗаказа"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "НомерЗаказа";
        КонецЕсли; 
        
        МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ДатаЗаказа"));
        Если МассивНайден.Количество()=0 тогда
            НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
            НовСтр.Поле = "ДатаЗаказа";
        КонецЕсли;
        
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","КоличествоДнейПросроченногоПлатежа"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "КоличествоДнейПросроченногоПлатежа";
		КонецЕсли;
		
        МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ДатаОплаты"));
        Если МассивНайден.Количество()=0 тогда
            НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
            НовСтр.Поле = "ДатаОплаты";
        КонецЕсли;
               
        МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ОбщаяЗадолженностьПоЗаказу"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ОбщаяЗадолженностьПоЗаказу";
		КонецЕсли;
		
		МассивНайден=  ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле","ПросроченнаяЗадолженностьПоЗаказу"));
		Если МассивНайден.Количество()=0 тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ПросроченнаяЗадолженностьПоЗаказу";
		КонецЕсли;

		//Смарт }Подкин Алексей Иванович 06.07.2020 10:57:26		
		
	//++#1323 смарт: Лопато 06.04.2023 //Восстановить и переделать механизм индивидуальных скидок
	ИначеЕсли пСправочник = "СмартИндивидуальныеСкидкиКлиентов" Тогда

		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "ГУИДпартнера"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДпартнера";
		КонецЕсли;
		
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "НазваниеПартнера"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "НазваниеПартнера";
		КонецЕсли;

		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "ГУИДтовара"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ГУИДтовара";
		КонецЕсли;
		
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "НазваниеТовара"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "НазваниеТовара";
		КонецЕсли;
		
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "ПроцентСкидки"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "ПроцентСкидки";
		КонецЕсли;

		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "НачалоДействия"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "НачалоДействия";
		КонецЕсли;

		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "СрокДействия"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "СрокДействия";
		КонецЕсли;

		//++ #1870 смарт: Лопато 26.08.2024 //Доработать механизм выгрузки индивидуальных скидок  
		МассивНайден = ВыгружаемыеПоляСправочникаФ.НайтиСтроки(Новый Структура("Поле", "Комментарий"));
		Если МассивНайден.Количество() = 0 Тогда
			НовСтр = ВыгружаемыеПоляСправочникаФ.Добавить();
			НовСтр.Поле = "Комментарий";
		КонецЕсли;
		//-- #1870 смарт: Лопато 26.08.2024
		
	//--#1323 смарт: Лопато 06.04.2023	
		
	КонецЕсли;

КонецПроцедуры

//Смарт }Подкин Алексей Иванович 06.07.2020 14:52:33
