
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Элементы.Переключатель.КоличествоКолонок = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Переключатель = "1";
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Если Переключатель = "1" Тогда
		ОткрытьФорму("Обработка.CRM_ЗагрузкаДанныхИзФайла.Форма.ФормаИмпортаКлиентов", Новый Структура("ВидСправочника", "Партнеры"), ЭтотОбъект, УникальныйИдентификатор);
	Иначе
		ОткрытьФорму("Обработка.CRM_ОбменСAmoCrm.Форма.ФормаПомощник",, ЭтотОбъект,УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьПризнакИспользования();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьУсловноеОформление()
	
		Элементы.ДекорацияИнформация.Заголовок = ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекст()
	
	Если Переключатель = "1" Тогда
		
		Текст = "Импорт клиентов, контактов и их реквизитов и Интересов по ним.";
		
	Иначе
		
		Текст = "Загрузка данных из AmoCRM. Позволяет перенести все накопленные данные как единоразово, так загружать их по расписанию.";
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Процедура УстановитьПризнакИспользования()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.CRM_НастроенныеРазделыРешения.СоздатьМенеджерЗаписи();
	Менеджер.РазделНастройки = Перечисления.CRM_РазделыНастройкиРешения.ПортретКлиента;
	Менеджер.Записать();
	
КонецПроцедуры

#КонецОбласти




