
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыВызова = Новый Структура("Источник,  Окно, НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВызова, ПараметрыВыполненияКоманды);
	
	ПараметрыВызова.Вставить("Уникальность", "Панель_СофтФон");
	
	ИмяРаздела ="CRM_РазделКалендарьПочта";
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИмяРаздела = "CRM_МодульCRM." + ИмяРаздела ;
	КонецЕсли;
	
	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов(ИмяРаздела, ПараметрыВызова);
	
КонецПроцедуры

#КонецОбласти
