
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) ИЛИ КартаМаршрутаЭтоГруппа(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ КартаРедактируется(ПараметрКоманды) Тогда
		
		Если ПараметрКоманды = ПредопределенноеЗначение("Справочник.CRM_КартыМаршрутов.ЗапросНаИзменениеСроков") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Запуск бизнес-процесса в ручном режиме для данной карты запрещен!';en='Running a business process in manual mode for this card is prohibited!'"));
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
		
		Если CRM_БизнесПроцессыИЗадачиСервер.ЭтоПоручение(ПараметрКоманды) Тогда
			ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаПоручения", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ЭтоНезависимыйПроцесс(ПараметрКоманды) Тогда
			ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаСтартаНезависимого", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.ФормаОбъекта",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Карта маршрута редактируется. Старт бизнес-процесса не возможен.';en='The route map are edit. Start of business process are not possible.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КартаРедактируется(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Редактируется;
	
КонецФункции

&НаСервере
Функция КартаМаршрутаЭтоГруппа(КартаМаршрута)
	Возврат (КартаМаршрута.ЭтоГруппа);
КонецФункции

&НаСервере
Функция ЭтоНезависимыйПроцесс(КартаМаршрута)
	
	Возврат (КартаМаршрута.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс);
	
КонецФункции

#КонецОбласти

