
&Вместо("ЕстьДвиженияПоСрокам")
Функция смарт_ЕстьДвиженияПоСрокам()	
	//Каратеев ++  -----> адаптация Малыгина 30.01.2020
	//Результат = ПродолжитьВызов();
	Результат = Ложь;
	//Каратеев --
	Возврат Результат;
КонецФункции

//&Вместо("ЕстьДвиженияПоСрокам")
//Функция смарт_ЕстьДвиженияПоСрокам()
//	
//	ТекстЗапроса = 
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументРегистратор
//	|ИЗ
//	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
//	|ГДЕ
//	|	РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И РасчетыПоСрокам.ДокументРегистратор = &ДокументРегистратор";
//	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетыСПоставщиками", "РасчетыСКлиентами");
//	КонецЕсли;
//	
//	Запрос = Новый Запрос(ТекстЗапроса);
//	
//	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
//	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
//	Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
//	
//	НаборДвижений = Запрос.Выполнить();
//	
//	//Каратеев ++
//	//Возврат НЕ НаборДвижений.Пустой();
//	Возврат Ложь;
//	//Каратеев --
//	
//КонецФункции
