#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Справочники.смартПредопределенныеЗначения);
	
	Элементы.ГруппаРаспределениеЗаказовСайтаТестовыйРежим.Видимость = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	//++ #Б220 смарт: Шляпников 26.09.2024 / Автоматическое закрытие заказов. Разработка
	ИнициализироватьКомпоновщикиНастроекАвтоматическогоЗакрытияЗаказов();
	//-- #Б220 смарт: Шляпников 26.09.2024

	//++ #Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных
	ИнициализироватьRoistatНастройкиОтбораИнтересов();
	//-- #Б-1534 смарт: Лопато 05.12.2024
	
	//++ #Б-2064 смарт: Фролов 04.02.2025 //Создание пользователя ИМ на основании договора поставки. Регистрация клиента на сайте.
	НоваяКоманда		= ЭтаФорма.Команды.Добавить("ИнформацияПоДатеРегистрацииПользователяИМ");
	НоваяКоманда.Действие	= "ИнформацияПоДатеРегистрацииПользователяИМ";
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("ИнформацияПоДатеРегистрацииПользователяИМ", "Информация о дате регистрации полльзователя ИМ", 
		Элементы.ГруппаРегистрацияПользователяИМ, ЭтаФорма); 
	//-- #Б-2064 смарт: Фролов 04.02.2025

КонецПроцедуры

//++ #Б220 смарт: Шляпников 26.09.2024 / Автоматическое закрытие заказов. Разработка
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкиАвтоматическогоЗакрытия = Новый Структура;
	НастройкиАвтоматическогоЗакрытия.Вставить("АвтоматическиЗакрыватьЗаказыКлиентов", АвтоматическиЗакрыватьЗаказыКлиентов);
	НастройкиАвтоматическогоЗакрытия.Вставить("АвтоматическиЗакрыватьЗаказыНаПеремещение", АвтоматическиЗакрыватьЗаказыНаПеремещение);
	НастройкиАвтоматическогоЗакрытия.Вставить("АвтоматическиЗакрыватьЗаказыНаСборку", АвтоматическиЗакрыватьЗаказыНаСборку);
	//++ #5634 смарт: Тимофеева 13.02.26 / Автоматическое закрытие заказов. Дополнение. Заказ на внутреннее потребление
	//смартОбеспечение.ЗаписатьНастройкиНастройкиАвтоматическогоЗакрытияЗаказов(ТекущийОбъект, КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовКлиентов, КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаПеремещение, КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаСборку, НастройкиАвтоматическогоЗакрытия);
    НастройкиАвтоматическогоЗакрытия.Вставить("АвтоматическиЗакрыватьЗаказыНаВнутреннееПотребление", АвтоматическиЗакрыватьЗаказыНаВнутреннееПотребление);
	смартОбеспечение.ЗаписатьНастройкиНастройкиАвтоматическогоЗакрытияЗаказов(ТекущийОбъект, 
																			КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовКлиентов, 
																			КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаПеремещение, 
																			КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаСборку,
																			КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаВнутреннееПотребление,
																			НастройкиАвтоматическогоЗакрытия);

	//-- #5634 смарт: Тимофеева 13.02.26
	
		
	//++ #Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных
	ТекущийОбъект.RoistatНастройкиОтбораИнтересов = 
		Новый ХранилищеЗначения(ЭтаФорма.КомпоновщикНастроекОтбораИнтересов.ПолучитьНастройки(), Новый СжатиеДанных(9));
	//-- #Б-1534 смарт: Лопато 05.12.2024

КонецПроцедуры

//++ #Б1254 смарт: Шляпников 01.11.2024 / Автоматическое закрытие заказов. Дополнение
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ИнициализироватьКомпоновщикиНастроекАвтоматическогоЗакрытияЗаказов();
	
	//++ #Б2722 смарт: Шляпников 20.03.2025 / Заявка на разборку оборудования. Уведомления.
	ОбновитьПовторноИспользуемыеЗначения();
	//-- #Б2722 смарт: Шляпников 20.03.2025

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РаспределениеЗаказовСайтаТестовыйРежимПриИзменении(Элемент)

	//Очистка настроек, которые непримеными в тестовой базе (например, адреса рассылок)
	Если Объект.РаспределениеЗаказовСайтаТестовыйРежим Тогда
		
		Объект.РаспределениеЗаказовСайтаПочтаБэкОфис.Очистить();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//++ #Б220 смарт: Шляпников 26.09.2024 / Автоматическое закрытие заказов. Разработка
&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовКлиентовНаСервере()
	смартОбеспечение.УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовКлиентов,1, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовКлиентов(Команда)
	УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаПеремещениеНаСервере()
	смартОбеспечение.УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаПеремещение,2, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаПеремещение(Команда)
	УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаПеремещениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаСборкуНаСервере()
	смартОбеспечение.УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаСборку,3, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаСборку(Команда)
	УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаСборкуНаСервере();
КонецПроцедуры  

//-- #Б220 смарт: Шляпников 26.09.2024  

//++ #5634 смарт: Тимофеева 13.02.26 / Автоматическое закрытие заказов. Дополнение. Заказ на внутреннее потребление
&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаВнутреннееПотреблениеНаСервере()
	смартОбеспечение.УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаВнутреннееПотребление,4, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаВнутреннееПотребление(Команда)
	УстановитьНастройкиПоУмолчаниюАвтоматическогоЗакрытияЗаказовНаВнутреннееПотреблениеНаСервере();
КонецПроцедуры
//-- #5634 смарт: Тимофеева 13.02.26

//++ #Б1254 смарт: Шляпников 01.11.2024 / Автоматическое закрытие заказов. Дополнение
Процедура ИнициализироватьКомпоновщикиНастроекАвтоматическогоЗакрытияЗаказов()
	
	смартОбеспечение.НастроитьКомпоновщикАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовКлиентов, 1, Истина, УникальныйИдентификатор);
	смартОбеспечение.НастроитьКомпоновщикАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаПеремещение, 2, Истина, УникальныйИдентификатор);
	смартОбеспечение.НастроитьКомпоновщикАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаСборку, 3, Истина, УникальныйИдентификатор);
	//++ #5634 смарт: Тимофеева 13.02.26 / Автоматическое закрытие заказов. Дополнение. Заказ на внутреннее потребление 
	смартОбеспечение.НастроитьКомпоновщикАвтоматическогоЗакрытияЗаказов(КомпоновщикНастроекАвтоматическогоЗакрытияЗаказовНаВнутреннееПотребление, 4, Истина, УникальныйИдентификатор);
	//-- #5634 смарт: Тимофеева 13.02.26

	НастройкиАвтоматическогоЗакрытия = смартОбеспечение.ПрочитатьНастройкиАвтоматическогоЗакрытияЗаказов();
	//++ #5634 смарт: Тимофеева 13.02.26 / Автоматическое закрытие заказов. Дополнение. Заказ на внутреннее потребление 
	//ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиАвтоматическогоЗакрытия, "АвтоматическиЗакрыватьЗаказыКлиентов, АвтоматическиЗакрыватьЗаказыНаПеремещение, АвтоматическиЗакрыватьЗаказыНаСборку");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиАвтоматическогоЗакрытия, "АвтоматическиЗакрыватьЗаказыКлиентов, АвтоматическиЗакрыватьЗаказыНаПеремещение, АвтоматическиЗакрыватьЗаказыНаСборку, АвтоматическиЗакрыватьЗаказыНаВнутреннееПотребление");
    //-- #5634 смарт: Тимофеева 13.02.26

КонецПроцедуры

//++ #Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных
Процедура ИнициализироватьRoistatНастройкиОтбораИнтересов();

	RoistatСхемаОтбораИнтересов = Справочники.смартПредопределенныеЗначения.ПолучитьМакет("RoistatСхемаОтбораИнтересов");
	
	RoistatНастройкиОтбораИнтересов = Справочники.смартПредопределенныеЗначения.Настройки.RoistatНастройкиОтбораИнтересов.Получить();
	
	Если ТипЗнч(RoistatНастройкиОтбораИнтересов) = Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкиКомпоновкиОтбораИнтересов = RoistatНастройкиОтбораИнтересов;
	Иначе
		НастройкиКомпоновкиОтбораИнтересов = RoistatСхемаОтбораИнтересов.НастройкиПоУмолчанию;
	КонецЕсли;

	УстановитьНастройкиОтбораИнтересовRoistat(НастройкиКомпоновкиОтбораИнтересов);
	
КонецПроцедуры //-- #Б-1534 смарт: Лопато 05.12.2024

//++ #Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных
Процедура УстановитьНастройкиОтбораИнтересовRoistat(НастройкиКомпоновки)
	
	RoistatСхемаОтбораИнтересов = Справочники.смартПредопределенныеЗначения.ПолучитьМакет("RoistatСхемаОтбораИнтересов");
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(
								 ПоместитьВоВременноеХранилище(RoistatСхемаОтбораИнтересов, Новый УникальныйИдентификатор()));

	ЭтотОбъект.КомпоновщикНастроекОтбораИнтересов.Инициализировать(ИсточникНастроек);
	ЭтотОбъект.КомпоновщикНастроекОтбораИнтересов.ЗагрузитьНастройки(НастройкиКомпоновки);
	
КонецПроцедуры //-- #Б-1534 смарт: Лопато 05.12.2024

//++ #Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных
&НаКлиенте
Процедура УстановитьНастройкиОтбораИнтересовRoistatПоУмолчанию(Команда)
	
	УстановитьНастройкиОтбораИнтересовRoistatПоУмолчаниюНаСервере();
	
КонецПроцедуры //-- #Б-1534 смарт: Лопато 05.12.2024

//++ #Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных
Процедура УстановитьНастройкиОтбораИнтересовRoistatПоУмолчаниюНаСервере()
	
	RoistatСхемаОтбораИнтересов = Справочники.смартПредопределенныеЗначения.ПолучитьМакет("RoistatСхемаОтбораИнтересов");
	
	УстановитьНастройкиОтбораИнтересовRoistat(RoistatСхемаОтбораИнтересов.НастройкиПоУмолчанию);

КонецПроцедуры //-- #Б-1534 смарт: Лопато 05.12.2024

&НаКлиенте
//++ #Б-2064 смарт: Фролов 31.01.2025 //Создание пользователя ИМ на основании договора поставки. Регистрация клиента на сайте.
Процедура смартДействиеПоказатьИнформацию(Команда)
	
	ИнформацияЗаголовок = "Дата начала регистрации пользователя ИМ по договору поставки";
	ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = 'Пустая дата = функционал не активен. Если дата установлена, при создании Заказа клиента, 
			|где требуется договор, в заявку на договор будут включены дополнительные поля (обязательные для заполнения), 
			|а в шаблон договора добавляются пункты согласия на регистрацию пользователя в ИМ.
			|После подписания договора (установки признака Договор подписан), автоматически создается пользователь в ИМ.'"));
			
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;
			
КонецПроцедуры	//-- #Б-2064 смарт: Фролов 31.01.2025		

//++ #Б4302 смарт: Шляпников 09.09.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки. Дополнение. 
&НаКлиенте
Процедура ТарифыПлатнойДоставки(Команда)
	
	ОткрытьФорму("РегистрСведений.смартТарифыНаДоставку.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти