
//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
&НаСервере
&ИзменениеИКонтроль("УстановитьНедоступныеОтборыИзПараметров")
Процедура смарт_УстановитьНедоступныеОтборыИзПараметров(СтруктураОтбора)

	Для Каждого ЭлементОтбора Из СтруктураОтбора Цикл

		Если ЭлементОтбора.Ключ = "Контрагент" И ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда

			РеквизитОтбора = ?(ЗначениеЗаполнено(ЭлементОтбора.Значение),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементОтбора.Значение, "Партнер"),
			Справочники.Партнеры.ПустаяСсылка());

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, 
				"Партнер", 
				РеквизитОтбора,
				ВидСравненияКомпоновкиДанных.Равно);

			Продолжить;

		КонецЕсли;

		Если ЭлементОтбора.Ключ = "ХозяйственнаяОперация" 
			И ЭлементОтбора.Значение = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, 
				ЭлементОтбора.Ключ, 
				Перечисления.ХозяйственныеОперации.РеализацияКлиенту,
				ВидСравненияКомпоновкиДанных.Равно);

			Продолжить;

		КонецЕсли;  
		
		#Вставка  
		Если ЭлементОтбора.Ключ = "ОграничиватьСуммуЗадолженности" 
			И ЭлементОтбора.Значение = Истина Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, 
				ЭлементОтбора.Ключ, 
				ЭлементОтбора.Значение,
				ВидСравненияКомпоновкиДанных.Равно);

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, 
				"ДопустимаяСуммаЗадолженности", 
				0,
				ВидСравненияКомпоновкиДанных.Больше);

			Продолжить;

		КонецЕсли;	
		
		//++ #7448 смарт: Тимофеева 14.07.2026 / Контроль дебиторской задолженности. Выбор кредитного договора.
		Если ЭлементОтбора.Ключ = "ИсключитьКредитныеДоговорыПоРасходнымМатериалам" 
			И ЭлементОтбора.Значение = Истина Тогда
			
			КредитныеДоговорыПоРасходнымМатериаламГруппаИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
										Список.Отбор,
										"КредитныеДоговорыПоРасходнымМатериаламГруппаИли",
										ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
										КредитныеДоговорыПоРасходнымМатериаламГруппаИли,
										"ОграничиватьСуммуЗадолженности",
										ВидСравненияКомпоновкиДанных.Равно, 
										Ложь);	
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
										КредитныеДоговорыПоРасходнымМатериаламГруппаИли,
										"смартВидДоговора",
										ВидСравненияКомпоновкиДанных.НеРавно, 
										Перечисления.смартВидыДоговоров.РасходныеМатериалыОтсрочка);	

			Продолжить;
		ИначеЕсли ЭлементОтбора.Ключ = "ИсключитьКредитныеДоговорыПоРасходнымМатериалам" 
			И ЭлементОтбора.Значение = Ложь Тогда
			Продолжить;
		КонецЕсли;
		//-- #7448 смарт: Тимофеева 14.07.2026

		#КонецВставки

		Если ТипЗнч(ЭлементОтбора.Значение) = Тип("ФиксированныйМассив") Тогда
			ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.Всписке;
		Иначе
			ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			ЭлементОтбора.Ключ, 
			ЭлементОтбора.Значение, 
			ВидСравненияКомпоновки);
	КонецЦикла; 

КонецПроцедуры

//-- #4822 смарт: Тимофеева 02.04.2026
