
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = РеквизитФормыВЗначение("Запись");
	
	Если Объект.Выбран() Тогда Возврат; КонецЕсли;
	
	Если Параметры.Свойство("КопируемоеНапоминание") Тогда
		// Заполним напоминание по копируемому.
		ЗаполнитьЗначенияСвойств(Запись, Параметры.КопируемоеНапоминание);
		Запись.ДатаОповещения	= Дата('00010101');
		Запись.Счетчик			= 0;
	Иначе
		Запись.Важность	= Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	КонецЕсли;
	
	Если Параметры.Свойство("Содержание") Тогда
		Запись.Содержание = Параметры.Содержание;
	КонецЕсли;
	
	Если Параметры.Свойство("Предмет") Тогда
		Запись.Предмет = Параметры.Предмет;
	КонецЕсли;
	
	Запись.ДатаНачала	= ТекущаяДатаСеанса();
	Запись.Пользователь	= Пользователи.ТекущийПользователь();
	
	// Скроем служебную информацию.
	Элементы.ГруппаДат.Видимость = Ложь;
	
	ВидПериода = Элементы.ВидПериода.СписокВыбора[2];
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
		ДатаНачала	= Запись.ДатаНачала; 
		ВремяНачала	= Запись.ДатаНачала;
	КонецЕсли;
	Если Запись.Счетчик > 0 Тогда
		ДвеПоследниеЦифры = Запись.Счетчик % 100;
		ПоследняяЦифра = Запись.Счетчик % 10;
		Окончание = "";
		Если ДвеПоследниеЦифры < 5 Или ДвеПоследниеЦифры > 21 Тогда
			Если ПоследняяЦифра > 1 И ПоследняяЦифра < 5 Тогда
				Окончание = "а";
			КонецЕсли;
		КонецЕсли;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Напоминание (отложено %1 раз %2)';en='Reminder (it is postpon %1 time %2)'"),
						Запись.Счетчик, Окончание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьДатуКонца();
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Запись.ДатаНачала = ТекущаяДата();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.ДатаОповещения) Тогда
		Запись.ДатаОповещения	= Запись.ДатаНачала;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// +Рабочий стол
	CRM_НапоминанияКлиент.ВывестиАктивныеНапоминания();	
	// -Рабочий стол
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереключательЗавершениеПриИзменении(Элемент = Неопределено)
//	Если ТипСрока > 0 Тогда
	//	Элементы.ПанельЗавершение.Видимость = Истина;
		Элементы.ПанельЗавершение.ТекущаяСтраница = Элементы.ПанельЗавершение.ПодчиненныеЭлементы[ТипСрока];
	//Иначе 
	//	Элементы.ПанельЗавершение.Видимость = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДатаНачала	= ВыбранноеЗначение;
	Запись.ДатаНачала = НачалоДня(ДатаНачала) + (ВремяНачала - Дата('00010101'));
КонецПроцедуры

&НаКлиенте
Процедура ПолеВремяНачалаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если (ВремяНачала = Дата('00010101')) И (Направление = -1) Тогда
		ВремяНачала = Дата('00010101235959');
	Иначе	
		ВремяНачала = ВремяНачала + 60 * Направление;
	КонецЕсли;
	
	Запись.ДатаНачала = НачалоДня(ДатаНачала) + (ВремяНачала - Дата('00010101'));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВремяНачалаПриИзменении(Элемент)
	
	Запись.ДатаНачала = НачалоДня(ДатаНачала) + (ВремяНачала - Дата('00010101'));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ОсновныеДействияФормыДействиеЗавершить(Кнопка)
	Закрыть();
	Оповестить("ОбновитьНапоминания");
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Вычисляет значение даты актуальности.
//
Процедура ЗаписатьДатуКонца()
	Если Запись.ДатаНачала = Дата("00010101") Тогда
		Запись.ДатаНачала = ТекущаяДата();
	КонецЕсли; 
	Если ТипСрока = 0 Тогда 
		Запись.ДатаАктуальности = Дата("00010101");
	ИначеЕсли ТипСрока = 1 Тогда 
		Запись.ДатаАктуальности = Дата("00010101");
		Если КонецПериода = 0 Тогда Возврат; КонецЕсли;
		Список = Элементы.ВидПериода.СписокВыбора;
		Элемент = Список.НайтиПоЗначению(ВидПериода);
		Если Элемент = Неопределено Тогда Возврат; КонецЕсли;	
		Индекс = Список.Индекс(Элемент);
		Если Индекс = 0 Тогда // Минут
			Запись.ДатаАктуальности = Запись.ДатаНачала + 60 * КонецПериода;
		ИначеЕсли Индекс = 1 Тогда // Часов
			Запись.ДатаАктуальности = Запись.ДатаНачала + 3600 * КонецПериода;
		ИначеЕсли Индекс = 2 Тогда // Дней
			Запись.ДатаАктуальности = Запись.ДатаНачала + 86400 * КонецПериода;
		ИначеЕсли Индекс = 3 Тогда // Недель
			Итератор = 604800;
			Запись.ДатаАктуальности = Запись.ДатаНачала + 604800 * КонецПериода;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры // ЗаписатьДатуКонца()

#КонецОбласти


