
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Партнеры") Тогда
		ПараметрыФормы = Новый Структура("Партнер", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Если ПараметрКоманды.Количество() = 0 Тогда
			Возврат;
		Иначе
			Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.Партнеры") Тогда
				ПараметрыФормы = Новый Структура("Партнер", ПараметрКоманды[0]);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Отчет.CRM_СтруктураВзаимосвязейМеждуКлиентами.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти
