#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
	Если НЕ ЗначениеЗаполнено(ШаблонПроекта) И ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CRM_ШаблоныПроектов") Тогда
		ШаблонПроекта = ДанныеЗаполнения;
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("ТипЭтапа") И ТипЭтапа = Перечисления.CRM_ТипыЭтапов.Этап Тогда
			ПродолжительностьДней = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Описание = "";
	Автор = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокУчастников();
	
	Если ТипЭтапа = Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка Тогда	
		ПродолжительностьДней  = 0;
	ИначеЕсли ТипЭтапа = Перечисления.CRM_ТипыЭтапов.Этап И ПродолжительностьДней = 0 Тогда
		ПродолжительностьДней = 1;
	КонецЕсли;
	
	 // Минимизируем процедуру обновления дат пакетов задач.
	 Если Смещение <> Ссылка.Смещение ИЛИ ШаблонЭтапаПроекта <> Ссылка.ШаблонЭтапаПроекта ИЛИ ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		ДополнительныеСвойства.Вставить("ОбновитьСмещенияШаблонаЭтапа", Истина);
		Если ШаблонЭтапаПроекта <> Ссылка.ШаблонЭтапаПроекта Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийШаблонЭтапа", Ссылка.ШаблонЭтапаПроекта);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбновитьСмещенияШаблонаЭтапа") Тогда
		// Обновим все даты пакета задачи и всех родителей этого пакета (если даты были изменены).
		Если ЗначениеЗаполнено(ШаблонЭтапаПроекта) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьСмещенияШаблонаЭтапаИВсехРодителей(ШаблонЭтапаПроекта);
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("ПредыдущийШаблонЭтапа") И ЗначениеЗаполнено(ДополнительныеСвойства.ПредыдущийШаблонЭтапа) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьСмещенияШаблонаЭтапаИВсехРодителей(ДополнительныеСвойства.ПредыдущийШаблонЭтапа);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

// Процедура заполняет список участников мероприятия
//
// Параметры: Нет
//
Процедура ЗаполнитьСписокУчастников() Экспорт
	
	СписокУчастников = "";
	Для Каждого Участник Из Участники Цикл
		СписокУчастников = СписокУчастников + ?(СписокУчастников = "","","; ") + Участник.Пользователь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли