
#Область СлужебныйПрограммныйИнтерфейс

#Область ОпределениеФормОбъектов

// Процедура - Обработка получения форм объектов CRM
//
// Параметры:
//  Источник				 - ДокументСсылка - Источник. 
//  ВидФормы				 - Строка - Имя стандартной формы. 
//  Параметры				 - Структура - Параметры формы. 
//  ВыбраннаяФорма			 - Строка, ФормаКлиентскогоПриложения - Содержит имя открываемой формы или объект метаданных Форма.
//  ДополнительнаяИнформация - Структура - Дополнительная информация открытия формы.
//  СтандартнаяОбработка	 - Булево - Признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаПолученияФормОбъектовCRMМодуль(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Свойство("Ключ") Тогда
		
		ВыбраннаяФорма = "Документ." + Параметры.Ключ.Метаданные().Имя +"."+ ВидФормы;
		
	Иначе
	
		#Область ПолученияФормВстреча
		
		Если ТипЗнч(Источник) = Тип("ДокументМенеджер.Встреча") Тогда
		
			Если ВидФормы = "ФормаОбъекта" Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента";
				Параметры.Вставить("ВидВзаимодействия", Справочники.CRM_ВидыВзаимодействий.Встреча);
				CRM_МетодыМодулейМенеджеровДокументов.ПодменитьПараметрыПартнера(Параметры);
			КонецЕсли;
		
		#КонецОбласти
		
		#Область ПолученияФормЗапланированноеВзаимодействие
		
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументМенеджер.ЗапланированноеВзаимодействие") Тогда
		
			Если ВидФормы = "ФормаОбъекта" Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента";
				ВидВзаимодействияПрочее = CRM_МетодыМодулейМенеджеровДокументов.ПолучитьВидВзаимодействия(Перечисления.CRM_ВидыСобытий.Прочее);
				Параметры.Вставить("ВидВзаимодействия", ВидВзаимодействияПрочее);
				CRM_МетодыМодулейМенеджеровДокументов.ПодменитьПараметрыПартнера(Параметры);
			КонецЕсли;
			
		КонецЕсли;
			
		#КонецОбласти
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОпределениеФормОбъектов

#Область CRM_Интерес

// Заполняет таблицу реквизитов, зависимых от хозяйственной операции
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - хозяйственная операция соглашения
//	МассивВсехРеквизитов - Массив - реквизиты, которые не зависят от хозяйственной операции
//	МассивРеквизитовОперации - Массив - реквизиты, которые зависят от хозяйственной операции.
//
Процедура ИнтересЗаполнитьИменаРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("Товары.ПроцентРучнойСкидки");
	МассивВсехРеквизитов.Добавить("Товары.СуммаРучнойСкидки");
	МассивВсехРеквизитов.Добавить("Товары.ПроцентАвтоматическойСкидки");
	МассивВсехРеквизитов.Добавить("Товары.СуммаАвтоматическойСкидки");
	
	МассивРеквизитовОперации = Новый Массив;
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		МассивРеквизитовОперации.Добавить("Товары.ПроцентРучнойСкидки");
		МассивРеквизитовОперации.Добавить("Товары.СуммаРучнойСкидки");
		МассивРеквизитовОперации.Добавить("Товары.ПроцентАвтоматическойСкидки");
		МассивРеквизитовОперации.Добавить("Товары.СуммаАвтоматическойСкидки");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров для заполнения налогообложения НДС продажи.
//
// Параметры:
//  Объект - ДокументОбъект.КоммерческоеПредложениеКлиенту - документ, по которому необходимо сформировать параметры.
//
// Возвращаемое значение:
//  Структура - Параметры заполнения, описание параметров см. УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСПродажи();
//
Функция ИнтересПараметрыЗаполненияНалогообложенияНДСПродажи(Объект) Экспорт
	
	ПараметрыЗаполнения = УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСПродажи();
	
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.Дата = Объект.Дата;
	ПараметрыЗаполнения.Склад = Объект.Склад;
	ПараметрыЗаполнения.Договор = Объект.Договор;
	ПараметрыЗаполнения.ЭтоЗаказ = Истина;
	
	
	ПараметрыЗаполнения.РеализацияТоваров = Истина;
	ПараметрыЗаполнения.РеализацияРаботУслуг = Истина;
		
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция Интерес_СформироватьПечатнуюФормуКоммерческогоПредложения(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокументЗапасы.Ссылка КАК Ссылка,
	               |	ДокументЗапасы.Ссылка.Организация КАК Организация,
	               |	ДокументЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	               |	ДокументЗапасы.Ссылка.Дата КАК ДатаДокумента,
	               |	ДокументЗапасы.Ссылка.Номер КАК Номер,
	               |	ДокументЗапасы.Ссылка.Партнер КАК Партнер,
	               |	ДокументЗапасы.Ссылка.Валюта КАК Валюта,
	               |	ДокументЗапасы.Ссылка.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	               |	ДокументЗапасы.Ссылка.ОжидаемаяВыручка КАК ОжидаемаяВыручка,
	               |	ДокументЗапасы.НомерСтроки КАК НомерСтроки,
	               |	ДокументЗапасы.Номенклатура КАК Номенклатура,
	               |	ДокументЗапасы.Характеристика КАК Характеристика,
	               |	ДокументЗапасы.Количество КАК Количество,
	               |	ДокументЗапасы.Упаковка КАК ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА &ОтображатьСкидки
	               |			ТОГДА ДокументЗапасы.Цена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ДокументЗапасы.Количество = 0
	               |					ТОГДА 0
	               |				ИНАЧЕ ДокументЗапасы.Сумма / ДокументЗапасы.Количество
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Цена,
	               |	ДокументЗапасы.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	               |	ДокументЗапасы.Сумма КАК Сумма,
	               |	ДокументЗапасы.СтавкаНДС КАК СтавкаНДС,
	               |	ДокументЗапасы.СуммаНДС КАК СуммаНДС,
	               |	ДокументЗапасы.Всего КАК Всего,
	               |	ДокументЗапасы.Содержание КАК Содержание,
	               |	"""" КАК КомментарийВарианта
	               |ИЗ
	               |	Документ.CRM_Интерес.Товары КАК ДокументЗапасы
	               |ГДЕ
	               |	ДокументЗапасы.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |ИТОГИ
	               |	СУММА(Всего)
	               |ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОтображатьСкидки", ПараметрыПечати.ОтображатьСкидки);
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КоммерческоеПредложениеКлиенту.CRM_ПФ_MXL_КоммерческоеПредложение");
		
		ОбластьЗаголовок                = Макет.ПолучитьОбласть("Заголовок");
		ОбластьКонтактноеЛицо           = Макет.ПолучитьОбласть("КонтактноеЛицо");
		ОбластьПредлагаемОзнакомиться   = Макет.ПолучитьОбласть("ПредлагаемОзнакомиться");
		
		ОбластьМенеджер                 = Макет.ПолучитьОбласть("Менеджер");
		ОбластьПустаяСтрокаТонкая       = Макет.ПолучитьОбласть("ПустаяСтрокаТонкая");
		ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
		ОбластьСрокДействия             = Макет.ПолучитьОбласть("СрокДействияЧастичныйВыкуп");

		
		ДанныеОбъекта = Новый Структура;
		ДанныеШапки = ВыборкаДокументов.Ссылка;
		СведенияОрганизации = Новый Структура;
		СведенияОрганизации.Вставить("Наименование");
		СведенияОрганизации.Вставить("ПолноеНаименование");
		СведенияОрганизации.Вставить("Телефоны");
		СведенияОрганизации.Вставить("ЮридическийАдрес");
		СведенияОрганизации.Вставить("ЭлектроннаяПочта");
		
		КоммерческиеПредложенияДокументыПереопределяемый.ЗаполнитьДанныеОрганизации(ДанныеШапки.Организация, СведенияОрганизации);
		
		Если ЗначениеЗаполнено(СведенияОрганизации.ПолноеНаименование) Тогда
			ПредставлениеОрганизации = СведенияОрганизации.ПолноеНаименование;
		Иначе
			ПредставлениеОрганизации = СведенияОрганизации.Наименование;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ДанныеШапки.Ответственный) Тогда
			
			МассивСМенеджером = Новый Массив;
			МассивСМенеджером.Добавить(ДанныеШапки.Ответственный);
			
			ТребуемыеТипыКонтактнойИнформации = Новый Массив;
			ТребуемыеТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			
			ТаблицаКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
			МассивСМенеджером,
			ТребуемыеТипыКонтактнойИнформации,,
			ДанныеШапки.Дата);
			
			АдресЭлектроннойПочтыМенеджера = КоммерческиеПредложенияДокументы.ПредставлениеКонтактнойИнформацииИзТаблицы(
			ТаблицаКонтактнойИнформации,
			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			
		Иначе
			ТелефонМенеджера = "";
			АдресЭлектроннойПочтыМенеджера   = "";
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("Ссылка",                              ДанныеШапки.Ссылка);
		ДанныеОбъекта.Вставить("Организация",                         ДанныеШапки.Организация);
		ДанныеОбъекта.Вставить("ТелефонОрганизации",                  СведенияОрганизации.Телефоны);
		ДанныеОбъекта.Вставить("АдресОрганизации",                    СведенияОрганизации.ЮридическийАдрес);
		ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыОрганизации",    ?(СведенияОрганизации.Свойство("ЭлектроннаяПочта"),СведенияОрганизации.ЭлектроннаяПочта, ""));
		ДанныеОбъекта.Вставить("Клиент",                              ДанныеШапки.Партнер);
		ДанныеОбъекта.Вставить("Контрагент",                          ДанныеШапки.Контрагент);
		ДанныеОбъекта.Вставить("ПредставлениеОрганизации",            ПредставлениеОрганизации);
		ДанныеОбъекта.Вставить("ПредставлениеКлиента",                КоммерческиеПредложенияДокументы.ПредставлениеПартнераКонтрагента(ДанныеОбъекта.Клиент, ДанныеШапки.Контрагент));
		ДанныеОбъекта.Вставить("КонтактноеЛицо",                      ДанныеШапки.КонтактноеЛицо);
		ДанныеОбъекта.Вставить("Менеджер",                            ДанныеШапки.Ответственный);
		ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыМенеджера",      АдресЭлектроннойПочтыМенеджера);
		ДанныеОбъекта.Вставить("ТелефонМенеджера",                    ТелефонМенеджера);
		ДанныеОбъекта.Вставить("Номер",                               ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеШапки.Номер, Ложь, Истина));
		ДанныеОбъекта.Вставить("Дата",                                Формат(ДанныеШапки.Дата,"ДЛФ=D"));
		ДанныеОбъекта.Вставить("КонтактнаяИнформацияПредложения",     КонтактнаяИнформацияПредложения(ДанныеОбъекта));
	
		КоммерческиеПредложенияДокументыПереопределяемый.ПриФормированииЗаголовкаПечатнойФормы(Макет, ОбластьЗаголовок, ДанныеОбъекта);
		
		ДополнительныеПараметрыВывода = Неопределено;
		
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		Если ЗначениеЗаполнено(ДанныеОбъекта.КонтактноеЛицо) Тогда
			ОбластьКонтактноеЛицо.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьКонтактноеЛицо);
		КонецЕсли;
		
		ОбластьПредлагаемОзнакомиться.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьПредлагаемОзнакомиться);

		КПВывестиСтрокиВарианта(ТабличныйДокумент, Макет, ВыборкаДокументов, ПараметрыПечати.ОтображатьСкидки);
					
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
		
		ОбластьСрокДействия.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьСрокДействия);
		
		ОбластьМенеджер.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьМенеджер);
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции
	

#КонецОбласти // CRM_Интерес

#Область КоммерческоеПредложение

Функция КПВывестиСтрокиВарианта(ТабличныйДокумент, Макет, ВыборкаВариантИд, ОтображатьСкидки) Экспорт
	
	// шапка таблицы
	
	Если ОтображатьСкидки Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСкидок);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
	Иначе
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыБезСкидок");
		ТабличныйДокумент.Вывести(ОбластьДанных);
	КонецЕсли;
	
	Если ОтображатьСкидки Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
	Иначе
		ОбластьДанных = Макет.ПолучитьОбласть("СтрокаБезСкидок");
	КонецЕсли;

	ИтогоПоРазделу 	= 0;
	ИтогоСумма 		= 0;
	ИтогоСуммаНДС 	= 0;
	ИтогоБезСкидок 	= 0;	
	
	Ном = 0;
	ПерваяСтрока = Истина;
	МассивИтогов = Новый Массив;
	МассивИтоговСкидок = Новый Массив;
	МассивРазделителей = Новый Массив;
	
	ТекРазделитель = Справочники.CRM_Разделители.ПустаяСсылка();
	СтруктураДопИнф = Новый Структура("Характеристика, Серия"); 
	
	ОписаниеВарианта = "";
	
	// СтрокиТаблицы
	ВыборкаЗапасы = ВыборкаВариантИд.Выбрать();
	Пока ВыборкаЗапасы.Следующий() Цикл
		
		ОписаниеВарианта = ВыборкаЗапасы.КомментарийВарианта;
		
		Если ТипЗнч(ВыборкаЗапасы.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Ном = Ном + 1;
			// строки номенклатуры
			Если ОтображатьСкидки Тогда
				ОбластьНомера.Параметры.Ном = Ном;
				ТабличныйДокумент.Вывести(ОбластьНомера);
				ОбластьДанных.Параметры.Заполнить(ВыборкаЗапасы);
			Иначе
				ОбластьДанных.Параметры.Ном = Ном;
				ОбластьДанных.Параметры.Заполнить(ВыборкаЗапасы);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ВыборкаЗапасы.ЕдиницаИзмерения) Тогда
				ОбластьДанных.Параметры.ЕдиницаИзмерения = ВыборкаЗапасы.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;			
			// +CRM
			ТипНоменклатуры = ВыборкаЗапасы.Номенклатура.ТипНоменклатуры;
			Если Не ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				СтруктураДопИнф.Характеристика = ВыборкаЗапасы.Характеристика;			
				ХарактеристикаНоменклатуры = КППредставлениеСерий(СтруктураДопИнф);
				ОбластьДанных.Параметры.Содержание = ?(ПустаяСтрока(ВыборкаЗапасы.Содержание), ВыборкаЗапасы.Номенклатура.НаименованиеПолное + ХарактеристикаНоменклатуры, ВыборкаЗапасы.Содержание);
			Иначе	
				ОбластьДанных.Параметры.Содержание = ?(ПустаяСтрока(ВыборкаЗапасы.Содержание), ВыборкаЗапасы.Номенклатура.НаименованиеПолное, ВыборкаЗапасы.Содержание);
			КонецЕсли;	
			// -CRM
			
			ОбластьДанных.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Ложь, , , );
			Если ОтображатьСкидки Тогда
				ТабличныйДокумент.Присоединить(ОбластьДанных);
			КонецЕсли;	
			Если ОтображатьСкидки Тогда

				ОбластьСкидок.Параметры.Скидка = ВыборкаЗапасы.Количество * ВыборкаЗапасы.Цена - ВыборкаЗапасы.Сумма;
				ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаЗапасы.Количество * ВыборкаЗапасы.Цена;
				ОбластьСкидок.Область(1, 1, 1, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ОбластьСкидок.Область(1, 1, 1, 2).Шрифт = Новый Шрифт(, , Ложь, , , );
				ТабличныйДокумент.Присоединить(ОбластьСкидок);
				ИтогоБезСкидок = ИтогоБезСкидок + ОбластьСкидок.Параметры.СуммаБезСкидки;

				ОбластьСуммы.Параметры.Сумма = ВыборкаЗапасы.Сумма;
				ОбластьСуммы.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ОбластьСуммы.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Ложь, , , );
				ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Иначе	
				ОбластьДанных.Параметры.Сумма = ВыборкаЗапасы.Сумма;
				ТабличныйДокумент.Вывести(ОбластьДанных);

			КонецЕсли;
			ИтогоСумма = ИтогоСумма + ВыборкаЗапасы.Сумма;
			ИтогоСуммаНДС = ИтогоСуммаНДС + ВыборкаЗапасы.СуммаНДС;
			
			Если МассивИтогов.Количество() > 0 Тогда
				МассивИтогов[МассивИтогов.Количество() - 1] = МассивИтогов[МассивИтогов.Количество() - 1] + ВыборкаЗапасы.Сумма;
			КонецЕсли;
			Если МассивИтоговСкидок.Количество() > 0 Тогда
				МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1] = МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1] + (ВыборкаЗапасы.Количество * ВыборкаЗапасы.Цена - ВыборкаЗапасы.Сумма);
			КонецЕсли;
		Иначе
			Если МассивРазделителей.Количество() > 0 Тогда
				ИтогоПоРазделу = МассивИтогов[МассивИтогов.Количество() - 1];
				ИтогоСкидкаПоРазделу = МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1];
				Разделитель = МассивРазделителей[МассивРазделителей.Количество() - 1];
				МассивИтогов.Удалить(МассивИтогов.Количество() - 1);
				МассивИтоговСкидок.Удалить(МассивИтоговСкидок.Количество() - 1);
				МассивРазделителей.Удалить(МассивРазделителей.Количество() - 1);
				Если Разделитель.Итог Тогда
					// Строки итогов по иерархии (итоги).
					Если ОтображатьСкидки Тогда
						ОбластьНомера.Параметры.Ном = "";
						ТабличныйДокумент.Вывести(ОбластьНомера);
						ОбластьДанных.Параметры.Содержание  = НСтр("ru='Итого по: ';en='Total by:'") + Строка(Разделитель);
						ОбластьДанных.Параметры.Номенклатура = Разделитель;
						ОбластьДанных.Параметры.Количество = "";
						ОбластьДанных.Параметры.Цена = "";
						ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
						ОбластьДанных.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
						ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
						ТабличныйДокумент.Присоединить(ОбластьДанных);

						ОбластьСкидок.Параметры.СуммаБезСкидки = СокрЛП(Формат(ИтогоПоРазделу + ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
						ОбластьСкидок.Параметры.Скидка = СокрЛП(Формат(ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
						ОбластьСкидок.Область(1, 1, 1, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
						ОбластьСкидок.Область(1, 1, 1, 2).Шрифт = Новый Шрифт(, , Истина, , , );
						ТабличныйДокумент.Присоединить(ОбластьСкидок);

						ОбластьСуммы.Параметры.Сумма = СокрЛП(CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоПоРазделу));
						ОбластьСуммы.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
						ОбластьСуммы.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
						ТабличныйДокумент.Присоединить(ОбластьСуммы);
					Иначе	
						ОбластьДанных.Параметры.Ном = "";
						ОбластьДанных.Параметры.Содержание  = НСтр("ru='Итого по: ';en='Total by:'") + Строка(Разделитель);
						ОбластьДанных.Параметры.Номенклатура = Разделитель;
						ОбластьДанных.Параметры.Количество = "";
						ОбластьДанных.Параметры.Цена = "";
						ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
						ОбластьДанных.Параметры.Сумма = СокрЛП(CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоПоРазделу));
						ОбластьДанных.Область(1, 3, 1, 3).Шрифт = Новый Шрифт(, , Истина, , , );
						ОбластьДанных.Область(1, 9, 1, 9).Шрифт = Новый Шрифт(, , Истина, , , );

						ТабличныйДокумент.Вывести(ОбластьДанных);
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// Строки разделителей иерархии (заголовки).
			Если ОтображатьСкидки Тогда
				ОбластьНомера.Параметры.Ном = "";
				ТабличныйДокумент.Вывести(ОбластьНомера);
				ОбластьДанных.Параметры.Содержание  = ВыборкаЗапасы.Номенклатура;
				ОбластьДанных.Параметры.Номенклатура = ВыборкаЗапасы.Номенклатура;
				ОбластьДанных.Параметры.Количество = "";
				ОбластьДанных.Параметры.Цена = "";
				ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
				ОбластьДанных.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
				ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
				ТабличныйДокумент.Присоединить(ОбластьДанных);

				ОбластьСкидок.Параметры.СуммаБезСкидки = "";
				ОбластьСкидок.Параметры.Скидка = "";
				ТабличныйДокумент.Присоединить(ОбластьСкидок);

				ОбластьСуммы.Параметры.Сумма = "";
				ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Иначе	
				ОбластьДанных.Параметры.Ном = "";
				ОбластьДанных.Параметры.Содержание  = ВыборкаЗапасы.Номенклатура;
				ОбластьДанных.Параметры.Номенклатура = ВыборкаЗапасы.Номенклатура;
				ОбластьДанных.Параметры.Количество = "";
				ОбластьДанных.Параметры.Цена = "";
				ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
				ОбластьДанных.Параметры.Сумма = "";
				ТабличныйДокумент.Вывести(ОбластьДанных);
				
			КонецЕсли;
			МассивИтогов.Добавить(0);
			МассивИтоговСкидок.Добавить(0);
			Если НЕ ТипЗнч(ВыборкаЗапасы.Номенклатура) = Тип("Неопределено") Тогда 
				МассивРазделителей.Добавить(ВыборкаЗапасы.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИтогов.Количество() > 0 Тогда
		ИтогоПоРазделу = МассивИтогов[МассивИтогов.Количество() - 1];
		ИтогоСкидкаПоРазделу = МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1];
		Разделитель = МассивРазделителей[МассивРазделителей.Количество() - 1];
		МассивИтогов.Удалить(МассивИтогов.Количество()-1);
		МассивИтоговСкидок.Удалить(МассивИтоговСкидок.Количество() - 1);
		МассивРазделителей.Удалить(МассивРазделителей.Количество() - 1);
		Если Разделитель.Итог Тогда
			// Последняя строка итогов по иерархии (итоги).
			Если ОтображатьСкидки Тогда
				ОбластьНомера.Параметры.Ном = "";
				ТабличныйДокумент.Вывести(ОбластьНомера);
				ОбластьДанных.Параметры.Содержание  = НСтр("ru='Итого по: ';en='Total by:'") + Строка(Разделитель);
				ОбластьДанных.Параметры.Номенклатура = Разделитель;
				ОбластьДанных.Параметры.Количество = "";
				ОбластьДанных.Параметры.Цена = "";
				ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
				ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
				ТабличныйДокумент.Присоединить(ОбластьДанных);

				ОбластьСкидок.Параметры.СуммаБезСкидки = СокрЛП(Формат(ИтогоПоРазделу + ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
				ОбластьСкидок.Параметры.Скидка = СокрЛП(Формат(ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
				ОбластьСкидок.Область(1, 1, 1, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ОбластьСкидок.Область(1, 1, 1, 2).Шрифт = Новый Шрифт(, , Истина, , , );
				ТабличныйДокумент.Присоединить(ОбластьСкидок);

				ОбластьСуммы.Параметры.Сумма = СокрЛП(Формат(ИтогоПоРазделу, "ЧЦ=15; ЧДЦ=2"));
				ОбластьСуммы.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
				ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Иначе	
				ОбластьДанных.Параметры.Ном = "";
				ОбластьДанных.Параметры.Содержание  = НСтр("ru='Итого по: ';en='Total by:'") + Строка(Разделитель);
				ОбластьДанных.Параметры.Номенклатура = Разделитель;
				ОбластьДанных.Параметры.Количество = "";
				ОбластьДанных.Параметры.Цена = "";
				ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
				ОбластьДанных.Область(1, 3, 1, 3).Шрифт = Новый Шрифт(, , Истина, , , );
				ОбластьДанных.Параметры.Сумма = СокрЛП(Формат(ИтогоПоРазделу, "ЧЦ=15; ЧДЦ=2"));
				ОбластьДанных.Область(1, 9, 1, 9).Шрифт = Новый Шрифт(, , Истина, , , );
				ТабличныйДокумент.Вывести(ОбластьДанных);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// итоги
	Если ОтображатьСкидки Тогда
		
		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
		ОбластьСуммы = Макет.ПолучитьОбласть("Итого|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		ТабличныйДокумент.Присоединить(ОбластьДанных);

		ОбластьСкидок.Параметры.ВсегоБезСкидок = ИтогоБезСкидок;
		ОбластьСкидок.Параметры.ВсегоСкидок = ИтогоБезСкидок - ИтогоСумма;
		ТабличныйДокумент.Присоединить(ОбластьСкидок);

		ОбластьСуммы.Параметры.Всего = CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоСумма);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		// итоги НДС
		//Если УчитыватьНДС Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ИтогоНДС|Скидка");
		ОбластьСуммы = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		ТабличныйДокумент.Вывести(ОбластьНомера);
		ОбластьДанных.Параметры.НДС = ?(ВыборкаВариантИд.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:';en='Including VAT:'"), НСтр("ru='Сумма НДС:'"));
		ТабличныйДокумент.Присоединить(ОбластьДанных);

		ТабличныйДокумент.Присоединить(ОбластьСкидок);

		ОбластьСуммы.Параметры.ВсегоНДС = CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоСуммаНДС);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		//КонецЕсли;
		
		
	Иначе	
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоБезСкидок");
		
		ОбластьДанных.Параметры.Всего = CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоСумма);
		ТабличныйДокумент.Вывести(ОбластьДанных);
		
		// итоги НДС
		//Если УчитыватьНДС Тогда
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДСБезСкидок");
		ОбластьДанных.Параметры.НДС = ?(ВыборкаВариантИд.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:';en='Including VAT:'"), НСтр("ru='Сумма НДС:'"));
		ОбластьДанных.Параметры.ВсегоНДС = CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоСуммаНДС);
		ТабличныйДокумент.Вывести(ОбластьДанных);
		//КонецЕсли;
		
				
	КонецЕсли;
	// сумма прописью
	
	СуммаКПрописи = ИтогоСумма + ?(ВыборкаВариантИд.ЦенаВключаетНДС, 0, ИтогоСуммаНДС);
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';en='All items '") + Ном + НСтр("ru=', на сумму '") + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаКПрописи, ВыборкаВариантИд.Валюта);
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ВыборкаВариантИд.Валюта);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// заголовок таблицы
	Если ЗначениеЗаполнено(ОписаниеВарианта) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ОписаниеВарианта");
		ОбластьМакета.Параметры.ПредставлениеОписания = ОписаниеВарианта;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли; 
КонецФункции

Функция КПВывестиСтрокиВариантаСтарая(ТабличныйДокумент, Макет, ВыборкаВариантИд, ЕстьСкидки) Экспорт
	
	// шапка таблицы
	ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	
	ТабличныйДокумент.Вывести(ОбластьНомера);
	ТабличныйДокумент.Присоединить(ОбластьДанных);
	Если ВыборкаВариантИд.ЕстьСкидка > 0 Тогда
		ТабличныйДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ТабличныйДокумент.Присоединить(ОбластьСуммы);
	
	ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

	ИтогоПоРазделу 	= 0;
	ИтогоСумма 		= 0;
	ИтогоСуммаНДС 	= 0;
	ИтогоБезСкидок 	= 0;	
	
	Ном = 0;
	ПерваяСтрока = Истина;
	МассивИтогов = Новый Массив;
	МассивИтоговСкидок = Новый Массив;
	МассивРазделителей = Новый Массив;
	
	ТекРазделитель = Справочники.CRM_Разделители.ПустаяСсылка();
	СтруктураДопИнф = Новый Структура("Характеристика, Серия"); 
	
	ОписаниеВарианта = "";
	
	// СтрокиТаблицы
	ВыборкаЗапасы = ВыборкаВариантИд.Выбрать();
	Пока ВыборкаЗапасы.Следующий() Цикл
		
		ОписаниеВарианта = ВыборкаЗапасы.КомментарийВарианта;
		
		Если ТипЗнч(ВыборкаЗапасы.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Ном = Ном + 1;
			// строки номенклатуры
			ОбластьНомера.Параметры.Ном = Ном;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ОбластьДанных.Параметры.Заполнить(ВыборкаЗапасы);

			Если Не ЗначениеЗаполнено(ВыборкаЗапасы.ЕдиницаИзмерения) Тогда
				ОбластьДанных.Параметры.ЕдиницаИзмерения = ВыборкаЗапасы.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;			
			// +CRM
			ТипНоменклатуры = ВыборкаЗапасы.Номенклатура.ТипНоменклатуры;
			Если Не ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				СтруктураДопИнф.Характеристика = ВыборкаЗапасы.Характеристика;			
				ХарактеристикаНоменклатуры = КППредставлениеСерий(СтруктураДопИнф);
				ОбластьДанных.Параметры.Содержание = ?(ПустаяСтрока(ВыборкаЗапасы.Содержание), ВыборкаЗапасы.Номенклатура.НаименованиеПолное + 
														ХарактеристикаНоменклатуры, ВыборкаЗапасы.Содержание);
			Иначе	
				ОбластьДанных.Параметры.Содержание = ?(ПустаяСтрока(ВыборкаЗапасы.Содержание), ВыборкаЗапасы.Номенклатура.НаименованиеПолное, ВыборкаЗапасы.Содержание);
			КонецЕсли;	
			// -CRM
			
			ОбластьДанных.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Ложь, , , );
			ТабличныйДокумент.Присоединить(ОбластьДанных);

			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.Скидка = ВыборкаЗапасы.Количество * ВыборкаЗапасы.Цена - ВыборкаЗапасы.Сумма;
				ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаЗапасы.Количество * ВыборкаЗапасы.Цена;
				ОбластьСкидок.Область(1, 1, 1, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ОбластьСкидок.Область(1, 1, 1, 2).Шрифт = Новый Шрифт(, , Ложь, , , );
				ТабличныйДокумент.Присоединить(ОбластьСкидок);
				ИтогоБезСкидок = ИтогоБезСкидок + ОбластьСкидок.Параметры.СуммаБезСкидки;
			КонецЕсли;
			ОбластьСуммы.Параметры.Сумма = ВыборкаЗапасы.Сумма;
			ОбластьСуммы.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ОбластьСуммы.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Ложь, , , );
			ТабличныйДокумент.Присоединить(ОбластьСуммы);

			ИтогоСумма = ИтогоСумма + ВыборкаЗапасы.Сумма;
			ИтогоСуммаНДС = ИтогоСуммаНДС + ВыборкаЗапасы.СуммаНДС;
			
			Если МассивИтогов.Количество() > 0 Тогда
				МассивИтогов[МассивИтогов.Количество() - 1] = МассивИтогов[МассивИтогов.Количество() - 1] + ВыборкаЗапасы.Сумма;
			КонецЕсли;
			Если МассивИтоговСкидок.Количество() > 0 Тогда
				МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1] = МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1] + (ВыборкаЗапасы.Количество * ВыборкаЗапасы.Цена - ВыборкаЗапасы.Сумма);
			КонецЕсли;
		Иначе
			Если МассивРазделителей.Количество() > 0 Тогда
				ИтогоПоРазделу = МассивИтогов[МассивИтогов.Количество() - 1];
				ИтогоСкидкаПоРазделу = МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1];
				Разделитель = МассивРазделителей[МассивРазделителей.Количество() - 1];
				МассивИтогов.Удалить(МассивИтогов.Количество() - 1);
				МассивИтоговСкидок.Удалить(МассивИтоговСкидок.Количество() - 1);
				МассивРазделителей.Удалить(МассивРазделителей.Количество() - 1);
				Если Разделитель.Итог Тогда
					// Строки итогов по иерархии (итоги).
					ОбластьНомера.Параметры.Ном = "";
					ТабличныйДокумент.Вывести(ОбластьНомера);
					ОбластьДанных.Параметры.Содержание  = НСтр("ru='Итого по: ';en='Total by:'") + Строка(Разделитель);
					ОбластьДанных.Параметры.Номенклатура = Разделитель;
					ОбластьДанных.Параметры.Количество = "";
					ОбластьДанных.Параметры.Цена = "";
					ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
					ОбластьДанных.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
					ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
					ТабличныйДокумент.Присоединить(ОбластьДанных);
					Если ЕстьСкидки Тогда
						ОбластьСкидок.Параметры.СуммаБезСкидки = СокрЛП(Формат(ИтогоПоРазделу + ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
						ОбластьСкидок.Параметры.Скидка = СокрЛП(Формат(ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
						ОбластьСкидок.Область(1, 1, 1, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
						ОбластьСкидок.Область(1, 1, 1, 2).Шрифт = Новый Шрифт(, , Истина, , , );
						ТабличныйДокумент.Присоединить(ОбластьСкидок);
					КонецЕсли;
					ОбластьСуммы.Параметры.Сумма = СокрЛП(CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоПоРазделу));
					ОбластьСуммы.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
					ОбластьСуммы.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
					ТабличныйДокумент.Присоединить(ОбластьСуммы);
					
				КонецЕсли;
			КонецЕсли;
			// Строки разделителей иерархии (заголовки).
			ОбластьНомера.Параметры.Ном = "";
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ОбластьДанных.Параметры.Содержание  = ВыборкаЗапасы.Номенклатура;
			ОбластьДанных.Параметры.Номенклатура = ВыборкаЗапасы.Номенклатура;
			ОбластьДанных.Параметры.Количество = "";
			ОбластьДанных.Параметры.Цена = "";
			ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
			ОбластьДанных.Область(1, 1, 1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.СуммаБезСкидки = "";
				ОбластьСкидок.Параметры.Скидка = "";
				ТабличныйДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;
			ОбластьСуммы.Параметры.Сумма = "";
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			
			МассивИтогов.Добавить(0);
			МассивИтоговСкидок.Добавить(0);
			Если НЕ ТипЗнч(ВыборкаЗапасы.Номенклатура) = Тип("Неопределено") Тогда 
				МассивРазделителей.Добавить(ВыборкаЗапасы.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИтогов.Количество() > 0 Тогда
		ИтогоПоРазделу = МассивИтогов[МассивИтогов.Количество() - 1];
		ИтогоСкидкаПоРазделу = МассивИтоговСкидок[МассивИтоговСкидок.Количество() - 1];
		Разделитель = МассивРазделителей[МассивРазделителей.Количество() - 1];
		МассивИтогов.Удалить(МассивИтогов.Количество()-1);
		МассивИтоговСкидок.Удалить(МассивИтоговСкидок.Количество() - 1);
		МассивРазделителей.Удалить(МассивРазделителей.Количество() - 1);
		Если Разделитель.Итог Тогда
			// Последняя строка итогов по иерархии (итоги).
			ОбластьНомера.Параметры.Ном = "";
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ОбластьДанных.Параметры.Содержание  = НСтр("ru='Итого по: ';en='Total by:'") + Строка(Разделитель);
			ОбластьДанных.Параметры.Номенклатура = Разделитель;
			ОбластьДанных.Параметры.Количество = "";
			ОбластьДанных.Параметры.Цена = "";
			ОбластьДанных.Параметры.ЕдиницаИзмерения = "";
			ОбластьДанных.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			Если ЕстьСкидки Тогда
				ОбластьСкидок.Параметры.СуммаБезСкидки = СокрЛП(Формат(ИтогоПоРазделу + ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
				ОбластьСкидок.Параметры.Скидка = СокрЛП(Формат(ИтогоСкидкаПоРазделу, "ЧЦ=15; ЧДЦ=2"));
				ОбластьСкидок.Область(1, 1, 1, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ОбластьСкидок.Область(1, 1, 1, 2).Шрифт = Новый Шрифт(, , Истина, , , );
				ТабличныйДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;
			ОбластьСуммы.Параметры.Сумма = СокрЛП(Формат(ИтогоПоРазделу, "ЧЦ=15; ЧДЦ=2"));
			ОбластьСуммы.Область(1, 1, 1, 1).Шрифт = Новый Шрифт(, , Истина, , , );
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			
		КонецЕсли;
	КонецЕсли;
	
	// итоги
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы = Макет.ПолучитьОбласть("Итого|Сумма");
	
	ТабличныйДокумент.Вывести(ОбластьНомера);
	ТабличныйДокумент.Присоединить(ОбластьДанных);
	Если ЕстьСкидки Тогда
		ОбластьСкидок.Параметры.ВсегоБезСкидок = ИтогоБезСкидок;
		ОбластьСкидок.Параметры.ВсегоСкидок = ИтогоБезСкидок - ИтогоСумма;
		ТабличныйДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	ОбластьСуммы.Параметры.Всего = CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоСумма);
	ТабличныйДокумент.Присоединить(ОбластьСуммы);
	
	// итоги НДС
	//Если УчитыватьНДС Тогда
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ИтогоНДС|Скидка");
		ОбластьСуммы = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		ТабличныйДокумент.Вывести(ОбластьНомера);
		ОбластьДанных.Параметры.НДС = ?(ВыборкаВариантИд.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:';en='Including VAT:'"), НСтр("ru='Сумма НДС:'"));
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		Если ЕстьСкидки Тогда
			ТабличныйДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		ОбластьСуммы.Параметры.ВсегоНДС = CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(ИтогоСуммаНДС);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
	//КонецЕсли;
	// сумма прописью
	СуммаКПрописи = ИтогоСумма + ?(ВыборкаВариантИд.ЦенаВключаетНДС, 0, ИтогоСуммаНДС);
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';en='All items '") + Ном + НСтр("ru=', на сумму '") + CRM_ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаКПрописи, ВыборкаВариантИд.Валюта);
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ВыборкаВариантИд.Валюта);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// заголовок таблицы
	Если ЗначениеЗаполнено(ОписаниеВарианта) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ОписаниеВарианта");
		ОбластьМакета.Параметры.ПредставлениеОписания = ОписаниеВарианта;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли; 
	
КонецФункции

Функция КП_СформироватьПечатнуюФормуКоммерческогоПредложения(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ (ПараметрыПечати = Неопределено) И ПараметрыПечати.Свойство("НомерВарианта") Тогда
		НомерВарианта = ПараметрыПечати.НомерВарианта;
	Иначе
		НомерВарианта = Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	
	Если НомерВарианта = Неопределено Тогда	// Печать нескольких документов.
		
		ТекстВременныхТаблиц = "";
		ТекстТаблиц = "";
		
		Для Индекс = 0 По МассивОбъектов.ВГраница() Цикл
			
			ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
			|ВЫБРАТЬ
			|	ДокументЗапасы.Ссылка,
			|	ДокументЗапасы.CRM_ИДВарианта КАК ИДВарианта,
			|	ДокументЗапасы.CRM_Утвержден КАК Утвержден
			|ПОМЕСТИТЬ Временная"+Строка(Индекс)+"
			|ИЗ
			|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК ДокументЗапасы
			|ГДЕ
			|	ДокументЗапасы.Ссылка = &Ссылка"+Строка(Индекс)+"
			|	И ДокументЗапасы.CRM_Утвержден
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументЗапасы.Ссылка,
			|	ДокументЗапасы.CRM_ИДВарианта,
			|	ДокументЗапасы.CRM_Утвержден КАК Утвержден
			|ИЗ
			|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК ДокументЗапасы
			|ГДЕ
			|	ДокументЗапасы.Ссылка = &Ссылка"+Строка(Индекс)+"
			|	И ДокументЗапасы.CRM_ИДВарианта = 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////";
			
			Если ТекстТаблиц = "" Тогда
				ТекстТаблиц = ТекстТаблиц + "
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.Ссылка,
				|	ВложенныйЗапрос.ИДВарианта,
				|	ВложенныйЗапрос.Утвержден
				|ПОМЕСТИТЬ ВариантыИтог";
			Иначе
				ТекстТаблиц = ТекстТаблиц + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.Ссылка,
				|	ВложенныйЗапрос.ИДВарианта,
				|	ВложенныйЗапрос.Утвержден";
			КонецЕсли;
			ТекстТаблиц = ТекстТаблиц + "
			|ИЗ
			|	(ВЫБРАТЬ ПЕРВЫЕ 1
			|		Временная"+Строка(Индекс)+".Ссылка КАК Ссылка,
			|		Временная"+Строка(Индекс)+".ИДВарианта КАК ИДВарианта,
			|		Временная"+Строка(Индекс)+".Утвержден КАК Утвержден
			|	ИЗ
			|		Временная"+Строка(Индекс)+" КАК Временная"+Строка(Индекс)+") КАК ВложенныйЗапрос";
			
			Запрос.УстановитьПараметр("Ссылка"+Строка(Индекс), МассивОбъектов[Индекс]);
		КонецЦикла;
		
		ТекстЗапроса = ТекстВременныхТаблиц + ТекстТаблиц + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументЗапасы.Ссылка КАК Ссылка,
		|	ДокументЗапасы.Ссылка.Организация,
		|	ДокументЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ДокументЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ДокументЗапасы.Ссылка.Номер КАК Номер,
		|	ДокументЗапасы.Ссылка.Партнер,
		|	ДокументЗапасы.Ссылка.Валюта,
		|	ДокументЗапасы.Ссылка.ЦенаВключаетНДС,
		|	ДокументЗапасы.Ссылка.СуммаДокумента,
		|	ДокументЗапасы.НомерСтроки КАК НомерСтроки,
		|	ДокументЗапасы.Номенклатура,
		|	ДокументЗапасы.Характеристика,
		|	ДокументЗапасы.Количество,
		|	ДокументЗапасы.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА &ОтображатьСкидки
		|			ТОГДА ДокументЗапасы.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументЗапасы.Количество = 0
		|					ТОГДА 0
		|				ИНАЧЕ ДокументЗапасы.Сумма / ДокументЗапасы.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ДокументЗапасы.ПроцентРучнойСкидки,
		|	ДокументЗапасы.Сумма,
		|	ДокументЗапасы.СтавкаНДС,
		|	ДокументЗапасы.СуммаНДС,
		|	ДокументЗапасы.Всего,
		|	ДокументЗапасы.Содержание,
		|	ДокументЗапасы.CRM_ИДВарианта КАК ИДВарианта,
		|	ДокументЗапасы.CRM_ИмяВарианта КАК ИмяВарианта,
		|	ДокументЗапасы.CRM_Утвержден КАК Утвержден,
		|	ВЫБОР
		|		КОГДА ДокументЗапасы.ПроцентРучнойСкидки <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьСкидка,
		|	ДокументЗапасы.CRM_ЭтоРазделитель КАК ЭтоРазделитель,
		|	ДокументКомментарииВариантов.КомментарийВарианта
		|ИЗ
		|	ВариантыИтог КАК ВариантыИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоммерческоеПредложениеКлиенту.Товары КАК ДокументЗапасы
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоммерческоеПредложениеКлиенту.CRM_КомментарииВариантов КАК ДокументКомментарииВариантов
		|			ПО ДокументЗапасы.Ссылка = ДокументКомментарииВариантов.Ссылка
		|				И ДокументЗапасы.CRM_ИДВарианта = ДокументКомментарииВариантов.ИДВарианта
		|		ПО ВариантыИтог.Ссылка = ДокументЗапасы.Ссылка
		|			И ВариантыИтог.ИДВарианта = ДокументЗапасы.CRM_ИДВарианта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(ЕстьСкидка),
		|	МАКСИМУМ(ИмяВарианта)
		|ПО
		|	Ссылка,
		|	Утвержден,
		|	ИДВарианта";
		
	ИначеЕсли НомерВарианта = -1 Тогда		// Печать всех вариантов документа.
		ТекстЗапроса = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ДокументЗапасы.Ссылка КАК Ссылка,
		|	ДокументЗапасы.Ссылка.Организация,
		|	ДокументЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ДокументЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ДокументЗапасы.Ссылка.Номер КАК Номер,
		|	ДокументЗапасы.Ссылка.Партнер,
		|	ДокументЗапасы.Ссылка.Валюта,
		|	ДокументЗапасы.Ссылка.ЦенаВключаетНДС,
		|	ДокументЗапасы.Ссылка.СуммаДокумента,
		|	ДокументЗапасы.НомерСтроки КАК НомерСтроки,
		|	ДокументЗапасы.Номенклатура,
		|	ДокументЗапасы.Характеристика,
		|	ДокументЗапасы.Количество,
		|	ДокументЗапасы.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА &ОтображатьСкидки
		|			ТОГДА ДокументЗапасы.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументЗапасы.Количество = 0
		|					ТОГДА 0
		|				ИНАЧЕ ДокументЗапасы.Сумма / ДокументЗапасы.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ДокументЗапасы.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ДокументЗапасы.Сумма,
		|	ДокументЗапасы.СтавкаНДС,
		|	ДокументЗапасы.СуммаНДС,
		|	ДокументЗапасы.Всего,
		|	ДокументЗапасы.Содержание,
		|	ДокументЗапасы.CRM_ИДВарианта КАК ИДВарианта,
		|	ДокументЗапасы.CRM_ИмяВарианта КАК ИмяВарианта,
		|	ДокументЗапасы.CRM_Утвержден КАК Утвержден,
		|	ВЫБОР
		|		КОГДА ДокументЗапасы.ПроцентРучнойСкидки <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьСкидка,
		|	ДокументЗапасы.CRM_ЭтоРазделитель КАК ЭтоРазделитель,
		|	ДокументКомментарииВариантов.КомментарийВарианта
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК ДокументЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоммерческоеПредложениеКлиенту.CRM_КомментарииВариантов КАК ДокументКомментарииВариантов
		|		ПО ДокументЗапасы.Ссылка = ДокументКомментарииВариантов.Ссылка
		|			И ДокументЗапасы.CRM_ИДВарианта = ДокументКомментарииВариантов.ИДВарианта
		|ГДЕ
		|	ДокументЗапасы.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	Утвержден УБЫВ,
		|	ИДВарианта
		|ИТОГИ
		|	СУММА(ЕстьСкидка),
		|	МАКСИМУМ(ИмяВарианта)
		|ПО
		|	Ссылка,
		|	Утвержден,
		|	ИДВарианта";
		
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
	Иначе									// Печать конткретного варианта документа.
		ТекстЗапроса = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ДокументЗапасы.Ссылка КАК Ссылка,
		|	ДокументЗапасы.Ссылка.Организация,
		|	ДокументЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ДокументЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ДокументЗапасы.Ссылка.Номер КАК Номер,
		|	ДокументЗапасы.Ссылка.Партнер,
		|	ДокументЗапасы.Ссылка.Валюта,
		|	ДокументЗапасы.Ссылка.ЦенаВключаетНДС,
		|	ДокументЗапасы.Ссылка.СуммаДокумента,
		|	ДокументЗапасы.НомерСтроки КАК НомерСтроки,
		|	ДокументЗапасы.Номенклатура,
		|	ДокументЗапасы.Характеристика,
		|	ДокументЗапасы.Количество,
		|	ДокументЗапасы.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА &ОтображатьСкидки
		|			ТОГДА ДокументЗапасы.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДокументЗапасы.Количество = 0
		|					ТОГДА 0
		|				ИНАЧЕ ДокументЗапасы.Сумма / ДокументЗапасы.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ДокументЗапасы.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ДокументЗапасы.Сумма,
		|	ДокументЗапасы.СтавкаНДС,
		|	ДокументЗапасы.СуммаНДС,
		|	ДокументЗапасы.Всего,
		|	ДокументЗапасы.Содержание,
		|	ДокументЗапасы.CRM_ИДВарианта КАК ИДВарианта,
		|	ДокументЗапасы.CRM_ИмяВарианта КАК ИмяВарианта,
		|	ДокументЗапасы.CRM_Утвержден КАК Утвержден,
		|	ВЫБОР
		|		КОГДА ДокументЗапасы.ПроцентРучнойСкидки <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьСкидка,
		|	ДокументЗапасы.CRM_ЭтоРазделитель КАК ЭтоРазделитель,
		|	ДокументКомментарииВариантов.КомментарийВарианта
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК ДокументЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоммерческоеПредложениеКлиенту.CRM_КомментарииВариантов КАК ДокументКомментарииВариантов
		|		ПО ДокументЗапасы.Ссылка = ДокументКомментарииВариантов.Ссылка
		|			И ДокументЗапасы.CRM_ИДВарианта = ДокументКомментарииВариантов.ИДВарианта
		|ГДЕ
		|	ДокументЗапасы.Ссылка В(&МассивОбъектов)
		|	И ДокументЗапасы.CRM_ИДВарианта = &ИДВарианта
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(ЕстьСкидка)
		|ПО
		|	Ссылка,
		|	Утвержден,
		|	ИДВарианта";
		
		Запрос.УстановитьПараметр("МассивОбъектов"	,МассивОбъектов);
		Запрос.УстановитьПараметр("ИДВарианта"		,НомерВарианта);
	КонецЕсли;
	
    Запрос.УстановитьПараметр("ОтображатьСкидки", ПараметрыПечати.ОтображатьСкидки);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументЗапасы.Ссылка.Партнер", "ДокументЗапасы.Ссылка.Клиент КАК Партнер");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументЗапасы.Всего", "ДокументЗапасы.СуммаСНДС КАК Всего");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументЗапасы.Содержание", "ДокументЗапасы.CRM_Содержание КАК Содержание");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументЗапасы.ПроцентРучнойСкидки", "ДокументЗапасы.ПроцентРучнойСкидки+ДокументЗапасы.ПроцентАвтоматическойСкидки");
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//Макет = ПолучитьМакет("ПФ_MXL_КоммерческоеПредложение");
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КоммерческоеПредложениеКлиенту.CRM_ПФ_MXL_КоммерческоеПредложение");
		
		Если Макет.Области.Найти("Менеджер")<>Неопределено Тогда
			ОбластьЗаголовок                = Макет.ПолучитьОбласть("Заголовок");
			ОбластьКонтактноеЛицо           = Макет.ПолучитьОбласть("КонтактноеЛицо");
			ОбластьПредлагаемОзнакомиться   = Макет.ПолучитьОбласть("ПредлагаемОзнакомиться");
			
			ОбластьМенеджер                 = Макет.ПолучитьОбласть("Менеджер");
			ОбластьПустаяСтрокаТонкая       = Макет.ПолучитьОбласть("ПустаяСтрокаТонкая");
			ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
			ОбластьСрокДействия             = Макет.ПолучитьОбласть("СрокДействияЧастичныйВыкуп");

			
			ДанныеОбъекта = Новый Структура;
			ДанныеШапки = ВыборкаДокументов.Ссылка;
			СведенияОрганизации = Новый Структура;
			СведенияОрганизации.Вставить("Наименование");
			СведенияОрганизации.Вставить("ПолноеНаименование");
			СведенияОрганизации.Вставить("Телефоны");
			СведенияОрганизации.Вставить("ЮридическийАдрес");
			СведенияОрганизации.Вставить("ЭлектроннаяПочта");
			
			КоммерческиеПредложенияДокументыПереопределяемый.ЗаполнитьДанныеОрганизации(ДанныеШапки.Организация, СведенияОрганизации);
			
			Если ЗначениеЗаполнено(СведенияОрганизации.ПолноеНаименование) Тогда
				ПредставлениеОрганизации = СведенияОрганизации.ПолноеНаименование;
			Иначе
				ПредставлениеОрганизации = СведенияОрганизации.Наименование;
			КонецЕсли;
			
			
			Если ЗначениеЗаполнено(ДанныеШапки.Менеджер) Тогда
				
				МассивСМенеджером = Новый Массив;
				МассивСМенеджером.Добавить(ДанныеШапки.Менеджер);
				
				ТребуемыеТипыКонтактнойИнформации = Новый Массив;
				ТребуемыеТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				ТаблицаКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
				МассивСМенеджером,
				ТребуемыеТипыКонтактнойИнформации,,
				ДанныеШапки.Дата);
				
				АдресЭлектроннойПочтыМенеджера = КоммерческиеПредложенияДокументы.ПредставлениеКонтактнойИнформацииИзТаблицы(
				ТаблицаКонтактнойИнформации,
				Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
			Иначе
				ТелефонМенеджера = "";
				АдресЭлектроннойПочтыМенеджера   = "";
			КонецЕсли;
			
			ДанныеОбъекта.Вставить("Ссылка",                              ДанныеШапки.Ссылка);
			ДанныеОбъекта.Вставить("Организация",                         ДанныеШапки.Организация);
			ДанныеОбъекта.Вставить("ТелефонОрганизации",                  СведенияОрганизации.Телефоны);
			ДанныеОбъекта.Вставить("АдресОрганизации",                    СведенияОрганизации.ЮридическийАдрес);
			ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыОрганизации",    ?(СведенияОрганизации.Свойство("ЭлектроннаяПочта"),СведенияОрганизации.ЭлектроннаяПочта, ""));
			ДанныеОбъекта.Вставить("Клиент",                              ДанныеШапки.Клиент);
			ДанныеОбъекта.Вставить("Контрагент",                          ДанныеШапки.Контрагент);
			ДанныеОбъекта.Вставить("ПредставлениеОрганизации",            ПредставлениеОрганизации);
			ДанныеОбъекта.Вставить("ПредставлениеКлиента",                КоммерческиеПредложенияДокументы.ПредставлениеПартнераКонтрагента(ДанныеОбъекта.Клиент, ДанныеОбъекта.Контрагент));
			ДанныеОбъекта.Вставить("КонтактноеЛицо",                      ДанныеШапки.КонтактноеЛицо);
			ДанныеОбъекта.Вставить("Менеджер",                            ДанныеШапки.Менеджер);
			ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыМенеджера",      АдресЭлектроннойПочтыМенеджера);
			ДанныеОбъекта.Вставить("ТелефонМенеджера",                    ТелефонМенеджера);
			ДанныеОбъекта.Вставить("Номер",                               ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеШапки.Номер, Ложь, Истина));
			ДанныеОбъекта.Вставить("Дата",                                Формат(ДанныеШапки.Дата,"ДЛФ=D"));
			ДанныеОбъекта.Вставить("ВариантУказанияСрокаПоставки",        ДанныеШапки.ВариантУказанияСрокаПоставки);
			ДанныеОбъекта.Вставить("УсловияОплаты",                       ДанныеШапки.УсловияОплатыТекст);
			ДанныеОбъекта.Вставить("УсловияДоставки",                     ДанныеШапки.УсловияДоставкиТекст);
			ДанныеОбъекта.Вставить("ПрочиеУсловия",                       ДанныеШапки.ПрочаяДополнительнаяИнформацияТекст);
			ДанныеОбъекта.Вставить("КонтактнаяИнформацияПредложения",     КонтактнаяИнформацияПредложения(ДанныеОбъекта));
			ДанныеОбъекта.Вставить("ПредставлениеСрокаДействия",          КоммерческиеПредложенияДокументы.ПредставлениеСрокаДействияДляПечати(Ложь, ДанныеШапки.СрокДействия));
			ДанныеОбъекта.Вставить("ПредставлениеЧастичногоВыкупа",       КоммерческиеПредложенияДокументы.ПредставлениеЧастичногоВыкупаДляПечати(ДанныеШапки.МожетВыкупатьсяЧастично));
			ДанныеОбъекта.Вставить("УсловияПоставкиПредставление",        CRM_МетодыМодулейМенеджеровДокументов.ПредставлениеУсловийПоставкиДляПечати(ДанныеОбъекта.УсловияОплаты,
			ДанныеОбъекта.УсловияДоставки, 
			ДанныеОбъекта.ПрочиеУсловия,
			ДанныеШапки.CRM_ИсходныеУсловия,
			ДанныеШапки.CRM_ПорядокВыполненияРабот));
		
			КоммерческиеПредложенияДокументыПереопределяемый.ПриФормированииЗаголовкаПечатнойФормы(Макет, ОбластьЗаголовок, ДанныеОбъекта);
			
			ДополнительныеПараметрыВывода = Неопределено;
			
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			Если ЗначениеЗаполнено(ДанныеОбъекта.КонтактноеЛицо) Тогда
				ОбластьКонтактноеЛицо.Параметры.Заполнить(ДанныеОбъекта);
				ТабличныйДокумент.Вывести(ОбластьКонтактноеЛицо);
			КонецЕсли;
			
			ОбластьПредлагаемОзнакомиться.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьПредлагаемОзнакомиться);

			ВыборкаВариантУтвержен = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВариантУтвержен.Следующий() Цикл
				ВыборкаВариантИд = ВыборкаВариантУтвержен.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаВариантИд.Следующий() Цикл
					Если НомерВарианта = -1 Тогда // Все варианты
						Если ВыборкаВариантИд.Утвержден Тогда    
							ДобавитьКОбластиВариант = НСтр("ru=' (утв.)';en=' (Approved)'");
						Иначе
							ДобавитьКОбластиВариант = ""; 
						КонецЕсли; 
						
						// область варианта
						ОбластьВарианта = Макет.ПолучитьОбласть("Вариант");
						ИмяВариантаПоУмолчанию = НСтр("ru='Вариант ';en='Option'") + ВыборкаВариантИд.ИДВарианта;
						ОбластьВарианта.Параметры.Вариант = ИмяВариантаПоУмолчанию + ?(ИмяВариантаПоУмолчанию = ВыборкаВариантИд.ИмяВарианта ИЛИ ПустаяСтрока(ВыборкаВариантИд.ИмяВарианта), "", " """ + ВыборкаВариантИд.ИмяВарианта + """") + ДобавитьКОбластиВариант;
						ТабличныйДокумент.Вывести(ОбластьВарианта);
					КонецЕсли;
						
					КПВывестиСтрокиВарианта(ТабличныйДокумент, Макет, ВыборкаВариантИд, ПараметрыПечати.ОтображатьСкидки);
						
				КонецЦикла;
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
			
			ОбластьСрокДействия.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьСрокДействия);
			
			Если Не ПустаяСтрока(ДанныеОбъекта.УсловияПоставкиПредставление) Тогда
				
				ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
				ОбластьДополнительнаяИнформация.Параметры.Заполнить(ДанныеОбъекта);
				ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);
				
			КонецЕсли;
			
			ОбластьМенеджер.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьМенеджер);

		Иначе
			
			СведенияОбОрганизации = CRM_ОбщегоНазначенияСервер.СведенияОЮрФизЛице(ВыборкаДокументов.Организация, ВыборкаДокументов.ДатаДокумента);
			
			Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				СведенияОбКонтрагенте = CRM_ОбщегоНазначенияСервер.СведенияОЮрФизЛице(ВыборкаДокументов.Партнер, ВыборкаДокументов.ДатаДокумента, ,);
			Иначе
				СведенияОбКонтрагенте = Новый Структура("ПолноеНаименование", ?(ЗначениеЗаполнено(ВыборкаДокументов.Партнер.НаименованиеПолное), 
																				ВыборкаДокументов.Партнер.НаименованиеПолное, ВыборкаДокументов.Партнер.Наименование));
			КонецЕсли;
			
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Константы", "CRM_ПечататьНомераДокументовБезПрефиксов") Тогда
				ФлагУдалитьПрефикс = Константы["CRM_ПечататьНомераДокументовБезПрефиксов"].Получить();
			Иначе
				ФлагУдалитьПрефикс = Ложь;
			КонецЕсли;
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер, ФлагУдалитьПрефикс, ФлагУдалитьПрефикс);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru='Коммерческое предложение № ';en='Quote No. '")
													+ НомерДокумента
													+ НСтр("ru=' от ';en=' from '")
													+ Формат(ВыборкаДокументов.ДатаДокумента, "ДФ=""dd MMMM yyyy""");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			// поставщик и покупатель
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			ОбластьМакета.Параметры.ПредставлениеПоставщика = СведенияОбОрганизации.ПолноеНаименование;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.ПредставлениеПолучателя = СведенияОбКонтрагенте.ПолноеНаименование;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ВыборкаВариантУтвержен = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВариантУтвержен.Следующий() Цикл
				ВыборкаВариантИд = ВыборкаВариантУтвержен.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаВариантИд.Следующий() Цикл
					Если НомерВарианта = 0 Тогда // Все варианты
						Если ВыборкаВариантИд.Утвержден Тогда    
							ДобавитьКОбластиВариант = НСтр("ru=' (утв.)';en=' (Approved)'");
						Иначе
							ДобавитьКОбластиВариант = ""; 
						КонецЕсли; 
						
						// область варианта
						ОбластьВарианта = Макет.ПолучитьОбласть("Вариант");
						ИмяВариантаПоУмолчанию = НСтр("ru='Вариант ';en='Option'") + ВыборкаВариантИд.ИДВарианта;
						ОбластьВарианта.Параметры.Вариант = ИмяВариантаПоУмолчанию + ?(ИмяВариантаПоУмолчанию = ВыборкаВариантИд.ИмяВарианта, "", " """ + ВыборкаВариантИд.ИмяВарианта + """") + ДобавитьКОбластиВариант;
						ТабличныйДокумент.Вывести(ОбластьВарианта);
					КонецЕсли;
						
					КПВывестиСтрокиВариантаСтарая(ТабличныйДокумент, Макет, ВыборкаВариантИд, ПараметрыПечати.ОтображатьСкидки);
						
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

Функция КонтактнаяИнформацияПредложения(ДанныеОбъекта)
	
	МассивСтрок = Новый Массив;
	
	Если Не ПустаяСтрока(ДанныеОбъекта.АдресОрганизации) Тогда
		МассивСтрок.Добавить(ДанныеОбъекта.АдресОрганизации);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеОбъекта.ТелефонОрганизации) Тогда
		МассивСтрок.Добавить(ДанныеОбъекта.ТелефонОрганизации);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеОбъекта.АдресЭлектроннойПочтыМенеджера) Тогда
		МассивСтрок.Добавить(ДанныеОбъекта.АдресЭлектроннойПочтыМенеджера);
	ИначеЕсли Не ПустаяСтрока(ДанныеОбъекта.АдресЭлектроннойПочтыОрганизации) Тогда
		МассивСтрок.Добавить(ДанныеОбъекта.АдресЭлектроннойПочтыОрганизации);
	КонецЕсли;
	
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецФункции

Функция КППредставлениеСерий(Выборка) 

	Результат = "(";

	Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
		Результат = Результат + Выборка.Характеристика;
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.Серия) Тогда
		Результат = ?(Результат = "(", Результат, Результат + "; ");
		Результат = Результат + Выборка.Серия;
	КонецЕсли;

	Результат = Результат + ")";

	Возврат ?(Результат = "()", "", " " + Результат)

КонецФункции // ПредставлениеСерий()

#КонецОбласти

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
