
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	// +Google
	СервисGoogle = Справочники.CRM_СервисыКалендарей.Google;
	ОписанияОбластейДоступа = CRM_ОбменСGoogleКлиентСервер.ОписанияОбластейДоступаКалендарь();
	ЗаполнитьОбластиДоступа(ОписанияОбластейДоступа);
	ИдентификацияПриложения = РегистрыСведений.CRM_СеансовыеДанныеGoogle.ИдентификацияПриложения();
	// -Google
	
	ПрочитатьНастройкиКалендарей();
	ОбновитьФормуПоНастройкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТолькоСервисGoogle И Не ЗначениеЗаполнено(СервисКалендарей) Тогда
		
		СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.Google");
		НачатьАвторизацию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru='Настройки календарей были изменены. Сохранить?';en='Calendars settings were changed. Save?'"); 
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемВопросЗавершение",
			ЭтотОбъект, Новый Структура);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиКалендарей();
		
		Модифицированность = Ложь;
		Оповестить("НастроенаСинхронизацияКалендаря");
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(СервисКалендарей) Тогда
		CRM_ОбщегоНазначенияСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВыбранныйКалендарьИдентификатор");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СервисКалендарейОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(СервисКалендарей) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьОтключение();
	
КонецПроцедуры

&НаКлиенте
Процедура СервисКалендарейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = СервисКалендарей Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = СервисКалендарейСохраненный Тогда
		// Отдельно нужно обработать ситуацию возврата к ранее сохраненной настройке.
		ПрочитатьНастройкиКалендарей();
		Модифицированность = Ложь;
		ОбновитьФормуПоНастройкам();
	Иначе
		ТекстВопроса = НСтр("ru='Не настроен доступ к сервису календарей. Настроить?';en='Access to calendars service is not configured. Configure?'"); 
		ОписаниеОповещения = Новый ОписаниеОповещения("СервисКалендарейОбработкаВыбораВопросЗавершение",
			ЭтотОбъект, Новый Структура("СервисКалендарей", ВыбранноеЗначение));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СервисКалендарейОбработкаВыбораВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СервисКалендарей = ДополнительныеПараметры.СервисКалендарей;
		ВыбранныйКалендарьИдентификатор = "";
		ВыбранныйКалендарьНаименование = "";
		ДанныеАвторизации = Новый Структура;
		НачатьАвторизацию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйКалендарьИдентификаторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыбранныйКалендарьИдентификатор = ВыбранноеЗначение;
	СписокВыбора = Элементы.ВыбранныйКалендарьИдентификатор.СписокВыбора;
	НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(ВыбранныйКалендарьИдентификатор);
	Если НайденныйЭлемент <> Неопределено Тогда
		ВыбранныйКалендарьНаименование = НайденныйЭлемент.Представление;
	КонецЕсли;
	
КонецПроцедуры

#Область Google

&НаКлиенте
Процедура Подключаемый_ПриИзмененииОбластиДоступа(Элемент)
	
	ЗапроситьПодтверждениеДоступа();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	
	СохранитьНастройкиКалендарей();
	
	Модифицированность = Ложь;
	Оповестить("НастроенаСинхронизацияКалендаря");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендари(Команда)
	
	ОбновитьФормуПоНастройкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСинхронизацию(Команда)
	
	НачатьОтключение();
	
КонецПроцедуры

#Область Google

&НаКлиенте
Процедура АвторизоватьсяВGoogle(Команда)
	
	ПерейтиПоНавигационнойСсылке(АдресЗапросаНаПодтверждениеДоступа(Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводТокенаЗапроса(Команда)
	
	ПоказатьОповещениеПользователя(НСтр("ru='Выполняется обработка токена запроса';en='Processing of query token'"));
	
	ПодключитьОбработчикОжидания("ОбработатьПолучениеТокенаЗапроса", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьАвторизацию()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатАвторизации", ЭтотОбъект);
	Если СервисКалендарей = СервисGoogle Тогда
		ЗапроситьПодтверждениеДоступа();
	Иначе
		ОткрытьФорму(
			CRM_СинхронизацияКалендарейКлиентПереопределяемый.ИмяФормыАвторизации(СервисКалендарей),
			CRM_СинхронизацияКалендарейКлиентПереопределяемый.ПараметрыФормыАвторизации(СервисКалендарей),
			ЭтаФорма,,,,
			ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатАвторизации(Результат, ДополнительныеПараметры) Экспорт
	
	Модифицированность = Истина;
	ДанныеАвторизации = Результат;
	
	ОбновитьФормуПоНастройкам();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтключение()
	
	ТекстВопроса = НСтр("ru='Доступ к сервису календарей будет отключен. Продолжить?';en='Access to service calendars will be disabled. Continue?'"); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатОтключения",
		ЭтотОбъект, Новый Структура);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОтключения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СервисКалендарей = ПредопределенноеЗначение("Справочник.CRM_СервисыКалендарей.ПустаяСсылка");
		ВыбранныйКалендарьИдентификатор = "";
		ВыбранныйКалендарьНаименование = "";
		ДанныеАвторизации = Новый Структура;
		
		СохранитьНастройкиКалендарей();
		
		Модифицированность = Ложь;
		Оповестить("НастроенаСинхронизацияКалендаря");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиКалендарей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросКоличествоСервисов = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СервисыКалендарей.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.CRM_СервисыКалендарей КАК СервисыКалендарей");
	РезультатЗапроса = ЗапросКоличествоСервисов.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ТолькоСервисGoogle = (Выборка.Количество = 1);
	
	КалендарьСохраненный = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("КалендарьДляСинхронизации");
	
	Если ЗначениеЗаполнено(КалендарьСохраненный) Тогда
		СервисКалендарей = КалендарьСохраненный.СервисКалендарей;
		ВыбранныйКалендарьИдентификатор = КалендарьСохраненный.Идентификатор;
		ВыбранныйКалендарьНаименование = КалендарьСохраненный.Наименование;
		CRM_СинхронизацияКалендарей.ПрочитатьДанныеАвторизации(
			СервисКалендарей,
			ДанныеАвторизации,
			ТекущийПользователь);
	Иначе
		СервисКалендарей = Справочники.CRM_СервисыКалендарей.ПустаяСсылка();
		ВыбранныйКалендарьИдентификатор = "";
		ВыбранныйКалендарьНаименование = "";
		ДанныеАвторизации = Новый Структура;
	КонецЕсли;
	
	СервисКалендарейСохраненный = СервисКалендарей;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуПоНастройкам()
	
	Элементы.СтраницыДоступныеКалендари.ТекущаяСтраница = Элементы.СтраницаНетКалендарей;
	Элементы.СохранитьЗакрыть3.КнопкаПоУмолчанию = Истина;
	Элементы.ВыбранныйКалендарьИдентификатор.СписокВыбора.Очистить();
	Элементы.ВыбранныйКалендарьИдентификатор.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(СервисКалендарей);
	
	Если Не CRM_СинхронизацияКалендарейКлиентСервер.ДанныеАвторизацииЗаполнены(СервисКалендарей, ДанныеАвторизации) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОписанияКалендарей = CRM_СинхронизацияКалендарей.ОписанияКалендарей(СервисКалендарей, ДанныеАвторизации);
	Исключение
		Элементы.СтраницыДоступныеКалендари.ТекущаяСтраница = Элементы.СтраницаКалендариНеПрочитаны;
		Элементы.Обновить.КнопкаПоУмолчанию = Истина;
		Возврат;
	КонецПопытки;
	
	Если ОписанияКалендарей.Количество() = 0 Тогда
		Элементы.СтраницыДоступныеКалендари.ТекущаяСтраница = Элементы.СтраницаНетКалендарей;
		Элементы.СохранитьЗакрыть3.КнопкаПоУмолчанию = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыДоступныеКалендари.ТекущаяСтраница = Элементы.СтраницаКалендариПрочитаны;
	Элементы.СохранитьЗакрыть1.КнопкаПоУмолчанию = Истина;
	
	СписокВыбора = Элементы.ВыбранныйКалендарьИдентификатор.СписокВыбора;
	Для Каждого КлючИЗначение Из ОписанияКалендарей Цикл
		НовоеЗначение = СписокВыбора.Добавить();
		НовоеЗначение.Значение = КлючИЗначение.Ключ;
		НовоеЗначение.Представление = КлючИЗначение.Значение;
	КонецЦикла;
	
	НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(ВыбранныйКалендарьИдентификатор);
	Если НайденныйЭлемент = Неопределено Тогда
		ПервыйЭлемент = СписокВыбора[0];
		ВыбранныйКалендарьИдентификатор = ПервыйЭлемент.Значение;
		ВыбранныйКалендарьНаименование = ПервыйЭлемент.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКалендарей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(СервисКалендарей) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КалендариСотрудников.Ссылка КАК Ссылка,
		|	КалендариСотрудников.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.CRM_КалендариСотрудников КАК КалендариСотрудников
		|ГДЕ
		|	КалендариСотрудников.Идентификатор = &Идентификатор
		|	И КалендариСотрудников.Пользователь = &Пользователь");
		Запрос.Параметры.Вставить("Идентификатор", ВыбранныйКалендарьИдентификатор);
		Запрос.Параметры.Вставить("Пользователь", ТекущийПользователь);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НовыйКалендарьОбъект = Справочники.CRM_КалендариСотрудников.СоздатьЭлемент();
			НовыйКалендарьОбъект.Идентификатор = ВыбранныйКалендарьИдентификатор;
			НовыйКалендарьОбъект.Наименование = ВыбранныйКалендарьНаименование;
			НовыйКалендарьОбъект.Пользователь = ТекущийПользователь;
			НовыйКалендарьОбъект.СервисКалендарей = СервисКалендарей;
			НовыйКалендарьОбъект.Записать();
			КалендарьНовый = НовыйКалендарьОбъект.Ссылка;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			КалендарьНовый = Выборка.Ссылка;
		КонецЕсли;
		Если КалендарьНовый <> КалендарьСохраненный Тогда
			CRM_ОбщегоНазначенияСервер.УстановитьЗначениеНастройки(
				ТекущийПользователь, "КалендарьДляСинхронизации", КалендарьНовый);
			CRM_СинхронизацияКалендарей.ЗаписатьДанныеАвторизации(СервисКалендарей, ДанныеАвторизации, ТекущийПользователь);
			CRM_СинхронизацияКалендарей.ДобавитьАктуальныеЗаписиВОчередьНаОтправку(КалендарьНовый);
		КонецЕсли;
	Иначе
		CRM_ОбщегоНазначенияСервер.УстановитьЗначениеНастройки(
			ТекущийПользователь, "КалендарьДляСинхронизации", Справочники.CRM_КалендариСотрудников.ПустаяСсылка());
		CRM_СинхронизацияКалендарей.УдалитьДанныеАвторизации(СервисКалендарейСохраненный, ТекущийПользователь);
		CRM_СинхронизацияКалендарей.ОчиститьОчередьНаОтправку(КалендарьСохраненный);
	КонецЕсли;
	
	СервисКалендарейСохраненный = СервисКалендарей;
	ОбновитьПовторноИспользуемыеЗначения();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#Область Google

&НаКлиенте
Функция АдресЗапросаНаПодтверждениеДоступа(БраузерВОтдельномОкне)
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"%1?scope=%2&state=%3&redirect_uri=%4&response_type=code&client_id=%5&approval_prompt=force",
	ИдентификацияПриложения.auth_uri,											 // 1
	ПараметрОбластьДоступа(),													 // 2
	ПараметрАвторизации(ИдентификаторАвторизации, БраузерВОтдельномОкне),		 // 3
	CRM_ОбменСGoogleКлиентСервер.АдресПеренаправления(ИдентификацияПриложения),	 // 4
	ИдентификацияПриложения.client_id);											 // 5
	
КонецФункции

&НаКлиенте
Функция ПараметрОбластьДоступа()
	
	Результат = Новый Массив;
	
	Для Каждого ТекОбластьДоступа Из ОбластиДоступа Цикл
		
		Если Не ТекОбластьДоступа.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекОбластьДоступа.ОбластьДоступа) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ТекОбластьДоступа.ОбластьДоступа);
		
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, " ");
	
КонецФункции

// Выполняет заполнение таблицы формы ОбластиДоступа на основании пер
//
// Параметры:
//  ОписанияОбластейДоступа	 - Массив - массив структур,
//  описания полей см. в ОбменСGoogleКлиентСервер.НовоеОписаниеОбластиДоступа()
//
&НаСервере
Процедура ЗаполнитьОбластиДоступа(ОписанияОбластейДоступа)
	
	ОбластиДоступа.Очистить();
	
	Для Каждого ЭлементОбластиДоступа Из Элементы.ОбластиДоступа.ПодчиненныеЭлементы Цикл
		Элементы.Удалить(ЭлементОбластиДоступа);
	КонецЦикла;
	
	Для Индекс = 0 По ОписанияОбластейДоступа.ВГраница() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластиДоступа.Добавить(), ОписанияОбластейДоступа[Индекс]);
			НовыйЭлемент = Элементы.Добавить(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ОбластьДоступа%1", Формат(Индекс, "ЧГ=")),
			Тип("ПолеФормы"),
			Элементы.ОбластиДоступа);
		
		НовыйЭлемент.ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ОбластиДоступа[%1].Использование", Индекс);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.Заголовок = ОписанияОбластейДоступа[Индекс].Представление;
		НовыйЭлемент.Доступность = ОписанияОбластейДоступа[Индекс].Редактирование;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииОбластиДоступа");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПодтверждениеДоступа()
	
	ИдентификаторАвторизации = Новый УникальныйИдентификатор;
	
	Элементы.Режимы.ТекущаяСтраница = Элементы.РежимАвторизацииGoogle;
	
	Если ИдентификацияПриложения.ВидИдентификации = "web" Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПараметрыОбработчикаОжидания.МаксимальныйИнтервал = 5;
		ПодключитьОбработчикОжидания("ПроверитьТокенЗапроса", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрАвторизации(ИдентификаторАвторизации, БраузерВОтдельномОкне)
	
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"id=%1;zone=%2%3",
		ИдентификаторАвторизации,
		Формат(РаботаВМоделиСервиса.ЗначениеРазделителяСеанса(), "ЧГ="),
		?(БраузерВОтдельномОкне, ";closebrowser=true", ""));
	
	Возврат КодироватьСтроку(Результат, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьТокенЗапроса()
	
	ТокенЗапроса = ТокенЗапросаНаСервере(ИдентификаторАвторизации);
	
	Если ЗначениеЗаполнено(ТокенЗапроса) Тогда
		ОбработатьПолучениеТокенаЗапроса();
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПодключитьОбработчикОжидания("ПроверитьТокенЗапроса", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТокенЗапросаНаСервере(ПараметрСеансаАвторизации)
	
	Возврат РегистрыСведений.CRM_ДанныеАвторизацииGoogle.ТокенЗапроса(ПараметрСеансаАвторизации);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолучениеТокенаЗапроса()
	
	Элементы.Режимы.ТекущаяСтраница = Элементы.РежимНастройки;
	
	Если Не ЗначениеЗаполнено(ТокенЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Токен запроса получен, выполняется обмен на токен доступа...';en='Query token is received, exchange in process for access token...'"),,,
		БиблиотекаКартинок.Информация32);
		
	Модифицированность = Истина;
	ДанныеАвторизации = ОбменятьТокенЗапросаНаСеансовыеДанные(
		ТокенЗапроса,
		ИдентификацияПриложения,
		ПараметрОбластьДоступа());
	ОбновитьФормуПоНастройкам();
	
	Если CRM_ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(ДанныеАвторизации) Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru='Ошибка при получении токена доступа';en='Error getting access token'"),,,
			БиблиотекаКартинок.Ошибка32);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru='Токен доступа получен успешно';en='Access token successfully received'"),,,
			БиблиотекаКартинок.Успешно32);
	КонецЕсли;
	
КонецПроцедуры

Функция ОбменятьТокенЗапросаНаСеансовыеДанные(ТокенЗапроса, ИдентификацияПриложения, ОбластьДанных)
	
	АдресДляПолученияТокенаДоступа = ОбщегоНазначенияКлиентСервер.СтруктураURI(
	ИдентификацияПриложения.token_uri);
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(АдресДляПолученияТокенаДоступа.Схема);

	HTTPСоединение = Новый HTTPСоединение(
		АдресДляПолученияТокенаДоступа.Хост,
		АдресДляПолученияТокенаДоступа.Порт,,,
		ИнтернетПрокси,,
		Новый ЗащищенноеСоединениеOpenSSL);
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.АдресРесурса = АдресДляПолученияТокенаДоступа.ПутьНаСервере;
	ЗапросHTTP.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
	ЗапросHTTP.УстановитьТелоИзСтроки(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"code=%1&client_id=%2&client_secret=%3&redirect_uri=%4&grant_type=authorization_code",
			ТокенЗапроса,
			ИдентификацияПриложения.client_id,
			ИдентификацияПриложения.client_secret,
			CRM_ОбменСGoogleКлиентСервер.АдресПеренаправления(ИдентификацияПриложения)));
	
	ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(ЗапросHTTP);
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветHTTP.ПолучитьТелоКакСтроку());
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	Результат.Вставить("scope", СтрЗаменить(ОбластьДанных, " ", "+"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

