#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ЛичнаяЗадача.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Задача_ЗадачаИсполнителя;
	Попытка
		СправочникОбъект.Записать();
	Исключение
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.Встреча.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 18;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Личная встреча';en='Personal meeting'");
	Попытка
		СправочникОбъект.Записать();
	Исключение
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ОбзвонКлиентов.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 1;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Обзвон клиентов по маркетинговой кампании';en='Used to call the list of customers for a marketing campaign'");
	Попытка
		СправочникОбъект.Записать();
	Исключение
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ПотеряОбращения.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	СправочникОбъект.Описание			= Нстр("ru='Потеря обращения';en='Loss of Request'");
	Попытка
		СправочникОбъект.Записать();
	Исключение
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 18;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	СправочникОбъект.Наименование		= Нстр("ru='Личная встреча';en='Personal meeting'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Личная встреча';en='Personal meeting'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 2;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Наименование		= Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Телефонный звонок клиенту';en='Phone call to customer'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 2;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	СправочникОбъект.Наименование		= Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru='Электронное письмо клиенту';en='Email to customer'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
	КонецПопытки;
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Наименование		= Нстр("ru='Входящий телефонный звонок';en='Incoming phone call'");
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	СправочникОбъект.Описание			= Нстр("ru='Входящий телефонный звонок';en='Incoming phone call'");
	Попытка
		СправочникОбъект.Записать();
	Исключение 
	КонецПопытки;
	

КонецПроцедуры

Функция ПолучитьАвтоСоздаваемыеПоСостояниюИнтереса(СостояниеИнтереса) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВидыВзаимодействий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ВидыВзаимодействий КАК CRM_ВидыВзаимодействий
	                      |ГДЕ
	                      |	CRM_ВидыВзаимодействий.СостояниеИнтереса = &СостояниеИнтереса
	                      |	И CRM_ВидыВзаимодействий.ПланироватьАвтоматическиПриПереходеВСосотояние");
	Запрос.УстановитьПараметр("СостояниеИнтереса", СостояниеИнтереса);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли