#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЧасовойПояс = ПолучитьЧасовойПоясИнформационнойБазы();
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		врТекущаяДата = ТекущаяУниверсальнаяДата();
		СмещениеВремениВМинутах = (МестноеВремя(врТекущаяДата, ЧасовойПояс) - врТекущаяДата) / 60;
	Иначе
		СмещениеВремениВМинутах = 3 * 60; // Москва
	КонецЕсли;
	// Заполнение соответствий видов КИ.
	СоответствиеВидовКИТелефоныПартнера.Очистить();
	СоответствиеВидовКИТелефоныПартнераКомпания.Очистить();
	СоответствиеВидовКИТелефоныКонтактногоЛица.Очистить();
	
	СоответствиеВидовКИАдресаПартнера.Очистить();
	СоответствиеВидовКИАдресаПартнераКомпания.Очистить();
	СоответствиеВидовКИАдресаКонтактногоЛица.Очистить();
	
	Телефоны = CRM_MSExchangeСерверЭкспортныеМетоды.ПолучитьВидыТелефоновMSExchange();
	Для Каждого СтрИмя Из Телефоны Цикл
		НоваяСтрока = СоответствиеВидовКИТелефоныПартнера.Добавить();
		НоваяСтрока.Имя = СтрИмя;
		НоваяСтрока.ВидКИ = CRM_MSExchangeВызовСервера.ОпределитьВидТелефона1С(СтрИмя, Ложь, Ложь);
	КонецЦикла;
	Для Каждого СтрИмя Из Телефоны Цикл
		НоваяСтрока = СоответствиеВидовКИТелефоныПартнераКомпания.Добавить();
		НоваяСтрока.Имя = СтрИмя;
		НоваяСтрока.ВидКИ = CRM_MSExchangeВызовСервера.ОпределитьВидТелефона1С(СтрИмя, Ложь, Истина);
	КонецЦикла;
	Для Каждого СтрИмя Из Телефоны Цикл
		НоваяСтрока = СоответствиеВидовКИТелефоныКонтактногоЛица.Добавить();
		НоваяСтрока.Имя = СтрИмя;
		НоваяСтрока.ВидКИ = CRM_MSExchangeВызовСервера.ОпределитьВидТелефона1С(СтрИмя, Истина, Ложь);
	КонецЦикла;
	
	Адреса = CRM_MSExchangeСерверЭкспортныеМетоды.ПолучитьВидыАдресовMSExchange();
	Для Каждого СтрИмя Из Адреса Цикл
		НоваяСтрока = СоответствиеВидовКИАдресаПартнера.Добавить();
		НоваяСтрока.Имя = СтрИмя;
		НоваяСтрока.ВидКИ = CRM_MSExchangeВызовСервера.ОпределитьВидАдреса1С(СтрИмя, Ложь, Ложь);
	КонецЦикла;
	Для Каждого СтрИмя Из Адреса Цикл
		НоваяСтрока = СоответствиеВидовКИАдресаПартнераКомпания.Добавить();
		НоваяСтрока.Имя = СтрИмя;
		НоваяСтрока.ВидКИ = CRM_MSExchangeВызовСервера.ОпределитьВидАдреса1С(СтрИмя, Ложь, Истина);
	КонецЦикла;
	Для Каждого СтрИмя Из Адреса Цикл
		НоваяСтрока = СоответствиеВидовКИАдресаКонтактногоЛица.Добавить();
		НоваяСтрока.Имя = СтрИмя;
		НоваяСтрока.ВидКИ = CRM_MSExchangeВызовСервера.ОпределитьВидАдреса1С(СтрИмя, Истина, Ложь);
	КонецЦикла;
	
	СобытияМодифицированныеПосле = НачалоМесяца(ДобавитьМесяц(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса(), -2));
	
	ЗадачиМодифицированныеПосле = НачалоМесяца(ДобавитьМесяц(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса(), -1));
	
	ПочтовыеСообщенияМодифицированныеПослеВходящие = НачалоНедели(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
	
	ПочтовыеСообщенияМодифицированныеПослеОтправленные = НачалоНедели(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	МАКСИМУМ(РеквизитДопУпорядочивания) КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.CRM_НастройкиОбменаСMSExchange
		|");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.РеквизитДопУпорядочивания) Тогда
			РеквизитДопУпорядочивания = Выборка.РеквизитДопУпорядочивания + 1;
		Иначе
			РеквизитДопУпорядочивания = 1;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли