#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
&ИзменениеИКонтроль("ИнициализироватьДанныеДокумента")
Процедура смарт_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры)

	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаЗаказыНаВнутреннееПотребление(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыОрганизацийКПередаче(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОформлениюОтчетовКомитенту(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСебестоимостьТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаДвиженияНоменклатураДоходыРасходы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры);

	#Вставка 
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	ТекстЗапросаТаблицаДвиженияГарантийныхЗапасныхЧастей(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаКонтрольИспользованияЗапЧастейНеДляПродажи(Запрос, ТекстыЗапроса, Регистры);
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	#КонецВставки
	
	// Исполнение запроса и выгрузка полученных таблиц для движений.
	ВнутреннееПотреблениеТоваровЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);

КонецПроцедуры
//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  

//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
Функция ТекстЗапросаТаблицаВтТоварыПоPRE(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТоварыПоPRE";
	
	//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
	//ТекстЗапроса = "
	//	|ВЫБРАТЬ
	//	|	ТаблицаТовары.НомерСтроки 	КАК НомерСтроки,
	//	|	ТаблицаТовары.Номенклатура 	КАК Номенклатура,
	//	|	Заявки.Ссылка 				КАК Заявка
	//	|ПОМЕСТИТЬ ВтТоварыПоPRE
	//	|ИЗ
	//	|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ТаблицаТовары
	//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК Заявки
	//	|	ПО
	//	|		Заявки.Номер = ТаблицаТовары.смартНомерЗаявкиНаГарантийныйРемонт
	//	|ГДЕ
	//	|	ТаблицаТовары.Ссылка = &Ссылка
	//	|	И НЕ ТаблицаТовары.Количество = 0
	//	|	И НЕ ТаблицаТовары.смартНомерЗаявкиНаГарантийныйРемонт = """"
	//	|";
	ТекстЗапроса = 
	"
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка КАК Заявка
	|ПОМЕСТИТЬ ВтТоварыПоPRE
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	НЕ ТаблицаТовары.Количество = 0
	|	И НЕ ТаблицаТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка)";
	//-- #Б1132 смарт: Шляпников 01.11.2024

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;
	
КонецФункции
//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  

//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
Функция ТекстЗапросаТаблицаДвиженияГарантийныхЗапасныхЧастей(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартДвиженияГарантийныхЗапасныхЧастей";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТоварыПоPRE", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтТоварыПоPRE(Запрос, ТекстыЗапроса);
	КонецЕсли;
			
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период 							   КАК Период,
		|	ВтТоварыПоPRE.Заявка				   КАК Заявка,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,		
		|	&Склад 								   КАК Склад,
		|	ЗНАЧЕНИЕ(Перечисление.смартВидыКонтроляГарантийныхЗапчастей.СписаниеНаВнутреннееПотребление) КАК ВидКонтроля,
		|	ТаблицаТовары.Количество               КАК Количество
		|ИЗ
		|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТоварыПоPRE КАК ВтТоварыПоPRE
		|	ПО
		|		ВтТоварыПоPRE.НомерСтроки = ТаблицаТовары.НомерСтроки
		|		И ВтТоварыПоPRE.Номенклатура = ТаблицаТовары.Номенклатура
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции
//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  

//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
Функция ТекстЗапросаТаблицаКонтрольИспользованияЗапЧастейНеДляПродажи(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартКонтрольИспользованияЗапЧастейНеДляПродажи";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтВидыЗапасов", ТекстыЗапроса) Тогда
		ТекстЗапросаВтВидыЗапасов(Запрос, ТекстыЗапроса);
	КонецЕсли;

	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТоварыПоPRE", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтТоварыПоPRE(Запрос, ТекстыЗапроса);
	КонецЕсли;

	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 	КАК ВидДвижения,
		|	&Период 								КАК Период,
		|	ИСТИНА 									КАК КВозмещению,
		|	ВтТоварыПоPRE.Заявка 					КАК ЗаявкаНаГарантийныйРемонт,
		|	ВтТоварыПоPRE.Номенклатура 				КАК Номенклатура,
		|	ВтВидыЗапасов.НомерГТД 					КАК НомерГТДКВозмещению,
		|	ВтВидыЗапасов.Количество 				КАК Количество, 
		|	ВЫБОР
		|		КОГДА ВтВидыЗапасов.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ВтВидыЗапасов.НомерГТД.смартНеДляПродажи
		|	КОНЕЦ КАК НеКомпенсировать
		|ИЗ
		|	ВтТоварыПоPRE КАК ВтТоварыПоPRE
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтВидыЗапасов КАК ВтВидыЗапасов
		|	ПО
		|		ВтВидыЗапасов.Номенклатура = ВтТоварыПоPRE.Номенклатура
		|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;
	
КонецФункции
//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  

#КонецЕсли