#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	CRM_ОбщегоНазначенияСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
	Для Каждого Элемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если	ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ДатаНачала") Тогда
				Если Не Элемент.Использование Тогда
					Элемент.Использование = Истина;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
					Элемент.Значение = НачалоКвартала(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
				КонецЕсли;
			КонецЕсли;
			Если Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ДатаКонца") Тогда
				Если Не Элемент.Использование Тогда
					Элемент.Использование = Истина;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
					Элемент.Значение = КонецКвартала(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли