
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++#1329 смарт: Лопато 23.03.2023 //Признак подписания договора  
	смартКомандаДоговорПодписан = ЭтаФорма.Команды.Добавить("смартУстановитьДоговорПодписан");
    смартКомандаДоговорПодписан.Действие = "смартУстановитьДоговорПодписан";
	
    смартКнопкаДоговорПодписан = Элементы.Вставить("смартУстановитьДоговорПодписан", Тип("КнопкаФормы"), Элементы.Список.КоманднаяПанель);
    смартКнопкаДоговорПодписан.Заголовок = "Договор подписан";
    смартКнопкаДоговорПодписан.ИмяКоманды = "смартУстановитьДоговорПодписан";
	смартКнопкаДоговорПодписан.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	//--#1329 смарт: Лопато 23.03.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1329 смарт: Лопато 23.03.2023 //Признак подписания договора  
&НаКлиенте
Процедура смартУстановитьДоговорПодписан()
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='У выделенных в списке договоров будет установлен признак ""Подписан"". Продолжить?'");
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("смартУстановитьДоговорПодписанЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры //--#1329 смарт: Лопато 23.03.2023

//++#1329 смарт: Лопато 23.03.2023 //Признак подписания договора
&НаКлиенте
Процедура смартУстановитьДоговорПодписанЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    ОчиститьСообщения();
    КоличествоОбработанных = смартУстановитьДоговорПодписанСервер(ВыделенныеСтроки, "Подписан");
    ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(Элементы.Список, КоличествоОбработанных, ВыделенныеСтроки.Количество(), НСтр("ru='Подписан'"));

КонецПроцедуры //--#1329 смарт: Лопато 23.03.2023

//++#1329 смарт: Лопато 23.03.2023 //Признак подписания договора
&НаСервереБезКонтекста
Функция смартУстановитьДоговорПодписанСервер(Знач Договоры, НовыйПризнак)
	
	Возврат Справочники.ДоговорыКонтрагентов.смартУстановитьПризнакДоговорПодписан(Договоры, НовыйПризнак);
	
КонецФункции //--#1329 смарт: Лопато 23.03.2023

#КонецОбласти