
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоманднаяПанель.ТолькоПросмотр = Истина;
	
	Заголовок = НСтр("ru='Сценарий';en='Script'")+": "+Объект.Родитель.Наименование;
	
	Элементы.Используется.Видимость = НЕ ЗначениеЗаполнено(Объект.ВидСостояния);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПроверяемыеРеквизитыИнтереса = ТекущийОбъект.ПроверяемыеРеквизитыИнтереса.Получить();
	БлокируемыеРеквизитыИнтереса = ТекущийОбъект.БлокируемыеРеквизитыИнтереса.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПроверяемыеРеквизитыИнтереса <> Неопределено Тогда
		ТекущийОбъект.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(ПроверяемыеРеквизитыИнтереса);
	КонецЕсли;
	Если БлокируемыеРеквизитыИнтереса <> Неопределено Тогда
		ТекущийОбъект.БлокируемыеРеквизитыИнтереса = Новый ХранилищеЗначения(БлокируемыеРеквизитыИнтереса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоСостояниеИнтереса", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияНастройкиНажатие(Элемент)
	Настройки = Новый  Структура;
	Настройки.Вставить("ПроверяемыеРеквизитыИнтереса", ПроверяемыеРеквизитыИнтереса);
	Настройки.Вставить("БлокируемыеРеквизитыИнтереса", БлокируемыеРеквизитыИнтереса);
	Настройки.Вставить("ОбязательноеПланированиеАктивности", Объект.ОбязательноеПланированиеАктивности);
	Настройки.Вставить("ИнтерактивноеПланированиеАктивностей", Объект.ИнтерактивноеПланированиеАктивностей);
	Настройки.Вставить("ЗавершатьЗапланированныеАктивности", Объект.ЗавершатьЗапланированныеАктивности);
	Настройки.Вставить("ОтборЗавершаемыхАктивностей", Объект.ОтборЗавершаемыхАктивностей);
	Настройки.Вставить("УказыватьДостигнутыйРезультат", Объект.УказыватьДостигнутыйРезультат);
	Настройки.Вставить("РазрешитьРолевуюАдресацию", Объект.РазрешитьРолевуюАдресацию);
	Настройки.Вставить("ВидСостояния", Объект.ВидСостояния);
	Настройки.Вставить("ДобавитьВероятностьВПредставлениеСостояния", Объект.ДобавитьВероятностьВПредставлениеСостояния);
	Настройки.Вставить("ВероятностьСделки", Объект.ВероятностьСделки);
	Настройки.Вставить("ИндексЦвета", Объект.ИндексЦвета);
	Настройки.Вставить("ЭтоНовыйОбъект", Объект.Ссылка.Пустая());
	Настройки.Вставить("Родитель", Объект.Родитель);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРедактированияНастроек", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Настройки", Настройки);
	ОткрытьФорму("Справочник.CRM_СостоянияИнтересов.Форма.ФормаНастройкиСостояния", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИндексЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ИндексЦвета);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ИндексЦвета = Результат[0].Картинка;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Справка(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("НастройкаСценариевПродажи"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеРедактированияНастроек(Настройки, ДопПараметры) Экспорт
	
	Если Настройки<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Настройки);
		ПроверяемыеРеквизитыИнтереса = Настройки.ПроверяемыеРеквизитыИнтереса;
		БлокируемыеРеквизитыИнтереса = Настройки.БлокируемыеРеквизитыИнтереса;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


