
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланПродажПоМенеджерам";
	КомандаПечати.Представление = НСтр("ru = 'План продаж по менеджерам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланПродажПоМенеджерам") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПланПродажПоМенеджерам",
				НСтр("ru = 'План продаж по менеджерам'"),
				ПечатьПланПродажПоМенеджерам(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;
			
	СборкаТоваровЛокализация.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

Функция ПечатьПланПродажПоМенеджерам(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смартПланПродажПоМенеджерам";
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") И МассивОбъектов.Количество() = 1 ТОгда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.смартПланПродажПоМенеджерам.ПФ_MXL_ПланПродажПоМенеджерам");
		
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыручкаИСебестоимостьПродаж.Менеджер КАК Менеджер,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 1
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Январь,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 2
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Февраль,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 3
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Март,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 4
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Апрель,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 5
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Май,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 6
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Июнь,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 7
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Июль,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 8
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Август,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 9
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сентябрь,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 10
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Октябрь,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 11
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Ноябрь,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(ВыручкаИСебестоимостьПродаж.смартДатаЗакрытияЗаказа) = 12
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Декабрь,
		|	СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот) КАК ИтогоФактЗаГод,
		|	ВыручкаИСебестоимостьПродаж.Менеджер.Наименование КАК МенеджерНаименование
		|ПОМЕСТИТЬ ВыручкаФакт
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			,
		|			,
		|			,
		|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				И Менеджер В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						смартПланПродажПоМенеджерамОбороты.Менеджер КАК Менеджер
		|					ИЗ
		|						РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК смартПланПродажПоМенеджерамОбороты
		|					ГДЕ
		|						смартПланПродажПоМенеджерамОбороты.Регистратор = &Регистратор)) КАК ВыручкаИСебестоимостьПродаж
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродаж.Менеджер,
		|	ВыручкаИСебестоимостьПродаж.Менеджер.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Планы.Менеджер КАК Менеджер,
		|	СУММА(ВыручкаФакт.Январь) КАК Январь,
		|	СУММА(ВыручкаФакт.Февраль) КАК Февраль,
		|	СУММА(ВыручкаФакт.Март) КАК Март,
		|	СУММА(ВыручкаФакт.Апрель) КАК Апрель,
		|	СУММА(ВыручкаФакт.Май) КАК Май,
		|	СУММА(ВыручкаФакт.Июнь) КАК Июнь,
		|	СУММА(ВыручкаФакт.Июль) КАК Июль,
		|	СУММА(ВыручкаФакт.Август) КАК Август,
		|	СУММА(ВыручкаФакт.Сентябрь) КАК Сентябрь,
		|	СУММА(ВыручкаФакт.Октябрь) КАК Октябрь,
		|	СУММА(ВыручкаФакт.Ноябрь) КАК Ноябрь,
		|	СУММА(ВыручкаФакт.Декабрь) КАК Декабрь,
		|	СУММА(ЕСТЬNULL(ВыручкаФакт.ИтогоФактЗаГод, 0)) КАК ИтогоФактЗаГод,
		|	ВыручкаФакт.МенеджерНаименование КАК МенеджерНаименование,
		|	СУММА(ЕСТЬNULL(Планы.СуммаОборот, 0)) КАК ПланНаСледГод
		|ИЗ
		|	ВыручкаФакт КАК ВыручкаФакт
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			смартПланПродажПоМенеджерамОбороты.Менеджер КАК Менеджер,
		|			СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК смартПланПродажПоМенеджерамОбороты
		|		ГДЕ
		|			смартПланПродажПоМенеджерамОбороты.Регистратор = &Регистратор
		|		
		|		СГРУППИРОВАТЬ ПО
		|			смартПланПродажПоМенеджерамОбороты.Менеджер) КАК Планы
		|		ПО ВыручкаФакт.Менеджер = Планы.Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаФакт.МенеджерНаименование,
		|	Планы.Менеджер
		|
		|УПОРЯДОЧИТЬ ПО
		|	МенеджерНаименование");
		Запрос.УстановитьПараметр("ДатаНачала",МассивОбъектов[0].НачалоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания",МассивОбъектов[0].ОкончаниеПериода);
		Запрос.УстановитьПараметр("Регистратор",МассивОбъектов[0].Ссылка);
		ТабМенеджеры=Запрос.Выполнить().Выгрузить();
		
		ЗапросФактПрошлыйГод = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыручкаИСебестоимостьПродажОбороты.Менеджер КАК Менеджер,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ИтогоЗаПредГод,
		|	ВыручкаИСебестоимостьПродажОбороты.Менеджер.Наименование КАК МенеджерНаименование
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , , смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК ВыручкаИСебестоимостьПродажОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Менеджер,
		|	ВыручкаИСебестоимостьПродажОбороты.Менеджер.Наименование");
		ЗапросФактПрошлыйГод.УстановитьПараметр("ДатаНачала",ДобавитьМесяц(МассивОбъектов[0].НачалоПериода,-12));
		ЗапросФактПрошлыйГод.УстановитьПараметр("ДатаОкончания",ДобавитьМесяц(МассивОбъектов[0].ОкончаниеПериода,-12));
		ТабМенеджерыПрошлыйГод = ЗапросФактПрошлыйГод.Выполнить().Выгрузить();
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ТекГод = Формат(МассивОбъектов[0].НачалоПериода,"ДФ=yyyy");
		ПредГод = Формат(ДобавитьМесяц(МассивОбъектов[0].НачалоПериода,-12),"ДФ=yyyy"); 
		ОбластьШапка.Параметры.ТекГод = ТекГод;
		ТабДокумент.Вывести(ОбластьШапка);
		
		ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
		ОбластьТаблицаШапка.Параметры.ТекГод = ТекГод;
		ОбластьТаблицаШапка.Параметры.ПредГод = ПредГод;
		ТабДокумент.Вывести(ОбластьТаблицаШапка);
		ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
		
		НомПП = 1;
		Для Каждого СтрТабМенеджеры Из ТабМенеджеры Цикл
			
			ОбластьМенеджер = Макет.ПолучитьОбласть("Менеджер");
			ОбластьМенеджер.Параметры.НомПП = НомПП;
			ЗаполнитьЗначенияСвойств(ОбластьМенеджер.Параметры, СтрТабМенеджеры);
			ОбластьМенеджер.Параметры.ПланНаМесяц = ОбластьМенеджер.Параметры.ПланНаСледГод/12;
			
			Если СтрТабМенеджеры.ПланНаСледГод > 0 Тогда
				ОбластьМенеджер.Параметры.ДоляВыполненияПлана = СтрТабМенеджеры.ИтогоФактЗаГод/СтрТабМенеджеры.ПланНаСледГод*100	
			КонецЕсли;
			
			СтрокиТабМенеджерыПрошлыйГод = ТабМенеджерыПрошлыйГод.НайтиСтроки(Новый Структура("Менеджер",СтрТабМенеджеры.Менеджер));
			Если СтрокиТабМенеджерыПрошлыйГод.Количество() > 0 Тогда
				ОбластьМенеджер.Параметры.ИтогоЗаПредГод = СтрокиТабМенеджерыПрошлыйГод[0].ИтогоЗаПредГод;		
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМенеджер);
			НомПП = НомПП+1;
			
		КонецЦикла;
		
		ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
		ОбластьИтоги.Параметры.ИтогиПланНаСледГод=ТабМенеджеры.Итог("ПланНаСледГод");
		ОбластьИтоги.Параметры.ИтогиПланНаМесяц=ТабМенеджеры.Итог("ПланНаСледГод")/12;
		ОбластьИтоги.Параметры.ИтогиЯнварь=ТабМенеджеры.Итог("Январь");
		ОбластьИтоги.Параметры.ИтогиФевраль=ТабМенеджеры.Итог("Февраль");
		ОбластьИтоги.Параметры.ИтогиМарт=ТабМенеджеры.Итог("Март");
		ОбластьИтоги.Параметры.ИтогиАпрель=ТабМенеджеры.Итог("Апрель");
		ОбластьИтоги.Параметры.ИтогиМай=ТабМенеджеры.Итог("Май");
		ОбластьИтоги.Параметры.ИтогиИюнь=ТабМенеджеры.Итог("Июнь");
		ОбластьИтоги.Параметры.ИтогиИюль=ТабМенеджеры.Итог("Июль");
		ОбластьИтоги.Параметры.ИтогиАвгуст=ТабМенеджеры.Итог("Август");
		ОбластьИтоги.Параметры.ИтогиСентябрь=ТабМенеджеры.Итог("Сентябрь");
		ОбластьИтоги.Параметры.ИтогиОктябрь=ТабМенеджеры.Итог("Октябрь");
		ОбластьИтоги.Параметры.ИтогиНоябрь=ТабМенеджеры.Итог("Ноябрь");
		ОбластьИтоги.Параметры.ИтогиДекабрь=ТабМенеджеры.Итог("Декабрь");
		ОбластьИтоги.Параметры.ИтогиИтогоФактЗаГод=ТабМенеджеры.Итог("ИтогоФактЗаГод");
		ОбластьИтоги.Параметры.ИтогиИтогоЗаПредГод=ТабМенеджерыПрошлыйГод.Итог("ИтогоЗаПредГод");
		
		ТабДокумент.Вывести(ОбластьИтоги);
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли