&Вместо("ХозяйственныеОперацииРаздельнойЗакупки")
Функция смарт_ХозяйственныеОперацииРаздельнойЗакупки(ПолноеИмяДокумента, Соглашение, Договор)

	//++ смарт:ММ #096 221 20.02.2021 Доработка Приобретения ТиУ
	Результат = ПродолжитьВызов(ПолноеИмяДокумента, Соглашение, Договор);
	
	Если ПолноеИмяДокумента = "Документ.ПоступлениеТоваровНаСклад" Тогда
		УстановитьПривилегированныйРежим(Истина);
		Результат.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
		Результат.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
	//-- смарт:ММ 20.02.2021
	
КонецФункции

//++ смарт:Подкин #1016 04.05.2022 15:18:09 использовал Вместо т.к. задача со спорным функционалом, для того чтобы далее можно было быстро снять разрешение проводить без Цены/Суммы
&Вместо("СообщитьОбОшибкахКонтрольЗаполненияЦен")
Процедура смарт_СообщитьОбОшибкахКонтрольЗаполненияЦен(Знач Выборка, Знач ДокументЗакупки, Отказ)
	
	Если Пользователи.РолиДоступны("ПолныеПрава,смартРазрешитьЗаказПостащикаБезЦеныСуммы")
								   И ТипЗнч(ДокументЗакупки)=Тип("ДокументОбъект.ЗаказПоставщику") Тогда
        
    Иначе
        Пока Выборка.Следующий() Цикл
            Если Выборка.ЕстьОшибкиЗаполненияЦен Тогда
                
                ТекстОшибки = НСтр("ru='Не заполнена колонка ""Цена"" в строке %НомерСтроки% списка ""Товары""'");
                ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%",  Выборка.НомерСтроки);
                
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
                ТекстОшибки,
                ДокументЗакупки,
                ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки,"Цена"),
                ,
                Отказ);
                
            КонецЕсли;
            
            Если Выборка.ЕстьОшибкиЗаполненияСумм Тогда
                
                ТекстОшибки = НСтр("ru='Не заполнена колонка ""Сумма"" в строке %НомерСтроки% списка ""Товары""'");
                ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%",  Выборка.НомерСтроки);
                
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
                ТекстОшибки,
                ДокументЗакупки,
                ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки,"Сумма"),
                ,
                Отказ);
                
            КонецЕсли;
        КонецЦикла;
        
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #1016 04.05.2022 15:18:09


