#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗаполнитьНастройкиОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДатаНачала 			  = НачалоДня(ТекущаяДата());
	Объект.ДатаОкончания 		  = КонецДня(ТекущаяДата());
	Объект.ВерсияAPI 			  = "V1";
	Объект.ЗагружатьПринудительно = Истина;
	Объект.ВыполнятьВФоне 		  = Ложь;
	Объект.СоздаватьЗвонки 		  = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	Настройки = Справочники.смартПредопределенныеЗначения.Настройки.ПолучитьОбъект();
	Попытка
		Настройки.Заблокировать();
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Настройки.НомераСекретарей.Очистить();
	
	Для каждого стрНомерТелефона Из Объект.СЗНомеровСекретаря Цикл
		
		НоваяСтрока = Настройки.НомераСекретарей.Добавить();
		НоваяСтрока.НомерТелефона = стрНомерТелефона.Значение;
		
	КонецЦикла;
	
    Настройки.Записать(); 
	Настройки.Разблокировать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров();
	
	Если Объект.ВыполнятьВФоне Тогда
		КомандаВыполнитьВФоне(СтруктураПарамеровЗапуска);
	Иначе
		КомандаНаСервере(СтруктураПарамеровЗапуска);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруПараметров(АТС = "", Организация = "")
	
	СтруктураПараметров = Новый Структура; 
	
	СтруктураПараметров.Вставить("АТС", 				   АТС);
	СтруктураПараметров.Вставить("Организация", 		   Организация);

	СтруктураПараметров.Вставить("ДатаНачала", 			   Объект.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания", 		   Объект.ДатаОкончания);
	СтруктураПараметров.Вставить("ВерсияAPI", 			   Объект.ВерсияAPI);
	СтруктураПараметров.Вставить("Пользователь", 		   Объект.Пользователь);
	СтруктураПараметров.Вставить("НомерТелефона", 		   Объект.НомерТелефона);
	СтруктураПараметров.Вставить("UID", 				   Объект.UID);
	СтруктураПараметров.Вставить("ЗагружатьПринудительно", Объект.ЗагружатьПринудительно);
	СтруктураПараметров.Вставить("ВыполнятьВФоне", 		   Объект.ВыполнятьВФоне);
	СтруктураПараметров.Вставить("СоздаватьЗвонки", 	   Объект.СоздаватьЗвонки);
	СтруктураПараметров.Вставить("ТолькоНеСозданные", 	   Объект.ТолькоНеСозданные);

	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура КомандаМегафон(Команда)
	
	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров(ПредопределенноеЗначение("Справочник.смартВидыАТС.Мегафон"), "Смарт-Т");
	
	Если Объект.ВыполнятьВФоне Тогда
		КомандаВыполнитьВФоне(СтруктураПарамеровЗапуска);
	Иначе
		КомандаНаСервере(СтруктураПарамеровЗапуска);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаМегафонКовчег(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров(ПредопределенноеЗначение("Справочник.смартВидыАТС.МегафонКовчег"), "Ковчег");
	
	Если Объект.ВыполнятьВФоне Тогда
		КомандаВыполнитьВФоне(СтруктураПарамеровЗапуска);
	Иначе
		КомандаНаСервере(СтруктураПарамеровЗапуска);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаМегафонВесь(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров(ПредопределенноеЗначение("Справочник.смартВидыАТС.Мегафон"));
	
	Если Объект.ВыполнятьВФоне Тогда
		КомандаВыполнитьВФоне(СтруктураПарамеровЗапуска);
	Иначе
		КомандаНаСервере(СтруктураПарамеровЗапуска);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаAsterisk(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров(ПредопределенноеЗначение("Справочник.смартВидыАТС.Asterisk"));
	
	Если Объект.ВыполнятьВФоне Тогда
		КомандаВыполнитьВФоне(СтруктураПарамеровЗапуска);
	Иначе
		КомандаНаСервере(СтруктураПарамеровЗапуска);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура КомандаНаСервере(СтруктураПарамеровЗапуска)

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработка.ПолучитьИсториюЗвонков(СтруктураПарамеровЗапуска);
	
	ЗначениеВДанныеФормы(ОбъектОбработка.Звонки, Объект.Звонки);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗвонки(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров();
	
	СоздатьЗвонкиНаСервере(СтруктураПарамеровЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗвонкиНаСервере(СтруктураПарамеровЗапуска)

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработка.СоздатьЗвонки(СтруктураПарамеровЗапуска);

КонецПроцедуры

#Область СравнитьAsterisk

&НаКлиенте
Процедура СравнитьAsterisk(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров(ПредопределенноеЗначение("Справочник.смартВидыАТС.Asterisk"));
	
	СравнитьAsteriskНаСервере(СтруктураПарамеровЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура СравнитьAsteriskНаСервере(СтруктураПарамеровЗапуска)

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработка.СравнитьAsterisk(СтруктураПарамеровЗапуска);
	
	ЗначениеВДанныеФормы(ОбъектОбработка.Звонки, Объект.Звонки);
	
КонецПроцедуры

#КонецОбласти

#Область ОпределитьАбонентов

&НаКлиенте
Процедура ОпределитьАбонентов(Команда)

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров();

	ОпределитьАбонентовНаСервере(СтруктураПарамеровЗапуска);

КонецПроцедуры

&НаСервере
Процедура ОпределитьАбонентовНаСервере(СтруктураПарамеровЗапуска)
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработка.ОпределитьАбонентов(СтруктураПарамеровЗапуска);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьАбонентовВФоне(Команда)

	ИДЗадания =  "";
	Индикатор = 0;
	СтрокаСостояния = "";

	СтруктураПарамеровЗапуска = ПодготовитьСтруктуруПараметров();

	СтруктураПарамеровЗапуска.Вставить("ИмяМетода", "ОпределитьАбонентов");
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(СтруктураПарамеровЗапуска, УникальныйИдентификатор);
	ИДЗадания =  СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет определение абонентов";
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СтруктураФоновогоЗадания,
		Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект),
		ПараметрыОжидания);
	
	//++Индикатор
	ПодключитьОбработчикОжидания("ОбработчикОжиданияИндикатор", ПараметрыОжидания.Интервал);
 	//--Индикатор
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#Область ВыполнениеВФоне

&НаКлиенте
Процедура КомандаВыполнитьВФоне(СтруктураПарамеровЗапуска)
	
	ИДЗадания =  "";
	Индикатор = 0;
	СтрокаСостояния = "";

	СтруктураПарамеровЗапуска.Вставить("ИмяМетода", "ПолучитьИсториюЗвонков");
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(СтруктураПарамеровЗапуска, УникальныйИдентификатор);
	ИДЗадания =  СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет получение истории звонков из " 
									   + ?(СтруктураПарамеровЗапуска.АТС = "", "Asterisk и Мегафон", СтруктураПарамеровЗапуска.АТС) 
									   + ?(СтруктураПарамеровЗапуска.Организация = "", "", " " + СтруктураПарамеровЗапуска.Организация);
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СтруктураФоновогоЗадания,
		Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект),
		ПараметрыОжидания);
	
	//++Индикатор
	ПодключитьОбработчикОжидания("ОбработчикОжиданияИндикатор", ПараметрыОжидания.Интервал);
 	//--Индикатор
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)

	НаименованиеЗадания = НСтр("ru = 'Запуск длительной операции'");
	
	ДополнительнаяОбработкаСсылка = смартОбщегоНазначения.ПолучитьВнешнююОбработку("смартИсторияЗвонков");
	
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки", 				   "ВнешняяОбработка.ДлительныеОперацииВоВнешнейОбработке");
	ПараметрыЗадания.Вставить("ИмяМетода", 					   ПараметрыЗапуска.ИмяМетода);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", 		   ПараметрыЗапуска);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", 		   Истина);
	ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

	//++Индикатор
	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
 	//--Индикатор
	
	Если Результат = Неопределено Тогда

		СтрокаСостояния = "Задание отменено";
		Индикатор = 0;
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		//++Индикатор
		СтрокаСостояния = "Задание завершено с ошибками.";
	 	//--Индикатор

	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		// обрабатываем результат
		ОбработатьРезультатНаСервере(Результат.АдресРезультата);
		
		//++Индикатор
		Индикатор = 100;
		СтрокаСостояния = "Задание завершено";
	 	//--Индикатор
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(АдресРезультата)

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ТЗЗвонки = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ОбъектОбработка.Звонки.Загрузить(ТЗЗвонки);
	
	ЗначениеВДанныеФормы(ОбъектОбработка.Звонки, Объект.Звонки);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработчикОжиданияИндикатор() Экспорт
	
	Прогресс = ПрочитатьПрогресс(ИДЗадания);
	
	Если НЕ ТипЗнч(Прогресс) = Тип("Структура") Тогда
		
		СтрокаСостояния = "";
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Прогресс) = Тип("Структура") 
		И Прогресс.Свойство("ЗавершеноАварийно") Тогда
		
		ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
		
		Возврат;
		
	КонецЕсли;
	
	Если Прогресс.Свойство("ЗаданиеВыполнено") И Прогресс.ЗаданиеВыполнено Тогда
		
		Индикатор = 100;
		СтрокаСостояния = "Задание завершено.";
		
	Иначе
		
		Если Прогресс.Свойство("Процент") Тогда
			Индикатор = Прогресс.Процент;
		КонецЕсли;
		
		Если Прогресс.Свойство("Текст") Тогда
			СтрокаСостояния = Прогресс.Текст;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьПрогресс(Знач ИдентификаторФоновогоЗадания) Экспорт
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	Если Задание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПрогрессЗадания = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторФоновогоЗадания);
	
	// Добавляем флаг "ЗаданиеВыполнено", чтобы различать случаи: когда отсутствуют сообщения и когда завершено задание.
	Если ПрогрессЗадания = Неопределено
	 Или ТипЗнч(ПрогрессЗадания) <> Тип("Структура") Тогда // или нет задания, или нет сообщений
		ПрогрессЗадания = Новый Структура;
	КонецЕсли;
	ПрогрессЗадания.Вставить("ЗаданиеВыполнено", ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторФоновогоЗадания));
	
	Возврат ПрогрессЗадания;
	
КонецФункции

#КонецОбласти