
//++ #Б-3932 смарт: Лопато 28.07.2025 //Маркировка радиоэлектронной продукции. Доработка справочника "Коды ТН ВЭД". Дополнения.  
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ПодборИзТНВЭД.Видимость = ПравоДоступа("Редактирование", Метаданные.Справочники.КлассификаторТНВЭД);

	#Вставка
	//++ #Б-3932 смарт: Лопато 28.07.2025 //Маркировка радиоэлектронной продукции. Доработка справочника "Коды ТН ВЭД". Дополнения.  
	НоваяКолонка = Элементы.Добавить("смартОбязательнаяМаркировка", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.смартОбязательнаяМаркировка";
	НоваяКолонка.Заголовок = "Обязательная маркировка (смарт)";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	
	НоваяКолонка = Элементы.Добавить("смартЭкспериментальныйРежимМаркировки", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.смартЭкспериментальныйРежимМаркировки";
	НоваяКолонка.Заголовок = "Экспериментальный режим маркировки (смарт)";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	//-- #Б-3932 смарт: Лопато 28.07.2025 
	
	//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартВидМаркировки", Элементы.Список, "Вид маркировки", 1, "Список.смартВидМаркировки");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартБазоваяСтавка", Элементы.Список, "Базовая ставка", 1, "Список.смартБазоваяСтавка"); 
	смартФормированиеИнтерфейса.СздПолеФлажок(ЭтаФорма, "смартПовышенныйТаможенныйСбор", Элементы.Список, "Повыш. тамож. сбор", , "Список.смартПовышенныйТаможенныйСбор"); 
	
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "ЗагрузитьБазовуюСтавку", "Загрузить базовую ставку", "ЗагрузитьБазовуюСтавку");
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "ЗагрузитьБазовуюСтавку", Элементы.ФормаКоманднаяПанель,, "ЗагрузитьБазовуюСтавку", 1, Новый Структура);		
	Элементы["ЗагрузитьБазовуюСтавку"].Доступность = Пользователи.РолиДоступны("ДобавлениеИзменениеСертификатовНоменклатуры");
	
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "ЗагрузитьПовышенныйТаможенныйСбор", "Загрузить повышенный таможенный сбор", "ЗагрузитьПовышенныйТаможенныйСбор");
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "ЗагрузитьПовышенныйТаможенныйСбор", Элементы.ФормаКоманднаяПанель,, "ЗагрузитьПовышенныйТаможенныйСбор", 1, Новый Структура);	
	Элементы["ЗагрузитьПовышенныйТаможенныйСбор"].Доступность = Пользователи.РолиДоступны("ДобавлениеИзменениеСертификатовНоменклатуры");
	
	УстановитьУсловноеОформление();
	//-- #6726  смарт: Тимофеева 22.05.2026 
	
	#КонецВставки

КонецПроцедуры

//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПовышенныйТаможенныйСбор(Команда)
	МассивКодов = ПолучитьМассивКодов(); 
	ЗагрузитьПовышенныйТаможенныйСборНаСервере(МассивКодов);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьБазовуюСтавку(Команда)
	КодыТНВЭД = ПолучитьКодыТНВЭД();
	Для Каждого СтруктураКода Из КодыТНВЭД Цикл
		БазоваяСтавка = ПолучитьБазовуюСтавку(СтруктураКода.Код);
		Если НЕ БазоваяСтавка = СтруктураКода.БазоваяСтавка Тогда
			УстановитьРеквизит(СтруктураКода.Ссылка, "смартБазоваяСтавка", БазоваяСтавка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	////////////////////////////////////////////////////
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.смартПовышенныйТаможенныйСбор.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.смартПовышенныйТаможенныйСбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
	
	////////////////////////////////////////////////////
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.смартПовышенныйТаможенныйСбор.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.смартПовышенныйТаможенныйСбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивКодов()	
	МассивКодов 			= Новый Массив;
	ИскомаяСтрока 			=   "<td class=""ordw-c"" width=""169"">
								|<div class=""ordw-center"">
								|<a class=""ordw-tnved"" href=""/tnved/?tnved=";
	ДлинаИскомойСтроки 		= СтрДлина(ИскомаяСтрока);
		
	Соединение 	= Новый HTTPСоединение("www.alta.ru",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	Запрос 		= Новый HTTPЗапрос("tamdoc/24ps1637/#pril1");
	Ответ 		= Соединение.Получить(Запрос);
	
	Текст = Ответ.ПолучитьТелоКакСтроку();
	Текст = Сред(Текст, СтрНайти(Текст, "Наименование позиции"));
	
	Пока Истина Цикл
		
		ПервыйСимволИскомойСтроки = СтрНайти(Текст, ИскомаяСтрока);
		Если ПервыйСимволИскомойСтроки = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Текст = Сред(Текст, ПервыйСимволИскомойСтроки);
		Текст = Сред(Текст, ДлинаИскомойСтроки + 1);
		
		Значение = Лев(Текст, СтрНайти(Текст, ">") - 2);
		
		МассивКодов.Добавить(Значение);
		
	КонецЦикла;
	
	ИскомаяСтрокаДоп 		=   "<td class=""ordw-c"" width=""169"">
								|<div class=""ordw-center"">
								|<a class=""ordw-tnved"" href=""/tnved/code/";
	ДлинаИскомойСтрокиДоп 	= СтрДлина(ИскомаяСтрокаДоп);

	Текст = Ответ.ПолучитьТелоКакСтроку();
	Текст = Сред(Текст, СтрНайти(Текст, "Наименование позиции"));
	
	Пока Истина Цикл
		
		ПервыйСимволИскомойСтроки = СтрНайти(Текст, ИскомаяСтрокаДоп);
		Если ПервыйСимволИскомойСтроки = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Текст = Сред(Текст, ПервыйСимволИскомойСтроки);
		Текст = Сред(Текст, ДлинаИскомойСтрокиДоп + 1);
		
		Значение = Лев(Текст, СтрНайти(Текст, "/"">") - 1);
		
		МассивКодов.Добавить(Значение);
		
	КонецЦикла;
	
	Возврат МассивКодов;
КонецФункции

&НаСервере
Процедура ЗагрузитьПовышенныйТаможенныйСборНаСервере(МассивКодов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторТНВЭД.Ссылка КАК Ссылка,
	|	КлассификаторТНВЭД.Код КАК Код,
	|	КлассификаторТНВЭД.смартПовышенныйТаможенныйСбор КАК ПовышенныйТаможенныйСбор
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодТНВЭД = ВыборкаДетальныеЗаписи.Код;
		ПовышенныйТаможенныйСбор = Ложь;
		Для Каждого Код Из МассивКодов Цикл  
			
			Для Индекс = 0 По 9 Цикл
				
				Если СтрДлина(Код) = (10 - Индекс) И Код = Лев(КодТНВЭД, 10 - Индекс) Тогда 
					ПовышенныйТаможенныйСбор = Истина;					
					Прервать;
				КонецЕсли;
				
			КонецЦикла; 
			
			Если ПовышенныйТаможенныйСбор Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если НЕ ПовышенныйТаможенныйСбор = ВыборкаДетальныеЗаписи.ПовышенныйТаможенныйСбор Тогда
			УстановитьРеквизит(ВыборкаДетальныеЗаписи.Ссылка, "смартПовышенныйТаможенныйСбор", ПовышенныйТаможенныйСбор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьРеквизит(СпрСсылка, ИмяРеквизита, Значение)

	СпрОбъект = СпрСсылка.ПолучитьОбъект();
	СпрОбъект[ИмяРеквизита] = Значение; 
	Попытка
		СпрОбъект.Записать();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменен элемент %1: %2 = %3", СпрСсылка, ИмяРеквизита, Значение));
	Исключение
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось изменить элемент %1: %2", СпрСсылка, ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьКодыТНВЭД()	
	Результат = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторТНВЭД.Ссылка КАК Ссылка,
	|	КлассификаторТНВЭД.Код КАК Код,
	|	КлассификаторТНВЭД.смартБазоваяСтавка КАК БазоваяСтавка
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураКода = Новый Структура("Ссылка, Код, БазоваяСтавка");
		ЗаполнитьЗначенияСвойств(СтруктураКода, ВыборкаДетальныеЗаписи);
		Результат.Добавить(СтруктураКода);
	КонецЦикла;
    Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьБазовуюСтавку(КодТНВЭД)	
	БазоваяСтавка	= ""; 		
	Соединение 		= Новый HTTPСоединение("www.alta.ru",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	Запрос 			= Новый HTTPЗапрос("tnved/code/" + КодТНВЭД + "/");
	Ответ 			= Соединение.Получить(Запрос);
	
	Текст = Ответ.ПолучитьТелоКакСтроку();
	Текст = Сред(Текст, СтрНайти(Текст, "Базовая ставка таможенной пошлины"));
	
	ИскомаяСтрока 			= "<b class=""black"">";
	ДлинаИскомойСтроки 		= СтрДлина(ИскомаяСтрока);
	Текст 					= Сред(Текст, СтрНайти(Текст, ИскомаяСтрока));
	Текст 					= Сред(Текст, ДлинаИскомойСтроки + 1);
		
	Значение 				= Лев(Текст, СтрНайти(Текст, "</b>") - 1);
	БазоваяСтавка 			= СтрЗаменить(Значение, " ", "");
	
	//Попытка
	//	Если ЗначениеЗаполнено(Значение) Тогда
	//		БазоваяСтавка = Число(Значение);	
	//	КонецЕсли; 
	//Исключение
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не удалось определить базовую ставку в %% для кода %1 из значения = %2. Установите вручную.", КодТНВЭД, Значение));
	//КонецПопытки;
	
	Возврат БазоваяСтавка;
КонецФункции

#КонецОбласти

//-- #6726  смарт: Тимофеева 22.05.2026
