
&ИзменениеИКонтроль("Сформировать")
Процедура смарт_Сформировать(СегментСсылка)

	ПР = ПривилегированныйРежим();
	Если НЕ ПР Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	СписокЭлементов = СегментыСервер.СписокЭлементовСКД(СегментСсылка);
	ВключатьХарактеристики =
		СписокЭлементов.Колонки.Найти("ХарактеристикаЭлемента") <> Неопределено;

	Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		
		#Вставка
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.06.2021 15:54:36 задача 552
		НаборЗаписейУдаление = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
		НаборЗаписейУдаление.Отбор.Сегмент.Установить(СегментСсылка);
		НаборЗаписейУдаление.Прочитать();
		МассивВРегистре=НаборЗаписейУдаление.ВыгрузитьКолонку("Номенклатура");
		МассивПодЗапись=СписокЭлементов.ВыгрузитьКолонку("ЭлементСписка");
		МассивУдаленныхЭлементов=ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивВРегистре,МассивПодЗапись);
		Для каждого ЭлМассива Из МассивУдаленныхЭлементов Цикл
			ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.ДобавлениеФильтровПоСегментам",Новый Структура("СсылкаСегмент,СсылкаНоменклатура,ВклУд",СегментСсылка,ЭлМассива,Ложь),ПараметрыВыполнения);
		КонецЦикла; 
		//Смарт }Подкин Алексей Иванович 29.06.2021 15:54:36
		#КонецВставки
		
		НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
		Для Каждого Элемент Из СписокЭлементов Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.ЭлементСписка) Тогда
				Продолжить;
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			Запись.Сегмент = СегментСсылка;
			Запись.Номенклатура = Элемент.ЭлементСписка;
			Если ВключатьХарактеристики Тогда
				Запись.Характеристика = Элемент.ХарактеристикаЭлемента;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НаборЗаписей = РегистрыСведений.ПартнерыСегмента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сегмент.Установить(СегментСсылка);
		Для Каждого Элемент Из СписокЭлементов Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.ЭлементСписка) Тогда
				Продолжить;
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			Запись.Сегмент = СегментСсылка;
			Запись.Партнер = Элемент.ЭлементСписка;
		КонецЦикла;
	КонецЕсли;

	НаборЗаписей.Записать();

	Если НЕ ПР Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры
