
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Дата_") Тогда
		Дата_ = Параметры.Дата_;
	КонецЕсли;
	
	Если Параметры.Свойство("Время_") Тогда
		Время_ = Параметры.Время_;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Время_НачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Время_НачалоВыбораИзСпискаЗавершение", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, Время_, Элемент,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура Время_НачалоВыбораИзСпискаЗавершение(ВыбранноеВремя, Дополнительно) Экспорт
	Если ВыбранноеВремя <> Неопределено Тогда
		Время_ = ВыбранноеВремя.Значение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Дата_ + (Время_ - НачалоДня(Время_));
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
