#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных


Перем ЭтоНовый; // Показывает, что был записан новый объект.
                // Используются в обработчике события ПриЗаписи.

#КонецОбласти


#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЪЕКТА
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяРегламентноеЗадание() И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСквознуюАналитику") Тогда
		Если ПометкаУдаления Тогда
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Попытка
					GUIDЗадания = Ссылка.УникальныйИдентификатор();
					НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Ключ", GUIDЗадания));
					Если НайденныеЗадания.Количество() > 0 Тогда
						НайденныеЗадания[0].Удалить();
					КонецЕсли;
				Исключение КонецПопытки;
			КонецЕсли;
		
		Иначе
			Если ДополнительныеСвойства.Свойство("АдресРасписания") И ЗначениеЗаполнено(ДополнительныеСвойства.АдресРасписания) Тогда
				  ТекАдрес = ДополнительныеСвойства.АдресРасписания;
			Иначе ТекАдрес = АдресРасписания;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекАдрес) Тогда
				CRM_СистемаСквознойАналитикиВызовСервера.CRM_ПолучитьРегЗаданияПоСценариюЛидогенерация(Ссылка, Сценарий, ТекАдрес, Включено);
			КонецЕсли;
		КонецЕсли;
		
		Если Сценарий = Перечисления.CRM_CallTrakingСценарии.Comagic
			ИЛИ Сценарий = Перечисления.CRM_CallTrakingСценарии.UIS Тогда
			Константы.сфпИспользоватьCoMagic.Установить(Включено);
			Константы.сфпЛогинCoMagic.Установить(Логин);
			Константы.сфпПарольCoMagic.Установить(Пароль);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ИспользуетсяРегламентноеЗадание()
	
	Если Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.ВнешнийAPI") ИЛИ 
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.РучнойВвод") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Roistat") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.JivoSite") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.WebService") Тогда
		Возврат Ложь;

	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
	Если ПометкаУдаления Тогда
		Включено = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли