#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("СформироватьТаблицуИсходныхДвижений")
Процедура смарт_СформироватьТаблицуИсходныхДвижений()

	// Формирование таблиц.
	// Текущее состояние набора помещается во временную таблицу "ДвиженияПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период                           КАК Период,
	|	Таблица.Номенклатура                     КАК Номенклатура,
	|	Таблица.Характеристика                   КАК Характеристика,
	|	Таблица.Склад                            КАК Склад,
	|	-Таблица.КоличествоИзЗаказов             КАК КоличествоИзЗаказовПередЗаписью
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, -Таблица.смартКоличествоИзЗаказовГарантийные             КАК смартКоличествоИзЗаказовГарантийныеПередЗаписью
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|ПОМЕСТИТЬ ГрафикОтгрузкиТоваровПередЗаписью
	|
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|		 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|		 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО Таблица.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|
	#Удаление
	|	И Таблица.КоличествоИзЗаказов > 0
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	И ( Таблица.КоличествоИзЗаказов > 0
	|	ИЛИ Таблица.смартКоличествоИзЗаказовГарантийные > 0 )
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	И (НЕ &ЭтоНовый)
	|
	|	И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|		ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|		НастройкаСклад.Контролировать))";

	Запрос.Выполнить();

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьТаблицуИзмененийДвижений")
Процедура смарт_СформироватьТаблицуИзмененийДвижений()

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Номенклатура                                 КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика                               КАК Характеристика,
	|	ТаблицаИзменений.Склад                                        КАК Склад,
	|	ТаблицаИзменений.Период                                       КАК Период,
	|	СУММА(ТаблицаИзменений.КоличествоИзЗаказовИзменение)          КАК КоличествоИзЗаказовИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, СУММА(ТаблицаИзменений.смартКоличествоИзЗаказовГарантийныеИзменение)          КАК смартКоличествоИзЗаказовГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|ПОМЕСТИТЬ ДвиженияГрафикОтгрузкиТоваровИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период                          КАК Период,
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Склад                           КАК Склад,
	|		Таблица.КоличествоИзЗаказовПередЗаписью КАК КоличествоИзЗаказовИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		, Таблица.смартКоличествоИзЗаказовГарантийныеПередЗаписью КАК смартКоличествоИзЗаказовГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	ИЗ
	|		ГрафикОтгрузкиТоваровПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период                          КАК Период,
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Склад                           КАК Склад,
	|		Таблица.КоличествоИзЗаказов             КАК КоличествоИзЗаказовИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		, Таблица.смартКоличествоИзЗаказовГарантийные             КАК смартКоличествоИзЗаказовГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	ИЗ
	|		РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
	|		ПО Таблица.Склад = НастройкаХарактеристика.Склад
	|		 И Таблица.Номенклатура = НастройкаХарактеристика.Номенклатура
	|		 И Таблица.Характеристика = НастройкаХарактеристика.Характеристика
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
	|		ПО Таблица.Склад = НастройкаНоменклатура.Склад
	|		 И Таблица.Номенклатура = НастройкаНоменклатура.Номенклатура
	|		 И Таблица.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И Таблица.Склад   ЕСТЬ NULL
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
	|		ПО Таблица.Склад = НастройкаСклад.Склад
	|		 И НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		 И НастройкаХарактеристика.Склад   ЕСТЬ NULL
	|		 И НастройкаНоменклатура.Склад     ЕСТЬ NULL
	|
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	|
	#Удаление
	|		И Таблица.КоличествоИзЗаказов > 0
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		И ( Таблица.КоличествоИзЗаказов > 0
	|		ИЛИ  Таблица.смартКоличествоИзЗаказовГарантийные > 0 )
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|		И ЕСТЬNULL(НастройкаХарактеристика.Контролировать,
	|			ЕСТЬNULL(НастройкаНоменклатура.Контролировать,
	|			НастройкаСклад.Контролировать))
	|
	|	) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Период,
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КоличествоИзЗаказовИзменение) > 0
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	ИЛИ СУММА(ТаблицаИзменений.смартКоличествоИзЗаказовГарантийныеИзменение) > 0
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрафикОтгрузкиТоваровПередЗаписью";

	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();

	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияГрафикОтгрузкиТоваровИзменение", Выборка.Количество > 0);

КонецПроцедуры

&ИзменениеИКонтроль("ПоместитьВременнуюТаблицуИсходныхДвижений")
Процедура смарт_ПоместитьВременнуюТаблицуИсходныхДвижений(Ссылка, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.Номенклатура   КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Склад          КАК Склад,
	|
	|	Т.ДатаОтгрузки        КАК ДатаОтгрузки,
	|	Т.КоличествоИзЗаказов КАК КоличествоПередЗаписью
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, Т.смартКоличествоИзЗаказовГарантийные КАК смартКоличествоИзЗаказовГарантийныеПередЗаписью
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|ПОМЕСТИТЬ ВТГрафикОтгрузкиТоваровПередЗаписью
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор
	#Удаление
	|	И Т.КоличествоИзЗаказов <> 0");
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	И ( Т.КоличествоИзЗаказов <> 0
	|	ИЛИ  Т.смартКоличествоИзЗаказовГарантийные <> 0 )");
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки

	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

&ИзменениеИКонтроль("ПоместитьВременнуюТаблицуИзмененийДвижений")
Функция смарт_ПоместитьВременнуюТаблицуИзмененийДвижений(Ссылка, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Набор.Номенклатура   КАК Номенклатура,
	|	Набор.Характеристика КАК Характеристика,
	|	Набор.Склад          КАК Склад
	|
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ(
	|	ВЫБРАТЬ
	|		ПередЗаписью.Номенклатура           КАК Номенклатура,
	|		ПередЗаписью.Характеристика         КАК Характеристика,
	|		ПередЗаписью.Склад                  КАК Склад,
	|
	|		ПередЗаписью.ДатаОтгрузки            КАК ДатаОтгрузки,
	|		-ПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		, -ПередЗаписью.смартКоличествоИзЗаказовГарантийныеПередЗаписью КАК смартКоличествоИзЗаказовГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	ИЗ
	|		ВТГрафикОтгрузкиТоваровПередЗаписью КАК ПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриЗаписи.Номенклатура           КАК Номенклатура,
	|		ПриЗаписи.Характеристика         КАК Характеристика,
	|		ПриЗаписи.Склад                  КАК Склад,
	|
	|		ПриЗаписи.ДатаОтгрузки           КАК ДатаОтгрузки,
	|		ПриЗаписи.КоличествоИзЗаказов    КАК КоличествоИзменение
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		, ПриЗаписи.смартКоличествоИзЗаказовГарантийные    КАК смартКоличествоИзЗаказовГарантийныеИзменение
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|	ИЗ
	|		РегистрНакопления.ГрафикОтгрузкиТоваров КАК ПриЗаписи
	|	ГДЕ
	|		ПриЗаписи.Регистратор = &Регистратор
	#Удаление
	|		И ПриЗаписи.КоличествоИзЗаказов <> 0) КАК Набор
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|		И ( ПриЗаписи.КоличествоИзЗаказов <> 0
	|		ИЛИ ПриЗаписи.смартКоличествоИзЗаказовГарантийные <> 0 )) КАК Набор
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.Номенклатура, Набор.Характеристика, Набор.Склад,
	|	Набор.ДатаОтгрузки
	|
	|ИМЕЮЩИЕ
	#Удаление
	|	СУММА(Набор.КоличествоИзменение) <> 0");
	#КонецУдаления
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	СУММА(Набор.КоличествоИзменение) <> 0
	|	ИЛИ СУММА(Набор.смартКоличествоИзЗаказовГарантийныеИзменение) <> 0");
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

#КонецОбласти