
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Групповая.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие);
	Элементы.Пояснение.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие);
	
	Элементы.ВложенныйПроцесс.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс);
	Элементы.ВходящиеТочки.Видимость = (Объект.Вид <> Перечисления.CRM_ВидыТочекМаршрута.Старт);
	Элементы.ИсходящиеТочки.Видимость = (Объект.Вид <> Перечисления.CRM_ВидыТочекМаршрута.Завершение);
	Элементы.ВариантЗавершения.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Завершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиСобытийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ТекстОбработки,Заголовок", Элемент.ТекущиеДанные.Обработчик,"Обработчик события "+""""+Строка(Элемент.ТекущиеДанные.Событие)+"""");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикиСобытийВыборЗавершение", ЭтотОбъект, Элемент);
	ОткрытьФорму("Справочник.CRM_ТочкиМаршрутов.Форма.ФормаРедактированияТекста", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиСобытийВыборЗавершение(Результат, Элемент) экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Элемент.ТекущиеДанные.Обработчик = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

