#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);


	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	// Обработчик механизма "Назначения"
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтаФорма);

	ЗаполнитьПоДаннымВХранилище();

	Элементы.ТоварыНоменклатура.ТолькоПросмотр   = Параметры.ЗапретитьИзменятьТовары;
	Элементы.ТоварыХарактеристика.ТолькоПросмотр = Параметры.ЗапретитьИзменятьТовары;
	Элементы.ТоварыКоличество.ТолькоПросмотр     = Параметры.ЗапретитьИзменятьТовары;
	Элементы.Склад.ТолькоПросмотр                = Параметры.ЗапретитьИзменятьТовары;
	Элементы.Организация.ТолькоПросмотр          = Параметры.ЗапретитьИзменятьТовары;
	Элементы.Товары.ИзменятьСоставСтрок          = Не Параметры.ЗапретитьИзменятьТовары;
	Элементы.Заполнить.Доступность               = Не Параметры.ЗапретитьИзменятьТовары; 

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		Если Объект.СтатьяРасходов = Неопределено Тогда
			Объект.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(Параметры.АдресДанныхВХранилище)
		Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	КонецЕсли;

	Элементы.ТоварыПоискПоШтрихкоду.Видимость = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);

	УстановитьВидимостьВидЦены(Объект.ИсточникИнформацииОЦенахДляПечати);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.ПодменюЭДО;
	ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	#Вставка
	//++ #Б6824 смарт: Шляпников 08.06.2026 / Маркировка. Внутреннее движение товара в 1С УТ РФ.
	Элементы.Товары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6824 смарт: Шляпников 08.06.2026
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_СписаниеНедостачТоваров", ПараметрыЗаписи, Объект.Ссылка);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ОповеститьОбИзмененииТекущихДелПоЭДО();

	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	#Вставка
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(Объект);
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
	//++ #Б6824 смарт: Шляпников 08.06.2026 / Маркировка. Внутреннее движение товара в 1С УТ РФ.
	смартМаркировкаКлиент.ВывестиСообщениеОНеобходимостиСканированияТоваровСОбязательнойМаркировкой(Объект);
	//-- #Б6824 смарт: Шляпников 08.06.2026

	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();

КонецПроцедуры

#КонецОбласти