
&ИзменениеИКонтроль("ЗагрузитьДанныеИзXML")
Функция смарт_ЗагрузитьДанныеИзXML(ЧтениеXML)

	//Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 22.05.2021 23:02:52 добавлен Экспорт для вызова из http-сервиса
	Экспорт
	//Смарт -}

	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("ЕстьОшибки", Ложь);
	РезультатЗагрузки.Вставить("ТекстОшибки", "");
	РезультатЗагрузки.Вставить("ЗагруженныеОбъекты", Новый Массив);

	ЧтениеXML.Прочитать(); // Message
	ЧтениеXML.Прочитать(); // Header
	ЗаголовокСообщенияXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип("http://www.1c.ru/SSL/Exchange/Message", "Header"));
	Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента
		Или ЧтениеXML.ЛокальноеИмя <> "Body" Тогда

		РезультатЗагрузки.ЕстьОшибки = Истина;
		РезультатЗагрузки.ТекстОшибки = НСтр("ru = 'Ошибка чтения сообщения загрузки. Неверный формат сообщения.'");

		Возврат РезультатЗагрузки;
	КонецЕсли;

	СтруктураФормата = СтрРазделить(ЗаголовокСообщенияXDTO.Format, " ", Ложь);

	ФорматОбмена = РазложитьФорматОбмена(СтруктураФормата[0]);
	ВерсияФорматаДляЗагрузки = ФорматОбмена.Версия;
	РасширениеФорматаДляЗагрузки = "";

	Если СтруктураФормата.Количество() > 0 Тогда
		РасширениеФорматаДляЗагрузки = СтруктураФормата[СтруктураФормата.ВГраница()];
	КонецЕсли;

	КомпонентыОбмена = КомпонентыОбмена("Получение", ВерсияФорматаДляЗагрузки, РасширениеФорматаДляЗагрузки);

	#Вставка
	//++ #Б1884 смарт: Шляпников 09.09.2025 / Синхронизация взаимозачетов из БП в УТ
	Если ЗначениеЗаполнено(ЭтотОбъект.УзелОбмена) Тогда
		КомпонентыОбмена.УзелКорреспондента = ЭтотОбъект.УзелОбмена;
		КомпонентыОбмена.УзелКорреспондентаОбъект = ЭтотОбъект.УзелОбмена.ПолучитьОбъект();
	КонецЕсли;
	//-- #Б1884 смарт: Шляпников 09.09.2025
	#КонецВставки
	
	ЧтениеXML.Прочитать(); // Body
	КомпонентыОбмена.Вставить("ФайлОбмена", ЧтениеXML);

	УстановитьПривилегированныйРежим(Истина);
	ОбменДаннымиСлужебный.ОтключитьОбновлениеКлючейДоступа(Истина);
	Попытка
		ОбменДаннымиXDTOСервер.ПроизвестиЧтениеДанных(КомпонентыОбмена);
		ОбменДаннымиСлужебный.ОтключитьОбновлениеКлючейДоступа(Ложь);
	Исключение
		ОбменДаннымиСлужебный.ОтключитьОбновлениеКлючейДоступа(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Если КомпонентыОбмена.ФлагОшибки Тогда
		РезультатЗагрузки.ЕстьОшибки = Истина;
		РезультатЗагрузки.ТекстОшибки = КомпонентыОбмена.СтрокаСообщенияОбОшибке;
	КонецЕсли;

	РезультатЗагрузки.ЗагруженныеОбъекты = КомпонентыОбмена.ЗагруженныеОбъекты.ВыгрузитьКолонку("СсылкаНаОбъект");

	Возврат РезультатЗагрузки;

КонецФункции
