

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаИсторииРеквизитов(Команда)
	ПараметрыФормы = Новый Структура;
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		ОбъектОтбора = Список.Отбор.Элементы[0].ПравоеЗначение;
		Если ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			ПараметрыФормы.Вставить("Данные", "Клиенты");
		ИначеЕсли ТипЗнч(ОбъектОтбора) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			ПараметрыФормы.Вставить("Данные", "Интересы");
		КонецЕсли;
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.Форма.НастройкаВерсионирования", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


