
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров") Тогда
		
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
		
		//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
		ЭтаФорма.ТолькоАктуальные = Истина;
		
		Элементы.ТолькоАктуальные.Видимость = Истина;
		
		УстановитьОтборВСписке();
		//-- #1624 смарт: Фролов 21.02.2024
	Иначе
		
		МасСостояний = Новый Массив;
		
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Новый);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Распределен);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенНеУспешно);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенУспешно);
	
		Список.Параметры.УстановитьЗначениеПараметра("МасСостояний", МасСостояний);
		
	КонецЕсли;
	
	//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	УстановитьУсловноеОформление();
	
	//-- #1624 смарт: Фролов 16.02.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументсмартЛид", 
																		 "Документ.смартЛид КАК ДокументсмартЛид", 
																		 "ДокументсмартЛид.Ссылка КАК Ссылка,",
																		 "Список",
																		 ,
																		 Ложь,
																		 "Партнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

&НаКлиенте
//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура ТолькоАктуальныеПриИзменении(Элемент)
	
	УстановитьОтборВСписке();
	
КонецПроцедуры //-- #1624 смарт: Фролов 16.02.2024

//++ #1624 смарт: Фролов 16.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
&НаСервере
Процедура УстановитьОтборВСписке()
	
	МасСостояний = Новый Массив;
	
	Если ЭтаФорма.ТолькоАктуальные Тогда
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Новый);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Распределен);
	Иначе	
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Новый);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.Распределен);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенНеУспешно);
		МасСостояний.Добавить(Перечисления.смартСостоянияЛидов.ЗавершенУспешно);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("МасСостояний", МасСостояний);
	
КонецПроцедуры	//-- #1624 смарт: Фролов 16.02.2024

#Область СлужебныеПроцедурыИФункции

//++ #1624 смарт: Фролов 21.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
&НаСервере
Процедура УстановитьУсловноеОформление() 

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОбработки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(215, 240, 199));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаЭлементовОтбора.Использование = Истина;

	ЭлементУсловия = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОбработки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУсловия = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаКонтроля");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементУсловия.ПравоеЗначение = ТекущаяДата();
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 200, 200));
	
КонецПроцедуры //-- #1624 смарт: Фролов 21.02.2024

#КонецОбласти