
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заголовок = Объект.Наименование + НСтр("ru=' (Сценарий)';en=' (Script)'");
	Иначе
		Заголовок = НСтр("ru='Сценарий (создание)';en='Script (creation)'");
	КонецЕсли;

	ИдентификаторМетаданныхИнтерес = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.CRM_Интерес);
	СписокТиповУслуг.ЗагрузитьЗначения(Объект.ТипыУслуг.Выгрузить(, "ТипУслуги").ВыгрузитьКолонку("ТипУслуги"));
	СписокПодразделений.ЗагрузитьЗначения(Объект.Подразделения.Выгрузить(, "Подразделение").ВыгрузитьКолонку("Подразделение"));
	Элементы.ДекорацияНастройкаСценария.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	
	#Вставка
	//++ #Б-1184 смарт: Фролов 05.11.2024 //Добавить реквизиты в справочник "CRM_СостоянияИнтересов" 
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//-- #Б-1184 смарт: Фролов 05.11.2024
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти