
#Область ПеренесеноСДоработками

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура смарт_УстановитьУсловноеОформление()
	// Фролов+
	Элемент=УсловноеОформление.Элементы.Добавить();
	
	Поле=Элемент.Поля.Элементы.Добавить();
	Поле.Поле=Новый ПолеКомпоновкиДанных(Элементы.ТоварыСерия.Имя);
	
	Отбор=Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Объект.Товары.СерииИспользуются");
	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение=Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серия не указывается>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	// Фролов-
КонецПроцедуры

&НаСервере
&После("УстановитьОбязательныеПоляДанных")
Процедура смарт_УстановитьОбязательныеПоляДанных(СтруктураНастроек, ДобавитьШаблоны)
	// Фролов+
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда 
		СтруктураНастроек.ОбязательныеПоля.Добавить("Серия");
	КонецЕсли;	
	// Фролов-
КонецПроцедуры

&НаСервере
&Вместо("ПриИзмененииНоменклатуры")
Функция смарт_ПриИзмененииНоменклатуры(ТекущиеДанные)
	Результат = ПродолжитьВызов(ТекущиеДанные);
	// Фролов+ Добавляем признак использования Серии
	Результат.Вставить("СерииИспользуются",ТекущиеДанные.Номенклатура.ВидНоменклатуры.ИспользоватьСерии);
	// Фролов-
	Возврат Результат;
КонецФункции

#КонецОбласти


#Область ДоработкиСмарт

&НаКлиенте
Процедура смартУстановитьКоличествоПоОстаткам(Команда)
	смартУстановитьКоличествоПоОстаткамСервер();
КонецПроцедуры

&НаСервере
Процедура смартУстановитьКоличествоПоОстаткамСервер()
	Для Каждого Стр Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда 
			Остаток=Цел(Стр.ОстатокНаСкладе/СтрокуВЧисло(Стр.Характеристика.Наименование));
		Иначе
			Остаток=?(Стр.ОстатокНаСкладе%1,1,Стр.ОстатокНаСкладе);  // Если на остатке не целое число тогда Остаток = 1
		КонецЕсли;	

		Стр.КоличествоЭтикеток=Остаток;
	КонецЦикла;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СтрокуВЧисло(Стр)
	Попытка
		Возврат Число(Стр);
	Исключение
		Возврат 1;
	КонецПопытки;	
КонецФункции	

#КонецОбласти