#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("СтавкаНДСФискальнойОперации")
Функция смарт_СтавкаНДСФискальнойОперации(СтавкаНДС, ПрименяютсяРасчетныеСтавки)

	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
		Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка") Тогда
		Возврат Неопределено;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") И ПрименяютсяРасчетныеСтавки Тогда
		Возврат 120;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") И ПрименяютсяРасчетныеСтавки Тогда
		Возврат 118;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") И ПрименяютсяРасчетныеСтавки Тогда
		Возврат 110;
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105") И ПрименяютсяРасчетныеСтавки Тогда
		Возврат 105;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107") И ПрименяютсяРасчетныеСтавки Тогда
		Возврат 107;
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122") И ПрименяютсяРасчетныеСтавки Тогда
		Возврат 122;
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	Иначе
		Возврат ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС);
	КонецЕсли;

КонецФункции

#КонецОбласти