
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Ответственный = ЭтаФорма.Параметры.Ответственный;
	ЭтаФорма.ПредыдущийОтветственный = ЭтаФорма.Параметры.ПредыдущийОтветственный;
	
	ЗаполнитьСписокВыбораОтветственных();
	
	ЗаполнитьСписокВыбораПричинСменыОтветственного();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтветственных()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи 
	|ГДЕ
	|	НЕ Пользователь В
	|				(ВЫБРАТЬ
	|					Менеджер КАК Менеджер
	|				ИЗ
	|					РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних(, 
	|						ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент))
	|				ГДЕ
	|					ВыдачаЗаблокирована)	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь.Наименование");
	
	Элементы.Ответственный.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь"));
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокВыбораПричинСменыОтветственного()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартПричиныСменыОтветственных
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	Элементы.ПричинаСменыОтветственного.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.ВладелецФормы.Объект.Ответственный = ЭтаФорма.ПредыдущийОтветственный;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если ЭтаФорма.Ответственный <> ЭтаФорма.ПредыдущийОтветственный Тогда
		
		ЭтаФорма.ВладелецФормы.Объект.ПредыдущийОтветственный = ЭтаФорма.ПредыдущийОтветственный;
		ЭтаФорма.ВладелецФормы.Объект.Ответственный = ЭтаФорма.Ответственный;
		ЭтаФорма.ВладелецФормы.Объект.ПричинаСменыОтветственного = ЭтаФорма.ПричинаСменыОтветственного;
		
		ПодтверждениеСмены = Истина;
		
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ПодтверждениеСмены Тогда
		
		ЭтаФорма.ВладелецФормы.Объект.Ответственный = ЭтаФорма.ПредыдущийОтветственный;
		
	КонецЕсли;	
	
КонецПроцедуры
