
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст = "ВЫБРАТЬ
	|	АктивныеСеансыВидеофиксацииСрезПоследних.СервисИдентификации КАК СервисИдентификации,
	|	АктивныеСеансыВидеофиксацииСрезПоследних.АктивноеМероприятие КАК АктивноеМероприятие
	|ИЗ
	|	РегистрСведений.CRM_АктивныеСеансыВидеофиксации.СрезПоследних КАК АктивныеСеансыВидеофиксацииСрезПоследних
	|ГДЕ
	|	АктивныеСеансыВидеофиксацииСрезПоследних.СеансЗапущен";
	Выборка = ЗапросНастроек.Выполнить().Выбрать();
	УчетнаяЗаписьСервиса = Неопределено;
	ТекущееМероприятие = Неопределено;
	Если Выборка.Следующий() Тогда
		УчетнаяЗаписьСервиса = ?(Выборка.СервисИдентификации.Пустая(), Неопределено, Выборка.СервисИдентификации);	
		ТекущееМероприятие = ?(Выборка.АктивноеМероприятие.Пустая(), Неопределено, Выборка.АктивноеМероприятие);	
	КонецЕсли;
	Если ТекущееМероприятие = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдено активных мероприятий.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверитьЖурналПосещений", 1);
	Если НЕ ЗначениеЗаполнено(Объект.Мероприятие) Тогда
		ОткрытьФорму("Обработка.CRM_ЖурналПосещений.Форма.ФормаНастройки",,,ЭтотОбъект,,,Новый ОписаниеОповещения("НастроитьПараметрыЗакрытие", ЭтотОбъект, Новый Структура));
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьПараметры(Команда)
	//ОтключитьОбработчикОжидания("ПроверитьЖурналПосещений");
	ОткрытьФорму("Обработка.CRM_ЖурналПосещений.Форма.ФормаНастройки",,,ЭтотОбъект,,,Новый ОписаниеОповещения("НастроитьПараметрыЗакрытие", ЭтотОбъект, Новый Структура));
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПараметрыЗакрытие(Результат, ДопПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Результат);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьЖурналПосещений()
	ПроверитьЖурналПосещенийСервер();
КонецПроцедуры

&НаСервере
Процедура ПроверитьЖурналПосещенийСервер()
	Если Объект.Камера.Пустая() Тогда
		Возврат
	КонецЕсли;	
	////ЗапросНастроек = Новый Запрос;
	////ЗапросНастроек.Текст = "ВЫБРАТЬ
	////|	АктивныеСеансыВидеофиксацииСрезПоследних.СервисИдентификации КАК СервисИдентификации,
	////|	АктивныеСеансыВидеофиксацииСрезПоследних.АктивноеМероприятие КАК АктивноеМероприятие
	////|ИЗ
	////|	РегистрСведений.CRM_АктивныеСеансыВидеофиксации.СрезПоследних КАК АктивныеСеансыВидеофиксацииСрезПоследних
	////|ГДЕ
	////|	АктивныеСеансыВидеофиксацииСрезПоследних.СеансЗапущен";
	////Выборка = ЗапросНастроек.Выполнить().Выбрать();
	////ТекущееМероприятие = Неопределено;
	////Если Выборка.Следующий() Тогда
	////	ТекущееМероприятие = ?(Выборка.АктивноеМероприятие.Пустая(), Неопределено, Выборка.АктивноеМероприятие);	
	////КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	|	CRM_ЖурналПосещений.Клиент КАК Клиент,
	|	МАКСИМУМ(CRM_ЖурналПосещений.ДатаПосещения) КАК ДатаПосещения
	|ПОМЕСТИТЬ тмпТекущие
	|ИЗ
	|	РегистрСведений.CRM_ЖурналПосещений КАК CRM_ЖурналПосещений
	|ГДЕ
	|	CRM_ЖурналПосещений.Камера = &Камера
	|	И CRM_ЖурналПосещений.Мероприятие = &Мероприятие
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_ЖурналПосещений.Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПосещения УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_ЖурналПосещений.ДатаПосещения КАК ДатаПосещения,
	|	CRM_ЖурналПосещений.Камера КАК Камера,
	|	CRM_ЖурналПосещений.Клиент КАК Клиент,
	|	CRM_ЖурналПосещений.Клиент.Наименование КАК КлиентНаименование
	|ИЗ
	|	РегистрСведений.CRM_ЖурналПосещений КАК CRM_ЖурналПосещений
	|ГДЕ
	|	CRM_ЖурналПосещений.Клиент В
	|			(ВЫБРАТЬ
	|				тмпТекущие.Клиент
	|			ИЗ
	|				тмпТекущие КАК тмпТекущие)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПосещения УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ДатаПосещения)
	|ПО
	|	Клиент";
	Запрос.УстановитьПараметр("Камера", Объект.Камера);
	Запрос.УстановитьПараметр("Мероприятие", Объект.Мероприятие);

	ТабЖурнала = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТабЖурнала.Строки.Сортировать("ДатаПосещения Убыв");
	ТаблицаПосещений = Новый ТаблицаЗначений;
	ТаблицаПосещений.Колонки.Добавить("Партнер");
	ТаблицаПосещений.Колонки.Добавить("ОписаниеПосещений");
	ТаблицаПосещений.Колонки.Добавить("ПосетилПервыйРаз");
	ТаблицаПосещений.Колонки.Добавить("ПосетилВторойРаз");
	ТаблицаПосещений.Колонки.Добавить("КлиентЗарегистрирован");
	ТаблицаПосещений.Колонки.Добавить("ИнфоНадпись");

	СтрокаОписание = Объект.Мероприятие.CRM_КамерыВидеофиксации.Найти(Объект.Камера, "Камера");
	Для каждого Строка Из ТабЖурнала.Строки Цикл
		Стр = ТаблицаПосещений.Добавить();
		Стр.ПосетилПервыйРаз = Ложь;
		Стр.ПосетилВторойРаз = Ложь;
		Стр.Партнер = Строка.Клиент;
		ТабПосещений = Новый ТаблицаЗначений;
		ТабПосещений.Колонки.Добавить("ДатаСобытия");
		ТабПосещений.Колонки.Добавить("Место");
		Для Каждого СтрокаДата Из Строка.Строки Цикл
			СтрокаПосещения = ТабПосещений.Добавить();
			СтрокаПосещения.ДатаСобытия = СтрокаДата.ДатаПосещения;
			СтрокаПосещения.Место = СтрокаОписание.ОписаниеКамеры;
			Если Найти(СтрокаДата.КлиентНаименование, "Посетитель №") = 0 Тогда
				Стр.КлиентЗарегистрирован = Истина;
			Иначе
				Стр.КлиентЗарегистрирован = Ложь;
			КонецЕсли;	
			Если Строка.Строки.Количество() = 1 Тогда
				Стр.ПосетилПервыйРаз = Истина;
			Иначе
				Стр.ПосетилВторойРаз = Истина;
			КонецЕсли;	
			Если Стр.КлиентЗарегистрирован Тогда
				Если Стр.ПосетилПервыйРаз Тогда
					Стр.ИнфоНадпись = Объект.ИнфоНадписьПервоеПосещениеНеНовыйКлиент;
				Иначе
					Стр.ИнфоНадпись = Объект.ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент;
				КонецЕсли;	
			Иначе	   
				Если Стр.ПосетилПервыйРаз Тогда
					Стр.ИнфоНадпись = Объект.ИнфоНадписьПервоеПосещениеНовыйКлиент;
				Иначе
					Стр.ИнфоНадпись = Объект.ИнфоНадписьНеПервоеПосещениеНовыйКлиент;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	
		Стр.ОписаниеПосещений = ТабПосещений;
	КонецЦикла;
	Если ТаблицаПосещений.Количество()>0 Тогда 
		Фото1 =  ПоместитьВоВременноеХранилище(Новый Картинка(ТаблицаПосещений[0].Партнер.Фотография.Получить()));
		Партнер1 = ТаблицаПосещений[0].Партнер.Наименование;
		Организация1 = ТаблицаПосещений[0].Партнер.Организация;
		ДополнительноеОписание1 = ТаблицаПосещений[0].ИнфоНадпись;
				 
		Если ТаблицаПосещений[0].ОписаниеПосещений.Количество()>0 Тогда
			Посещение1Строка1Дата = Формат(ТаблицаПосещений[0].ОписаниеПосещений[0].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение1Строка1Место = ТаблицаПосещений[0].ОписаниеПосещений[0].Место;
		Иначе
			Посещение1Строка1Дата = "";
			Посещение1Строка1Место = "";
		КонецЕсли;	
		Если ТаблицаПосещений[0].ОписаниеПосещений.Количество()>1 Тогда
			Посещение1Строка2Дата = Формат(ТаблицаПосещений[0].ОписаниеПосещений[1].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение1Строка2Место = ТаблицаПосещений[0].ОписаниеПосещений[1].Место;
		Иначе
			Посещение1Строка2Дата = "";
			Посещение1Строка2Место = "";
		КонецЕсли;
		
		Если ТаблицаПосещений[0].ОписаниеПосещений.Количество()>2 Тогда
			Посещение1Строка3Дата = Формат(ТаблицаПосещений[0].ОписаниеПосещений[2].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение1Строка3Место = ТаблицаПосещений[0].ОписаниеПосещений[2].Место;
		Иначе
			Посещение1Строка3Дата = "";
			Посещение1Строка3Место = "";
		КонецЕсли;
		
		Если ТаблицаПосещений[0].ОписаниеПосещений.Количество()>3 Тогда
			Посещение1Строка4Дата = Формат(ТаблицаПосещений[0].ОписаниеПосещений[3].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение1Строка4Место = ТаблицаПосещений[0].ОписаниеПосещений[3].Место;
		Иначе
			Посещение1Строка4Дата = "";
			Посещение1Строка4Место = "";
		КонецЕсли;
		Если ТаблицаПосещений[0].ОписаниеПосещений.Количество()>4 Тогда
			Посещение1Строка5Дата = Формат(ТаблицаПосещений[0].ОписаниеПосещений[4].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение1Строка5Место = ТаблицаПосещений[0].ОписаниеПосещений[4].Место;
		Иначе
			Посещение1Строка5Дата = "";
			Посещение1Строка5Место = "";
		КонецЕсли;
	КонецЕсли;	
	Если ТаблицаПосещений.Количество()>1 Тогда
		Фото2 =  ПолучитьНавигационнуюСсылку(ТаблицаПосещений[1].Партнер, "Фотография");
		Партнер2 = ТаблицаПосещений[1].Партнер.Наименование;
		Организация2 = ТаблицаПосещений[1].Партнер.Организация;
		ДополнительноеОписание2 = ТаблицаПосещений[1].ИнфоНадпись;
		Если ТаблицаПосещений[1].ОписаниеПосещений.Количество()>0 Тогда
			Посещение2Строка1Дата = Формат(ТаблицаПосещений[1].ОписаниеПосещений[0].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение2Строка1Место = ТаблицаПосещений[1].ОписаниеПосещений[0].Место;
		Иначе
			Посещение2Строка1Дата = "";
			Посещение2Строка1Место = "";
		КонецЕсли;	
		Если ТаблицаПосещений[1].ОписаниеПосещений.Количество()>1 Тогда
			Посещение2Строка2Дата = Формат(ТаблицаПосещений[1].ОписаниеПосещений[1].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение2Строка2Место = ТаблицаПосещений[1].ОписаниеПосещений[1].Место;
		Иначе
			Посещение2Строка2Дата = "";
			Посещение2Строка2Место = "";
		КонецЕсли;
		
		Если ТаблицаПосещений[1].ОписаниеПосещений.Количество()>2 Тогда
			Посещение2Строка3Дата = Формат(ТаблицаПосещений[1].ОписаниеПосещений[2].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение2Строка3Место = ТаблицаПосещений[1].ОписаниеПосещений[2].Место;
		Иначе
			Посещение2Строка3Дата = "";
			Посещение2Строка3Место = "";
		КонецЕсли;
		
		Если ТаблицаПосещений[1].ОписаниеПосещений.Количество()>3 Тогда
			Посещение2Строка4Дата = Формат(ТаблицаПосещений[1].ОписаниеПосещений[3].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение2Строка4Место = ТаблицаПосещений[1].ОписаниеПосещений[3].Место;
		Иначе
			Посещение2Строка4Дата = "";
			Посещение2Строка4Место = "";
		КонецЕсли;
		Если ТаблицаПосещений[1].ОписаниеПосещений.Количество()>4 Тогда
			Посещение2Строка5Дата = Формат(ТаблицаПосещений[1].ОписаниеПосещений[4].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение2Строка5Место = ТаблицаПосещений[1].ОписаниеПосещений[4].Место;
		Иначе
			Посещение2Строка5Дата = "";
			Посещение2Строка5Место = "";
		КонецЕсли;

	КонецЕсли;	
	Если ТаблицаПосещений.Количество()>2 Тогда	
		Фото3 =  ПолучитьНавигационнуюСсылку(ТаблицаПосещений[2].Партнер, "Фотография");
		Партнер3 = ТаблицаПосещений[2].Партнер.Наименование;
		Организация3 = ТаблицаПосещений[2].Партнер.Организация;
		ДополнительноеОписание3 = ТаблицаПосещений[2].ИнфоНадпись;
		Если ТаблицаПосещений[2].ОписаниеПосещений.Количество()>0 Тогда
			Посещение3Строка1Дата = Формат(ТаблицаПосещений[2].ОписаниеПосещений[0].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение3Строка1Место = ТаблицаПосещений[2].ОписаниеПосещений[0].Место;
		Иначе
			Посещение3Строка1Дата = "";
			Посещение3Строка1Место = "";
		КонецЕсли;	
		Если ТаблицаПосещений[2].ОписаниеПосещений.Количество()>1 Тогда
			Посещение3Строка2Дата = Формат(ТаблицаПосещений[2].ОписаниеПосещений[1].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение3Строка2Место = ТаблицаПосещений[2].ОписаниеПосещений[1].Место;
		Иначе
			Посещение3Строка2Дата = "";
			Посещение3Строка2Место = "";
		КонецЕсли;
		
		Если ТаблицаПосещений[2].ОписаниеПосещений.Количество()>2 Тогда
			Посещение3Строка3Дата = Формат(ТаблицаПосещений[2].ОписаниеПосещений[2].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение3Строка3Место = ТаблицаПосещений[2].ОписаниеПосещений[2].Место;
		Иначе
			Посещение3Строка3Дата = "";
			Посещение3Строка3Место = "";
		КонецЕсли;
		
		Если ТаблицаПосещений[2].ОписаниеПосещений.Количество()>3 Тогда
			Посещение3Строка4Дата = Формат(ТаблицаПосещений[2].ОписаниеПосещений[3].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение3Строка4Место = ТаблицаПосещений[2].ОписаниеПосещений[3].Место;
		Иначе
			Посещение3Строка4Дата = "";
			Посещение3Строка4Место = "";
		КонецЕсли;
		Если ТаблицаПосещений[2].ОписаниеПосещений.Количество()>4 Тогда
			Посещение3Строка5Дата = Формат(ТаблицаПосещений[2].ОписаниеПосещений[4].ДатаСобытия, "ДФ='d MMM ЧЧ:mm'");
			Посещение3Строка5Место = ТаблицаПосещений[2].ОписаниеПосещений[4].Место;
		Иначе
			Посещение3Строка5Дата = "";
			Посещение3Строка5Место = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



