
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Элементы.Цвет.ЦветФона		= Новый Цвет(Объект.ЦветКрасный, Объект.ЦветЗеленый, Объект.ЦветСиний); 
		Элементы.Цвет.ЦветТекста	= CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(Элементы.Цвет.ЦветФона);
	Иначе
		Объект.ЦветИндекс			= 10;
		Объект.ЦветПредставление 	= НСтр("ru='Стальной';en='The steel'");
    	Объект.ЦветКрасный  		= 216;	
		Объект.ЦветЗеленый  		= 218; 
		Объект.ЦветСиний  			= 229;
		Элементы.Цвет.ЦветФона		= Новый Цвет(Объект.ЦветКрасный, Объект.ЦветЗеленый, Объект.ЦветСиний); 
		Элементы.Цвет.ЦветТекста	= CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(Элементы.Цвет.ЦветФона);
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" элемента формы "Цвет".
//
Процедура ЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ЦветИндекс);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы,Элемент,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" элемента формы "Цвет".
//
Процедура ЦветНачалоВыбораЗавершение(ВыбранныйЦвет, ДополнительныеПараметры) Экспорт
	Если НЕ (ВыбранныйЦвет = Неопределено) И НЕ (ВыбранныйЦвет = КодВозвратаДиалога.Отмена) Тогда
		Объект.ЦветПредставление 	= ВыбранныйЦвет[0].Представление;
		Объект.ЦветИндекс 			= ВыбранныйЦвет[0].Картинка;
		Объект.ЦветКрасный 			= ВыбранныйЦвет[0].Красный;
		Объект.ЦветЗеленый 			= ВыбранныйЦвет[0].Зеленый;
		Объект.ЦветСиний 			= ВыбранныйЦвет[0].Синий;
		Элементы.Цвет.ЦветФона 		= Новый Цвет(Объект.ЦветКрасный,Объект.ЦветЗеленый,Объект.ЦветСиний);
		Элементы.Цвет.ЦветТекста	= CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(Элементы.Цвет.ЦветФона);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Цвет".
//
Процедура ЦветПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры // ЦветПриИзменении()

#КонецОбласти



