
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ответственный = ЭтаФорма.Параметры.Ответственный;
	Партнер = ЭтаФорма.Параметры.Партнер;
	
	Если ТипЗнч(ЭтаФорма.Параметры.Причина) = Тип("СправочникСсылка.смартПричиныПереводаКлиентовВАрхив") Тогда
		ПричинаПеревода = ЭтаФорма.Параметры.Причина;
	Иначе	
		ПричинаПереводаТекстом = ЭтаФорма.Параметры.Причина;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач
	|ГДЕ
	|	РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.смартОтветственныйЗаСогласованиеСтатусаПартнера)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартПричиныПереводаКлиентовВАрхив
	|ГДЕ
	|	НЕ ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	МассивСогласователей = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("Исполнитель");
	
	СписокПричин.ЗагрузитьЗначения(МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	СписокСогласователей.ЗагрузитьЗначения(МассивСогласователей);
	
	Если НЕ МассивСогласователей.Найти(ПараметрыСеанса.ТекущийПользователь) = Неопределено Тогда
		
		Элементы.Подтвердить.Видимость = Истина;
		Элементы.Отклонить.Видимость = ЗначениеЗаполнено(ПричинаПереводаТекстом) ИЛИ ЗначениеЗаполнено(ПричинаПеревода);
		Элементы.ОтправитьНаСогласование.Видимость = Ложь;
		Элементы.ПеревестиКлиентаВАрхив.Видимость = Ложь;
		ПеревестиКлиентаВАрхив = Истина;
		
		Если ЗначениеЗаполнено(ПричинаПеревода) Тогда
			
			Для Каждого СтрПричины Из СписокПричин Цикл
				
				СтрПричины.Пометка = СтрПричины.Значение = ПричинаПеревода;	
				
			КонецЦикла;
			
		КонецЕсли;	
		
	Иначе	
		
		Если Партнер.смартОсновнойМенеджерСервисЦентра = ПараметрыСеанса.ТекущийПользователь Тогда
			
			Элементы.Подтвердить.Видимость = Ложь;
			Элементы.Отклонить.Видимость = Ложь;
			Элементы.ОтправитьНаСогласование.Видимость = Истина;
			
		Иначе
			
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.Подтвердить.Видимость = Ложь;
			Элементы.Отклонить.Видимость = Ложь;
			Элементы.ПеревестиКлиентаВАрхив.Видимость = Ложь;
			Элементы.ПричинаПереводаТекстом.ТолькоПросмотр = Истина;
			Элементы.ПричинаПеревода.ТолькоПросмотр = Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПеревестиКлиентаВАрхивПриИзменении(Элементы.ПеревестиКлиентаВАрхив);

КонецПроцедуры

&НаКлиенте
Процедура СписокПричинПриАктивизацииСтроки(Элемент)
	
	ПричинаПеревода = Элемент.ТекущиеДанные.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьНаСервере()

	НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партнер.Установить(Партнер);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		СтрокаНаборЗаписей = НаборЗаписей[0];
		
	Иначе
		
		СтрокаНаборЗаписей = НаборЗаписей.Добавить();
		СтрокаНаборЗаписей.Партнер = Партнер;
		
	КонецЕсли;	
	
	СтрокаНаборЗаписей.СостояниеСЦ = Перечисления.смартСостоянияПартнеров.Архивный;
	СтрокаНаборЗаписей.ДатаПереводаВАрхив = ?(ЗначениеЗаполнено(СтрокаНаборЗаписей.ДатаПереводаВАрхив),
		СтрокаНаборЗаписей.ДатаПереводаВАрхив, ТекущаяДата());
	СтрокаНаборЗаписей.ОтветственныйЗаПереводВАрхив = ?(ЗначениеЗаполнено(СтрокаНаборЗаписей.ОтветственныйЗаПереводВАрхив), 
		СтрокаНаборЗаписей.ОтветственныйЗаПереводВАрхив, ПараметрыСеанса.ТекущийПользователь);
	СтрокаНаборЗаписей.ПричинаПереводаКлиентовВАрхив = ПричинаПеревода;
	СтрокаНаборЗаписей.СогласованоПомещениеВАрхив = Истина;	
		
	НаборЗаписей.Записать(Истина);
	
	НайтиИЗакрытьЗадачиПоАрхивированию("Архивирование клиента подтверждено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПричинаПеревода) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена причина помещения в архив", , "ПричинаПеревода");
		
	Иначе	
	
		ПодтвердитьНаСервере();
		ЭтаФорма.Закрыть("Подтверждение");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партнер.Установить(Партнер);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		СтрокаНаборЗаписей = НаборЗаписей[0];
		
	Иначе
		
		СтрокаНаборЗаписей = НаборЗаписей.Добавить();
		СтрокаНаборЗаписей.Партнер = Партнер;
		
	КонецЕсли;	
	
	СтрокаНаборЗаписей.СостояниеСЦ = Перечисления.смартСостоянияПартнеров.Архивный;
	СтрокаНаборЗаписей.ДатаПереводаВАрхив = ТекущаяДата();
	СтрокаНаборЗаписей.ОтветственныйЗаПереводВАрхив = ПараметрыСеанса.ТекущийПользователь;
	СтрокаНаборЗаписей.ПричинаПереводаКлиентовВАрхив = ?(ПричинаПереводаТекстом = "", ПричинаПеревода, ПричинаПереводаТекстом);
		
	НаборЗаписей.Записать(Истина);
	
	Для Каждого СтрСписокСогласователей Из СписокСогласователей Цикл
		
		ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
		ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		ЗадачаОбъект.Исполнитель = СтрСписокСогласователей.Значение;
		ЗадачаОбъект.Предмет = Партнер.Ссылка;
		ЗадачаОбъект.ПредметСтрокой = Строка(Партнер);
		ЗадачаОбъект.CRM_Личная = Истина;
		ЗадачаОбъект.CRM_Партнер = Партнер.Ссылка;
		ЗадачаОбъект.Автор = Ответственный;
		ЗадачаОбъект.ДатаНачала = ТекущаяДата() + 300;
		ЗадачаОбъект.ПринятаКИсполнению = Истина;
		ЗадачаОбъект.СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
		ЗадачаОбъект.СрокИсполнения = ТекущаяДата() + 600;
		ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.СогласоватьОтправкуВАрхивКлиента;
		
		
		Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Необходимо согласовать перевод клиента в Архив:
		    |%1'"), Строка(Партнер));
		Описание = Описание + Символы.ПС + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Причина:
		    |%1'"), СтрокаНаборЗаписей.ПричинаПереводаКлиентовВАрхив);
		
		ЗадачаОбъект.Описание = Описание;
		ЗадачаОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Согласовать перевод клиента в архив %1'"), 
			Строка(Партнер));
		ЗадачаОбъект.Записать();
		
		НапоминанияПользователяСлужебный.смарт_ПодключитьПроизвольноеНапоминаниеПользователю(ЗадачаОбъект.Описание, 
			ТекущаяДатаСеанса(), 300, ЗадачаОбъект.Ссылка, ЗадачаОбъект.Наименование, СтрСписокСогласователей.Значение);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	ОтправитьНаСогласованиеНаСервере();
	ЭтаФорма.Закрыть("НаСоглласование");
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	
	НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партнер.Установить(Партнер);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		НаборЗаписей[0].СостояниеСЦ = Перечисления.смартСостоянияПартнеров.Свободен;
		НаборЗаписей[0].ДатаПереводаВАрхив = Неопределено;
		НаборЗаписей[0].ОтветственныйЗаПереводВАрхив = Неопределено;
		НаборЗаписей[0].СогласованоПомещениеВАрхив = Неопределено;
		НаборЗаписей[0].ПричинаПереводаКлиентовВАрхив = Неопределено;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
	НайтиИЗакрытьЗадачиПоАрхивированию("Архивирование клиента отклонено");
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьНаСервере();
	ЭтаФорма.Закрыть("Отклонение");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиКлиентаВАрхивПриИзменении(Элемент)
	
	Если ПеревестиКлиентаВАрхив Тогда
		
		Элементы.СписокПричин.Доступность = Истина;
		Элементы.ОтправитьНаСогласование.Доступность = Истина;
		Элементы.ПричинаПереводаТекстом.ТолькоПросмотр = Ложь;
		Элементы.ПричинаПеревода.ТолькоПросмотр = Ложь;
		
	Иначе
		
		Элементы.СписокПричин.Доступность = Ложь;
		Элементы.ОтправитьНаСогласование.Доступность = Ложь;
		Элементы.ПричинаПереводаТекстом.ТолькоПросмотр = Истина;
		Элементы.ПричинаПеревода.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПричинПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокПричин.ТекущиеДанные;
	Причина = ТекущиеДанные.Значение;
	
	Если ТекущиеДанные.Пометка Тогда
		
		ПричинаПеревода = Причина;
		ПричинаПереводаТекстом = "";
		
		Для Каждого СтрСписокПричин Из СписокПричин Цикл
			
			Если НЕ СтрСписокПричин.Значение = Причина Тогда
				
				СтрСписокПричин.Пометка = Ложь;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	Иначе
		
		ПричинаПеревода = Неопределено;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НайтиИЗакрытьЗадачиПоАрхивированию(РезультатВыполнения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя
	|ГДЕ
	|	смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.СогласоватьОтправкуВАрхивКлиента)
	|	И CRM_Партнер = &Партнер
	|	И НЕ Выполнена");
	Запрос.УстановитьПараметр("Партнер", Партнер.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадача = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗадача.Выполнена = Истина;
		ОбъектЗадача.РезультатВыполнения = РезультатВыполнения;
		ОбъектЗадача.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры	


