#Область ПеренесеноСДоработками

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 25.05.2021 17:56:56 Битрикс фильтры при включении в сегмент
&После("ДобавитьНоменклатуруВСегмент")
Процедура смарт_ДобавитьНоменклатуруВСегмент(Сегмент, Номенклатура, Характеристика)
	ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.ДобавлениеФильтровПоСегментам",Новый Структура("СсылкаСегмент,СсылкаНоменклатура,ВклУд",Сегмент,Номенклатура,Истина),ПараметрыВыполнения);
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 25.05.2021 17:56:56 Битрикс фильтры при исключении из сегмента
&После("УдалитьНоменклатуруИзСегмента")
Процедура смарт_УдалитьНоменклатуруИзСегмента(Сегмент, Номенклатура, Характеристика)
	ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.ДобавлениеФильтровПоСегментам",Новый Структура("СсылкаСегмент,СсылкаНоменклатура,ВклУд",Сегмент,Номенклатура,Ложь),ПараметрыВыполнения);
КонецПроцедуры

//++ смарт:Демичев №921 22.03.2022
Функция смарт_ПолучиьПартнеровСДопСведениемВИП()

	ПВХИД = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул","ВИПКлиент");
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК ЭлементСписка,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство И ДополнительныеСведения.Значение = Истина
	|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры";
	
	Запрос.УстановитьПараметр("Свойство", ПВХИД);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
//-- смарт:Демичев №921 22.03.2022

&ИзменениеИКонтроль("СписокЭлементовСКД")
Функция смарт_СписокЭлементовСКД(СегментСсылка)

	Настройки = ПолучитьНастройкиСписка(СегментСсылка);
	
	#Удаление
	Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки);
	#КонецУдаления
	
	#Вставка
	ТаблицаЗначенийСКД = ТаблицаСКД(Настройки.СКД, Настройки.Настройки);
	//++ смарт:Демичев №921 22.03.2022 //Принудительно добавляем условия Ручного ВИПа
   // ТаблицаСКД(Настройки.СКД, Настройки.Настройки);
	мСпрСегментВип = Справочники.смартПредопределенныеЗначения.СегментВИППартнеров.Значение;
	Если СегментСсылка <> Неопределено и ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыПартнеров") и мСпрСегментВип = СегментСсылка Тогда
				
		//КолонкаПартнер = ТаблицаЗначенийСКД.Колонки.Найти("Партнер");
		//Если КолонкаПартнер = Неопределено Тогда
		//	ТаблицаЗначенийСКД.Колонки.Добавить("Партнер");
		//КонецЕсли;
		
		ТаблицаЗначенийВИП = смарт_ПолучиьПартнеровСДопСведениемВИП();
		
		Для Каждого СтрокаВип из ТаблицаЗначенийВИП Цикл
			
			СтрокаСКД = ТаблицаЗначенийСКД.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСКД,СтрокаВип);
			
			КонецЦикла;
			
		ТаблицаЗначенийСКД.Свернуть("ЭлементСписка");
		
	КонецЕсли; 	 
	//Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки);
	//-- смарт:Демичев №921 22.03.2022   
	
	
	Возврат ТаблицаЗначенийСКД;
	#КонецВставки

КонецФункции

&ИзменениеИКонтроль("ПолучитьНастройкиСписка")
Функция смарт_ПолучитьНастройкиСписка(СегментСсылка)
	
	РеквизитыСКДСегмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СегментСсылка,
		"СхемаКомпоновкиДанных,ХранилищеНастроекКомпоновкиДанных,ИмяШаблонаСКД");
		
	НастройкиСегмента = РеквизитыСКДСегмента.ХранилищеНастроекКомпоновкиДанных.Получить();
		
	Если ПустаяСтрока(РеквизитыСКДСегмента.ИмяШаблонаСКД) Тогда
		
		СКД = РеквизитыСКДСегмента.СхемаКомпоновкиДанных.Получить();
		
	Иначе
		
		СКД_Макета = ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(СегментСсылка, РеквизитыСКДСегмента.ИмяШаблонаСКД);
		СКД = СКД_Макета.СхемаКомпоновкиДанных;
		
	КонецЕсли;
	
	// подключить поля запроса списка
	
	Если СКД.НаборыДанных.Найти("СписокСегмента") <> Неопределено Тогда
		
		Поля = СКД.НаборыДанных.СписокСегмента.Поля;
		Для Каждого Поле Из Поля Цикл
			Поле.ОграничениеИспользования.Поле = Ложь;
		КонецЦикла;//подключить поля запроса списка
		
		НастройкиСписка = СКД.ВариантыНастроек.Список.Настройки;
		Настройки = СКД.НастройкиПоУмолчанию;
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиСписка.ПараметрыДанных, Настройки.ПараметрыДанных);
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиСписка.Отбор, Настройки.Отбор);
		
	ИначеЕсли  СКД.НаборыДанных.Найти("ФормированиеСегмента") <> Неопределено Тогда
		
		Если НастройкиСегмента <> Неопределено Тогда
			
			НастройкиСписка = НастройкиСегмента;
			
		Иначе
			
			НастройкиСписка = СКД.ВариантыНастроек.ФормированиеСегмента.Настройки;
			
		КонецЕсли;
		
		#Вставка
		//++ смарт:Демичев №921 22.03.2022 
       //++ смарт:Подкин #921 30.03.2022 9:49:08 добавил проверку на СегментПартнера
        Если ТипЗнч(СегментСсылка) = Тип("СправочникСсылка.СегментыПартнеров") И СегментСсылка.смарт_ВычислятьПериод и Не ПустаяСтрока(СегментСсылка.смарт_ВычисляемыйКодПериод) Тогда
       //-- смарт:Подкин #921 30.03.2022 9:49:08
	
			мТекПараметрыДат = НастройкиСписка.ПараметрыДанных.Элементы.Найти("Период");	
			Если мТекПараметрыДат <> Неопределено Тогда
				
				мДатаНачала = мТекПараметрыДат.Значение.ДатаНачала;
				мДатаКонец = мТекПараметрыДат.Значение.ДатаОкончания;
				
				Выполнить(СегментСсылка.смарт_ВычисляемыйКодПериод);
				
				мТекПараметрыДат.Значение.ДатаНачала = мДатаНачала;
                мТекПараметрыДат.Значение.ДатаОкончания = мДатаКонец;

				
			КонецЕсли;
			
		КонецЕсли;		
		//-- смарт:Демичев №921 22.03.2022
		#КонецВставки
		
		НаборВыводСегмента = СКД.НаборыДанных.Найти("ВыводСегмента");
		Если НаборВыводСегмента <> Неопределено Тогда
			СКД.НаборыДанных.Удалить(НаборВыводСегмента);
		КонецЕсли;
		
		КомпоновщикНастроекПромежуточный = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекПромежуточный.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
		КомпоновщикНастроекПромежуточный.ЗагрузитьНастройки(НастройкиСписка);
		КомпоновщикНастроекПромежуточный.Восстановить();
		
		НастройкиСписка = КомпоновщикНастроекПромежуточный.Настройки;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Новый Структура("СКД, Настройки", СКД, НастройкиСписка);
	
КонецФункции

&ИзменениеИКонтроль("ВходитВСегмент")
Функция смарт_ВходитВСегмент(ОбъектСсылка, СегментСсылка, Характеристика, Динамический)

	Если Динамический Тогда

		Если НЕ ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;

		Настройки = ПолучитьНастройкиСписка(СегментСсылка);

		Если Настройки.СКД.НаборыДанных.Найти("ФормированиеСегмента") = Неопределено Тогда

			// установить отбор списка
			ЭлементОтбора = Настройки.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭлементСписка");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ОбъектСсылка;
			ЭлементОтбора.Использование  = Истина;

			Если Характеристика <> Неопределено Тогда
				ЭлементОтбора = Настройки.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ХарактеристикаЭлемента");
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = Характеристика;
				ЭлементОтбора.Использование  = Истина;
			КонецЕсли;

		Иначе

			ПоПартнеру = ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Партнеры");

			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
			Настройки.Настройки, 
			Новый ПолеКомпоновкиДанных(?(ПоПартнеру,"Партнер","Номенклатура")),
			ОбъектСсылка,,,
			Новый Структура("ЗаменятьСуществующий", Ложь));

			Если НЕ ПоПартнеру И Характеристика <> Неопределено Тогда
				КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
				Настройки.Настройки, 
				Новый ПолеКомпоновкиДанных("Характеристика"),
				Характеристика);
			КонецЕсли;

		КонецЕсли;

		Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки).Количество() > 0;

	Иначе

		Запрос = Новый Запрос;

		Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Номенклатура") Тогда

			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	НоменклатураСегмента.Номенклатура
			|ИЗ
			|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
			|ГДЕ
			|	НоменклатураСегмента.Сегмент = &СегментСсылка
			|	И НоменклатураСегмента.Номенклатура = &ОбъектСсылка
			|	И НоменклатураСегмента.Характеристика = &Характеристика";
			
			#Вставка
			//++ #Б4036 смарт: Шляпников 14.08.2025 / Оприходование з/ч без документов основания в 1С УТ РФ
			//исправляю типовую ошибку
			
			Если Характеристика = Неопределено Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураСегмента.Характеристика = &Характеристика", "");
			КонецЕсли;
			
			//-- #Б4036 смарт: Шляпников 14.08.2025
			#КонецВставки

		ИначеЕсли	ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Партнеры") Тогда

			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ПартнерыСегмента.Партнер
			|ИЗ
			|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
			|ГДЕ
			|	ПартнерыСегмента.Сегмент = &СегментСсылка
			|	И ПартнерыСегмента.Партнер = &ОбъектСсылка"; 

		Иначе

			Возврат Неопределено;

		КонецЕсли;

		Запрос.УстановитьПараметр("ОбъектСсылка",ОбъектСсылка);
		Запрос.УстановитьПараметр("СегментСсылка",СегментСсылка);
		Запрос.УстановитьПараметр("Характеристика",Характеристика);

		Возврат НЕ Запрос.Выполнить().Пустой();

	КонецЕсли;

КонецФункции

#КонецОбласти