
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВладелецШаблона = ПользователиКлиентСервер.ТекущийПользователь();
 	ФормаДок 		= Ложь;
	ИмяФормы 		= ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	
	Если Найти(ИмяФормы, "ФормаДокумента") ИЛИ Найти(ИмяФормы, "ФормаЭлемента")Тогда
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецШаблона,Объект,ТипФормы", ВладелецШаблона, ПараметрКоманды, "ФормаДокумента"));
	ИначеЕсли Найти(ИмяФормы,"ФормаСписка") ИЛИ Найти(ИмяФормы,"ФормаВыбора") Тогда
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецШаблона,Объект,ТипФормы", ВладелецШаблона, ПараметрКоманды, "ФормаСписка") );
	КонецЕсли;
	
	ОткрытьФорму("Справочник.CRM_ШаблоныОбъектов.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

