
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	#Вставка
	//++ #Б-2724 смарт: Фролов 24.03.2025 //Закрыть доступ к видимости личных данных в карточке физического лица
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	ПросмотрРазрешен = Пользователь.смартДоступныДанныеВнутреннихФизическихЛиц 
		И Пользователь.смартДоступныДанныеВнешнихФизическихЛиц;
	
	Если Не ПросмотрРазрешен Тогда 

		ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаИзменитьФорму.Видимость = Ложь;
	
	КонецЕсли;
	//-- #Б-2724 смарт: Фролов 24.03.2025
	#КонецВставки
	
КонецПроцедуры
