
//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&После("СформироватьДеревоРеквизитов")
Процедура extCRM_СформироватьДеревоРеквизитов(Дерево, МетаданныеОбъекта, ТекУровень, ЭтоТЧ)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МетаданныеОбъекта, "РеквизитыАдресации") Тогда
		Для каждого Реквизит из МетаданныеОбъекта.РеквизитыАдресации Цикл
			НовСтрРеквизит = Дерево.Строки.Добавить();
			НовСтрРеквизит.Реквизит = Реквизит.Имя;
			НовСтрРеквизит.Представление = Реквизит.Имя;
			
			Типы = Реквизит.Тип.Типы();
		
			Если Типы.Количество() = 1 И ОбщегоНазначения.ЭтоСсылка(Типы[0]) 
				И (ОбщегоНазначения.ЭтоДокумент(Метаданные.НайтиПоТипу(Типы[0])) ИЛИ ОбщегоНазначения.ЭтоСправочник(Метаданные.НайтиПоТипу(Типы[0]))) Тогда
				СформироватьДеревоРеквизитов(НовСтрРеквизит, Метаданные.НайтиПоТипу(Типы[0]), ТекУровень+1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Дерево.Строки.Сортировать("Представление", Истина);
	
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023
