
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Объект.Предопределенный Или Объект.ЗапретитьРедактированиеПользователем Тогда
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Родитель.ТолькоПросмотр     = Истина;
		Элементы.Тип.ТолькоПросмотр          = Истина;
		Элементы.ГруппаТипОбщиеДляВсех.ТолькоПросмотр = Объект.ЗапретитьРедактированиеПользователем;
	Иначе
		// Обработчик подсистемы запрета редактирования реквизитов объектов.
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов") Тогда
			МодульЗапретРедактированияРеквизитовОбъектов = ОбщегоНазначения.ОбщийМодуль("ЗапретРедактированияРеквизитовОбъектов");
			МодульЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект,, НСтр("ru='Разрешить редактирование типа и группы';en='Allow editing type and group'"));

		Иначе
			Элементы.Родитель.ТолькоПросмотр = Истина;
			Элементы.Тип.ТолькоПросмотр = Истина;

		КонецЕсли;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидРедактирования = "ПолеВводаИДиалог";
	КонецЕсли;

	СсылкаРодителя = Объект.Родитель;
	Элементы.ХранитьИсториюИзменений.Доступность         = Объект.ВидРедактирования = "Диалог";
	Элементы.РазрешитьВводНесколькихЗначений.Доступность = НЕ Объект.ХранитьИсториюИзменений;

	Если Не Объект.МожноИзменятьСпособРедактирования Тогда
		Элементы.ВидРедактирования.Доступность       = Ложь;
		Элементы.РазрешитьВводНесколькихЗначений.Доступность    = Ложь;
		Элементы.ГруппаНаименованиеНастройкиПоТипам.Доступность = Ложь;
		Элементы.ХранитьИсториюИзменений.Доступность    = Ложь;
	КонецЕсли;

	Элементы.ГруппаХранитьИсториюИзменений.Видимость = Ложь;

	Если Объект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
		ИЛИ НЕ СсылкаРодителя.Пустая()
		ИЛИ СсылкаРодителя.Уровень() = 0 Тогда
		ТабличнаяЧасть = Неопределено;
		Если СтрНачинаетсяС(СсылкаРодителя.ИмяПредопределенныхДанных, "Справочник") Тогда
			ИмяОбъекта = Сред(СсылкаРодителя.ИмяПредопределенныхДанных, 11);
			Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
				ТабличнаяЧасть = Метаданные.Справочники[ИмяОбъекта].ТабличныеЧасти.Найти("КонтактнаяИнформация");
			КонецЕсли;
		ИначеЕсли СтрНачинаетсяС(СсылкаРодителя.ИмяПредопределенныхДанных, "Документ") Тогда
			ИмяОбъекта = Сред(СсылкаРодителя.ИмяПредопределенныхДанных, 9);
			Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ТабличнаяЧасть = Метаданные.Документы[ИмяОбъекта].ТабличныеЧасти.Найти("КонтактнаяИнформация");
			КонецЕсли;
		КонецЕсли;

		Если ТабличнаяЧасть <> Неопределено Тогда
			Если ТабличнаяЧасть.Реквизиты.Найти("ДействуетС") <> Неопределено Тогда
				Элементы.ГруппаХранитьИсториюИзменений.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Метаданные.Обработки.Найти("РасширенныйВводКонтактнойИнформации") <> Неопределено
		И Метаданные.Обработки["РасширенныйВводКонтактнойИнформации"].Формы.Найти("НастройкиАдреса") <> Неопределено Тогда
		Элементы.ДополнительныеНастройкиАдреса.Видимость = Истина;
	Иначе
		Элементы.ДополнительныеНастройкиАдреса.Видимость = Ложь;
	КонецЕсли;

	ДоступныДополнительныеНастройкиАдреса = (Метаданные.Обработки.Найти("РасширенныйВводКонтактнойИнформации") <> Неопределено
	И Метаданные.Обработки["РасширенныйВводКонтактнойИнформации"].Формы.Найти("НастройкиАдреса") <> Неопределено);
	
	#Вставка
	//++ #1651 смарт: Ермаков 19.04.2024 / Телефония. Хранение истории контактной информации пользователей
	Если Объект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
		И Объект.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникПользователи Тогда
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартВнутреннийНомерТелефона", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаНаименованиеНастройкиПоТипам);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартВнутреннийНомерТелефона";
		
	КонецЕсли;
	//-- #1651 смарт: Ермаков 19.04.2024
	
	//++ #1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартОписание", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаОсновнаяИнформация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОписание";
	//-- #1776 смарт: Ермаков 19.04.2024
	
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти