 
 //++ Смарт:  Демичев Исправление ошибок 27.12.2021((
//&НаКлиенте
//&Вместо("ЗаголовокФайлаВыписки")
//Функция смарт_ЗаголовокФайлаВыписки(Счет)
//	
//	Если Счет = Неопределено Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	ТекстЗаголовка = "";
//	
//	ДанныеЗаголовкаВыписки  = "";
//	СписокСчетовВыписки     = "";
//	РасчетныеСчетаВыписки   = "";
//	
//	Если ТипЗнч(Счет.Выписка.ДанныеВыписки) = Тип("Структура") Тогда
//		
//		ДанныеВыписки = Счет.Выписка.ДанныеВыписки;
//		
//		Если ДанныеВыписки.Свойство("СписокСчетов", СписокСчетовВыписки) Тогда
//			
//			Если СписокСчетовВыписки.Найти(Счет.НомерСчета) = Неопределено Тогда
//				// Смарт Фролов+
//				Элементы.БанковскиеСчета.ТекущиеДанные.Пометка=Ложь;
//				Элементы.БанковскиеСчета.ТекущиеДанные.НастройкаОбмена="";
//				ОбщегоНазначенияКлиент.СообщитьПользователю("Не верно выбран файл загрузки (не совпадает Счет)",,"Объект.БанковскиеСчета["+Элементы.БанковскиеСчета.ТекущаяСтрока+"].Ссылка");
////				// Смарт Фролов-
//				ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru = '<Файл не содержит данных по банковскому счету %1 с номером %2>'"),
//					Строка(Счет.Ссылка),
//					Счет.НомерСчета);
//				Возврат ТекстЗаголовка;
//			КонецЕсли;
//		Иначе
//			Возврат НСтр("ru = '<Файл не содержит сведений о расчетных счетах>'");
//		КонецЕсли;
//		
//		Если ДанныеВыписки.Свойство("Заголовок", ДанныеЗаголовкаВыписки) Тогда
//			ТекстЗаголовка = "
//			|" + НСтр("ru = 'Отправитель'") + "              " + ДанныеЗаголовкаВыписки.Отправитель + "
//			|" + НСтр("ru = 'Дата создания'") + "            " + ДанныеЗаголовкаВыписки.ДатаСоздания + " " + ДанныеЗаголовкаВыписки.ВремяСоздания + "
//			|" + НСтр("ru = 'Начало периода'") + "           " + ДанныеЗаголовкаВыписки.ДатаНачала + "
//			|" + НСтр("ru = 'Окончание периода'") + "        " + ДанныеЗаголовкаВыписки.ДатаКонца + "
//			|";
//		КонецЕсли;
//		
//		Если ДанныеВыписки.Свойство("РасчетныеСчета", РасчетныеСчетаВыписки) Тогда
//			Для каждого РасчетныйСчет Из РасчетныеСчетаВыписки Цикл
//				Если РасчетныйСчет.РасчСчет = Счет.НомерСчета Тогда
//					ТекстЗаголовка = ТекстЗаголовка + "
//					|" + НСтр("ru = 'Расчетный счет'") + "           " + РасчетныйСчет.РасчСчет + "
//					|" + НСтр("ru = 'Начальный остаток'") + "        " + РасчетныйСчет.НачальныйОстаток + "
//					|" + НСтр("ru = 'Поступило'") + "                " + РасчетныйСчет.ВсегоПоступило + "
//					|" + НСтр("ru = 'Списано'") + "                  " + РасчетныйСчет.ВсегоСписано + "
//					|" + НСтр("ru = 'Конечный остаток'") + "         " + РасчетныйСчет.КонечныйОстаток + "%ПериодОстатков
//					|";
//					
//					ПериодОстатков = "";
//					Если Не ПустаяСтрока(РасчетныйСчет.ДатаНачала) И Не ПустаяСтрока(РасчетныйСчет.ДатаКонца) Тогда
//						Если РасчетныйСчет.ДатаНачала = РасчетныйСчет.ДатаКонца Тогда
//							ПериодОстатков = "
//					|" + НСтр("ru = 'За день'") + "                  " + РасчетныйСчет.ДатаНачала;
//						Иначе
//							ПериодОстатков = "
//					|" + НСтр("ru = 'За период'") + "                " + РасчетныйСчет.ДатаНачала + " - " + РасчетныйСчет.ДатаКонца;
//						КонецЕсли;
//					КонецЕсли;
//					
//					ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПериодОстатков", ПериодОстатков);
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат ТекстЗаголовка;
//		
//	//// Вставить содержимое метода.
//	//Результат = ПродолжитьВызов(Счет);
//	//Возврат Результат;
//КонецФункции
//-- Смарт:  Демичев Исправление ошибок 27.12.2021))

//&НаКлиенте
//&ИзменениеИКонтроль("ЗаголовокФайлаВыписки")
//Функция смарт_ЗаголовокФайлаВыписки(Счет)

//	Если Счет = Неопределено Тогда
//		Возврат "";
//	КонецЕсли;

//	ТекстЗаголовка = "";

//	ДанныеЗаголовкаВыписки  = "";
//	СписокСчетовВыписки     = "";
//	РасчетныеСчетаВыписки   = "";

//	Если ТипЗнч(Счет.Выписка.ДанныеВыписки) = Тип("Структура") Тогда

//		ДанныеВыписки = Счет.Выписка.ДанныеВыписки;

//		Если ДанныеВыписки.Свойство("СписокСчетов", СписокСчетовВыписки) Тогда

//			Если СписокСчетовВыписки.Найти(Счет.НомерСчета) = Неопределено Тогда
//				// Смарт Фролов+
//				Элементы.БанковскиеСчета.ТекущиеДанные.Пометка=Ложь;
//				Элементы.БанковскиеСчета.ТекущиеДанные.НастройкаОбмена="";
//				ОбщегоНазначенияКлиент.СообщитьПользователю("Не верно выбран файл загрузки (не совпадает Счет)",,"Объект.БанковскиеСчета["+Элементы.БанковскиеСчета.ТекущаяСтрока+"].Ссылка");
//				// Смарт Фролов-
//				ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru = '<Файл не содержит данных по банковскому счету %1 с номером %2>'"),
//				Строка(Счет.Ссылка),
//				Счет.НомерСчета);
//				Возврат ТекстЗаголовка;
//			КонецЕсли;
//		Иначе
//			Возврат НСтр("ru = '<Файл не содержит сведений о расчетных счетах>'");
//		КонецЕсли;

//		Если ДанныеВыписки.Свойство("Заголовок", ДанныеЗаголовкаВыписки) Тогда
//			ТекстЗаголовка = "
//			|" + НСтр("ru = 'Отправитель'") + "              " + ДанныеЗаголовкаВыписки.Отправитель + "
//			|" + НСтр("ru = 'Дата создания'") + "            " + ДанныеЗаголовкаВыписки.ДатаСоздания + " " + ДанныеЗаголовкаВыписки.ВремяСоздания + "
//			|" + НСтр("ru = 'Начало периода'") + "           " + ДанныеЗаголовкаВыписки.ДатаНачала + "
//			|" + НСтр("ru = 'Окончание периода'") + "        " + ДанныеЗаголовкаВыписки.ДатаКонца + "
//			|";
//		КонецЕсли;

//		Если ДанныеВыписки.Свойство("РасчетныеСчета", РасчетныеСчетаВыписки) Тогда
//			Для каждого РасчетныйСчет Из РасчетныеСчетаВыписки Цикл
//				Если РасчетныйСчет.РасчСчет = Счет.НомерСчета Тогда
//					ТекстЗаголовка = ТекстЗаголовка + "
//					|" + НСтр("ru = 'Расчетный счет'") + "           " + РасчетныйСчет.РасчСчет + "
//					|" + НСтр("ru = 'Начальный остаток'") + "        " + РасчетныйСчет.НачальныйОстаток + "
//					|" + НСтр("ru = 'Поступило'") + "                " + РасчетныйСчет.ВсегоПоступило + "
//					|" + НСтр("ru = 'Списано'") + "                  " + РасчетныйСчет.ВсегоСписано + "
//					|" + НСтр("ru = 'Конечный остаток'") + "         " + РасчетныйСчет.КонечныйОстаток + "%ПериодОстатков
//					|";

//					ПериодОстатков = "";
//					Если Не ПустаяСтрока(РасчетныйСчет.ДатаНачала) И Не ПустаяСтрока(РасчетныйСчет.ДатаКонца) Тогда
//						Если РасчетныйСчет.ДатаНачала = РасчетныйСчет.ДатаКонца Тогда
//							ПериодОстатков = "
//							|" + НСтр("ru = 'За день'") + "                  " + РасчетныйСчет.ДатаНачала;
//						Иначе
//							ПериодОстатков = "
//							|" + НСтр("ru = 'За период'") + "                " + РасчетныйСчет.ДатаНачала + " - " + РасчетныйСчет.ДатаКонца;
//						КонецЕсли;
//					КонецЕсли;

//					ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПериодОстатков", ПериодОстатков);
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;

//	Возврат ТекстЗаголовка;

//КонецФункции
