
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Параметры.Свойство("ПараметрыПрокси", ПараметрыПрокси);
	
	Если Параметры.Свойство("АдресWebhook") Тогда
		Объект.АдресWebhook = Параметры.АдресWebhook;
	КонецЕсли;
	
	Если Параметры.Свойство("СекретWebhook") Тогда
		Объект.СекретWebhook = Параметры.СекретWebhook;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Если ПроверитьЗаполнение() Тогда
		ПараметрыДоступа = Новый Структура;
		ПараметрыДоступа.Вставить("Токен", Объект.Токен);
		ПараметрыДоступа.Вставить("АдресWebhook", Объект.АдресWebhook);
		ПараметрыДоступа.Вставить("СекретWebhook", Объект.СекретWebhook);
		ПараметрыДоступа.Вставить("ИспользоватьWebhook", ЗначениеЗаполнено(Объект.АдресWebhook));
		Закрыть(ПараметрыДоступа);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	Попытка
		Если ЗначениеЗаполнено(Объект.Токен) Тогда
			ПроверитьПодключениеСервер();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='Connection was successful.';
				|ru='Подключение прошло успешно.'"));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Введите токен бота MAX'"));
		КонецЕсли;
	Исключение
		Инфо = ИнформацияОбОшибке();
		Описание = ?(Инфо.Причина = Неопределено, Инфо.Описание, Инфо.Причина.Описание);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Описание);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	Объект.Токен = СокрЛП(Объект.Токен);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеСервер()
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Токен", Объект.Токен);
	Обработки.CRM_РаботаСМессенджеромMAX.ПроверитьПодключение(ПараметрыПроверки, ПараметрыПрокси);
КонецПроцедуры

#КонецОбласти
