
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ПроверитьВозможностьПереходаБПИнтереса")
//++ #Б-1020 смарт: Фролов 01.10.2024 //Запретить перевод с этапа квалифицирован далее без указания товаров в тч товары
Функция смарт_ПроверитьВозможностьПереходаБПИнтереса(Знач Объект, ЗадачаИсполнителя, ВариантВыполнения)

	СледующееСостояниеИнтереса = CRM_БизнесПроцессыСервер.ПолучитьСледующееСостояниеОбъектаБП(ЗадачаИсполнителя, ВариантВыполнения);
	Если СледующееСостояниеИнтереса<>Неопределено Тогда
		ПереходНеВозможен = Ложь;

		ПроверяемыеРеквизитыИнтереса = CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПроверяемыеРеквизитыИнтересаВСостоянии(СледующееСостояниеИнтереса);
		Для каждого ПроверяемыйРеквизит из ПроверяемыеРеквизитыИнтереса Цикл
			Если ТипЗнч(ПроверяемыйРеквизит) = Тип("Строка") Тогда
				Если ПроверяемыйРеквизит = "Договор" И НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
					Продолжить;
				КонецЕсли;
				
				#Вставка
				//++ #Б-1020 смарт: Фролов 01.10.2024 //Запретить перевод с этапа квалифицирован далее без указания товаров в тч товары
				Если Константы.смартДатаНачалаКонтроляТоваровВИнтересе.Получить() < Объект.Дата Тогда
					
					Если ПроверяемыйРеквизит = "Товары" Тогда
						
						
						Если Объект.ТипУслуги=Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги И Объект.Товары.Итог("Сумма") = 0 Тогда
							
							//++ #Б-1198 смарт: Фролов 24.10.2024 //Исключение некоторых квалификаций из условий обязательного указания товаров в ТЧ товары
							Если ЗначениеЗаполнено(Объект.смартИтоговаяКвалификация) И НЕ Объект.смартИтоговаяКвалификация.НеПроверятьНаличиеТоваров Тогда
								
								ПереходНеВозможен = Истина;
								ОбщегоНазначения.СообщитьПользователю("Для перехода на этап обязательно укажите предлагаемое оборудование!");
								
							КонецЕсли;
							//-- #Б-1198 смарт: Фролов 24.10.2024
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЕсли;
				//-- #Б-1020 смарт: Фролов 01.10.2024
				#КонецВставки
				
				РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти(ПроверяемыйРеквизит);
				Если РеквизитМД<>Неопределено И НЕ ЗначениеЗаполнено(Объект[ПроверяемыйРеквизит]) Тогда
					ПереходНеВозможен = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не заполнен реквизит ""%1"". Запись документа невозможна!'"), РеквизитМД.Синоним), Объект.Ссылка,"Объект."+ПроверяемыйРеквизит,);
				КонецЕсли;
			Иначе
				СтрДопРеквизита = Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ПроверяемыйРеквизит));
				Если СтрДопРеквизита.Количество()=0 ИЛИ НЕ ЗначениеЗаполнено(СтрДопРеквизита[0].Значение) Тогда
					ПереходНеВозможен = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не заполнен дополнительный реквизит ""%1"". Запись документа невозможна!'"), ПроверяемыйРеквизит.Заголовок),
					Объект.Ссылка,"Объект."+ПроверяемыйРеквизит,);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Возврат Не ПереходНеВозможен;
	КонецЕсли;

	Возврат Истина;

КонецФункции //-- #Б-1020 смарт: Фролов 01.10.2024

#КонецОбласти
