
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектКамераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКамерыОкончание", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ФильтрКамер, ИсключатьСписок", ПолучитьМассивКамер(), Ложь);
	Открытьформу("Справочник.CRM_Камеры.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектМероприятиеПриИзменении(Элемент)
	ОбъектМероприятиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГиперссылкаЗаявкаНажатие(Элемент)
	
	Стр = Элементы.СписокПосетителей.ТекущиеДанные;
	Если Стр <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СозданиеЗаявкиОкончание", ЭтотОбъект);
		ПараметрыФормы = Новый Структура;
		Если ЗначениеЗаполнено(Заявка) Тогда
			ПараметрыФормы.Вставить("Ключ",	Стр.Ссылка);
			ОткрытьФорму("Документ.CRM_Заявка.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
		Иначе
			ПараметрыФормы.Вставить("ИсточникПолучения",		ИсточникПолучения);
			ПараметрыФормы.Вставить("Контакт",		Стр.Клиент);
			ПараметрыФормы.Вставить("Мероприятие",		Объект.Мероприятие);
			ОткрытьФорму("Документ.CRM_Заявка.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьЗарегистрированныхПриИзменении(Элемент)
	Элементы.ЗаполнитьИзРегистрации.Видимость = ОтображатьЗарегистрированных;
	Элементы.СписокЗарегистрированных.Видимость = ОтображатьЗарегистрированных;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПосетителей

&НаКлиенте
Процедура СписокПосетителейПриАктивизацииСтроки(Элемент)
	Стр = Элементы.СписокПосетителей.ТекущиеДанные;
	Если Стр <> Неопределено Тогда
		Фото1 =  ПолучитьНавигационнуюСсылку(Стр.Клиент, "Фотография");
		ПолучитьРеквизитыКлиента(Стр.Клиент);
		Заявка = Стр.Ссылка;
		Если ЗначениеЗаполнено(Заявка) Тогда
			Элементы.ДекорацияГиперссылкаЗаявка.Заголовок = "Заявка от "+Формат(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Заявка, "Дата"), "ДЛФ=DD");;
		Иначе
			Элементы.ДекорацияГиперссылкаЗаявка.Заголовок = "Создать заявку";
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПосетителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИзРегистрации(Команда)
	Стр = Элементы.СписокЗарегистрированных.ТекущаяСтрока;
	Если Стр <> Неопределено Тогда
    	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Стр);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьПосетителя(Команда)
	Стр = Элементы.СписокПосетителей.ТекущиеДанные;
	ЗарегистрироватьПосетителяНаСервере(Стр.Клиент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗарегистрироватьПосетителяНаСервере(ПотенциальныйКлиент)
	Об = ПотенциальныйКлиент.получитьОбъект();
	Об.Наименование = Фио;
	//Об.НомерАнкеты = НомерАнкеты;
	Об.Организация = Организация;
	//Об.ПосетилСеминар = ПосетилСеминар;
	//Об.ВыслатьПинКодCRM = ВыслатьПинКодCRM;
	//Об.ВыслатьПинКодCRMУТ = ВыслатьПинКодCRMУТ;

	Стр = Об.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон,"Тип");
	Если Стр = Неопределено Тогда
		Стр = Об.КонтактнаяИнформация.Добавить();
	КонецЕсли;	
	Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Стр.Вид = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
	Стр.Представление = Телефон;
	Стр.НомерТелефона = Телефон;
	
	Стр = Об.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
	Если Стр = Неопределено Тогда
		Стр = Об.КонтактнаяИнформация.Добавить();
	КонецЕсли;	
	Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Стр.Вид = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
	Стр.АдресЭП = EMail;
	Стр.Представление = EMail;
	Об.Записать();
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыКлиента(ПотенциальныйКлиент)
	Фио = ПотенциальныйКлиент;
	//ВыслатьПинКодCRM = ПотенциальныйКлиент.ВыслатьПинКодCRM;
	//ВыслатьПинКодCRMУТ = ПотенциальныйКлиент.ВыслатьПинКодCRMУТ;
	//НомерАнкеты = ПотенциальныйКлиент.НомерАнкеты;
	//ПосетилСеминар = ПотенциальныйКлиент.ПосетилСеминар;
	Организация = ПотенциальныйКлиент.Организация;
	Стр = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон,"Тип");
	Если Стр <> Неопределено Тогда
		Телефон = Стр.Представление;
	Иначе
		Телефон = "";
	КонецЕсли;
	Стр = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
	Если Стр <> Неопределено Тогда
		EMail = Стр.Представление;
	Иначе
		EMail = "";	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокПосетителей, "Камера", Объект.Камера, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокПосетителей, "Мероприятие", Объект.Мероприятие, Истина);
	//Элементы.ЗаполнитьИзРегистрации.Видимость = ОтображатьЗарегистрированных;
	//Элементы.СписокЗарегистрированных.Видимость = ОтображатьЗарегистрированных;

КонецПроцедуры

&НаКлиенте
Процедура ВыборКамерыОкончание(ДанныеВыбора, ДопПараметры) Экспорт
	Объект.Камера = ДанныеВыбора;	
	УстановитьОтборы();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКамер()
	Возврат Объект.Мероприятие.CRM_КамерыВидеофиксации.Выгрузить().ВыгрузитьКолонку("Камера");
КонецФункции

&НаСервере
Процедура ОбъектМероприятиеПриИзмененииНаСервере()
	УстановитьОтборы();
	ИсточникПолучения = Объект.Мероприятие.CRM_ИсточникПолученияЛидов;
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЗаявкиОкончание(ДанныеВыбора, ДопПараметры) Экспорт
	//Элементы.СписокПосетителей.Обновить();
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		Элементы.ДекорацияГиперссылкаЗаявка.Заголовок = "Заявка от "+Формат(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ДанныеВыбора, "Дата"), "ДЛФ=DD");
	Иначе
		Элементы.ДекорацияГиперссылкаЗаявка.Заголовок = "Создать заявку";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти




