#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создадим запрос инициализации движений
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаУсловияДополнительнойГарантии(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры 

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата 						КАК Период
	|ИЗ
	|	Документ.смартУстановкаУсловийДополнительнойГарантии КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";	
	Реквизиты = Запрос.Выполнить().Выгрузить();
		
	Для Каждого Колонка Из Реквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[0][Колонка.Имя]);
	КонецЦикла;
	
КонецПроцедуры 

Функция ТекстЗапросаТаблицаУсловияДополнительнойГарантии(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартУсловияДополнительнойГарантии";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	Таблица.Оборудование КАК Оборудование,
	|	Таблица.СрокГарантииНаОборудование КАК СрокГарантииНаОборудование,
	|	Таблица.СрокГарантииНаГоловку КАК СрокГарантииНаГоловку,
	|	Таблица.СтоимостьДопГарантииНаПервомЭтапе КАК СтоимостьДопГарантииНаПервомЭтапе,
	|	Таблица.СтоимостьДопГарантииНаВторомЭтапе КАК СтоимостьДопГарантииНаВторомЭтапе,
	|	Таблица.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
	|	Таблица.ДатаОкончанияДействияУсловий КАК ДатаОкончанияДействияУсловий
	|ИЗ
	|	Документ.смартУстановкаУсловийДополнительнойГарантии.СписокОборудования КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И НЕ Таблица.Недействителен";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

#КонецОбласти 

#КонецОбласти

#КонецЕсли