////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры обеспечения формирования бухгалтерских отчетов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при создании формы отчета на сервере для возможности дополнительной настройки.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт

	УстановитьНастройкиПоУмолчанию(Форма);
	
	ПолеОформления = Форма.Элементы.Найти("КонтрагентДляОтбора");
	Если ПолеОформления <> Неопределено Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПередачиТоваровМеждуОрганизациями") Тогда
			Если Форма.Отчет.КонтрагентДляОтбора = Неопределено Тогда
				Форма.Отчет.КонтрагентДляОтбора = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(Новый ПараметрВыбора("ВыборКонтрагентовИОрганизаций", Истина));
			ПолеОформления.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
 		Иначе
			ПолеОформления.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
			ПолеОформления.ВыбиратьТип = Ложь;
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры

// Вызывается при установке настроек по умолчанию для формы отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура УстановитьНастройкиПоУмолчанию(Форма) Экспорт

	ЭлементГруппаБыстрыеОтборы = Форма.Элементы.Найти("ГруппаБыстрыеОтборы");
	Если ЭлементГруппаБыстрыеОтборы <> Неопределено Тогда
		ЭлементГруппаБыстрыеОтборы.ЦветФона = Новый Цвет();
	КонецЕсли;

КонецПроцедуры

// Выполняет установку макета оформления для отчета.
//
// Параметры:
//	ПараметрыОтчета - Структура - передается из формы отчета при запуске фонового задания отчета.
//		Может содержать ключ:
//			* МакетОформления - Строка - Название макета оформления.
//	НастройкаКомпоновкиДанных - НастройкиКомпоновкиДанных - Настройки, которые будут использоваться для отчета. 
//	СтандартнаяОбработка - Булево - Если установить внутри процедуры в Ложь, то стандартная обработка не будет выполняться.
//
Процедура УстановитьМакетОформленияОтчета(ПараметрыОтчета, НастройкаКомпоновкиДанных, СтандартнаяОбработка) Экспорт
	Перем МакетОформления;
	
	Если ПараметрыОтчета.Свойство("МакетОформления", МакетОформления)
	   И ЗначениеЗаполнено(МакетОформления) Тогда
	   
		ПараметрыРежимаВыгрузки = Неопределено;
		Если ПараметрыОтчета.Свойство("ПараметрыРежимаВыгрузки", ПараметрыРежимаВыгрузки)
			И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРежимаВыгрузки, "ПереопределятьМакетОформления", Истина) = Ложь
		 Или МакетОформления <> "МакетОформленияОтчетовЗеленый"
			И МакетОформления <> "ОформлениеОтчетовЗеленый" Тогда
			// В отчете выбран конкретный макет оформления, его не меняем.
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	МакетОформления = "ОформлениеОтчетовБежевый";
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметрВывода(НастройкаКомпоновкиДанных, "МакетОформления", МакетОформления);	
	
КонецПроцедуры

// Позволяет ограничить суммовые показатели справки-расчета.
//
// Параметры:
//   ПоддерживаемыеНаборы - см. СправкиРасчетыКлиентСервер.ВсеНаборыСуммовыхПоказателей - 
//
// Возвращаемое значение:
//   см. СправкиРасчетыКлиентСервер.ВсеНаборыСуммовыхПоказателей - 
//
Функция РазрешенныеНаборыСуммовыхПоказателей(ПоддерживаемыеНаборы) Экспорт
	
	Возврат ПоддерживаемыеНаборы;
	
КонецФункции

// Добавляет к структуре параметров ключи, специфичные для данного отчета.
//
// Параметры:
//  ПараметрыОтчета - см. ЗаполнениеФинОтчетностиВБанки.ПустыеПараметрыОтчетаВедомостьАмортизацииОС()
//
Процедура ПустыеПараметрыОтчетаВедомостьАмортизацииОС(ПараметрыОтчета) Экспорт
КонецПроцедуры

// Добавляет к структуре параметров ключи, специфичные для данного отчета.
//
// Параметры:
//  ПараметрыОтчета - см. ЗаполнениеФинОтчетностиВБанки.ПустыеПараметрыОтчетаВаловаяПрибыль()
//
Процедура ПустыеПараметрыОтчетаВаловаяПрибыль(ПараметрыОтчета) Экспорт

	ПараметрыОтчета.ИдентификаторОтчета = "ВыручкаИСебестоимостьПродаж";

КонецПроцедуры

// Заполняет настройки СКД на основе настроек, переданных в структуре.
//
// Параметры:
//   КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - из настраиваемого отчета.
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - в ДополнительныеСвойства содержат параметры настройки.
//
// См. реализацию процедуры ПриЗагрузкеПользовательскихНастроекНаСервере() в модуле объекта отчета, вызываемую согласно
// настройкам из ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию()
//
Процедура ПриЗагрузкеПользовательскихНастроек(Отчет, НовыеПользовательскиеНастройкиКД, КомпоновщикНастроек) Экспорт


КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - из настраиваемого отчета.
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - в ДополнительныеСвойства содержат параметры настройки.
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//
// См. реализацию процедуры ПриЗагрузкеПользовательскихНастроекНаСервере() в модуле объекта отчета, вызываемую согласно
// настройкам из ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию()
//
Процедура ПриЗагрузкеПользовательскихНастроекНастройкаФормы(Форма, НовыеПользовательскиеНастройкиКД, КомпоновщикНастроек) Экспорт


КонецПроцедуры

// Формирует представление для списка активных отборов в отчете.
//
// Параметры:
//  ПараметрыОтчета - Структура - может содержать свойство "Подразделение".
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - источник отборов.
//  СтандартнаяОбработка - Булево - возвращаемое значение. Если Ложь, то ТекстОтбор считается заполненным.
//  ТекстОтбор   - возвращаемое значение. Представление отборов.
//
Процедура ОписаниеОтборовОтчета(ПараметрыОтчета, КомпоновщикНастроек, СтандартнаяОбработка, ТекстОтбор) Экспорт


КонецПроцедуры

// Дополняет список счетов учета товаров.
//
// Параметры:
//  СчетаУчетаТоваров - Массив из ПланСчетовСсылка.Хозрасчетный - счета и субсчета учета товаров.
//
Процедура СчетаУчетаТоваров(СчетаУчетаТоваров) Экспорт


КонецПроцедуры


Процедура УдалитьСсылкуНаСправкуИзОписанияФорматированнойСтроки(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИдентификаторЗаданияАктуализации")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "АдресХранилищаАктуализации") Тогда
		
		БухгалтерскиеОтчеты.УдалитьСсылкуНаСправкуИзОписанияФорматированнойСтроки(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из обработчика события "ПриЗагрузкеПользовательскихНастроекНаСервере" формы отчета.
//
// Параметры:
//	ФормаОтчета   - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ПроверитьАктуальность(ФормаОтчета) Экспорт

	ПараметрыПроверки = БухгалтерскиеОтчетыКлиентСервер.ИнициализироватьПараметрыПроверкиАктуальности(ФормаОтчета);
	ДанныеАктуализации = Новый Структура("ИдентификаторЗаданияАктуализации,АдресХранилищаАктуализации", "", "");
	ЗаполнитьЗначенияСвойств(ДанныеАктуализации, ФормаОтчета);
		
	БухгалтерскиеОтчеты.ПроверитьАктуальность(ПараметрыПроверки, ДанныеАктуализации);
	ЗаполнитьЗначенияСвойств(ФормаОтчета, ДанныеАктуализации);

КонецПроцедуры

Процедура ДополнительныеПараметрыОтчета(ПараметрыОтчета, Отчет, НеДобавлятьРазницу = Ложь) Экспорт
	
	
КонецПроцедуры

Процедура ДобавитьДополнительныеГруппировки(Отчет) Экспорт
	
	Если БухгалтерскийУчетПереопределяемый.ИспользоватьНаправленияДеятельности() Тогда
		НоваяСтрока = Отчет.Группировка.Добавить();
		НоваяСтрока.Поле           = "НаправлениеДеятельности";
		НоваяСтрока.Использование  = Ложь;
		НоваяСтрока.Представление  = НСтр("ru = 'Направление деятельности'");
		НоваяСтрока.ТипГруппировки = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеОтборы(Отчет) Экспорт
	
	Если БухгалтерскийУчетПереопределяемый.ИспользоватьНаправленияДеятельности() Тогда
		
		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("НаправлениеДеятельности"));
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(Отчет.КомпоновщикНастроек, "НаправлениеДеятельности", Поле.Тип.ПривестиЗначение(Неопределено), , Ложь); 
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОпределениеВидаСуммыОтчета(Отчет, ВидСуммыФормированияОтчета) Экспорт
	
	// Определим сумму, по которой формируется отчет:
	Отчет.ПоказательБУ = (ВидСуммыФормированияОтчета = 0);
	Отчет.ПоказательУУ = (ВидСуммыФормированияОтчета = 1);
	Отчет.ПоказательФО = (ВидСуммыФормированияОтчета = 2);
	
КонецПроцедуры

Процедура ДобавитьВидСуммОтчета(СписокВидовСуммОтчета) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

