
#Область Интерфейс

Процедура ЗаполнитьНастройкиОбработки() Экспорт
	
	СЗНомеровСекретаря.ЗагрузитьЗначения(Справочники.смартПредопределенныеЗначения.Настройки.НомераСекретарей.ВыгрузитьКолонку("НомерТелефона"));
	
КонецПроцедуры

Процедура ПолучитьИсториюЗвонков(СтруктураПараметров, АдресРезультата = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
		СтруктураПараметров.ДатаНачала = НачалоДня(ТекущаяДата());
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
		СтруктураПараметров.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;	

	Звонки.Очистить();

	Если СтруктураПараметров.АТС = ""
		ИЛИ СтруктураПараметров.АТС = Справочники.смартВидыАТС.Мегафон
		ИЛИ СтруктураПараметров.АТС = Справочники.смартВидыАТС.МегафонКовчег
		Тогда

		// Мегафон
		ПользователиАТС.Очистить();

		Если СтруктураПараметров.Организация = "" Тогда

			МегафонПолучитьИсториюЗвонковНаСервере(СтруктураПараметров, Справочники.смартВидыАТС.Мегафон);
			МегафонПолучитьИсториюЗвонковНаСервере(СтруктураПараметров, Справочники.смартВидыАТС.МегафонКовчег);
			
			ПолучитьПользователейВАТСНаСервере(СтруктураПараметров, Справочники.смартВидыАТС.Мегафон);
			ПолучитьПользователейВАТСНаСервере(СтруктураПараметров, Справочники.смартВидыАТС.МегафонКовчег);
			
		Иначе	
			
			МегафонПолучитьИсториюЗвонковНаСервере(СтруктураПараметров, СтруктураПараметров.АТС);
			ПолучитьПользователейВАТСНаСервере(СтруктураПараметров, СтруктураПараметров.АТС);
			
		КонецЕсли;

	КонецЕсли;
	
	Если СтруктураПараметров.АТС = "" 
		ИЛИ СтруктураПараметров.АТС = Справочники.смартВидыАТС.Asterisk 
		Тогда

		// Asterisk
		AsteriskПолучитьИсториюЗаПериодНаСервере(СтруктураПараметров, Справочники.смартВидыАТС.Asterisk);

	КонецЕсли;
	
	Если Звонки.Количество() > 0 Тогда
		
		ОпределитьАбонентовВИсторииЗвонков(Звонки.Выгрузить(), ПользователиАТС.Выгрузить(), СтруктураПараметров);
	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область РаботаСоЗвонками

Процедура ОпределитьАбонентовВИсторииЗвонков(ТаблицаЗвонки, ПользователиАТС, СтруктураПараметров)
	
	Запрос = Новый Запрос;

	// Установка значений параметров
	Запрос.УстановитьПараметр("ТекущаяДата", 	 	 ТекущаяДата());
	Запрос.УстановитьПараметр("ТаблицаЗвонки",   	 ТаблицаЗвонки);
	Запрос.УстановитьПараметр("ПользователиАТС", 	 ПользователиАТС);
	Запрос.УстановитьПараметр("НомерТелефонаФильтр", СтруктураПараметров.НомерТелефона);
	Запрос.УстановитьПараметр("ТолькоНеСозданные",   СтруктураПараметров.ТолькоНеСозданные);

	ЗаполнитьНастройкиОбработки();
	
	Если СЗНомеровСекретаря.Количество() > 0 Тогда
		
		МассивНомеровСекретаря = СЗНомеровСекретаря.ВыгрузитьЗначения();
		
	Иначе		
														  
		МассивНомеровСекретаря = Новый Массив;
		МассивНомеровСекретаря.Добавить("101");
		МассивНомеровСекретаря.Добавить("108");
		МассивНомеровСекретаря.Добавить("262");
		МассивНомеровСекретаря.Добавить("263");
		МассивНомеровСекретаря.Добавить("300");
		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("МассивНомеровСекретаря", МассивНомеровСекретаря);
	Запрос.УстановитьПараметр("ПользовательСекретарь",  Справочники.Пользователи.ПолучитьСсылку(
														    Новый УникальныйИдентификатор("2AD3C3C6-0C04-11E8-BA91-000C2952BB0F"))); // Секретарь

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка
	|ПОМЕСТИТЬ ПартнерыСПометкойУдаления 
	|ИЗ	
	|	Справочник.Партнеры
	|ГДЕ
	|	ПометкаУдаления
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Данные.Ссылка.Владелец КАК Абонент,
	|	Данные.НомерТелефона
	|ПОМЕСТИТЬ ВТ_ТелефоныКлиентов
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Данные
	|ГДЕ
	|	Данные.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И НЕ Данные.Ссылка.Владелец В (ВЫБРАТЬ Ссылка ИЗ ПартнерыСПометкойУдаления)
	|	И НЕ Данные.НомерТелефона = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Данные.Ссылка,
	|	Данные.НомерТелефона
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК Данные
	|ГДЕ
	|	Данные.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И НЕ Данные.Ссылка В (ВЫБРАТЬ Ссылка ИЗ ПартнерыСПометкойУдаления)
	|	И НЕ Данные.НомерТелефона = """"
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Данные.Ссылка.Партнер,
	|	Данные.НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК Данные
	|ГДЕ
	|	Данные.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И НЕ Данные.Ссылка.Партнер В (ВЫБРАТЬ Ссылка ИЗ ПартнерыСПометкойУдаления)
	|	И НЕ Данные.НомерТелефона = """"
	|
	|;
	|		
	|ВЫБРАТЬ
	|	Абонент,
	|	СОКРЛП(
	|		СТРЗАМЕНИТЬ(
	|			СТРЗАМЕНИТЬ(
	|				СТРЗАМЕНИТЬ(
	|					СТРЗАМЕНИТЬ(
	|						СТРЗАМЕНИТЬ(
	|							СТРЗАМЕНИТЬ(
	|								СТРЗАМЕНИТЬ( 
	|									СТРЗАМЕНИТЬ(
	|										СТРЗАМЕНИТЬ(
	|											СТРЗАМЕНИТЬ(
	|												СТРЗАМЕНИТЬ(
	|													СТРЗАМЕНИТЬ(
	|														НомерТелефона
	|													, ""/"", """")
	|												, "" "", """")
	|											, "";"", """")
	|										, ""	"", """")
	|									, ""."", """")
	|								, "":"", """")
	|							, ""–"", """")
	|						, "" "", """")
	|					, ""-"", """")
	|				, ""("", """")
	|			, "")"", """")
	|		, ""+"", """")
	|	) КАК НомерТелефона
	|	
	|ПОМЕСТИТЬ ДанныеФорматировнные
	|ИЗ
	|	ВТ_ТелефоныКлиентов	
	|;
	|		
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Данные.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА (ДЛИНАСТРОКИ(Данные.НомерТелефона) = 11 И ПОДСТРОКА(Данные.НомерТелефона, 1, 1) = ""8"")
	|			ТОГДА ""7"" + ПОДСТРОКА(Данные.НомерТелефона, 2, 10)
	|		КОГДА ДЛИНАСТРОКИ(Данные.НомерТелефона) = 10
	|			ТОГДА ""7"" + Данные.НомерТелефона
	|		ИНАЧЕ Данные.НомерТелефона
	|	КОНЕЦ КАК НомерТелефона
	|ПОМЕСТИТЬ ЧистыеДанные	
	|ИЗ
	|	ДанныеФорматировнные КАК Данные
	|ГДЕ
	|	(
	|		(
	|			ДЛИНАСТРОКИ(Данные.НомерТелефона) = 11 
	|			И ПОДСТРОКА(Данные.НомерТелефона, 11, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|			И
	|			(
	|				ПОДСТРОКА(Данные.НомерТелефона, 1, 1) = ""7""
	|				ИЛИ ПОДСТРОКА(Данные.НомерТелефона, 1, 1) = ""8""
	|			)
	|		)
	|		ИЛИ
	|		(
	|			ДЛИНАСТРОКИ(Данные.НомерТелефона) = 10
	|			И ПОДСТРОКА(Данные.НомерТелефона, 1, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|		)
	|	)
	|	И ПОДСТРОКА(Данные.НомерТелефона, 2, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 3, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 4, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 5, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 6, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 7, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 8, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 9, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И ПОДСТРОКА(Данные.НомерТелефона, 10, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|;
	|		
	|ВЫБРАТЬ
	|	НомерТелефона, КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Абонент) КАК КоличествоДублей
	|ПОМЕСТИТЬ НомераТелефоновБолееОдногоПартнера
	|ИЗ
	|	ЧистыеДанные
	|СГРУППИРОВАТЬ ПО
	|	НомерТелефона
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Абонент) > 1
	|;
	|		
	|ВЫБРАТЬ
	|	Абонент, НомерТелефона, 1 КАК КоличествоДублей
	|ПОМЕСТИТЬ ПартнерыНомераТелефонов
	|ИЗ
	|	ЧистыеДанные
	|ГДЕ
	|	НЕ НомерТелефона В (ВЫБРАТЬ НомерТелефона ИЗ НомераТелефоновБолееОдногоПартнера)
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО, НомерТелефона, КоличествоДублей
	|ИЗ
	|	НомераТелефоновБолееОдногоПартнера
	|;
	|		
	|УНИЧТОЖИТЬ ПартнерыСПометкойУдаления
	|;
	|		
	|УНИЧТОЖИТЬ ВТ_ТелефоныКлиентов
	|;
	|		
	|УНИЧТОЖИТЬ ДанныеФорматировнные
	|;
	|		
	|УНИЧТОЖИТЬ ЧистыеДанные
	|;
	|		
	|УНИЧТОЖИТЬ НомераТелефоновБолееОдногоПартнера
	|;
	|		
	|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.АТС, 
	|	Таблица.JSON, 
	|	Таблица.UID, 
	|	Таблица.RECORD, 
	|	Таблица.TRANSFER_UID, 
	|	Таблица.Date, 
	|	Таблица.Type,
	|	Таблица.STATUS,
	|	Таблица.Number, 
	|	Таблица.CLIENT, 
	|	Таблица.USER, 
	|	Таблица.TO_ANSWER, 
	|	Таблица.TO_COMPLETE, 
	|	Таблица.duration
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&ТаблицаЗвонки КАК Таблица
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &НомерТелефонаФильтр <> """" 
	|			ТОГДА Таблица.CLIENT = &НомерТелефонаФильтр 
	|			      ИЛИ Таблица.USER = &НомерТелефонаФильтр
	|			ИНАЧЕ
	|				ИСТИНА	  
	|	КОНЕЦ
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиАТС.NAME КАК NAME,
	|	ПользователиАТС.TELEPHONE КАК TELEPHONE,
	|	ПользователиАТС.INT_NUMBER КАК INT_NUMBER
	|ПОМЕСТИТЬ ВТ_ПользователиАТС
	|ИЗ
	|	&ПользователиАТС КАК ПользователиАТС
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиАТС.TELEPHONE КАК НомерТелефона,
	|	Пользователи.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ПользователиАТС_МобильныеНомера
	|ИЗ
	|	ВТ_ПользователиАТС КАК ПользователиАТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ПО СОКРЛП(ПользователиАТС.NAME) = СОКРЛП(Пользователи.Наименование)
	|ГДЕ
	|	ПользователиАТС.TELEPHONE <> """"
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиАТС.INT_NUMBER КАК НомерТелефона,
	|	Пользователи.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ПользователиАТС_РабочиеНомера
	|ИЗ
	|	ВТ_ПользователиАТС КАК ПользователиАТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ПО ПользователиАТС.NAME = Пользователи.Наименование
	|ГДЕ
	|	ПользователиАТС.INT_NUMBER <> """"
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Date КАК Дата, 
	|	CLIENT КАК НомерТелефона
	|ПОМЕСТИТЬ ДатыНомера
	|ИЗ
	|	Таблица
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Date КАК Дата, 
	|	USER КАК НомерТелефона
	|ИЗ
	|	Таблица
	|;
	|		
	|ВЫБРАТЬ
	|	ДатыНомера.Дата КАК Дата, 
	|	ДатыНомера.НомерТелефона КАК НомерТелефона, 
	|	МАКСИМУМ(История.Период) КАК Период
	|ПОМЕСТИТЬ ИсторияПредварительная
	|ИЗ
	|	ДатыНомера КАК ДатыНомера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияКонтактнойИнформацииПользователей КАК История
	|		ПО
	|			История.НомерТелефона = ДатыНомера.НомерТелефона
	|			И История.Период <= // Меньше или равно
	|				ВЫБОР 
	|					КОГДА ДатыНомера.Дата < ДАТАВРЕМЯ(2024, 4, 1)
	|					ТОГДА &ТекущаяДата
	|					ИНАЧЕ ДатыНомера.Дата
	|				КОНЕЦ
	|
	|ГДЕ
	|	НЕ ДатыНомера.НомерТелефона	В (&МассивНомеровСекретаря)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыНомера.Дата,
	|	ДатыНомера.НомерТелефона
	|;
	|
	|ВЫБРАТЬ
	|	ИсторияПредварительная.Дата КАК Дата,
	|	ИсторияПредварительная.НомерТелефона,
	|	ИсторияПредварительная.Период,
	|	ИсторияВладелец.Владелец КАК Сотрудник
	|ПОМЕСТИТЬ ИсторияОсновная
	|ИЗ
	|	ИсторияПредварительная КАК ИсторияПредварительная
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартИсторияКонтактнойИнформацииПользователей КАК ИсторияВладелец
	|	ПО
	|		ИсторияВладелец.Период = ИсторияПредварительная.Период
	|		И ИсторияВладелец.НомерТелефона = ИсторияПредварительная.НомерТелефона 
	|;
	|
	|ВЫБРАТЬ
	|	ИсторияОсновная.Дата 		  КАК Дата,
	|	ИсторияОсновная.НомерТелефона КАК НомерТелефона,
	|	ИсторияОсновная.Сотрудник 	  КАК Сотрудник
	|ПОМЕСТИТЬ История
	|ИЗ 
	|	ИсторияОсновная КАК ИсторияОсновная
	|
	|ОБЪЕДИНИТЬ
	|
	|// Дополняем выборку номерами секретаря
	|ВЫБРАТЬ 
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДатыНомера.НомерТелефона, 
	|	&ПользовательСекретарь
	|ИЗ
	|	ДатыНомера КАК ДатыНомера
	|ГДЕ
	|	ДатыНомера.НомерТелефона В (&МассивНомеровСекретаря)
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ПользователиАТС_МобильныеНомера.НомерТелефона, 
	|	ПользователиАТС_МобильныеНомера.Сотрудник
	|ИЗ
	|	ПользователиАТС_МобильныеНомера КАК ПользователиАТС_МобильныеНомера
	|ГДЕ 
	|	НЕ ПользователиАТС_МобильныеНомера.НомерТелефона В (ВЫБРАТЬ НомерТелефона ИЗ ИсторияОсновная)
	|	И ПользователиАТС_МобильныеНомера.НомерТелефона НЕ В (&МассивНомеровСекретаря)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ПользователиАТС_РабочиеНомера.НомерТелефона, 
	|	ПользователиАТС_РабочиеНомера.Сотрудник
	|ИЗ
	|	ПользователиАТС_РабочиеНомера КАК ПользователиАТС_РабочиеНомера
	|ГДЕ 
	|	НЕ ПользователиАТС_РабочиеНомера.НомерТелефона В (ВЫБРАТЬ НомерТелефона ИЗ ИсторияОсновная)
	|	И ПользователиАТС_РабочиеНомера.НомерТелефона НЕ В (&МассивНомеровСекретаря)
	|;
	//++ #4502 смарт: Ермаков 02.10.2025 / Исключить из совершенных звонков внутренние номера сотрудников	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НомерТелефона
	|ПОМЕСТИТЬ НомераОрганизаций
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация
	|ГДЕ
	|	Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|;            
	//-- #4502 смарт: Ермаков 02.10.2025	
	|ВЫБРАТЬ
	|	Таблица.АТС, 
	|	Таблица.JSON, 
	|	Таблица.UID, 
	|	Таблица.RECORD, 
	|	Таблица.TRANSFER_UID, 
	|	Таблица.Date, 
	|	Таблица.Type, 
	|	Таблица.STATUS,
	|	Таблица.Number, 
	|	Таблица.CLIENT, 
	|	Таблица.USER, 
	|	Таблица.TO_ANSWER, 
	|	Таблица.TO_COMPLETE, 
	|	Таблица.duration,
	|	ЕСТЬNULL(ИсторияUSER.Сотрудник, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК USER_Абонент
	|ПОМЕСТИТЬ ТаблицаССотрудниками
	|ИЗ 	
	|	Таблица КАК Таблица 
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ История КАК ИсторияUSER
	|	ПО ИсторияUSER.НомерТелефона = Таблица.USER			
	|		  И ВЫБОР 
	|				КОГДА ИсторияUSER.Дата <> ДАТАВРЕМЯ(1, 1, 1) 
	|					ТОГДА ИсторияUSER.Дата = Таблица.Date
	|				ИНАЧЕ
	|                   ИСТИНА
	|           КОНЕЦ
	|
	|ГДЕ
	|	НЕ 
	|	(       
	|		(   
	|			//Клиент не может быть сотрудником
	|			Таблица.CLIENT В (ВЫБРАТЬ НомерТелефона ИЗ История)
	|		)
	|		ИЛИ 
	|		(
	|			// Если номер клиента короткий
	|			ДЛИНАСТРОКИ(Таблица.CLIENT) < 5
	|		)
	|		ИЛИ 
	|		(
	|			// Сотрудник не определен
	|			ИсторияUSER.Сотрудник ЕСТЬ NULL
	|		)
	//++ #4502 смарт: Ермаков 02.10.2025 / Исключить из совершенных звонков внутренние номера сотрудников		
	|		ИЛИ
	|		(
	|			Таблица.CLIENT В (ВЫБРАТЬ НомерТелефона ИЗ НомераОрганизаций)
	|		)
	//-- #4502 смарт: Ермаков 02.10.2025		
	|	)
	|;
	|		
	|ВЫБРАТЬ
	|	Таблица.АТС, 
	|	Таблица.JSON, 
	|	Таблица.UID, 
	|	Таблица.RECORD, 
	|	Таблица.TRANSFER_UID, 
	|	Таблица.Date, 
	|	Таблица.Type, 
	|	Таблица.STATUS,
	|	Таблица.Number, 
	|	Таблица.USER, 
	|	Таблица.USER_Абонент, 
	|	Таблица.TO_ANSWER, 
	|	Таблица.TO_COMPLETE, 
	|	Таблица.duration,
	|	ЕСТЬNULL(ТелефонныйЗвонок.Ссылка, НЕОПРЕДЕЛЕНО) КАК ТелефонныйЗвонок,
	|	ЕСТЬNULL(ТелефонныйЗвонок.смартЗагруженИзАТС, ЛОЖЬ) КАК смартЗагруженИзАТС,
	|	Таблица.CLIENT,
	|	ЕСТЬNULL(ПартнерыНомераТелефонов.Абонент, НЕОПРЕДЕЛЕНО) КАК CLIENT_Абонент,
	|	ВЫБОР
	|		КОГДА ПартнерыНомераТелефонов.КоличествоДублей = 1
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПартнерыНомераТелефонов.Абонент)
	|		КОГДА ПартнерыНомераТелефонов.КоличествоДублей > 1
	|			ТОГДА СТРОКА(ПартнерыНомераТелефонов.КоличествоДублей) + "" дублей номеров абонентов!""
	|		КОГДА ПартнерыНомераТелефонов.КоличествоДублей ЕСТЬ NULL
	|			ТОГДА ""<Номер не найден!>""
	|	КОНЕЦ КАК CLIENT_Представление,
	|	ЕСТЬNULL(ПартнерыНомераТелефонов.КоличествоДублей, 0) КАК КоличествоДублей,
	|	ВЫБОР
	|		КОГДА СОКРЛП(НРЕГ(Таблица.Type)) = ""in""
	|			ТОГДА 
	|				ИСТИНА 
	|			ИНАЧЕ 
	|				ЛОЖЬ 
	|	КОНЕЦ КАК Входящий
	|ИЗ
	|	ТаблицаССотрудниками КАК Таблица
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|	ПО Таблица.UID = ТелефонныйЗвонок.сфпИдентификаторЗвонка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПартнерыНомераТелефонов КАК ПартнерыНомераТелефонов
	|	ПО ПартнерыНомераТелефонов.НомерТелефона = Таблица.CLIENT
    |
	|ГДЕ
	|   ВЫБОР 
	|		КОГДА &ТолькоНеСозданные ТОГДА 
	|			ТелефонныйЗвонок.Ссылка ЕСТЬ NULL 
	|		ИНАЧЕ 
	|			ИСТИНА
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.Date";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Звонки.Загрузить(Результат);
	
КонецПроцедуры

Процедура СоздатьЗвонки(СтруктураПараметров) Экспорт

	Ин = 0;
	КоличествоИтераций = Звонки.Количество();
	
	Для Каждого СтрокаЗвонок Из Звонки Цикл
		
		ДокументТелефонныйЗвонок = СтрокаЗвонок.ТелефонныйЗвонок;
		
		Если НЕ СтруктураПараметров.ЗагружатьПринудительно 
			И ЗначениеЗаполнено(ДокументТелефонныйЗвонок) Тогда
			
			Если СтрокаЗвонок.смартЗагруженИзАТС Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(СокрЛП(ВернутьТолькоЦифры(СтрокаЗвонок.CLIENT))) Тогда
			Продолжить;
		КонецЕсли;	
		
		//Параметры звонка
		ПараметрыДокумента = Новый Структура("Абонент, 
											 |АбонентПредставление, 
											 |НомерТелефонаАбонента, 
											 |Пользователь, 
											 |Сотрудник, 
											 |ВнутреннийНомерПользователя, 
											 |Входящий, 
											 |ДатаНачалаРазговора, 
											 |ВремяОжидания, 
											 |Продолжительность, 
											 |Пропущенный, 
											 |СсылкаНаЗапись, 
											 |ИдентификаторЗвонка, 
											 |ИдентификаторЗвонкаОснование, 
											 |Комментарий,
											 |смартВидАТС,
											 |смартПолученныеДаныеОтАТС");
		
		ПараметрыДокумента.смартВидАТС 				    = СтрокаЗвонок.АТС;
		ПараметрыДокумента.смартПолученныеДаныеОтАТС    = СтрокаЗвонок.JSON;	
		
		ПараметрыДокумента.ДатаНачалаРазговора 		    = СтрокаЗвонок.DATE;	
		ПараметрыДокумента.ИдентификаторЗвонка 		    = СтрокаЗвонок.UID;
		ПараметрыДокумента.ИдентификаторЗвонкаОснование = СтрокаЗвонок.TRANSFER_UID;
		ПараметрыДокумента.СсылкаНаЗапись 	   		    = СтрокаЗвонок.RECORD;
		
		ПараметрыДокумента.Абонент 				 	    = СтрокаЗвонок.CLIENT_Абонент;
		ПараметрыДокумента.АбонентПредставление  	    = СтрокаЗвонок.CLIENT_Представление;
		ПараметрыДокумента.НомерТелефонаАбонента 	    = СтрокаЗвонок.CLIENT;

		ПараметрыДокумента.Пользователь 			    = СтрокаЗвонок.USER_Абонент;
		ПараметрыДокумента.Сотрудник 				    = ПараметрыДокумента.Пользователь;
		ПараметрыДокумента.ВнутреннийНомерПользователя  = НомерБезКода(СтрокаЗвонок.USER);
		
		СтруктураДопПараметры = Новый Структура;
		
		СтруктураДопПараметры.Вставить("Входящий", 			СтрокаЗвонок.Входящий);
		СтруктураДопПараметры.Вставить("Продолжительность",	СтрокаЗвонок.DURATION);
		СтруктураДопПараметры.Вставить("ВремяОжидания",		СтрокаЗвонок.TO_ANSWER);
		СтруктураДопПараметры.Вставить("Комментарий", 		"");

		Если ТипЗнч(СтрокаЗвонок.АТС) = Тип("СправочникСсылка.смартВидыАТС") Тогда
			СтруктураДопПараметры.Вставить("АТС", СокрЛП(СтрокаЗвонок.АТС));
		Иначе
			СтруктураДопПараметры.Вставить("АТС", "");
		КонецЕсли;	

		Если СтрокаЗвонок.АТС = Справочники.смартВидыАТС.Asterisk Тогда
		
			Отвеченный  = ?(НРег(СтрокаЗвонок.STATUS) = "answered", Истина, Ложь);
			БезОтвета   = ?(НРег(СтрокаЗвонок.STATUS) = "no answer" ИЛИ НРег(СтрокаЗвонок.STATUS) = "failed", Истина, Ложь);
			Пропущенный = ?(НРег(СтрокаЗвонок.STATUS) = "busy", 	Истина, Ложь);

		ИначеЕсли СтрокаЗвонок.АТС = Справочники.смартВидыАТС.Мегафон
			ИЛИ СтрокаЗвонок.АТС = Справочники.смартВидыАТС.МегафонКовчег Тогда

			Если СтруктураПараметров.ВерсияAPI = "V1" Тогда
			
				Отвеченный  = ?(НРег(СтрокаЗвонок.status) = "success",  Истина, Ложь);
				БезОтвета   = ?(НРег(СтрокаЗвонок.status) = "noanswer", Истина, Ложь);
				Пропущенный = ?(НРег(СтрокаЗвонок.status) = "missed",   Истина, Ложь);
				
			Иначе
				
				Отвеченный  = ?(НРег(СтрокаЗвонок.TYPE) <> "missed"  И НРег(СтрокаЗвонок.DURATION) <> 0, Истина, Ложь);
				БезОтвета   = ?(НРег(СтрокаЗвонок.TYPE) <> "missed"  И НРег(СтрокаЗвонок.DURATION) = 0,  Истина, Ложь);
				Пропущенный = ?(НРег(СтрокаЗвонок.TYPE) =  "missed", Истина, Ложь);
				
			КонецЕсли;	
			
		КонецЕсли;

		СтруктураДопПараметры.Вставить("Отвеченный",  Отвеченный);
		СтруктураДопПараметры.Вставить("БезОтвета",   БезОтвета);
		СтруктураДопПараметры.Вставить("Пропущенный", Пропущенный);
		
		ПараметрыДокумента.Входящий = СтруктураДопПараметры;
		
		//Создание документа телефонный звонок
		Если НЕ ЗначениеЗаполнено(ДокументТелефонныйЗвонок) 
			  И ЗначениеЗаполнено(ПараметрыДокумента.Сотрудник) Тогда
			
			ДокументТелефонныйЗвонок = сфпСофтФонПроСервер.СоздатьТелефонныйЗвонок(ПараметрыДокумента.Абонент, 
																				   ПараметрыДокумента.НомерТелефонаАбонента, 
																		   		   ПараметрыДокумента.Пользователь, 
																				   ПараметрыДокумента.Сотрудник, 
																		   		   ПараметрыДокумента.ВнутреннийНомерПользователя, 
																				   ПараметрыДокумента.Входящий, 
																				   ПараметрыДокумента.ДатаНачалаРазговора, 
																		   		   ПараметрыДокумента.ИдентификаторЗвонка);
		КонецЕсли;
		
		//Заполнение документа телефонный звонок
		Если ЗначениеЗаполнено(ДокументТелефонныйЗвонок) Тогда
			
			ДокОбъект = ДокументТелефонныйЗвонок.ПолучитьОбъект();

			Если Не ЗначениеЗаполнено(ДокОбъект.сфпИдентификаторЗвонка) Тогда
				ДокОбъект.сфпИдентификаторЗвонка = ПараметрыДокумента.ИдентификаторЗвонка;
			КонецЕсли;	
			
			ДокОбъект.Дата 							  = ПараметрыДокумента.ДатаНачалаРазговора;
			ДокОбъект.Входящий 						  = ПараметрыДокумента.Входящий["Входящий"];
			ДокОбъект.сфпДлительностьЗвонка 		  = ПараметрыДокумента.Входящий["Продолжительность"];
 			ДокОбъект.смартДлительностьОжиданияЗвонка = ПараметрыДокумента.Входящий["ВремяОжидания"];
			ДокОбъект.сфпИдентификаторЗаписи 		  = ПараметрыДокумента.СсылкаНаЗапись;
			ДокОбъект.смартВидАТС					  = ПараметрыДокумента.смартВидАТС;
			ДокОбъект.смартПолученныеДаныеОтАТС 	  = ПараметрыДокумента.смартПолученныеДаныеОтАТС;
			
			Если ПараметрыДокумента.Входящий["Пропущенный"] Тогда
				ДокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
			Иначе
				ДокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Отвеченный;
			КонецЕсли;	
			
			ДокОбъект.Ответственный = ПараметрыДокумента.Сотрудник;
			ДокОбъект.Автор 		= ДокОбъект.Ответственный;

			ДокОбъект.АбонентКакСвязаться = ПараметрыДокумента.НомерТелефонаАбонента; 
			
			Если ЗначениеЗаполнено(ПараметрыДокумента.Абонент) 
				И ТипЗнч(ПараметрыДокумента.Абонент) <> Тип("Строка") Тогда
				
				ДокОбъект.АбонентКонтакт 	   = ПараметрыДокумента.Абонент;
				ДокОбъект.АбонентПредставление = СокрЛП(ДокОбъект.АбонентКонтакт);
				
			Иначе
				
				ДокОбъект.АбонентКонтакт = Неопределено;
				ДокОбъект.АбонентПредставление = ПараметрыДокумента.АбонентПредставление;
					
			КонецЕсли;
			
			АТС = "";
			Если ПараметрыДокумента.Входящий.Свойство("АТС") И ЗначениеЗаполнено(ПараметрыДокумента.Входящий["АТС"]) Тогда
				АТС = " ("+ПараметрыДокумента.Входящий["АТС"]+")";
			КонецЕсли;	

			Если ПараметрыДокумента.Входящий.Свойство("Отвеченный") 
				И ПараметрыДокумента.Входящий.Отвеченный 
				И ДокОбъект.сфпДлительностьЗвонка > 0 Тогда
				
				ДокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Отвеченный;
				ДокОбъект.Описание 			 = сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(ДокОбъект.сфпДлительностьЗвонка) + АТС;
				
			ИначеЕсли ПараметрыДокумента.Входящий.Свойство("Пропущенный") 
					И ПараметрыДокумента.Входящий.Пропущенный Тогда
				
				ДокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
				ДокОбъект.Описание 			 = "Звонок пропущен" + АТС;
				
			ИначеЕсли (ПараметрыДокумента.Входящий.Свойство("БезОтвета") И ПараметрыДокумента.Входящий.БезОтвета) 
				ИЛИ ДокОбъект.сфпДлительностьЗвонка = 0 Тогда
				
				ДокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
				ДокОбъект.Описание 			 = "Звонок без ответа" + АТС;
				
			КонецЕсли;
				
			Если НЕ ЗначениеЗаполнено(ДокОбъект.Комментарий) 
				И ДокОбъект.Описание <> "Ожидание загрузки данных из АТС" Тогда
				
				ДокОбъект.Комментарий = "Загружен автоматически из " + СокрЛП(ПараметрыДокумента.смартВидАТС);
				
			КонецЕсли;

			ДокОбъект.Тема = сфпСофтФонПроСервер.сфпЗаполнитьТемуТелефонногоЗвонка(ДокОбъект.Входящий, ДокОбъект.Дата);
			
			Если ЗначениеЗаполнено(ПараметрыДокумента.ИдентификаторЗвонкаОснование) Тогда
				
				ДокОбъект.ВзаимодействиеОснование = Документы.ТелефонныйЗвонок.НайтиПоРеквизиту("сфпИдентификаторЗвонка", 
																								ПараметрыДокумента.ИдентификаторЗвонкаОснование);
																								
			КонецЕсли;																					
			
			ДокОбъект.смартЗагруженИзАТС = ЗначениеЗаполнено(ДокОбъект.сфпИдентификаторЗвонка); 
			
			//Запись документа
			Попытка
				
				ДокОбъект.Записать();
				
			Исключение
				
				ТекстОшибки = "Ошибка записи звонка после заполнения " + СокрЛП(ДокОбъект.Ссылка) 
							  + Символы.ПС + ПараметрыДокумента.смартПолученныеДаныеОтАТС;
							  
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка записи документа звонка " + СокрЛП(ДокОбъект.Ссылка) + "'", 
										 ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
										 
			КонецПопытки;
			
			//Запись истории
			ДополнитьИсториюЗвонков(ДокументТелефонныйЗвонок, ПараметрыДокумента);
			
		КонецЕсли;
		
		Если СтруктураПараметров.ВыполнятьВФоне Тогда
			
			Ин = Ин + 1;
			ТекущийПроцентВыполнения = Окр(100 * Ин / КоличествоИтераций, 0);
			ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, "Загрузка звонков из " + ПараметрыДокумента.Входящий.АТС 
																		  + ": " + СокрЛП(Ин) + " из " + СокрЛП(КоличествоИтераций));
																		  
		КонецЕсли;	
		
    КонецЦикла;
	
КонецПроцедуры	

Процедура ДополнитьИсториюЗвонков(Звонок, ПараметрыДокумента)
	
	НаборЗаписей = РегистрыСведений.сфпИсторияЗвонков.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Звонок.Установить(Звонок);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		СтрокаЗаписи = НаборЗаписей[0];
		
		СтрокаЗаписи.ДатаНачала 		 = ПараметрыДокумента.ДатаНачалаРазговора;
		СтрокаЗаписи.НомерТелефона 		 = ПараметрыДокумента.НомерТелефонаАбонента;

		СтрокаЗаписи.ВнутреннийНомер 	 = ПараметрыДокумента.ВнутреннийНомерПользователя;
		СтрокаЗаписи.Входящий 			 = ПараметрыДокумента.Входящий["Входящий"];
		СтрокаЗаписи.ДатаОкончания 		 = СтрокаЗаписи.ДатаНачала + ПараметрыДокумента.Входящий["Продолжительность"];
		СтрокаЗаписи.ДатаОтвета 		 = СтрокаЗаписи.ДатаНачала + ПараметрыДокумента.Входящий["ВремяОжидания"];
		СтрокаЗаписи.ИдентификаторЗаписи = ПараметрыДокумента.СсылкаНаЗапись;
		СтрокаЗаписи.ИдентификаторЗвонка = ПараметрыДокумента.ИдентификаторЗвонка;
		СтрокаЗаписи.АбонентКонтакт 	 = Звонок.АбонентКонтакт;
		СтрокаЗаписи.Ответственный 		 = ПараметрыДокумента.Сотрудник;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция НомерБезКода(Номер)

	Если СтрДлина(Номер) = 11 Тогда 
		Возврат Сред(Номер, 2);
	Иначе
		Возврат Номер;
	КонецЕсли;
	
КонецФункции

Функция НайтиДокументПоIDЗвонка(UID)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка КАК ТелефонныйЗвонок
		|ИЗ
		|	Документ.ТелефонныйЗвонок
		|ГДЕ
		|	сфпИдентификаторЗвонка = &UID
		|";
	
	Запрос.УстановитьПараметр("UID", СокрЛП(UID));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ТелефонныйЗвонок;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьВДату(СтрокаДата)
	
	СтрокаДата = СтрЗаменить(СтрокаДата, "-", "");
	СтрокаДата = СтрЗаменить(СтрокаДата, ":", "");
	СтрокаДата = СтрЗаменить(СтрокаДата, " ", "");
	
	ЗначениеДаты = Дата(СтрокаДата);
	
	Возврат ЗначениеДаты;

КонецФункции

Функция ПривестиТелефонныйНомерКФормату(ОригТелНомер)
	
	ТелНомер = СокрЛП(ОригТелНомер);
	
	ТелНомер = ПолучитьСтрокуДоСимвола(ТелНомер, ";");
	ТелНомер = ПолучитьСтрокуДоСимвола(ТелНомер, ",");
	ТелНомер = ПолучитьСтрокуДоСимвола(ТелНомер, "/");
	
	ТелНомер = СтрЗаменить(ТелНомер, "+7", "7");     
	ТелНомер = СтрЗаменить(ТелНомер, ":7", "7");     
	ТелНомер = СтрЗаменить(ТелНомер, "+8", "7");     
	ТелНомер = СтрЗаменить(ТелНомер, ":8", "7");     
	
	Если СтрДлина(ТелНомер) >= 6 Тогда
		ТелНомер = сфпСофтФонПроСерверПереопределяемый.ПреобразоватьНомерДляКонтактнойИнформации(ТелНомер);
	КонецЕсли;	

	ТелНомер = ВернутьТолькоЦифры(ТелНомер);
	
	Если СтрДлина(ТелНомер) = 10 Тогда
		ТелНомер = "7" + ТелНомер;
	КонецЕсли;

	Если Лев(ТелНомер, 1) = "8" И СтрДлина(ТелНомер) = 11 Тогда
		ТелНомер = "7" + Сред(ТелНомер, 2);
	КонецЕсли;

	Возврат ТелНомер;	

КонецФункции

Функция ВернутьТолькоЦифры(Строка)
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Итог = "";

	Для Сч = 1 По ДлинаСтроки Цикл
		
		Символ = Сред(Строка, Сч, 1);

		КодСимвола = КодСимвола(Символ);
		
		Если КодСимвола > 47 И КодСимвола < 58 Тогда
			Итог = Итог + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Итог;
	
КонецФункции

Функция ПолучитьСтрокуДоСимвола(ТелНомер, Символ)

	Если СтрНайти(ТелНомер, Символ) > 0 Тогда
		
		ТелНомер = Лев(ТелНомер, СтрНайти(ТелНомер, Символ) - 1);
		
	КонецЕсли;	           
	
	Возврат ТелНомер;
	
КонецФункции

Функция ПолучитьТелефоныПартнеров(ВыполнениеВФоне = Ложь)
	
	Если ВыполнениеВФоне Тогда
		ДлительныеОперации.СообщитьПрогресс(0, "Формируется список телефонов клиентов");
	КонецЕсли;	
	
	ЗапросТелефоныПартнеров = Новый Запрос;
	ЗапросТелефоныПартнеров.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец КАК Абонент,
	|	СТРЗАМЕНИТЬ(СОКРЛП(КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона), "" "", """") КАК НомерТелефона,
	|	""КонтактныеЛицаПартнеров"" КАК Откуда
	|ПОМЕСТИТЬ ВТ_ТелефоныКлиентов
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И ДЛИНАСТРОКИ(СТРЗАМЕНИТЬ(СОКРЛП(КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона), "" "", """")) > 2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка,
	|	СТРЗАМЕНИТЬ(СОКРЛП(ПартнерыКонтактнаяИнформация.НомерТелефона), "" "", """"),
	|	""Партнеры""
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И ДЛИНАСТРОКИ(СТРЗАМЕНИТЬ(СОКРЛП(ПартнерыКонтактнаяИнформация.НомерТелефона), "" "", """")) > 2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка.Партнер,
	|	СТРЗАМЕНИТЬ(СОКРЛП(КонтрагентыКонтактнаяИнформация.НомерТелефона), "" "", """"),
	|	""Контрагенты""
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И ДЛИНАСТРОКИ(СТРЗАМЕНИТЬ(СОКРЛП(КонтрагентыКонтактнаяИнформация.НомерТелефона), "" "", """")) > 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_ТелефоныКлиентов.Абонент КАК Абонент,
	|	ВТ_ТелефоныКлиентов.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	ВТ_ТелефоныКлиентов КАК ВТ_ТелефоныКлиентов
	|ГДЕ
	|	НЕ ВТ_ТелефоныКлиентов.Абонент.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТелефона";

	ВыгрузкаТел = ЗапросТелефоныПартнеров.Выполнить().Выгрузить();

	Ин = 0;
	КоличествоИтераций = ВыгрузкаТел.Количество();
	
	Для Каждого СтрТел Из ВыгрузкаТел Цикл 
		
		СтрТел.НомерТелефона = ПривестиТелефонныйНомерКФормату(СтрТел.НомерТелефона);
		
		Если ВыполнениеВФоне Тогда
			Ин = Ин + 1;
			ТекущийПроцентВыполнения = Окр(100 * Ин / КоличествоИтераций, 0);
			ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, "Формирование списка телефонов клиентов: " + СокрЛП(Ин) + " из " + СокрЛП(КоличествоИтераций));
		КонецЕсли;	
		
	КонецЦикла;	

	ВыгрузкаТел.Свернуть("Абонент, НомерТелефона");
	
	Возврат ВыгрузкаТел;
	
КонецФункции

#КонецОбласти

#Область Мегафон
	        
Процедура ПолучитьПользователейВАТСНаСервере(СтруктураПараметров, АТС = Неопределено)

	Если СтруктураПараметров.ВыполнятьВФоне Тогда
		ДлительныеОперации.СообщитьПрогресс(0, СтрШаблон("Запрос пользователей ВАТС из %1", СокрЛП(АТС)));
	КонецЕсли;	
	
	ПараметрыЗапроса = Новый Структура;
	
	ПараметрыЗапроса.Вставить("ИмяМетода", "accounts");
	
	Если АТС = Справочники.смартВидыАТС.МегафонКовчег Тогда
		ПараметрыЗапроса.Вставить("ИсходящийНомер", "700");
	КонецЕсли;	
		
	HTTPОтвет = смартОбщегоНазначения.смартТелефонияВыполнитьHTTPЗапрос(ПараметрыЗапроса);
	
	Если HTTPОтвет <> "" Тогда

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(HTTPОтвет);

		СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураИзJSON) = Тип("Массив") Тогда
	
		Для Каждого ЭлементСтруктуры Из СтруктураИзJSON Цикл
			
			СтрокаПользователя = ПользователиАТС.Добавить();

			СтрокаПользователя.LOGIN 	  = ЭлементСтруктуры.Name;
			СтрокаПользователя.NAME 	  = ЭлементСтруктуры.realName;
			СтрокаПользователя.INT_NUMBER = ЭлементСтруктуры.ext;

			Если ЭлементСтруктуры.Свойство("telnum") И ЗначениеЗаполнено(ЭлементСтруктуры.telnum) Тогда
				СтрокаПользователя.TELEPHONE = ЭлементСтруктуры.telnum;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура МегафонПолучитьИсториюЗвонковНаСервере(СтруктураПараметров, АТС = Неопределено)

	МассивСтрок = Новый Массив;
	
	Если СтруктураПараметров.ВыполнятьВФоне Тогда
		ДлительныеОперации.СообщитьПрогресс(0, СтрШаблон("Запрос данных из %1", СокрЛП(АТС)));
	КонецЕсли;	
	
	ПараметрыЗвонка = Новый Структура;

	ПараметрыЗвонка.Вставить("start", 	  ЗаписатьДатуJSON(СтруктураПараметров.ДатаНачала,    ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	ПараметрыЗвонка.Вставить("end", 	  ЗаписатьДатуJSON(СтруктураПараметров.ДатаОкончания, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	ПараметрыЗвонка.Вставить("ИмяМетода", "history");
	ПараметрыЗвонка.Вставить("type",	  "all");

	Если АТС = Справочники.смартВидыАТС.МегафонКовчег Тогда
		ПараметрыЗвонка.Вставить("ИсходящийНомер", "700");
	КонецЕсли;	
	
	Если СтруктураПараметров.ВерсияAPI = "V1" Тогда
		HTTPОтвет = смартТелефонияВыполнитьHTTPЗапросМегафонНовыйAPI(ПараметрыЗвонка);
	Иначе	
		HTTPОтвет = смартОбщегоНазначения.смартТелефонияВыполнитьHTTPЗапрос(ПараметрыЗвонка);
	КонецЕсли;	
		
	Если HTTPОтвет <> "" Тогда
		
		Если СтруктураПараметров.ВерсияAPI = "V1" Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(HTTPОтвет);
			
			МассивСтрок = ПрочитатьJSON(ЧтениеJSON);
			
		Иначе	
			
			МассивСтрок = СтрРазделить(HTTPОтвет, Символы.ПС);
			
		КонецЕсли;	
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

	Если ТипЗнч(МассивСтрок) = Тип("Массив") И МассивСтрок.Количество() > 0 Тогда

		Ин = 0;
		
		КоличествоИтераций = МассивСтрок.Количество();
		
		Для Каждого Стр Из МассивСтрок Цикл
			
			Попытка

				СтрокаЗвонка = Звонки.Добавить();

				СтрокаЗвонка.АТС = АТС;
				
				Если СтруктураПараметров.ВерсияAPI = "V1" Тогда //Стр - структура
					
					//Входящие данные:
					
					//uid: 		   Уникальный идентификатор звонка
					////direction: in out
					//type:		   in out
					//status: 	   success missed noanswer
					//client: 	   Номер клиента
					//account: 	   Логин сотрудника
					//diversion:   Номер телефона, через который пришел звонок
					//destination: Адресат входящего звонка - user group telnum ivr onduty offtime hello vm am
					//user: 	   Логин сотрудника
					//user_name:   Имя сотрудника
					//group_name:  Имя группы через которую прошел звонок
					//start: 	   Время начала звонка
					//wait: 	   Время ожидания на линии (сек)
					//duration:    Длительность разговора (сек)
					//record: 	   Ссылка на запись разговора
					//rating: 	   Оценка качества обслуживания

					//Таблица-приемник:
					
					//UID 			- идентификатор звонка
					//Transfer_UID 	- идентификатор родительского звонка (откуда перевели вызов)
					//Date 			- дата звонка
					//Type 			- тип звонка: входящий, исходящий (in, out)
					//Number 		- внешний номер, через который проходит звонок
					//Source 		- номер того, кто звонит
					//Destination 	- номер того, кому звонят
					//disposotion 	- результат звонка: принят, не принят, занято
					//to_answer 	- количество секунд до ответа
					//to_complete 	- количество секунд до завершения разговора
					//duration 		- общее количество секунд

					//destination: Адресат входящего звонка
					//user ‑ Сотрудник принял звонок.
					//group ‑ Звонок пропущен отделом.
					//telnum ‑ Внешний телефонный номер.
					//ivr ‑ Меню самообслуживания.
					//onduty ‑ Дежурный в нерабочее время.
					//offtime ‑ Сообщение о нерабочем времени.
					//hello ‑ Звонок оборвался на приветствии.
					//vm ‑ Автоответчик, клиент оставил сообщение.
					//am ‑ Сообщение автоответчика.
					
					СтрокаЗвонка.JSON = смартОбщегоНазначения.ЗначениеВJSON(Стр);

					СтрокаЗвонка.UID 		  = Стр.UID;
					СтрокаЗвонка.TRANSFER_UID = "";
					СтрокаЗвонка.DATE 		  = ПрочитатьДатуJSON(Стр.start, ФорматДатыJSON.ISO);
					СтрокаЗвонка.TYPE 		  = Стр.type;
					СтрокаЗвонка.NUMBER 	  = Стр.diversion;
					СтрокаЗвонка.STATUS  	  = Стр.status;
					СтрокаЗвонка.CLIENT   	  = Стр.client;
					СтрокаЗвонка.USER  	  	  = Стр.diversion;
					
					Если Стр.Свойство("USER_NAME") Тогда
						СтрокаЗвонка.USER_NAME = Стр.USER_NAME;
					КонецЕсли;

					Если Стр.Свойство("record") Тогда
						СтрокаЗвонка.RECORD = Стр.record;
					КонецЕсли;
					
					Если Стр.Свойство("duration") Тогда
						Длительность = ?(ТипЗнч(Стр.duration) = Тип("Число"), Стр.duration, 0);
					Иначе
						Длительность = 0;
					КонецЕсли;

					Ожидание = ?(ТипЗнч(Стр.wait) = Тип("Число"), Стр.wait, 0);
					
				Иначе //Стр - строка

					//СтрокаЗвонка.UID = МассивРеквизитов[0];
					//СтрокаЗвонка.type = МассивРеквизитов[1];
					//СтрокаЗвонка.client = МассивРеквизитов[2];
					//СтрокаЗвонка.account = МассивРеквизитов[3];
					//СтрокаЗвонка.via = МассивРеквизитов[4];
					//СтрокаЗвонка.start = МассивРеквизитов[5];
					//СтрокаЗвонка.wait = МассивРеквизитов[6];
					//СтрокаЗвонка.duration = МассивРеквизитов[7];
					//СтрокаЗвонка.record = МассивРеквизитов[8];
				
					МассивРеквизитов = СтрРазделить(Стр, ",");

					СтрокаЗвонка.JSON = смартОбщегоНазначения.ЗначениеВJSON(МассивРеквизитов);
					
					СтрокаЗвонка.UID 		  = МассивРеквизитов[0];
					СтрокаЗвонка.DATE 		  = ПрочитатьДатуJSON(МассивРеквизитов[5], ФорматДатыJSON.ISO);
					СтрокаЗвонка.STATUS  	  = Стр.status;
					
					СтрокаЗвонка.RECORD		  = МассивРеквизитов[8];
					СтрокаЗвонка.TYPE 		  = МассивРеквизитов[1];
					СтрокаЗвонка.CLIENT 	  = МассивРеквизитов[2];
					СтрокаЗвонка.USER		  = МассивРеквизитов[4];
					СтрокаЗвонка.USER_NAME	  = МассивРеквизитов[3];
					СтрокаЗвонка.NUMBER 	  = МассивРеквизитов[4];

					Длительность = ?(ТипЗнч(МассивРеквизитов[7]) = Тип("Число"), МассивРеквизитов[7], 0);
					Ожидание 	 = ?(ТипЗнч(МассивРеквизитов[6]) = Тип("Число"), МассивРеквизитов[6], 0);
					
				КонецЕсли;	

				СтрокаЗвонка.DURATION 	  = Длительность;
				СтрокаЗвонка.TO_ANSWER 	  = Ожидание;
				
				Если Длительность > Ожидание Тогда
					СтрокаЗвонка.TO_COMPLETE  = Длительность - Ожидание;
				КонецЕсли;	
				
			Исключение	

				ТекстОшибки = "Не удалось прочитать строку звонка " + СокрЛП(АТС) + ":" + Символы.ПС + ?(ТипЗнч(Стр) = Тип("Структура"), смартОбщегоНазначения.ЗначениеВJSON(Стр), Стр);
					
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Звонок через " + СокрЛП(АТС) + " " + ПараметрыЗвонка.ИмяМетода + "'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

			КонецПопытки;

			Если СтруктураПараметров.ВыполнятьВФоне Тогда
				
				Ин = Ин + 1;
				
				ТекущийПроцентВыполнения = Окр(100 * Ин / КоличествоИтераций, 0);
				
				ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, "Формирование массива данных звонков " + СокрЛП(АТС) + ": " + СокрЛП(Ин) + " из " + СокрЛП(КоличествоИтераций));
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;	    

КонецПроцедуры	

Функция ПолучитПользователяПоТелефонуВАТС(НомерТелефона)
	
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("TELEPHONE", НомерТелефона);
	
	СтрокиСтелефоном = ЭтотОбъект.ПользователиАТС.НайтиСтроки(ПараметрыОтбора);
	
	Если СтрокиСтелефоном.Количество() > 0 Тогда
		
		ПользовательНомера = Справочники.Пользователи.НайтиПоНаименованию(СтрокиСтелефоном[0].NAME);
		Если ПользовательНомера = Справочники.Пользователи.ПустаяСсылка() Тогда
			ПользовательНомера = Справочники.Пользователи.НайтиПоРеквизиту("смартВнутреннийНомерВАТС", СтрокиСтелефоном[0].INT_NUMBER);
		КонецЕсли;
		
		//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
		Если ПользовательНомера = Справочники.Пользователи.ПустаяСсылка() Тогда
			ПользовательНомера = Справочники.Пользователи.НайтиПоРеквизиту("смартВнутреннийНомерВАТСДополнительный", СтрокиСтелефоном[0].INT_NUMBER);
		КонецЕсли;
		//-- #Б-6744 смарт: Фролов 28.05.2026
		
	КонецЕсли;	
	
	Если ПользовательНомера <> Справочники.Пользователи.ПустаяСсылка() Тогда
		Результат = ПользовательНомера;
	Иначе
		Результат = Неопределено;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	                    

Функция смартТелефонияВыполнитьHTTPЗапросМегафонНовыйAPI(Знач ПараметрыЗвонка)
	
	HTTPОтвет = Неопределено;

	HTTPЗапрос = смартТелефонияПодготовитьHTTPЗапрос(ПараметрыЗвонка);
	
	Если HTTPЗапрос = "" Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Попытка

		Соединение = Новый HTTPСоединение(ПараметрыЗвонка.Соединение, , , , , 60, ПараметрыЗвонка.ЗащищенноеСоединение);

		Если ПараметрыЗвонка.ИмяМетода = "history" Тогда
			HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		КонецЕсли;
		
	Исключение	
	КонецПопытки;
	
	Если HTTPОтвет <> Неопределено Тогда
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"), ПараметрыЗвонка.ИмяМетода, HTTPОтвет.КодСостояния) + Символы.ПС
				+ HTTPОтвет.ПолучитьТелоКакСтроку();
				
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Звонок через " + ПараметрыЗвонка.ИмяМетода + "'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

			ОбщегоНазначения.СообщитьПользователю("Не удалось выполнить запрос! " + ТекстОшибки);
			
		КонецЕсли;
			
		Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
		
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

Функция смартТелефонияПодготовитьHTTPЗапрос(ПараметрыЗвонка)
	
	HTTPЗапрос = "";

	Если ПараметрыЗвонка.ИмяМетода = "history" Тогда 
		
		ПараметрыВАТС = смартОбщегоНазначения.смартПолучитьПараметрыВАТС(ПараметрыЗвонка);

		Если Не ПараметрыВАТС = Неопределено Тогда

			ПараметрыЗвонка.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
			ПараметрыЗвонка.Вставить("HTTPМетод",  			 "GET");
			ПараметрыЗвонка.Вставить("Соединение",  		 ПараметрыВАТС.Соединение);
			ПараметрыЗвонка.Вставить("АдресРесурса",		 "/crmapi/v1/history/json");
			ПараметрыЗвонка.Вставить("Токен",       		 ПараметрыВАТС.Токен); 

			ЗаголовокЗапросаHTTP = Новый Соответствие;
			ЗаголовокЗапросаHTTP.Вставить("Content-Type", 	 "application/json; charset=UTF-8");
			ЗаголовокЗапросаHTTP.Вставить("X-API-KEY",   	 ПараметрыЗвонка.Токен);
			
			ДанныеДляЗапроса = Новый Структура;

			Если ПараметрыЗвонка.Свойство("period") И НЕ ПараметрыЗвонка.period = "" Тогда

				ДанныеДляЗапроса.Вставить("period", 		 ПараметрыЗвонка.period);
				
			ИначеЕсли ПараметрыЗвонка.Свойство("start") и ПараметрыЗвонка.Свойство("end") Тогда
				
				ДанныеДляЗапроса.Вставить("start", 			 ПараметрыЗвонка.start);
				ДанныеДляЗапроса.Вставить("end",   			 ПараметрыЗвонка.end);
				
			КонецЕсли;
			
			ДанныеДляЗапроса.Вставить("type", 				 ПараметрыЗвонка.type);

			Если ДанныеДляЗапроса.Количество() > 0 Тогда

				ПараметрыЗапроса = "?";

				Для Каждого ЭлементДанныеДляЗапроса Из ДанныеДляЗапроса Цикл

					ЗначениеПараметраЗапроса = ЭлементДанныеДляЗапроса.Ключ + "=" + ЭлементДанныеДляЗапроса.Значение;
					
					ПараметрыЗапроса = ПараметрыЗапроса + ЗначениеПараметраЗапроса + "&";
					
				КонецЦикла;	
				
				ПараметрыЗвонка.АдресРесурса = ПараметрыЗвонка.АдресРесурса + Лев(ПараметрыЗапроса, СтрДлина(ПараметрыЗапроса)-1);
				
			КонецЕсли;
			
			HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗвонка.АдресРесурса, ЗаголовокЗапросаHTTP);
			
		КонецЕсли;
		
	КонецЕсли;				   
	
	Возврат HTTPЗапрос;
	
КонецФункции 

#КонецОбласти

#Область Asterisk

Процедура AsteriskПолучитьИсториюЗаПериодНаСервере(СтруктураПараметров, АТС = Неопределено, ВыполнениеВФоне = Ложь)

	Если ВыполнениеВФоне Тогда
		ДлительныеОперации.СообщитьПрогресс(0, СтрШаблон("Запрос данных из %1", СокрЛП(АТС)));
	КонецЕсли;	
	
    ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
	ПараметрыЗапроса.Вставить("HTTPМетод",  		  "POST");
	ПараметрыЗапроса.Вставить("HTTPСоединение", 	  "sip.smart-t.me");
	ПараметрыЗапроса.Вставить("АдресЗапроса", 		  "/list_call_new.php?");

	ИдентификаторЗвонка  = СокрЛП(СтруктураПараметров.UID);
	ДатаНачалаСтрокой 	 = ?(Не ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала), 	  "", Формат(СтруктураПараметров.ДатаНачала,    "ДФ='yyyy-MM-dd HH:mm:ss'"));
	ДатаОкончанияСтрокой = ?(Не ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания), "", Формат(СтруктураПараметров.ДатаОкончания, "ДФ='yyyy-MM-dd HH:mm:ss'"));
	
	СтрокаHTTPЗапроса = ПараметрыЗапроса.АдресЗапроса 
		 + ?(ПустаяСтрока(ИдентификаторЗвонка),  "", "UID="   + ИдентификаторЗвонка  + "&")
		 + ?(ПустаяСтрока(ДатаНачалаСтрокой), 	 "", "START=" + ДатаНачалаСтрокой    + "&")
		 + ?(ПустаяСтрока(ДатаОкончанияСтрокой), "", "END="   + ДатаОкончанияСтрокой + "&");						
		 
	СтрокаHTTPЗапроса = Лев(СтрокаHTTPЗапроса, СтрДлина(СтрокаHTTPЗапроса) - 1);
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыЗапроса.HTTPСоединение,,,,,, ПараметрыЗапроса.ЗащищенноеСоединение); 
	
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
 
 	HTTPОтвет = HTTPСоединение.Получить(Новый HTTPЗапрос(СтрокаHTTPЗапроса, ЗаголовокЗапросаHTTP));

	СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка истории звонков'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , "Ошибка загрузки истории звонков из Astrisk: " + Символы.ПС + СтрокаОтвета);
			
		Возврат;	
			
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	
	СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(СтруктураИзJSON) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	
	
	Ин = 0;
	КоличествоИтераций = СтруктураИзJSON.Количество();
	
	Для Каждого ЭлементСтруктуры Из СтруктураИзJSON Цикл 
		
		//UID 			- идентификатор звонка
		//Transfer_UID 	- идентификатор родительского звонка (откуда перевели вызов)
		//Date 			- дата звонка
		//Type 			- тип звонка: входящий, исходящий (in, out)
		//Number 		- внешний номер, через который проходит звонок
		//Source 		- номер того, кто звонит
		//Destination 	- номер того, кому звонят
		//disposotion 	- результат звонка: принят, не принят, занято
		//to_answer 	- количество секунд до ответа
		//to_complete 	- количество секунд до завершения разговора
		//duration 		- общее количество секунд
		
		СтрокаЗвонка = Звонки.Добавить();

		СтрокаЗвонка.АТС = АТС;
		
		СтрокаЗвонка.JSON = смартОбщегоНазначения.ЗначениеВJSON(ЭлементСтруктуры);

		СтрокаЗвонка.UID 		  = ЭлементСтруктуры.UID;
		СтрокаЗвонка.TRANSFER_UID = ЭлементСтруктуры.TRANSFER_UID;
		СтрокаЗвонка.DATE 		  = ПреобразоватьВДату(ЭлементСтруктуры.DATE);
		СтрокаЗвонка.TYPE 		  = ЭлементСтруктуры.TYPE;
		СтрокаЗвонка.NUMBER 	  = ЭлементСтруктуры.NUMBER;
		СтрокаЗвонка.STATUS  	  = ЭлементСтруктуры.DISPOSITION;
		СтрокаЗвонка.DURATION 	  = ЭлементСтруктуры.DURATION;
		СтрокаЗвонка.TO_ANSWER 	  = ЭлементСтруктуры.TO_ANSWER;
		СтрокаЗвонка.TO_COMPLETE  = ЭлементСтруктуры.TO_COMPLETE;
		
		Если НРег(СтрокаЗвонка.TYPE) = НРег("in") Тогда

			СтрокаЗвонка.CLIENT   = ЭлементСтруктуры.SOURCE;
			СтрокаЗвонка.USER  	  = ЭлементСтруктуры.DESTINATION;
			
		Иначе
			
			СтрокаЗвонка.CLIENT   = ЭлементСтруктуры.DESTINATION;
			СтрокаЗвонка.USER  	  = ЭлементСтруктуры.SOURCE;
			
		КонецЕсли;	
		
		Если ВыполнениеВФоне Тогда
			
			Ин = Ин + 1;
			
			ТекущийПроцентВыполнения = Окр(100 * Ин / КоличествоИтераций, 0);
			
			ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, "Формирование массива данных из " + СокрЛП(АТС) 
																		  + ": " + СокрЛП(Ин) + " из " + СокрЛП(КоличествоИтераций));
																		  
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры    

Процедура СравнитьAsterisk(СтруктураПараметров, ВыполнениеВФоне = Ложь)

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
		СтруктураПараметров.ДатаНачала = НачалоДня(ТекущаяДата());
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
		СтруктураПараметров.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;	

	Звонки.Очистить();

	HTTPЗапрос = "";
    ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ЗащищенноеСоединение", Неопределено);
	ПараметрыЗапроса.Вставить("HTTPМетод",  "POST");
	ПараметрыЗапроса.Вставить("Соединение", "sip.smart-t.me");

	ПараметрыURL = Новый Массив;
	
	ПараметрыURL.Добавить(СтрШаблон("START=%1", Формат(СтруктураПараметров.ДатаНачала,   "ДФ='yyyy-MM-dd HH:mm:ss'")));
	ПараметрыURL.Добавить(СтрШаблон("END=%1",   Формат(СтруктураПараметров.ДатаОкончания,"ДФ='yyyy-MM-dd HH:mm:ss'")));
	
	Если ЗначениеЗаполнено(СтруктураПараметров.UID) Тогда
		ПараметрыURL.Добавить(СтрШаблон("UID=%1", СокрЛП(СтруктураПараметров.UID)));
	КонецЕсли;	
	
	HTTPЗапрос = СтрШаблон("/list_call_new.php?%1", СтрСоединить(ПараметрыURL, "&"));
	
	Соединение = Новый HTTPСоединение(ПараметрыЗапроса.Соединение,80,,,,60,ПараметрыЗапроса.ЗащищенноеСоединение); 
	
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
 
 	HTTPОтвет = Соединение.Получить(Новый HTTPЗапрос(HTTPЗапрос, ЗаголовокЗапросаHTTP));
	СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	
	СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(СтруктураИзJSON) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	
	
	Ин = 0;
	КоличествоИтераций = СтруктураИзJSON.Количество();
	
	Для Каждого ЭлементСтруктуры Из СтруктураИзJSON Цикл 
		
		//UID - идентификатор звонка
		//Transfer_UID - идентификатор родительского звонка (откуда перевели вызов)
		//Date - дата звонка
		//Type - тип звонка: входящий, исходящий
		//Number - внешний номер, через который проходит звонок
		//Source - номер того, кто звонит
		//Destination - номер того, кому звонят
		//disposotion - результат звонка: принят, не принят, занято
		//to_answer - количество секунд до ответа
		//to_complete  количество секунд до завершения разговора
		//duration - общее количество секунд
		
		СтрокаЗвонка = Звонки.Добавить();

		СтрокаЗвонка.АТС = СтруктураПараметров.АТС;
		
		СтрокаЗвонка.JSON = смартОбщегоНазначения.ЗначениеВJSON(ЭлементСтруктуры);

		СтрокаЗвонка.UID 		  = ЭлементСтруктуры.UID;
		СтрокаЗвонка.TRANSFER_UID = ЭлементСтруктуры.TRANSFER_UID;
		СтрокаЗвонка.TYPE 		  = ЭлементСтруктуры.TYPE;
		СтрокаЗвонка.DATE 		  = ПреобразоватьВДату(ЭлементСтруктуры.DATE);
		СтрокаЗвонка.CLIENT 	  = ЭлементСтруктуры.SOURCE;
		СтрокаЗвонка.USER  = ЭлементСтруктуры.DESTINATION;
		СтрокаЗвонка.NUMBER 	  = ЭлементСтруктуры.NUMBER;
		СтрокаЗвонка.STATUS  = ЭлементСтруктуры.DISPOSITION;
		СтрокаЗвонка.DURATION 	  = ЭлементСтруктуры.DURATION;
		СтрокаЗвонка.TO_ANSWER 	  = ЭлементСтруктуры.TO_ANSWER;
		СтрокаЗвонка.TO_COMPLETE  = ЭлементСтруктуры.TO_COMPLETE;
		
		Если ВыполнениеВФоне Тогда
			
			Ин = Ин + 1;
			
			ТекущийПроцентВыполнения = Окр(100 * Ин / КоличествоИтераций, 0);
			
			ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, "Формирование массива данных из " + СокрЛП(СтруктураПараметров.АТС) 
																		  + ": " + СокрЛП(Ин) + " из " + СокрЛП(КоличествоИтераций));
																		  
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если ВыполнениеВФоне Тогда
		ДлительныеОперации.СообщитьПрогресс(0, СтрШаблон("Обработка данных из %1", СокрЛП(СтруктураПараметров.АТС)));
	КонецЕсли;	
	
	ТЗТелефоныПартнеров = ПолучитьТелефоныПартнеров(СтруктураПараметров.ВыполнятьВФоне);
	
	//Номера секретаря
	ТаблицаЗначенийНомераСекретаря = ТЗТелефоныПартнеров.ВыгрузитьКолонки();
	
	АбонентСекретарь = Справочники.Пользователи.НайтиПоНаименованию("Секретарь");
	
	ЗаполнитьНастройкиОбработки();
	
	Если ЗначениеЗаполнено(АбонентСекретарь) И СЗНомеровСекретаря.Количество() > 0 Тогда
		
		Для Каждого ЭлементСекретарь Из СЗНомеровСекретаря Цикл
		
			НоваяСтрока = ТаблицаЗначенийНомераСекретаря.Добавить();
			
			НоваяСтрока.Абонент 	  = АбонентСекретарь;
			НоваяСтрока.НомерТелефона = ЭлементСекретарь;
			
		КонецЦикла;

	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Звонки.АТС КАК АТС,
	               |	Звонки.UID КАК UID,
	               |	Звонки.TRANSFER_UID КАК TRANSFER_UID,
	               |	Звонки.TYPE КАК TYPE,
	               |	Звонки.DATE КАК DATE,
	               |	Звонки.SOURCE КАК SOURCE,
	               |	Звонки.DESTINATION КАК DESTINATION,
	               |	Звонки.DISPOSITION КАК DISPOSITION,
	               |	Звонки.DURATION КАК DURATION,
	               |	Звонки.TO_ANSWER КАК TO_ANSWER,
	               |	Звонки.TO_COMPLETE КАК TO_COMPLETE
	               |ПОМЕСТИТЬ ВрЗвонки
	               |ИЗ
	               |	&Звонки КАК Звонки
	               |ГДЕ
	               |	Звонки.DATE МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	UID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТелефонныйЗвонок.Ссылка КАК ТелефонныйЗвонок,
	               |	ТелефонныйЗвонок.Дата КАК Дата,
	               |	ТелефонныйЗвонок.сфпИдентификаторЗвонка КАК сфпИдентификаторЗвонка,
	               |	ТелефонныйЗвонок.АбонентКакСвязаться КАК АбонентКакСвязаться,
	               |	ТелефонныйЗвонок.АбонентКонтакт КАК АбонентКонтакт,
	               |	ТелефонныйЗвонок.АбонентПредставление КАК АбонентПредставление,
	               |	ТелефонныйЗвонок.Автор КАК Автор,
	               |	ТелефонныйЗвонок.Входящий КАК Входящий,
	               |	ТелефонныйЗвонок.Описание КАК Описание,
	               |	ТелефонныйЗвонок.Ответственный КАК Ответственный,
	               |	ТелефонныйЗвонок.Комментарий КАК Комментарий,
	               |	ТелефонныйЗвонок.сфпДлительностьЗвонка КАК сфпДлительностьЗвонка,
	               |	ТелефонныйЗвонок.сфпИдентификаторЗаписи КАК сфпИдентификаторЗаписи,
	               |	ТелефонныйЗвонок.сфпСостояниеЗвонка КАК сфпСостояниеЗвонка,
	               |	ТелефонныйЗвонок.смартЗагруженИзАТС КАК смартЗагруженИзАТС
	               |ПОМЕСТИТЬ ВТТелефонныеЗвонки
	               |ИЗ
	               |	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	               |ГДЕ
	               |	ТелефонныйЗвонок.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И (ТелефонныйЗвонок.Комментарий ПОДОБНО ""%Asterisk""
	               |			ИЛИ ТелефонныйЗвонок.смартВидАТС = ЗНАЧЕНИЕ(Справочник.смартВидыАТС.Asterisk))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	сфпИдентификаторЗвонка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаЗначенийНомераСекретаря.Абонент КАК Абонент,
	               |	ТаблицаЗначенийНомераСекретаря.НомерТелефона КАК НомерТелефона
	               |ПОМЕСТИТЬ ВрТаблицаЗначенийНомераСекретаря
	               |ИЗ
	               |	&ТаблицаЗначенийНомераСекретаря КАК ТаблицаЗначенийНомераСекретаря
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТелефоныПартнеров.Абонент КАК Абонент,
	               |	ТелефоныПартнеров.НомерТелефона КАК НомерТелефона
	               |ПОМЕСТИТЬ ВрТелефоныПартнеровИсх
	               |ИЗ
	               |	&ТелефоныПартнеров КАК ТелефоныПартнеров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВрТелефоныПартнеровИсх.Абонент КАК Абонент,
	               |	ВрТелефоныПартнеровИсх.НомерТелефона КАК НомерТелефона
	               |ПОМЕСТИТЬ ВрТелефоныПартнеров
	               |ИЗ
	               |	ВрТелефоныПартнеровИсх КАК ВрТелефоныПартнеровИсх
	               |ГДЕ
	               |	ДЛИНАСТРОКИ(ВрТелефоныПартнеровИсх.НомерТелефона) > 2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТелефоныПартнеров.НомерТелефона КАК НомерТелефона,
	               |	СУММА(1) КАК Поле1
	               |ПОМЕСТИТЬ РазличныеТелефоны
	               |ИЗ
	               |	ВрТелефоныПартнеров КАК ВрТелефоныПартнеров
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТелефоныПартнеров.НомерТелефона
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(1) = 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТелефоныПартнеров.Абонент КАК Абонент,
	               |	ВрТелефоныПартнеров.НомерТелефона КАК НомерТелефона
	               |ПОМЕСТИТЬ ВрУникальныеНомераТелефоновПартнеров
	               |ИЗ
	               |	ВрТелефоныПартнеров КАК ВрТелефоныПартнеров
	               |ГДЕ
	               |	ВрТелефоныПартнеров.НомерТелефона В
	               |			(ВЫБРАТЬ
	               |				РазличныеТелефоны.НомерТелефона
	               |			ИЗ
	               |				РазличныеТелефоны)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	Пользователи.смартРабочийТелефон КАК НомерТелефона
	               |ПОМЕСТИТЬ ВрТелефоныПользователей
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	НЕ Пользователи.смартРабочийТелефон = """"
	               |	И НЕ Пользователи.Недействителен
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Ссылка,
	               |	ПользователиКонтактнаяИнформация.НомерТелефона
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |ГДЕ
	               |	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И ПользователиКонтактнаяИнформация.НомерТелефона <> """"
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПользователиКонтактнаяИнформация.Ссылка,
	               |	ПользователиКонтактнаяИнформация.НомерТелефона
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВрТаблицаЗначенийНомераСекретаря.Абонент,
	               |	ВрТаблицаЗначенийНомераСекретаря.НомерТелефона
	               |ИЗ
	               |	ВрТаблицаЗначенийНомераСекретаря КАК ВрТаблицаЗначенийНомераСекретаря
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрЗвонки.АТС КАК АТС,
	               |	ВрЗвонки.UID КАК UID,
	               |	ВрЗвонки.TRANSFER_UID КАК TRANSFER_UID,
	               |	ВрЗвонки.TYPE КАК TYPE,
	               |	ЕСТЬNULL(ВрЗвонки.DATE, ВТТелефонныеЗвонки.Дата) КАК DATE,
	               |	ВрЗвонки.SOURCE КАК SOURCE,
	               |	ВрЗвонки.DESTINATION КАК DESTINATION,
	               |	ВрЗвонки.DISPOSITION КАК DISPOSITION,
	               |	ВрЗвонки.DURATION КАК DURATION,
	               |	ВрЗвонки.TO_ANSWER КАК TO_ANSWER,
	               |	ВрЗвонки.TO_COMPLETE КАК TO_COMPLETE,
	               |	ВТТелефонныеЗвонки.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
	               |	ВТТелефонныеЗвонки.Дата КАК Дата,
	               |	ВТТелефонныеЗвонки.сфпИдентификаторЗвонка КАК сфпИдентификаторЗвонка,
	               |	ВТТелефонныеЗвонки.АбонентКакСвязаться КАК АбонентКакСвязаться,
	               |	ВТТелефонныеЗвонки.АбонентКонтакт КАК АбонентКонтакт,
	               |	ВТТелефонныеЗвонки.АбонентПредставление КАК АбонентПредставление,
	               |	ВТТелефонныеЗвонки.Автор КАК Автор,
	               |	ВТТелефонныеЗвонки.Входящий КАК Входящий,
	               |	ВТТелефонныеЗвонки.Описание КАК Описание,
	               |	ВТТелефонныеЗвонки.Ответственный КАК Ответственный,
	               |	ВТТелефонныеЗвонки.Комментарий КАК Комментарий,
	               |	ВТТелефонныеЗвонки.сфпДлительностьЗвонка КАК сфпДлительностьЗвонка,
	               |	ВТТелефонныеЗвонки.сфпИдентификаторЗаписи КАК сфпИдентификаторЗаписи,
	               |	ВТТелефонныеЗвонки.сфпСостояниеЗвонка КАК сфпСостояниеЗвонка,
	               |	ВТТелефонныеЗвонки.смартЗагруженИзАТС КАК смартЗагруженИзАТС,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ВрЗвонки.TYPE КАК СТРОКА(3))) = ""in""
	               |			ТОГДА ТелефоныПартнеров.Абонент
	               |		ИНАЧЕ ТелефоныПользователей.Пользователь
	               |	КОНЕЦ КАК CLIENT_Абонент,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ВрЗвонки.TYPE КАК СТРОКА(3))) = ""in""
	               |			ТОГДА ТелефоныПользователей.Пользователь
	               |		ИНАЧЕ ТелефоныПартнеров.Абонент
	               |	КОНЕЦ КАК USER_Абонент
	               |ИЗ
	               |	ВрЗвонки КАК ВрЗвонки
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТТелефонныеЗвонки КАК ВТТелефонныеЗвонки
	               |		ПО ВрЗвонки.UID = ВТТелефонныеЗвонки.сфпИдентификаторЗвонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВрТелефоныПользователей КАК ТелефоныПользователей
	               |		ПО (ВЫБОР
	               |				КОГДА (ВЫРАЗИТЬ(ВрЗвонки.TYPE КАК СТРОКА(3))) = ""in""
	               |					ТОГДА ТелефоныПользователей.НомерТелефона = ВрЗвонки.DESTINATION
	               |				ИНАЧЕ ТелефоныПользователей.НомерТелефона = ВрЗвонки.SOURCE
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВрУникальныеНомераТелефоновПартнеров КАК ТелефоныПартнеров
	               |		ПО (ВЫБОР
	               |				КОГДА (ВЫРАЗИТЬ(ВрЗвонки.TYPE КАК СТРОКА(3))) = ""in""
	               |					ТОГДА ТелефоныПартнеров.НомерТелефона = ВрЗвонки.SOURCE
	               |				ИНАЧЕ ТелефоныПартнеров.НомерТелефона = ВрЗвонки.DESTINATION
	               |			КОНЕЦ)
	               |ГДЕ
	               |	(ВрЗвонки.UID ЕСТЬ NULL
	               |			ИЛИ ВТТелефонныеЗвонки.сфпИдентификаторЗвонка ЕСТЬ NULL)
	               |	И НЕ(НЕ ВрЗвонки.UID ЕСТЬ NULL
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ВрЗвонки.TYPE КАК СТРОКА(3))) = ""in""
	               |						ТОГДА ТелефоныПартнеров.Абонент
	               |					ИНАЧЕ ТелефоныПользователей.Пользователь
	               |				КОНЕЦ ЕСТЬ NULL
	               |				И ВЫБОР
	               |					КОГДА (ВЫРАЗИТЬ(ВрЗвонки.TYPE КАК СТРОКА(3))) = ""in""
	               |						ТОГДА ТелефоныПользователей.Пользователь
	               |					ИНАЧЕ ТелефоныПартнеров.Абонент
	               |				КОНЕЦ ЕСТЬ NULL)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	DATE";
	
 	Запрос.УстановитьПараметр("Звонки", 	   					Звонки);
 	Запрос.УстановитьПараметр("ДатаНачала",    					СтруктураПараметров.ДатаНачала);
 	Запрос.УстановитьПараметр("ДатаОкончания", 					СтруктураПараметров.ДатаОкончания);
	Запрос.УстановитьПараметр("ТелефоныПартнеров", 				ТЗТелефоныПартнеров);
	Запрос.УстановитьПараметр("ТаблицаЗначенийНомераСекретаря", ТаблицаЗначенийНомераСекретаря);
	
 	ЭтотОбъект.Звонки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры    

#КонецОбласти

#Область ОпределитьАбонентов

Процедура ОпределитьАбонентов(СтруктураПараметров, АдресРезультата = Неопределено) Экспорт
	
	ЗаполнитьНастройкиОбработки();
	
	//По умолчанию определение абонентов за последние 6 месяцев
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
		СтруктураПараметров.ДатаНачала = НачалоДня(ДобавитьМесяц(ТекущаяДата(), -6));
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
		СтруктураПараметров.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;	
	
	Если СтруктураПараметров.ВыполнятьВФоне Тогда
		ДлительныеОперации.СообщитьПрогресс(0, "Формирование списка телефонов партнеров");
		ДлительныеОперации.СообщитьПрогресс(0, "Обработка телефонных звонков");
	КонецЕсли;	
	
	ОбработаноЗаписей = 0;
	
	ОбработатьЗвонкиБезАбонентов(СтруктураПараметров, ОбработаноЗаписей);
	
	Если СтруктураПараметров.ВыполнятьВФоне Тогда
		ПоместитьВоВременноеХранилище(ОбработаноЗаписей, АдресРезультата);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработатьЗвонкиБезАбонентов(СтруктураПараметров, КоличествоИтераций = 0)
	
	ТЗТелефоныПартнеров = ПолучитьТелефоныПартнеров(СтруктураПараметров.ВыполнятьВФоне);
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДатаНачала", 	   СтруктураПараметров.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	   СтруктураПараметров.ДатаОкончания);
	Запрос.УстановитьПараметр("ТелефоныПартнеров", ТЗТелефоныПартнеров);

	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТелефонныйЗвонок.Ссылка КАК Ссылка,
		|	СОКРЛП(ТелефонныйЗвонок.АбонентКакСвязаться) КАК АбонентКакСвязаться,
		|	ТелефонныйЗвонок.АбонентКонтакт КАК АбонентКонтакт,
		|	ТИПЗНАЧЕНИЯ(ТелефонныйЗвонок.АбонентКонтакт) КАК ТипАбонента,
		|	ТелефонныйЗвонок.АбонентПредставление КАК АбонентПредставление
		|ПОМЕСТИТЬ ВТ_Звонки
		|ИЗ
		|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
		|ГДЕ
		|	ТелефонныйЗвонок.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (ТИПЗНАЧЕНИЯ(ТелефонныйЗвонок.АбонентКонтакт) <> ТИП(Справочник.Партнеры)
		|			ИЛИ ТелефонныйЗвонок.АбонентКонтакт = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВрТелефоныПартнеров.Абонент КАК Абонент,
		|	ВЫРАЗИТЬ(СОКРЛП(ВрТелефоныПартнеров.НомерТелефона) КАК СТРОКА(20)) КАК НомерТелефона
		|ПОМЕСТИТЬ ВТ_ТелефоныПартнеровИсх
		|ИЗ
		|	&ТелефоныПартнеров КАК ВрТелефоныПартнеров
		|ГДЕ
		|	ДЛИНАСТРОКИ(ВЫРАЗИТЬ(СОКРЛП(ВрТелефоныПартнеров.НомерТелефона) КАК СТРОКА(20))) > 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТелефоныПартнеровИсх.НомерТелефона КАК НомерТелефона,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТелефоныПартнеровИсх.Абонент) КАК КолВоАбонентов
		|ПОМЕСТИТЬ ВТ_ДублиНомеров
		|ИЗ
		|	ВТ_ТелефоныПартнеровИсх КАК ВТ_ТелефоныПартнеровИсх
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТелефоныПартнеровИсх.НомерТелефона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТелефоныПартнеровИсх.НомерТелефона КАК НомерТелефона,
		|	ВТ_ТелефоныПартнеровИсх.Абонент КАК Абонент,
		|	ВТ_ДублиНомеров.КолВоАбонентов КАК КолВоАбонентов
		|ПОМЕСТИТЬ ВТ_ТелефоныПартнеров
		|ИЗ
		|	ВТ_ТелефоныПартнеровИсх КАК ВТ_ТелефоныПартнеровИсх
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДублиНомеров КАК ВТ_ДублиНомеров
		|		ПО ВТ_ТелефоныПартнеровИсх.НомерТелефона = ВТ_ДублиНомеров.НомерТелефона
		|ГДЕ
		|	ВТ_ДублиНомеров.КолВоАбонентов = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Звонки.Ссылка КАК Ссылка,
		|	ВТ_Звонки.АбонентПредставление КАК ТелефонныйЗвонокАбонентПредставление,
		|	ВТ_Звонки.АбонентКакСвязаться КАК АбонентКакСвязаться,
		|	ВТ_Звонки.АбонентКонтакт КАК АбонентКонтакт,
		|	ВТ_ТелефоныПартнеров.Абонент КАК Абонент,
		|	ВЫБОР
		|		КОГДА ВТ_ДублиНомеров.КолВоАбонентов = 1
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВТ_ТелефоныПартнеров.Абонент)
		|		КОГДА ВТ_ДублиНомеров.КолВоАбонентов > 1
		|			ТОГДА СТРОКА(ВТ_ДублиНомеров.КолВоАбонентов) + "" дублей номеров абонентов!""
		|		КОГДА ВТ_ДублиНомеров.КолВоАбонентов ЕСТЬ NULL
		|			ТОГДА ""<Номер не найден!>""
		|	КОНЕЦ КАК АбонентПредставление,
		|	ВТ_ДублиНомеров.КолВоАбонентов КАК КолВоАбонентов
		|ИЗ
		|	ВТ_Звонки КАК ВТ_Звонки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТелефоныПартнеров КАК ВТ_ТелефоныПартнеров
		|		ПО ВТ_Звонки.АбонентКакСвязаться = ВТ_ТелефоныПартнеров.НомерТелефона
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДублиНомеров КАК ВТ_ДублиНомеров
		|		ПО ВТ_Звонки.АбонентКакСвязаться = ВТ_ДублиНомеров.НомерТелефона
		|ГДЕ
		|	НЕ ВТ_ДублиНомеров.КолВоАбонентов ЕСТЬ NULL
		|	И ВТ_Звонки.АбонентКонтакт = НЕОПРЕДЕЛЕНО";
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	КоличествоИтераций = Выборка.Количество();
	
	ТекстОшибок = "";
	
	Ин = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Абонент) 
			ИЛИ (ЗначениеЗаполнено(Выборка.АбонентПредставление) И Выборка.АбонентПредставление <> Выборка.ТелефонныйЗвонокАбонентПредставление) Тогда
		
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если ЗначениеЗаполнено(Выборка.Абонент) Тогда
				
				ДокОбъект.АбонентКонтакт = Выборка.Абонент;
				ДокОбъект.АбонентПредставление = СокрЛП(Выборка.АбонентПредставление);
				
			Иначе
				
				ДокОбъект.АбонентКонтакт = Неопределено;
				
				Если НЕ ЗначениеЗаполнено(Выборка.ТелефонныйЗвонокАбонентПредставление) 
					ИЛИ Выборка.ТелефонныйЗвонокАбонентПредставление = "!!!Не определен!!!" 
					ИЛИ Выборка.ТелефонныйЗвонокАбонентПредставление = "<Номер не найден!>"
					ИЛИ СтрНайти(Выборка.ТелефонныйЗвонокАбонентПредставление, "дублей номеров абонентов") <> 0 Тогда
					
					ДокОбъект.АбонентПредставление = СокрЛП(Выборка.АбонентПредставление);
					
				КонецЕсли;
				
			КонецЕсли;	

			ДокОбъект.ОбменДанными.Загрузка	= Истина;
			
			Успешно = Ложь;
			
			Попытка							   
				ДокОбъект.Записать();
				Успешно = Истина;
			Исключение
				ЗаписьЖурналаРегистрации("ОпределениеАбонентовТелефонныхЗвонков", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось записать: " + СокрЛП(Выборка.Ссылка));
			КонецПопытки;	
			
		КонецЕсли;
		
		Если СтруктураПараметров.ВыполнятьВФоне Тогда
			Ин = Ин + 1;
			ТекущийПроцентВыполнения = Окр(100 * Ин / КоличествоИтераций, 0);
			ДлительныеОперации.СообщитьПрогресс(ТекущийПроцентВыполнения, "Определение абонентов: " + СокрЛП(Ин) + " из " + СокрЛП(КоличествоИтераций));
		КонецЕсли;	
		
	КонецЦикла;

	Если ТекстОшибок <> "" Тогда

		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибки обновления тэгов звонков в сервисе речевой аналитики imot.io'", 
								 ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибок);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПрочитатьНастройкиОбновленияТэгов(ИдентификаторОбработки) Экспорт

	ДополнительнаяОбработкаСсылка = ПолучитьЭлементСправочникаДополнительныеОтчетыИОбработки(ИдентификаторОбработки);
	
	Если ДополнительнаяОбработкаСсылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
   
	НастройкиОбработки = ДополнительнаяОбработкаСсылка.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(НастройкиОбработки) = Тип("Структура") Тогда
		
		Возврат НастройкиОбработки;
		
	Иначе
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЭлементСправочникаДополнительныеОтчетыИОбработки(Идентификатор) Экспорт
	
	Результат = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	                      |ГДЕ
	                      |	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &Идентификатор");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьПараметрыОбновленияТэговIMOTIO(ДокОбъект, НастройкиОбновленияТэгов, ТекстОшибок)
	
	ТекстОшибки = "";
	
    ПараметрыОбновления = Новый Структура;

	ПараметрыОбновления.Вставить("HTTPМетод",  		     "POST");
	ПараметрыОбновления.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
	ПараметрыОбновления.Вставить("Соединение", 		   	 НастройкиОбновленияТэгов.АдресAPI);
	ПараметрыОбновления.Вставить("АдресРесурса",	 	 "/call/" + ДокОбъект.смартИдентификаторIMOT + "/params");
	ПараметрыОбновления.Вставить("Токен",      			 НастройкиОбновленияТэгов.APIKey); 
	
	ПараметрыОбновления.Вставить("ТелефонныйЗвонок", 	 ДокОбъект.Ссылка);
	
	ПараметрыОбновления.Вставить("ТелефонКлиента",       ДокОбъект.АбонентКакСвязаться); 
	ПараметрыОбновления.Вставить("ДатаЗвонка",  		 ПолучитьДатуUnixTimeStamp(ДокОбъект.Дата)); 
	
	ТэгиДляОбновления = Новый Соответствие;
	ТэгиДляОбновления.Вставить("Клиент", 				 СокрЛП(ДокОбъект.АбонентПредставление));
	ТэгиДляОбновления.Вставить("Контакт",   			 СокрЛП(ДокОбъект.АбонентКонтакт));
	ТэгиДляОбновления.Вставить("Сотрудник", 			 СокрЛП(ДокОбъект.Ответственный));
	
	ПараметрыОбновления.Вставить("ТэгиДляОбновления", 	 ТэгиДляОбновления); 
	
	Возврат ПараметрыОбновления;
	
КонецФункции

Процедура ОбновитьТэгиЗвонковВРечевойАналитикеIMOTIO(ПараметрыВыгрузки, ТекстОшибок)

	//HTTP-запрос
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Accept", 	   "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + ПараметрыВыгрузки.Токен);
	ЗаголовокЗапросаHTTP.Вставить("Content-Type",  "application/json");
	
	ТелоЗапроса = Новый Структура;
	
	Если ПараметрыВыгрузки.Свойство("ТелефонКлиента") Тогда
		ТелоЗапроса.Вставить("client_phone", ПараметрыВыгрузки.ТелефонКлиента);
	КонецЕсли;

	Если ПараметрыВыгрузки.Свойство("ДатаЗвонка") Тогда
		ТелоЗапроса.Вставить("call_time", ПараметрыВыгрузки.ДатаЗвонка);
	КонецЕсли;
	
	//Обновление тэгов
	МассивТэгов = Новый Массив;
	
	Для Каждого Тэг Из ПараметрыВыгрузки.ТэгиДляОбновления Цикл
		
		СтруктураПараметровТэга = Новый Структура;
			
		СтруктураПараметровТэга.Вставить("tag_type", "upload");
		СтруктураПараметровТэга.Вставить("name", 	 Тэг.Ключ);
		СтруктураПараметровТэга.Вставить("value",    ?(Тэг.Значение = "Удалить", "", Тэг.Значение));
		СтруктураПараметровТэга.Вставить("visible",  Тэг.Значение <> "Удалить");
		
		МассивТэгов.Добавить(СтруктураПараметровТэга);
		
	КонецЦикла;
	
	ТелоЗапроса.Вставить("tags", МассивТэгов);
	
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыВыгрузки.АдресРесурса, ЗаголовокЗапросаHTTP);

	ДанныеТелаЗапроса = смартОбщегоНазначения.ЗначениеВJSON(ТелоЗапроса);
	HTTPЗапрос.УстановитьТелоИзСтроки(ДанныеТелаЗапроса);

	Соединение = Новый HTTPСоединение(ПараметрыВыгрузки.Соединение, , , , , 60, ПараметрыВыгрузки.ЗащищенноеСоединение); 
	
	HTTPОтвет = Неопределено;
	
	Попытка

		HTTPОтвет = Соединение.ВызватьHTTPМетод(ПараметрыВыгрузки.HTTPМетод, HTTPЗапрос);
		
	Исключение

		ТекстОшибок = ТекстОшибок + Символы.ПС + Символы.ПС 
					  + "Ошибка соединения " + ПараметрыВыгрузки.Соединение 
					  + " при обновлении парамеров звонка в сервисе речевой аналитики imot.io: " 
					  + СокрЛП(ПараметрыВыгрузки.ТелефонныйЗвонок);
					  
	КонецПопытки;
		
	//Обработка ответа
	Если HTTPОтвет <> Неопределено И ТипЗнч(HTTPОтвет) = Тип("HTTPОтвет") Тогда

		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			

		Иначе
			
			ТекстОшибок = ТекстОшибок + Символы.ПС + Символы.ПС 
						  + "Ошибка обновлении парамеров звонка в сервисе речевой аналитики imot.io: " 
						  + СокрЛП(ПараметрыВыгрузки.ТелефонныйЗвонок) + Символы.ПС
						  + ТелоОтвета;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДатуUnixTimeStamp(ДатаЗвонка) 

	Возврат Формат(УниверсальноеВремя(ДатаЗвонка) - Дата(1970, 1, 1), "ЧГ=0");
	
КонецФункции

Процедура ОбновитьAPIТокенIMOTIO(НастройкиIMOTIO) Экспорт
	
	Если НЕ (ЗначениеЗаполнено(НастройкиIMOTIO.Логин)
			 И ЗначениеЗаполнено(НастройкиIMOTIO.Пароль)) Тогда
		Возврат;
	КонецЕсли;	

	ТекстОшибок = "";
	
    ПараметрыОбновления = Новый Структура;
	ПараметрыОбновления.Вставить("HTTPМетод",  		     "POST");
	ПараметрыОбновления.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
	ПараметрыОбновления.Вставить("Соединение", 		   	 НастройкиIMOTIO.АдресAPI);
	ПараметрыОбновления.Вставить("АдресРесурса",	 	 "/token");
	ПараметрыОбновления.Вставить("Логин",  	    		 НастройкиIMOTIO.Логин); 
	ПараметрыОбновления.Вставить("Пароль",      		 НастройкиIMOTIO.Пароль); 
	
	//HTTP-запрос
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Accept", 	   		 "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Content-Type",  		 "application/x-www-form-urlencoded");
	
	ПараметрыТелаЗапроса = Новый Структура;
	
	ПараметрыТелаЗапроса.Вставить("grant_type",	   		 "");
	ПараметрыТелаЗапроса.Вставить("username",	   		 ПараметрыОбновления.Логин);
	ПараметрыТелаЗапроса.Вставить("password", 	   		 ПараметрыОбновления.Пароль);
	ПараметрыТелаЗапроса.Вставить("scope", 	   	   		 "");
	ПараметрыТелаЗапроса.Вставить("client_id",	   		 "");
	ПараметрыТелаЗапроса.Вставить("client_secret", 		 "");
	
	ТелоЗапроса = "";
	
	Для Каждого ПараметрТелаЗапроса Из ПараметрыТелаЗапроса Цикл
		
		ТелоЗапроса = ТелоЗапроса + ПараметрТелаЗапроса.Ключ + "=";
		
		Если ЗначениеЗаполнено(ПараметрТелаЗапроса.Значение) Тогда
			ТелоЗапроса = ТелоЗапроса + ПараметрТелаЗапроса.Значение;
		КонецЕсли;	
			
		ТелоЗапроса = ТелоЗапроса + "&";
		
	КонецЦикла;	
	
	ТелоЗапроса = Лев(ТелоЗапроса, СтрДлина(ТелоЗапроса) - 1);
	
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыОбновления.АдресРесурса, ЗаголовокЗапросаHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, , ИспользованиеByteOrderMark.НеИспользовать);
	Соединение = Новый HTTPСоединение(ПараметрыОбновления.Соединение, , , , , , ПараметрыОбновления.ЗащищенноеСоединение); 
	HTTPОтвет = Неопределено;
	
	Попытка

		HTTPОтвет = Соединение.ВызватьHTTPМетод(ПараметрыОбновления.HTTPМетод, HTTPЗапрос);
		
	Исключение

		ТекстОшибок = ТекстОшибок + Символы.ПС + Символы.ПС 
					  + "Ошибка соединения " + ПараметрыОбновления.Соединение 
					  + " при обновлении API токена речевой аналитики imot.io";
					  
	КонецПопытки;
		
	//Обработка ответа
	Если HTTPОтвет <> Неопределено И ТипЗнч(HTTPОтвет) = Тип("HTTPОтвет") Тогда

		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();

		Если HTTPОтвет.КодСостояния = 200 
			ИЛИ HTTPОтвет.КодСостояния = 422 Тогда
		
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
			
			Если ЗначениеЗаполнено(ТелоОтвета) Тогда
			
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
				
				Попытка
					
					СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
					
				Исключение
					
					ТекстОшибок = ТекстОшибок + Символы.ПС + Символы.ПС 
								  + "Ошибка обновлении API токена речевой аналитики imot.io: " 
								  + Символы.ПС
								  + ТелоОтвета;

					СтруктураИзJSON = Неопределено;
								  
				КонецПопытки;
		
				Если ТипЗнч(СтруктураИзJSON) = Тип("Структура") Тогда

					Если HTTPОтвет.КодСостояния = 200 Тогда
					
						Если СтруктураИзJSON.Свойство("access_token") Тогда

							НастройкиIMOTIO.APIKey = СтруктураИзJSON.access_token;
							
						КонецЕсли;	
					
					КонецЕсли;

				КонецЕсли;

			Иначе
				
				ТекстОшибок = ТекстОшибок + Символы.ПС + Символы.ПС 
							  + "Ошибка обновлении API токена речевой аналитики imot.io: " 
							  + Символы.ПС
							  + ТелоОтвета;
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибок = ТекстОшибок + Символы.ПС + Символы.ПС 
						  + "Ошибка обновлении API токена речевой аналитики imot.io: " 
						  + Символы.ПС
						  + ТелоОтвета;
			
		КонецЕсли;

	КонецЕсли;

	Если ТекстОшибок <> "" Тогда

		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибки выгрузки звонков в сервис речевой аналитики imot.io'", 
								 ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибок);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

