#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументсмартЗаявкаНаРемонтныеРаботы", 
																		 "И смартЗаявкаНаРемонтныеРаботыОборудование.НомерСтроки = 1", 
																		 "ЕСТЬNULL(смартЗаявкаНаРемонтныеРаботыОборудование.Оборудование, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ОборудованиеТЧ",
																		 ,,, "Партнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

#КонецОбласти