
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.АРМДиалоги.ОткрытиеВОдинКлик.РазделКлиенты");
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Обработка.CRM_Мессенджер.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		 ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти
