 
//++ смарт:Подкин #1099 20.07.2022 11:18:46
&После("УстановитьТекстНадписиОтображатьОстатки")
Процедура смарт_УстановитьТекстНадписиОтображатьОстатки(Форма)  
    
    Форма.ОтображатьОстаткиНадпись = ?(Форма.Элементы.ОстаткиТоваров.Видимость, 
    НСтр("ru = 'Подробная информация об остатках (скрыть) - Расшифровка доступности по складам'"),
    НСтр("ru = 'Подробная информация об остатках (показать) - Расшифровка доступности по складам'"));
    
КонецПроцедуры //-- смарт:Подкин #1099 20.07.2022 11:18:46


