//++ смарт:ПА #815 11.12.2021 20:11:10
&НаКлиенте
Процедура ОК(Команда)
    
    Если ЭтаФорма.ТолькоПросмотр Тогда
        Закрыть();
    Иначе
        МассивСтрок=Новый Массив;
        Для каждого стр Из смартОшибкиВРеквизитах Цикл
            МассивСтрок.Добавить(Новый Структура("СинонимРеквизита,ОписаниеОшибки",стр.СинонимРеквизита,стр.ОписаниеОшибки)); 
        КонецЦикла; 
        
        Закрыть(МассивСтрок);
    КонецЕсли;  
    
КонецПроцедуры //-- смарт:ПА #815 11.12.2021 20:11:10


//++ смарт:ПА #815 10.12.2021 19:43:56
&НаКлиенте
Процедура Отмена(Команда)
    
    Модифицированность = Ложь;
	Закрыть();

КонецПроцедуры //-- смарт:ПА #815 10.12.2021 19:43:56

//++ смарт:ПА #815 10.12.2021 17:34:32
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
        Возврат;
    КонецЕсли;
    
    // смартОшибкиВРеквизитах.Загрузить(Параметры.Ключ.смартОшибкиВРеквизитах.Выгрузить());
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ТЗТекущая.СинонимРеквизита КАК СинонимРеквизита,
    |	ТЗТекущая.ОписаниеОшибки КАК ОписаниеОшибки
    |ПОМЕСТИТЬ ВременнаяТЗ
    |ИЗ
    |	&ТЗТекущая КАК ТЗТекущая
    |;
    
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	смартПредопределенныеЗначенияЗначения.Значение КАК СинонимРеквизита,
    |	ВременнаяТЗ.ОписаниеОшибки КАК ОписаниеОшибки
    |ИЗ
    |	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТЗ КАК ВременнаяТЗ
    |		ПО (ВременнаяТЗ.СинонимРеквизита = смартПредопределенныеЗначенияЗначения.Значение)
    |ГДЕ
    |	смартПредопределенныеЗначенияЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СинонимыПолейЗаявки)";
    
    Запрос.УстановитьПараметр("ТЗТекущая",Параметры.Ключ.смартОшибкиВРеквизитах.Выгрузить());
    
    РезультатЗапроса = Запрос.Выполнить();
    Если НЕ РезультатЗапроса.Пустой() Тогда
        смартОшибкиВРеквизитах.Загрузить(РезультатЗапроса.Выгрузить());
    КонецЕсли; 
    //
  //  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  //  
  //  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
  //      Если Не смартОшибкиВРеквизитах.Количество() Тогда
  //          НовСтрокаТЧ=смартОшибкиВРеквизитах.Добавить();
  //          НовСтрокаТЧ.СинонимРеквизита=ВыборкаДетальныеЗаписи.Значение;
  //      КонецЕсли; 
  //      Для каждого стр Из смартОшибкиВРеквизитах Цикл
  //          Если Стр.СинонимРеквизита=ВыборкаДетальныеЗаписи.Значение Тогда
  //          иначе
  //              НовСтрокаТЧ=смартОшибкиВРеквизитах.Добавить();
  //              НовСтрокаТЧ.СинонимРеквизита=ВыборкаДетальныеЗаписи.Значение;
  //          КонецЕсли; 
  //      КонецЦикла; 
  //  КонецЦикла;
  //     
КонецПроцедуры //-- смарт:ПА #815 10.12.2021 17:34:32





