// Процедура чтения табличной части Менеджеры в дерево значений
//
// Параметры
//  Дерево  – <ДеревоЗначений> - дерево значений, в которое осуществляется чтение
//
Процедура СформироватьДеревоДоступныхПолей() Экспорт
	
	//ДеревоДоступныеПоля.Строки.Очистить();
	
	
	//Если ИмяДокумента="" Тогда // Это закомментируй, оно - для теста
	//	ИмяДокумента="РеализацияТоваровУслуг"; 
	//КонецЕсли;
	ВыбранныйОбъектОбъект = ТИП(ТипДокумента);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ВыбранныйОбъектОбъект);
	//ОбъектМетаданных.Реквизиты
	
	//ЗаполнитьДерево(Коряга,Метаданные.Документы[ИмяДокумента].Реквизиты);
	ЗаполнитьДерево( ДеревоДоступныеПоля, ОбъектМетаданных.Реквизиты);
	//Для Каждого ТЧ Из Метаданные.Документы[ИмяДокумента].ТабличныеЧасти Цикл
	Для Каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
		ЗаполнитьТЧ(ДеревоДоступныеПоля,ТЧ);
	КонецЦикла;	
	
	////мДеревоМенеджеров = Дерево.Скопировать();
	//
	////СписокПолей = ПолучитьПоляМетаданного(СсылкаНаДокумент);
	//КоличествоУровней = 20;
	//СписокПолей = ПолучитьПоляМетаданного(ТИП(ТипДокумента));

	//// Записываем строки табличной части в дерево значений
	//ПоляОбъектаВДерево(ДеревоДоступныеПоля, СписокПолей, КоличествоУровней);
	//
	////Дерево = мДеревоМенеджеров.Скопировать();
	
КонецПроцедуры // ПрочитатьДеревоПланов

Процедура Устарел_СформироватьДеревоДоступныхПолей() Экспорт
	
	ДеревоДоступныеПоля.Строки.Очистить();
	
	//мДеревоМенеджеров = Дерево.Скопировать();
	
	//СписокПолей = ПолучитьПоляМетаданного(СсылкаНаДокумент);
	КоличествоУровней = 20;
	СписокПолей = ПолучитьПоляМетаданного(ТИП(ТипДокумента));

	// Записываем строки табличной части в дерево значений
	ПоляОбъектаВДерево(ДеревоДоступныеПоля, СписокПолей, КоличествоУровней);
	
	//Дерево = мДеревоМенеджеров.Скопировать();
	
КонецПроцедуры // ПрочитатьДеревоПланов

Функция ПолучитьПоляМетаданного(ТекущийОбъект)

	//КС = Новый КвалификаторыСтроки(20);
	//	Массив.Добавить(Тип("Строка"));
	//ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	//ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ТекущийОбъект));
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТекущийОбъект);
	
	СписокРеквизитов = Новый СписокЗначений;
	Если Не ОбъектМетаданных = Неопределено Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			//Если Реквизит.Тип = ТИП("Булево") Тогда 
				СписокРеквизитов.Добавить(Реквизит.Имя, Реквизит.Синоним);
			//КонецЕсли;	
		КонецЦикла;
		Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			//Если Реквизит.Тип = ТИП("Булево") Тогда 
				СписокРеквизитов.Добавить(Реквизит.Имя, Реквизит.Имя);
			//КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	 
	Возврат СписокРеквизитов;
	
КонецФункции

Процедура ПоляОбъектаВДерево(СтрокаДерева, СписокПолей, КоличествоУровней)
	
	//ДочерниеСтроки = ТекущиеДанные.ПолучитьЭлементы();
	Для каждого РеквизитОбъекта Из СписокПолей Цикл
		
		ТекущаяСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.ДоступныеПоля = РеквизитОбъекта;
		//ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДерева, РеквизитОбъекта);
		
		// Превышено количество вложенных уровней дерева
		Если ТекущаяСтрокаДерева.Уровень() > КоличествоУровней Тогда 
			Возврат;
		КонецЕсли;	
		
		СписокПолейВложенных = ПолучитьПоляМетаданного(ТипЗнч(РеквизитОбъекта));
		ПоляОбъектаВДерево(ТекущаяСтрокаДерева, СписокПолейВложенных, КоличествоУровней);
		
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
//////////// из обработки Инфостарта ///////////////////////
Процедура ЗаполнитьПоСпискуРеквизитов(Строка,СписокРеквизитов)
	
	Для Каждого Рекв Из СписокРеквизитов Цикл
		НовСтрока=Строка.Строки.Добавить();
		НовСтрока.Реквизит=Рекв.Имя;
		НовСтрока.Реквизитпредставление=Рекв.Синоним;
		НовСтрока.ТипРеквизита=Рекв.Тип;
		Если ТипЗнч(Строка)=Тип("ДеревоЗначений") Тогда
			НовСтрока.ПолноеИмя=Рекв.Имя;
		Иначе
			НовСтрока.ПолноеИмя=Строка.ПолноеИмя + ?(ЗначениеЗаполнено(Строка.ПолноеИмя),".","") + Рекв.Имя;
		КонецЕсли;
		Типы=Рекв.Тип.Типы();
		
		Есть=Ложь;
		Для К=0 По Типы.ВГраница() Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(Типы[К]) ИЛИ Документы.ТипВсеСсылки().СодержитТип(Типы[К]) Тогда 
				Нов=НовСтрока.Строки.Добавить();
				Нов.Реквизит="+++";
				Есть=Истина;
				НовСтрока.РеквизитСсылка=Рекв;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьДерево(Строка,СписокРеквизитов)
	Строка.Строки.Очистить();
	ЗаполнитьПоСпискуРеквизитов(Строка,СписокРеквизитов);
КонецПроцедуры

Процедура ЗаполнитьТЧ(Строка,ТЧ)
	НовСтрока=Строка.Строки.Добавить();
	НовСтрока.Реквизит=ТЧ.Имя;
	НовСтрока.ТипРеквизита = "(ТабличнаяЧасть)";
	НовСтрока.РеквизитПредставление=ТЧ.Синоним+" (табличная часть)";
	ЗаполнитьПоСпискуРеквизитов(НовСтрока,ТЧ.Реквизиты);
КонецПроцедуры	

// ОБработка раскрытия ветки дерева
Процедура КорягаПередРазворачиванием(Строка) Экспорт 
	
	Если Строка.Строки[0].Реквизит="+++" Тогда
		Типы=Строка.РеквизитСсылка.Тип.Типы();
		Для К=0 По Типы.ВГраница() Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(Типы[К]) ИЛИ Документы.ТипВсеСсылки().СодержитТип(Типы[К]) Тогда 
				СписокРеквизитов=Метаданные.НайтиПоТипу(Типы[К]).Реквизиты;
				ЗаполнитьДерево(Строка,СписокРеквизитов);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	//УстановитьКартинкиКоряги(Коряга);
КонецПроцедуры
