
#Область ОбработчикиСобытийФормыЭлементов

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаНачала = ТекущаяДата();
		Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, 6);
		ПроверитьДатуОкончания();
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, 6);
		ПроверитьДатуОкончания();
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартДатаОкончанияПриИзменении(Элемент)
	
	ПроверитьДатуОкончания();
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартПартнерыИКонтактныеЛицаПартнерПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ТекущиеДанные = Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда			
			Объект.Наименование = ТекущиеДанные.Партнер;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

#КонецОбласти

#Область ПрочиеПроцедурыФункции

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура ДобавитьИзменитьЭлементыФормы()
	
	// Добавление поля Родитель (Направление) на форму
	ЭлементРодитель = Элементы.Вставить("смартРодитель", Тип("ПолеФормы"),, Элементы.ГруппаСтраницы);
	ЭлементРодитель.ПутьКДанным = "Объект.Родитель";
	ЭлементРодитель.Заголовок 	= "Направление";
	ЭлементРодитель.Вид = ВидПоляФормы.ПолеВвода;
	
	// Добавление обработчика события стандартным элементам
	Элементы.ДатаНачала.УстановитьДействие("ПриИзменении", "смартДатаНачалаПриИзменении");
	Элементы.ДатаОкончания.УстановитьДействие("ПриИзменении", "смартДатаОкончанияПриИзменении");
	Элементы.ПартнерыИКонтактныеЛицаПартнер.УстановитьДействие("ПриИзменении", "смартПартнерыИКонтактныеЛицаПартнерПриИзменении");
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура ПроверитьДатуОкончания()
	
	МаксимальнаяДатаОкончания = ДобавитьМесяц(ТекущаяДата(), 6);
	
	Если Объект.ДатаОкончания > МаксимальнаяДатаОкончания Тогда
		Объект.ДатаОкончания = МаксимальнаяДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

#КонецОбласти



