
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьГруппуОповещений")
Процедура смарт_ЗаполнитьГруппуОповещений()
	
	#Удаление //++ #1694 смарт: Фролов 22.03.2024 //Изменение канала напоминания пользователю о взаимодействиях, задачах
	ИспользоватьНапоминания					= Константы.CRM_ИспользоватьНапоминания.Получить();
	#КонецУдаления
	
	#Вставка
	ИспользоватьНапоминания					= Истина;
	#КонецВставки //-- #1694 смарт: Фролов 22.03.2024
	
	ИспользоватьОповещенияСМС				= Константы.CRM_ИспользоватьОповещенияСМС.Получить();
	ИспользоватьОповещенияЭлектроннаяПочта	= Константы.CRM_ИспользоватьОповещенияЭлектроннаяПочта.Получить();
	Если НЕ ТекущийПользовательУчастник Тогда
		// Не нужно отрисовывать оповещения, если пользователь не имеет отношения к взаимодействию.
		Возврат;
	КонецЕсли;
	ЗаполнитьТаблицуОповещений(ТекущийПользователь);
	МассивДобавляемыхРеквизитов = Новый Массив();
	// Всего предполагается 5 полей оповещений, по аналогии с гуглом.
	Ид = 0;
	Пока НЕ Ид = 5 Цикл
		Ид = Ид + 1;
		ОписаниеТиповКанал = Новый ОписаниеТипов("ПеречислениеСсылка.CRM_КаналыОповещений");
		НовыйРеквизит = Новый РеквизитФормы("_КаналОповещения"+Строка(Ид), ОписаниеТиповКанал);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ОписаниеТиповСрок = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
		НовыйРеквизит = Новый РеквизитФормы("_СрокОповещения"+Строка(Ид), ОписаниеТиповСрок);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ОписаниеТиповПериод = Новый ОписаниеТипов("ПеречислениеСсылка.CRM_ПериодичностьОповещений");
		НовыйРеквизит = Новый РеквизитФормы("_ПериодОповещения"+Строка(Ид), ОписаниеТиповПериод);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ОписаниеТиповСрок = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		НовыйРеквизит = Новый РеквизитФормы("_ДатаОповещения"+Строка(Ид), ОписаниеТиповСрок);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НоваяКомандаФормы = Команды.Добавить("УдалитьОповещение_"+Строка(Ид));
		НоваяКомандаФормы.Заголовок					= "Удалить";
		НоваяКомандаФормы.Подсказка					= "Удалить оповещение";
		НоваяКомандаФормы.Действие					= "Подключаемый_УдалитьОповещение";
		НоваяКомандаФормы.ИзменяетСохраняемыеДанные	= Истина;
	КонецЦикла;
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	Ид = 0;
	Для Каждого СтрокаТаб Из _ТаблицаОповещений Цикл
		Ид = Ид + 1;
		Если Ид > 5 Тогда Прервать; КонецЕсли; 
		ЭлементГруппа = Элементы.Добавить("ГруппаКанала_"+Строка(Ид),Тип("ГруппаФормы"),Элементы.ГруппаОповещений);
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ЭлементГруппа.ОтображатьЗаголовок = Ложь;
		СтрокаТаб.ИмяПоля = "ПолеКанала_"+Строка(Ид);
		Элемент = Элементы.Добавить("ПолеКанала_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					="_КаналОповещения"+Строка(Ид);
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.МаксимальнаяШирина		= 16;
		Элемент.Ширина					= 0;
		Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НачалоВыбора");
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_КаналОповещения"+Строка(Ид)] = СтрокаТаб.Канал;
		Элемент = Элементы.Добавить("ДекорацияПолеСрокаОповещения_"+Строка(Ид),Тип("ДекорацияФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидДекорацииФормы.Надпись;
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.Заголовок = НСтр("ru='за';en='for'");
		Элемент = Элементы.Добавить("ПолеСрокаОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_СрокОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.КнопкаРегулирования			= Истина;
		Элемент.АвтоМаксимальнаяШирина		= Ложь;
		Элемент.МаксимальнаяШирина			= 6;
		Элемент.ГоризонтальноеПоложение		= ГоризонтальноеПоложениеЭлемента.Центр;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_СрокОповещения"+Строка(Ид)] = СтрокаТаб.СрокОповещения;
		Элемент = Элементы.Добавить("ПолеПериодаОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_ПериодОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.АвтоМаксимальнаяШирина		= Ложь;
		Элемент.МаксимальнаяШирина			= 5;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_ПериодОповещения"+Строка(Ид)] = СтрокаТаб.Периодичность;
		НовыйЭлемент = Элементы.Добавить("Кнопка_УдалитьОповещение_"+Строка(Ид),Тип("КнопкаФормы"), ЭлементГруппа);
		НовыйЭлемент.ИмяКоманды			= "УдалитьОповещение_"+Строка(Ид);
		НовыйЭлемент.Заголовок			= "Удалить";
		НовыйЭлемент.Картинка			= БиблиотекаКартинок.CRM_УдалитьСерая;
		НовыйЭлемент.ОтображениеФигуры	= ОтображениеФигурыКнопки.Нет;
		НовыйЭлемент.Отображение		= ОтображениеКнопки.Картинка;
		Элемент = Элементы.Добавить("ПолеДатыОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеНадписи;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_ДатаОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.ТолькоПросмотр				= Истина;
		ЭтотОбъект["_ДатаОповещения"+Строка(Ид)] = СтрокаТаб.ДатаОповещения;
		Элемент.Ширина						= 12;
		Если ЭтотОбъект["_ДатаОповещения" + Строка(Ид)] < CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса() Тогда
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения меньше текущего времени';en='Schedulable date of the notification is less than the current time'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
			Элемент.ЦветТекста				= Новый Цвет(255, 0, 0);
		Иначе	
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения';en='Schedulable date of the notification'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Всплывающая;
			Элемент.ЦветТекста				= Новый Цвет(0, 0, 0);
		КонецЕсли;	
	КонецЦикла;
	Элементы.ГруппаОповещений.Видимость			= (Ид > 0);
	Элементы.ДобавитьНовоеОповещение.Видимость	= (Ид < 5);
	ПересчитатьДатыОповещений();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("ОткрыватьФорму")
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		#Вставка
		//++ #Б-3334 смарт: Фролов 20.05.2025 //Ошибка. В рабочем столе сотрудника взаимодействия по заказу клиента не корректно открываются.
		И ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.ЗаказКлиента")
		//-- #Б-3334 смарт: Фролов 20.05.2025
		//++ #Б-3640 смарт: Фролов 27.06.2025 //Добавление функционала работы с взаимодействиями в заявки СЦ. 
		И ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")
		И ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы")
		//-- #Б-3640 смарт: Фролов 27.06.2025
		#КонецВставки
		И ТипЗнч(Объект.ДокументОснование)<>Тип("СправочникСсылка.CRM_ЖурналыВстреч") Тогда
		// CRM Модуль
		//НеОбрабатыватьОткрытие = Истина;
		//Возврат;
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		Если МодульУправлениеДоступом <> Неопределено Тогда
			НеОбрабатыватьОткрытие = МодульУправлениеДоступом.ЧтениеРазрешено(Объект.ДокументОснование);
		Иначе
			НеОбрабатыватьОткрытие = Истина;
		КонецЕсли;
		Если НеОбрабатыватьОткрытие Тогда
			Возврат;
		КонецЕсли;
		// CRM Модуль
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "КоманднаяПанельФормы");
		ДополнительныеПараметры.Вставить("Объект", Объект);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		
		#Вставка 
		//++ #Б-3640 смарт: Фролов 26.06.2025 //Добавление функционала работы с взаимодействиями в заявки СЦ.
		Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			
			Если Параметры.Свойство("ДокументОснование")
				И (ТипЗнч(Параметры.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы")
				ИЛИ ТипЗнч(Параметры.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")) Тогда
				
				Объект.ДокументОснование = Параметры.ДокументОснование;
				Объект.Партнер = Параметры.Партнер;
				Объект.КонтактноеЛицо = Параметры.КонтактноеЛицо;
				Объект.ВидВзаимодействия = Параметры.ВидВзаимодействия;	
				
			КонецЕсли;
			
		КонецЕсли;
		//-- #Б-3640 смарт: Фролов 27.06.2025
		#КонецВставки
		
		Если Параметры.Свойство("ВидВзаимодействия") И
			ЗначениеЗаполнено(Параметры.ВидВзаимодействия) Тогда
			Объект.ВидВзаимодействия = Параметры.ВидВзаимодействия;
		КонецЕсли;
		
	КонецЕсли;

	ОткрытоИзФормыНапоминаний = Ложь;
	Параметры.Свойство("ОткрытоИзФормыНапоминаний", ОткрытоИзФормыНапоминаний);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ОтрисоватьКатегорииНаФорме();
	ЗаполнитьГруппуОповещений();
	ПериодическоеСтароеЗначение = Объект.Периодическое;

	СписокТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	СписокТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	CRM_УправлениеКонтактнойИнформацией.ИнициализацияКонтактнойИнформации(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.Партнер, "ГруппаКИКлиента", СписокТиповКИ.ВыгрузитьЗначения());
		CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.КонтактноеЛицо, "ГруппаКИКонтакта", СписокТиповКИ.ВыгрузитьЗначения());
	ИначеЕсли ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда	
		CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.ПотенциальныйКлиент, "ГруппаКИПотенциальногоКлиента", СписокТиповКИ.ВыгрузитьЗначения());
	КонецЕсли;

	ЗаполнитьУчастников();
	ПараметрыВыбораВида = Новый Массив;

	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.Направление", Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее));
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес));
			СостоянияИнтереса = Новый Массив;
			УстановитьПривилегированныйРежим(Истина);
			СостоянияИнтереса.Добавить(Объект.ДокументОснование.СостояниеИнтереса);
			УстановитьПривилегированныйРежим(Ложь);
			СостоянияИнтереса.Добавить(Справочники.CRM_СостоянияИнтересов.ПустаяСсылка());
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.СостояниеИнтереса", Новый ФиксированныйМассив(СостоянияИнтереса)));
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.Задача_ЗадачаИсполнителя));
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("СправочникСсылка.CRM_ЖурналыВстреч") Тогда
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));	
		Иначе
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));
		КонецЕсли;
	Иначе
		ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));
	КонецЕсли;

	Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВида);

	Если ТипЗнч(Объект.ДокументОснование) = Тип("СправочникСсылка.CRM_ЖурналыВстреч") Тогда
		Элементы.ОбъектВзаимодействия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.CRM_ЖурналыВстреч");
	#Удаление //#Б-2860 смарт: Лопато 23.05.2025 //Автозадачи по заказам. Контроль наличия закрывающих документов после отгрузки.
	Иначе	
		Элементы.ОбъектВзаимодействия.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.CRM_Интерес");
	#КонецУдаления	
	КонецЕсли;

	Если ТолькоПросмотр Тогда
		Элементы.ДекорацияВыбратьГруппу.Доступность = Ложь;
	КонецЕсли;
	СформироватьПредставлениеВложений();
	CRM_ОбщегоНазначенияПовтИсп.ЗаполнитьСписокВыбораВариантовСроков(Элементы.ДатаНачала);

	ЭтоВстречаЖурнала = ТипЗнч(Объект.ДокументОснование) = Тип("СправочникСсылка.CRM_ЖурналыВстреч");

	Если ЭтоВстречаЖурнала Тогда
		ПараметрыВыбораВидВзаимодействия = Новый Массив;
		ПараметрыВыбораВидВзаимодействия.Добавить(Новый ПараметрВыбора("Отбор.ПланироватьвЖурналеВстреч", Истина));
		Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВидВзаимодействия);
	КонецЕсли;

	Если ЭтоВстречаЖурнала Тогда
		Элементы.ГруппаПериодВзаимодействия.Доступность = НЕ (Объект.ДокументОснование.Статус = Перечисления.CRM_СтатусыСогласованияПланированияВстреч.Действует);

		Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Объект.ДокументОснование) Тогда
			МассивЗадач = CRM_БизнесПроцессыСервер.ПолучитьНеВыполненныеЗадачи(Объект.ДокументОснование, Ложь);	
			Если МассивЗадач.Количество() > 0 Тогда
				ТекущаяЗадача = МассивЗадач[0];
				Если ТекущаяЗадача.Исполнитель <> Пользователи.ТекущийПользователь() Тогда
					Элементы.ГруппаПериодВзаимодействия.Доступность = Ложь;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	Если Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
		Элементы.Состояние.ЦветФона = ?(Объект.ПосещениеПодтверждено, WebЦвета.СветлоЗеленый, WebЦвета.ЛососьСветлый);
	КонецЕсли;	

	Элементы.ГруппаЧекЛист.Видимость = (Объект.ЧекЛист.Количество() > 0);
	ПоследнееСостояниеВзаимодействия = Объект.СтатусВзаимодействия;
	Элементы.ГруппаАдресОфиса.Видимость	= ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПланированиеВстреч");
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ОповещениеПриИзменении")
// Динамически подключаемый обработчик изменения оповещения.
//
// Параметры:
//	Элемент	- ЭлементФормы	- Элемент формы.
//
Процедура смарт_Подключаемый_ОповещениеПриИзменении(Элемент)
	Если Найти(Элемент.Имя, "ПолеКанала_") > 0 Тогда
		ИдПолей = СтрЗаменить(Элемент.Имя, "ПолеКанала_","");
		#Вставка
		//++ #1407 смарт: Фролов 18.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
		Если ЭтаФорма["_КаналОповещения"+ИдПолей]=ПредопределенноеЗначение("Перечисление.CRM_КаналыОповещений.СМС") ТОгда
			Сообщить("Оповещение по sms не подключено.");
			ЭтаФорма["_КаналОповещения"+ИдПолей]=Неопределено;
			Возврат; 
		ИначеЕсли  ЭтаФорма["_КаналОповещения"+ИдПолей]=ПредопределенноеЗначение("Перечисление.CRM_КаналыОповещений.ЭлектроннаяПочта") ТОгда
			Успех=смартПроверитьЭлектроннуюПочтуПользователя(Объект.Ответственный);
			Если Не Успех ТОгда
				ЭтаФорма["_КаналОповещения"+ИдПолей]=Неопределено;
				Возврат; 
			КонецЕсли;	
		КонецЕсли;	
		//-- #1407 смарт: Фролов 18.09.2023
		#КонецВставки
	ИначеЕсли Найти(Элемент.Имя, "ПолеСрокаОповещения_") > 0 Тогда
		ИдПолей = СтрЗаменить(Элемент.Имя, "ПолеСрокаОповещения_","");
	ИначеЕсли Найти(Элемент.Имя, "ПолеПериодаОповещения_") > 0 Тогда
		ИдПолей = СтрЗаменить(Элемент.Имя, "ПолеПериодаОповещения_","");
	КонецЕсли; 
	Если (Найти(Элемент.Имя, "ПолеСрокаОповещения_") > 0)
		ИЛИ (Найти(Элемент.Имя, "ПолеПериодаОповещения_") > 0) Тогда
		ДатаОповещения = ДатаНачала;
		ВремяОповещения = ВремяНачала;
		СрокОповещения = ЭтотОбъект["_СрокОповещения" + Строка(ИдПолей)];
		СтруктураОповещения = Новый Структура;
		СтруктураОповещения.Вставить("Предмет",			Новый Структура(" Дата", CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОповещения, ВремяОповещения)));
		СтруктураОповещения.Вставить("ВидОповещения",	ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ЗапланированныеСобытия"));
		СтруктураОповещения.Вставить("СрокОповещения",	СрокОповещения);
		СтруктураОповещения.Вставить("Периодичность",	ЭтотОбъект["_ПериодОповещения" + Строка(ИдПолей)]);
		СтруктураОповещения.Вставить("Получатель",		ПользователиКлиентСервер.ТекущийПользователь());
		СтруктураОповещения.Вставить("ВпередПоКалендарю", Ложь);
		ЭтотОбъект["_ДатаОповещения"+Строка(ИдПолей)]					= CRM_ОповещенияСервер.ПолучитьДатуОповещения(СтруктураОповещения);
		Элемент	= Элементы["ПолеДатыОповещения_" + Строка(ИдПолей)];
		Если ЭтотОбъект["_ДатаОповещения" + Строка(ИдПолей)] < CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса() Тогда
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения меньше текущего времени';en='Schedulable date of the notification is less than the current time'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
			Элемент.ЦветТекста				= Новый Цвет(255, 0, 0);
		Иначе	
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения';en='Schedulable date of the notification'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Всплывающая;
			Элемент.ЦветТекста				= Новый Цвет(0, 0, 0);
		КонецЕсли;	
	КонецЕсли;
	ПриИзмененииОповещения(ИдПолей);
	ПризнакИзмененыОповещения = Истина;
	CRM_ШаблоныОбъектовКлиент.ПоместитьКомандыГруппыТолькоВоВсеДействия(ЭтотОбъект);
КонецПроцедуры // Подключаемый_ОповещениеПриИзменении()

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
//++ #1407 смарт: Фролов 21.09.2023 //Доработки по итогу встречи "Настройки CRM" от 21.07.2023
Функция смартПроверитьЭлектроннуюПочтуПользователя(Ответственный)
	Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Объект.Ответственный, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты); 
	Если Таб.Количество() = 0 Тогда 
		Сообщить("У ответственного не указана электронная почта для оповещения. Пожалуйста обратитесь в поддержку!"); 
		Возврат Ложь;
	КонецЕсли;
	Для Каждого СтрокаТаб Из Таб Цикл
		Если СтрокаТаб.Вид.CRM_ИспользоватьДляОповещений Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	Сообщить("У ответственного не указана электронная почта для оповещения. Пожалуйста обратитесь в поддержку!"); 
	Возврат Ложь;
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТаблицуОповещений")
//++ #Б-2332 смарт: Фролов 21.02.2025 //Ошибка. При создании взаимодействия или задачи ставится напоминание в системе.
Процедура смарт_ЗаполнитьТаблицуОповещений(Пользователь)
	#Удаление //++ #Б-2332 смарт: Фролов 21.02.2025 //Ошибка. При создании взаимодействия или задачи ставится напоминание в системе.
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИспользоватьНапоминания", ИспользоватьНапоминания);
	ДополнительныеПараметры.Вставить("ИспользоватьОповещенияСМС", ИспользоватьОповещенияСМС);
	ДополнительныеПараметры.Вставить("ИспользоватьОповещенияЭлектроннаяПочта", ИспользоватьОповещенияЭлектроннаяПочта);
	ДополнительныеПараметры.Вставить("ПлановаяДата", Объект.ПлановаяДата);
	ДополнительныеПараметры.Вставить("Ответственный", Объект.Ответственный);
	CRM_ОповещенияСервер.ЗаполнитьТаблицуОповещений(Объект.Ссылка, _ТаблицаОповещений, Пользователь, ПризнакИзмененыОповещения, ДополнительныеПараметры);
	#КонецУдаления
КонецПроцедуры //-- #Б-Задача смарт: Фролов 21.02.2025

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	#Вставка
	//++ #Б-6638 смарт: Фролов 19.06.2026 //Указание причины переноса взаимодействия. Пока только для СЦ.
	Если НЕ ТекущийОбъект.Ссылка.Пустая() Тогда
		
		Если НЕ ТекущийОбъект.ПлановаяДата = ТекущийОбъект.Ссылка.ПлановаяДата И НЕ ЗначениеЗаполнено(ТекущийОбъект.смартПричинаПереносаСрока) Тогда
			
			Если ЗначениеЗаполнено(ТекущийОбъект.Партнер) И ТекущийОбъект.Партнер.смартОсновнойМенеджерСервисЦентра = ТекущийОбъект.Ответственный Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Заполните причину переноса сроков!", , "Объект.смартПричинаПереносаСрока");
				Отказ = Истина;
				Возврат;
			
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-6638 смарт: Фролов 19.06.2026
	#КонецВставки
	
	ЭтоНовыйОбъект = ТекущийОбъект.Ссылка.Пустая();
	ПризнакНовогоМероприятия = ЭтоНовыйОбъект;
	Если ТекущийОбъект.СтатусВзаимодействия.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.Завершено И ТекущийОбъект.СтатусВзаимодействия<>ТекущийОбъект.Ссылка.СтатусВзаимодействия Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) И ТипЗнч(ТекущийОбъект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			УстановитьПривилегированныйРежим(Истина);
			ТекущийОбъект.СостояниеИнтереса = ТекущийОбъект.ДокументОснование.СостояниеИнтереса;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		ТекущийОбъект.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
		ТекущийОбъект.ЗавершившийПользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;	
	Если ТекущийОбъект.СтатусВзаимодействия.ТипСостояния <> Перечисления.CRM_ТипыСостоянийСобытий.Завершено И ЗначениеЗаполнено(ТекущийОбъект.ДатаЗавершенияВзаимодействия) Тогда
		ТекущийОбъект.ДатаЗавершенияВзаимодействия = Дата(1,1,1);
	КонецЕсли;
	ТекущийОбъект.ОрганизаторGApi = ТекущийОбъект.Ответственный;
	ТекущийОбъект.СторонниеЛица.Свернуть("Партнер,КонтактноеЛицо,ПотенциальныйКлиент,Адрес,ПредставлениеАдреса,Принадлежность,Телефон,ПосетитМероприятие,АдресОфиса","ОтправлятьСМС,ОтправлятьПоПочте");
	// Периодичность
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПериодическоеСобытиеСпособИзмененияРяда",ПериодическоеСобытиеСпособИзмененияРяда);
	Если ЗначениеЗаполнено(ТекущийОбъект.РядСобытий) Тогда
		Если (ПризнакПериодическоеСобытиеИнициализация Или ПризнакИзмененоРасписание) И ТекущийОбъект.Периодическое Тогда
			Если ПризнакПериодическоеСобытиеИнициализация Тогда
				ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд";
			КонецЕсли;
			Если ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд" Тогда
				МассивДатРасписания = Справочники.CRM_РядыСобытий.ПолучитьМассивДатРасписания(ТекущийОбъект.РядСобытий.ДатаНачала, ТекущийОбъект.РядСобытий.ДатаОкончания, ТекущийОбъект.РядСобытий);
			ИначеЕсли ПериодическоеСобытиеСпособИзмененияРяда = "ДоКонцаРяда" Тогда
				МассивДатРасписания = Справочники.CRM_РядыСобытий.ПолучитьМассивДатРасписания(ТекущийОбъект.ПлановаяДата, ТекущийОбъект.РядСобытий.ДатаОкончания, ТекущийОбъект.РядСобытий);
			Иначе
				МассивДатРасписания = Справочники.CRM_РядыСобытий.ПолучитьМассивДатРасписания(ТекущийОбъект.РядСобытий.ДатаНачала, ТекущийОбъект.РядСобытий.ДатаОкончания, ТекущийОбъект.РядСобытий);
			КонецЕсли;
			Если МассивДатРасписания.Количество() = 0 Тогда
				Если ПризнакПериодическоеСобытиеИнициализация Или ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд" Тогда
					Отказ = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Расписание периодического события настроенно некорректно - в указанный период не попадает ни одного события!';en='The schedule of periodic event are adjust incorrectly - to the specified period did not get any event!'"));
					Элементы.РядСобытийНаименование.Доступность = (Объект.Периодическое И ЗначениеЗаполнено(Объект.РядСобытий) И Не Объект.ИзмененоВРяде);
					Элементы.РядСобытийНаименование.Видимость = Объект.Периодическое;
					Возврат;
				КонецЕсли;
			Иначе
				ДатаВремяПервоеСобытие = МассивДатРасписания[0];
				ТекущийОбъект.ПлановаяДата = НачалоДня(ДатаВремяПервоеСобытие) + (ТекущийОбъект.ПлановаяДата - НачалоДня(ТекущийОбъект.ПлановаяДата)) ;
				ТекущийОбъект.ПлановаяДатаЗавершение = НачалоДня(ДатаВремяПервоеСобытие) + (ТекущийОбъект.ПлановаяДатаЗавершение - НачалоДня(ТекущийОбъект.ПлановаяДатаЗавершение));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Признаки. по которым в дальнейшем после записи будем определять, надо ли	оповестить участников мероприятия.
	ЭтоНовыйОбъект = ТекущийОбъект.Ссылка.Пустая();
	ПризнакНовогоМероприятия = ЭтоНовыйОбъект;
	Если НЕ ЭтоНовыйОбъект Тогда
		Если НЕ (ТекущийОбъект.ПлановаяДата = ТекущийОбъект.Ссылка.ПлановаяДата) ИЛИ НЕ (ТекущийОбъект.ПлановаяДатаЗавершение = ТекущийОбъект.Ссылка.ПлановаяДатаЗавершение) Тогда
			ПризнакИзмененаДата = Истина;
		КонецЕсли;
		Если НЕ (ТекущийОбъект.Место = ТекущийОбъект.Ссылка.Место) Тогда
			ПризнакИзмененоМестоМероприятия = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ (Год(ТекущийОбъект.Дата) = Год(ТекущийОбъект.Ссылка.Дата)) Тогда
		ТекущийОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	ПроверитьНаличиеНовыхУчастников(ТекущийОбъект);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбъектЗаписанПользователем");
	Если ТекущийПользователь = Объект.Ответственный Или Не ПризнакНовогоМероприятия Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеСоздаватьОповещенияПоУмолчанию");
	КонецЕсли;
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства 
	
	#Вставка
	//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
	Если ЗначениеЗаполнено(ТекущийОбъект.смартВидЗадачи) И ТекущийОбъект.смартВидЗадачи.Акция Тогда
		
		Если НЕ ТекущийОбъект.СтатусВзаимодействия = ТекущийОбъект.Ссылка.СтатусВзаимодействия
			И (ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено
			ИЛИ ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено) Тогда
			
			Если СокрЛП(ТекущийОбъект.Результат) = "" Тогда
				
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю("Обязательно заполните результат!", , "Результат");
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если ТекущийОбъект.ПлановаяДата > ТекущийОбъект.смартВидЗадачи.ДатаОкончанияАкции 
			//++ #Б-4522 смарт: Фролов 01.10.2025 //Ошибка при завершении Акционного взаимодействия. 
			И НЕ (ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено
			ИЛИ ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено) Тогда
			//-- #Б-4522 смарт: Фролов 01.10.2025
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Дата окончание акции " + Формат(ТекущийОбъект.смартВидЗадачи.ДатаОкончанияАкции, "ДФ=dd.MM.yyyy")
				+ ", вы пытаетесь запланировать взаимодействие позже!", , "ДатаНачала");
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-4382 смарт: Фролов 22.09.2025	
	
	//++ #Б-6346 смарт: Фролов 14.05.2026 //Взаимодействие. Внедрение контроля за встречами со связями к интересам.
	Если ТекущийОбъект.ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ВыезднаяВстречаИнтерес
		ИЛИ ТекущийОбъект.ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ВыезднаяВстречаПартнер Тогда
				
		Если ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Запланировано
			ИЛИ ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.ВРаботе Тогда
			
			Если СокрЛП(ТекущийОбъект.Содержание) = "" Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнено описание",,, "Объект.Содержание", Отказ);	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.КонтактноеЛицо) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнено Контактное лицо",,, "Объект.КонтактноеЛицо", Отказ);	
				
			КонецЕсли;	
			
		ИначеЕсли ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда	
			
			Если СокрЛП(ТекущийОбъект.Результат) = "" Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнено описание",,, "Объект.Результат", Отказ);	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.смартРезультатВстречи) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнен Результат встречи",,, "Объект.смартРезультатВстречи", Отказ);	
				
			КонецЕсли;
			
			//++ #Б-7440 смарт: Фролов 15.07.2026 //Взаимодействие. Выездная встреча. Доработка.
			Если ЗначениеЗаполнено(ТекущийОбъект.смартРезультатВстречи) 
				И ТекущийОбъект.смартРезультатВстречи = Перечисления.смартРезультатыВстреч.Положительный 
				И НЕ ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнен Интерес",,, "Объект.ДокументОснование", Отказ);	
				
			КонецЕсли;
			//-- #Б-7440 смарт: Фролов 15.07.2026
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-6346 смарт: Фролов 14.05.2026
	#КонецВставки
	
КонецПроцедуры //-- #Б-4382 смарт: Фролов 22.09.2025

&НаКлиенте
&ИзменениеИКонтроль("ДатаНачалаПриИзменении")
//++ #Б-5476 смарт: Фролов 28.01.2026 //Добавить проверку на максимальный срок взаимодействия в другие формы
Процедура смарт_ДатаНачалаПриИзменении(Элемент)
	
	#Вставка
	//++ #Б-5476 смарт: Фролов 28.01.2026 //Добавить проверку на максимальный срок взаимодействия в другие формы
	СрокМаксимальногоПланированияВзаимодействийВДнях = смартОбщегоНазначения.ПолучитьЗначениеСправочникаПредопределенныеПоНовому(
			"СрокМаксимальногоПланированияВзаимодействийВДнях");
		
	Если СрокМаксимальногоПланированияВзаимодействийВДнях > 0 
		И ДатаНачала > Объект.Дата + 3600 * 24 * СрокМаксимальногоПланированияВзаимодействийВДнях Тогда
			
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя планировать взаимодействия на срок более " + СрокМаксимальногоПланированияВзаимодействийВДнях + " дней!");
		ДатаНачала = Объект.ПлановаяДата;
		Возврат;	
			
	КонецЕсли;
	//-- #Б-5476 смарт: Фролов 28.01.2026
	#КонецВставки
	
	Если ЭтоВстречаЖурнала Тогда
		Если НЕ ПроверитьКорректностьДаты(ДатаНачала, "ДатаНачала") Тогда
			ДатаНачала = Объект.ПлановаяДата;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	СтараяДатаНачала	= Объект.ПлановаяДата; 
	Объект.ПлановаяДата	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	Если НачалоДня(Объект.ПлановаяДата) > НачалоДня(Объект.ПлановаяДатаЗавершение) Тогда
		Если НачалоДня(СтараяДатаНачала) = ДатаОкончанияПлан Тогда
			ДатаОкончанияПлан	= ДатаНачала;
		Иначе	
			ДатаОкончанияПлан	= НачалоДня(ДатаНачала + (Объект.ПлановаяДатаЗавершение - СтараяДатаНачала));
		КонецЕсли;	
		Объект.ПлановаяДатаЗавершение	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончанияПлан, ВремяОкончанияПлан);
	КонецЕсли;
	Если Объект.Периодическое Тогда
		ПризнакИзмененоРасписание = Истина;
	КонецЕсли;
	ПересчитатьДатыОповещений();
КонецПроцедуры //-- #Б-5476 смарт: Фролов 28.01.2026

#КонецОбласти 