
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ОтборПартнер", ПараметрКоманды);
	ПараметрыФормы.Вставить("БлокироватьИзменениеОтбораПоПартнеру", Истина);
	ПараметрыФормы.Вставить("ВидЖурнала", ПредопределенноеЗначение("Справочник.CRM_ГруппыУниверсальногоЖурнала.Контакты"));
	ПараметрыФормы.Вставить("БлокироватьИзменениеВидаЖурнала", Истина);
	ПараметрыФормы.Вставить("ОткрытаФормаЖурналаВзаимодействия", Истина);
	
	ОткрытьФорму("Обработка.CRM_УниверсальныйЖурналДокументов.Форма.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
