
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодписьИсходящегоПисьмаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура("Владелец",Запись.Пользователь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодписьНачалоВыбораЗавершение", ЭтотОбъект, Элемент.Имя);
	ОткрытьФорму("Справочник.CRM_Подписи.ФормаВыбора",Новый Структура("Отбор", СтруктураОтбора),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПодписьПересылаемогоПисьмаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура("Владелец",Запись.Пользователь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодписьНачалоВыбораЗавершение", ЭтотОбъект, Элемент.Имя);
	ОткрытьФорму("Справочник.CRM_Подписи.ФормаВыбора",Новый Структура("Отбор", СтруктураОтбора),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПодписьНачалоВыбораЗавершение(ВыбраннаяПодпись, ИмяПодписи) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяПодпись) Тогда
		Запись[ИмяПодписи] = ВыбраннаяПодпись;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

