#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
	
// Параметры:
//	 ВидУведомления - "Проведение" или "ОтменаПроведения"
Функция ОтправитьПисьма(ДокументСсылка, ВидУведомления, МассивСообщений = Неопределено) Экспорт
	
	Успех = Ложь;
	
	Если МассивСообщений = Неопределено Тогда
		МассивСообщений = Новый Массив;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Успех;
	КонецЕсли;
	
	
	НомерДокумента 	= ДокументСсылка.Номер;
	Контрагент 		= ДокументСсылка.Контрагент;
	Оборудование 	= ДокументСсылка.Оборудование;
	ЖелаемаяДата 	= ДокументСсылка.ЖелаемаяДатаИнсталляции;
	Представительство = ДокументСсылка.Представительство;
	
	ТекстОборудование = "";
	Для Каждого Строка Из Оборудование Цикл
		ТекстОборудование = ТекстОборудование + ?(ЗначениеЗаполнено(ТекстОборудование), Символы.ПС, "") + Строка.Оборудование;
	КонецЦикла;
	
	Если ВидУведомления = "Проведение" 
		ИЛИ ВидУведомления = "ПроведениеСоСтатусомОтправленаВПредставительство" Тогда
		
		ТемаПисьма = "Новая заявка на пусконаладку № " + НомерДокумента;
				
		ТекстПисьма = "Номер заявки " + НомерДокумента + Символы.ПС
		 + "Контрагент: " + Контрагент + Символы.ПС
		 + "Оборудование: " + ТекстОборудование + Символы.ПС
		 + "Желаемая дата инсталляции: " + Формат(ЖелаемаяДата, "ДФ='dd.MM.yyyy ""г.""'");
		 
	 ИначеЕсли ВидУведомления = "ОтменаПроведения" Тогда
		 
		ТемаПисьма = "Отмена заявки на пусконаладку № " + НомерДокумента;
		
		ТекстПисьма = "Заявка на пусконаладку № " + НомерДокумента + " отменена пользователем " + ПараметрыСеанса.ТекущийПользователь;
		// ++ 28.06.2020
		ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + "Контрагент: " + Контрагент 
		+ Символы.ПС + Символы.ПС + "Оборудование: " + ТекстОборудование;
		 // --
		
	Иначе 
		Возврат Успех;
	КонецЕсли;

	АдресаДляОтправкиСтрокой = "";
	Если ВидУведомления = "ПроведениеСоСтатусомОтправленаВПредставительство" Тогда
		// Руководитель структурного подразделения (представительства)
		МассивАдресовДляОтправки = ПолучитьАдресРуководителяПредставительства(Представительство, АдресаДляОтправкиСтрокой);
	Иначе
		// Из смартПредопределенныеЗначения
		МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой);
	КонецЕсли;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
	//++ #1330 смарт: Фролов 23.03.2023 //Доработать уведомление инженера о назначениие ПНР (добавить файл PDF)  
	МассивОбъектов=Новый Массив();
	МассивОбъектов.Добавить(ДокументСсылка); 
	ОбъектыПечати=Новый СписокЗначений;
	ТабДок=ПечатьЗаявкаНаПускоНаладку(МассивОбъектов, ОбъектыПечати); 
	
	ПутьКВФ = КаталогВременныхФайлов();
	Формат = ".PDF";
	ТипФайла = ТипФайлаТабличногоДокумента.PDF;
	ИмяВложения = "Заявка на пусконаладку " + ДокументСсылка.Номер + Формат;
	ИмяВременногоФайла = ПутьКВФ + ИмяВложения;
	ТабДок.Записать(ИмяВременногоФайла, ТипФайла);

	Вложения = Новый Массив;
	Вложение = Новый Структура;
	Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайла);
	Вложение.Вставить("Представление", ИмяВложения);
	Вложения.Добавить(Вложение);
	//-- #1330 смарт: Фролов 23.03.2023
		
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021
		//++ #1330 смарт: Фролов 23.03.2023 //Доработать уведомление инженера о назначениие ПНР (добавить файл PDF)	
		//ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма); 
		ДанныеОтправки = Новый Структура("Тема,Заголовок,Вложения", ТемаПисьма, ТекстПисьма,Вложения);
		//-- #1330 смарт: Фролов 23.03.2023
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо по заявке на пусконаладку " + НомерДокумента + " НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
			Иначе
			//-- смарт:ММ 03.03.2021
				
			ТекстСообщения = "Отправлено письмо по заявке на пусконаладку " + НомерДокумента + " на почту " +  АдресаДляОтправкиСтрокой;
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			КонецЕсли;
			//-- смарт:ММ 03.03.2021
				
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
			Успех = Истина;
		Исключение
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокументСсылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить письмо по заявке на пусконаладку "  + НомерДокумента + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
		КонецПопытки;
	КонецЕсли; 
	//++ #1330 смарт: Фролов 23.03.2023 //Доработать уведомление инженера о назначениие ПНР (добавить файл PDF)
	Попытка
		Для Каждого Вложение Из Вложения Цикл
			УдалитьФайлы(Вложение.АдресВоВременномХранилище);
		КонецЦикла;			
	Исключение
	КонецПопытки;		
    //-- #1330 смарт: Фролов 23.03.2023
	
	Возврат Успех;
	
КонецФункции

Функция ОтправитьУведомлениеОСменеСтатуса(ДокументСсылка, МассивСообщений = Неопределено) Экспорт
	
	Успех = Ложь;
	
	Если МассивСообщений = Неопределено Тогда
		МассивСообщений = Новый Массив;
	КонецЕсли;
	
	Статус = ДокументСсылка.Статус;
	
	СтатусПолученаВРаботу 		= Перечисления.смартСтатусыЗаявокНаПускоНаладку.ПолученаВРаботу;
	СтатусСозвонилисьСКлиентом 	= Перечисления.смартСтатусыЗаявокНаПускоНаладку.СозвонилисьСКлиентом;
	СтатусНазначенИнженер 		= Перечисления.смартСтатусыЗаявокНаПускоНаладку.НазначенИнженер;
	СтатусВыполнена 			= Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена;
	// ++ 05.05.2021
	СтатусТребуетКорректировки 	= Перечисления.смартСтатусыЗаявокНаПускоНаладку.ТребуетКорректировки;
	// --
	
	Если Статус <> СтатусПолученаВРаботу
		И Статус <> СтатусСозвонилисьСКлиентом
		И Статус <> СтатусНазначенИнженер
		// ++ 05.05.2021 
		И Статус <> СтатусТребуетКорректировки
		// --
		И Статус <> СтатусВыполнена Тогда
		Возврат Успех;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Успех;
	КонецЕсли;

	Ответственный 	= ДокументСсылка.Ответственный;
	НомерДокумента 	= ДокументСсылка.Номер;
	Контрагент 		= ДокументСсылка.Контрагент;
	
	// ++ 28.06.2020
	Оборудование 	= ДокументСсылка.Оборудование;
	
	ТекстОборудование = "";
	Для Каждого Строка Из Оборудование Цикл
		ТекстОборудование = ТекстОборудование + ?(ЗначениеЗаполнено(ТекстОборудование), Символы.ПС, "") + Строка.Оборудование;
	КонецЦикла;
	//
	
	ТемаПисьма = "Смена статуса заявки на пусконаладку № " + НомерДокумента;
	
	Если Статус = СтатусПолученаВРаботу Тогда
		ТекстПисьма = "Заявка на пусконаладку № " + НомерДокумента + " находится в работе.";
	ИначеЕсли Статус = СтатусСозвонилисьСКлиентом Тогда
		ТекстПисьма = "По заявке на пусконаладку № " + НомерДокумента + " состоялся созвон с клиентом.";
	ИначеЕсли Статус = СтатусНазначенИнженер Тогда
		ТекстПисьма = "По заявке на пусконаладку № " + НомерДокумента + " назначен инженер.";
	ИначеЕсли Статус = СтатусВыполнена Тогда
		ТекстПисьма = "По заявке на пусконаладку № " + НомерДокумента + " все работы проведены, заявка закрыта.";
	// ++ 05.05.2021
	ИначеЕсли Статус = СтатусТребуетКорректировки Тогда
	   	ТемаПисьма = "Корректировка заявки на пусконаладку № " + НомерДокумента;
		ТекстПисьма = "Необходимо откорректировать заявку на пусконаладку № " + НомерДокумента + " в связи с предоставлением неактуальных, недостоверных и/или неполных данных.";
	// --
	КонецЕсли;
		
	// ++ 28.06.2020
	ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + "Контрагент: " + Контрагент 
	+ Символы.ПС + Символы.ПС + "Оборудование: " + ТекстОборудование;
	// --
		 
	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресОтветственного(Ответственный, АдресаДляОтправкиСтрокой);
	
	Если Статус = СтатусВыполнена Тогда
		МассивДополнительныхАдресов = ПолучитьДополнительныеАдресаДляУведомленияОЗакрытииЗаявки(АдресаДляОтправкиСтрокой);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивАдресовДляОтправки, МассивДополнительныхАдресов, Истина);
	КонецЕсли;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021

		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо по заявке на пусконаладку " + НомерДокумента + " НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
			Иначе
			//-- смарт:ММ 03.03.2021
					
			ТекстСообщения = "Отправлено письмо по заявке на пусконаладку " + НомерДокумента + " на почту " +  АдресаДляОтправкиСтрокой;
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			КонецЕсли;
			//-- смарт:ММ 03.03.2021
		
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
			Успех = Истина;
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокументСсылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить письмо по заявке на пусконаладку "  + НомерДокумента + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;

	Возврат Успех;	
	
КонецФункции

Функция ПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой = "") 
	
	// Пользователи из смартПредопределенныеЗначения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(смартПредопределенныеЗначения.Значение КАК Справочник.Пользователи) КАК Пользователь
	|ПОМЕСТИТЬ ВТ_ПользователиДляОтправки
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	|	И НЕ смартПредопределенныеЗначения.СписокЗначений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(смартПредопределенныеЗначенияЗначения.Значение КАК Справочник.Пользователи)
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
	|
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_ПользователиДляОтправки.Пользователь.смартРабочаяПочта = """"
	|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|		ИНАЧЕ ВТ_ПользователиДляОтправки.Пользователь.смартРабочаяПочта
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	ВТ_ПользователиДляОтправки КАК ВТ_ПользователиДляОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПользователиКонтактнаяИнформация.Ссылка = ВТ_ПользователиДляОтправки.Пользователь
	|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)";
	
	Запрос.УстановитьПараметр("ПочтаПользователя", 	Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("ПредопределенноеЗначение", Справочники.смартПредопределенныеЗначения.ПользователиДляОповещенияОЗаявкахНаПускоНаладку);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции

Функция ПолучитьДополнительныеАдресаДляУведомленияОЗакрытииЗаявки(АдресаДляОтправкиСтрокой = "")
	
	// Адреса строкой или пользователи из смартПредопределенныеЗначения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ПредопределенныеЗначения
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	|	И НЕ смартПредопределенныеЗначения.СписокЗначений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_ПредопределенныеЗначения.Значение ССЫЛКА Справочник.Пользователи
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ВТ_ПредопределенныеЗначения.Значение КАК Справочник.Пользователи).смартРабочаяПочта = """"
	|						ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|					ИНАЧЕ ВЫРАЗИТЬ(ВТ_ПредопределенныеЗначения.Значение КАК Справочник.Пользователи).смартРабочаяПочта
	|				КОНЕЦ
	|			ИНАЧЕ ВТ_ПредопределенныеЗначения.Значение	
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	ВТ_ПредопределенныеЗначения КАК ВТ_ПредопределенныеЗначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПользователиКонтактнаяИнформация.Ссылка = ВТ_ПредопределенныеЗначения.Значение
	|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)";
	
	Запрос.УстановитьПараметр("ПредопределенноеЗначение", Справочники.смартПредопределенныеЗначения.ПользователиДляДопРассылкиОЗакрытииЗаявкиНаПускоНаладку);
	Запрос.УстановитьПараметр("ПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;

КонецФункции

Функция ПолучитьАдресОтветственного(Ответственный, АдресаДляОтправкиСтрокой = "") 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ПользователиДляОтправки.смартРабочаяПочта = """"
	|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|		ИНАЧЕ ПользователиДляОтправки.смартРабочаяПочта
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	Справочник.Пользователи КАК ПользователиДляОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиДляОтправки.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
	|ГДЕ
	|	ПользователиДляОтправки.Ссылка = &Ответственный";
	
	Запрос.УстановитьПараметр("ПочтаПользователя", 	Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции

Функция ПолучитьАдресРуководителяПредставительства(Представительство, АдресаДляОтправкиСтрокой = "") 
	
	// ++ 21.11.2020
	// Перенесено в общий модуль
	Возврат смартОбщегоНазначения.ПолучитьАдресРуководителяПредставительства(Представительство, АдресаДляОтправкиСтрокой);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВЫБОР
	//|		КОГДА ПользователиДляОтправки.смартРабочаяПочта = """"
	//|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	//|		ИНАЧЕ ПользователиДляОтправки.смартРабочаяПочта
	//|	КОНЕЦ КАК Значение,
	//|	1 КАК Приоритет
	//|ПОМЕСТИТЬ ВТ_ВсеПриоритеты
	//|ИЗ
	//|	Справочник.Пользователи КАК ПользователиДляОтправки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	//|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиДляОтправки.Ссылка
	//|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
	//|ГДЕ
	//|	ПользователиДляОтправки.Ссылка = &смартРуководительСервисногоЦентра
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ПользователиДляОтправки.смартРабочаяПочта = """"
	//|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	//|		ИНАЧЕ ПользователиДляОтправки.смартРабочаяПочта
	//|	КОНЕЦ КАК Значение,
	//|	2 КАК Приоритет
	//|ИЗ
	//|	Справочник.Пользователи КАК ПользователиДляОтправки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	//|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиДляОтправки.Ссылка
	//|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
	//|ГДЕ
	//|	ПользователиДляОтправки.ФизическоеЛицо = &ФизическоеЛицо
	//|;
	//|ВЫБРАТЬ
	//|  МИНИМУМ(ВТ.Приоритет) КАК МинимальныйПриоритет
	//|ПОМЕСТИТЬ ВТ_МинимальныйПриоритет
	//|ИЗ
	//|  ВТ_ВсеПриоритеты КАК ВТ
	//|;
	//|
	//|ВЫБРАТЬ
	//|  ВТ_ВсеПриоритеты.Значение
	//|ИЗ 
	//|	ВТ_ВсеПриоритеты КАК ВТ_ВсеПриоритеты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимальныйПриоритет КАК ВТ_МинимальныйПриоритет
	//|		ПО ВТ_ВсеПриоритеты.Приоритет = ВТ_МинимальныйПриоритет.МинимальныйПриоритет";
	//
	//Запрос.УстановитьПараметр("ПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	//Запрос.УстановитьПараметр("ФизическоеЛицо", Представительство.ТекущийРуководитель);
	//Запрос.УстановитьПараметр("смартРуководительСервисногоЦентра", Представительство.смартРуководительСервисногоЦентра);
	//
	//МассивАдресов = Новый Массив;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
	//	
	//	Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
	//		МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
	//		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
	//	КонецЦикла;
	//	
	//КонецЦикла;
		
	//Возврат МассивАдресов;
	
КонецФункции

//++ #Б-6888 смарт: Фролов 19.05.2026 //Оповещения инженеров о назначении на заявку ПНР
Функция ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений = Неопределено, ВыводитьСообщения = Ложь, ОтправлятьСМС = Ложь) Экспорт
	
	ДокументСсылка 	= Параметры.Ссылка;
	Пользователь 	= Параметры.Пользователь;
	ВидУведомления = Параметры.ВидУведомления;

	Если МассивСообщений = Неопределено Тогда
		МассивСообщений = Новый Массив;
	КонецЕсли;
	
	Успех = Ложь;
	
	АдресаДляОтправкиСтрокой = "";
	НомерДокумента 	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументСсылка.Номер);
	ДатаДокумента 	= ДокументСсылка.Дата;
	Контрагент 		= ДокументСсылка.Контрагент;
	Оборудование 	= ДокументСсылка.Оборудование;
	
	ТекстОборудование = "";
	Для Каждого Строка Из Оборудование Цикл
		
		ТекущееОборудование = Строка.ОборудованиеКлиентов;

		ТекстОборудование = ТекстОборудование + ?(ЗначениеЗаполнено(ТекстОборудование), Символы.ПС, "") + ТекущееОборудование;
		
	КонецЦикла;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыОтправки.Вставить("НомерДокумента", НомерДокумента);
	
	ПредставлениеДокумента = СформироватьПредставлениеДокумента(ДокументСсылка);
	
	МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(Пользователь, АдресаДляОтправкиСтрокой);	
	
	ТемаПисьма = ПредставлениеДокумента;
		
	ПараметрыОтправки.Вставить("ТемаПисьма", ТемаПисьма);
	ПараметрыОтправки.Вставить("МассивАдресовДляОтправки", МассивАдресовДляОтправки);
	ПараметрыОтправки.Вставить("АдресаДляОтправкиСтрокой", АдресаДляОтправкиСтрокой);
		
	Если ВидУведомления = "Назначение" Тогда

		ТекстПисьма = "Вы назначены на выполнение работ по заявке на ПНР № " + НомерДокумента 
		+ ". Период исполнения заявки с " + Формат(Параметры.НазначеннаяДатаЗапускаС, "ДФ=dd.MM.yyyy") + " по " + Формат(Параметры.НазначеннаяДатаЗапускаПо, "ДФ=dd.MM.yyyy") 
		+ ". Бланк заявки во вложении к письму. Пожалуйста, изучите заявку и свяжитесь с клиентом в течение 15 минут с момента получения.";

		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ДокументСсылка);
		СписокОбъектов = Новый СписокЗначений;
		СписокОбъектов.Добавить(ДокументСсылка);
		ДокументРезультат = ПечатьЗаявкаНаПускоНаладку(МассивОбъектов, СписокОбъектов);
		
		Если ДокументРезультат.ВысотаТаблицы = 0 Тогда
			МассивСообщений.Добавить("Ошибка при формировании и отправке инженеру печатной формы заявки на ПНР");
		Иначе
			
			// Формирование вложения
			Вложения = Новый Массив;
			Вложение = Новый Структура;
			
			ПутьКВФ = КаталогВременныхФайлов();
			Формат = ".pdf";
			ТипФайла = ТипФайлаТабличногоДокумента.PDF;
			
			ИмяВложения = "" + ПредставлениеДокумента + Формат;
			ИмяВременногоФайла = ПутьКВФ + ИмяВложения;
			ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайла);
			
			Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайла);
			Вложение.Вставить("Представление", ИмяВложения);
			
			Вложения.Добавить(Вложение);

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.Ссылка КАК Ссылка,
			|	смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.Расширение КАК Расширение,
			|	смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
			|	смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.ФайлХранилище КАК ФайлХранилище,
			|	смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.Наименование КАК Наименование
			|ИЗ
			|	Справочник.смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы КАК смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы
			|ГДЕ
			|	НЕ смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.ПометкаУдаления
			|	И смартЗаявкаНаПускоНаладкуПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
			
			Запрос.УстановитьПараметр("ВладелецФайла", ДокументСсылка);
						
			ВыборкаФайл = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаФайл.Следующий() Цикл
				
				Вложение = Новый Структура;
				
				Формат = "." + ВыборкаФайл.Расширение;

				ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаФайл.Ссылка);
				
				Если ДвоичныеДанные = Неопределено Тогда
					Продолжить;
				КонецЕсли;			
				
				ПредставлениеДокумента = ВыборкаФайл.Наименование;
				ИмяВложения = "" + ПредставлениеДокумента + Формат;
				ИмяВременногоФайла = ПутьКВФ + ИмяВложения;
				ДвоичныеДанные.Записать(ИмяВременногоФайла);
				
				Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайла);
				Вложение.Вставить("Представление", ИмяВложения);
				
				Вложения.Добавить(Вложение);
				
			КонецЦикла;
			
		КонецЕсли;
			
		ПараметрыОтправки.Вставить("ТекстПисьма", ТекстПисьма);
		ПараметрыОтправки.Вставить("Вложения", Вложения);
		
		Успех = ОтправитьУведомлениеАдресатам(ПараметрыОтправки, МассивСообщений);
		
		Если Успех Тогда
			МассивСообщений.Добавить("     Отправлено уведомление инженеру о назначении на заявку на ПНР");

			Если ОтправлятьСМС Тогда
				
				ТекстСообщения = "Проверьте почту. Для вас есть новая заявка на ПНР:";
				
				ТекстСообщения = ТекстСообщения + " № " + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy"); 
				
				Результат = смартОбщегоНазначения.ОтправитьСМСПользователю(Пользователь, ТекстСообщения);
				
				Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
					МассивСообщений.Добавить("		Не удалось отправить SMS инженеру: " + Результат.ОписаниеОшибки);
				Иначе
					МассивСообщений.Добавить("		Отправлено SMS инженеру");
				КонецЕсли;

			КонецЕсли;

		Иначе
			МассивСообщений.Добавить("     Ошибка при отправке уведомления инженеру о назначении на заявку на ПНР");
		КонецЕсли;

		Попытка
			Для Каждого Вложение Из Вложения Цикл
				УдалитьФайлы(Вложение.АдресВоВременномХранилище);
			КонецЦикла;			
		Исключение
		КонецПопытки;		
		
	ИначеЕсли ВидУведомления = "Отмена" Тогда
		
		ТекстПисьма = "Для вас отменены работы по заявке на ПНР № " + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		ПараметрыОтправки.Вставить("ТекстПисьма", ТекстПисьма);

		Успех = ОтправитьУведомлениеАдресатам(ПараметрыОтправки, МассивСообщений);
	
		Если Успех Тогда
			МассивСообщений.Добавить("     Отправлено уведомление инженеру об отмене заявки на ПНР");

			Если ОтправлятьСМС Тогда
				
				ТекстСообщения = "Проверьте почту. Для вас есть новая заявка на ПНР"; 
				

				ТекстСообщения = ТекстСообщения + " № " + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy"); 

				
				Результат = смартОбщегоНазначения.ОтправитьСМСПользователю(Пользователь, ТекстСообщения);
				
				Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
					МассивСообщений.Добавить("		Не удалось отправить SMS инженеру: " + Результат.ОписаниеОшибки);
				Иначе
					МассивСообщений.Добавить("		Отправлено SMS инженеру");
				КонецЕсли;
				
			КонецЕсли;

		Иначе
			МассивСообщений.Добавить("     Ошибка при отправке уведомления инженеру об отмене заявки на ПНР");
		КонецЕсли;

	Иначе
		Возврат Успех;
	КонецЕсли;
	
	Если НЕ ВыводитьСообщения Тогда
		МассивСообщений.Очистить();
	КонецЕсли;
	
КонецФункции //-- #Б-6888 смарт: Фролов 19.05.2026

//++ #Б-6888 смарт: Фролов 19.05.2026 //Оповещения инженеров о назначении на заявку ПНР
Функция ОтправитьУведомлениеАдресатам(ПараметрыОтправки, МассивСообщений)
	
	Успех = Ложь;
	
	МассивАдресовДляОтправки = ПараметрыОтправки.МассивАдресовДляОтправки;
	УчетнаяЗапись 	= ПараметрыОтправки.УчетнаяЗапись;
	ТемаПисьма 		= ПараметрыОтправки.ТемаПисьма;
	ТекстПисьма 	= ПараметрыОтправки.ТекстПисьма;
	АдресаДляОтправкиСтрокой = ПараметрыОтправки.АдресаДляОтправкиСтрокой;
	НомерДокумента = ПараметрыОтправки.НомерДокумента;
	
	Вложения = Неопределено;
	Если ПараметрыОтправки.Свойство("Вложения") Тогда
		Вложения = ПараметрыОтправки.Вложения;
	КонецЕсли;
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();

	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		
		ТестоваяБаза = ПараметрыПисьма.ТестоваяБаза;
		ТестовыеАдреса = ПараметрыПисьма.ТестовыеАдреса;
		
		Если ЗначениеЗаполнено(Вложения) Тогда
			ПараметрыПисьма.Вставить("Вложения", Вложения);
		КонецЕсли;
		
		Попытка
			
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			
			Если ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо по заявке на ПНР №" + НомерДокумента + " на ТЕСТОВУЮ почту " + ТестовыеАдреса + " (в рабочей базе отправилось бы на адрес " +  АдресаДляОтправкиСтрокой + ")";
			Иначе
				ТекстСообщения = "Отправлено письмо по заявке на ПНР №" + НомерДокумента + " на почту " +  АдресаДляОтправкиСтрокой;
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
			Успех = Истина;
			
		Исключение
			
			Если ТестоваяБаза Тогда
				ТекстСообщения = "Не удалось отправить письмо по заявке на ПНР №"  + НомерДокумента + " на ТЕСТОВУЮ почту " + ТестовыеАдреса + " (в рабочей базе был бы адрес " +  АдресаДляОтправкиСтрокой + ")" + Символы.ПС + ОписаниеОшибки();
			Иначе
				ТекстСообщения = "Не удалось отправить письмо по заявке на ПНР №"  + НомерДокумента + Символы.ПС + ОписаниеОшибки();
			КонецЕсли;

			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);

			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции //-- #Б-6888 смарт: Фролов 19.05.2026

//++ #Б-6888 смарт: Фролов 19.05.2026 //Оповещения инженеров о назначении на заявку ПНР
Функция СформироватьПредставлениеДокумента(ДокументСсылка)
	
	НомерДляПечати = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументСсылка.Номер);
	
	НомерДляПечати = СокрЛП(НомерДляПечати);
	
	Возврат "Заявка на пуско-наладку №" + НомерДляПечати + " от " + Формат(ДокументСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'");
	
КонецФункции //-- #Б-6888 смарт: Фролов 19.05.2026

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Заявка на пусконаладку
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявкаНаПускоНаладку";
	КомандаПечати.Представление = НСтр("ru = 'Заявка на пусконаладку'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//++ #Б-7128 смарт: Фролов 11.06.2026 //Создать печатную форму Служебной Записки
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "смартСлужебноеЗадание";
	КомандаПечати.Представление = НСтр("ru = 'Служебное задание'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//-- #Б-7128 смарт: Фролов 11.06.2026
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаНаПускоНаладку") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявкаНаПускоНаладку",
				НСтр("ru = 'Заявка на пусконаладку'"),
				ПечатьЗаявкаНаПускоНаладку(МассивОбъектов, ОбъектыПечати));
				
	//++ #Б-7128 смарт: Фролов 11.06.2026 //Создать печатную форму Служебной Записки			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "смартСлужебноеЗадание") Тогда
				
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "смартСлужебноеЗадание",
				НСтр("ru = 'Служебное задание'"),
				ПечатьСлужебноеЗадание(МассивОбъектов, ОбъектыПечати));
	//-- #Б-7128 смарт: Фролов 11.06.2026			

	КонецЕсли;
			
	СборкаТоваровЛокализация.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

//++ #Б-7128 смарт: Фролов 11.06.2026 //Создать печатную форму Служебной Записки
Функция ПечатьСлужебноеЗадание(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаПускоНаладку.Ссылка КАК Ссылка,
	|	смартЗаявкаНаПускоНаладку.Номер КАК Номер,
	|	смартЗаявкаНаПускоНаладку.Дата КАК Дата,
	|	смартЗаявкаНаПускоНаладку.Партнер КАК Партнер,
	|	смартЗаявкаНаПускоНаладку.Контрагент КАК Контрагент,
	|	смартЗаявкаНаПускоНаладку.АдресВыезда КАК АдресВыезда,
	|	смартЗаявкаНаПускоНаладку.АдресВыездаЗначенияПолей КАК АдресВыездаЗначенияПолей,
	|	смартЗаявкаНаПускоНаладку.Ответственный КАК Ответственный,
	|	смартЗаявкаНаПускоНаладку.НазначенныйНаЗапускИнженер КАК НазначенныйНаЗапускИнженер,
	|	смартЗаявкаНаПускоНаладку.Представительство КАК Представительство,
	|	смартЗаявкаНаПускоНаладку.Маркетинг КАК Маркетинг,
	|	смартЗаявкаНаПускоНаладку.НазначенныйНаЗапускИнженер2 КАК НазначенныйНаЗапускИнженер2,
	|	смартЗаявкаНаПускоНаладку.НазначеннаяДатаЗапускаС КАК НазначеннаяДатаЗапускаС,
	|	смартЗаявкаНаПускоНаладку.НазначеннаяДатаЗапускаС2 КАК НазначеннаяДатаЗапускаС2,
	|	смартЗаявкаНаПускоНаладку.НазначеннаяДатаЗапускаПо КАК НазначеннаяДатаЗапускаПо,
	|	смартЗаявкаНаПускоНаладку.НазначеннаяДатаЗапускаПо2 КАК НазначеннаяДатаЗапускаПо2,
	|	смартЗаявкаНаПускоНаладку.Командировка КАК Командировка,
	|	смартЗаявкаНаПускоНаладку.АдресВыездаЗначение КАК АдресВыездаЗначение,
	|	смартЗаявкаНаПускоНаладку.ДатаВыполнения КАК ДатаВыполнения,
	|	смартЗаявкаНаПускоНаладку.ОтветственныйСЦ КАК ОтветственныйСЦ,
	|	смартЗаявкаНаПускоНаладку.Инженер КАК Инженер,
	|	смартЗаявкаНаПускоНаладку.Оборудование.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Оборудование КАК Оборудование,
	|		ГарантийныйСрокНаОборудование КАК ГарантийныйСрокНаОборудование,
	|		ГарантийныйСрокНаПечатающиеГоловки КАК ГарантийныйСрокНаПечатающиеГоловки,
	|		РастровыйПроцессор КАК РастровыйПроцессор,
	|		КонфигурацияЧернил КАК КонфигурацияЧернил,
	|		ДатаОтгрузки КАК ДатаОтгрузки,
	|		Серия КАК Серия,
	|		ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР,
	|		ТипЧернилОборудование КАК ТипЧернилОборудование,
	|		ОборудованиеКлиентов КАК ОборудованиеКлиентов,
	|		СрокДополнительнойГарантии КАК СрокДополнительнойГарантии,
	|		ДатаНачалаДополнительнойГарантии КАК ДатаНачалаДополнительнойГарантии
	|	) КАК Оборудование
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку КАК смартЗаявкаНаПускоНаладку
	|ГДЕ
	|	смартЗаявкаНаПускоНаладку.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМекет.смартСлужебноеЗадание");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смартСлужебноеЗадание";
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");

	ПервыйДокумент = Истина;
	ВыборкаДокументы = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл		
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаДокументы);
		
		ОбластьШапка.Параметры.СтранаГород = ВыборкаДокументы.АдресВыезда;
		ОбластьШапка.Параметры.ФИО = ВыборкаДокументы.НазначенныйНаЗапускИнженер.ФизическоеЛицо.Наименование;
		ОбластьШапка.Параметры.Должность = ВыборкаДокументы.НазначенныйНаЗапускИнженер.ФизическоеЛицо.смартДолжность;
		ОбластьШапка.Параметры.ТабельныйНомер = ВыборкаДокументы.НазначенныйНаЗапускИнженер.ФизическоеЛицо.смартТабельныйНомер;
		ОбластьШапка.Параметры.Подразделение = ВыборкаДокументы.НазначенныйНаЗапускИнженер.Подразделение;
		ОбластьШапка.Параметры.Клиент = ВыборкаДокументы.Контрагент.Наименование;
		ОбластьШапка.Параметры.ДатаНачала = ВыборкаДокументы.НазначеннаяДатаЗапускаС;
		ОбластьШапка.Параметры.ДатаОкончания = ВыборкаДокументы.НазначеннаяДатаЗапускаПо;
		ДатаСоставленияПредварительная = смартОбщегоНазначения.ПолучитьРабочуюДатуОтносительноИсходной(ВыборкаДокументы.НазначеннаяДатаЗапускаС, 1, "Назад");
		ОбластьШапка.Параметры.ДатаСоставления = ?(ДатаСоставленияПредварительная < ВыборкаДокументы.Дата, ВыборкаДокументы.Дата, ДатаСоставленияПредварительная);
		ОбластьШапка.Параметры.ДатаВозврата = НачалоДня(ВыборкаДокументы.НазначеннаяДатаЗапускаС) + 86400 * 25;
		ОбластьШапка.Параметры.КоличествоДней = (КонецДня(ВыборкаДокументы.НазначеннаяДатаЗапускаПо) - НачалоДня(ВыборкаДокументы.НазначеннаяДатаЗапускаС) + 1) / 86400;
		
		// Вывод оборудования
		ВыборкаОборудование = ВыборкаДокументы.Оборудование.Выбрать();
		
		НомерПП = 1; 
		
		Цель = "Запуск оборудования ";
		
		Пока ВыборкаОборудование.Следующий() Цикл
			
			Цель = Цель + ?(Цель = "Запуск оборудования ", "", Символы.ПС) + ВыборкаОборудование.ОборудованиеКлиентов.Наименование;
			
		КонецЦикла;
		
		ОбластьШапка.Параметры.Цель = Цель;

		ТабДокумент.Вывести(ОбластьШапка);
		// Подвал
		
		Если ЗначениеЗаполнено(ВыборкаДокументы.НазначенныйНаЗапускИнженер2) Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаДокументы);
			
			ОбластьШапка.Параметры.ФИО = ВыборкаДокументы.НазначенныйНаЗапускИнженер2.ФизическоеЛицо.Наименование;
			ОбластьШапка.Параметры.Должность = ВыборкаДокументы.НазначенныйНаЗапускИнженер2.ФизическоеЛицо.смартДолжность;
			ОбластьШапка.Параметры.ТабельныйНомер = ВыборкаДокументы.НазначенныйНаЗапускИнженер2.ФизическоеЛицо.смартТабельныйНомер;
			ОбластьШапка.Параметры.Подразделение = ВыборкаДокументы.НазначенныйНаЗапускИнженер2.Подразделение;
			ДатаСоставленияПредварительная = смартОбщегоНазначения.ПолучитьРабочуюДатуОтносительноИсходной(ВыборкаДокументы.НазначеннаяДатаЗапускаС2, 1, "Назад");
			ОбластьШапка.Параметры.ДатаСоставления = ?(ДатаСоставленияПредварительная < ВыборкаДокументы.Дата, ВыборкаДокументы.Дата, ДатаСоставленияПредварительная);
			ОбластьШапка.Параметры.ДатаНачала = ВыборкаДокументы.НазначеннаяДатаЗапускаС2;
			ОбластьШапка.Параметры.ДатаОкончания = ВыборкаДокументы.НазначеннаяДатаЗапускаПо2;
			ОбластьШапка.Параметры.ДатаВозврата = НачалоДня(ВыборкаДокументы.НазначеннаяДатаЗапускаС2) + 86400 * 25;
			ОбластьШапка.Параметры.КоличествоДней = (КонецДня(ВыборкаДокументы.НазначеннаяДатаЗапускаПо2) 
				- НачалоДня(ВыборкаДокументы.НазначеннаяДатаЗапускаС2) + 1) / 86400;
			
			ТабДокумент.Вывести(ОбластьШапка);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции //-- #Б-7128 смарт: Фролов 11.06.2026

Функция ПечатьЗаявкаНаПускоНаладку(МассивОбъектов, ОбъектыПечати)
		
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаПускоНаладку.Ссылка КАК Ссылка,
	|	смартЗаявкаНаПускоНаладку.Номер КАК Номер,
	|	смартЗаявкаНаПускоНаладку.Дата КАК Дата,
	// ++ 03.12.2020
	|	смартЗаявкаНаПускоНаладку.ДокументОснование,
	// ++ 24.03.2021
	|	смартЗаявкаНаПускоНаладку.Ответственный КАК Менеджер,
	// --
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(смартЗаявкаНаПускоНаладку.Контрагент) КАК Контрагент,
	|	смартЗаявкаНаПускоНаладку.АдресВыезда КАК АдресВыезда,
	|	смартЗаявкаНаПускоНаладку.НомерТелефонаКонтрагента КАК НомерТелефонаКонтрагента,
	|	смартЗаявкаНаПускоНаладку.ПереченьНеобходимыхРабот КАК ПереченьНеобходимыхРабот,
	|	смартЗаявкаНаПускоНаладку.ПостроениеЦветовыхПрофилей КАК ПостроениеЦветовыхПрофилей,
	|	смартЗаявкаНаПускоНаладку.ДокументыОтКлиента КАК ДокументыОтКлиента,
	|	смартЗаявкаНаПускоНаладку.ЖелаемаяДатаИнсталляции КАК ЖелаемаяДатаИнсталляции,
	|	смартЗаявкаНаПускоНаладку.КтоОплачиваетВыездСИ КАК КтоОплачиваетВыездСИ,
	|	смартЗаявкаНаПускоНаладку.КомментарийМенеджера КАК КомментарийМенеджера,
	|	смартЗаявкаНаПускоНаладку.КонтактныеЛица.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ПРЕДСТАВЛЕНИЕ(КонтактноеЛицо) КАК КонтактноеЛицо,
	|		ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
	|		АдресЭПКонтактногоЛица КАК АдресЭПКонтактногоЛица
	|	) КАК КонтактныеЛица,
	|	смартЗаявкаНаПускоНаладку.Оборудование.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	//++ смарт:ММ 04.10.2020
	|		ПРЕДСТАВЛЕНИЕ(Серия) КАК Серия,
	//-- смарт:ММ 04.10.2020
	|		ПРЕДСТАВЛЕНИЕ(Оборудование) КАК Оборудование,
	|		ГарантийныйСрокНаОборудование КАК ГарантийныйСрокНаОборудование,
	|		ГарантийныйСрокНаПечатающиеГоловки КАК ГарантийныйСрокНаПечатающиеГоловки,
	|		ПРЕДСТАВЛЕНИЕ(РастровыйПроцессор) КАК РастровыйПроцессор,
	|		ПРЕДСТАВЛЕНИЕ(ТипЧернилОборудование) КАК ТипЧернил,
	|		ПРЕДСТАВЛЕНИЕ(КонфигурацияЧернил) КАК КонфигурацияЧернил
	|	) КАК Оборудование,
	//++ #1328 смарт: Фролов 21.03.2023 //Добавить спецификацию оборудования iECHO в Заявку на пусконаладку
	|	смартЗаявкаНаПускоНаладку.Комплектующие.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ПРЕДСТАВЛЕНИЕ(НаименованиеКомплектующей) КАК НаименованиеКомплектующей,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Стоимость КАК Стоимость
	|	) КАК Комплектующие
	//-- #1328 смарт: Фролов 21.03.2023
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку КАК смартЗаявкаНаПускоНаладку
	|ГДЕ
	|	смартЗаявкаНаПускоНаладку.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смартЗаявкаНаПускоНаладку";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.смартЗаявкаНаПускоНаладку.ПФ_MXL_ЗаявкаНаПускоНаладку");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОборудованиеШапка = Макет.ПолучитьОбласть("ОборудованиеШапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаДокументы);
		ОбластьШапка.Параметры.Дата = Формат(ВыборкаДокументы.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		// ++ 03.12.2020
		ЗаказКлиента = ВыборкаДокументы.ДокументОснование;
		Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
			ОбластьШапка.Параметры.ТекстЗаказКлиента = "Заказ клиента №" + ЗаказКлиента.Номер + " от " + Формат(ЗаказКлиента.Дата, "ДФ='dd.MM.yyyy ""г.""'")
		КонецЕсли;
		// --
		ТабДокумент.Вывести(ОбластьШапка);		
		
		// Вывод контактных лиц
		ВыборкаКонтактныеЛица = ВыборкаДокументы.КонтактныеЛица.Выбрать();
		
		Сч = 0;
		ОбластьКонтактныеЛица = Неопределено;
		НомерПП = 1;
		
		Пока ВыборкаКонтактныеЛица.Следующий() Цикл
			
			Сч = Сч + 1;
			
			Если Сч = 3 Тогда
				Сч = 1;
			КонецЕсли;
			
			Если Сч = 1 Тогда
				ОбластьКонтактныеЛица = Макет.ПолучитьОбласть("КонтактныеЛица|КолонкаЛево");
				ОбластьКонтактныеЛица.Параметры.НомерКЛ = НомерПП;
				ОбластьКонтактныеЛица.Параметры.КонтактноеЛицо = ВыборкаКонтактныеЛица.КонтактноеЛицо;
				ОбластьКонтактныеЛица.Параметры.ТелефонКонтактногоЛица = ВыборкаКонтактныеЛица.ТелефонКонтактногоЛица;
				ОбластьКонтактныеЛица.Параметры.АдресЭПКонтактногоЛица = ВыборкаКонтактныеЛица.АдресЭПКонтактногоЛица;
				ТабДокумент.Вывести(ОбластьКонтактныеЛица);
			Иначе
				ОбластьКонтактныеЛица = Макет.ПолучитьОбласть("КонтактныеЛица|КолонкаПраво");
				ОбластьКонтактныеЛица.Параметры.НомерКЛ2 = НомерПП;
				ОбластьКонтактныеЛица.Параметры.КонтактноеЛицо2 = ВыборкаКонтактныеЛица.КонтактноеЛицо;
				ОбластьКонтактныеЛица.Параметры.ТелефонКонтактногоЛица2 = ВыборкаКонтактныеЛица.ТелефонКонтактногоЛица;
				ОбластьКонтактныеЛица.Параметры.АдресЭПКонтактногоЛица2 = ВыборкаКонтактныеЛица.АдресЭПКонтактногоЛица;	
				ТабДокумент.Присоединить(ОбластьКонтактныеЛица);
			КонецЕсли;
									
			НомерПП = НомерПП + 1;
		КонецЦикла;
				
		// Вывод оборудования
		ТабДокумент.Вывести(ОбластьОборудованиеШапка);
		
		ВыборкаОборудование = ВыборкаДокументы.Оборудование.Выбрать();
		
		НомерПП = 1;
		
		Пока ВыборкаОборудование.Следующий() Цикл
			
			ОбластьОборудование = Макет.ПолучитьОбласть("Оборудование");
			ОбластьОборудование.Параметры.НомерПП = НомерПП;
			ЗаполнитьЗначенияСвойств(ОбластьОборудование.Параметры, ВыборкаОборудование);
			
			//++ смарт:ММ 04.10.2020
			Если ЗначениеЗаполнено(ВыборкаОборудование.Серия) Тогда
				ОбластьОборудование.Параметры.Оборудование = ВыборкаОборудование.Оборудование + Символы.ПС + "Серия: " + ВыборкаОборудование.Серия;
			КонецЕсли;
			//-- смарт:ММ 04.10.2020
			
			ТабДокумент.Вывести(ОбластьОборудование);

			НомерПП = НомерПП + 1;			
		КонецЦикла;
			
		//++ #1328 смарт: Фролов 21.03.2023 //Добавить спецификацию оборудования iECHO в Заявку на пусконаладку  
		ВыборкаКомплектующие = ВыборкаДокументы.Комплектующие.Выбрать();
		НомерПП = 1;
		Если ВыборкаКомплектующие.Количество()>0 Тогда
			ОбластьСпецификацияШапка = Макет.ПолучитьОбласть("СпецификацияШапка");
			ТабДокумент.Вывести(ОбластьСпецификацияШапка); 
		КонецЕсли;	
		Пока ВыборкаКомплектующие.Следующий() Цикл
			
			ОбластьСпецификацияСтрока = Макет.ПолучитьОбласть("СпецификацияСтрока");
			ЗаполнитьЗначенияСвойств(ОбластьСпецификацияСтрока.Параметры, ВыборкаКомплектующие);
			ОбластьСпецификацияСтрока.Параметры.НомерПП = НомерПП;
			ТабДокумент.Вывести(ОбластьСпецификацияСтрока); 
			НомерПП = НомерПП + 1;
		КонецЦикла; 
		Если ВыборкаКомплектующие.Количество()>0 Тогда
			ОбластьСпецификацияПодвал = Макет.ПолучитьОбласть("СпецификацияПодвал");
			ТабДокумент.Вывести(ОбластьСпецификацияПодвал); 
		КонецЕсли;	
		//-- #1328 смарт: Фролов 21.03.2023
		
		// Подвал
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаДокументы);
		ТабДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
