#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ПометкаУдаления 
		И УведомлениеОтправлено Тогда 
		Успех = ОтправитьУведомление("ОтменаПроведения");
		Если Успех Тогда
			УведомлениеОтправлено = Ложь;
			ЭтотОбъект.УстановитьПометкуУдаления(Истина);
			//ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	// ++ 25.03.2021
	Если ЭтоНовый() Тогда
		Для Каждого Строка Из Оборудование Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОборудованиеКлиентов) Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю("В строке " + Строка.НомерСтроки + " не заполнена колонка ""Оборудование клиента""");
			КонецЕсли;		
		КонецЦикла;	
	КонецЕсли;
	//--
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийСтатус", Перечисления.смартСтатусыЗаявокНаПускоНаладку.ПустаяСсылка());
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийСтатус", Ссылка.Статус);
	КонецЕсли;

	//++ #1887 смарт: Мосолов 03.07.2024 //Доработать документы сервисного центра. Затраченное время.
	Если Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена Тогда  
		
		ДатаНачалаОтраженияВремени = Справочники.смартПредопределенныеЗначения.ДатаНачалаОтраженияЗатраченногоИнженерамиВремени.Значение;
		
		Если ЗначениеЗаполнено(ДатаНачалаОтраженияВремени) 
			И ДатаНачалаОтраженияВремени <= Дата Тогда
			
			Если (ЗначениеЗаполнено(НазначенныйНаЗапускИнженер) И ЗатраченоЧасов = 0)
				ИЛИ (ЗначениеЗаполнено(НазначенныйНаЗапускИнженер2) И ЗатраченоЧасов2 = 0) Тогда
				
				ВызватьИсключение НСтр("ru = 'Укажите затраченное инженерами время!'");
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	//-- #1887 смарт: Мосолов 03.07.2024 
	
	//++ #Б3428 смарт: Шляпников 28.05.2025 / Заявка на пусконаладку. Доработка.
	Если НЕ Отказ И НЕ ЗначениеЗаполнено(ДатаВыполнения) Тогда
		
		Если Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена
			ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно
			ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.КлиентЗапустилОборудованиеСамостоятельно Тогда
			
			ДатаВыполнения = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
	ИначеЕсли НЕ Отказ И ЗначениеЗаполнено(ДатаВыполнения) Тогда
		
		Если НЕ (Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена
			ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно
			ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.КлиентЗапустилОборудованиеСамостоятельно) Тогда
			
			ДатаВыполнения = Дата(1, 1, 1);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б3428 смарт: Шляпников 28.05.2025
	
	//++ #Б-3550 смарт: Фролов 16.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗПР
	Если НЕ Командировка = Ссылка.Командировка Тогда
		
		ДополнительныеСвойства.Вставить("ТребуетсяОформлениеКомандировки", Истина);
		
	КонецЕсли;
	//-- #Б-3550 смарт: Фролов 16.06.2025
	
	//++ #Б-6888 смарт: Фролов 19.05.2026 //Оповещения инженеров о назначении на заявку ПНР
	ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер", Ложь);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер2", Ложь);
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийСтатус", Перечисления.смартСтатусыЗаявокНаПускоНаладку.ПустаяСсылка());
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартСсылкаПроведен", Ложь);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер", Истина);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер2", Истина);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер", Справочники.Пользователи.ПустаяСсылка());
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер2", Справочники.Пользователи.ПустаяСсылка());
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийСтатус", Ссылка.Статус);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартСсылкаПроведен", Ссылка.Проведен);
		
		Если НазначенныйНаЗапускИнженер <> Ссылка.НазначенныйНаЗапускИнженер Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер", Истина);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер", Ссылка.НазначенныйНаЗапускИнженер);
		КонецЕсли;
		
		Если НазначенныйНаЗапускИнженер2 <> Ссылка.НазначенныйНаЗапускИнженер2 Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер2", Истина);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер2", Ссылка.НазначенныйНаЗапускИнженер2);
		КонецЕсли;

	КонецЕсли;
	//-- #Б-6888 смарт: Фролов 19.05.2026
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		//++ #1390 смарт: Фролов 04.07.2023 //Снятие ограничений для Полных прав  
		Если НЕ РольДоступна("ПолныеПрава") Тогда 
			Если НЕ смартОбщегоНазначения.смартЗаказКлиентаОтгруженОформлен(ДанныеЗаполнения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! По заказу оформлены не все документы отгрузки. Заявку на пусконаладку можно создать только для полностью отгруженного заказа.");
				Возврат;
			КонецЕсли;
		КонецЕсли;	
		//++#1336 смарт: Лопато 04.04.2023 //Ограничение создания заявки на ПНР (только после полной отгрузки)  
		//Если НЕ смартОбщегоНазначения.смартЗаказКлиентаОтгруженОформлен(ДанныеЗаполнения) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! По заказу оформлены не все документы отгрузки. Заявку на пусконаладку можно создать только для полностью отгруженного заказа.");
		//	Возврат;
		//КонецЕсли;	
		//--#1336 смарт: Лопато 04.04.2023
		//-- #1390 смарт: Фролов 04.07.2023 
		
		ДокументОснование = ДанныеЗаполнения;
		Партнер 	= ДанныеЗаполнения.Партнер;
		Контрагент 	= ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Статус 		= Перечисления.смартСтатусыЗаявокНаПускоНаладку.Размещена;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;		
				
		//++ смарт:ММ #093 449 04.02.2021 - Доработка Заявки на ПНР
		Если ДанныеЗаполнения.смартПродажаЧерезДилера Тогда
			
			// Контрагент и контактные лица не заполняются
			
			ИзменитьКонтрагентаИКлиентаВРучномРежиме = Истина;
			
			Партнер = ДанныеЗаполнения.смартКонечныйПокупатель;
			Контрагент = Неопределено;
			
		Иначе

		//-- смарт:ММ 05.02.2021
		
		ЗаполнитьРеквизитыПоКонтрагенту();

		// Контактные лица
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.КонтактноеЛицо) Тогда
			
			НоваяСтрока = КонтактныеЛица.Добавить();
			НоваяСтрока.КонтактноеЛицо = ДанныеЗаполнения.КонтактноеЛицо;
			
			СтруктураДанныеКонтактногоЛица = ПолучитьДанныеКонтактногоЛица(НоваяСтрока.КонтактноеЛицо);			
			НоваяСтрока.ТелефонКонтактногоЛица = СтруктураДанныеКонтактногоЛица.Телефон;
			НоваяСтрока.АдресЭПКонтактногоЛица = СтруктураДанныеКонтактногоЛица.ЭлПочта;
			
		КонецЕсли;
		
		//++ смарт:ММ #093 449 05.02.2021 - Доработка Заявки на ПНР
		КонецЕсли;
		//-- смарт:ММ 04.02.2021
					
		// Оборудование
		
		ГарантийныйСрокНаОборудование = Справочники.смартПредопределенныеЗначения.ГарантийныйСрокНаОборудованиеПоУмолчанию.Значение;		
		ГарантийныйСрокНаПечатающиеГоловки = Справочники.смартПредопределенныеЗначения.ГарантийныйСрокНаПечатающиеГоловкиПоУмолчанию.Значение;
		РастровыйПроцессор = Справочники.смартПредопределенныеЗначения.РастровыйПроцессорПоУмолчанию.Значение;
		
		ЗапросОборудование = Новый Запрос;
		//++ #1847 смарт: Фролов 10.06.2024 //Оборудование в Заявке на ПНР:
		//ЗапросОборудование.Текст = ПолучитьТекстЗапросаОборудованиеИзЗаказаКлиента();
		ЗапросОборудование.Текст = ПолучитьТекстЗапросаОборудованиеИзЗаказаКлиента(Истина);
		//-- #1847 смарт: Фролов 10.06.2024
		ЗапросОборудование.УстановитьПараметр("ТоварПлоттерыСерии", Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение);
		ЗапросОборудование.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
		ЗапросОборудование.УстановитьПараметр("ОтборНоменклатура", Ложь);
		ЗапросОборудование.УстановитьПараметр("Номенклатура", Неопределено);
		
		Выборка = ЗапросОборудование.Выполнить().Выбрать();
		
		//++ смарт:ММ #094 411 07.02.2021
		МассивНоменклатураОборудование = Новый Массив;
		//-- смарт:ММ 07.02.2021
		
		Пока Выборка.Следующий() Цикл
			
			//++ смарт:ММ #090 436 30.12.2020 - Фоновое изменение заявки на пусконаладку при изменении заказа клиента
			Если Выборка.Отменено Тогда
				Продолжить;
			КонецЕсли;
			//-- смарт:ММ 30.12.2020
			
			НоваяСтрока = Оборудование.Добавить();
			НоваяСтрока.Оборудование 						= Выборка.Номенклатура;

			//++ #Б-2768 смарт: Лопато 21.03.2025 //Заполнение корректного срока гарантии на оборудование и ПГ при формировании ПНР.  
			СтруктураГарантияНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Оборудование, "смартГарантияНаОборудование, смартГарантияНаПечатающиеГоловки");
			
			НоваяСтрока.ГарантийныйСрокНаОборудование 		= ?(ЗначениеЗаполнено(СтруктураГарантияНоменклатуры.смартГарантияНаОборудование), 
																СтруктураГарантияНоменклатуры.смартГарантияНаОборудование, 
																ГарантийныйСрокНаОборудование);

			НоваяСтрока.ГарантийныйСрокНаПечатающиеГоловки	= ?(ЗначениеЗаполнено(СтруктураГарантияНоменклатуры.смартГарантияНаПечатающиеГоловки), 
																СтруктураГарантияНоменклатуры.смартГарантияНаПечатающиеГоловки, 
																ГарантийныйСрокНаПечатающиеГоловки);
			//-- #Б-2768 смарт: Лопато 21.03.2025

			НоваяСтрока.РастровыйПроцессор 					= РастровыйПроцессор;
			НоваяСтрока.ДатаОтгрузки 						= Выборка.ДатаОтгрузки;
			//++ смарт:ММ 04.10.2020
			НоваяСтрока.Серия 								= Выборка.Серия;
			//-- смарт:ММ 04.10.2020
			//++ смарт:ММ #094 411 07.02.2021
			НоваяСтрока.ОборудованиеКлиентов 				= Выборка.смартСоответствиеСОбрудованиемИЧерниламиКлиентов;
			МассивНоменклатураОборудование.Добавить(НоваяСтрока.Оборудование);
			//-- смарт:ММ 07.02.2021
			
		КонецЦикла;
		
		//++ смарт:ММ #094 411 07.02.2021
		// Дозаполнение чернил из Заказа клиента в уже добавленные строки с оборудованием
		ЗапросОборудование.Текст = ПолучитьТекстЗапросаЧернилаИзЗаказаКлиента();
		ЗапросОборудование.УстановитьПараметр("СписокОборудования", МассивНоменклатураОборудование);
		
		ВыборкаЧернила = ЗапросОборудование.Выполнить().Выбрать();
		
		СсылкаНаПредопределенныйСправочник = Справочники.смартПредопределенныеЗначения.ОборудованиеГруппаЧернила;
		
		ГруппаЧернила = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СсылкаНаПредопределенныйСправочник, Ложь);
				
		Если ЗначениеЗаполнено(ГруппаЧернила) Тогда
			
			Пока ВыборкаЧернила.Следующий() Цикл
				// Проверка, является ли чернилами
				ЭтоЧернила = ВыборкаЧернила.смартСоответствиеСОбрудованиемИЧерниламиКлиентов.ПринадлежитЭлементу(ГруппаЧернила);
				
				Если НЕ ЭтоЧернила Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныйТипЧернилОборудование = ВыборкаЧернила.смартСоответствиеСОбрудованиемИЧерниламиКлиентов;
				
				// Первый найденный тип чернил подставляется во все строки
				Для Каждого ТекСтрока Из Оборудование Цикл
					ТекСтрока.ТипЧернилОборудование = НайденныйТипЧернилОборудование;	
				КонецЦикла;
				
				// Дальше строки не обрабатываются
				Прервать; 
				
			КонецЦикла;
		КонецЕсли;
		//-- смарт:ММ 07.02.2021
		//++ #1328 смарт: Фролов 21.03.2023 //Добавить спецификацию оборудования iECHO в Заявку на пусконаладку 
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Если ТипЗнч(ДокументОснование.ДокументОснование)=Тип("ДокументСсылка.смартIECHOСпецификация") Тогда		
				Запрос=Новый Запрос("ВЫБРАТЬ
				                    |	смартIECHOСпецификацияКомплектующие.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
				                    |	смартIECHOСпецификацияКомплектующие.Количество КАК Количество,
				                    |	смартIECHOСпецификацияКомплектующие.Цена КАК Цена,
				                    |	смартIECHOСпецификацияКомплектующие.Стоимость КАК Стоимость
				                    |ИЗ
				                    |	Документ.смартIECHOСпецификация.Комплектующие КАК смартIECHOСпецификацияКомплектующие
				                    |ГДЕ
				                    |	смартIECHOСпецификацияКомплектующие.Ссылка = &Ссылка
				                    |	И НЕ смартIECHOСпецификацияКомплектующие.НаименованиеКомплектующей.ОсновнаяКомплектующая");
				Запрос.УстановитьПараметр("Ссылка",ДокументОснование.ДокументОснование);
				Рез=Запрос.Выполнить().Выгрузить();
				Комплектующие.Загрузить(Рез);
			КонецЕсли;
		КонецЕсли;	
		//-- #1328 смарт: Фролов 21.03.2023
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УведомлениеОтправлено = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокументОснование = Неопределено;
	Статус = Неопределено;
	
	//++ #Б-2726 смарт: Лопато 19.03.2025 //Новая ветка ТГ Бота - Документ Заявка на ПНР.  
	РезультатОтправлен = Ложь;
	КоличествоПостроенныхЦветовыхПрофилей = 0;
	КоличествоПостроенныхКартСтола = 0;
	ПроблемаСУпаковкой = Неопределено;
	ДатаПодписанияАктаПНР = Неопределено;
	ЗамечанияСоСтороныЗаказчика = "";
	ЗамечанияСоСтороныИнженера = "";
	//-- #Б-2726 смарт: Лопато 19.03.2025

	//++ #Б-2804 смарт: Лопато 28.03.2025 //ТГ Бот. Добавить в ЗНР и ПНР возможность выбора операционной системы клиента.  
	ОСКлиента = Неопределено;
	//-- #Б-2804 смарт: Лопато 28.03.2025
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ смарт:ММ #099 409 23.03.2021 Регламентное обслуживание
	ОтразитьсмартТехническоеОбслуживаниеОборудованияПоКлиентам();
	//-- смарт:ММ 23.03.2021

	//++ смарт:ММ #094 411 07.02.2021
	НеОтправлятьУведомления = Ложь;
	Если ДополнительныеСвойства.Свойство("НеОтправлятьУведомления") = Истина Тогда
		НеОтправлятьУведомления = ДополнительныеСвойства.НеОтправлятьУведомления;
	КонецЕсли;
	
	Если НЕ НеОтправлятьУведомления Тогда
	//-- смарт:ММ 07.02.2021
	
	// ++ 05.05.2021
	ПовторноеРазмещение = Ложь;
	// --
	
	Если ДополнительныеСвойства.Свойство("смартПредыдущийСтатус") = Истина 
		И ДополнительныеСвойства.смартПредыдущийСтатус <> Статус Тогда
		
		МассивСообщений = Новый Массив;
		Документы.смартЗаявкаНаПускоНаладку.ОтправитьУведомлениеОСменеСтатуса(Ссылка, МассивСообщений);
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
		
		// ++ 05.05.2021
		Если ДополнительныеСвойства.смартПредыдущийСтатус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ТребуетКорректировки Тогда
			ПовторноеРазмещение = Истина;
		КонецЕсли;
		// --
		
		Если Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ОтправленаВПредставительство Тогда
			
			// Уведомление руководителю подразделения (представительства)
			Успех = ОтправитьУведомление("ПроведениеСоСтатусомОтправленаВПредставительство");
			
		КонецЕсли;
		
		//++ #Б-2282 смарт: Фролов 11.03.2025 //Оповещение руководителей при назначении новому партнеру менеджера по расходке
		Если Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена Тогда
			
			Если ЗначениеЗаполнено(Партнер) Тогда
				
				Если НЕ ЗначениеЗаполнено(Партнер.смартМенеджерПоРасходнымМатериалам) 
					ИЛИ Партнер.смартМенеджерПоРасходнымМатериалам = Партнер.ОсновнойМенеджер Тогда
					
					Если ЗначениеЗаполнено(Партнер.БизнесРегион) Тогда
						
						БизнесРегионВерхнегоУровня = смартОбщегоНазначения.НайтиРегионВерхнегоУровня(Партнер.БизнесРегион);
						
						Если ЗначениеЗаполнено(БизнесРегионВерхнегоУровня) Тогда
							
							БизнесРегионЦФО = Справочники.смартПредопределенныеЗначения.ЦентральныйФО.Значение;
							
							НайденноеПредставительство = БизнесРегионВерхнегоУровня.смартОтветственоеПодразделение; 
							
							Запрос = Новый Запрос(
							"ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	Пользователь КАК Менеджер
							|ПОМЕСТИТЬ МенеджерыПоРасходке
							|ИЗ
							|	Справочник.смартКвалификацииМенеджеров.Пользователи
							|ГДЕ
							|	Пользователь.Подразделение = &НайденноеПредставительство
							|	И Ссылка.ТипПродукта = &Расходка
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|	МенеджерыПоРасходке.Менеджер КАК Менеджер,
							|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручки
							|ИЗ
							|	МенеджерыПоРасходке КАК МенеджерыПоРасходке
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, Период, 
							|		) КАК ВыручкаИСебестоимостьПродажОбороты
							|		ПО МенеджерыПоРасходке.Менеджер = ВыручкаИСебестоимостьПродажОбороты.Менеджер
							|
							|СГРУППИРОВАТЬ ПО
							|	МенеджерыПоРасходке.Менеджер
							|
							|УПОРЯДОЧИТЬ ПО
							|	СуммаВыручки");
							Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДата(), -30));
							Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
							Запрос.УстановитьПараметр("Расходка", Справочники.смартТипыПродуктов.Расходка); 
							Запрос.УстановитьПараметр("НайденноеПредставительство", НайденноеПредставительство);
							
							Выборка = Запрос.Выполнить().Выбрать();
							
							Если Выборка.Следующий() Тогда
								
								УчетнаяЗаписьПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
								
								ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
								ТестовыеАдресаСтрока = "";
								ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
								
								Если БизнесРегионВерхнегоУровня = БизнесРегионЦФО ИЛИ НЕ ЗначениеЗаполнено(Партнер.смартМенеджерПоРасходнымМатериалам) Тогда
									
									АдресаДляОтправкиСтрокой = "";
									МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(Выборка.Менеджер, АдресаДляОтправкиСтрокой);
									
									МассивАдресовДляОтправкиКопии = Новый Массив;
									АдресаДляОтправкиСтрокойКопии = "";
									
									ГоловнойОфисМосква=Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение;
									ПодразделениеПользователя = Выборка.Менеджер.Подразделение;
									
									Если ЗначениеЗаполнено(ПодразделениеПользователя) И НЕ ПодразделениеПользователя = ГоловнойОфисМосква Тогда	
										
										Если ЗначениеЗаполнено(ПодразделениеПользователя.ТекущийРуководитель) Тогда
											
											МассивАдресовДляОтправкиКопии = смартОбщегоНазначения.ПолучитьАдресПользователяПоФизЛицу(ПодразделениеПользователя.ТекущийРуководитель
											, АдресаДляОтправкиСтрокойКопии);	
											
										КонецЕсли;
										
									КонецЕсли;
									
									МассивАдресов = Справочники.смартПредопределенныеЗначения.Настройки.ПолучателиРассылокПоРасходнымМатериалам.ВыгрузитьКолонку("АдресПочты");	
									
									Для Каждого ЭлементАдрес Из МассивАдресов Цикл
										
										АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(ЭлементАдрес);
										
										Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
											
											Если НЕ ЗначениеЗаполнено(ЭлементСтруктуры.ОписаниеОшибки) Тогда
												
												МассивАдресовДляОтправкиКопии.Добавить(Новый Структура("Адрес, Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
												АдресаДляОтправкиСтрокойКопии = АдресаДляОтправкиСтрокойКопии 
												+ ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокойКопии), ", ", "") + ЭлементСтруктуры.Адрес;
												
											КонецЕсли;	
											
										КонецЦикла;
										
									КонецЦикла;
									
									ОбПартнер = Партнер.ПолучитьОбъект();
									НавСсылка = ПолучитьНавигационнуюСсылку(ОбПартнер);
									ТекстПисьма = "";
									
									ТемаПисьма = "Пользователь назначен менеджером по РМ!";
									
									ТекстПисьма = Символы.ПС + "Менеджер: " + Выборка.Менеджер + Символы.ПС;
									ТекстПисьма = ТекстПисьма + "назначен основным менеджером по расходным материалам партнера: " + Партнер + Символы.ПС;
									ТекстПисьма = ТекстПисьма + "Ссылка на партнера: " + НавСсылка + Символы.ПС;
									
									Если ЗначениеЗаполнено(УчетнаяЗаписьПочты)
										И (ТестовыеАдресаМассив.Количество() > 0
										ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
										
										ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
										ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, МассивАдресовДляОтправкиКопии, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
										
										Попытка
											
											ОбПартнер.смартМенеджерПоРасходнымМатериалам = Выборка.Менеджер;
											ОбПартнер.Записать();
											
											ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьПочты, ПараметрыПисьма);
											
										Исключение
											
											ТекстСообщения = "Не удалось отправить письмо, полльзователю " + Выборка.Менеджер 
											+ " по назначению ответственным по РМ партнера " + Партнер + Символы.ПС + ОписаниеОшибки(); 
											ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
											
										КонецПопытки;
										
									КонецЕсли;
									
								ИначеЕсли ЗначениеЗаполнено(Партнер.смартМенеджерПоРасходнымМатериалам)
									И НЕ Выборка.Менеджер = Партнер.смартМенеджерПоРасходнымМатериалам Тогда
									
									МассивАдресовДляОтправки = Новый Массив;
									АдресаДляОтправкиСтрокой = "";
									
									ГоловнойОфисМосква=Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение;
									ПодразделениеПользователя = Выборка.Менеджер.Подразделение;
									
									Если ЗначениеЗаполнено(ПодразделениеПользователя) И НЕ ПодразделениеПользователя = ГоловнойОфисМосква Тогда	
										
										Если ЗначениеЗаполнено(ПодразделениеПользователя.ТекущийРуководитель) Тогда
											
											МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресПользователяПоФизЛицу(ПодразделениеПользователя.ТекущийРуководитель
											, АдресаДляОтправкиСтрокой);	
											
										КонецЕсли;
										
									КонецЕсли;
									
									МассивАдресов = Справочники.смартПредопределенныеЗначения.Настройки.ПолучателиРассылокПоРасходнымМатериалам.ВыгрузитьКолонку("АдресПочты");	
									
									Для Каждого ЭлементАдрес Из МассивАдресов Цикл
										
										АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(ЭлементАдрес);
										
										Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
											
											Если НЕ ЗначениеЗаполнено(ЭлементСтруктуры.ОписаниеОшибки) Тогда
												
												МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
												АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой 
												+ ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
												
											КонецЕсли;	
											
										КонецЦикла;
										
									КонецЦикла;
									
									ОбПартнер = Партнер.ПолучитьОбъект();
									НавСсылка = ПолучитьНавигационнуюСсылку(ОбПартнер);
									ТекстПисьма = "";
									
									ТемаПисьма = "Рекомендуемая замена менеджера по РМ!";
									
									ТекстПисьма = Символы.ПС + "Основной менедждер: " + Партнер.ОсновнойМенеджер + Символы.ПС;
									ТекстПисьма = Символы.ПС + "Основной менедждер по РМ: " + Партнер.смартМенеджерПоРасходнымМатериалам + Символы.ПС;
									ТекстПисьма = ТекстПисьма + "Основываясь на данных по загрузке менеджеров, рекомендуем менеджера по РМ: " + Выборка.Менеджер + Символы.ПС;
									ТекстПисьма = ТекстПисьма + "Ссылка на партнера: " + НавСсылка + Символы.ПС;
									
									Если ЗначениеЗаполнено(УчетнаяЗаписьПочты)
										И (ТестовыеАдресаМассив.Количество() > 0
										ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
										
										ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
										ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
										
										Попытка
											
											ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьПочты, ПараметрыПисьма);
											
										Исключение
											
											ТекстСообщения = "Не удалось отправить письмо, полльзователю " + Выборка.Менеджер 
											+ " по рекомендации назначения ответственным по РМ партнера " + Партнер + Символы.ПС + ОписаниеОшибки(); 
											ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
											
										КонецПопытки;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;	
							
						КонецЕсли;	
						
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;	
				
		КонецЕсли;
		//-- #Б-2282 смарт: Фролов 11.03.2025
		
		//++ #Б-3180 смарт: Лопато 18.07.2025 //Лицензии IECHO. Отражение в учетной программе. 
		Если НЕ Отказ
			И (Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена
			   ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно) Тогда
			   
			АктивироватьЛицензииПО(Ссылка, Оборудование.Выгрузить(, "Оборудование, Серия, ДатаПодписанияАктаНаПНР"));
			
		КонецЕсли;
		//-- #Б-3180 смарт: Лопато 18.07.2025
		
	КонецЕсли;
	
	Если НЕ УведомлениеОтправлено 
		// ++ 05.05.2021
		ИЛИ ПовторноеРазмещение 
		// --
		Тогда
		Успех = ОтправитьУведомление("Проведение");
		Если Успех Тогда
			// Повторная запись объекта для изменения реквизита
			УведомлениеОтправлено = Истина;
			ЭтотОбъект.ОбменДанными.Загрузка = Истина;
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;

	//++ смарт:ММ #094 411 07.02.2021
	КонецЕсли;
	//-- смарт:ММ 07.02.2021
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ ПометкаУдаления Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка не отменена. Для отмены пометьте заявку на удаление");	
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьРеквизитыПоКонтрагенту() Экспорт
	
	АдресВыезда = "";
	АдресВыездаЗначенияПолей = "";
	НомерТелефонаКонтрагента = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияАдрес.Представление, """") КАК АдресВыезда,
	|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияАдрес.ЗначенияПолей, """") КАК АдресВыездаЗначенияПолей
	|ПОМЕСТИТЬ ВТ_Адрес
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияАдрес
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформацияАдрес.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформацияАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтрагентыКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияТелефон.Представление, """") КАК НомерТелефонаКонтрагента
	|ПОМЕСТИТЬ ВТ_Телефон
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияТелефон
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформацияТелефон.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформацияТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Адрес.АдресВыезда, """") КАК АдресВыезда,
	|	ЕСТЬNULL(ВТ_Адрес.АдресВыездаЗначенияПолей, """") КАК АдресВыездаЗначенияПолей,
	|	ЕСТЬNULL(ВТ_Телефон.НомерТелефонаКонтрагента, """") КАК НомерТелефонаКонтрагента
	|ИЗ
	|	ВТ_Адрес КАК ВТ_Адрес
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Телефон КАК ВТ_Телефон
	|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		АдресВыезда = Выборка.АдресВыезда;
		АдресВыездаЗначенияПолей = Выборка.АдресВыездаЗначенияПолей;
		НомерТелефонаКонтрагента = Выборка.НомерТелефонаКонтрагента;
	КонецЕсли;

КонецПроцедуры

Функция ОтправитьУведомление(ВидУведомления)
	
	МассивСообщений = Новый Массив;
	Успех = Документы.смартЗаявкаНаПускоНаладку.ОтправитьПисьма(Ссылка, ВидУведомления, МассивСообщений);
	
	Для Каждого Сообщение Из МассивСообщений Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	КонецЦикла;
	
	Возврат Успех;
	
КонецФункции

Функция ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо) Экспорт
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("Телефон", "");
	СтруктураВозврат.Вставить("ЭлПочта", "");
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Телефон.Представление КАК Телефон,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыТелефонов
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Телефон
	|ГДЕ
	|	Телефон.Ссылка = &КонтактноеЛицо
	|	И Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Мобильный.Представление,
	|	2
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Мобильный
	|ГДЕ
	|	Мобильный.Ссылка = &КонтактноеЛицо
	|	И Мобильный.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Мобильный.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ПриоритетыТелефонов.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныйПриоритет
	|ИЗ
	|	ВТ_ПриоритетыТелефонов КАК ВТ_ПриоритетыТелефонов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ПриоритетыТелефонов.Телефон КАК Телефон
	|ПОМЕСТИТЬ ВТ_Телефон
	|ИЗ
	|	ВТ_МинимальныйПриоритет КАК ВТ_МинимальныйПриоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыТелефонов КАК ВТ_ПриоритетыТелефонов
	|		ПО ВТ_МинимальныйПриоритет.Приоритет = ВТ_ПриоритетыТелефонов.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЭлАдрес.Представление) КАК ЭлПочта
	|ПОМЕСТИТЬ ВТ_ЭлПочта
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ЭлАдрес
	|ГДЕ
	|	ЭлАдрес.Ссылка = &КонтактноеЛицо
	|	И ЭлАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ЭлАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Телефон.Телефон, """") КАК Телефон,
	|	ЕСТЬNULL(ВТ_ЭлПочта.ЭлПочта, """") КАК ЭлПочта
	|ИЗ
	|	ВТ_Телефон КАК ВТ_Телефон
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЭлПочта КАК ВТ_ЭлПочта
	|		ПО (ИСТИНА)";
		
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураВозврат.Телефон = Выборка.Телефон;
		СтруктураВозврат.ЭлПочта = Выборка.ЭлПочта;
		
	КонецЕсли;

	Возврат СтруктураВозврат;
	
КонецФункции

Функция ЭтоПлоттер(мОборудование) 
	
	ТоварыПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	
	Возврат мОборудование.ВидНоменклатуры = ТоварыПлоттерыСерии;
	
КонецФункции

Функция ПолучитьТекстЗапросаОборудованиеИзЗаказаКлиента(БезОграниченийПоКоличесву = Ложь) Экспорт //++ #1847 смарт: Фролов 10.06.2024 //Оборудование в Заявке на ПНР
	
	ТекстЗапроса = 
	//++ #1305 смарт: Фролов 16.02.2023 //Отчет Стоимость использования оборудования  
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	//|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	////++ смарт:ММ 04.10.2020
	//|	ЗаказКлиентаТовары.Серия КАК Серия,
	////-- смарт:ММ 04.10.2020
	////++ смарт:ММ #090 436 30.12.2020 - Фоновое изменение заявки на пусконаладку при изменении заказа клиента
	//|	ЗаказКлиентаТовары.Отменено КАК Отменено,
	////-- смарт:ММ 30.12.2020
	////++ смарт:ММ #094 411 07.02.2021
	//|	НоменклатураСпр.смартСоответствиеСОбрудованиемИЧерниламиКлиентов КАК смартСоответствиеСОбрудованиемИЧерниламиКлиентов,
	////-- смарт:ММ 07.02.2021
	//|	ЕСТЬNULL(РасходныйОрдерНаТовары.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтгрузки
	//|ИЗ
	//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	//|			ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТовары.Ссылка
	//|		ПО ЗаказКлиентаТовары.Ссылка = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	//|			И ЗаказКлиентаТовары.Номенклатура = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураСпр.Ссылка
	//|ГДЕ
	//|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	//|	И ВЫБОР
	//|			КОГДА &ОтборНоменклатура
	//|				ТОГДА НоменклатураСпр.Ссылка = &Номенклатура
	//|			ИНАЧЕ НоменклатураСпр.ВидНоменклатуры = &ТоварПлоттерыСерии
	//|		КОНЕЦ";
	//++ #1847 смарт: Фролов 10.06.2024 //Оборудование в Заявке на ПНР
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ " + ?(БезОграниченийПоКоличесву, "", "ПЕРВЫЕ 1") + "
	//-- #1847 смарт: Фролов 10.06.2024
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Серия КАК Серия,
	|	ЗаказКлиентаТовары.Отменено КАК Отменено,
	|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК смартСоответствиеСОбрудованиемИЧерниламиКлиентов,
	|	НачалоПериода(ЕСТЬNULL(РасходныйОрдерНаТовары.Дата, ДАТАВРЕМЯ(1, 1, 1)), День) КАК ДатаОтгрузки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|			ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТовары.Ссылка
	|		ПО ЗаказКлиентаТовары.Ссылка = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	|			И ЗаказКлиентаТовары.Номенклатура = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|		ПО ЗаказКлиентаТовары.Номенклатура = смартОборудованиеЧернилаКлиентов.Номенклатура
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|	И смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром
	|	И ВЫБОР
	|			КОГДА &ОтборНоменклатура
	|				ТОГДА смартОборудованиеЧернилаКлиентов.Номенклатура = &Номенклатура
	|			ИНАЧЕ смартОборудованиеЧернилаКлиентов.Номенклатура.ВидНоменклатуры = &ТоварПлоттерыСерии
	|		КОНЕЦ";
	//-- #1305 смарт: Фролов 16.02.2023
	
	Возврат ТекстЗапроса;
	
КонецФункции

//++ смарт:ММ #094 411 07.02.2021
Функция ПолучитьТекстЗапросаЧернилаИзЗаказаКлиента()
	
	ТекстЗапроса = 
	//++ #1305 смарт: Фролов 16.02.2023 //Отчет Стоимость использования оборудования  
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	//|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	//|	ЗаказКлиентаТовары.Отменено КАК Отменено,
	//|	НоменклатураСпр.смартСоответствиеСОбрудованиемИЧерниламиКлиентов КАК смартСоответствиеСОбрудованиемИЧерниламиКлиентов
	//|ИЗ
	//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураСпр.Ссылка
	//|ГДЕ
	//|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	//|	И НЕ ЗаказКлиентаТовары.Отменено
	//|	И НЕ ЗаказКлиентаТовары.Номенклатура В (&СписокОборудования)
	//|	И НоменклатураСпр.смартСоответствиеСОбрудованиемИЧерниламиКлиентов <> ЗНАЧЕНИЕ(Справочник.смартОборудованиеКлиентов.ПустаяСсылка)";

	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Отменено КАК Отменено,
	|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК смартСоответствиеСОбрудованиемИЧерниламиКлиентов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|		ПО ЗаказКлиентаТовары.Номенклатура = смартОборудованиеЧернилаКлиентов.Номенклатура
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И НЕ ЗаказКлиентаТовары.Номенклатура В (&СписокОборудования)
	|	И смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром";
	//-- #1305 смарт: Фролов 16.02.2023
	Возврат ТекстЗапроса;
	
КонецФункции //-- смарт:ММ 07.02.2021

//++ смарт:ММ #099 409 23.03.2021 Регламентное обслуживание
Процедура ОтразитьсмартТехническоеОбслуживаниеОборудованияПоКлиентам()
	
	Движения.смартТехническоеОбслуживаниеОборудованияПоКлиентам.Записывать = Истина;
	
	Если Статус <> Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена Тогда
		Движения.смартТехническоеОбслуживаниеОборудованияПоКлиентам.Очистить();
		Возврат;
	КонецЕсли;
	
	СоответствиеКоличествоМесяцев = Новый Соответствие; 
	//++ #Б-1606 смарт: Ермаков 06.12.2024 / Сроки замены запчастей (смарт). Дополнения.
	СоответствиеКоличествоМесяцев.Вставить(ПредопределенноеЗначение("Перечисление.смартСрокиЗаменыЗапчастей.Три"), 3);
	//-- #Б-1606 смарт: Ермаков 06.12.2024
	СоответствиеКоличествоМесяцев.Вставить(ПредопределенноеЗначение("Перечисление.смартСрокиЗаменыЗапчастей.Шесть"), 6);
	СоответствиеКоличествоМесяцев.Вставить(ПредопределенноеЗначение("Перечисление.смартСрокиЗаменыЗапчастей.Двенадцать"), 12);
	СоответствиеКоличествоМесяцев.Вставить(ПредопределенноеЗначение("Перечисление.смартСрокиЗаменыЗапчастей.ТридцатьШесть"), 36);
	СоответствиеКоличествоМесяцев.Вставить(ПредопределенноеЗначение("Перечисление.смартСрокиЗаменыЗапчастей.Шестьдесят"), 60);

	График = Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ");
	
	Для Каждого СтрокаОборудование Из Оборудование Цикл
		
		ДатаПодписанияАктаНаПНР = СтрокаОборудование.ДатаПодписанияАктаНаПНР;
		
		Если НЕ ЗначениеЗаполнено(ДатаПодписанияАктаНаПНР) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОборудование = СтрокаОборудование.ОборудованиеКлиентов;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартТехническоеОбслуживаниеОборудования.Оборудование КАК Оборудование,
		|	смартТехническоеОбслуживаниеОборудования.Запчасть КАК Запчасть,
		|	смартТехническоеОбслуживаниеОборудования.СрокЗамены КАК СрокЗамены,
		|	смартТехническоеОбслуживаниеОборудования.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.смартТехническоеОбслуживаниеОборудования КАК смартТехническоеОбслуживаниеОборудования
		|ГДЕ
		|	смартТехническоеОбслуживаниеОборудования.Оборудование = &Оборудование";
		
		Запрос.УстановитьПараметр("Оборудование", ТекОборудование);
			
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДатыБлижайшихРабочихДней = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.смартТехническоеОбслуживаниеОборудованияПоКлиентам.Добавить();
			Движение.Клиент 			= Партнер;
			Движение.Контрагент 		= Контрагент;
			Движение.Оборудование 		= ТекОборудование;
			Движение.Серия 				= СтрокаОборудование.Серия;
			Движение.ДатаПодписанияАктаНаПНР = ДатаПодписанияАктаНаПНР;
			Движение.СрокЗамены 		= Выборка.СрокЗамены;
			Движение.Запчасть 			= Выборка.Запчасть;
			Движение.Количество 		= Выборка.Количество;
			Движение.Представительство 	= Представительство;
			
			МесяцевДобавить = СоответствиеКоличествоМесяцев.Получить(Выборка.СрокЗамены);
					
			Если МесяцевДобавить <> 0 Тогда
				
				ДатаТОУКлиента = ДобавитьМесяц(ДатаПодписанияАктаНаПНР, МесяцевДобавить);
				
				РассчитаннаяДата = Неопределено;
				//rnp закомментировано, т.к. рассчитанная дата может отличаться для разных запчастей оборудования
				//Если ТипЗнч(ДатыБлижайшихРабочихДней) = Тип("Соответствие") Тогда
				//	
				//	РассчитаннаяДата = ДатыБлижайшихРабочихДней.Получить(ДатаТОУКлиента);
				//	
				//КонецЕсли;
				//
				//Если НЕ ЗначениеЗаполнено(РассчитаннаяДата) Тогда
				
				//rnp надо бы делать проверку на заполненность произв. календаря, но...
				
				//Если ПроизводственныйКалендарьНеЗаполнен  Тогда
				//	Отказ = Истина;
				//	Возврат;
				//КонецЕсли;
				//т.к. на 3 года вперед календарь точно не будет заполнен, то в регистр пишем просто дату ТО, не расчетную

					//МассивДат = Новый Массив;
					//МассивДат.Добавить(ДатаТОУКлиента);
					//
					//
					//					
					//ДатыБлижайшихРабочихДней = КалендарныеГрафики.ДатыБлижайшихРабочихДней(График, МассивДат, Истина,,Истина);
					//РассчитаннаяДата = ДатыБлижайшихРабочихДней.Получить(ДатаТОУКлиента);
				//КонецЕсли;
				
				Движение.ДатаТОУКлиента = ?(ЗначениеЗаполнено(РассчитаннаяДата), РассчитаннаяДата, ДатаТОУКлиента);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры //-- смарт:ММ 23.03.2021

//++ #Б-3550 смарт: Фролов 16.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗПР
Процедура ПриЗаписи(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_Интерес.Дата КАК Дата,
	|	CRM_Интерес.Номер КАК Номер,
	|	CRM_Интерес.Тема КАК Тема,
	|	CRM_Интерес.Партнер КАК Партнер,
	|	CRM_Интерес.Ответственный КАК Ответственный,
	|	CRM_Интерес.Подразделение КАК Подразделение,
	|	CRM_Интерес.Организация КАК Организация,
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ИСТИНА КАК ВведенНаОсновании,
	|	ЛОЖЬ КАК ОсновнойИнтерес,
	|	CRM_Интерес.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	НЕ CRM_Интерес.ПометкаУдаления
	|	И CRM_Интерес.ДокументОснование = &ЗРР");
	Запрос.УстановитьПараметр("ЗРР", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		
		ОбИнтерес = Результат[0].Ссылка.ПолучитьОбъект();
		
		ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов", Результат);
		
	КонецЕсли;	
	
	//++ #Б-4738 смарт: Фролов 16.10.2025 //Создание отчета по эффективности обработки заявок СЦ.
	Если НЕ ДополнительныеСвойства.смартПредыдущийСтатус = Статус Тогда
		
		СмартСервер.ЗафиксироватьИзменениеСтатусаЗаявокНаРемонтныеРаботыИПНР(Ссылка, ДополнительныеСвойства.смартПредыдущийСтатус, Статус);
		
	КонецЕсли;
	//-- #Б-4738 смарт: Фролов 16.10.2025
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый И Результат.Количество() = 0 Тогда
		
		//++ #Б-4358 смарт: Фролов 16.09.2025 //Отключение автоматического создание Интересов из заявок (ЗРР, ЗПНР)
		//ОбИнтерес = Документы.CRM_Интерес.СоздатьДокумент();	
		//ОбИнтерес.Дата = ТекущаяДата();
		//ОбИнтерес.ДокументОснование = Ссылка;
		//ОбИнтерес.КонтактноеЛицо = ?(КонтактныеЛица.Количество() > 0, КонтактныеЛица[0].КонтактноеЛицо, Неопределено);
		//ОбИнтерес.смартИнтересКанал = Справочники.смартПредопределенныеЗначения.Настройки.КаналДляРемонтныхРабот;
		//ОбИнтерес.смартИнтересИсточник = Справочники.смартПредопределенныеЗначения.Настройки.ИсточникДляРемонтныхРабот;
		//ОбИнтерес.ЦенаВключаетНДС = Истина;
		//ОбИнтерес.Партнер = Ссылка.Партнер;
		//ОбИнтерес.РучнойВводДатыПродажи = Истина;
		//ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.ПусконаладкаПусконаладкаОборудования;
		//ОбИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		//ОбИнтерес.смартВоронкаНовые = Истина;
		//ОбИнтерес.Тема = "Заявка на ПНР " + Ссылка.Партнер + " от " + ТекущаяДата();
		//ОбИнтерес.Организация = Ссылка.Организация;
		//ОбИнтерес.СостояниеИнтереса = Справочники.смартПредопределенныеЗначения.Настройки.СтартовыйЭтапИнтересаПоЗПР;
		//
		//Если ЗначениеЗаполнено(Ссылка.ОтветственныйСЦ) Тогда
		//	
		//	ОбИнтерес.Ответственный = Ссылка.ОтветственныйСЦ;
		//	ОбИнтерес.Подразделение = Ссылка.ОтветственныйСЦ.Подразделение;
		//	ОбИнтерес.Офис = Ссылка.ОтветственныйСЦ.Подразделение.CRM_офис;
		//	
		//КонецЕсли;
		//
		//ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
		//-- #Б-4358 смарт: Фролов 16.09.2025
		
	ИначеЕсли ТипЗнч(ОбИнтерес) = Тип("ДокументОбъект.CRM_Интерес") Тогда
		
		НужноЗаписатьИнтерес = Ложь;
		
		Если НЕ Ссылка.ОтветственныйСЦ = ОбИнтерес.Ответственный Тогда
			
			ОбИнтерес.Ответственный = Ссылка.ОтветственныйСЦ;
			ОбИнтерес.Подразделение = Ссылка.ОтветственныйСЦ.Подразделение;
			ОбИнтерес.Офис = Ссылка.ОтветственныйСЦ.Подразделение.CRM_офис;
			
			НужноЗаписатьИнтерес = Истина;
			
		КонецЕсли;
		
		Если НЕ Статус = ДополнительныеСвойства.смартПредыдущийСтатус Тогда
			
			Если Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена Тогда
				
				ОбИнтерес.смартВариантУспешногоЗавершения = Справочники.смартВариантыУспешногоЗавершенияИнтереса.ПусконаладкаВыполнена;
				НужноЗаписатьИнтерес = Истина;
				
			ИначеЕсли Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно Тогда
				
				ОбИнтерес.смартВариантУспешногоЗавершения = Справочники.смартВариантыУспешногоЗавершенияИнтереса.ПусконаладкаВыполненаДистанционно;
				НужноЗаписатьИнтерес = Истина;
				
			ИначеЕсли Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.КлиентЗапустилОборудованиеСамостоятельно Тогда
				
				ОбИнтерес.смартВариантУспешногоЗавершения = Справочники.смартВариантыУспешногоЗавершенияИнтереса.КлиентЗапустилОборудованиеСамостоятельно;
				НужноЗаписатьИнтерес = Истина;
				
			КонецЕсли;	
		
		КонецЕсли;
		
		Если НужноЗаписатьИнтерес Тогда
			
			ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ТребуетсяОформлениеКомандировки") И ЗначениеЗаполнено(Представительство) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			//++ #Б-3668 смарт: Фролов 01.07.2025 //Ошибка. Неверная адресация задач по оформлению командировок.
			//Временно отключена постановка задач в регионы
			Если Представительство = Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение Тогда
				
				РольИсполнителя = Справочники.РолиИсполнителей.ОформлениеКомандировокГоловнойОфис;
				
				//Иначе	
				//	
				//	РольИсполнителя = Представительство.смартИсполнительОтПодразделения; 
				//
				//КонецЕсли;
				
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	Исполнитель КАК Исполнитель
				|ИЗ
				|	РегистрСведений.ИсполнителиЗадач
				|ГДЕ
				|	РольИсполнителя = &РольИсполнителя");
				Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителя);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
					ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
					ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
					ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.ОформлениеКомандировки;
					ЗадачаОбъект.CRM_Личная = Истина;
					
					ЗадачаОбъект.Исполнитель = Выборка.Исполнитель;
					
					ЗадачаОбъект.Предмет = Ссылка;
					
					ЗадачаОбъект.Описание = "Необходимо оформить командировку по заявке на пуско-наладке " + Ссылка;
					ЗадачаОбъект.Наименование = "Необходимо оформить командировку по заявке на пуско-наладке";
					ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
					ЗадачаОбъект.СрокИсполнения = ЗадачаОбъект.Дата + 86400;
					ЗадачаОбъект.Записать();
					
				КонецЦикла; 
				
			КонецЕсли;
			//-- #Б-3668 смарт: Фролов 01.07.2025	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	//++ #Б-5954 смарт: Фролов 25.03.2026 //Автозадачи. Звонок после ПНР
	Если (Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена
		ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно
		ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.КлиентЗапустилОборудованиеСамостоятельно) 
		И НачалоДня(ДатаПодписанияАктаПНР) <= НачалоДня(ТекущаяДата()) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_Взаимодействие
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И смартВидЗадачи = &смартВидЗадачи
		|	И ДокументОснование = &ДокументОснование");
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		Запрос.УстановитьПараметр("смартВидЗадачи", Справочники.смартВидыЗадач.ЗвонокПослеПНР);
		
		Если Запрос.Выполнить().Пустой() Тогда
			
			НовоеВзаимодействие = Документы.CRM_Взаимодействие.СоздатьДокумент();
			//++ #Б-6464 смарт: Фролов 13.04.2026 //При создании взаимодействия после ПНР автором сделать пользователя <Не указан>
			//НовоеВзаимодействие.Автор					= Пользователи.ТекущийПользователь();
			НовоеВзаимодействие.Автор					= Справочники.Пользователи.НайтиПоНаименованию("<Не указан>");
			//-- #Б-6464 смарт: Фролов 13.04.2026
			//++ #Б-6572 смарт: Фролов 22.04.2026 //Поле Подразделение не заполняется во взаимодействиях и выдает ошибку.
			НовоеВзаимодействие.Подразделение			= Ответственный.Подразделение;
			//-- #Б-6572 смарт: Фролов 22.04.2026
			НовоеВзаимодействие.Тема					= "Телефонный звонок клиенту";
			НовоеВзаимодействие.ВидВзаимодействия		= Справочники.смартПредопределенныеЗначения.Настройки.ТелефонныйЗвонокВПартнере;
			НовоеВзаимодействие.ДокументОснование		= Ссылка;
			НовоеВзаимодействие.смартВидЗадачи          = Справочники.смартВидыЗадач.ЗвонокПослеПНР;
			НовоеВзаимодействие.СтатусВзаимодействия	= Справочники.CRM_СостоянияСобытий.Запланировано;
			НовоеВзаимодействие.Партнер					= Партнер;
			Если КонтактныеЛица.Количество() > 0 Тогда 
			НовоеВзаимодействие.КонтактноеЛицо			= КонтактныеЛица[0].КонтактноеЛицо;
			КонецЕсли;
			НовоеВзаимодействие.Дата					= ТекущаяДатаСеанса();
			НовоеВзаимодействие.ПлановаяДата			= ТекущаяДатаСеанса() + Справочники.смартПредопределенныеЗначения.Настройки.СрокДляВзаимодействияПослеПНР * 86400;
			НовоеВзаимодействие.Ответственный			= Ответственный;
			НовоеВзаимодействие.НаВесьДень = Истина;
			НовоеВзаимодействие.Записать();
			
			НавСсылкаВзаимодействие = ПолучитьНавигационнуюСсылку(НовоеВзаимодействие.Ссылка);
			
			УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
			ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
			
			ТестовыеАдресаСтрока = "";
			ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
			
			АдресаДляОтправкиСтрокой = "";
			МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(Ответственный, АдресаДляОтправкиСтрокой);

			НавСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
			
			ТекстПисьма = Символы.ПС + "Завершена пусконаладка оборудования - акт подписан: " + Формат(ДатаПодписанияАктаПНР, "ДФ=dd.MM.yyyy");
			ТекстПисьма = ТекстПисьма + Символы.ПС + "Выполните звонок клиенту " + Партнер; 
			ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + "Ссылка на заявку: " + НавСсылка;
			ТекстПисьма = ТекстПисьма + Символы.ПС + "Ссылка на взаимодействие: " + НавСсылкаВзаимодействие;
			
			ТемаПисьма = "Напоминание о звонке клиенту по заявке " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
			
			Если ЗначениеЗаполнено(УчетнаяЗапись)
				И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
				ДанныеОтправки = Новый Структура("Тема, Заголовок", ТемаПисьма, ТекстПисьма);
				ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
				
				Попытка
					ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
				Исключение
					ТекстСообщения = "Не удалось отправить письмо ответственному " + Ответственный 
						+ " по Заявке на ПНР " + Ссылка + Символы.ПС + ОписаниеОшибки(); 
					ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	//-- #Б-Задача смарт: Фролов 26.03.2026
	
	//++ #Б-6888 смарт: Фролов 19.05.2026 //Оповещения инженеров о назначении на заявку ПНР
	ИнженерИзменился = Ложь;
	Если ДополнительныеСвойства.Свойство("смартИзменилсяИнженер") = Истина
		И ДополнительныеСвойства.смартИзменилсяИнженер = Истина Тогда
		
		МассивСообщений = Новый Массив;
		
		Если ЗначениеЗаполнено(НазначенныйНаЗапускИнженер) Тогда

			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаЗапускаС", 	НазначеннаяДатаЗапускаС);
			Параметры.Вставить("НазначеннаяДатаЗапускаПо", 	НазначеннаяДатаЗапускаПо);
			Параметры.Вставить("Пользователь", 		НазначенныйНаЗапускИнженер);
			Параметры.Вставить("ВидУведомления", 	"Назначение");
			Параметры.Вставить("Ссылка", 			Ссылка);

			Документы.смартЗаявкаНаПускоНаладку.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);	

		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("смартПредыдущийИнженер") = Истина
			И ЗначениеЗаполнено(ДополнительныеСвойства.смартПредыдущийИнженер) Тогда

			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаЗапускаС", 	НазначеннаяДатаЗапускаС);
			Параметры.Вставить("НазначеннаяДатаЗапускаПо", 	НазначеннаяДатаЗапускаПо);
			Параметры.Вставить("Пользователь", 		ДополнительныеСвойства.смартПредыдущийИнженер);
			Параметры.Вставить("ВидУведомления",	"Отмена");
			Параметры.Вставить("Ссылка", 			Ссылка);

			Документы.смартЗаявкаНаПускоНаладку.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);

		КонецЕсли;
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
		
		ИнженерИзменился = Истина;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("смартИзменилсяИнженер2") = Истина
		И ДополнительныеСвойства.смартИзменилсяИнженер2 = Истина Тогда
		
		МассивСообщений = Новый Массив;
		
		Если ЗначениеЗаполнено(НазначенныйНаЗапускИнженер2) Тогда

			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаЗапускаС", 	НазначеннаяДатаЗапускаС2);
			Параметры.Вставить("НазначеннаяДатаЗапускаПо", 	НазначеннаяДатаЗапускаПо2);
			Параметры.Вставить("Пользователь", 		НазначенныйНаЗапускИнженер2);
			Параметры.Вставить("ВидУведомления",	"Назначение");
			Параметры.Вставить("Ссылка", 			Ссылка);
			
			Документы.смартЗаявкаНаПускоНаладку.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);	

		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("смартПредыдущийИнженер2") = Истина
			И ЗначениеЗаполнено(ДополнительныеСвойства.смартПредыдущийИнженер2) Тогда
			

			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаЗапускаС", 	НазначеннаяДатаЗапускаС2);
			Параметры.Вставить("НазначеннаяДатаЗапускаПо", 	НазначеннаяДатаЗапускаПо2);
			Параметры.Вставить("Пользователь", 		ДополнительныеСвойства.смартПредыдущийИнженер2);
			Параметры.Вставить("ВидУведомления",	"Отмена");
			Параметры.Вставить("Ссылка", 			Ссылка);
			
			Документы.смартЗаявкаНаПускоНаладку.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);

		КонецЕсли;
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
		
		ИнженерИзменился = Истина;
		
	КонецЕсли;
	//-- #Б-6888 смарт: Фролов 19.05.2026
	
КонецПроцедуры //-- #Б-3550 смарт: Фролов 16.06.2025

//++ #Б-3180 смарт: Лопато 18.07.2025 //Лицензии IECHO. Отражение в учетной программе. 
Процедура АктивироватьЛицензииПО(Ссылка, ТаблицаОборудование);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СегментIECHOСЛицензиейПНР = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "IECHOСЛицензиейПНР"); 

	Если НЕ ЗначениеЗаполнено(СегментIECHOСЛицензиейПНР) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	ТаблицаОборудование.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.смартЗаявкаНаПускоНаладку"));
	ТаблицаОборудование.ЗаполнитьЗначения(Ссылка, "Заявка");
	
	Запрос.УстановитьПараметр("ТаблицаЗаявка", ТаблицаОборудование);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗаявка.Заявка КАК Заявка,
	|	ТаблицаЗаявка.Оборудование КАК Номенклатура,
	|	ТаблицаЗаявка.Серия КАК Серия,
	|	ТаблицаЗаявка.ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР
	|ПОМЕСТИТЬ ВТ_ТаблицаЗаявкаВрем
	|ИЗ
	|	&ТаблицаЗаявка КАК ТаблицаЗаявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявка КАК Заявка,
	|	Номенклатура КАК Номенклатура,
	|	Серия КАК Серия,
	|	СпрСерииНоменклатуры.Номер КАК СерияНомер,
	|	ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР
	|ПОМЕСТИТЬ ВТ_ТаблицаЗаявка
	|ИЗ
	|	ВТ_ТаблицаЗаявкаВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТ_ТаблицаЗаявкаВрем.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СпрСерииНоменклатуры
	|		ПО ВТ_ТаблицаЗаявкаВрем.Серия = СпрСерииНоменклатуры.Ссылка
	|ГДЕ
	|	Заявка <> ЗНАЧЕНИЕ(Документ.смартЗаявкаНаПускоНаладку.ПустаяСсылка)
	|	И Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И ДатаПодписанияАктаНаПНР <> ДАТАВРЕМЯ(1, 1, 1)
	|	И СпрНоменклатура.ВидНоменклатуры.ИспользоватьСерии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявка КАК Заявка,
	|	Номенклатура КАК Номенклатура,
	|	Серия КАК Серия,
	|	ТипЛицензии КАК ТипЛицензии,
	|	Период КАК Период,
	|	ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ТаблицаЛицензииПО
	|ИЗ
	|	РегистрСведений.смартЛицензииПО.СрезПоследних(
	|			,
	|			(Заявка, Номенклатура, Серия) В
	|				(ВЫБРАТЬ
	|					ВТ_ТаблицаЗаявка.Заявка,
	|					ВТ_ТаблицаЗаявка.Номенклатура,
	|					ВТ_ТаблицаЗаявка.Серия
	|				ИЗ
	|					ВТ_ТаблицаЗаявка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаЗаявка.Заявка КАК Заявка,
	|	ВТ_ТаблицаЗаявка.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаЗаявка.Серия КАК Серия,
	|	ВТ_ТаблицаЗаявка.СерияНомер КАК СерияНомер,
	|	ВТ_ТаблицаЗаявка.ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР,
	|	ВТ_ТаблицаЛицензииПО.Период КАК Период
	|ИЗ
	|	ВТ_ТаблицаЗаявка КАК ВТ_ТаблицаЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЛицензииПО КАК ВТ_ТаблицаЛицензииПО
	|		ПО (ВТ_ТаблицаЗаявка.Заявка = ВТ_ТаблицаЛицензииПО.Заявка)
	|			И (ВТ_ТаблицаЗаявка.Номенклатура = ВТ_ТаблицаЛицензииПО.Номенклатура)
	|			И (ВТ_ТаблицаЗаявка.Серия = ВТ_ТаблицаЛицензииПО.Серия)
	|ГДЕ
	|	ВТ_ТаблицаЛицензииПО.Период ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
				
		ТЗНоменклатураСегментаIECHOСЛицензиейПНР = СегментыСервер.СписокЭлементовСКД(СегментIECHOСЛицензиейПНР);
		МасОборудованиеIECHOСЛицензиейПНР = ТЗНоменклатураСегментаIECHOСЛицензиейПНР.ВыгрузитьКолонку("ЭлементСписка");

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			Если МасОборудованиеIECHOСЛицензиейПНР.Найти(Выборка.Номенклатура) <> Неопределено Тогда
				
				//Создаем запись лицензии
				МенеджерЗаписиЛицензии = РегистрыСведений.смартЛицензииПО.СоздатьМенеджерЗаписи();
					
				МенеджерЗаписиЛицензии.Заявка 		 = Выборка.Заявка;
				МенеджерЗаписиЛицензии.Номенклатура  = Выборка.Номенклатура;
				МенеджерЗаписиЛицензии.Серия 		 = Выборка.Серия;
				МенеджерЗаписиЛицензии.СерийныйНомер = Выборка.СерияНомер;
				МенеджерЗаписиЛицензии.Период 		 = Выборка.ДатаПодписанияАктаНаПНР;
				МенеджерЗаписиЛицензии.ДатаОкончания = МенеджерЗаписиЛицензии.Период + 30 * 24 * 60 * 60;
				МенеджерЗаписиЛицензии.ТипЛицензии   = Перечисления.смартТипыЛицензии.Временная;

				МенеджерЗаписиЛицензии.Записать();
				
			КонецЕсли;	
				
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-3180 смарт: Лопато 18.07.2025

#КонецЕсли