///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// +CRM
	Если ТипЗнч(ПараметрКоманды) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.CRM_ЗадачиПоБизнесПроцессу",
		Новый Структура("ЗначениеОтбора", ПараметрКоманды),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Источник.КлючУникальности,
		ПараметрыВыполненияКоманды.Окно);
		Возврат;
	КонецЕсли;
	// -CRM

	ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.ЗадачиПоБизнесПроцессу",
		Новый Структура("ЗначениеОтбора", ПараметрКоманды),
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Источник.КлючУникальности,
			ПараметрыВыполненияКоманды.Окно);	
КонецПроцедуры

#КонецОбласти