
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
//++ #Б-4568 смарт: Фролов 06.10.2025 //Доработки обработки Финансовые потоки.
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда

		Если Параметры.Свойство("КодВалюты") Тогда
			Объект.Код = Параметры.КодВалюты;
		КонецЕсли;

		Если Параметры.Свойство("НаименованиеКраткое") Тогда
			Объект.Наименование = Параметры.НаименованиеКраткое;
		КонецЕсли;

		Если Параметры.Свойство("НаименованиеПолное") Тогда
			Объект.НаименованиеПолное = Параметры.НаименованиеПолное;
		КонецЕсли;

		Если Параметры.Свойство("Загружается") И Параметры.Загружается Тогда
			Объект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета;
		Иначе 
			Объект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
		КонецЕсли;

		Если Параметры.Свойство("ПараметрыПрописи") Тогда
			Объект.ПараметрыПрописи = Параметры.ПараметрыПрописи;
		КонецЕсли;

	КонецЕсли;

	ОбработкаЗагрузкаКурсовВалют = Метаданные.Обработки.Найти("ЗагрузкаКурсовВалют");
	Если ОбработкаЗагрузкаКурсовВалют <> Неопределено Тогда
		ЕстьФормаПараметрыПрописиВалюты = ОбработкаЗагрузкаКурсовВалют.Формы.Найти("ПараметрыПрописиВалюты") <> Неопределено;
	КонецЕсли;

	Элементы.КурсВалютыЗагружаетсяИзИнтернета.Видимость = ОбработкаЗагрузкаКурсовВалют <> Неопределено;
	УстановитьДоступностьЭлементов(ЭтотОбъект);

	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ФормулаРасчетаКурса.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Элементы.ОсновнаяВалюта.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ГруппаШапка.ВыравниваниеЭлементовИЗаголовков =
		ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево;
	КонецЕсли;

	//++ НЕ ГОСИС
	ИспользоватьНесколькоВалют = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют");
	Если НЕ ИспользоватьНесколькоВалют Тогда
		Элементы.ГруппаСпособУстановкиКурса.Видимость = Ложь;
	КонецЕсли;
	//-- НЕ ГОСИС 
	
	#Вставка
	//++ #Б-4568 смарт: Фролов 06.10.2025 //Доработки обработки Финансовые потоки.
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЦветФона", Новый ОписаниеТипов("Цвет")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("смартЦветТекста", Новый ОписаниеТипов("Цвет")));
	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов); 
	
	НовыйЭлемент = Элементы.Добавить("смартСимволВалюты", Тип("ПолеФормы"), Элементы.ГруппаШапка); 	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСимволВалюты";
	НовыйЭлемент.Заголовок = "Символ валюты";
	
	НовыйЭлемент = Элементы.Добавить("смартЦветФона", Тип("ПолеФормы"), Элементы.ГруппаШапка); 	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "смартЦветФона";
	НовыйЭлемент.Заголовок = "Цвет фона";
	
	НовыйЭлемент = Элементы.Добавить("смартЦветТекста", Тип("ПолеФормы"), Элементы.ГруппаШапка); 	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "смартЦветТекста";
	НовыйЭлемент.Заголовок = "Цвет текста";
	
	ЭтаФорма.УстановитьДействие("ПередЗаписьюНаСервере", "смартПередЗаписьюНаСервере");
	
	ЭтаФорма.смартЦветФона = Объект.Ссылка.смартЦветФона.Получить();
	ЭтаФорма.смартЦветТекста = Объект.Ссылка.смартЦветТекста.Получить();
	//-- #Б-Задача смарт: Фролов 06.10.2025
	#КонецВставки

КонецПроцедуры //-- #Б-4568 смарт: Фролов 06.10.2025

#КонецОбласти

#Область ДоработкиСмарт 

&НаСервере
//++ #Б-4568 смарт: Фролов 06.10.2025 //Доработки обработки Финансовые потоки.
Процедура смартПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.смартЦветФона = Новый ХранилищеЗначения(ЭтаФорма.смартЦветФона);
	ТекущийОбъект.смартЦветТекста = Новый ХранилищеЗначения(ЭтаФорма.смартЦветТекста);
	
КонецПроцедуры //-- #Б-4568 смарт: Фролов 06.10.2025

#КонецОбласти