
//++ #1193 смарт: Фролов 23.11.2022 //Исправить ошибки в журнале регистрации  
//++ смарт:rnp 494 28.04.2021 
//&НаКлиенте
//Процедура ВыгрузитьВJSON(Команда)
//	
//	АдресСтрокой = ПолучитьАдресаПолучателей();
//	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект, );
//	ТекстВопроса = "Файлы сформируются и отправятся на адрес " + АдресСтрокой + ". Продолжить?";
//	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК);
//		
//КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьВJSON(Команда)
	ВыгрузитьВJSONСервер();		
КонецПроцедуры
//-- #1193 смарт: Фролов 23.11.2022

//++ #1193 смарт: Фролов 23.11.2022 //Исправить ошибки в журнале регистрации
//++ смарт:rnp 494 28.04.2021
//&НаСервереБезКонтекста
//Функция ПолучитьАдресаПолучателей()
//	
//	АдресаДляОтправкиСтрокой = "";
//	СсылкаПредопределнноеЗначение = Справочники.смартПредопределенныеЗначения.АдресДляОтправкиВыгрузкиОборудования;	
//	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаПредопределнноеЗначение, АдресаДляОтправкиСтрокой, Ложь);

//	Возврат АдресаДляОтправкиСтрокой;
//	
//КонецФункции 

////++ смарт:rnp 494 28.04.2021
//&НаКлиенте
//Процедура ВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
//	
//	Если Ответ = КодВозвратаДиалога.ОК Тогда	
//		
//		ВыгрузитьВJSONСервер();
//	
//	КонецЕсли;
//	
//КонецПроцедуры
//-- #Задача смарт: Фролов 23.11.2022

//++ смарт:rnp 494 28.04.2021
&НаСервере
Процедура ВыгрузитьВJSONСервер()
	
	ОтправлятьФайлыНаЭлПочту = Истина;
	Успех = смартОбщегоНазначения.ВыгрузитьсмартКонфигурацииЧернилJSON(ОтправлятьФайлыНаЭлПочту);
	Если Успех Тогда
		ОбщегоНазначения.СообщитьПользователю("Конфигурации чернил успешно выгружены");
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ смарт: Белоусова 647  28.09.20021 
	
		элементы.ФормаВыгрузитьВJSON.Доступность = истина;
	
	//-- смарт: Белоусова 647  28.09.20021 

КонецПроцедуры

