
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапчастиПоДокументу.Параметры.УстановитьЗначениеПараметра("Ссылка", Документы.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка());
	
	// 28.06.2020
	ЗапчастиПоЗаявкам.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	ДобавитьЭлементыПрограммно();
	
	// 16.07.2020
	ТекущаяДатаПлюс5Дней = НачалоДня(ТекущаяДата()) + 5 * 86400;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++rnp 702 17.11.2021
	СписокПользователейСДоступом = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ПользователиСДоступомКНецелевомуИспользованиюГарантийнойЗапчасти");
	Если СписокПользователейСДоступом.Найти(Пользователи.ТекущийПользователь()) = Неопределено И Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ЗапчастиПоДокументуВзятьЗапчастьСPRE.Видимость = Ложь;
		Элементы.ЗапчастиПоДокументуВернутьЗапчастьНаPRE.Видимость  = Ложь;
	КонецЕсли;  
	
	//++ #Б-1176 смарт: Мосолов 25.10.2024 //Заявки на гарантийный ремонт. Запчасти. Отчет по возвратам 
	НастроитьКоманднуюПанельФормы();
	//-- #Б-1176 смарт: Мосолов 25.10.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументсмартЗаявкаНаГарантийныйРемонт", 
																		 "Документ.смартЗаявкаНаГарантийныйРемонт КАК ДокументсмартЗаявкаНаГарантийныйРемонт", 
																		 "ДокументсмартЗаявкаНаГарантийныйРемонт.ГотоваКЗакрытию КАК КЗакрытию",
																		 , "Клиент",, "Клиент");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ смарт:Подкин #959 12.04.2022 17:07:00
	НоваяКоманда = Команды.Добавить("КомандаОткрытьДвиженияЛОА");
	НоваяКоманда.Действие = "ДвиженияЛОА";//Имя процедуры
	НоваяКоманда.Заголовок = "Движение детали ЛОА";
	НоваяКоманда.Картинка=БиблиотекаКартинок.Отчет;
	
	НовыйЭлемент = Элементы.Добавить("ЭлементОткрытьДвиженияЛОА",
	Тип("КнопкаФормы"),
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаКонтроль);
	НовыйЭлемент.ИмяКоманды = "КомандаОткрытьДвиженияЛОА"; 
	
КонецПроцедуры  

//++ #Б-1176 смарт: Мосолов 25.10.2024 //Заявки на гарантийный ремонт. Запчасти. Отчет по возвратам 
&НаСервере
Процедура НастроитьКоманднуюПанельФормы() 
	
	Для Каждого Элемент Из Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы Цикл
		
		Если НЕ (Элемент.Имя = "ФормаИзменитьФорму"
			Или Элемент.Имя = "ФормаГруппаКонтроль"
			Или Элемент.Имя = "ПодменюОтчеты") Тогда
			
			Элемент.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //-- #Б-1176 смарт: Мосолов 25.10.2024

// 28.06.2020
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьКолонок(Неопределено);
	
	// ++ 05.11.2020
	СброситьПользовательскиеНастройки();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Ссылка") Тогда
		СсылкаДокумент = ?(ЗначениеЗаполнено(ТекущиеДанные.Ссылка), ТекущиеДанные.Ссылка, ПредопределенноеЗначение("Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка"));
	Иначе
		СсылкаДокумент = ПредопределенноеЗначение("Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка");
	КонецЕсли;
	
	ЗапчастиПоДокументу.Параметры.УстановитьЗначениеПараметра("Ссылка", СсылкаДокумент);	
	Элементы.ЗапчастиПоДокументу.Обновить();

	// ++ 28.10.2020
	НастроитьВидимостьДоступностьЭлементовПоДаннымСтроки(ТекущиеДанные);
	
КонецПроцедуры

// ++ 28.10.2020
&НаКлиенте
Процедура НастроитьВидимостьДоступностьЭлементовПоДаннымСтроки(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.СписокЗакрытьЗаявки.Доступность = ТекущиеДанные.КЗакрытию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиПоДокументуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗапчастиПоДокументуНомерОтправления" Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДатаЗаявки = ПолучитьДатуЗаявки(ТекущиеДанные.Ссылка);
		
		ТекущиеДанныеЗапчасти = Элементы.ЗапчастиПоДокументу.ТекущиеДанные;
		Если ТекущиеДанныеЗапчасти = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НомерОтправления = ТекущиеДанныеЗапчасти.НомерОтправления;
		// 28.06.2020 - Каталог открывается и без заполненного номера отправления
		//Если НЕ ЗначениеЗаполнено(НомерОтправления) Тогда
		//	Возврат;
		//КонецЕсли;
		//
		
		Если ЗначениеЗаполнено(ТекущиеДанныеЗапчасти.КаталогФайлов) Тогда
			КаталогПоНомеру = ТекущиеДанныеЗапчасти.КаталогФайлов;
		Иначе
			// 28.06.2020
			Если ЗначениеЗаполнено(НомерОтправления) Тогда
			//
				КаталогПоНомеру = смартОбщегоНазначения.СформироватьПутьККаталогуГарантийныхЗапчастей(НомерОтправления, ДатаЗаявки);
			КонецЕсли;	
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(КаталогПоНомеру) Тогда
			Возврат;
		КонецЕсли;
		
		ФайлКлиента = Новый Файл(КаталогПоНомеру);
		Если ФайлКлиента.Существует() Тогда
			СтандартнаяОбработка = Ложь;
			ЗапуститьПриложение(КаталогПоНомеру);
		Иначе
			// 28.06.2020
			//ТекстСообщения = "Создайте каталог " + КаталогПоНомеру + " и разместите в нем необходимые файлы. После этого файлы будут доступны на просмотр";
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	//++ #Б-2204 смарт: Лопато 10.02.2025 //Документ Заявка на гарантийный ремонт (смарт). Доработка.  
	ИначеЕсли Поле.Имя = "ЗапчастиПоДокументуНоменклатура" Тогда

		ТекущиеДанные = Элементы.ЗапчастиПоДокументу.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ПроверитьДоступностьРолейНаСервере("смартСпециалистПоПретензиям") Тогда
			
			ОткрытьЗначение(ТекущиеДанные.Номенклатура);
			
		КонецЕсли;
	//-- #Б-2204 смарт: Лопато 10.02.2025
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуЗаявки(СсылкаДокумент)
	Возврат СсылкаДокумент.Дата;
КонецФункции


&НаКлиенте
Процедура ЗабратьНаСкладе(Команда)
	
	ТабличныйДокумент = СформироватьТабличныйДокументЗабратьНаСкладе();
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗабратьНаСкладе");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 1;
    КоллекцияПечатныхФорм[0].СинонимМакета = "Забрать на складе";  
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	
КонецПроцедуры

Функция СформироватьТабличныйДокументЗабратьНаСкладе() 
	
	Макет = Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьМакет("ЗабратьНаСкладе");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаГарантийныйРемонт.Номер КАК НомерЗаявки,
	|	НоменклатураСпр.Артикул КАК Артикул,
	|	НоменклатураСпр.Наименование КАК НаименованиеДетали,
	|	СУММА(смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество) КАК Количество
	|ИЗ
	|	Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура = НоменклатураСпр.Ссылка
	|ГДЕ
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Статус = &ОжидаетсяОтправка
	|	И смартЗаявкаНаГарантийныйРемонт.КОтправке
	|
	|СГРУППИРОВАТЬ ПО
	|	смартЗаявкаНаГарантийныйРемонт.Номер,
	|	НоменклатураСпр.Наименование,
	|	НоменклатураСпр.Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаявки,
	|	Артикул";
	
	Запрос.УстановитьПараметр("ОжидаетсяОтправка", Перечисления.смартСтатусыПоГарантии.ОжидаетсяОтправка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерПП = 1;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.НомерПП = НомерПП;
		ТабДок.Вывести(ОбластьСтрока);
		
		НомерПП = НомерПП + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

// ++ 28.10.2020
&НаКлиенте
Процедура ЗакрытьЗаявки(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	МассивДокументовКЗакрытию = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекДок = Неопределено;
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт") Тогда
			ТекДок = ВыделеннаяСтрока;
		ИначеЕсли ТипЗнч(ВыделеннаяСтрока) = Тип("Число") Тогда
			ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
			ТекДок = ТекущиеДанные.Ссылка;
		Иначе
			ТекДок = ВыделеннаяСтрока.Ссылка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДок) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДокументовКЗакрытию.Добавить(ТекДок);
	КонецЦикла;
	
	ЗакрытьЗаявкиНаСервере(МассивДокументовКЗакрытию);
	
	// 05.11.2020
	Элементы.Список.Обновить();
	Элементы.ЗапчастиПоЗаявкам.Обновить();
	Элементы.ЗапчастиПоДокументу.Обновить();
	
КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура ЗапчастиПоЗаявкамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// ++ 17.07.2020
	//ПоказатьЗначение(,ВыбраннаяСтрока.Ссылка);
	Если Поле.Имя = "ЗапчастиПоЗаявкамПримечание" Тогда
		
		ТекущиеДанные = Элементы.ЗапчастиПоЗаявкам.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено 
			// ++ 05.11.2020
			И ТекущиеДанные.Свойство("ГруппировкаСтроки") = Ложь
			//--
			Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(, ТекущиеДанные.Примечание);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ЗапчастиПоЗаявкамДатаОтправления" 
		ИЛИ Поле.Имя = "ЗапчастиПоЗаявкамКаталогФайлов" Тогда
		
		ТекущиеДанные = Элементы.ЗапчастиПоЗаявкам.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено
			// ++ 05.11.2020
			И ТекущиеДанные.Свойство("ГруппировкаСтроки") = Ложь
			//--
			И ((Поле.Имя = "ЗапчастиПоЗаявкамДатаОтправления" И ЗначениеЗаполнено(ТекущиеДанные.ДатаОтправления))
					ИЛИ Поле.Имя <> "ЗапчастиПоЗаявкамДатаОтправления") 
			И ЗначениеЗаполнено(ТекущиеДанные.КаталогФайлов) Тогда
			
			КаталогПоНомеру = ТекущиеДанные.КаталогФайлов;
			ФайлКлиента = Новый Файл(КаталогПоНомеру);
			Если ФайлКлиента.Существует() Тогда	
				СтандартнаяОбработка = Ложь;
				ЗапуститьПриложение(КаталогПоНомеру);
			КонецЕсли;
				
		КонецЕсли;
				
	Иначе
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ВыбраннаяСтрока.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура КОбработке1ПриИзменении(Элемент)	
	
	Значение = КОбработке;
	//УстановитьОтборЗапчастиПоЗаявкам(Значение, "КОбработке", "К обработке");
	УстановитьОтборСписок(Значение, "КОбработке", "К обработке", "ЗапчастиПоЗаявкам");
	
КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура КОтправке1ПриИзменении(Элемент)
	
	Значение = КОтправке;
	
	//УстановитьОтборЗапчастиПоЗаявкам(Значение, "КОтправке", "К отправке");
	УстановитьОтборСписок(Значение, "КОтправке", "К отправке", "ЗапчастиПоЗаявкам");

КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура ОтменаОтправки1ПриИзменении(Элемент)
	
	Значение = ОтменаОтправки;
	//УстановитьОтборЗапчастиПоЗаявкам(Значение, "ОтменаОтправки", "Отмена отправки");
	УстановитьОтборСписок(Значение, "ОтменаОтправки", "Отмена отправки", "ЗапчастиПоЗаявкам");

КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура ПолученаНоНеОтправленаПриИзменении(Элемент)
	
	Значение = ПолученаНоНеОтправлена;
	Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "Получена, но не отправлена" Тогда // Группа И
			ЭлементОтбора.Использование = Значение;			
			Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
					И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
					ПользовательскаяНастройка.Использование = Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			Элементы.ЗапчастиПоЗаявкам.Обновить();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура ОтправленаНоНеПолученаПриИзменении(Элемент)
	
	//++ смарт:ММ 702 14.11.2021 
	//Значение = ОтправленаНоНеПолучена;
	//Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если ЭлементОтбора.Представление = "Отправлена, но не получена" Тогда // Группа И
	//		ЭлементОтбора.Использование = Значение;
	//		Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//			Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
	//				И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
	//				ПользовательскаяНастройка.Использование = Значение;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;	
	//		Элементы.ЗапчастиПоЗаявкам.Обновить();
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//-- смарт:ММ 14.11.2021
		
	// ++ смарт: Белоусова 645 22.09.2021
	если ОтправленаНоНеПолучена и  НеОтправленаНеПолучена тогда
		//++ смарт:ММ 702 14.11.2021 	
		//	Значение = Ложь;
		//Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		//	Если ЭлементОтбора.Представление = "Отправлена, но не получена" Тогда // Группа И
		//		ЭлементОтбора.Использование = Значение;
		//		Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//			Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
		//				И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
		//				ПользовательскаяНастройка.Использование = Значение;
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;	
		//		Элементы.ЗапчастиПоЗаявкам.Обновить();
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;
		УстановитьОтборНеПолучена(Истина);
	Иначе
		УстановитьОтборНеПолучена(Ложь);
		УстановитьОтборОтправленаНоНеПолучена(ОтправленаНоНеПолучена);
		УстановитьОтборНеОтправленаИНеПолучена(НеОтправленаНеПолучена);
	//-- смарт:ММ 14.11.2021
	
	КонецЕсли;
	// -- смарт: Белоусова 645 22.09.2021

КонецПроцедуры

//++ смарт:ММ 702 14.11.2021 
&НаКлиенте
Процедура УстановитьОтборОтправленаНоНеПолучена(Значение)
	
	Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "Отправлена, но не получена" Тогда // Группа И
			ЭлементОтбора.Использование = Значение;
			Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
					И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
					ПользовательскаяНастройка.Использование = Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			Элементы.ЗапчастиПоЗаявкам.Обновить();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаКлиенте
Процедура УстановитьОтборНеОтправленаИНеПолучена(Значение)
	
	Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "Не отправлена и не получена" Тогда // Группа И
			ЭлементОтбора.Использование = Значение;
			Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
					И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
					ПользовательскаяНастройка.Использование = Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			Элементы.ЗапчастиПоЗаявкам.Обновить();
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021
&НаКлиенте
Процедура УстановитьОтборНеПолучена(Значение)
	
	// Отключить 2 отбора, вместо них один
	ЗначениеЛожь = Ложь;
	
	Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Значение Тогда
			
			Если ЭлементОтбора.Представление = "Отправлена, но не получена" Тогда // Группа И
				ЭлементОтбора.Использование = ЗначениеЛожь;
				Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
						И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
						ПользовательскаяНастройка.Использование = ЗначениеЛожь;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			
			Если ЭлементОтбора.Представление = "Не отправлена и не получена" Тогда // Группа И
				ЭлементОтбора.Использование = ЗначениеЛожь;
				Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
						И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
						ПользовательскаяНастройка.Использование = ЗначениеЛожь;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
		
		Если ЭлементОтбора.Представление = "Не получена" Тогда // Группа И
			ЭлементОтбора.Использование = Значение;
			Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
					И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
					ПользовательскаяНастройка.Использование = Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ЗапчастиПоЗаявкам.Обновить();

КонецПроцедуры //-- смарт:ММ 14.11.2021

// ++ 28.10.2020
&НаКлиенте
Процедура НеОтправленаНеПолученаПриИзменении(Элемент)
	// ++ смарт: Белоусова 645 22.09.2021

	если ОтправленаНоНеПолучена и  НеОтправленаНеПолучена тогда
		//++ смарт:ММ 702 14.11.2021 
		//Значение = Ложь;
		//	Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		//		Если ЭлементОтбора.Представление = "Отправлена, но не получена" Тогда // Группа И
		//			ЭлементОтбора.Использование = Значение;
		//			Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//				Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
		//					И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
		//					ПользовательскаяНастройка.Использование = Значение;
		//					Прервать;
		//				КонецЕсли;
		//			КонецЦикла;	
		//			Элементы.ЗапчастиПоЗаявкам.Обновить();
		//			Прервать;
		//		КонецЕсли;
		//	КонецЦикла;
		УстановитьОтборНеПолучена(Истина);
	Иначе
		УстановитьОтборНеПолучена(Ложь);
		УстановитьОтборОтправленаНоНеПолучена(ОтправленаНоНеПолучена);
		УстановитьОтборНеОтправленаИНеПолучена(НеОтправленаНеПолучена);
		//-- смарт:ММ 14.11.2021
	//КонецЕсли;

	
	//++ смарт:ММ 702 14.11.2021 
	//если ОтправленаНоНеПолучена и  не НеОтправленаНеПолучена тогда
	//		Значение = истина;
	//		Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//			Если ЭлементОтбора.Представление = "Отправлена, но не получена" Тогда // Группа И
	//				ЭлементОтбора.Использование = Значение;
	//				Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//					Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
	//						И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
	//						ПользовательскаяНастройка.Использование = Значение;
	//						Прервать;
	//					КонецЕсли;
	//				КонецЦикла;	
	//				Элементы.ЗапчастиПоЗаявкам.Обновить();
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//КонецЕсли;
	//-- смарт:ММ 14.11.2021
	// -- смарт: Белоусова 645 22.09.2021

		//Значение = НеОтправленаНеПолучена;
		//Для Каждого ЭлементОтбора Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		//	Если ЭлементОтбора.Представление = "Не отправлена и не получена" Тогда // Группа И
		//		ЭлементОтбора.Использование = Значение;
		//		Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//			Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки 
		//				И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
		//				ПользовательскаяНастройка.Использование = Значение;
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;	
		//		Элементы.ЗапчастиПоЗаявкам.Обновить();
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;
	//++ смарт:ММ 702 14.11.2021 
	КонецЕсли;
	//-- смарт:ММ 14.11.2021
КонецПроцедуры

// ++ 27.08.2020
&НаКлиенте
Процедура НомерОтправленияОтборПриИзменении(Элемент)
	
	ИмяПоля = "НомерОтправления";
	Значение = НомерОтправленияОтбор;
	Использование = ?(ЗначениеЗаполнено(Значение), Истина, Ложь);
	
	ОбновитьОтборЭлемент(ИмяПоля, Значение, Использование);

КонецПроцедуры

// ++ 27.08.2020
&НаКлиенте
Процедура ДатаОтправленияОтборПриИзменении(Элемент)
	
	ИмяПоля = "ДатаОтправления";
	Значение = ДатаОтправленияОтбор;
	Использование = ?(ЗначениеЗаполнено(Значение), Истина, Ложь);
	
	ОбновитьОтборЭлемент(ИмяПоля, Значение, Использование);
	
КонецПроцедуры

// ++ 27.08.2020
&НаКлиенте
Процедура НоменклатураОтборПриИзменении(Элемент)
	
	ИмяПоля = "Номенклатура";
	Значение = НоменклатураОтбор;
	Использование = ?(ЗначениеЗаполнено(Значение), Истина, Ложь);
	
	ОбновитьОтборЭлемент(ИмяПоля, Значение, Использование);
	
КонецПроцедуры

// ++ 27.08.2020
Процедура ОбновитьОтборЭлемент(ИмяПоля, Значение, Использование)
	
	Для Каждого ЭлементДетальный Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементДетальный) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
			
			Если ЭлементДетальный.ЛевоеЗначение = ПолеКомпоновки Тогда
				ЭлементДетальный.ПравоеЗначение = Значение;
				ЭлементДетальный.Использование = Использование;
				
				Для Каждого ПользовательскаяНастройка Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементДетальный.ИдентификаторПользовательскойНастройки 
						И ЗначениеЗаполнено(ЭлементДетальный.ИдентификаторПользовательскойНастройки) Тогда
						
						ПользовательскаяНастройка.Использование = Использование; 
						ПользовательскаяНастройка.ПравоеЗначение = ЭлементДетальный.ПравоеЗначение;
						Прервать;
						
					КонецЕсли;
				КонецЦикла;	
				
				Элементы.ЗапчастиПоЗаявкам.Обновить();
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// ++ 28.06.2020
&НаСервере
Процедура ДобавитьЭлементыПрограммно()
	
	Для Каждого Колонка Из Элементы.ЗапчастиПоЗаявкам.ПодчиненныеЭлементы Цикл	
		
		ИмяКолонки = Колонка.Имя;
		ДобавляемыеРеквизиты	= Новый Массив;
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Булево"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		Если Колонка.Видимость Тогда
			ЭтаФорма[ИмяКолонки] = Истина;
		КонецЕсли;
		
		ИмяЭлемента = ИмяКолонки + "Элемент";
		
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаВыбранныеКолонки);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = ИмяКолонки;
		НовыйЭлемент.Заголовок = СтрЗаменить(ИмяКолонки, "ЗапчастиПоЗаявкам", "");
		
		Если ЗначениеЗаполнено(Колонка.Заголовок) Тогда
			НовыйЭлемент.Заголовок = Колонка.Заголовок;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура УстановитьВидимостьКолонок(Команда)
	
	Для Каждого Колонка Из Элементы.ЗапчастиПоЗаявкам.ПодчиненныеЭлементы Цикл
		ИмяКолонки = Колонка.Имя;
		Колонка.Видимость = ЭтаФорма[ИмяКолонки];		
	КонецЦикла;
	
КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	
	Для Каждого Колонка Из Элементы.ЗапчастиПоЗаявкам.ПодчиненныеЭлементы Цикл
		ИмяКолонки = Колонка.Имя;
		ЭтаФорма[ИмяКолонки] = Истина;		
	КонецЦикла;

КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	Для Каждого Колонка Из Элементы.ЗапчастиПоЗаявкам.ПодчиненныеЭлементы Цикл
		ИмяКолонки = Колонка.Имя;
		ЭтаФорма[ИмяКолонки] = Ложь;		
	КонецЦикла;

КонецПроцедуры

// ++ 28.06.2020
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "смартИзменениеЗаявкиНаГарантийныйРемонт" Тогда
		Элементы.ЗапчастиПоЗаявкам.Обновить();
		// 05.11.2020
		Элементы.Список.Обновить();
		Элементы.ЗапчастиПоДокументу.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// ++ 01.07.2020
&НаКлиенте
Процедура КОбработкеОсновнаяПриИзменении(Элемент)
	
	Значение = КОбработкеОсновная;
	УстановитьОтборСписок(Значение, "КОбработке", "К обработке", "Список");
	
	СписокПриАктивизацииСтроки(Неопределено);
		
КонецПроцедуры

// ++ 28.10.2020
&НаКлиенте
Процедура КЗакрытиюОсновнаяПриИзменении(Элемент)
	
	Значение = КЗакрытиюОсновная;
	
	УстановитьОтборСписок(Значение, "КЗакрытию", "К закрытию", "Список");
	
	СписокПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

// ++ 01.07.2020
&НаКлиенте
Процедура КОтправкеОсновнаяПриИзменении(Элемент)
	
	Значение = КОтправкеОсновная;
	УстановитьОтборСписок(Значение, "КОтправке", "К отправке", "Список");
	
	СписокПриАктивизацииСтроки(Неопределено);

КонецПроцедуры

// ++ 01.07.2020
&НаКлиенте
Процедура ОтменаОтправкиОсновнаяПриИзменении(Элемент)
	
	Значение = ОтменаОтправкиОсновная;
	УстановитьОтборСписок(Значение, "ОтменаОтправки", "Отмена отправки", "Список");
	
	СписокПриАктивизацииСтроки(Неопределено);

КонецПроцедуры

// ++ 01.07.2020
&НаКлиенте
Процедура УстановитьОтборСписок(Значение, ИмяПоля, Представление, ИмяТЧ)
	
	Если НЕ ЗначениеЗаполнено(ИмяПоля)
		ИЛИ НЕ ЗначениеЗаполнено(Представление)
		ИЛИ НЕ ЗначениеЗаполнено(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	//++ #1943 смарт: Шляпников 23.01.2025 / Доработка создания Заказа клиента из Спецификации.
	Если ИмяПоля = "КОбработке" ИЛИ ИмяПоля = "КОтправке" ИЛИ ИмяПоля = "КСписанию" Тогда
		ПредставлениеГруппы = "К обработке или к отправке или к списанию";
	КонецЕсли;
	//-- #1943 смарт: Шляпников 23.01.2025
	
	Для Каждого ЭлементДетальный Из ЭтотОбъект[ИмяТЧ].КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ЭлементДетальный.Представление = Представление Тогда 
			
			ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
			
			Если ЭлементДетальный.ЛевоеЗначение = ПолеКомпоновки Тогда
				
				ЭлементДетальный.Использование = Значение;
				
				Для Каждого ПользовательскаяНастройка Из ЭтотОбъект[ИмяТЧ].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
					Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементДетальный.ИдентификаторПользовательскойНастройки 
						И ЗначениеЗаполнено(ЭлементДетальный.ИдентификаторПользовательскойНастройки) Тогда
						ПользовательскаяНастройка.Использование = Значение;
						Прервать;
					КонецЕсли;
				КонецЦикла;					

				Элементы[ИмяТЧ].Обновить();
				Прервать;
			КонецЕсли; 
		// ++ 23.11.2020
		ИначеЕсли ЭлементДетальный.Представление = ПредставлениеГруппы Тогда
			
			//++ #1943 смарт: Шляпников 23.01.2025 / Доработка создания Заказа клиента из Спецификации.
			Если ИмяТЧ = "Список" Тогда
				ЭлементДетальный.Использование = КОбработкеОсновная ИЛИ КОтправкеОсновная ИЛИ КСписаниюОсновная;
			ИначеЕсли ИмяТЧ = "ЗапчастиПоЗаявкам" Тогда
				ЭлементДетальный.Использование = КОбработке ИЛИ КОтправке ИЛИ КСписанию;
			КонецЕсли;
			//-- #1943 смарт: Шляпников 23.01.2025
			
			Для Каждого ПользовательскаяНастройка Из ЭтотОбъект[ИмяТЧ].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементДетальный.ИдентификаторПользовательскойНастройки 
					И ЗначениеЗаполнено(ЭлементДетальный.ИдентификаторПользовательскойНастройки) Тогда
					ПользовательскаяНастройка.Использование = ЭлементДетальный.Использование;
					Прервать;
				КонецЕсли;
			КонецЦикла;
				
			Для Каждого ЭлементБолееДетальный ИЗ ЭлементДетальный.Элементы Цикл
				ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
				
				Если ЭлементБолееДетальный.ЛевоеЗначение = ПолеКомпоновки Тогда				   
					ЭлементБолееДетальный.Использование = Значение;  
					
					Для Каждого ПользовательскаяНастройка Из ЭтотОбъект[ИмяТЧ].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
						Если ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки = ЭлементБолееДетальный.ИдентификаторПользовательскойНастройки 
							И ЗначениеЗаполнено(ЭлементБолееДетальный.ИдентификаторПользовательскойНастройки) Тогда
							ПользовательскаяНастройка.Использование = Значение;
							Прервать;
						КонецЕсли;
					КонецЦикла;	
					
					Элементы[ИмяТЧ].Обновить();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		// --
		КонецЕсли;	
	КонецЦикла;
			
КонецПроцедуры

// ++ 17.07.2020
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Комментарий" Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(, ТекущиеДанные.Комментарий);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// ++ 19.07.2020
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// ++ 19.07.2020

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ++ 28.10.2020
&НаСервере
Процедура ЗакрытьЗаявкиНаСервере(МассивДокументовКЗакрытию)
	
	Если ТипЗнч(МассивДокументовКЗакрытию) <> Тип("Массив") 
		ИЛИ МассивДокументовКЗакрытию.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружено заявок к закрытию");
		Возврат;
	КонецЕсли;
	
	СтатусЗакрыта = Перечисления.СтатусыКассовойСмены.Закрыта;
	
	ЗакрытоДокументов = 0;
	
	Для Каждого Док Из МассивДокументовКЗакрытию Цикл
		
		Если Док.Статус = СтатусЗакрыта 
			ИЛИ НЕ Док.ГотоваКЗакрытию Тогда 
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = Док.ПолучитьОбъект();	
		ДокОбъект.Статус = СтатусЗакрыта;
		ДокОбъект.Записать();
		
		ЗакрытоДокументов = ЗакрытоДокументов + 1;
		
	КонецЦикла;
	
	Если ЗакрытоДокументов > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закрыто заявок: " + ЗакрытоДокументов);
	КонецЕсли;
	
КонецПроцедуры

// ++ 31.10.2020
&НаКлиенте
Процедура ОтчетКонтроль(Команда)
	
	ПредопределенныйЭлемент = ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения.ОтчетКонтрольИсполненияЗаявокНаГарантийныйРемонт");
	ОткрытьОтчет(ПредопределенныйЭлемент);
	     
КонецПроцедуры

// ++ 02.11.2020
&НаКлиенте
Процедура ОтчетКонтрольОстатков(Команда)
	
	ПредопределенныйЭлемент = ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения.ОтчетКонтрольОстатковПоСкладуЗапчастейПодЗаказ");
	ОткрытьОтчет(ПредопределенныйЭлемент);
	
КонецПроцедуры

// ++ 02.11.2020
&НаКлиенте
Процедура ОткрытьОтчет(ПредопределенныйЭлемент)
	
	СсылкаНаВнешнийОтчет = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ПредопределенныйЭлемент, Ложь);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден внешний отчет");
		Возврат;
	КонецЕсли;
	
	ИмяОбработкиСлужебное = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СсылкаНаВнешнийОтчет);
	Если ЗначениеЗаполнено(ИмяОбработкиСлужебное) Тогда
		ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);
		ОткрытьФорму("ВнешнийОтчет." + ИмяОбработкиСлужебное + ".Форма", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

// ++ 05.11.2020
&НаСервере
Процедура СброситьПользовательскиеНастройки()
	
	Для Каждого ЭлементПН Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементПН) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭлементПН.Использование = Ложь;
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого ЭлементПН Из ЗапчастиПоЗаявкам.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементПН) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭлементПН.Использование = Ложь;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

// ++ 17.05.2021
&НаКлиенте
Процедура КСписаниюПриИзменении(Элемент)
	
	Значение = КСписанию;
	УстановитьОтборСписок(Значение, "КСписанию", "К списанию", "ЗапчастиПоЗаявкам");

КонецПроцедуры

// ++ 17.05.2021
&НаКлиенте
Процедура КСписаниюОсновнаяПриИзменении(Элемент)
	
	Значение = КСписаниюОсновная;
	
	УстановитьОтборСписок(Значение, "КСписанию", "К списанию", "Список");
	
	СписокПриАктивизацииСтроки(Неопределено);

КонецПроцедуры

// ++ 17.05.2021
&НаКлиенте
Процедура СкопироватьWarrentyDenideВНовуюЗаявку(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	МассивДокументов = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекДок = Неопределено;
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт") Тогда
			ТекДок = ВыделеннаяСтрока;
		ИначеЕсли ТипЗнч(ВыделеннаяСтрока) = Тип("Число") Тогда
			ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
			ТекДок = ТекущиеДанные.Ссылка;
		Иначе
			ТекДок = ВыделеннаяСтрока.Ссылка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДок) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДокументов.Добавить(ТекДок);
	КонецЦикла;
	
	Форма = ПолучитьФорму("Документ.смартЗаявкаНаГарантийныйРемонт.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	СкопироватьWarrentyDenideВНовуюЗаявкуНаСервере(МассивДокументов, ДанныеФормы); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	
	
	Элементы.Список.Обновить();
	Элементы.ЗапчастиПоЗаявкам.Обновить();
	Элементы.ЗапчастиПоДокументу.Обновить();
	
	Форма.Открыть();
	
КонецПроцедуры

// ++ 17.05.2021
&НаСервере
Процедура СкопироватьWarrentyDenideВНовуюЗаявкуНаСервере(МассивДокументов, ДанныеФормы)

	// Подразумевается, что выделен будет один документ.
	// Если выделили несколько, то шапка берется из одного любого, а табличная часть заполняется данными из всех выделенных документов
	
	Если МассивДокументов.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбраны документы для копирования");
		Возврат;
	КонецЕсли;
	
	ДокументОснова = МассивДокументов[0];
	
	ДокОбъект = ДокументОснова.Скопировать();
	ДокОбъект.Дата = ТекущаяДата();
	WarrantyDenied = Перечисления.смартРешенияПоставщика.WarrantyDenied;
	
	// на вкладке инженера в правой части должны заполниться запчасти и количество, 
	// по которым в исходной заявке на вкладке специалиста решение поставщика = warrenty denide
	ИДСтроки = 0;
	
	Для Каждого Док Из МассивДокументов Цикл
		
		Для Каждого СтрокаСпециалист Из Док.ЗаполняетсяСпециалистомПоПретензиям Цикл
			
			Если СтрокаСпециалист.РешениеПоставщика <> WarrantyDenied Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаИнженер = ДокОбъект.ЗаполняетсяИнженером.Добавить();
			НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером = ИДСтроки;
			НоваяСтрокаИнженер.НоменклатураПринятаяОтКлиента = СтрокаСпециалист.Номенклатура;
			НоваяСтрокаИнженер.Количество = СтрокаСпециалист.Количество;
			
			ИДСтроки = ИДСтроки + 1;
			
		КонецЦикла;			
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДокОбъект, ДанныеФормы);
	
КонецПроцедуры

//++ смарт:ММ 702 13.11.2021 
&НаКлиенте
Процедура ВзятьЗапчастьСPRE(Команда)
	
	ЗапроситьСклад("склад-получатель");
		
КонецПроцедуры //-- смарт:ММ 13.11.2021

//++ смарт:ММ 702 13.11.2021 
&НаКлиенте
Процедура ВернутьЗапчастьНаPRE(Команда)
	
	ЗапроситьСклад("склад-отправитель");
	
КонецПроцедуры //-- смарт:ММ 13.11.2021

//++ смарт:ММ 702 13.11.2021 
&НаКлиенте
Процедура ЗапроситьСклад(ВидСклада)
	
	Перем ВводимоеЗначение;
	
	Тип = Тип("СправочникСсылка.Склады");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидСклада", ВидСклада);
	
	ОбратныйВызов = Новый ОписаниеОповещения("ПослеВыбораСкладаPRE", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводЗначения(ОбратныйВызов, ВводимоеЗначение, "Выберите " + ВидСклада, Тип);

КонецПроцедуры //-- смарт:ММ 13.11.2021

//++ смарт:ММ 702 13.11.2021 
&НаКлиенте
Процедура ПослеВыбораСкладаPRE(ВыбранноеЗначение, ДопПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Сообщить("Документы перемещения не созданы. Необходимо указать склад.");
		Возврат;
	КонецЕсли;
	
	ВидСклада = ДопПараметры.ВидСклада;
	
	Если ВидСклада = "склад-получатель" Тогда
		
		ВводимоеЗначение = "";
				
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидСклада", ВидСклада);
		ДополнительныеПараметры.Вставить("Склад", ВыбранноеЗначение);
		
		ОбратныйВызов = Новый ОписаниеОповещения("ПослеВыбораНомераЗаявкиНаРемонтPRE", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВводСтроки(ОбратныйВызов, ВводимоеЗначение, "Укажите номер заявки на ремонт",, Ложь);
	Иначе
		СоздатьДокументыНаКлиенте(ВыбранноеЗначение, ВидСклада);
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 13.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаКлиенте
Процедура ПослеВыбораНомераЗаявкиНаРемонтPRE(ВыбранноеЗначение, ДопПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Сообщить("Документы перемещения не созданы. Необходимо указать номер заявки на ремонт.");
		Возврат;
	КонецЕсли;

	СоздатьДокументыНаКлиенте(ДопПараметры.Склад, ДопПараметры.ВидСклада, ВыбранноеЗначение);
	
КонецПроцедуры //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаКлиенте
Процедура СоздатьДокументыНаКлиенте(Склад, ВидСклада, НомерЗаявкиНаРемонт = "")
	
	МассивВыделенныхСтрок = Новый Массив;
	
	СтрокаЗаявка = Элементы.Список.ТекущиеДанные;
	Если СтрокаЗаявка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заявка = СтрокаЗаявка.Ссылка;
	НомераПозиций = Новый Массив;
	
	ВыделенныеСтроки = Элементы.ЗапчастиПоДокументу.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекСтрока = ВыделеннаяСтрока;
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("Число") Тогда
			ТекСтрока = Элементы.ЗапчастиПоДокументу.ДанныеСтроки(ВыделеннаяСтрока);
		КонецЕсли;
		
		СтруктураДанныеСтроки = Новый Структура;
		СтруктураДанныеСтроки.Вставить("Номенклатура", 	ТекСтрока.Номенклатура);
		СтруктураДанныеСтроки.Вставить("Количество", 	ТекСтрока.Количество);
		СтруктураДанныеСтроки.Вставить("Заявка", 		Заявка);

		МассивВыделенныхСтрок.Добавить(СтруктураДанныеСтроки);
		
		НомераПозиций.Добавить(ТекСтрока.НомерПозиции);
		
	КонецЦикла;
	
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрано ни одной запчасти для обработки!");
		Возврат;
	КонецЕсли;
	
	ЗаказНаПеремещение = СоздатьЗаказНаПеремещениеPRE(ВидСклада, Склад, МассивВыделенныхСтрок, НомерЗаявкиНаРемонт);
			
	Если ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
		
		// Добавить статус в заявке на гарантийный ремонт
		ДобавитьСтатусВЗаявкеНаГарантийныйРемонт(ВидСклада, Заявка, ЗаказНаПеремещение, НомераПозиций);
		
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Создан документ " + ЗаказНаПеремещение, ЗаказНаПеремещение);
		
		ПеремещениеТоваров = СоздатьПеремещениеТоваровPRE(ЗаказНаПеремещение, Заявка);
		
		Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Создан документ " + ПеремещениеТоваров, ПеремещениеТоваров);
		КонецЕсли;
		
		ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение);
		
		//++rnp 16.11.2021 - отправка уведомления на склад, если перемещение из Москвы в регионы 
		ОтправитьУведомлениеПоЗаказуНаПеремещение(ЗаказНаПеремещение);
		//
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 13.11.2021 
&НаСервере
Функция СоздатьЗаказНаПеремещениеPRE(ВидСклада, ВыбранныйСклад, МассивВыделенныхСтрок, НомерЗаявкиНаРемонт)
	
	ОсновнойСкладДляЗапчастейПодЗаказ = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ОсновнойСкладДляЗапчастейПодЗаказ", Ложь);

	Если НЕ ЗначениеЗаполнено(ОсновнойСкладДляЗапчастейПодЗаказ) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнена настройка ""Основной склад для запчастей ""под заказ"""" в справочнике ""Предопределенные значения (смарт)"". Документы перемещения не созданы!");
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументЗаказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	
	ДокументЗаказ.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	ДокументЗаказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументЗаказ.Статус 			= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокументЗаказ.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
	ДокументЗаказ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументЗаказ.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
		
	НомераЗаявок = "";
	МассивНомеровЗаявок = Новый Массив;
	
	Организация = Неопределено;
	
	Для Каждого ТекСтрока Из МассивВыделенныхСтрок Цикл
		
		НомерЗаявки = СокрЛП(ТекСтрока.Заявка.Номер);
		
		НоваяСтрока = ДокументЗаказ.Товары.Добавить();
		НоваяСтрока.Количество 			= ТекСтрока.Количество;
		НоваяСтрока.КоличествоУпаковок	= ТекСтрока.Количество;
		НоваяСтрока.Номенклатура 		= ТекСтрока.Номенклатура;
		НоваяСтрока.НачалоОтгрузки 		= ТекущаяДата();
		НоваяСтрока.ОкончаниеПоступления 	= НоваяСтрока.НачалоОтгрузки;
		НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонт = НомерЗаявки;
		НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонтСсылка = ТекСтрока.Заявка.Ссылка;
		//-- #Б1132 смарт: Шляпников 14.10.2024
		
		Если МассивНомеровЗаявок.Найти(НомерЗаявки) = Неопределено Тогда
			МассивНомеровЗаявок.Добавить(НомерЗаявки);
			НомераЗаявок = НомераЗаявок + ?(ЗначениеЗаполнено(НомераЗаявок), ", ", "") + НомерЗаявки
		КонецЕсли;
		
		Организация = ТекСтрока.Заявка.Организация;
		
	КонецЦикла;
	
	ДокументЗаказ.Организация = Организация;  // Предполагается, что выбраны строки по одной организации
	ДокументЗаказ.Дата = ТекущаяДата();
	ДокументЗаказ.Комментарий = Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(, НомераЗаявок);

	Если ВидСклада = "склад-получатель" Тогда  
		// взять с PRE
		ДокументЗаказ.СкладОтправитель 	= ОсновнойСкладДляЗапчастейПодЗаказ;
		ДокументЗаказ.СкладПолучатель 	= ВыбранныйСклад;
		ДокументЗаказ.Комментарий = ДокументЗаказ.Комментарий + ". Для заявки на ремонт №" + НомерЗаявкиНаРемонт;
	Иначе 
		// Вернуть на PRE
		ДокументЗаказ.СкладОтправитель 	= ВыбранныйСклад;
		ДокументЗаказ.СкладПолучатель 	= ОсновнойСкладДляЗапчастейПодЗаказ;
	КонецЕсли;

	ДокументЗаказ.ДополнительныеСвойства.Вставить("смартНеДобавлятьСтрокуСтатусаВЗаявкуНаГарантийныйРемонт", Истина);
	
	Попытка
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СинонимДокумента = ДокументЗаказ.Метаданные().Синоним;
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.");
	КонецПопытки;

	Возврат ДокументЗаказ.Ссылка;
	
КонецФункции //-- смарт:ММ 13.11.2021

//++ смарт:ММ 702 13.11.2021 
&НаСервере
Функция СоздатьПеремещениеТоваровPRE(ЗаказНаПеремещение, Заявка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказНаПеремещение);

	ДанныеЗаполнения = Новый Структура;
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивЗаказов, "ПеремещениеТоваров");
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	ДокументПеремещение.Заполнить(ДанныеЗаполнения);
	
	ДокументПеремещение.Дата = ЗаказНаПеремещение.Дата;
	
	ДокументПеремещение.Комментарий = ЗаказНаПеремещение.Комментарий;
	
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ДокументПеремещение.смартЗапчастиГарантийные = Истина;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	Для Каждого Строка Из ДокументПеремещение.Товары Цикл
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//Строка.смартНомерЗаявкиНаГарантийныйРемонт = Заявка.Номер;
		Строка.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Заявка.Ссылка;
		//-- #Б1132 смарт: Шляпников 14.10.2024
	КонецЦикла;
	
	Попытка
		ДокументПеремещение.Записать(РежимЗаписиДокумента.Проведение);
	Исключение				
			СинонимДокумента = ДокументПеремещение.Метаданные().Синоним;
			ДокументПеремещение.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
			|" + ОписаниеОшибки() + "
			|Документ записан без проведения.", ДокументПеремещение.Ссылка);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументПеремещение.Ссылка;
	
КонецФункции //-- смарт:ММ 13.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаКлиенте
Процедура ПоказатьПечатнуюФормуДокумента(ЗаказНаПеремещение)
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) 
		ИЛИ ТипЗнч(ЗаказНаПеремещение) <> Тип("ДокументСсылка.ЗаказНаПеремещение")
		Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = ПолучитьТабДокНаСервере(ЗаказНаПеремещение);
	СинонимМакета = "Заказ на перемещение №" + ПолучитьРеквизитОбъекта(ЗаказНаПеремещение, "Номер");
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаказНаПеремещение");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	КоллекцияПечатныхФорм[0].ИмяФайлаПечатнойФормы = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);
	
КонецПроцедуры //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаСервереБезКонтекста
Функция ПолучитьТабДокНаСервере(ЗаказНаПеремещение)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ЗаказНаПеремещение);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ЗаказНаПеремещение);

	КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм("ЗаказНаПеремещение");
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода(); 
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ЗаказНаПеремещение);
	
	ПараметрыПечати = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Документы.ЗаказНаПеремещение.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент; 
		
КонецФункции //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
Функция ПолучитьРеквизитОбъекта(СсылкаНаОбъект, Свойство)
	Возврат СсылкаНаОбъект[Свойство];
КонецФункции //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаКлиенте
Процедура ПечатьДокументов(КоллекцияПечатныхФорм, Знач ОбъектыПечати = Неопределено, ВладелецФормы = Неопределено, ЗаголовокФормы = "")
	
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаСервереБезКонтекста
Функция ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы)
	
	Результат = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		Результат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		Идентификаторы = СтрРазделить(Идентификаторы, ",");
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		ПечатнаяФорма = Результат.Найти(Идентификатор, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			ПечатнаяФорма = Результат.Добавить();
			ПечатнаяФорма.ИмяМакета = Идентификатор;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Идентификатор);
			ПечатнаяФорма.Экземпляров = 1;
		Иначе
			ПечатнаяФорма.Экземпляров = ПечатнаяФорма.Экземпляров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Индексы.Добавить("ИмяВРЕГ");
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 14.11.2021

//++ смарт:ММ 702 14.11.2021 
&НаСервере
Процедура ДобавитьСтатусВЗаявкеНаГарантийныйРемонт(ВидСклада, Заявка, ЗаказНаПеремещение, НомераПозиций)
	
	УстанавливаемыйСтатус = Неопределено;
	
	Если ВидСклада = "склад-получатель" Тогда 
		// Перемещение со склада PRE на другой склад
		УстанавливаемыйСтатус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ПеремещеноНаДругиеЦели");			
	ИначеЕсли ВидСклада = "склад-отправитель" Тогда 
		// Перемещение на склад PRE с другого склада
		УстанавливаемыйСтатус = ПредопределенноеЗначение("Перечисление.смартСтатусыПоГарантииПолучение.ВозвращеноПоНазначению");
	КонецЕсли;
	
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	
	Для Каждого НомерПозиции Из НомераПозиций Цикл
		НоваяСтрока = ЗаявкаОбъект.Статусы.Добавить();
		НоваяСтрока.НомерПозиции 			= НомерПозиции;
		НоваяСтрока.ДатаИзмененияСтатуса 	= ТекущаяДата();
		НоваяСтрока.Статус 					= УстанавливаемыйСтатус;
		НоваяСтрока.ДокументДвижения 		= ЗаказНаПеремещение;
	КонецЦикла;
	
	Попытка
		ЗаявкаОбъект.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры //-- смарт:ММ 14.11.2021

//++rnp 702 16.11.2021 процедура и функция скопированы из модуля формы документа смартЗаявкаНаГарантийныйРемонт 
&НаСервере
Процедура ОтправитьУведомлениеПоЗаказуНаПеремещение(ЗаказНаПеремещение)
	Если НЕ ЗначениеЗаполнено(ЗаказНаПеремещение) Тогда
		Возврат;
	КонецЕсли;
	Представительство = ЗаказНаПеремещение.СкладПолучатель.Подразделение; 
	Если Представительство <> Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение
		И ЗаказНаПеремещение.СкладОтправитель.Подразделение <> Представительство Тогда
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой);
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
		МассивАдресовСервисногоЦентраВРегионеПолучения = смартОбщегоНазначения.ПолучитьАдресРуководителяПредставительства(Представительство, АдресаДляОтправкиСтрокой);
		Для Каждого Адрес Из МассивАдресовСервисногоЦентраВРегионеПолучения Цикл
			МассивАдресовДляОтправки.Добавить(Адрес);
		КонецЦикла;
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
		ТестовыеАдресаСтрока = "";
		ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
		
		ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
		
		Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			//-- смарт:ММ 03.03.2021
			
			//Номер = Объект.Номер;
			
			ТемаПисьма = "Перемещение запчастей со склада Гарантийные запчасти - не для продажи";
			
			ТекстПисьма = " Необходима отправка запчастей в региональное представительство " +  Представительство.Наименование + ". Необходимо обработать Заказ на перемещение №" 
			+ ЗаказНаПеремещение.Номер + " от " + Формат(ЗаказНаПеремещение.Дата, "ДФ='dd.MM.yyyy ""г.""'");
			
			ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
			
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			//-- смарт:ММ 03.03.2021
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
				//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
				Если ПараметрыПисьма.ТестоваяБаза Тогда
					ТекстСообщения = "Отправлено уведомление о перемещении гарантийных запчастей НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
				Иначе
					//-- смарт:ММ 03.03.2021
					
					ТекстСообщения = "Отправлено уведомление о перемещении гарантийных запчастей на почту " +  АдресаДляОтправкиСтрокой;		
					
					//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
				КонецЕсли;
				//-- смарт:ММ 03.03.2021
				
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Исключение 
				//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
				смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ЗаказНаПеремещение,ТекстПисьма);
				//-- #1416 смарт: Фролов 30.08.2023
				ТекстСообщения = "Не удалось отправить уведомление о перемещении гарантийных запчастей" + Символы.ПС + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьАдресаПолучателейУведомленийРаспроведениеРО(АдресаДляОтправкиСтрокой = "") Экспорт
	
	// Уведомление отправляется получаетелям, которые задаются в справочнике смартПредопределенныеЗначения
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресаДляУведомленийОНеобходимостиРаспровестиРасходныйОрдерПриОтменеОтправки;
	
	// Раскомментировать, если в справочнике должны будут храниться пользователи, а не адреса эл. почты
	//Возврат смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	|	И НЕ смартПредопределенныеЗначения.СписокЗначений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений";
	
	Запрос.УстановитьПараметр("ПредопределенноеЗначение", СсылкаНаПредопределенноеЗначение);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции

//++ #Б-1176 смарт: Мосолов 25.10.2024 //Заявки на гарантийный ремонт. Запчасти. Отчет по возвратам  
&НаКлиенте
Процедура КонтрольВозвратовПоставщикам(Команда)
	
	ОткрытьФорму("Отчет.смартКонтрольВозвратовПоставщикам.Форма", , ЭтаФорма);
	
КонецПроцедуры //-- #Б-1176 смарт: Мосолов 25.10.2024

//++ #Б-2204 смарт: Лопато 10.02.2025 //Документ Заявка на гарантийный ремонт (смарт). Доработка.  
&НаСервереБезКонтекста
Функция ПроверитьДоступностьРолейНаСервере(РолиДляПроверки)

	Возврат Пользователи.РолиДоступны(РолиДляПроверки);
	
КонецФункции //-- #Б-2204 смарт: Лопато 10.02.2025

&НаКлиенте
//++ #Б-6304 смарт: Фролов 13.04.2026 //Создать новый реквизит в карточке товаров
Процедура ДаПриИзменении(Элемент)
	
	Если Да Тогда
		
		Нет = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтправкаТЭК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтправкаТЭКНет", , , , Ложь);
		
	Иначе	
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтправкаТЭК", , , , Ложь);
		
	КонецЕсли;	
	
	СписокПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры //-- #Б-6304 смарт: Фролов 13.04.2026

&НаКлиенте
//++ #Б-6304 смарт: Фролов 13.04.2026 //Создать новый реквизит в карточке товаров
Процедура НетПриИзменении(Элемент)
	
	Если Нет Тогда
		
		Да = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтправкаТЭКНет", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтправкаТЭК", , , , Ложь);
	
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтправкаТЭКНет", , , , Ложь);
	
	КонецЕсли;
	
	СписокПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры //-- #Б-6304 смарт: Фролов 13.04.2026

//++ смарт:Подкин #959 12.04.2022 17:26:17
&НаКлиенте
Процедура ДвиженияЛОА(Команда)        
	
	ПредопределенныйЭлемент = ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения.ОтчетДвиженияДеталейЛОА");
	
	СсылкаНаВнешнийОтчет = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ПредопределенныйЭлемент, Ложь);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден внешний отчет");
		Возврат;
	КонецЕсли;
	
	ИмяОбработкиСлужебное = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СсылкаНаВнешнийОтчет);
	Если ЗначениеЗаполнено(ИмяОбработкиСлужебное) Тогда
		ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);
		ОткрытьФорму("ВнешнийОтчет." + ИмяОбработкиСлужебное + ".Форма", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры //-- смарт:Подкин #959 12.04.2022 17:26:17