
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Пользователи.РолиДоступны("смартПланПродажПоМенеджерамИзменение") Тогда
		ОбщегоНазначения.СообщитьПользователю("Просмотр запрещен!");
		Отказ=Истина;
		Возврат;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПриИзмененииПериодовНаСервере();
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//Элементы.ТипУслуги.СписокВыбора.Добавить(Справочники.CRM_ТипУслуги.ПустаяСсылка(), "Вся номенклатура");
	//Элементы.ТипУслуги.СписокВыбора.Добавить(Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги, "Продажа оборудования");
	//Элементы.ТипУслуги.СписокВыбора.Добавить(Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти, "Продажа запчастей");
	//Элементы.ТипУслуги.СписокВыбора.Добавить(Справочники.CRM_ТипУслуги.ПоставкаРасходныеМатериалы, "Продажа расходников");
	//-- #Б-2220 смарт: Фролов 28.02.2025
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования) Тогда
		Объект.ВидПлана = ЭтотОбъект.Параметры.ЗначениеКопирования.ВидПлана;
	ИначеЕсли Объект.Ссылка.Пустая() Тогда
		//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
		//Объект.ТипУслуги = Справочники.CRM_ТипУслуги.ПустаяСсылка();
		Объект.ТипУслуги = Справочники.СегментыНоменклатуры.ПустаяСсылка();
		//-- #Б-2220 смарт: Фролов 28.02.2025
	КонецЕсли;
	
	Для Каждого СтрПартнерыИсключения Из Объект.ПартнерыИсключения Цикл
		
		ЭтаФорма.ПартнерыИсключения.Добавить(СтрПартнерыИсключения.Партнер);
		
	КонецЦикла;	
	
	Если Объект.ВидПлана = Перечисления.смартВидПлана.ПоПодразделениям Тогда
		Если Объект.Ссылка.Пустая() Тогда
			Объект.Дата=ТекущаяДата();
			Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
			Объект.Периодичность=Перечисления.Периодичность.Месяц;
			Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Подготовка;
			Объект.КоэффициентИзмененияОбщий=1;
			Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования) Тогда
				МасПодразделение=ЭтотОбъект.Параметры.ЗначениеКопирования.Планирование.Выгрузить(,"Подразделение").ВыгрузитьКолонку("Подразделение");
				МасПодразделение=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПодразделение);
				Объект.НачалоПериода=ЭтотОбъект.Параметры.ЗначениеКопирования.НачалоПериода; 
				Объект.ОкончаниеПериода=ЭтотОбъект.Параметры.ЗначениеКопирования.ОкончаниеПериода;
				ЗаполнитьТаблицуПланированияФактомПоПодразделениям(МасПодразделение,Объект.НачалоПериода,Объект.ОкончаниеПериода); 
			КонецЕсли;		
		Иначе 
			Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) ТОгда  
				МасПодразделение=Объект.Планирование.Выгрузить(,"Подразделение").ВыгрузитьКолонку("Подразделение"); 
				МасПодразделение=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПодразделение);
				ЗаполнитьТаблицуПланированияФактомПоПодразделениям(МасПодразделение,Объект.НачалоПериода,Объект.ОкончаниеПериода);
			КонецЕсли;
			ЗаполнитьТаблицуПланированияПланомПоПодразделениям();
		КонецЕсли;
	ИначеЕсли Объект.ВидПлана = Перечисления.смартВидПлана.ПоСегментамНоменклатуры Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			Объект.Дата = ТекущаяДата();
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Объект.Периодичность = Перечисления.Периодичность.Месяц;
			Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Подготовка;
			Объект.КоэффициентИзмененияОбщий = 1;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования) Тогда
				
				МассивСегментНоменклатуры = ЭтотОбъект.Параметры.ЗначениеКопирования.
					Планирование.Выгрузить(, "СегментНоменклатуры").ВыгрузитьКолонку("СегментНоменклатуры");
				МасСегменМассивСегментНоменклатурытНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСегментНоменклатуры);
				Объект.НачалоПериода = ЭтотОбъект.Параметры.ЗначениеКопирования.НачалоПериода; 
				Объект.ОкончаниеПериода = ЭтотОбъект.Параметры.ЗначениеКопирования.ОкончаниеПериода;
				ЗаполнитьТаблицуПланированияФактомПоСегментам(МассивСегментНоменклатуры, Объект.НачалоПериода, Объект.ОкончаниеПериода);
				
			КонецЕсли;
			
		Иначе 
			
			Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда  
				
				МассивСегментНоменклатуры = Объект.Планирование.Выгрузить(, "СегментНоменклатуры").ВыгрузитьКолонку("СегментНоменклатуры"); 
				МассивСегментНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСегментНоменклатуры);
				ЗаполнитьТаблицуПланированияФактомПоСегментам(МассивСегментНоменклатуры, Объект.НачалоПериода, Объект.ОкончаниеПериода);
				
			КонецЕсли;
			
			ЗаполнитьТаблицуПланированияПланомПоСегментам();
			
		КонецЕсли;
		
	Иначе	
		
		Если Объект.Ссылка.Пустая() Тогда
			Объект.Дата=ТекущаяДата();
			Объект.ВидПлана = Перечисления.смартВидПлана.ПоМенеджерам;
			Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
			Объект.Периодичность=Перечисления.Периодичность.Месяц;
			Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Подготовка;
			Объект.КоэффициентИзмененияОбщий=1;
			Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования) Тогда
				МасМенеджер=ЭтотОбъект.Параметры.ЗначениеКопирования.Планирование.Выгрузить(,"Менеджер").ВыгрузитьКолонку("Менеджер");
				МасМенеджер=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасМенеджер);
				Объект.НачалоПериода=ЭтотОбъект.Параметры.ЗначениеКопирования.НачалоПериода; 
				Объект.ОкончаниеПериода=ЭтотОбъект.Параметры.ЗначениеКопирования.ОкончаниеПериода;
				ЗаполнитьТаблицуПланированияФактом(МасМенеджер,Объект.НачалоПериода,Объект.ОкончаниеПериода); 
			КонецЕсли;		
		Иначе 
			Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) ТОгда  
				МасМенеджер=Объект.Планирование.Выгрузить(,"Менеджер").ВыгрузитьКолонку("Менеджер"); 
				МасМенеджер=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасМенеджер);
				ЗаполнитьТаблицуПланированияФактом(МасМенеджер,Объект.НачалоПериода,Объект.ОкончаниеПериода);
			КонецЕсли;
			ЗаполнитьТаблицуПланированияПланом();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		Если (Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Утвержден И Объект.Проведен) 
			ИЛИ Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Отменен Тогда
			ЭтаФорма.ТолькоПросмотр=Истина; 
			Элементы.ТабПланирования.ТолькоПросмотр=Истина;
			Элементы.ТабПланированияКоманднаяПанель.ТолькоПросмотр=Истина;
			Элементы.ТабПланированияКонтекстноеМеню.ТолькоПросмотр=Истина;
			Элементы.ТабПланированияПодборМенеджеров.Доступность=Ложь;
			Элементы.ТабПланированияЗаполнитьДаннымиПериода.Доступность=Ложь;
			Элементы.ТабПланированияСформировать.Доступность=Ложь;
			Элементы.УстановитьИнтервал.Доступность=Ложь;
		КонецЕсли;
	КонецЕсли;  
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		Элементы.ТабПланированияГруппаПланНаКвартал.Видимость = Ложь;
		Элементы.ТабПланированияГруппаПланНаМесяц.Видимость = Истина;
	Иначе
		Элементы.ТабПланированияГруппаПланНаКвартал.Видимость = Истина;
		Элементы.ТабПланированияГруппаПланНаМесяц.Видимость = Ложь;
	КонецЕсли;	

	ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабПланированияИтогоЗаТекПериод");
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "ИтогоЗаТекПериод"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "ПланНаСледПериод");
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200,0,0));
	ЭлементОформления.Использование = Истина;
	
	ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабПланированияИтогоЗаТекПериод");
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "ИтогоЗаТекПериод"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "ПланНаСледПериод");
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,150,70));
	ЭлементОформления.Использование = Истина;  
	
	ВидимостьЭлементовОтТипаПлана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ВывестиДекорациюПериод();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи); 
	
	ЕстьДубли = Ложь;
	
	Если Объект.ВидПлана = Перечисления.смартВидПлана.ПоПодразделениям Тогда
		
		Запрос=Новый Запрос(
		"ВЫБРАТЬ
		|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
		|	ВЫБОР
		|	КОГДА смартПланПродажПоМенеджерамОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		ТОГДА смартПланПродажПоМенеджерамОбороты.Подразделение
		|		ИНАЧЕ смартПланПродажПоМенеджерамОбороты.Подразделение.смартПодразделениеДляПланирования
		|	КОНЕЦ КАК Подразделение,
		|	смартПланПродажПоМенеджерамОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Подразделение В (&МасПодразделение)
		|				И ТипУслуги = &ТипУслуги) КАК смартПланПродажПоМенеджерамОбороты
		|ГДЕ
		|	смартПланПродажПоМенеджерамОбороты.Регистратор ССЫЛКА Документ.смартПланПродажПоМенеджерам
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|	КОГДА смартПланПродажПоМенеджерамОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		ТОГДА смартПланПродажПоМенеджерамОбороты.Подразделение.Наименование
		|		ИНАЧЕ смартПланПродажПоМенеджерамОбороты.Подразделение.смартПодразделениеДляПланирования.Наименование
		|	КОНЕЦ");
		Запрос.УстановитьПараметр("ДатаНачала",Объект.НачалоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания",Объект.ОкончаниеПериода); 
		Запрос.УстановитьПараметр("ТипУслуги",Объект.ТипУслуги);
		МасПодразделение = Объект.Планирование.Выгрузить(,"Подразделение").ВыгрузитьКолонку("Подразделение");
		МасПодразделение = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПодразделение);
		Запрос.УстановитьПараметр("МасПодразделение",МасПодразделение);
		
		Если НЕ Объект.Ссылка.Пустая() ТОгда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1","смартПланПродажПоМенеджерамОбороты.Регистратор <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		КонецЕсли;
		
		Выборка=Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю("Для подразделения "+Выборка.Подразделение+" в периоде "+Формат(Выборка.Период,"ДФ='ММММ гггг'")+" уже сформирован План продаж № "+Выборка.Регистратор.Номер+" используйте корректировку плана!");
			ЕстьДубли=Истина;	
			
		КонецЦикла;
		
	ИначеЕсли Объект.ВидПлана = Перечисления.смартВидПлана.ПоСегментамНоменклатуры Тогда
		
		Запрос=Новый Запрос(
		"ВЫБРАТЬ
		|	Период КАК Период,
		|	СегментНоменклатуры КАК СегментНоменклатуры,
		|	Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			СегментНоменклатуры В (&МассивСегментНоменклатуры))
		|ГДЕ
		|	Регистратор ССЫЛКА Документ.смартПланПродажПоМенеджерам
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	СегментНоменклатуры");
		Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", Объект.ОкончаниеПериода);
		
		МассивСегментНоменклатуры = Объект.Планирование.Выгрузить(, "СегментНоменклатуры").ВыгрузитьКолонку("СегментНоменклатуры");
		МассивСегментНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСегментНоменклатуры);
		Запрос.УстановитьПараметр("МассивСегментНоменклатуры", МассивСегментНоменклатуры);
		
		Если НЕ Объект.Ссылка.Пустая() Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Регистратор <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю("Для сегмента номенклатуры " + Выборка.СегментНоменклатуры +
				" в периоде " + Формат(Выборка.Период, "ДФ='ММММ гггг'") + " уже сформирован План продаж № " +
				Выборка.Регистратор.Номер + " используйте корректировку плана!");
			ЕстьДубли = Истина;	
			
		КонецЦикла;
		
	Иначе	
		
		Запрос=Новый Запрос(
		"ВЫБРАТЬ
		|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
		|	смартПланПродажПоМенеджерамОбороты.Менеджер КАК Менеджер,
		|	смартПланПродажПоМенеджерамОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Менеджер В (&МасМенеджер)
		|				И ТипУслуги = &ТипУслуги) КАК смартПланПродажПоМенеджерамОбороты
		|ГДЕ
		|	смартПланПродажПоМенеджерамОбороты.Регистратор ССЫЛКА Документ.смартПланПродажПоМенеджерам
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартПланПродажПоМенеджерамОбороты.Менеджер.Наименование");
		Запрос.УстановитьПараметр("ДатаНачала",Объект.НачалоПериода); 
		Запрос.УстановитьПараметр("ДатаОкончания",Объект.ОкончаниеПериода);
		Запрос.УстановитьПараметр("ТипУслуги",Объект.ТипУслуги);
		МасМенеджер = Объект.Планирование.Выгрузить(,"Менеджер").ВыгрузитьКолонку("Менеджер");
		МасМенеджер = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасМенеджер);
		Запрос.УстановитьПараметр("МасМенеджер",МасМенеджер);
		
		Если НЕ Объект.Ссылка.Пустая() ТОгда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1","смартПланПродажПоМенеджерамОбороты.Регистратор <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		КонецЕсли;
		
		Выборка=Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю("Для менеджера "+Выборка.Менеджер+" в периоде "+Формат(Выборка.Период,"ДФ='ММММ гггг'")+" уже сформирован План продаж № "+Выборка.Регистратор.Номер+" используйте корректировку плана!");
			ЕстьДубли=Истина;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЕстьДубли Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		Если (Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Утвержден И Объект.Проведен) 
			ИЛИ Объект.Статус=Перечисления.смартСтатусыПланаПродаж.Отменен Тогда
			ЭтаФорма.ТолькоПросмотр=Истина; 
			Элементы.ТабПланирования.ТолькоПросмотр=Истина;
			Элементы.ТабПланированияКоманднаяПанель.ТолькоПросмотр=Истина;
			Элементы.ТабПланированияКонтекстноеМеню.ТолькоПросмотр=Истина;
			Элементы.ТабПланированияПодборМенеджеров.Доступность=Ложь;
			Элементы.ТабПланированияЗаполнитьДаннымиПериода.Доступность=Ложь;
			Элементы.ТабПланированияСформировать.Доступность=Ложь;
			Элементы.УстановитьИнтервал.Доступность=Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьТаблицуПланированияПланом()
	
	ПериодичностьПлана = ?(Объект.Периодичность=Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	смартПланПродажПоМенеджерамПланирование.Менеджер КАК Менеджер,
	|	смартПланПродажПоМенеджерамПланирование.Комментарий КАК Комментарий,
	|	смартПланПродажПоМенеджерамПланирование.РучноеИзменение КАК РучноеИзменение,
	|	НАЧАЛОПЕРИОДА(смартПланПродажПоМенеджерамПланирование.Период, " + ПериодичностьПлана + ") КАК ПериодПлан,
	|	СУММА(смартПланПродажПоМенеджерамПланирование.НовыйПлан) КАК НовыйПлан
	|ИЗ
	|	Документ.смартПланПродажПоМенеджерам.Планирование КАК смартПланПродажПоМенеджерамПланирование
	|ГДЕ
	|	смартПланПродажПоМенеджерамПланирование.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	смартПланПродажПоМенеджерамПланирование.Менеджер,
	|	смартПланПродажПоМенеджерамПланирование.Комментарий,
	|	смартПланПродажПоМенеджерамПланирование.РучноеИзменение,
	|	НАЧАЛОПЕРИОДА(смартПланПродажПоМенеджерамПланирование.Период, " + ПериодичностьПлана + ")"); 
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезПланирование = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТабПланирования Из ТабПланирования Цикл
		
		Если СтрТабПланирования.РучноеИзменение Тогда
			Продолжить;
		КонецЕсли;
		
		ПланНаСледПериод = 0;
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрокиРезПланирование = РезПланирование.НайтиСтроки(Новый Структура("Менеджер, ПериодПлан",
				СтрТабПланирования.Менеджер, СтрТаблицаПериоды.ДатаНачала));
			Если СтрокиРезПланирование.Количество() > 0 Тогда
				СтрТабПланирования["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = СтрокиРезПланирование[0].НовыйПлан;		
				ПланНаСледПериод = ПланНаСледПериод + СтрокиРезПланирование[0].НовыйПлан;
			КонецЕсли;	
			
		КонецЦикла;
		
		СтрокиМенеджер = РезПланирование.НайтиСтроки(Новый Структура("Менеджер",СтрТабПланирования.Менеджер));
		Если СтрокиМенеджер.Количество() > 0 Тогда
			СтрТабПланирования.РучноеИзменение = СтрокиМенеджер[0].РучноеИзменение;
			СтрТабПланирования.Комментарий = СтрокиМенеджер[0].Комментарий;
			
			Если Объект.Периодичность = Перечисления.Периодичность.Месяц Тогда
				СтрТабПланирования.ПланНаМесяц = Окр(ПланНаСледПериод / ТаблицаПериоды.Количество(), -3); 
				СтрТабПланирования.ПланНаСледПериод=СтрТабПланирования.ПланНаМесяц*ТаблицаПериоды.Количество();
			Иначе
				СтрТабПланирования.ПланНаКвартал = Окр(ПланНаСледПериод / ТаблицаПериоды.Количество(), -3); 
				СтрТабПланирования.ПланНаСледПериод = СтрТабПланирования.ПланНаКвартал*ТаблицаПериоды.Количество();
			КонецЕсли;
			
		КонецЕсли;
		
		СтрТабПланирования.ПроцентИзмененияПлана = ?(СтрТабПланирования.ИтогоЗаПредПериод = 0, 0,
			(ПланНаСледПериод - СтрТабПланирования.ИтогоЗаПредПериод) / СтрТабПланирования.ИтогоЗаПредПериод) * 100;
		
	КонецЦикла;
	
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПланированияПланомПоПодразделениям()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫБОР
	|	КОГДА смартПланПродажПоМенеджерамПланирование.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ТОГДА смартПланПродажПоМенеджерамПланирование.Подразделение
	|		ИНАЧЕ смартПланПродажПоМенеджерамПланирование.Подразделение.смартПодразделениеДляПланирования
	|	КОНЕЦ КАК Подразделение,
	|	смартПланПродажПоМенеджерамПланирование.Комментарий КАК Комментарий,
	|	смартПланПродажПоМенеджерамПланирование.РучноеИзменение КАК РучноеИзменение,
	|	НАЧАЛОПЕРИОДА(смартПланПродажПоМенеджерамПланирование.Период, "+?(Объект.Периодичность=Перечисления.Периодичность.Месяц,"МЕСЯЦ","КВАРТАЛ")+") КАК ПериодПлан,
	|	СУММА(смартПланПродажПоМенеджерамПланирование.НовыйПлан) КАК НовыйПлан
	|ИЗ
	|	Документ.смартПланПродажПоМенеджерам.Планирование КАК смартПланПродажПоМенеджерамПланирование
	|ГДЕ
	|	смартПланПродажПоМенеджерамПланирование.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|	КОГДА смартПланПродажПоМенеджерамПланирование.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ТОГДА смартПланПродажПоМенеджерамПланирование.Подразделение
	|		ИНАЧЕ смартПланПродажПоМенеджерамПланирование.Подразделение.смартПодразделениеДляПланирования
	|	КОНЕЦ,
	|	смартПланПродажПоМенеджерамПланирование.Комментарий,
	|	смартПланПродажПоМенеджерамПланирование.РучноеИзменение,
	|	НАЧАЛОПЕРИОДА(смартПланПродажПоМенеджерамПланирование.Период, "+?(Объект.Периодичность=Перечисления.Периодичность.Месяц,"МЕСЯЦ","КВАРТАЛ")+")"); 
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	РезПланирование =Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТабПланирования Из ТабПланирования Цикл
		
		Если СтрТабПланирования.РучноеИзменение Тогда
			Продолжить;
		КонецЕсли;
		
		ПланНаСледПериод = 0;
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрокиРезПланирование = РезПланирование.НайтиСтроки(Новый Структура("Подразделение,ПериодПлан",СтрТабПланирования.Подразделение,СтрТаблицаПериоды.ДатаНачала));
			Если СтрокиРезПланирование.Количество()>0 Тогда
				СтрТабПланирования["КолонкаПлан_"+СтрТаблицаПериоды.ИмяКолонки] = СтрокиРезПланирование[0].НовыйПлан;		
				ПланНаСледПериод = ПланНаСледПериод+СтрокиРезПланирование[0].НовыйПлан;
			КонецЕсли;	
			
		КонецЦикла;
		
		Подразделение = РезПланирование.НайтиСтроки(Новый Структура("Подразделение",СтрТабПланирования.Подразделение));
		Если Подразделение.Количество() > 0 Тогда
			СтрТабПланирования.РучноеИзменение = Подразделение[0].РучноеИзменение;
			СтрТабПланирования.Комментарий = Подразделение[0].Комментарий;
			
			Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
				СтрТабПланирования.ПланНаМесяц = Окр(ПланНаСледПериод/ТаблицаПериоды.Количество(),-3); 
				СтрТабПланирования.ПланНаСледПериод=СтрТабПланирования.ПланНаМесяц*ТаблицаПериоды.Количество();
			Иначе
				СтрТабПланирования.ПланНаКвартал = Окр(ПланНаСледПериод/ТаблицаПериоды.Количество(),-3); 
				СтрТабПланирования.ПланНаСледПериод = СтрТабПланирования.ПланНаКвартал*ТаблицаПериоды.Количество();
			КонецЕсли;
			
		КонецЕсли;
		
		СтрТабПланирования.ПроцентИзмененияПлана = ?(СтрТабПланирования.ИтогоЗаПредПериод=0,0,(ПланНаСледПериод-СтрТабПланирования.ИтогоЗаПредПериод)/СтрТабПланирования.ИтогоЗаПредПериод)*100;
		
	КонецЦикла;
	
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПланированияПланомПоСегментам()
	
	ПериодичностьПлана = ?(Объект.Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ");
	ЗаполнитьТаблицуРозничныхЦенПоСегментам();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СегментНоменклатуры КАК СегментНоменклатуры,
	|	Комментарий КАК Комментарий,
	|	РучноеИзменение КАК РучноеИзменение,
	|	НАЧАЛОПЕРИОДА(Период," + ПериодичностьПлана + ") КАК ПериодПлан,
	|	СУММА(НовыйПланКоличество) КАК НовыйПланКоличество,
	|	СРЕДНЕЕ(Цена) КАК Цена,
	|	СУММА(НовыйПлан) КАК НовыйПлан
	|ИЗ
	|	Документ.смартПланПродажПоМенеджерам.Планирование
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Комментарий,
	|	РучноеИзменение,
	|	НАЧАЛОПЕРИОДА(Период, " + ПериодичностьПлана + "),
	|	СегментНоменклатуры"); 
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ТаблицаПланирование = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТабПланирования Из ТабПланирования Цикл
		
		Если СтрТабПланирования.РучноеИзменение Тогда
			Продолжить;
		КонецЕсли;
		
		ПланНаСледПериод = 0;
		ПланНаСледПериодКоличество = 0;
		
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрокиРезПланирование = ТаблицаПланирование.НайтиСтроки(Новый 
				Структура("СегментНоменклатуры, ПериодПлан", СтрТабПланирования.СегментНоменклатуры, СтрТаблицаПериоды.ДатаНачала));
				
			Если СтрокиРезПланирование.Количество() > 0 Тогда
				СтрТабПланирования["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки] = СтрокиРезПланирование[0].НовыйПланКоличество;
					ПланНаСледПериодКоличество = ПланНаСледПериодКоличество + СтрокиРезПланирование[0].НовыйПланКоличество;
				СтрТабПланирования["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(СтрокиРезПланирование[0].НовыйПлан = 0, 
					СтрокиРезПланирование[0].Цена * СтрокиРезПланирование[0].НовыйПланКоличество, СтрокиРезПланирование[0].НовыйПлан);
					ПланНаСледПериод = ПланНаСледПериод + СтрТабПланирования["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки];
			КонецЕсли;	
			
		КонецЦикла;
		
		СегментНоменклатуры = ТаблицаПланирование.НайтиСтроки(Новый Структура("СегментНоменклатуры", СтрТабПланирования.СегментНоменклатуры));
		
		СтрокиТаблицаРозничныхЦен = ТаблицаРозничныхЦен.НайтиСтроки(Новый Структура("СегментНоменклатуры", СтрТабПланирования.СегментНоменклатуры));
		
		Если СтрокиТаблицаРозничныхЦен.Количество() > 0 Тогда
			ЦенаРозничная = СтрокиТаблицаРозничныхЦен[0].ЦенаВЕВРО;
		Иначе
			ЦенаРозничная = 0;
		КонецЕсли;	
		
		Если ЦенаРозничная > Окр(ЦенаРозничная, 0) Тогда
			ЦенаРозничная = Окр(ЦенаРозничная + 1, 0);
		Иначе
			ЦенаРозничная = Окр(ЦенаРозничная, 0);
		КонецЕсли;
		
		Если СегментНоменклатуры.Количество() > 0 Тогда
			
			СтрТабПланирования.РучноеИзменение = СегментНоменклатуры[0].РучноеИзменение;
			СтрТабПланирования.Комментарий = СегментНоменклатуры[0].Комментарий;
			
			Если Объект.Периодичность = Перечисления.Периодичность.Месяц Тогда
				СтрТабПланирования.ПланНаМесяц = Окр(ПланНаСледПериод / ТаблицаПериоды.Количество(), 0); 
				СтрТабПланирования.ПланНаСледПериод = СтрТабПланирования.ПланНаМесяц * ТаблицаПериоды.Количество();
				СтрТабПланирования.ПланНаМесяцКоличество = Окр(ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(), 0); 
				СтрТабПланирования.ПланНаСледПериодКоличество = ПланНаСледПериодКоличество;
				Если СегментНоменклатуры[0].Цена = 0 ИЛИ НЕ СтрТабПланирования.РучноеИзменение Тогда
					СтрТабПланирования.ПланНаМесяцЦена = ЦенаРозничная;
				Иначе
					СтрТабПланирования.ПланНаМесяцЦена = СегментНоменклатуры[0].Цена;
				КонецЕсли;	
			Иначе
				СтрТабПланирования.ПланНаКвартал = Окр(ПланНаСледПериод / ТаблицаПериоды.Количество(), 0); 
				СтрТабПланирования.ПланНаСледПериод = СтрТабПланирования.ПланНаКвартал * ТаблицаПериоды.Количество();
				СтрТабПланирования.ПланНаКварталКоличество = Окр(ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(), 0); 
				СтрТабПланирования.ПланНаСледПериодКоличество = ПланНаСледПериодКоличество;
				Если СегментНоменклатуры[0].Цена = 0 ИЛИ НЕ СтрТабПланирования.РучноеИзменение Тогда
					СтрТабПланирования.ПланНаКварталЦена = ЦенаРозничная * 3;
				Иначе	
					СтрТабПланирования.ПланНаКварталЦена = СегментНоменклатуры[0].Цена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		Если СтрТабПланирования.ПланНаСледПериодКоличество > 0 Тогда
			СтрТабПланирования.ПланНаСледПериодЦена = СтрТабПланирования.ПланНаСледПериод / СтрТабПланирования.ПланНаСледПериодКоличество;	
		КонецЕсли;
		
		СтрТабПланирования.ПроцентИзмененияПлана = ?(СтрТабПланирования.ИтогоЗаПредПериод = 0, 0,
			(ПланНаСледПериод - СтрТабПланирования.ИтогоЗаПредПериод) / СтрТабПланирования.ИтогоЗаПредПериод) * 100;
		
	КонецЦикла;
	
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПланированияФактом(МасМенеджер, НачалоПериода, ОкончаниеПериода)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер КАК Менеджер,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.смартДатаЗакрытияЗаказа, "+?(Объект.Периодичность=Перечисления.Периодичность.Месяц,"МЕСЯЦ","КВАРТАЛ")+") КАК ПериодФакта,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаФакт,
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер.Наименование КАК МенеджерНаименование
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И Менеджер В (&МасМенеджер) И 1 = 1) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.смартДатаЗакрытияЗаказа, "+?(Объект.Периодичность=Перечисления.Периодичность.Месяц,"МЕСЯЦ","КВАРТАЛ")+"),
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер,
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	МенеджерНаименование");
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("МасМенеджер",МасМенеджер);
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//МасНоменклатура = Справочники.CRM_ТипУслуги.ПолучитьМассивНоменклатурыПоТипу(Объект.ТипУслуги);
	МасНоменклатура = ПолучитьМассивНоменклатурыПоСегменту();
	//-- #Б-2220 смарт: Фролов 28.02.2025
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "АналитикаУчетаНоменклатуры.Номенклатура В (&МасНоменклатура)");
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрМенеджер Из МасМенеджер Цикл 
		
		СтрокиТабПланирования = ТабПланирования.НайтиСтроки(Новый Структура("Менеджер",СтрМенеджер));
		Если СтрокиТабПланирования.Количество() > 0 Тогда
			СтрТабПланирования = СтрокиТабПланирования[0];
		Иначе
			СтрТабПланирования = ТабПланирования.Добавить();
			СтрТабПланирования.Менеджер=СтрМенеджер;
		КонецЕсли;
		
		ИтогоЗаТекПериод = 0;
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрокиРез = Рез.НайтиСтроки(Новый Структура("Менеджер,ПериодФакта",СтрМенеджер,СтрТаблицаПериоды.ДатаНачала));
			Если СтрокиРез.Количество() > 0 Тогда
				СтрТабПланирования["КолонкаФакт_"+СтрТаблицаПериоды.ИмяКолонки] = СтрокиРез[0].СуммаФакт;	
				ИтогоЗаТекПериод = ИтогоЗаТекПериод+СтрокиРез[0].СуммаФакт;
			КонецЕсли;	
			
		КонецЦикла;
		
		СтрТабПланирования.ИтогоЗаТекПериод = ИтогоЗаТекПериод;
	КонецЦикла;
	
	ЗаполнитьДанныеПредыдущегоПериода(МасМенеджер,НачалоМесяца(ДобавитьМесяц(НачалоПериода,-1*(ТаблицаПериоды.Количество()))),КонецМесяца(ДобавитьМесяц(ОкончаниеПериода,-1*(ТаблицаПериоды.Количество()))));
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПланированияФактомПоПодразделениям(МасПодразделение, НачалоПериода, ОкончаниеПериода)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ПОМЕСТИТЬ ПодразделенияПодчиненные
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.смартПодразделениеДляПланирования В(&МасПодразделение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования
	|	КОНЕЦ КАК Подразделение,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.смартДатаЗакрытияЗаказа, "+?(Объект.Периодичность=Перечисления.Периодичность.Месяц,"МЕСЯЦ","КВАРТАЛ")+") КАК ПериодФакта,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаФакт,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.Наименование
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования.Наименование
	|	КОНЕЦ КАК ПодразделениеНаименование
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И 1 = 1
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер В ИЕРАРХИИ (&СмартГруппаКомпаний)
	|				И (Подразделение В (&МасПодразделение)
	|					ИЛИ Подразделение В
	|						(ВЫБРАТЬ
	|							ПодразделенияПодчиненные.Подразделение
	|						ИЗ
	|							ПодразделенияПодчиненные))) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.смартДатаЗакрытияЗаказа, "+?(Объект.Периодичность=Перечисления.Периодичность.Месяц,"МЕСЯЦ","КВАРТАЛ")+"),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.Наименование
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования.Наименование
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеНаименование");
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("МасПодразделение",МасПодразделение);
	Запрос.УстановитьПараметр("СмартГруппаКомпаний",ЭтаФорма.ПартнерыИсключения);
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//МасНоменклатура = Справочники.CRM_ТипУслуги.ПолучитьМассивНоменклатурыПоТипу(Объект.ТипУслуги);
	МасНоменклатура = ПолучитьМассивНоменклатурыПоСегменту();
	//-- #Б-2220 смарт: Фролов 28.02.2025
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "АналитикаУчетаНоменклатуры.Номенклатура В (&МасНоменклатура)");
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрПодразделение Из МасПодразделение Цикл 
		
		СтрокиТабПланирования = ТабПланирования.НайтиСтроки(Новый Структура("Подразделение",СтрПодразделение));
		Если СтрокиТабПланирования.Количество() > 0 Тогда
			СтрТабПланирования = СтрокиТабПланирования[0];
		Иначе
			СтрТабПланирования = ТабПланирования.Добавить();
			СтрТабПланирования.Подразделение=СтрПодразделение;
		КонецЕсли;
		
		ИтогоЗаТекПериод = 0;
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрокиРез = Рез.НайтиСтроки(Новый Структура("Подразделение,ПериодФакта",СтрПодразделение,СтрТаблицаПериоды.ДатаНачала));
			Если СтрокиРез.Количество() > 0 Тогда
				СтрТабПланирования["КолонкаФакт_"+СтрТаблицаПериоды.ИмяКолонки] = СтрокиРез[0].СуммаФакт;	
				ИтогоЗаТекПериод = ИтогоЗаТекПериод+СтрокиРез[0].СуммаФакт;
			КонецЕсли;	
			
		КонецЦикла;
		
		СтрТабПланирования.ИтогоЗаТекПериод = ИтогоЗаТекПериод;
	КонецЦикла;
	
	ЗаполнитьДанныеПредыдущегоПериодаПоПодразделениям(МасПодразделение,НачалоМесяца(ДобавитьМесяц(НачалоПериода,-1*(ТаблицаПериоды.Количество()))),КонецМесяца(ДобавитьМесяц(ОкончаниеПериода,-1*(ТаблицаПериоды.Количество()))));
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПланированияФактомПоСегментам(МассивСегментНоменклатуры, НачалоПериода, ОкончаниеПериода)
	
	ПериодичностьПлана = ?(Объект.Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сегмент КАК СегментНоменклатуры,
	|	Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НоменклатураСегментов
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента
	|ГДЕ
	|	Сегмент В(&МассивСегментНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСегментов.СегментНоменклатуры КАК СегментНоменклатуры,
	|	НАЧАЛОПЕРИОДА(ВыручкаОбороты.смартДатаЗакрытияЗаказа, " + ПериодичностьПлана + ") КАК ПериодФакта,
	|	СУММА(ВыручкаОбороты.КоличествоОборот) КАК КоличествоФакт,
	|	СУММА(ВыручкаОбороты.СуммаВыручкиОборот) КАК СуммаФакт
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер В ИЕРАРХИИ (&СмартГруппаКомпаний)
	|				И АналитикаУчетаНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ
	|						Номенклатура
	|					ИЗ
	|						НоменклатураСегментов)) КАК ВыручкаОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураСегментов КАК НоменклатураСегментов
	|		ПО ВыручкаОбороты.АналитикаУчетаНоменклатуры.Номенклатура = НоменклатураСегментов.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВыручкаОбороты.смартДатаЗакрытияЗаказа,  " + ПериодичностьПлана + "),
	|	НоменклатураСегментов.СегментНоменклатуры");
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
	Запрос.УстановитьПараметр("МассивСегментНоменклатуры", МассивСегментНоменклатуры);
	Запрос.УстановитьПараметр("СмартГруппаКомпаний", ЭтаФорма.ПартнерыИсключения);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ЭлементМассива Из МассивСегментНоменклатуры Цикл 
		
		СтрокиТабПланирования = ТабПланирования.НайтиСтроки(Новый Структура("СегментНоменклатуры", ЭлементМассива));
		Если СтрокиТабПланирования.Количество() > 0 Тогда
			СтрТабПланирования = СтрокиТабПланирования[0];
		Иначе
			СтрТабПланирования = ТабПланирования.Добавить();
			СтрТабПланирования.СегментНоменклатуры = ЭлементМассива;
		КонецЕсли;
		
		ИтогоЗаТекПериод = 0;
		ИтогоЗаТекПериодКоличество = 0;
		
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрокиРез = Таблица.НайтиСтроки(Новый Структура("СегментНоменклатуры, ПериодФакта", ЭлементМассива, СтрТаблицаПериоды.ДатаНачала));
			Если СтрокиРез.Количество() > 0 Тогда
				
				СтрТабПланирования["КолонкаФакт_" + СтрТаблицаПериоды.ИмяКолонки] = СтрокиРез[0].СуммаФакт;	
				ИтогоЗаТекПериод = ИтогоЗаТекПериод + СтрокиРез[0].СуммаФакт;
				
				СтрТабПланирования["КолонкаФактКоличество_" + СтрТаблицаПериоды.ИмяКолонки] = СтрокиРез[0].КоличествоФакт;	
				ИтогоЗаТекПериодКоличество = ИтогоЗаТекПериодКоличество + СтрокиРез[0].КоличествоФакт;
				
			КонецЕсли;	
			
		КонецЦикла;
		
		СтрТабПланирования.ИтогоЗаТекПериод = ИтогоЗаТекПериод;
		СтрТабПланирования.ИтогоЗаТекПериодКоличество = ИтогоЗаТекПериодКоличество;
		
	КонецЦикла;
	
	ЗаполнитьДанныеПредыдущегоПериодаПоСегментам(МассивСегментНоменклатуры, НачалоМесяца(ДобавитьМесяц(НачалоПериода, -1 * (ТаблицаПериоды.Количество()))),
		КонецМесяца(ДобавитьМесяц(ОкончаниеПериода, -1 * (ТаблицаПериоды.Количество()))));
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПредыдущегоПериода(МасМенеджер, НачалоПериода, ОкончаниеПериода)
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер КАК Менеджер,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаФакт,
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер.Наименование КАК МенеджерНаименование
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И Менеджер В (&МасМенеджер) И 1 = 1) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер,
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	МенеджерНаименование");
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("МасМенеджер",МасМенеджер);
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//МасНоменклатура = Справочники.CRM_ТипУслуги.ПолучитьМассивНоменклатурыПоТипу(Объект.ТипУслуги);
	МасНоменклатура = ПолучитьМассивНоменклатурыПоСегменту();
	//-- #Б-2220 смарт: Фролов 28.02.2025

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "АналитикаУчетаНоменклатуры.Номенклатура В (&МасНоменклатура)");
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрМенеджер Из МасМенеджер Цикл
		
		СтрокиТабПланирования = ТабПланирования.НайтиСтроки(Новый Структура("Менеджер",СтрМенеджер));
		Если СтрокиТабПланирования.Количество() > 0 Тогда
			СтрТабПланирования = СтрокиТабПланирования[0];
		Иначе
			СтрТабПланирования = ТабПланирования.Добавить();
			СтрТабПланирования.Менеджер = СтрМенеджер;
		КонецЕсли;
		
		СтрокиРез = Рез.НайтиСтроки(Новый Структура("Менеджер",СтрМенеджер));
		Если СтрокиРез.Количество() > 0 Тогда
			СтрТабПланирования.ИтогоЗаПредПериод = СтрокиРез[0].СуммаФакт;
		Иначе	
			СтрТабПланирования.ИтогоЗаПредПериод = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеПредПериод = ПредставлениеПериода(ДобавитьМесяц(НачалоМесяца(Объект.НачалоПериода), -12),
		ДобавитьМесяц(КонецМесяца(Объект.ОкончаниеПериода), -12), "ФП = Истина");
	Элементы.ТабПланированияИтогоЗаПредПериод.Заголовок = "Итого за " + ПредставлениеПредПериод;
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПредыдущегоПериодаПоПодразделениям(МасПодразделение, НачалоПериода, ОкончаниеПериода)
	
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ПОМЕСТИТЬ ПодразделенияПодчиненные
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.смартПодразделениеДляПланирования В(&МасПодразделение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования
	|	КОНЕЦ КАК Подразделение,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаФакт,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.Наименование
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования.Наименование
	|	КОНЕЦ КАК ПодразделениеНаименование
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И 1 = 1
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер В ИЕРАРХИИ (&СмартГруппаКомпаний)
	|				И (Подразделение В (&МасПодразделение)
	|					ИЛИ Подразделение В
	|						(ВЫБРАТЬ
	|							ПодразделенияПодчиненные.Подразделение
	|						ИЗ
	|							ПодразделенияПодчиненные))) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Подразделение.Наименование
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Подразделение.смартПодразделениеДляПланирования.Наименование
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеНаименование");
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("МасПодразделение",МасПодразделение);
	Запрос.УстановитьПараметр("СмартГруппаКомпаний",ЭтаФорма.ПартнерыИсключения);
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//МасНоменклатура = Справочники.CRM_ТипУслуги.ПолучитьМассивНоменклатурыПоТипу(Объект.ТипУслуги);
	МасНоменклатура = ПолучитьМассивНоменклатурыПоСегменту();
	//-- #Б-2220 смарт: Фролов 28.02.2025

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "АналитикаУчетаНоменклатуры.Номенклатура В (&МасНоменклатура)");
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрПодразделение Из МасПодразделение Цикл
		
		СтрокиТабПланирования = ТабПланирования.НайтиСтроки(Новый Структура("Подразделение",СтрПодразделение));
		Если СтрокиТабПланирования.Количество() > 0 Тогда
			СтрТабПланирования = СтрокиТабПланирования[0];
		Иначе
			СтрТабПланирования = ТабПланирования.Добавить();
			СтрТабПланирования.Подразделение = СтрПодразделение;
		КонецЕсли;
		
		СтрокиРез = Рез.НайтиСтроки(Новый Структура("Подразделение",СтрПодразделение));
		Если СтрокиРез.Количество() > 0 Тогда
			СтрТабПланирования.ИтогоЗаПредПериод = СтрокиРез[0].СуммаФакт;
		Иначе	
			СтрТабПланирования.ИтогоЗаПредПериод = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеПредПериод = ПредставлениеПериода(ДобавитьМесяц(НачалоМесяца(Объект.НачалоПериода),-12),ДобавитьМесяц(КонецМесяца(Объект.ОкончаниеПериода),-12),"ФП = Истина");
	Элементы.ТабПланированияИтогоЗаПредПериод.Заголовок = "Итого за "+ПредставлениеПредПериод;
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПредыдущегоПериодаПоСегментам(МассивСегментНоменклатуры, НачалоПериода, ОкончаниеПериода)
	
	Запрос=Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сегмент КАК СегментНоменклатуры,
	|	Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НоменклатураСегментов
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента
	|ГДЕ
	|	Сегмент В(&МассивСегментНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСегментов.СегментНоменклатуры КАК СегментНоменклатуры,
	|	СУММА(ВыручкаОбороты.КоличествоОборот) КАК КоличествоФакт,
	|	СУММА(ВыручкаОбороты.СуммаВыручкиОборот) КАК СуммаФакт
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			смартДатаЗакрытияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер В ИЕРАРХИИ (&СмартГруппаКомпаний)
	|				И АналитикаУчетаНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ
	|						Номенклатура
	|					ИЗ
	|						НоменклатураСегментов)) КАК ВыручкаОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураСегментов КАК НоменклатураСегментов
	|		ПО ВыручкаОбороты.АналитикаУчетаНоменклатуры.Номенклатура = НоменклатураСегментов.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураСегментов.СегментНоменклатуры");
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
	Запрос.УстановитьПараметр("МассивСегментНоменклатуры", МассивСегментНоменклатуры);
	Запрос.УстановитьПараметр("СмартГруппаКомпаний", ЭтаФорма.ПартнерыИсключения);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ЭлементМассива Из МассивСегментНоменклатуры Цикл
		
		СтрокиТабПланирования = ТабПланирования.НайтиСтроки(Новый Структура("СегментНоменклатуры", ЭлементМассива));
		Если СтрокиТабПланирования.Количество() > 0 Тогда
			СтрТабПланирования = СтрокиТабПланирования[0];
		Иначе
			СтрТабПланирования = ТабПланирования.Добавить();
			СтрТабПланирования.СегментНоменклатуры = ЭлементМассива;
		КонецЕсли;
		
		СтрокиРез = Таблица.НайтиСтроки(Новый Структура("СегментНоменклатуры", ЭлементМассива));
		Если СтрокиРез.Количество() > 0 Тогда
			
			СтрТабПланирования.ИтогоЗаПредПериод = СтрокиРез[0].СуммаФакт;
			СтрТабПланирования.ИтогоЗаПредПериодКоличество = СтрокиРез[0].КоличествоФакт;
			СтрТабПланирования.ИтогоЗаПредПериодЦена = СтрокиРез[0].СуммаФакт / ?(СтрокиРез[0].КоличествоФакт = 0, 1, СтрокиРез[0].КоличествоФакт);
			
		Иначе
			
			СтрТабПланирования.ИтогоЗаПредПериод = 0;
			СтрТабПланирования.ИтогоЗаПредПериодКоличество = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеПредПериод = ПредставлениеПериода(ДобавитьМесяц(НачалоМесяца(Объект.НачалоПериода), -12),
		ДобавитьМесяц(КонецМесяца(Объект.ОкончаниеПериода), -12), "ФП = Истина");
	Элементы.ТабПланированияИтогоЗаПредПериод.Заголовок = "Итого за " + ПредставлениеПредПериод;
	ЗаполнитьДанныеПодвалаНаСервере();
	
КонецПроцедуры

&НаСервере
//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
Функция ПолучитьМассивНоменклатурыПоСегменту()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента
	|ГДЕ
	|	Сегмент = &ТипУслуги");
	Запрос.УстановитьПараметр("ТипУслуги", Объект.ТипУслуги);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции //-- #Б-2220 смарт: Фролов 28.02.2025	

&НаКлиенте
Процедура КоэффициентИзмененияОбщийПриИзменении(Элемент)
	ЗаполнитьДанныеПланаПоПериодам();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПланаПоПериодам()
	
	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		
		ЗаполнитьТаблицуРозничныхЦенПоСегментам();
		
		Для Каждого Стр Из ТабПланирования Цикл 
			
			Если НЕ Стр.РучноеИзменение Тогда 
				
				СтрокиТаблицаРозничныхЦен = ТаблицаРозничныхЦен.НайтиСтроки(Новый Структура("СегментНоменклатуры", Стр.СегментНоменклатуры));
				
				Если СтрокиТаблицаРозничныхЦен.Количество() > 0 Тогда
					ЦенаРозничная = СтрокиТаблицаРозничныхЦен[0].ЦенаВЕВРО;
				Иначе
					ЦенаРозничная = 0;
				КонецЕсли;	
				
				Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
					
					НовыйНаКварталЦена = ЦенаРозничная * 3; 
					Если НовыйНаКварталЦена > Окр(НовыйНаКварталЦена, 0) Тогда
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена + 1, 0);
					Иначе
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена, 0);
					КонецЕсли;
					
					НовыйНаКварталКоличество = Стр.ИтогоЗаПредПериодКоличество * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
					Если НовыйНаКварталКоличество > Окр(НовыйНаКварталКоличество, 0) Тогда
						Стр.ПланНаКварталКоличество = Окр(НовыйНаКварталКоличество + 1, 0);
					Иначе
						Стр.ПланНаКварталКоличество = Окр(НовыйНаКварталКоличество, 0);
					КонецЕсли;
					
					Стр.ПланНаКвартал = Стр.ПланНаКварталЦена * Стр.ПланНаКварталКоличество;
					
				Иначе
					
					НовыйНаМесяцЦена = ЦенаРозничная;
					Если НовыйНаМесяцЦена > Окр(НовыйНаМесяцЦена, 0) Тогда
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена + 1, 0);
					Иначе
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена, 0);
					КонецЕсли;
					
					НовыйНаМесяцКоличество = Стр.ИтогоЗаПредПериодКоличество * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
					Если НовыйНаМесяцКоличество > Окр(НовыйНаМесяцКоличество, 0) Тогда
						Стр.ПланНаМесяцКоличество = Окр(НовыйНаМесяцКоличество + 1, 0);
					Иначе
						Стр.ПланНаМесяцКоличество = Окр(НовыйНаМесяцКоличество, 0);
					КонецЕсли;
					
					Стр.ПланНаМесяц = Стр.ПланНаМесяцЦена * Стр.ПланНаМесяцКоличество;
					
				КонецЕсли;
				
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность =
						ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКвартал, Стр.ПланНаМесяц);
					Стр["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки]=?(Объект.Периодичность =
						ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталКоличество, Стр.ПланНаМесяцКоличество);
				КонецЦикла;
				
				Стр.ПланНаСледПериод = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),
					Стр.ПланНаКвартал, Стр.ПланНаМесяц) * ТаблицаПериоды.Количество();	
				Стр.ПланНаСледПериодКоличество = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),
					Стр.ПланНаКварталКоличество, Стр.ПланНаМесяцКоличество) * ТаблицаПериоды.Количество();
				Стр.ПланНаСледПериодЦена = ?(Стр.ПланНаСледПериодКоличество > 0, Стр.ПланНаСледПериод / Стр.ПланНаСледПериодКоличество, 0);	
				
				Стр.ПроцентИзмененияПлана=?(Стр.ИтогоЗаПредПериод=0,0,(Стр.ПланНаСледПериод-Стр.ИтогоЗаПредПериод)/Стр.ИтогоЗаПредПериод)*100;
				
			ИначеЕсли Стр.ПланНаКварталЦена = 0 И Стр.ПланНаМесяцЦена = 0 Тогда
				
				Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
					
					НовыйНаКварталЦена = ?(Стр.ПланНаКварталЦена > 0, Стр.ПланНаКварталЦена, ЦенаРозничная * 3);
					Если НовыйНаКварталЦена > Окр(НовыйНаКварталЦена, 0) Тогда
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена + 1, 0);
					Иначе
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена, 0);
					КонецЕсли;
					
					Стр.ПланНаКвартал = Стр.ПланНаКварталЦена * Стр.ПланНаКварталКоличество;
					
				Иначе
					
					НовыйНаМесяцЦена = ?(Стр.ПланНаМесяцЦена > 0, Стр.ПланНаКварталЦена, ЦенаРозничная);
					Если НовыйНаМесяцЦена > Окр(НовыйНаМесяцЦена, 0) Тогда
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена + 1, 0);
					Иначе
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена, 0);
					КонецЕсли;
					
					Стр.ПланНаМесяц = Стр.ПланНаМесяцЦена * Стр.ПланНаМесяцКоличество;
					
				КонецЕсли;
				
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					
					Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность = 
						ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКвартал, Стр.ПланНаМесяц);
					
				КонецЦикла;
				
				Стр.ПланНаСледПериод = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКвартал, Стр.ПланНаМесяц) * ТаблицаПериоды.Количество();
				Стр.ПланНаСледПериодЦена = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталЦена, Стр.ПланНаМесяцЦена);
				Стр.ПроцентИзмененияПлана = ?(Стр.ИтогоЗаПредПериод=0, 0, (Стр.ПланНаСледПериод - Стр.ИтогоЗаПредПериод) / Стр.ИтогоЗаПредПериод) * 100;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе	
		
		Для Каждого Стр Из ТабПланирования Цикл 
			
			Если НЕ Стр.РучноеИзменение Тогда 
				
				Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
					
					НовыйНаКвартал = Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
					
					Если НовыйНаКвартал > Окр(НовыйНаКвартал, -3) Тогда
						Стр.ПланНаКвартал = Окр(НовыйНаКвартал + 500, -3);
					Иначе
						Стр.ПланНаКвартал = Окр(НовыйНаКвартал, -3);
					КонецЕсли;
					
				Иначе
					
					НовыйНаМесяц = Стр.ИтогоЗаПредПериод * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
					
					Если НовыйНаМесяц > Окр(НовыйНаМесяц, -3) Тогда
						Стр.ПланНаМесяц = Окр(НовыйНаМесяц + 500, -3);
					Иначе
						Стр.ПланНаМесяц = Окр(НовыйНаМесяц, -3);
					КонецЕсли;
					
				КонецЕсли;
				
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКвартал, Стр.ПланНаМесяц);
				КонецЦикла;
				
				Стр.ПланНаСледПериод = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),
					Стр.ПланНаКвартал, Стр.ПланНаМесяц) * ТаблицаПериоды.Количество();	
				
				Стр.ПроцентИзмененияПлана = ?(Стр.ИтогоЗаПредПериод = 0, 0, (Стр.ПланНаСледПериод - Стр.ИтогоЗаПредПериод) / Стр.ИтогоЗаПредПериод) * 100;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьДанныеПодвала();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаМесяцПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ПланНаМесяц = ТекущиеДанные.ПланНаМесяц;
	
	ТекущиеДанные.ПланНаСледПериод = ПланНаМесяц * ТаблицаПериоды.Количество();
	
	ТекущиеДанные.ПланНаСледПериодЦена = ?(ТекущиеДанные.ПланНаСледПериодКоличество > 0, 
		ТекущиеДанные.ПланНаСледПериод / ТекущиеДанные.ПланНаСледПериодКоличество, 0);
	
	ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
		(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
	ТекущиеДанные.РучноеИзменение = Истина; 

	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные.ПланНаМесяц;
	КонецЦикла;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаСледПериодПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
		
		ТекущиеДанные.ПланНаКвартал = Окр(ТекущиеДанные.ПланНаСледПериод / ТаблицаПериоды.Количество(), -3);
		ТабПланированияПланНаКварталПриИзменении(Элемент);
		
	Иначе
		
		ТекущиеДанные.ПланНаМесяц = Окр(ТекущиеДанные.ПланНаСледПериод / ТаблицаПериоды.Количество(), 0);
		ТабПланированияПланНаМесяцПриИзменении(Элемент);
		
	КонецЕсли;
	
	ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
		(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
		
	ТекущиеДанные.РучноеИзменение = Истина;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Планирование.Очистить();
	ТабПланирования.Сортировать("Менеджер Возр, Подразделение Возр, СегментНоменклатуры Возр");
	
	Для Каждого Стр Из ТабПланирования Цикл 
		
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			
			СтрПланирование = Объект.Планирование.Добавить();
			СтрПланирование.Менеджер = Стр.Менеджер;
			СтрПланирование.Подразделение = Стр.Подразделение;
			СтрПланирование.СегментНоменклатуры = Стр.СегментНоменклатуры;
			СтрПланирование.Период = СтрТаблицаПериоды.ДатаНачала;
			СтрПланирование.КоэффициентИзменения = ?(Стр.РучноеИзменение, ?(Стр.ИтогоЗаПредПериод > 0,
			Стр.ПланНаСледПериод / Стр.ИтогоЗаПредПериод, 0), Объект.КоэффициентИзмененияОбщий);
			СтрПланирование.РучноеИзменение = Стр.РучноеИзменение;
			СтрПланирование.Комментарий = Стр.Комментарий;
			СтрПланирование.НовыйПлан = Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки];
			
			Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
				СтрПланирование.НовыйПланКоличество = Стр["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки];
				Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
					СтрПланирование.Цена = Стр.ПланНаКварталЦена;
				Иначе	
					СтрПланирование.Цена = Стр.ПланНаМесяцЦена;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.ПартнерыИсключения.Очистить();
	Для Каждого СтрПартнерыИсключения Из ЭтаФорма.ПартнерыИсключения Цикл
		
		НоваяСтрока = Объект.ПартнерыИсключения.Добавить();
		НоваяСтрока.Партнер = СтрПартнерыИсключения.Значение;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияРучноеИзменениеПриИзменении(Элемент) 
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если НЕ Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		
		Если НЕ ТекущиеДанные.РучноеИзменение Тогда
			
			Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				
				НовыйНаКвартал = ТекущиеДанные.ИтогоЗаПредПериод * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
				
				Если НовыйНаКвартал > Окр(НовыйНаКвартал, -3) ТОгда
					ТекущиеДанные.ПланНаКвартал = Окр(НовыйНаКвартал + 500, -3);
				Иначе
					ТекущиеДанные.ПланНаКвартал = Окр(НовыйНаКвартал, -3);
				КонецЕсли;
				
				//Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
				//	
				//	НовыйНаКварталЦена = ПолучитьРозничнуюЦенуПоСегменту(ТекущиеДанные.СегментНоменклатуры) * 3; 
				//	Если НовыйНаКварталЦена > Окр(НовыйНаКварталЦена, 0) Тогда
				//		ТекущиеДанные.ПланНаКварталЦена = Окр(НовыйНаКварталЦена + 1, 0);
				//	Иначе
				//		ТекущиеДанные.ПланНаКварталЦена = Окр(НовыйНаКварталЦена, 0);
				//	КонецЕсли;
				//	
				//	НовыйНаКварталКоличество = ТекущиеДанные.ИтогоЗаПредПериодКоличество * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
				//	Если НовыйНаКварталКоличество > Окр(НовыйНаКварталКоличество, 0) Тогда
				//		ТекущиеДанные.ПланНаКварталКоличество = Окр(НовыйНаКварталКоличество + 1, 0);
				//	Иначе
				//		ТекущиеДанные.ПланНаКварталКоличество = Окр(НовыйНаКварталКоличество, 0);
				//	КонецЕсли;
				//	
				//	ТекущиеДанные.ПланНаКвартал = ТекущиеДанные.ПланНаКварталЦена * ТекущиеДанные.ПланНаКварталКоличество;
				//	ТекущиеДанные.ПланНаСледПериодКоличество = ТекущиеДанные.ПланНаКварталКоличество * ТаблицаПериоды.Количество();
				//		
				//КонецЕсли;		
				
			Иначе
				
				НовыйНаМесяц = ТекущиеДанные.ИтогоЗаПредПериод * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
				Если НовыйНаМесяц > Окр(НовыйНаМесяц, -3) ТОгда
					ТекущиеДанные.ПланНаМесяц = Окр(НовыйНаМесяц + 500, -3);
				Иначе
					ТекущиеДанные.ПланНаМесяц = Окр(НовыйНаМесяц, -3);
				КонецЕсли;
				
				//Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
				//	
				//	НовыйНаМесяцЦена = ПолучитьРозничнуюЦенуПоСегменту(ТекущиеДанные.СегментНоменклатуры);
				//	Если НовыйНаМесяцЦена > Окр(НовыйНаМесяцЦена, 0) Тогда
				//		ТекущиеДанные.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена + 1, 0);
				//	Иначе
				//		ТекущиеДанные.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена, 0);
				//	КонецЕсли;
				//	
				//	НовыйНаМесяцКоличество = ТекущиеДанные.ИтогоЗаПредПериодКоличество * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
				//	Если НовыйНаМесяцКоличество > Окр(НовыйНаМесяцКоличество, 0) Тогда
				//		ТекущиеДанные.ПланНаМесяцКоличество = Окр(НовыйНаМесяцКоличество + 1, 0);
				//	Иначе
				//		ТекущиеДанные.ПланНаМесяцКоличество = Окр(НовыйНаМесяцКоличество, 0);
				//	КонецЕсли;
				//	
				//	ТекущиеДанные.ПланНаМесяц = ТекущиеДанные.ПланНаМесяцЦена * ТекущиеДанные.ПланНаМесяцКоличество;
				//	ТекущиеДанные.ПланНаСледПериодКоличество = ТекущиеДанные.ПланНаМесяцКоличество * ТаблицаПериоды.Количество();	
				//		
				//КонецЕсли;		
				
			КонецЕсли;
			
			ТекущиеДанные.ПланНаСледПериод = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),
			ТекущиеДанные.ПланНаКвартал, ТекущиеДанные.ПланНаМесяц) * ТаблицаПериоды.Количество();
			
			//Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда	
			
			//	ТекущиеДанные.ПланНаСледПериодЦена = ?(ТекущиеДанные.ПланНаСледПериодКоличество > 0, 
			//		ТекущиеДанные.ПланНаСледПериод / ТекущиеДанные.ПланНаСледПериодКоличество, 0);
			//		
			//КонецЕсли;	
			
			ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
			(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
			
			Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
				
				ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность = 
				ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), ТекущиеДанные.ПланНаКвартал, ТекущиеДанные.ПланНаМесяц);
				
				//Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
				//	
				//	ТекущиеДанные["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность = 
				//		ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), ТекущиеДанные.ПланНаКварталКоличество, ТекущиеДанные.ПланНаМесяцКоличество);
				//	
				//КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияМесяцПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекущиеДанные.РучноеИзменение = Истина;
	ТекущиеДанные.ПланНаСледПериод = 0;
	
	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		ТекущиеДанные.ПланНаСледПериод = ТекущиеДанные.ПланНаСледПериод + ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки];
	КонецЦикла;
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
		ТекущиеДанные.ПланНаКвартал = Окр(ТекущиеДанные.ПланНаСледПериод / ТаблицаПериоды.Количество(), 0);
	Иначе	
		ТекущиеДанные.ПланНаМесяц = Окр(ТекущиеДанные.ПланНаСледПериод / ТаблицаПериоды.Количество(), 0);
	КонецЕсли;
	
	ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
		(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияМесяцКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекущиеДанные.РучноеИзменение = Истина;
	ТекущиеДанные.ПланНаСледПериодКоличество = 0;
	ТекущиеДанные.ПланНаСледПериод = 0;
	
	
	
	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		
		ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные["КолонкаПланКоличество_" + 
			СтрТаблицаПериоды.ИмяКолонки] *	?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), 
			ТекущиеДанные.ПланНаКварталЦена, ТекущиеДанные.ПланНаМесяцЦена);
		
		ТекущиеДанные.ПланНаСледПериодКоличество = ТекущиеДанные.ПланНаСледПериодКоличество + ТекущиеДанные["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки];
		ТекущиеДанные.ПланНаСледПериод = ТекущиеДанные.ПланНаСледПериод + ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки];
		
	КонецЦикла;
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ТекущиеДанные.ПланНаКварталКоличество = Окр(ТекущиеДанные.ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(),0);
		ТекущиеДанные.ПланНаКвартал = ТекущиеДанные.ПланНаКварталКоличество * ТекущиеДанные.ПланНаКварталЦена;
	Иначе	
		ТекущиеДанные.ПланНаМесяцКоличество = Окр(ТекущиеДанные.ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(),0);
		ТекущиеДанные.ПланНаМесяц = ТекущиеДанные.ПланНаМесяцКоличество * ТекущиеДанные.ПланНаМесяцЦена;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборМенеджеров(Команда)
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ЭлементПользовательскойНастройки", Ложь);
	ПараметрыОбработчика.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыОбработчика.Вставить("ИмяЭлемента", Элементы.ТабПланирования.Имя);
	ПараметрыОбработчика.Вставить("ТипВыбора", "Менеджер");
	
	Обработчик = Новый ОписаниеОповещения("смартЗавершитьВыборИзСписка", ЭтотОбъект, ПараметрыОбработчика);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));	
	
	ПараметрыОткрытия = Новый Структура;
	//ПараметрыОткрытия.Вставить("Отмеченные", ОтмеченныеЗначения);
	ПараметрыОткрытия.Вставить("ОписаниеТипов", Новый ОписаниеТипов(МассивТипов));
	ПараметрыОткрытия.Вставить("ЗначенияДляВыбораЗаполнены", Ложь);
	ПараметрыОткрытия.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыОткрытия.Вставить("Представление", "Подбор менеджеров");
	ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Массив());
	ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыОткрытия.Вставить("БыстрыйВыбор", Ложь);
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыОткрытия, ЭтотОбъект,,,, Обработчик);
КонецПроцедуры

&НаКлиенте
Процедура смартЗавершитьВыборИзСписка(Список, ПараметрыВыбора) Экспорт
	Если ТипЗнч(Список) = Тип("Массив") Тогда
		ВыбранныеЗначения = Список;
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранныеЗначения);
		Список.ЗаполнитьПометки(Истина);
	ИначеЕсли ТипЗнч(Список) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавленыМенеджеры = Ложь;	
	ДобавленыПодразделения = Ложь;
	ДобавленыСегменты = Ложь;
	
	Если ПараметрыВыбора.ТипВыбора = "Менеджер" Тогда
		
		Для Каждого ЭлементСписка Из Список Цикл
			СтрокиТабПланирования=ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("Менеджер",ЭлементСписка.Значение));
			Если СтрокиТабПланирования.Количество()>0 ТОгда
				ОбщегоназначенияКлиент.СообщитьПользователю("Менеджер "+ЭлементСписка.Значение+" уже присутствет в таблице");
				Продолжить;
			КонецЕсли;	
			СтрТабПланирования=ТабПланирования.Добавить();	
			СтрТабПланирования.Менеджер=ЭлементСписка.Значение;
			ЭтаФорма.Модифицированность=Истина;
			ДобавленыМенеджеры=Истина;
		КонецЦикла;

	ИначеЕсли ПараметрыВыбора.ТипВыбора = "СегментНоменклатуры" Тогда
		
		Для Каждого ЭлементСписка Из Список Цикл
			
			Если НЕ ЭлементСписка.Пометка Тогда
				Продолжить;
			КонецЕсли;	
			
			СтрокиТабПланирования = ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("СегментНоменклатуры", ЭлементСписка.Значение));
			Если СтрокиТабПланирования.Количество() > 0 Тогда
				ОбщегоназначенияКлиент.СообщитьПользователю("Сегмент номенклатуры " + ЭлементСписка.Значение + " уже присутствет в таблице");
				Продолжить;
			КонецЕсли;
			
			СтрТабПланирования = ТабПланирования.Добавить();	
			СтрТабПланирования.СегментНоменклатуры = ЭлементСписка.Значение;
			ЭтаФорма.Модифицированность = Истина;
			ДобавленыСегменты = Истина;
			
		КонецЦикла;

	Иначе
		
		Для Каждого ЭлементСписка Из Список Цикл
			СтрокиТабПланирования=ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("Подразделение",ЭлементСписка.Значение));
			Если СтрокиТабПланирования.Количество()>0 ТОгда
				ОбщегоназначенияКлиент.СообщитьПользователю("Подразделение "+ЭлементСписка.Значение+" уже присутствет в таблице");
				Продолжить;
			КонецЕсли;	
			СтрТабПланирования=ТабПланирования.Добавить();	
			СтрТабПланирования.Подразделение=ЭлементСписка.Значение;
			ЭтаФорма.Модифицированность=Истина;
			ДобавленыПодразделения=Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДобавленыПодразделения ИЛИ ДобавленыМенеджеры ИЛИ ДобавленыСегменты Тогда
		Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
			ОбновитьДанныеВТаблице();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры 	
	
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Если ИсточникВыбора.Заголовок="Подбор менеджеров" Тогда
	//	СтрокиТабПланирования=ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("Менеджер",ВыбранноеЗначение));
	//	Если СтрокиТабПланирования.Количество()=0 Тогда
	//		СтрТабПланирования=ТабПланирования.Добавить();	
	//		СтрТабПланирования.Менеджер=ВыбранноеЗначение;
	//		ЭтаФорма.Модифицированность=Истина;
	//	КонецЕсли;
	//ИначеЕсли ИсточникВыбора.Заголовок="Подбор подразделений" Тогда	
	//	СтрокиТабПланирования=ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("Подразделение",ВыбранноеЗначение));
	//	Если СтрокиТабПланирования.Количество()=0 Тогда
	//		СтрТабПланирования=ТабПланирования.Добавить();	
	//		СтрТабПланирования.Подразделение=ВыбранноеЗначение;
	//		ЭтаФорма.Модифицированность=Истина;
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДаннымиПредыдущегоПериода(Команда)
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) ТОгда 
		Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоПодразделениям") Тогда
			ЗаполнитьТаблицуПланированияФактомПоПодразделениям(ПолучитьСписокМенеджеров(),ДобавитьМесяц(Объект.НачалоПериода,-12),ДобавитьМесяц(Объект.ОкончаниеПериода,-12)); 
		Иначе	
			ЗаполнитьТаблицуПланированияФактом(ПолучитьСписокМенеджеров(),ДобавитьМесяц(Объект.НачалоПериода,-12),ДобавитьМесяц(Объект.ОкончаниеПериода,-12)); 
		КонецЕсли;
	Иначе	
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните период планирования!",,"Объект.ПериодУстановкиПлана");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМенеджеров()
	МасМенеджер=ЭтаФорма.ТабПланирования.Выгрузить(,"Менеджер").ВыгрузитьКолонку("Менеджер");
	МасМенеджер=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасМенеджер);
	Возврат МасМенеджер;
КонецФункции

&НаСервере
Функция ПолучитьСписокПодразделений()
	МасПодразделение=ЭтаФорма.ТабПланирования.Выгрузить(,"Подразделение").ВыгрузитьКолонку("Подразделение");
	МасПодразделение=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПодразделение);
	Возврат МасПодразделение;
КонецФункции 

&НаСервере
Функция ПолучитьСписокСегментовНоменклатуры()
	МасивСегментНоменклатуры = ЭтаФорма.ТабПланирования.Выгрузить( , "СегментНоменклатуры").ВыгрузитьКолонку("СегментНоменклатуры");
	МасивСегментНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасивСегментНоменклатуры);
	Возврат МасивСегментНоменклатуры;
КонецФункции

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	Оповещение = Новый ОписаниеОповещения(
		"УстановитьИнтервалЗавершение",
		ЭтотОбъект);
		
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(
		Объект, 
		Новый Структура("ДатаНачала, ДатаОкончания", "НачалоПериода", "ОкончаниеПериода"),
		Оповещение);
КонецПроцедуры 
	
&НаКлиенте
Процедура УстановитьИнтервалЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период=Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ПриИзмененииПериодовНаСервере();
	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоПодразделениям") Тогда
		ЗаполнитьТаблицуПланированияФактомПоПодразделениям(ПолучитьСписокПодразделений(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоПодразделениям();
	ИначеЕсли Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		ЗаполнитьТаблицуПланированияФактомПоСегментам(ПолучитьСписокСегментовНоменклатуры(), Объект.НачалоПериода, Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоСегментам();
	Иначе	
		ЗаполнитьТаблицуПланированияФактом(ПолучитьСписокМенеджеров(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланом();
	КонецЕсли;
	ЗаполнитьДанныеПланаПоПериодам();
	ВывестиДекорациюПериод();
	ЗаполнитьДанныеПодвала();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры 

&НаСервере
Процедура ПриИзмененииПериодовНаСервере(КорректироватьНачалоОкончаниеПериода = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого Стр Из ЭтаФорма.ТаблицаПериоды Цикл
		Стр.Замещен=Истина;
	КонецЦикла;	
	
	ДобавлениеДатаНачала = ПланированиеКлиентСерверПовтИсп.РассчитатьДатуНачалаПериода(Объект.НачалоПериода, Объект.Периодичность);
	ДобавлениеДатаОкончания = ПланированиеКлиентСерверПовтИсп.РассчитатьДатуОкончанияПериода(ДобавлениеДатаНачала, Объект.Периодичность);
	
	ТекущийПериод = 1;
	
	Пока ДобавлениеДатаНачала < КонецДня(Объект.ОкончаниеПериода) Цикл
		
		НайденныеСтроки = ТаблицаПериоды.НайтиСтроки(Новый Структура("ДатаНачала, ДатаОкончания", ДобавлениеДатаНачала, ДобавлениеДатаОкончания));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаПериоды.Добавить();
			НоваяСтрока.ИмяКолонки = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Замещен=Ложь;
		КонецЕсли;
		НоваяСтрока.ДатаНачала = ДобавлениеДатаНачала;
		НоваяСтрока.ДатаОкончания = ДобавлениеДатаОкончания;
		
		НоваяСтрока.Заголовок = ПланированиеКлиентСервер.СформироватьЗаголовокПериода(Объект.Периодичность, ДобавлениеДатаНачала, ДобавлениеДатаОкончания, ложь, Ложь);
		
		ДобавлениеДатаНачала = ПланированиеКлиентСерверПовтИсп.РассчитатьДатуНачалаПериода(ДобавлениеДатаОкончания+1 , Объект.Периодичность);
		ДобавлениеДатаОкончания = ПланированиеКлиентСерверПовтИсп.РассчитатьДатуОкончанияПериода(ДобавлениеДатаОкончания+1, Объект.Периодичность);
		
	КонецЦикла;
	УбратьДобавитьКолонкиВТабПланирования();
КонецПроцедуры

&НаСервере
Процедура УбратьДобавитьКолонкиВТабПланирования()
	
	КолонкиДобавляемые = Новый Массив;
	КолонкиУдаляемые = Новый Массив;
	
	Если Объект.ВидПлана = Перечисления.смартВидПлана.ПоСегментамНоменклатуры Тогда
		ЭтоПланПоСегментам = Истина;	
	Иначе		
		ЭтоПланПоСегментам = Ложь;	
	КонецЕсли;	
		
	Для Каждого Стр Из ЭтаФорма.ТаблицаПериоды Цикл 
		
		Если Стр.Замещен Тогда
			
			КолонкиУдаляемые.Добавить("ТабПланирования." + "КолонкаПлан_" + Стр.ИмяКолонки);
			КолонкиУдаляемые.Добавить("ТабПланирования." + "КолонкаФакт_" + Стр.ИмяКолонки);
			
			Если НЕ ЭтаФорма.Элементы.Найти("КолонкаПланКоличество_" + Стр.ИмяКолонки) = Неопределено Тогда
				КолонкиУдаляемые.Добавить("ТабПланирования." + "КолонкаПланКоличество_" + Стр.ИмяКолонки);
				КолонкиУдаляемые.Добавить("ТабПланирования." + "КолонкаФактКоличество_" + Стр.ИмяКолонки);
			КонецЕсли;	
			
		Иначе	
			
			Если ЭтаФорма.Элементы.Найти("КолонкаПлан_" + Стр.ИмяКолонки) = Неопределено ТОгда
				
				КолонкиДобавляемые.Добавить(Новый РеквизитФормы("КолонкаПлан_" + Стр.ИмяКолонки,
					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)), "ТабПланирования", Стр.Заголовок));
				КолонкиДобавляемые.Добавить(Новый РеквизитФормы("КолонкаФакт_" + Стр.ИмяКолонки,
					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)), "ТабПланирования" ,Стр.Заголовок));
				
				Если ЭтоПланПоСегментам Тогда
					КолонкиДобавляемые.Добавить(Новый РеквизитФормы("КолонкаПланКоличество_" + Стр.ИмяКолонки,
						Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)), "ТабПланирования", Стр.Заголовок));
					КолонкиДобавляемые.Добавить(Новый РеквизитФормы("КолонкаФактКоличество_" + Стр.ИмяКолонки,
						Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)), "ТабПланирования", Стр.Заголовок));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	ИзменитьРеквизиты(КолонкиДобавляемые, КолонкиУдаляемые);
	
	МасУдаляемых=ЭтаФорма.ТаблицаПериоды.НайтиСтроки(Новый Структура("Замещен", Истина));
	
	Для Каждого СтрУдаляемых Из МасУдаляемых Цикл
		
		Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("План_" + СтрУдаляемых.ИмяКолонки));
		Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("Факт_" + СтрУдаляемых.ИмяКолонки));
		
		Если НЕ ЭтаФорма.Элементы.Найти("ПланКоличество_" + Стр.ИмяКолонки) = Неопределено Тогда
			
			Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("ПланКоличество_" + СтрУдаляемых.ИмяКолонки));
			Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("ФактКоличество_" + СтрУдаляемых.ИмяКолонки));
			Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("ГруппаПлан_" + СтрУдаляемых.ИмяКолонки));
			Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("ГруппаФакт_" + СтрУдаляемых.ИмяКолонки));
			
		КонецЕсли;
		
		Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("Группа_" + СтрУдаляемых.ИмяКолонки));
		
		ЭтаФорма.ТаблицаПериоды.Удалить(СтрУдаляемых);
		
	КонецЦикла;
	
	Для Каждого Стр Из ЭтаФорма.ТаблицаПериоды Цикл
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("Группа_" + Стр.ИмяКолонки, Тип("ГруппаФормы"),
			ЭтаФорма.Элементы.ТабПланирования, Элементы.ТабПланированияГруппаИтогоЗаТекПериод);
		НовыйЭлемент.Вид = ВидГруппыФормы.ГруппаКолонок;
		НовыйЭлемент.Заголовок = Стр.Заголовок; 
		НовыйЭлемент.Группировка = ГруппировкаКолонок.Горизонтальная;
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ОтображатьВШапке = Истина;
		
		Если ЭтоПланПоСегментам Тогда
			
			ДобавленныйПериодПлан=Элементы.Добавить("ГруппаПлан_" + Стр.ИмяКолонки, Тип("ГруппаФормы"), ЭтаФорма.Элементы.Найти("Группа_" + Стр.ИмяКолонки));
			ДобавленныйПериодПлан.Вид = ВидГруппыФормы.ГруппаКолонок;
			ДобавленныйПериодПлан.Заголовок = "План"; 
			ДобавленныйПериодПлан.Группировка = ГруппировкаКолонок.Горизонтальная;
			ДобавленныйПериодПлан.Видимость = Истина;
			ДобавленныйПериодПлан.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериодПлан.ОтображатьВШапке = Истина;
			
			ДобавленныйПериодПлан=Элементы.Добавить("ПланКоличество_" + Стр.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("ГруппаПлан_" + Стр.ИмяКолонки));
			ДобавленныйПериодПлан.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйПериодПлан.Заголовок = "Кол."; 
			ДобавленныйПериодПлан.ПутьКДанным = "ТабПланирования" + "." + "КолонкаПланКоличество_" + Стр.ИмяКолонки;
			ДобавленныйПериодПлан.КнопкаВыбора = Истина;
			ДобавленныйПериодПлан.Видимость = Истина;
			ДобавленныйПериодПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйПериодПлан.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериодПлан.УстановитьДействие("ПриИзменении", "ТабПланированияМесяцКоличествоПриИзменении");
			
			ДобавленныйПериодПлан = Элементы.Добавить("План_" + Стр.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("ГруппаПлан_" + Стр.ИмяКолонки));
			ДобавленныйПериодПлан.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйПериодПлан.Заголовок = "Сумма"; 
			ДобавленныйПериодПлан.ПутьКДанным = "ТабПланирования" + "." + "КолонкаПлан_" + Стр.ИмяКолонки;
			ДобавленныйПериодПлан.КнопкаВыбора = Истина;
			ДобавленныйПериодПлан.Видимость = Истина;
			ДобавленныйПериодПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйПериодПлан.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериодПлан.УстановитьДействие("ПриИзменении", "ТабПланированияМесяцПриИзменении");
			
			ДобавленныйПериодФакт = Элементы.Добавить("ГруппаФакт_" + Стр.ИмяКолонки, Тип("ГруппаФормы"), ЭтаФорма.Элементы.Найти("Группа_" + Стр.ИмяКолонки));
			ДобавленныйПериодФакт.Вид = ВидГруппыФормы.ГруппаКолонок;
			ДобавленныйПериодФакт.Заголовок = "Факт"; 
			ДобавленныйПериодФакт.Группировка = ГруппировкаКолонок.Горизонтальная;
			ДобавленныйПериодФакт.Видимость = Истина;
			ДобавленныйПериодФакт.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериодФакт.ОтображатьВШапке = Истина;
			
			ДобавленныйПериодФакт = Элементы.Добавить("ФактКоличество_" + Стр.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("ГруппаФакт_" + Стр.ИмяКолонки));
			ДобавленныйПериодФакт.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйПериодФакт.Заголовок = "Кол."; 
			ДобавленныйПериодФакт.ПутьКДанным = "ТабПланирования" + "." + "КолонкаФактКоличество_" + Стр.ИмяКолонки;
			ДобавленныйПериодФакт.Видимость = Истина;
			ДобавленныйПериодФакт.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйПериодФакт.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериодФакт.ЦветФона = Новый Цвет(248, 242, 216);
			ДобавленныйПериодФакт.ТолькоПросмотр = Истина;
			
			ДобавленныйПериодФакт=Элементы.Добавить("Факт_" + Стр.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("ГруппаФакт_" + Стр.ИмяКолонки));
			ДобавленныйПериодФакт.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйПериодФакт.Заголовок = "Сумма"; 
			ДобавленныйПериодФакт.ПутьКДанным = "ТабПланирования" + "." + "КолонкаФакт_" + Стр.ИмяКолонки;
			ДобавленныйПериодФакт.Видимость = Истина;
			ДобавленныйПериодФакт.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйПериодФакт.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериодФакт.ЦветФона =Новый Цвет(248, 242, 216);
			ДобавленныйПериодФакт.ТолькоПросмотр = Истина;
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Факт_" + Стр.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаФакт_" + Стр.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаПлан_" + Стр.ИмяКолонки);
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 70));
			ЭлементОформления.Использование = Истина;  
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Факт_" + Стр.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаФакт_" + Стр.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаПлан_" + Стр.ИмяКолонки);
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 0, 0));
			ЭлементОформления.Использование = Истина;
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ФактКоличество_" + Стр.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаФактКоличество_" + Стр.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаПланКоличество_" + Стр.ИмяКолонки);
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 70));
			ЭлементОформления.Использование = Истина;  
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ФактКоличество_" + Стр.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаФактКоличество_" + Стр.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаПланКоличество_" + Стр.ИмяКолонки);
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 0, 0));
			ЭлементОформления.Использование = Истина;
			
		Иначе
			
			ДобавленныйПериод = Элементы.Добавить("План_" + Стр.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("Группа_" + Стр.ИмяКолонки));
			ДобавленныйПериод.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйПериод.Заголовок = "План"; 
			ДобавленныйПериод.ПутьКДанным = "ТабПланирования" + "." + "КолонкаПлан_" + Стр.ИмяКолонки;
			ДобавленныйПериод.КнопкаВыбора = Истина;
			ДобавленныйПериод.Видимость = Истина;
			ДобавленныйПериод.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйПериод.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериод.УстановитьДействие("ПриИзменении", "ТабПланированияМесяцПриИзменении");
			
			ДобавленныйПериод=Элементы.Добавить("Факт_" + Стр.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("Группа_" + Стр.ИмяКолонки));
			ДобавленныйПериод.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйПериод.Заголовок = "Факт"; 
			ДобавленныйПериод.ПутьКДанным = "ТабПланирования" + "." + "КолонкаФакт_" + Стр.ИмяКолонки;
			ДобавленныйПериод.Видимость = Истина;
			ДобавленныйПериод.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйПериод.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйПериод.ЦветФона = Новый Цвет(248, 242, 216);
			ДобавленныйПериод.ТолькоПросмотр = Истина;  
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Факт_" + Стр.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаФакт_" + Стр.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаПлан_" + Стр.ИмяКолонки);
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 70));
			ЭлементОформления.Использование = Истина;  
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Факт_" + Стр.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаФакт_" + Стр.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТабПланирования." + "КолонкаПлан_" + Стр.ИмяКолонки);
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 0, 0));
			ЭлементОформления.Использование = Истина; 
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	ПриИзмененииПериодовНаСервере();
	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоПодразделениям") Тогда
		ЗаполнитьТаблицуПланированияФактомПоПодразделениям(ПолучитьСписокПодразделений(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоПодразделениям();
		ЗаполнитьДанныеПланаПоПериодам();
	ИначеЕсли Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		ЗаполнитьТаблицуПланированияФактомПоСегментам(ПолучитьСписокСегментовНоменклатуры(), Объект.НачалоПериода, Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоСегментам();
	Иначе	
		ЗаполнитьТаблицуПланированияФактом(ПолучитьСписокМенеджеров(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланом();
		ЗаполнитьДанныеПланаПоПериодам();
	КонецЕсли;
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		Элементы.ТабПланированияГруппаПланНаКвартал.Видимость = Ложь;
		Элементы.ТабПланированияГруппаПланНаМесяц.Видимость = Истина;
	Иначе
		Элементы.ТабПланированияГруппаПланНаКвартал.Видимость = Истина;
		Элементы.ТабПланированияГруппаПланНаМесяц.Видимость = Ложь;
	КонецЕсли;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаКварталПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ПланНаКвартал = ТекущиеДанные.ПланНаКвартал;
	
	ТекущиеДанные.ПланНаСледПериод = ПланНаКвартал * ТаблицаПериоды.Количество();
	
	ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
		(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
	ТекущиеДанные.РучноеИзменение=Истина; 

	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		ТекущиеДанные["КолонкаПлан_"+СтрТаблицаПериоды.ИмяКолонки]=ТекущиеДанные.ПланНаКвартал;
	КонецЦикла;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
		ОбновитьДанныеВТаблице();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВТаблице()
	
	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоПодразделениям") Тогда
		
		ЗаполнитьТаблицуПланированияФактомПоПодразделениям(ПолучитьСписокПодразделений(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоПодразделениям();
		Для Каждого Стр Из ТабПланирования Цикл 
			Если НЕ Стр.РучноеИзменение ТОгда 
				Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
					НовыйНаКвартал=Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий/ТаблицаПериоды.Количество();
					Если НовыйНаКвартал>Окр(НовыйНаКвартал,-3) ТОгда
						Стр.ПланНаКвартал=Окр(НовыйНаКвартал+500,-3);
					Иначе
						Стр.ПланНаКвартал=Окр(НовыйНаКвартал,-3);
					КонецЕсли;	
				Иначе
					НовыйНаМесяц=Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий/ТаблицаПериоды.Количество();
					Если НовыйНаМесяц>Окр(НовыйНаМесяц,-3) ТОгда
						Стр.ПланНаМесяц=Окр(НовыйНаМесяц+500,-3);
					Иначе
						Стр.ПланНаМесяц=Окр(НовыйНаМесяц,-3);
					КонецЕсли;	
				КонецЕсли;
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					Стр["КолонкаПлан_"+СтрТаблицаПериоды.ИмяКолонки]=?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),Стр.ПланНаКвартал,Стр.ПланНаМесяц);
				КонецЦикла;
				Стр.ПланНаСледПериод=?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),Стр.ПланНаКвартал,Стр.ПланНаМесяц)*ТаблицаПериоды.Количество();
				Стр.ПроцентИзмененияПлана=?(Стр.ИтогоЗаПредПериод=0,0,(Стр.ПланНаСледПериод-Стр.ИтогоЗаПредПериод)/Стр.ИтогоЗаПредПериод)*100;
			КонецЕсли;
		КонецЦикла;	
		ЗаполнитьДанныеПодвала();
		
	ИначеЕсли Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		
		ЗаполнитьТаблицуПланированияФактомПоСегментам(ПолучитьСписокСегментовНоменклатуры(), Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
		//ЗаполнитьТаблицуПланированияПланомПоСегментам();
		
		ЗаполнитьТаблицуРозничныхЦенПоСегментам();
		
		Для Каждого Стр Из ТабПланирования Цикл 
			
			СтрокиТаблицаРозничныхЦен = ТаблицаРозничныхЦен.НайтиСтроки(Новый Структура("СегментНоменклатуры", Стр.СегментНоменклатуры));
			
			Если СтрокиТаблицаРозничныхЦен.Количество() > 0 Тогда
				ЦенаРозничная = СтрокиТаблицаРозничныхЦен[0].ЦенаВЕВРО;
			Иначе
				ЦенаРозничная = 0;
			КонецЕсли;	
			
			Если НЕ Стр.РучноеИзменение Тогда 
				
				Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
					
					НовыйНаКварталЦена = ЦенаРозничная * 3; 
					Если НовыйНаКварталЦена > Окр(НовыйНаКварталЦена, 0) Тогда
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена + 1, 0);
					Иначе
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена, 0);
					КонецЕсли;
					
					НовыйНаКварталКоличество = Стр.ИтогоЗаПредПериодКоличество * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
					Если НовыйНаКварталКоличество > Окр(НовыйНаКварталКоличество, 0) Тогда
						Стр.ПланНаКварталКоличество = Окр(НовыйНаКварталКоличество + 1, 0);
					Иначе
						Стр.ПланНаКварталКоличество = Окр(НовыйНаКварталКоличество, 0);
					КонецЕсли;
					
					Стр.ПланНаКвартал = Стр.ПланНаКварталЦена * Стр.ПланНаКварталКоличество;
					
				Иначе
					
					НовыйНаМесяцЦена = ЦенаРозничная;
					Если НовыйНаМесяцЦена > Окр(НовыйНаМесяцЦена, 0) Тогда
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена + 1, 0);
					Иначе
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена, 0);
					КонецЕсли;

					НовыйНаМесяцКоличество = Стр.ИтогоЗаПредПериодКоличество * Объект.КоэффициентИзмененияОбщий / ТаблицаПериоды.Количество();
					Если НовыйНаМесяцКоличество > Окр(НовыйНаМесяцКоличество, 0) Тогда
						Стр.ПланНаМесяцКоличество = Окр(НовыйНаМесяцКоличество + 1, 0);
					Иначе
						Стр.ПланНаМесяцКоличество = Окр(НовыйНаМесяцКоличество, 0);
					КонецЕсли;
					
					Стр.ПланНаМесяц = Стр.ПланНаМесяцЦена * Стр.ПланНаМесяцКоличество;
					
				КонецЕсли;
				
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					
					Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность = 
						ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКвартал, Стр.ПланНаМесяц);
					Стр["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность = 
						ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталКоличество, Стр.ПланНаМесяцКоличество);
						
				КонецЦикла;
				
				Стр.ПланНаСледПериод = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКвартал, Стр.ПланНаМесяц) * ТаблицаПериоды.Количество();
				Стр.ПланНаСледПериодКоличество = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталКоличество, 
					Стр.ПланНаМесяцКоличество) * ТаблицаПериоды.Количество();
				Стр.ПланНаСледПериодЦена = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталЦена, Стр.ПланНаМесяцЦена);
				Стр.ПроцентИзмененияПлана = ?(Стр.ИтогоЗаПредПериод=0, 0, (Стр.ПланНаСледПериод - Стр.ИтогоЗаПредПериод) / Стр.ИтогоЗаПредПериод) * 100;
				
			ИначеЕсли Стр.ПланНаКварталЦена = 0 И Стр.ПланНаМесяцЦена = 0 Тогда
				
				Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
					
					НовыйНаКварталЦена = ?(Стр.ПланНаКварталЦена > 0, Стр.ПланНаКварталЦена, ЦенаРозничная * 3);
					Если НовыйНаКварталЦена > Окр(НовыйНаКварталЦена, 0) Тогда
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена + 1, 0);
					Иначе
						Стр.ПланНаКварталЦена = Окр(НовыйНаКварталЦена, 0);
					КонецЕсли;
					
				Иначе
					
					НовыйНаМесяцЦена =  ?(Стр.ПланНаМесяцЦена > 0, Стр.ПланНаКварталЦена, ЦенаРозничная);
					Если НовыйНаМесяцЦена > Окр(НовыйНаМесяцЦена, 0) Тогда
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена + 1, 0);
					Иначе
						Стр.ПланНаМесяцЦена = Окр(НовыйНаМесяцЦена, 0);
					КонецЕсли;
					
				КонецЕсли;
				
				Стр.ПланНаСледПериод = 0;
				
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					
					Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ?(Объект.Периодичность = 
						ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталЦена, Стр.ПланНаМесяцЦена)
						* Стр["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки];
						
					Стр.ПланНаСледПериод = Стр.ПланНаСледПериод + Стр["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки];
					
				КонецЦикла;
				
				Стр.ПланНаСледПериодЦена = ?(Объект.Периодичность =
					ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"), Стр.ПланНаКварталЦена, Стр.ПланНаМесяцЦена);
				Стр.ПроцентИзмененияПлана = ?(Стр.ИтогоЗаПредПериод=0, 0, (Стр.ПланНаСледПериод - Стр.ИтогоЗаПредПериод) / Стр.ИтогоЗаПредПериод) * 100;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаполнитьДанныеПодвала();
		
	Иначе	
		
		ЗаполнитьТаблицуПланированияФактом(ПолучитьСписокМенеджеров(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланом();
		Для Каждого Стр Из ТабПланирования Цикл 
			Если НЕ Стр.РучноеИзменение ТОгда 
				Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
					НовыйНаКвартал=Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий/ТаблицаПериоды.Количество();
					Если НовыйНаКвартал>Окр(НовыйНаКвартал,-3) ТОгда
						Стр.ПланНаКвартал=Окр(НовыйНаКвартал+500,-3);
					Иначе
						Стр.ПланНаКвартал=Окр(НовыйНаКвартал,-3);
					КонецЕсли;	
				Иначе
					НовыйНаМесяц=Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий/ТаблицаПериоды.Количество();
					Если НовыйНаМесяц>Окр(НовыйНаМесяц,-3) ТОгда
						Стр.ПланНаМесяц=Окр(НовыйНаМесяц+500,-3);
					Иначе
						Стр.ПланНаМесяц=Окр(НовыйНаМесяц,-3);
					КонецЕсли;	
				КонецЕсли;
				Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
					Стр["КолонкаПлан_"+СтрТаблицаПериоды.ИмяКолонки]=?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),Стр.ПланНаКвартал,Стр.ПланНаМесяц);
				КонецЦикла;
				Стр.ПланНаСледПериод=?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),Стр.ПланНаКвартал,Стр.ПланНаМесяц)*ТаблицаПериоды.Количество();
				Стр.ПроцентИзмененияПлана=?(Стр.ИтогоЗаПредПериод=0,0,(Стр.ПланНаСледПериод-Стр.ИтогоЗаПредПериод)/Стр.ИтогоЗаПредПериод)*100;
			КонецЕсли;
		КонецЦикла;	
		ЗаполнитьДанныеПодвала();
		
	КонецЕсли;
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВывестиДекорациюПериод()
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
		Объект.ПериодПлана=ПредставлениеПериода(НачалоМесяца(Объект.НачалоПериода),КонецМесяца(Объект.ОкончаниеПериода),"ФП = Истина");
	Иначе
		Объект.ПериодПлана="Период не заполнен";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияМенеджерПриИзменении(Элемент)
	ТекМенеджер=ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Менеджер;
	СтрокиТабПланирования=ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("Менеджер",ТекМенеджер));
	Если СтрокиТабПланирования.Количество()>1 ТОгда
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Менеджер=Неопределено;
		ОбщегоназначенияКлиент.СообщитьПользователю("Менеджер уже присутствет в таблице");
	Иначе	
		Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
			ОбновитьДанныеВТаблице();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПодвала()
	ЗаполнитьДанныеПодвалаНаСервере();
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеПодвалаНаСервере()
	
	Элементы.ТабПланированияИтогоЗаПредПериод.ТекстПодвала = ТабПланирования.Итог("ИтогоЗаПредПериод");
	Элементы.ТабПланированияПланНаСледПериод.ТекстПодвала = ТабПланирования.Итог("ПланНаСледПериод");
	Объект.ИтогоПланНаСледПериод = ТабПланирования.Итог("ПланНаСледПериод");
	Элементы.ТабПланированияПланНаКвартал.ТекстПодвала = ТабПланирования.Итог("ПланНаКвартал");
	Элементы.ТабПланированияПланНаМесяц.ТекстПодвала = ТабПланирования.Итог("ПланНаМесяц");
	Элементы.ТабПланированияИтогоЗаТекПериод.ТекстПодвала = ТабПланирования.Итог("ИтогоЗаТекПериод");
	Элементы.ТабПланированияПроцентИзмененияПлана.ТекстПодвала = Окр(?(ТабПланирования.Итог("ИтогоЗаПредПериод") = 0, 0,
		(ТабПланирования.Итог("ПланНаСледПериод") - ТабПланирования.Итог("ИтогоЗаПредПериод")) / ТабПланирования.Итог("ИтогоЗаПредПериод")) * 100);
		
	Если Объект.ВидПлана = Перечисления.смартВидПлана.ПоСегментамНоменклатуры Тогда
		
		Элементы.ТабПланированияПланНаСледПериодКоличество.ТекстПодвала = ТабПланирования.Итог("ПланНаСледПериодКоличество");
		Элементы.ТабПланированияИтогоЗаПредПериодКоличество.ТекстПодвала = ТабПланирования.Итог("ИтогоЗаПредПериодКоличество");
		Элементы.ТабПланированияИтогоЗаТекПериодКоличество.ТекстПодвала = ТабПланирования.Итог("ИтогоЗаТекПериодКоличество");
			
	КонецЕсли;		
			
	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		
		Элементы["План_" + СтрТаблицаПериоды.ИмяКолонки].ТекстПодвала = ТабПланирования.Итог("КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки);
		Элементы["Факт_" + СтрТаблицаПериоды.ИмяКолонки].ТекстПодвала = ТабПланирования.Итог("КолонкаФакт_" + СтрТаблицаПериоды.ИмяКолонки);		
		
		Если Объект.ВидПлана = Перечисления.смартВидПлана.ПоСегментамНоменклатуры Тогда
			Элементы["ПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки].ТекстПодвала = ТабПланирования.Итог("КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки);
			Элементы["ФактКоличество_" + СтрТаблицаПериоды.ИмяКолонки].ТекстПодвала = ТабПланирования.Итог("КолонкаФактКоличество_" + СтрТаблицаПериоды.ИмяКолонки);		
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИтогоПланНаСледПериодПриИзменении(Элемент)
	ВсегоЗаПредПериод=ТабПланирования.Итог("ИтогоЗаПредПериод");
	ИтогоПланНаСледПериодБезРучных=Объект.ИтогоПланНаСледПериод;
	СтрокиРучноеИзменение=ТабПланирования.НайтиСтроки(Новый Структура("РучноеИзменение",Истина));
	Для Каждого СтрРучноеИзменение Из СтрокиРучноеИзменение Цикл
		ИтогоПланНаСледПериодБезРучных=ИтогоПланНаСледПериодБезРучных-СтрРучноеИзменение.ПланНаСледПериод;
		ВсегоЗаПредПериод=ВсегоЗаПредПериод-СтрРучноеИзменение.ИтогоЗаПредПериод;
	КонецЦикла;	
	Если ВсегоЗаПредПериод=0 ТОгда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены данные предыдущего периода!");
		Возврат;
	КонецЕсли;	
	Объект.КоэффициентИзмененияОбщий=ИтогоПланНаСледПериодБезРучных/ВсегоЗаПредПериод;
	Для Каждого Стр Из ТабПланирования Цикл
		Если Стр.РучноеИзменение Тогда
			Продолжить;
		КонецЕсли;	
		Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
			НовыйНаКвартал=Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий/ТаблицаПериоды.Количество();
			Если НовыйНаКвартал>Окр(НовыйНаКвартал,-3) ТОгда
				Стр.ПланНаКвартал=Окр(НовыйНаКвартал+500,-3);
			Иначе
				Стр.ПланНаКвартал=Окр(НовыйНаКвартал,-3);
			КонецЕсли;	
		Иначе
			НовыйНаМесяц=Стр.ИтогоЗаПредПериод*Объект.КоэффициентИзмененияОбщий/ТаблицаПериоды.Количество();
			Если НовыйНаМесяц>Окр(НовыйНаМесяц,-3) ТОгда
				Стр.ПланНаМесяц=Окр(НовыйНаМесяц+500,-3);
			Иначе
				Стр.ПланНаМесяц=Окр(НовыйНаМесяц,-3);
			КонецЕсли;	
		КонецЕсли;
		Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
			Стр["КолонкаПлан_"+СтрТаблицаПериоды.ИмяКолонки]=?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),Стр.ПланНаКвартал,Стр.ПланНаМесяц);
		КонецЦикла;
		Стр.ПланНаСледПериод=?(Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"),Стр.ПланНаКвартал,Стр.ПланНаМесяц)*ТаблицаПериоды.Количество();	
	КонецЦикла;
	ЗаполнитьДанныеПодвала();
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПроцентИзмененияПланаПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекущиеДанные.ПланНаСледПериод = (1 + ТекущиеДанные.ПроцентИзмененияПлана / 100) * ТекущиеДанные.ИтогоЗаПредПериод;
	ТекущиеДанные.ПланНаСледПериодКоличество = (1 + ТекущиеДанные.ПроцентИзмененияПлана / 100) * ТекущиеДанные.ИтогоЗаПредПериодКоличество;
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ТекущиеДанные.ПланНаКвартал = Окр(ТекущиеДанные.ПланНаСледПериод / ТаблицаПериоды.Количество(), -3);
		ТекущиеДанные.ПланНаКварталКоличество = Окр(ТекущиеДанные.ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(), -1);
		ТабПланированияПланНаКварталПриИзменении(Элемент);
		Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
			ТабПланированияПланНаКварталКоличествоПриИзменении(Элемент);
		КонецЕсли;	
	Иначе
		ТекущиеДанные.ПланНаМесяц = Окр(ТекущиеДанные.ПланНаСледПериод / ТаблицаПериоды.Количество(), -3);
		ТекущиеДанные.ПланНаМесяцКоличество = Окр(ТекущиеДанные.ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(), -1);
		ТабПланированияПланНаМесяцПриИзменении(Элемент);
		Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
			ТабПланированияПланНаМесяцКоличествоПриИзменении(Элемент);
		КонецЕсли;	
	КонецЕсли;
	
	ТекущиеДанные.РучноеИзменение = Истина;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ВидимостьЭлементовОтТипаПлана()

	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоПодразделениям") Тогда
		
		Элементы.ТабПланированияМенеджер.Видимость = Ложь;
		Элементы.ТабПланированияПодборМенеджеров.Видимость = Ложь;
		Элементы.ТабПланированияПодразделение.Видимость = Истина;
		Элементы.ТабПланированияПодборПодразделений.Видимость = Истина;
		Элементы.ТабПланированияСегментНоменклатуры.Видимость = Ложь;
		Элементы.ТабПланированияПодборСегментовНоменклатуры.Видимость = Ложь;
		Элементы.ТипУслуги.Видимость = Истина;
		Элементы.ТабПланированияИтогоЗаПредПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияИтогоЗаПредПериодКоличество.Видимость = Ложь;
		Элементы.ТабПланированияИтогоЗаПредПериодЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаСледПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияПланНаСледПериодКоличество.Видимость = Ложь; 
		Элементы.ТабПланированияПланНаСледПериодЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаКвартал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияПланНаКварталКоличество.Видимость = Ложь;
		Элементы.ТабПланированияПланНаКварталЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаМесяц.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияПланНаМесяцКоличество.Видимость = Ложь;
		Элементы.ТабПланированияПланНаМесяцЦена.Видимость = Ложь;
		Элементы.ТабПланированияИтогоЗаТекПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияИтогоЗаТекПериодКоличество.Видимость = Ложь;
		Элементы.ТабПланированияПланНаМесяц.Видимость = Истина;
		Элементы.ТабПланированияПланНаКвартал.Видимость = Истина;
		Элементы.ИтогоПланНаСледПериод.ТолькоПросмотр = Ложь;
		Элементы.ТабПланированияПланНаСледПериод.ТолькоПросмотр = Ложь;
		
	ИначеЕсли Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		
		Элементы.ТабПланированияМенеджер.Видимость = Ложь;
		Элементы.ТабПланированияПодборМенеджеров.Видимость = Ложь;
		Элементы.ТабПланированияПодразделение.Видимость = Ложь;
		Элементы.ТабПланированияПодборПодразделений.Видимость = Ложь;
		Элементы.ТабПланированияСегментНоменклатуры.Видимость = Истина;
		Элементы.ТабПланированияПодборСегментовНоменклатуры.Видимость = Истина;
		Элементы.ТипУслуги.Видимость = Ложь;
		Элементы.ТабПланированияИтогоЗаПредПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ТабПланированияИтогоЗаПредПериодКоличество.Видимость = Истина;
		Элементы.ТабПланированияИтогоЗаПредПериодЦена.Видимость = Истина;
		Элементы.ТабПланированияПланНаСледПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ТабПланированияПланНаСледПериодКоличество.Видимость = Истина;
		Элементы.ТабПланированияПланНаСледПериодЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаКвартал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ТабПланированияПланНаКварталКоличество.Видимость = Истина;
		Элементы.ТабПланированияПланНаКварталЦена.Видимость = Истина;
		Элементы.ТабПланированияПланНаМесяц.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ТабПланированияПланНаМесяцКоличество.Видимость = Истина;
		Элементы.ТабПланированияПланНаМесяцЦена.Видимость = Истина;
		Элементы.ТабПланированияИтогоЗаТекПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ТабПланированияИтогоЗаТекПериодКоличество.Видимость = Истина;
		Элементы.ТабПланированияПланНаМесяц.Видимость = Ложь;
		Элементы.ТабПланированияПланНаКвартал.Видимость = Ложь;
		Элементы.ИтогоПланНаСледПериод.ТолькоПросмотр = Истина;
		Элементы.ТабПланированияПланНаСледПериод.ТолькоПросмотр = Истина;
		
	Иначе	
		
		Элементы.ТабПланированияМенеджер.Видимость = Истина;
		Элементы.ТабПланированияПодборМенеджеров.Видимость = Истина;
		Элементы.ТабПланированияПодразделение.Видимость = Ложь;
		Элементы.ТабПланированияПодборПодразделений.Видимость = Ложь;
		Элементы.ТабПланированияСегментНоменклатуры.Видимость = Ложь;
		Элементы.ТабПланированияПодборСегментовНоменклатуры.Видимость = Ложь;
		Элементы.ТипУслуги.Видимость = Истина;
		Элементы.ТабПланированияИтогоЗаПредПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияИтогоЗаПредПериодКоличество.Видимость = Ложь;
		Элементы.ТабПланированияИтогоЗаПредПериодЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаСледПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияПланНаСледПериодКоличество.Видимость = Ложь; 
		Элементы.ТабПланированияПланНаСледПериодЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаКвартал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияПланНаКварталКоличество.Видимость = Ложь;
		Элементы.ТабПланированияПланНаКварталЦена.Видимость = Ложь;
		Элементы.ТабПланированияПланНаМесяц.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияПланНаМесяцКоличество.Видимость = Ложь;
		Элементы.ТабПланированияПланНаМесяцЦена.Видимость = Ложь;
		Элементы.ТабПланированияИтогоЗаТекПериод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ТабПланированияИтогоЗаТекПериодКоличество.Видимость = Ложь;
		Элементы.ТабПланированияПланНаМесяц.Видимость = Истина;
		Элементы.ТабПланированияПланНаКвартал.Видимость = Истина;
		Элементы.ИтогоПланНаСледПериод.ТолькоПросмотр = Ложь;
		Элементы.ТабПланированияПланНаСледПериод.ТолькоПросмотр = Ложь;
		
	КонецЕсли;		

КонецПроцедуры	

&НаКлиенте
Процедура ПодборПодразделений(Команда)
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ЭлементПользовательскойНастройки", Ложь);
	ПараметрыОбработчика.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыОбработчика.Вставить("ИмяЭлемента", Элементы.ТабПланирования.Имя);
	ПараметрыОбработчика.Вставить("ТипВыбора", "Подразделение");
	
	Обработчик = Новый ОписаниеОповещения("смартЗавершитьВыборИзСписка", ЭтотОбъект, ПараметрыОбработчика);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));	
	
	ПараметрыОткрытия = Новый Структура;

	ПараметрыОткрытия.Вставить("ОписаниеТипов", Новый ОписаниеТипов(МассивТипов));
	ПараметрыОткрытия.Вставить("ЗначенияДляВыбораЗаполнены", Ложь);
	ПараметрыОткрытия.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыОткрытия.Вставить("Представление", "Подбор подразделений");
	ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Массив());
	ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыОткрытия.Вставить("БыстрыйВыбор", Ложь);
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыОткрытия, ЭтотОбъект,,,, Обработчик);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВидПланаПриИзменении(Элемент)
		
	ВидимостьЭлементовОтТипаПлана();
	
	ПриИзмененииПериодовНаСервере();
	
	ТабПланирования.Очистить();
	
	ЭтаФорма.Модифицированность=Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТипУслугиПриИзменении(Элемент)

	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоПодразделениям") Тогда
		ЗаполнитьТаблицуПланированияФактомПоПодразделениям(ПолучитьСписокПодразделений(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоПодразделениям();
		ЗаполнитьДанныеПланаПоПериодам();
	ИначеЕсли Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.смартВидПлана.ПоСегментамНоменклатуры") Тогда
		ЗаполнитьТаблицуПланированияФактомПоСегментам(ПолучитьСписокСегментовНоменклатуры(), Объект.НачалоПериода, Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланомПоСегментам();
	Иначе	
		ЗаполнитьТаблицуПланированияФактом(ПолучитьСписокМенеджеров(),Объект.НачалоПериода,Объект.ОкончаниеПериода);
		ЗаполнитьТаблицуПланированияПланом();
		ЗаполнитьДанныеПланаПоПериодам();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСегментовДляПланирования()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СегментыНоменклатуры
	|ГДЕ
	|	смартИспользуетсяВПланированииПродаж
	|	И НЕ ЭтоГруппа
	|	И НЕ ПометкаУдаления");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

&НаКлиенте
Процедура ПодборСегментовНоменклатуры(Команда)
	
	МассивСегментовДокумента = ПолучитьСписокСегментовНоменклатуры();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивСегментовДокумента", МассивСегментовДокумента);
	
	ПараметрыОбработчика = Новый Структура;
	
	Обработчик = Новый ОписаниеОповещения("смартЗавершитьВыборИзСписка", ЭтотОбъект, ПараметрыОбработчика);
	
	ОткрытьФорму("Справочник.СегментыНоменклатуры.Форма.смартФормаВыбораВВидеДерева", ПараметрыОткрытия, ЭтотОбъект, , , , Обработчик);

КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияСегментНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("смартВыбранСегментНоменклатуры", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("смартИспользуетсяВПланированииПродаж", Истина));
	
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора", ПараметрыОткрытия, 
		ЭтотОбъект, , , , Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура смартВыбранСегментНоменклатуры(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
    	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СегментНоменклатуры = ВыбранноеЗначение;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаСледПериодКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") ТОгда
		ТекущиеДанные.ПланНаКварталКоличество = Окр(ТекущиеДанные.ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(), 0);
		ТабПланированияПланНаКварталКоличествоПриИзменении(Элемент);
	Иначе
		ТекущиеДанные.ПланНаМесяцКоличество = Окр(ТекущиеДанные.ПланНаСледПериодКоличество / ТаблицаПериоды.Количество(), 0);
		ТабПланированияПланНаМесяцКоличествоПриИзменении(Элемент);
	КонецЕсли;
	
	ТекущиеДанные.РучноеИзменение = Истина;
	
	ЗаполнитьДанныеПодвала();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаКварталКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ПланНаКварталКоличество = ТекущиеДанные.ПланНаКварталКоличество;
	ПланНаКварталЦена = ТекущиеДанные.ПланНаКварталЦена;
	
	ТекущиеДанные.ПланНаСледПериодКоличество = ПланНаКварталКоличество * ТаблицаПериоды.Количество();
	ТекущиеДанные.ПланНаСледПериод = ПланНаКварталЦена * ТекущиеДанные.ПланНаСледПериодКоличество;
	ТекущиеДанные.РучноеИзменение = Истина; 

	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		ТекущиеДанные["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные.ПланНаКварталКоличество;
		ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные.ПланНаКварталКоличество * ПланНаКварталЦена;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаМесяцКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ПланНаМесяцКоличество = ТекущиеДанные.ПланНаМесяцКоличество;
	ПланНаМесяцЦена = ТекущиеДанные.ПланНаМесяцЦена;
	
	ТекущиеДанные.ПланНаСледПериодКоличество = ПланНаМесяцКоличество * ТаблицаПериоды.Количество();
	ТекущиеДанные.ПланНаСледПериод = ПланНаМесяцЦена * ТекущиеДанные.ПланНаСледПериодКоличество;
	ТекущиеДанные.РучноеИзменение = Истина; 

	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		ТекущиеДанные["КолонкаПланКоличество_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные.ПланНаМесяцКоличество;
		ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные.ПланНаМесяцКоличество * ПланНаМесяцЦена;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаКварталЦенаПриИзменении(Элемент)
	
	ТабПланированияПланНаКварталКоличествоПриИзменении(Элемент);
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекущиеДанные.ПланНаКвартал = ТекущиеДанные.ПланНаКварталЦена * ТекущиеДанные.ПланНаКварталКоличество;
	ТекущиеДанные.ПланНаСледПериодЦена = ?(ТекущиеДанные.ПланНаСледПериодКоличество > 0, 
		ТекущиеДанные.ПланНаСледПериод / ТекущиеДанные.ПланНаСледПериодКоличество, 0);
		
	ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
		(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаМесяцЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ПланНаМесяцКоличество = ТекущиеДанные.ПланНаМесяцКоличество;
	ПланНаМесяцЦена = ТекущиеДанные.ПланНаМесяцЦена;
	
	ТекущиеДанные.ПланНаСледПериод = ПланНаМесяцЦена * ТекущиеДанные.ПланНаСледПериодКоличество;
	ТекущиеДанные.РучноеИзменение = Истина; 

	Для Каждого СтрТаблицаПериоды Из ТаблицаПериоды Цикл
		ТекущиеДанные["КолонкаПлан_" + СтрТаблицаПериоды.ИмяКолонки] = ТекущиеДанные.ПланНаМесяцКоличество * ПланНаМесяцЦена;
	КонецЦикла;
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекущиеДанные.ПланНаМесяц = ТекущиеДанные.ПланНаМесяцЦена * ТекущиеДанные.ПланНаМесяцКоличество;
	ТекущиеДанные.ПланНаСледПериодЦена = ?(ТекущиеДанные.ПланНаСледПериодКоличество > 0, 
		ТекущиеДанные.ПланНаСледПериод / ТекущиеДанные.ПланНаСледПериодКоличество, 0);
	
	ТекущиеДанные.ПроцентИзмененияПлана = ?(ТекущиеДанные.ИтогоЗаПредПериод = 0, 0,
		(ТекущиеДанные.ПланНаСледПериод - ТекущиеДанные.ИтогоЗаПредПериод) / ТекущиеДанные.ИтогоЗаПредПериод) * 100;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПланированияПланНаСледПериодЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекущиеДанные.ПланНаСледПериод = ТекущиеДанные.ПланНаСледПериодЦена * ТекущиеДанные.ПланНаСледПериодКоличество;
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		ТекущиеДанные.ПланНаКвартал = ТекущиеДанные.ПланНаСледПериодЦена * ТекущиеДанные.ПланНаКварталКоличество;
		ТекущиеДанные.ПланНаКварталЦена = ?(ТекущиеДанные.ПланНаКварталКоличество > 0, 
			ТекущиеДанные.ПланНаКвартал / ТекущиеДанные.ПланНаКварталКоличество, 0);
		
		ТабПланированияПланНаКварталПриИзменении(Элемент);
		
	Иначе
		
		ТекущиеДанные.ПланНаМесяц = ТекущиеДанные.ПланНаСледПериодЦена * ТекущиеДанные.ПланНаМесяцКоличество;
		ТекущиеДанные.ПланНаМесяцЦена = ?(ТекущиеДанные.ПланНаМесяцКоличество > 0, 
			ТекущиеДанные.ПланНаМесяц / ТекущиеДанные.ПланНаМесяцКоличество, 0);
		
		ТабПланированияПланНаМесяцПриИзменении(Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбраныСегментыДляВнесенияВПлан" Тогда
		
		СписокВыбранных = Параметр;
		ДобавленыСегменты = Ложь;
		
		Для Каждого ЭлементСписка Из СписокВыбранных Цикл
				
			СтрокиТабПланирования = ЭтаФорма.ТабПланирования.НайтиСтроки(Новый Структура("СегментНоменклатуры", ЭлементСписка.Значение));
			Если СтрокиТабПланирования.Количество() > 0 Тогда
				ОбщегоназначенияКлиент.СообщитьПользователю("Сегмент номенклатуры " + ЭлементСписка.Значение + " уже присутствет в таблице");
				Продолжить;
			КонецЕсли;
			
			СтрТабПланирования = ТабПланирования.Добавить();	
			СтрТабПланирования.СегментНоменклатуры = ЭлементСписка.Значение;
			ЭтаФорма.Модифицированность = Истина;
			ДобавленыСегменты = Истина;
				
		КонецЦикла;
		
		Если ДобавленыСегменты Тогда
			
			Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
				ОбновитьДанныеВТаблице();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыИсключенияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
		ОбновитьДанныеВТаблице();
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьРозничнуюЦенуПоСегменту(СегментНоменклатуры)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * КурсыВалютСрезПоследних.Курс КАК Цена
	|ПОМЕСТИТЬ ЦенаВРублях
	|ИЗ
	|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО СегментыНоменклатуры.смартТоварСегмента = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И СегментыНоменклатуры.смартВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|ГДЕ
	|	СегментыНоменклатуры.Ссылка = &СегментНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенаВРублях.Цена / КурсыВалютСрезПоследних.Курс КАК ЦенаВЕВРО
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &EUR) КАК КурсыВалютСрезПоследних,
	|	ЦенаВРублях КАК ЦенаВРублях");
	Запрос.УстановитьПараметр("СегментНоменклатуры", СегментНоменклатуры);
	Запрос.УстановитьПараметр("EUR", Константы.ВалютаУправленческогоУчета.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ЦенаВЕВРО, 0);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуРозничныхЦенПоСегментам()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СегментыНоменклатуры.Ссылка КАК СегментНоменклатуры,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * КурсыВалютСрезПоследних.Курс КАК Цена
	|ПОМЕСТИТЬ ЦенаВРублях
	|ИЗ
	|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО СегментыНоменклатуры.смартТоварСегмента = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И СегментыНоменклатуры.смартВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|ГДЕ
	|	СегментыНоменклатуры.смартИспользуетсяВПланированииПродаж
	|	И НЕ СегментыНоменклатуры.ПометкаУдаления
	|	И НЕ СегментыНоменклатуры.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенаВРублях.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ЦенаВРублях.Цена / КурсыВалютСрезПоследних.Курс КАК ЦенаВЕВРО
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &EUR) КАК КурсыВалютСрезПоследних,
	|	ЦенаВРублях КАК ЦенаВРублях");
	Запрос.УстановитьПараметр("EUR", Константы.ВалютаУправленческогоУчета.Получить());
	
	ЭтаФорма.ТаблицаРозничныхЦен.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
Процедура ТипУслугиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("ВыбранСегментДляТипаНоменклатуры", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("смартИспользуетсяКакТипНоменклатуры", Истина));
	
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора", ПараметрыОткрытия, 
		ЭтотОбъект, , , , Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- #Б-2220 смарт: Фролов 28.02.2025
	
&НаКлиенте
//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
Процедура ВыбранСегментДляТипаНоменклатуры(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
    	Объект.ТипУслуги = ВыбранноеЗначение;
		ТипУслугиПриИзменении(Элементы.ТипУслуги);
	КонецЕсли;
	
КонецПроцедуры //-- #Б-2220 смарт: Фролов 28.02.2025
