// Обновляет отображаемые данные на форме объекта со свойствами.
// 
// Параметры:
//  Форма           - ФормаКлиентскогоПриложения - уже настроена в процедуре ПриСозданииНаСервере.
//
//  Объект          - Неопределено - взять объект из реквизита формы "Объект".
//                  - Объект - СправочникОбъект, ДокументОбъект, ... , ДанныеФормыСтруктура (по типу объекта).
//
//  СкрытьУдаленные - Неопределено - не менять текущий режим скрытия удаленных, установленный ранее.
//                  - Булево - установить/отключить режим скрытия удаленных.
//                    При вызове процедуры ПередЗаписьюНаСервере в режиме скрытия удаленных, удаленные значения
//                    очищаются (не переносятся обратно в объект), а режим СкрытьУдаленные устанавливается Ложь.
//
//++ #1442 смарт: Фролов 04.10.2023 //Исправить добавление клиента в уже записанном Интересе (без клиента)
//добавлено УчитыватьЗависимостиПринудительно = Ложь  
//++ #1571 смарт: Мосолов 07.12.2023 // Рефакторинг.
// Заменил ОбновитьЭлементыДополнительныхРеквизитов с доп параметром  
Процедура ОбновитьЭлементыДополнительныхРеквизитов_Расширенная(Форма, Объект, СкрытьУдаленные, УчитыватьЗависимостиПринудительно) Экспорт
	//-- #1442 смарт: Фролов 04.10.2023

	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		УдалятьСтарые = Истина;
		Для каждого ОбъектДопРеквизитов из Объект Цикл
			Форма.Свойства_ИмяЭлементаДляРазмещения = ОбъектДопРеквизитов.ИмяЭлементаДляРазмещения;
			НеУчитыватьЗависимости = Ложь;
			//++ #1442 смарт: Фролов 04.10.2023 //Исправить добавление клиента в уже записанном Интересе (без клиента) 
			// добавлена проверка на УчитыватьЗависимостиПринудительно
			Если НЕ УчитыватьЗависимостиПринудительно Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектДопРеквизитов, "НеУчитыватьЗависимости") Тогда
					НеУчитыватьЗависимости = ОбъектДопРеквизитов.НеУчитыватьЗависимости;
				КонецЕсли;
			КонецЕсли;
			//-- #1442 смарт: Фролов 04.10.2023
			ЗаполнитьДополнительныеРеквизитыВФорме(Форма, ОбъектДопРеквизитов.Объект, , СкрытьУдаленные, УдалятьСтарые, НеУчитыватьЗависимости);
			УдалятьСтарые = Ложь;
		КонецЦикла;
	Иначе
		CRM_УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(Форма, Объект);
		ЗаполнитьДополнительныеРеквизитыВФорме(Форма, Объект, , СкрытьУдаленные);
	КонецЕсли;

КонецПроцедуры
