
#Область ДоработкиСмарт

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смартПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ смарт:Балашов #1358 22.05.2023
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//-- смарт:Балашов #1358 22.05.2023
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   

	//++ смарт:Балашов #1358 22.05.2023
	НастроитьВидимостьДоступность();
	//-- смарт:Балашов #1358 22.05.2023
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.
	УстановитьУсловноеОформление();
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументМаркетинговыеМероприятияДокумент", 
																		 "ИЗ Документ.МаркетинговыеМероприятияДокумент КАК ДокументМаркетинговыеМероприятияДокумент", 
																		 "*",
																		 , "КлиентПартнер",, "КлиентПартнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
	Если НЕ Пользователи.РолиДоступны("смартПросмотрОценокМаркетинговыхМероприятий") Тогда  
		БлокируемыеПоля = Новый Массив;
		БлокируемыеПоля.Добавить("Оценка");
		БлокируемыеПоля.Добавить("Ссылка.Оценка");
	
		Список.УстановитьОграниченияИспользованияВГруппировке(БлокируемыеПоля);
		Список.УстановитьОграниченияИспользованияВОтборе(БлокируемыеПоля);
		Список.УстановитьОграниченияИспользованияВПорядке(БлокируемыеПоля); 
	КонецЕсли;
	//-- #6604 смарт: Тимофеева 08.05.2026
	
КонецПроцедуры

//++ смарт:Балашов #1358 22.05.2023
&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	ЭлементыКП = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы;
	Для Каждого ЭлементКП Из ЭлементыКП Цикл 
		Если ЭлементКП.Имя = "ФормаОбщаяКомандаИсторияИзменений" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель); 
		ИначеЕсли ЭлементКП.Имя = "ФормаСоздать" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(0));
		ИначеЕсли ЭлементКП.Имя = "ФормаСкопировать" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(1));
		ИначеЕсли ЭлементКП.Имя = "ФормаПровести" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(2));
		ИначеЕсли ЭлементКП.Имя = "ФормаОтменаПроведения" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(3));
		ИначеЕсли ЭлементКП.Имя = "ФормаЗакрыть" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(4));
		КонецЕсли;	
	КонецЦикла;	     
	
	
	
КонецПроцедуры //-- смарт:Балашов #1358 22.05.2023

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.
&НаСервере
Процедура УстановитьУсловноеОформление()

    СписокСтатусов = Новый СписокЗначений;
    СписокСтатусов.Добавить(Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта);
    СписокСтатусов.Добавить(Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокСтатусов;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(153, 153, 153));
	
	//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
	Если НЕ Пользователи.РолиДоступны("смартПросмотрОценокМаркетинговыхМероприятий") Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Оценка.Имя); 
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Оценка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПользовательПоставилОценку");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Пользователи.ТекущийПользователь();
	
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "***");
	КонецЕсли;
	//-- #6604 смарт: Тимофеева 08.05.2026

КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПечататьДокументНаСервере(ТабличныйДокумент, ПараметрКоманды)
	Документы.МаркетинговыеМероприятияДокумент.ПечатьЧерезОбщуюФорму(ТабличныйДокумент, ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ПечататьДокумент(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЭтотИмяФормы = ЭтотОбъект.ИмяФормы;
	ТабДокумент = Новый ТабличныйДокумент;
	ПечататьДокументНаСервере(ТабДокумент, ПараметрКоманды);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("МакетЗаявкаНаДемонстрацию");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "МакетЗаявкаНаДемонстрацию");
	ПечатнаяФорма.СинонимМакета = "МакетЗаявкаНаДемонстрацию";
	ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
	
	ОбластиОбъектов = Новый СписокЗначений;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	//ТабДокумент.показать();
КонецПроцедуры

#КонецОбласти
#КонецОбласти