//++#1374 смарт: Балашов 18.07.2023 //Разработать учет закупок в разрезе Контейнеров
Процедура ПередЗаписью(Отказ)
	//проверим на дубли
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	смартКонтейнеры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.смартКонтейнеры КАК смартКонтейнеры
		|ГДЕ 
		|	смартКонтейнеры.Наименование = &Наименование
		|";	
	Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Наименование);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() > 0 Тогда
		Отказ = истина;
		Сообщить("Контейнер с таким наименованием уже сужествует в справочнике. Запись невозможна");
		Возврат;
	КонецЕсли;	
КонецПроцедуры//--#1374 смарт: Балашов 18.07.2023

