#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Проверка уникальности состояний и условий
	Если СостоянияИнтересовИУсловия.Количество() > 0 Тогда
		
		ТЗСостоянияИнтересовИУсловия = СостоянияИнтересовИУсловия.Выгрузить();
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТЗ", ТЗСостоянияИнтересовИУсловия);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		    |	ТЗ.СостояниеИнтереса КАК СостояниеИнтереса,
			|	ТЗ.КонтрольОплаты КАК КонтрольОплаты,
			|	ТЗ.ПолнаяОплата КАК ПолнаяОплата
			|ПОМЕСТИТЬ ВТ_СостоянияИнтересовИУсловия
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.смартСтатусыRoistat.СостоянияИнтересовИУсловия
			|ГДЕ
			|	Ссылка <> &Ссылка
			|	И НЕ Ссылка.ПометкаУдаления
			|	И (СостояниеИнтереса, КонтрольОплаты, ПолнаяОплата) 
			|	   	  В(ВЫБРАТЬ СостояниеИнтереса, КонтрольОплаты, ПолнаяОплата 
			|		 	ИЗ ВТ_СостоянияИнтересовИУсловия)";
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаРезультата = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаРезультата.Следующий() Цикл
				
				ТекстСообщения = НСтр("ru = 'Данные условия участвуют в табличной части другого состояния: '") 
								 + СокрЛП(ВыборкаРезультата.Ссылка);
								 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли