
#Область ПеренесеноСДоработками

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
//++ #Б-4990 смарт: Фролов 17.11.2025 //Доработка обработки "Управление финансовыми потоками" 
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_РаспоряжениеНаПеремещениеДенежныхСредств", ПараметрыЗаписи, Объект.Ссылка); // Используется для автоматического обновления формы платежного календаря

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #Б-4990 смарт: Фролов 17.11.2025 //Доработка обработки "Управление финансовыми потоками" 
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Оповестить("ПроведенаНоваяЗаявкаНаРасходИлиПереводДС", , ЭтаФорма); 
		
	КонецЕсли;	
	//-- #Б-4990 смарт: Фролов 17.11.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти