// +CRM

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CRM_ШаблонОповещения = Ложь;
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("CRM_ШаблонОповещения") Тогда
			CRM_ШаблонОповещения = ЭлементОтбора.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = ?(CRM_ШаблонОповещения,НСтр("ru='Шаблоны сообщений SMS (Для оповещений)';en='SMS Message Templates (for notifications)'"),НСтр("ru='Шаблоны сообщений SMS (Для рассылок)'"));
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если CRM_ШаблонОповещения Тогда Возврат; КонецЕсли;
	ОповеститьОВыборе(ПолучитьШаблон(ВыбраннаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ШаблонОповещения",CRM_ШаблонОповещения);
		ОткрытьФорму("Справочник.SMS4B_ШаблоныСообщений.ФормаОбъекта",ПараметрыФормы,Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьШаблон(ВыбраннаяСтрока)
    
    Структура = Новый Структура;
    Структура.Вставить("Содержание", ВыбраннаяСтрока.Содержание);
    
    Возврат Структура;
    
КонецФункции

#КонецОбласти

// -CRM