
#Область ПрограммныйИнтерфейс

//++ #1754 смарт: Ермаков 05.04.2024 / Доработка подсистемы "УправлениеДоступом. Добавить клиентский метод ЭтоПолноправныйПользователь

// Проверяет, является ли текущий пользователь полноправным.
// 
// Параметры:
//  ПроверятьПраваАдминистрированияСистемы - см. Пользователи.ЭтоПолноправныйПользователь.ПроверятьПраваАдминистрированияСистемы
//
// Возвращаемое значение:
//  Булево - если Истина, пользователь является полноправным.
//
Функция ЭтоПолноправныйПользователь(ПроверятьПраваАдминистрированияСистемы = Ложь) Экспорт
	
	// Функция добавлена из БСП
	Если ПроверятьПраваАдминистрированияСистемы Тогда
		Возврат СтандартныеПодсистемыКлиент.ПараметрКлиента("ЭтоПолноправныйПользователь");
	Иначе
		Возврат СтандартныеПодсистемыКлиент.ПараметрКлиента("ЭтоАдминистраторСистемы");
	КонецЕсли;
		
КонецФункции //-- #1754 смарт: Ермаков 05.04.2024

#КонецОбласти