
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//++ смарт:ММ #108 550 15.06.2021 Объединение с CRM
	ДобавитьЭлементыПрограммно();
	//-- смарт:ММ 15.06.2021

	// Фролов+
	Элементы.Дилер.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПризнакаДилер");
	Элементы.смартДилерСервисЦентра.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПризнакаДилерСЦ");
	Элементы.смартПартнерОсобыеУсловияПеревозкиОписание.Видимость=Объект.смартПартнерОсобыеУсловияПеревозки;
	Объект.смартПартнерСпособДоставки=?(ЗначениеЗаполнено(Объект.смартПартнерСпособДоставки),Объект.смартПартнерСпособДоставки,Перечисления.СпособыДоставки.Самовывоз);
	
	ЗаполнитьСпискиАдресовДоставки(Объект.Ссылка,Элементы.смартПартнерАдресДоставки.Имя);
	Если ЗначениеЗаполнено(Объект.смартПартнерАдресДоставкиПеревозчика) Тогда 
		ЗаполнитьСпискиАдресовДоставки(Объект.смартПартнерАдресДоставкиПеревозчика,Элементы.смартПартнерАдресДоставкиПеревозчика.Имя);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.смартПартнерКонтактноеЛицо) Тогда 
		ЗаполнитьСписокТелефоновКонтактногоЛица(Объект.смартПартнерКонтактноеЛицо);
	КонецЕсли;
	ЗаполнитьЗонуДоставки();
	// Фролов-

	//++#1283 смарт: Лопато 01.02.2023 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  
	//// ++ смарт Белоусова #469 11.06.2021 доработка
	//элементы.смартКлючевойКлиентПоРасходнымМатериалам.Доступность = Ложь;
	//// -- смарт Белоусова #469 11.06.2021
	//
	//// ++ смарт Белоусова #469 12.03.2021
	//если РольДоступна("ПолныеПрава") или РольДоступна("смартРедактированиеКлючевыхКлиентов") тогда
	//	элементы.смартКлючевойКлиентПоРасходнымМатериалам.Доступность = Истина;
	//КонецЕсли;	
	// -- смарт Белоусова #469 12.03.2021
	Элементы.смартГруппаКлючевойКлиентПоРасходнымМатериалам.Доступность = (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартРедактированиеКлючевыхКлиентов"));
	//--#1283 смарт: Лопато 01.02.2023
	
	//++ смарт:КМД 810 14.12.2021
	смартДобавитьЭлементыПрограммноОбменСУТКовчег();
	//-- смарт:КМД 810 14.12.2021
	
	//++#1012 смарт: Холопов 04.05.2022 // Добавление подсказок для телефонов в КИ 
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);	
	//--#1012 смарт: Холопов 04.05.2022 
	
	//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
	// Изменение ответственного доступно его руководителю
	Если Элементы.ОсновнойМенеджер.ТолькоПросмотр Тогда
		Если ЗначениеЗаполнено(Объект.ОсновнойМенеджер) И ТекущийПользователь.ФизическоеЛицо = Объект.ОсновнойМенеджер.Подразделение.ТекущийРуководитель Тогда
			Элементы.ОсновнойМенеджер.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	//--#1542 смарт: Лопато 03.11.2023
	
	//++#1615 смарт: Лопато 23.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
	Элементы.ОсновнойМенеджер.АвтоОтметкаНезаполненного 				  = Истина;
	//Элементы.смартМенеджерПоРасходнымМатериалам.АвтоОтметкаНезаполненного = Истина;
	Элементы.БизнесРегион.АвтоОтметкаНезаполненного 					  = Истина;
	//--#1615 смарт: Лопато 23.01.2024
	
	//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
	смартУстановитьЗначенияЗакрепленияМенеджеров(Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги);
	смартУстановитьЗначенияЗакрепленияМенеджеров(Справочники.CRM_ТипУслуги.ПоставкаРасходныеМатериалы);
	смартУстановитьЗначенияЗакрепленияМенеджеров(Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти);

	//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
		НовыйРеквизит = Новый РеквизитФормы("АдресВременногоХранилища", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ИдентификаторЗаданияПроверкиПартнера", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭтаФорма.АдресВременногоХранилища = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
		
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(Параметры.Ключ);
		ПараметрыФункции.Добавить(ЭтаФорма.АдресВременногоХранилища);
		
		ЭтаФорма.ИдентификаторЗаданияПроверкиПартнера = ФоновыеЗадания.Выполнить("смартПроверкаПартнеров.НайтиДублиПартнераПоТелефонуИПочте",
																					ПараметрыФункции).УникальныйИдентификатор;
		
	КонецЕсли;
	//-- #Б1174 смарт: Шляпников 21.10.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "Наименование");
	смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Ссылка);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	ПараметрыЭлемента = Новый Структура("ОтображениеПодсказки, Подсказка", ОтображениеПодсказки.ОтображатьСправа, ПолучитьТекстИнформацииОКонтролеТехническойОтсрочки());
	ПараметрыЭлемента.Вставить("Доступность", Пользователи.РолиДоступны("смартМенеджерБэкОфис"));
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартНеКонтролироватьТехническуюОтсрочку", "ГруппаДополнительно",, 2, "Объект.смартНеКонтролироватьТехническуюОтсрочку", ПараметрыЭлемента);
	
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартОткрытьСтопЛистТехническойОтсрочки", "Стоп-лист технической отсрочки", "смартОткрытьСтопЛистТехническойОтсрочки");
	
	ГруппаСтопЛистТехническойОтсрочки = смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "ГруппаСтопЛистТехническойОтсрочки", Элементы.ГруппаСписокЗапретовОтгрузки, 3,,,,);
	 
	СвойстваКнопки = Новый Структура;
	СвойстваКнопки.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	СвойстваКнопки.Вставить("Картинка", БиблиотекаКартинок.ОтгрузкаЗапрещена);
	СвойстваКнопки.Вставить("ЦветТекста", WebЦвета.Кирпичный);
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартОткрытьСтопЛистТехническойОтсрочки", "ГруппаСтопЛистТехническойОтсрочки", "Клиенту запрещена техническая отсрочка", "смартОткрытьСтопЛистТехническойОтсрочки", 2, СвойстваКнопки);
	
	СвойстваКнопки = Новый Структура;
	СвойстваКнопки.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	СвойстваКнопки.Вставить("Картинка", БиблиотекаКартинок.ОтгрузкаРазрешена);
	
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартОткрытьСтопЛистТехническойОтсрочки1", "ГруппаСтопЛистТехническойОтсрочки", "Клиенту разрешена техническая отсрочка", "смартОткрытьСтопЛистТехническойОтсрочки", 2, СвойстваКнопки);

	смартОбновитьСостояниеСтопЛистаТехническойОтсрочки(); 
	
	ГруппаБлокировкиПоДоговорам = смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "ГруппаБлокировкиПоДоговорам", Элементы.ГруппаСписокЗапретовОтгрузки, 3,,,,);
	смартФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, "БлокировкиПоДоговорам", ГруппаБлокировкиПоДоговорам, "Внимание! Имеются активные блокировки по договорам с отсрочкой");
	ЭтаФорма.Элементы["БлокировкиПоДоговорам"].ЦветТекста = ЦветаСтиля.ЦветТекстаОтрицательногоЗначения;
	смартОбновитьСостояниеБлокировокПоДоговорам();

	//-- #4792 смарт: Тимофеева 17.03.26
	
	//++ #Б-7140 смарт: Фролов 10.08.2026 //Исключения для руководителей ОП по смене закрепленного партнера в рамках своего ОП
	Если РольДоступна("смартРуководительCRM") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ Руководитель
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО Пользователи.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Пользователи.Подразделение
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ИсполнителиЗадач.РольИсполнителя = Пользователи.Подразделение.смартИсполнительОтПодразделения
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Руководитель КАК Руководитель
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Руководитель.Подразделение = Пользователи.Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователи.Наименование");
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		
		МассивПользователейРуководителя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка);
	
		Если НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
			
			Если ЗначениеЗаполнено(Объект.ОсновнойМенеджер) И МассивПользователейРуководителя.Найти(Объект.ОсновнойМенеджер) = Неопределено Тогда
				Элементы.ОсновнойМенеджер.ТолькоПросмотр = Истина;	
			Иначе
				Элементы.ОсновнойМенеджер.ТолькоПросмотр = Ложь;
				Элементы.ОсновнойМенеджер.РежимВыбораИзСписка = Истина;
				Элементы.ОсновнойМенеджер.СписокВыбора.ЗагрузитьЗначения(МассивПользователейРуководителя);
			КонецЕсли;
		
		КонецЕсли;
		
		СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка, "РМ");
		
		Если НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
		
			Если ЗначениеЗаполнено(Объект.смартМенеджерПоРасходнымМатериалам) И МассивПользователейРуководителя.Найти(Объект.смартМенеджерПоРасходнымМатериалам) = Неопределено Тогда
				Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = Истина;	
			Иначе
				Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = Ложь;
				Элементы.смартМенеджерПоРасходнымМатериалам.РежимВыбораИзСписка = Истина;
				Элементы.смартМенеджерПоРасходнымМатериалам.СписокВыбора.ЗагрузитьЗначения(МассивПользователейРуководителя);
			КонецЕсли;
		
		КонецЕсли;
		
		СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка, "СЦ");
		
		Если НЕ СтруктураНовогоСостояния.Состояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
		
			Если ЗначениеЗаполнено(Объект.смартОсновнойМенеджерСервисЦентра) И МассивПользователейРуководителя.Найти(Объект.смартОсновнойМенеджерСервисЦентра) = Неопределено Тогда
				Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = Истина;	
			Иначе
				Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = Ложь;
				Элементы.смартОсновнойМенеджерСервисЦентра.РежимВыбораИзСписка = Истина;
				Элементы.смартОсновнойМенеджерСервисЦентра.СписокВыбора.ЗагрузитьЗначения(МассивПользователейРуководителя);
			КонецЕсли;
			
		КонецЕсли;	
	
	ИначеЕсли Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ОсновнойМенеджер.ТолькоПросмотр = Ложь;
		Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = Ложь;
		Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = Ложь;
	КонецЕсли;
	//-- #Б-7140 смарт: Фролов 10.08.2026
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаметкиПосле(Команда)
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин 27.11.2019 17:55:37
	смартВызовКоманды(Объект.Ссылка);
	//Смарт }Подкин 27.11.2019 17:55:37
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.09.2021 15:55:10
&НаКлиенте
Процедура смарт_НапоминанияПосле(Команда)
	смартВызовКомандыНапоминания(Объект.Ссылка);
КонецПроцедуры


//++ смарт:ММ #108 550 15.06.2021 Объединение с CRM
&НаСервере
Процедура ДобавитьЭлементыПрограммно()
	
	// Команда Заметки
	
	ЗаметкиКоманда = ЭтаФорма.Команды.Добавить("Заметки");
	ЗаметкиКоманда.Действие = "смарт_ЗаметкиПосле";
	ЗаметкиКоманда.Отображение = ОтображениеКнопки.Текст;
	
	Заметки = Элементы.Вставить("Заметки", Тип("КнопкаФормы"), Элементы.ГруппаШапка, Элементы.ДекорацияРазделительКоманднойПанели1);
    Заметки.ИмяКоманды = "Заметки";
	Заметки.Заголовок = "Заметки (смарт)";
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.09.2021 15:55:18
	//Напоминания
	ЗаметкиКоманда = ЭтаФорма.Команды.Добавить("Напоминания");
	ЗаметкиКоманда.Действие = "смарт_НапоминанияПосле";
	ЗаметкиКоманда.Отображение = ОтображениеКнопки.Текст;
	
	Заметки = Элементы.Вставить("Напоминания", Тип("КнопкаФормы"), Элементы.ГруппаШапка, Элементы.ДекорацияРазделительКоманднойПанели1);
	Заметки.ИмяКоманды = "Напоминания";
	Заметки.Заголовок = "Напоминания (смарт)";
	//Смарт }Подкин Алексей Иванович 23.09.2021 15:55:18

	//++ #1920 смарт: Фролов 16.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
	//++#1329 смарт: Лопато 21.03.2023 //Менеджер по расходным материалам  
	//смартМенеджерПоРасходнымМатериалам = Элементы.Вставить("смартМенеджерПоРасходнымМатериалам", Тип("ПолеФормы"), Элементы.ГруппаМенеджер);
	//смартМенеджерПоРасходнымМатериалам.Вид = ВидПоляФормы.ПолеВвода;	
	//смартМенеджерПоРасходнымМатериалам.ПутьКДанным = "Объект.смартМенеджерПоРасходнымМатериалам";
	//Элементы.ГруппаМенеджер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	////--#1329 смарт: Лопато 21.03.2023
	//
	//// смартОсновнойМенеджерСервисЦентра 
	//
	//смартОсновнойМенеджерСервисЦентра = Элементы.Вставить("смартОсновнойМенеджерСервисЦентра", Тип("ПолеФормы"), Элементы.ГруппаСведения, Элементы.ГруппаТипыОтношений);
	//смартОсновнойМенеджерСервисЦентра.Заголовок = "Основной менеджер СЦ (смарт)";
	//смартОсновнойМенеджерСервисЦентра.Вид = ВидПоляФормы.ПолеВвода;	
	//смартОсновнойМенеджерСервисЦентра.ПутьКДанным = "Объект.смартОсновнойМенеджерСервисЦентра";
	//-- #1920 смарт: Фролов 16.07.2024
	// КонтакнаяИнформацияПартнераАнгл
	
	//++ #Б-5258 смарт: Фролов 16.12.2025 //Создание механизма сегментации партнеров.
	//КонтакнаяИнформацияПартнераАнгл = Элементы.Добавить("КонтакнаяИнформацияПартнераАнгл", Тип("ПолеФормы"), Элементы.ГруппаНаименование);
	КонтакнаяИнформацияПартнераАнгл = Элементы.Добавить("КонтакнаяИнформацияПартнераАнгл", Тип("ПолеФормы"), Элементы.ГруппаСведения);
	КонтакнаяИнформацияПартнераАнгл.Заголовок = "Конт. инф-ия (англ.)";
	//-- #Б-5258 смарт: Фролов 17.12.2025
	КонтакнаяИнформацияПартнераАнгл.Вид = ВидПоляФормы.ПолеВвода;	
	КонтакнаяИнформацияПартнераАнгл.ПутьКДанным = "Объект.КонтакнаяИнформацияПартнераАнгл";
	
	// Сайт
	//++ #1262 смарт: Фролов 30.11.2022 //Перенос адреса веб сайта в карточке клиента  
	//ГруппаСайт = Элементы.Добавить("ГруппаСайт", Тип("ГруппаФормы"), Элементы.ГруппаНаименование);
	//ГруппаСайт.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//ГруппаСайт.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//ГруппаСайт.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	//
	//РедактироватьСайт = ЭтаФорма.Команды.Добавить("РедактироватьСайт");
	//РедактироватьСайт.Действие = "смарт_РедактироватьСайтВместо";
	//РедактироватьСайт.Картинка = БиблиотекаКартинок.Изменить;
	//РедактироватьСайт.Отображение = ОтображениеКнопки.Картинка;

	//РедактироватьСайтКнопка = Элементы.Добавить("РедактироватьСайт", Тип("КнопкаФормы"), ГруппаСайт);
	//РедактироватьСайтКнопка.ИмяКоманды = "РедактироватьСайт";
	//РедактироватьСайтКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//
	//Сайт = Элементы.Добавить("Сайт", Тип("ПолеФормы"), ГруппаСайт);
	//Сайт.Заголовок = "Сайт (смарт)";
	//Сайт.Вид = ВидПоляФормы.ПолеНадписи;	
	//Сайт.ПутьКДанным = "Объект.Сайт";
	//Сайт.Гиперссылка = Истина;
	//Сайт.УстановитьДействие("Нажатие", "смарт_СайтНажатиеПосле");
	//-- #1262 смарт: Фролов 30.11.2022
		
	// Дилер
	
	ГруппаДилер = Элементы.Добавить("ГруппаДилер", Тип("ГруппаФормы"), Элементы.ГруппаТипыОтношений);
	ГруппаДилер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДилер.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДилер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Дилер = Элементы.Добавить("Дилер", Тип("ПолеФормы"), ГруппаДилер);
	Дилер.Вид = ВидПоляФормы.ПолеФлажка;
	Дилер.ПутьКДанным = "Объект.Дилер";
	Дилер.Заголовок = "Дилер (смарт)";
	Дилер.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Перепродавец = Элементы.Добавить("Перепродавец", Тип("ПолеФормы"), ГруппаДилер);
	Перепродавец.Вид = ВидПоляФормы.ПолеФлажка;
	Перепродавец.ПутьКДанным = "Объект.Перепродавец";
	Перепродавец.Заголовок = "Перепродавец (смарт)";
	Перепродавец.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	смартДилерСервисЦентра = Элементы.Добавить("смартДилерСервисЦентра", Тип("ПолеФормы"), ГруппаДилер);
	смартДилерСервисЦентра.Вид = ВидПоляФормы.ПолеФлажка;
	смартДилерСервисЦентра.ПутьКДанным = "Объект.смартДилерСервисЦентра";
	смартДилерСервисЦентра.Заголовок = "Дилер СЦ (смарт)";
	смартДилерСервисЦентра.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	// смартКлючевойКлиентПоРасходнымМатериалам

	//++#1283 смарт: Лопато 23.12.2022 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  
	смартГруппаКлючевойКлиентПоРасходнымМатериалам = Элементы.Вставить("смартГруппаКлючевойКлиентПоРасходнымМатериалам", Тип("ГруппаФормы"), Элементы.ГруппаСведения, Элементы.ОбслуживаетсяТорговымиПредставителями);
	смартГруппаКлючевойКлиентПоРасходнымМатериалам.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаКлючевойКлиентПоРасходнымМатериалам.ОтображатьЗаголовок = Ложь;
	смартГруппаКлючевойКлиентПоРасходнымМатериалам.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	смартСрокПроверкиКлючевойКлиент = Элементы.Вставить("смартСрокПроверкиКлючевойКлиент", Тип("ПолеФормы"), Элементы.смартГруппаКлючевойКлиентПоРасходнымМатериалам);
	смартСрокПроверкиКлючевойКлиент.Вид = ВидПоляФормы.ПолеВвода;
	смартСрокПроверкиКлючевойКлиент.ПутьКДанным = "Объект.смартСрокПроверкиКлючевойКлиент";
	смартСрокПроверкиКлючевойКлиент.Заголовок = "Срок проверки";
	смартСрокПроверкиКлючевойКлиент.РастягиватьПоГоризонтали = Ложь;
	смартСрокПроверкиКлючевойКлиент.Ширина = 6;
	смартСрокПроверкиКлючевойКлиент.ТолькоПросмотр = НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартРедактированиеКлючевыхКлиентов"));
	смартСрокПроверкиКлючевойКлиент.УстановитьДействие("ПриИзменении", "смартСрокПроверкиКлючевойКлиентПриИзменении");
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартСрокПроверкиКлючевойКлиент", "поле ""Срок проверки ключевой клиент""", 
													 Элементы.смартГруппаКлючевойКлиентПоРасходнымМатериалам, ЭтаФорма);

	смартСрокПроверкиОсталосьДней = Элементы.Добавить("смартСрокПроверкиОсталосьДней", Тип("ДекорацияФормы"), смартГруппаКлючевойКлиентПоРасходнымМатериалам);
	смартСрокПроверкиОсталосьДней.Вид = ВидДекорацииФормы.Надпись;
	
	смартКлючевойКлиентПоРасходнымМатериалам = Элементы.Вставить("смартКлючевойКлиентПоРасходнымМатериалам", Тип("ПолеФормы"), Элементы.смартГруппаКлючевойКлиентПоРасходнымМатериалам, Элементы.смартСрокПроверкиКлючевойКлиент);
    //--#1283 смарт: Лопато 23.12.2022
	смартКлючевойКлиентПоРасходнымМатериалам.Вид = ВидПоляФормы.ПолеФлажка;
	смартКлючевойКлиентПоРасходнымМатериалам.ПутьКДанным = "Объект.смартКлючевойКлиентПоРасходнымМатериалам";
	смартКлючевойКлиентПоРасходнымМатериалам.Заголовок = "Ключевой клиент по расходным материалам (смарт)";
	смартКлючевойКлиентПоРасходнымМатериалам.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	//++ Смарт:  Демичев №877 02.02.2022
	смартДилерБывший = Элементы.Добавить("смартДилерБывший", Тип("ПолеФормы"), ГруппаДилер);
	смартДилерБывший.Вид = ВидПоляФормы.ПолеФлажка;
	смартДилерБывший.ПутьКДанным = "Объект.смартДилерБывший";
	смартДилерБывший.Заголовок = "Бывший Дилер(смарт)";
	смартДилерБывший.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;	

	ГруппаДилер.ПодчиненныеЭлементы.смартДилерБывший.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПризнакаДилерСЦ,смартИзменениеПризнакаДилер");
	//-- Смарт:  Демичев №877 02.02.2022
	
	
	#Область Группы
	//////////////////
	// Оборудование
	
	// Группа
	
	смартГруппаОборудованиеКлиента = Элементы.Добавить("смартГруппаОборудованиеКлиента", Тип("ГруппаФормы"), Элементы.ГруппаСвязанныеСписки2);
	
	смартГруппаОборудованиеКлиента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаОборудованиеКлиента.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
	смартГруппаОборудованиеКлиента.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
	смартГруппаОборудованиеКлиента.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаОборудованиеКлиента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаОборудованиеКлиента.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	смартГруппаОборудованиеКлиента.Заголовок = "Оборудование клиента (смарт)";
	смартГруппаОборудованиеКлиента.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ОсновнойГолубой;
	смартГруппаОборудованиеКлиента.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
	
	// Команды оборудование
	
	смартОборудованиеКлиентовКомПанель = Элементы.Добавить("смартОборудованиеКлиентовКомПанель", Тип("ГруппаФормы"), смартГруппаОборудованиеКлиента);
	смартОборудованиеКлиентовКомПанель.Вид = ВидГруппыФормы.КоманднаяПанель;

	смартДобавитьОборудованиеКлиента = ЭтаФорма.Команды.Добавить("смартДобавитьОборудованиеКлиента");
    смартДобавитьОборудованиеКлиента.Действие = "РасшСмарт_смартДобавитьОборудованиеКлиента";

    Кнопка = Элементы.Добавить("смартОборудованиеКлиентовсмартДобавитьОборудованиеКлиента", Тип("КнопкаФормы"), Элементы.смартОборудованиеКлиентовКомПанель);
    Кнопка.Заголовок = "Добавить";
    Кнопка.ИмяКоманды = "смартДобавитьОборудованиеКлиента";

	смартРазрешитьРедактированиеОборудования = ЭтаФорма.Команды.Добавить("смартРазрешитьРедактированиеОборудования");
    смартРазрешитьРедактированиеОборудования.Действие = "РасшСмарт_смартРазрешитьРедактированиеОборудования";

    Кнопка = Элементы.Добавить("смартОборудованиеКлиентовсмартРазрешитьРедактированиеОборудования", Тип("КнопкаФормы"), Элементы.смартОборудованиеКлиентовКомПанель);
    Кнопка.Заголовок = "Редактировать";
    Кнопка.ИмяКоманды = "смартРазрешитьРедактированиеОборудования";

	// Таблица
	
	смартОборудованиеКлиентов = Элементы.Добавить("смартОборудованиеКлиентов", Тип("ТаблицаФормы"), смартГруппаОборудованиеКлиента);
	смартОборудованиеКлиентов.ПутьКДанным = "Объект.смартОборудованиеКлиентов";
	ТЗ = Объект.смартОборудованиеКлиентов.Выгрузить();
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл		
		
		Если Колонка.Имя = "ИсходныйНомерСтроки" Тогда
			Продолжить;
		КонецЕсли;
		
		//++ #5306 смарт: Тимофеева 20.01.26 / Cписок оборудования клиента в карточке клиента
		Если Колонка.Имя = "смартИдентификатор" Тогда
			Продолжить;
		КонецЕсли;
		//-- #5306 смарт: Тимофеева 20.01.26
		
		Рек = Элементы.Добавить("смартОборудованиеКлиентов" + Колонка.Имя, Тип("ПолеФормы"), смартОборудованиеКлиентов);
		Рек.Вид 		= ВидПоляФормы.ПолеВвода;
		Рек.ПутьКДанным = "Объект.смартОборудованиеКлиентов." + Колонка.Имя;
		Рек.Заголовок 	= Колонка.Заголовок;
	КонецЦикла;
	
	Элементы.смартОборудованиеКлиентов.КоманднаяПанель.Видимость = Ложь;
	Элементы.смартОборудованиеКлиентов.КонтекстноеМеню.Видимость = Ложь;
	Элементы.смартОборудованиеКлиентов.КонтекстноеМеню.Доступность = Ложь;
	
	//////////////////
	// Чернила
	
	// Группа
	
	смартГруппаЧернилаКлиента = Элементы.Добавить("смартГруппаЧернилаКлиента", Тип("ГруппаФормы"), Элементы.ГруппаСвязанныеСписки2);
	
	смартГруппаЧернилаКлиента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаЧернилаКлиента.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
	смартГруппаЧернилаКлиента.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
	смартГруппаЧернилаКлиента.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаЧернилаКлиента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаЧернилаКлиента.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	смартГруппаЧернилаКлиента.Заголовок = "Чернила клиента (смарт)";
	смартГруппаЧернилаКлиента.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ОсновнойГолубой;
	смартГруппаЧернилаКлиента.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
		
	// Команды чернила
	
	смартЧернилаКлиентаКомПанель = Элементы.Добавить("смартЧернилаКлиентаКомПанель", Тип("ГруппаФормы"), смартГруппаЧернилаКлиента);
	смартЧернилаКлиентаКомПанель.Вид = ВидГруппыФормы.КоманднаяПанель;

	смартДобавитьЧернилаКлиента = ЭтаФорма.Команды.Добавить("смартДобавитьЧернилаКлиента");
    смартДобавитьЧернилаКлиента.Действие = "смарт_смартДобавитьЧернилаКлиентаПосле";

    Кнопка = Элементы.Добавить("смартЧернилаКлиентасмартДобавитьЧернилаКлиента", Тип("КнопкаФормы"), смартЧернилаКлиентаКомПанель);
    Кнопка.Заголовок = "Добавить";
    Кнопка.ИмяКоманды = "смартДобавитьЧернилаКлиента";

	смартРазрешитьРедактированиеЧернил = ЭтаФорма.Команды.Добавить("смартРазрешитьРедактированиеЧернил");
    смартРазрешитьРедактированиеЧернил.Действие = "смарт_смартРазрешитьРедактированиеЧернилПосле";

    Кнопка = Элементы.Добавить("смартЧернилаКлиентасмартРазрешитьРедактированиеЧернил", Тип("КнопкаФормы"), смартЧернилаКлиентаКомПанель);
    Кнопка.Заголовок = "Редактировать";
    Кнопка.ИмяКоманды = "смартРазрешитьРедактированиеЧернил";

	// Таблица
	
	смартЧернилаКлиента = Элементы.Добавить("смартЧернилаКлиента", Тип("ТаблицаФормы"), смартГруппаЧернилаКлиента);
	смартЧернилаКлиента.ПутьКДанным = "Объект.смартЧернилаКлиента";
	ТЗ = Объект.смартЧернилаКлиента.Выгрузить();
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл		
		
		Если Колонка.Имя = "ИсходныйНомерСтроки" Тогда
			Продолжить;
		КонецЕсли;
		
		Рек = Элементы.Добавить("смартЧернилаКлиента" + Колонка.Имя, Тип("ПолеФормы"), смартЧернилаКлиента);
		Рек.Вид 		= ВидПоляФормы.ПолеВвода;
		Рек.ПутьКДанным = "Объект.смартЧернилаКлиента." + Колонка.Имя;
		Рек.Заголовок 	= Колонка.Заголовок;
	КонецЦикла;

	Элементы.смартЧернилаКлиента.КоманднаяПанель.Видимость = Ложь;
	Элементы.смартЧернилаКлиента.КонтекстноеМеню.Видимость = Ложь;
	Элементы.смартЧернилаКлиента.КонтекстноеМеню.Доступность = Ложь;

	
	Элементы.смартОборудованиеКлиентов.ИзменятьСоставСтрок = Ложь;
	Элементы.смартОборудованиеКлиентовсмартОборудованиеКлиента.Доступность 	= Ложь;
	Элементы.смартОборудованиеКлиентовсмартДатаДобавления.Доступность 		= Ложь;

	Элементы.смартЧернилаКлиента.ИзменятьСоставСтрок = Ложь;
	Элементы.смартЧернилаКлиентасмартЧернилаКлиента.Доступность = Ложь;
	Элементы.смартЧернилаКлиентасмартДатаДобавления.Доступность = Ложь;

	
	//////////////////
	// Сервисное обслуживание клиента
	
	смартГруппаСервисноеОбслуживаниеКлиента = Элементы.Добавить("смартГруппаСервисноеОбслуживаниеКлиента", Тип("ГруппаФормы"), Элементы.ГруппаСвязанныеСписки2);
	
	смартГруппаСервисноеОбслуживаниеКлиента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаСервисноеОбслуживаниеКлиента.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
	смартГруппаСервисноеОбслуживаниеКлиента.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
	смартГруппаСервисноеОбслуживаниеКлиента.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаСервисноеОбслуживаниеКлиента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаСервисноеОбслуживаниеКлиента.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	смартГруппаСервисноеОбслуживаниеКлиента.Заголовок = "Сервисное обслуживание клиента (смарт)";
	смартГруппаСервисноеОбслуживаниеКлиента.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ОсновнойГолубой;
	смартГруппаСервисноеОбслуживаниеКлиента.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
		
	ТекстЗапроса = смартПолучитьТекстЗапросаДинамическогоСписка();
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Заявка");
	МассивКолонок.Добавить("Контрагент");
	МассивКолонок.Добавить("Статус");

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Клиент", Объект.Ссылка);
	
	СписокДействий = Новый Структура("Выбор","смартСервисноеОбслуживаниеКлиентаВыбор");
	
	смартСозданиеДинамическогоСписка("смартСервисноеОбслуживаниеКлиента", ТекстЗапроса, МассивКолонок, СписокДействий,, "смартГруппаСервисноеОбслуживаниеКлиента",,, ПараметрыЗапроса);

	//////////////////
	// Доставка по умолчанию
	
	//++ #Б-3552 смарт: Фролов 11.06.2025 //Заполнение раздела Доставка в заказе клиента на регулярной основе. 
	//смартДоставка = Элементы.Добавить("смартДоставка", Тип("ГруппаФормы"), Элементы.ГруппаСвязанныеСписки2);
	смартДоставкаГлавная = Элементы.Добавить("смартДоставкаГлавная", Тип("ГруппаФормы"), Элементы.ГруппаСвязанныеСписки2);
	
	смартДоставкаГлавная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартДоставкаГлавная.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
	смартДоставкаГлавная.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
	смартДоставкаГлавная.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартДоставкаГлавная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартДоставкаГлавная.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	смартДоставкаГлавная.Заголовок = "Доставка по умолчанию (смарт)";
	смартДоставкаГлавная.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ОсновнойГолубой;
	смартДоставкаГлавная.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
	
	//смартГруппаВнимание = Элементы.Добавить("смартГруппаВнимание", Тип("ГруппаФормы"), смартДоставка);
	смартГруппаВнимание = Элементы.Добавить("смартГруппаВнимание", Тип("ГруппаФормы"), смартДоставкаГлавная);
	смартГруппаВнимание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВнимание.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	смартГруппаВнимание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	смартГруппаВнимание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВнимание.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	смартГруппаВнимание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	смартВниманиеЗначек = Элементы.Добавить("смартВниманиеЗначек", Тип("ДекорацияФормы"), смартГруппаВнимание);
	смартВниманиеЗначек.Вид = ВидДекорацииФормы.Картинка;
	смартВниманиеЗначек.Картинка = БиблиотекаКартинок.Внимание16;
	
	смартВнимание = Элементы.Добавить("смартВнимание", Тип("ДекорацияФормы"), смартГруппаВнимание);
	смартВнимание.Вид = ВидДекорацииФормы.Надпись;
	смартВнимание.Заголовок = "Заполните поля доставки, которые должны автоматически заполняться в заказе клиента.";	
	
    //смартПартнерСпособДоставки = Элементы.Добавить("смартПартнерСпособДоставки", Тип("ПолеФормы"), смартДоставка);
	смартПартнерСпособДоставки = Элементы.Добавить("смартПартнерСпособДоставки", Тип("ПолеФормы"), смартДоставкаГлавная);
    смартПартнерСпособДоставки.Вид = ВидПоляФормы.ПолеВвода;
    смартПартнерСпособДоставки.ПутьКДанным = "Объект.смартПартнерСпособДоставки";
	смартПартнерСпособДоставки.УстановитьДействие("ПриИзменении", "смартПартнерСпособДоставкиПриИзменении");
	
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 28.09.2021 16:56:19
    смартПартнерСпособДоставки.РежимВыбораИзСписка=Истина;
    смартПартнерСпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.Самовывоз,"Самовывоз (с нашего склада)");
    смартПартнерСпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.ДоКлиента,"Наша транспортная служба до клиента");
    смартПартнерСпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу,"Наша транспортная служба до перевозчика");
    смартПартнерСпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика,"Перевозчик (с нашего склада)");
	//++ #4286 смарт: Тимофеева 08.09.2025 / Форма справочника Партнеры. Доставка по умолчанию. Доработка.
    //смартПартнерСпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки,"На усмотрение транспортной службы");
	//-- #4286 смарт: Тимофеева 08.09.2025
	//Смарт }Подкин Алексей Иванович 28.09.2021 16:56:19
	
	смартПартнерСпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал, "Самовывоз со склада Адмирал/Атлант (смарт)");
	
	//смартПартнерАдресДоставки = Элементы.Добавить("смартПартнерАдресДоставки", Тип("ПолеФормы"), смартДоставка);
	смартПартнерАдресДоставки = Элементы.Добавить("смартПартнерАдресДоставки", Тип("ПолеФормы"), смартДоставкаГлавная);
	смартПартнерАдресДоставки.ПутьКДанным = "Объект.смартПартнерАдресДоставки";
	смартПартнерАдресДоставки.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерАдресДоставки.УстановитьДействие("НачалоВыбора", "смартПартнерАдресНачалоВыбора");
	смартПартнерАдресДоставки.КнопкаВыпадающегоСписка = Истина;
	смартПартнерАдресДоставки.КнопкаВыбора = Истина;
	//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
	смартПартнерАдресДоставки.УстановитьДействие("ОбработкаВыбора", "смартПартнерАдресДоставкиОбработкаВыбора");
	//-- #Б4248 смарт: Шляпников 16.09.2025
	
	смартДоставкаАдмирал = Элементы.Добавить("смартДоставкаАдмирал", Тип("ГруппаФормы"), смартДоставкаГлавная);
	смартДоставкаАдмирал.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартДоставкаАдмирал.Заголовок = "Транспортное средство и доставка";
	смартДоставкаАдмирал.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	смартДоставкаАдмирал.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	смартВидТранспорта = Элементы.Добавить("смартВидТранспорта", Тип("ПолеФормы"), смартДоставкаАдмирал);
	смартВидТранспорта.Вид = ВидПоляФормы.ПолеВвода;
	смартВидТранспорта.ПутьКДанным = "Объект.смартВидТранспорта";
	
	смартНомерМашины = Элементы.Добавить("смартНомерМашины", Тип("ПолеФормы"), смартДоставкаАдмирал);
	смартНомерМашины.Вид = ВидПоляФормы.ПолеВвода;
	смартНомерМашины.ПутьКДанным = "Объект.смартНомерМашины";

	смартНомерПрицепа = Элементы.Добавить("смартНомерПрицепа", Тип("ПолеФормы"), смартДоставкаАдмирал);
	смартНомерПрицепа.Вид = ВидПоляФормы.ПолеВвода;
	смартНомерПрицепа.ПутьКДанным = "Объект.смартНомерПрицепа";
	
	смартГруппаВодителиАдмирал = Элементы.Добавить("смартГруппаВодителиАдмирал", Тип("ГруппаФормы"), смартДоставкаАдмирал);
	смартГруппаВодителиАдмирал.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВодителиАдмирал.Заголовок = "Данные водителей";
	смартГруппаВодителиАдмирал.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	смартГруппаВодителиАдмирал.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	смартГруппаВодитель1 = Элементы.Добавить("смартГруппаВодитель1", Тип("ГруппаФормы"), смартГруппаВодителиАдмирал);
	смартГруппаВодитель1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВодитель1.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	смартГруппаВодитель1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	смартФИОВодителя = Элементы.Добавить("смартФИОВодителя", Тип("ПолеФормы"), смартГруппаВодитель1);
	смартФИОВодителя.Вид = ВидПоляФормы.ПолеВвода;
	смартФИОВодителя.ПутьКДанным = "Объект.смартФИОВодителя";
	смартФИОВодителя.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	смартНомерСерияПаспортВодителя = Элементы.Добавить("смартНомерСерияПаспортВодителя", Тип("ПолеФормы"), смартГруппаВодитель1);
	смартНомерСерияПаспортВодителя.Вид = ВидПоляФормы.ПолеВвода;
	смартНомерСерияПаспортВодителя.ПутьКДанным = "Объект.смартНомерСерияПаспортВодителя";
	смартНомерСерияПаспортВодителя.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	смартДатаВыдачиПаспортаВодителя = Элементы.Добавить("смартДатаВыдачиПаспортаВодителя", Тип("ПолеФормы"), смартГруппаВодитель1);
	смартДатаВыдачиПаспортаВодителя.Вид = ВидПоляФормы.ПолеВвода;
	смартДатаВыдачиПаспортаВодителя.ПутьКДанным = "Объект.смартДатаВыдачиПаспортаВодителя";
	смартДатаВыдачиПаспортаВодителя.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	смартГруппаВодитель2 = Элементы.Добавить("смартГруппаВодитель2", Тип("ГруппаФормы"), смартГруппаВодителиАдмирал);
	смартГруппаВодитель2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВодитель2.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	смартГруппаВодитель2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	смартФИОВторогоВодителя = Элементы.Добавить("смартФИОВторогоВодителя", Тип("ПолеФормы"), смартГруппаВодитель2);
	смартФИОВторогоВодителя.Вид = ВидПоляФормы.ПолеВвода;
	смартФИОВторогоВодителя.ПутьКДанным = "Объект.смартФИОВторогоВодителя";
	смартФИОВторогоВодителя.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	смартНомерСерияПаспортВторогоВодителя = Элементы.Добавить("смартНомерСерияПаспортВторогоВодителя", Тип("ПолеФормы"), смартГруппаВодитель2);
	смартНомерСерияПаспортВторогоВодителя.Вид = ВидПоляФормы.ПолеВвода;
	смартНомерСерияПаспортВторогоВодителя.ПутьКДанным = "Объект.смартНомерСерияПаспортВторогоВодителя";
	смартНомерСерияПаспортВторогоВодителя.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	смартДатаВыдачиПаспортаВторогоВодителя = Элементы.Добавить("смартДатаВыдачиПаспортаВторогоВодителя", Тип("ПолеФормы"), смартГруппаВодитель2);
	смартДатаВыдачиПаспортаВторогоВодителя.Вид = ВидПоляФормы.ПолеВвода;
	смартДатаВыдачиПаспортаВторогоВодителя.ПутьКДанным = "Объект.смартДатаВыдачиПаспортаВторогоВодителя";
	смартДатаВыдачиПаспортаВторогоВодителя.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	смартДоставка = Элементы.Добавить("смартДоставка", Тип("ГруппаФормы"), смартДоставкаГлавная);
	смартДоставка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартДоставка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	смартДоставка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//-- #Б-3552 смарт: Фролов 11.06.2025
	
	смартПартнерПеревозчикПартнер = Элементы.Добавить("смартПартнерПеревозчикПартнер", Тип("ПолеФормы"), смартДоставка);
	смартПартнерПеревозчикПартнер.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерПеревозчикПартнер.ПутьКДанным = "Объект.смартПартнерПеревозчикПартнер";
	смартПартнерПеревозчикПартнер.УстановитьДействие("ПриИзменении", "смартПартнерПеревозчикПартнерПриИзменении");
	
	смартПартнерАдресДоставкиПеревозчика = Элементы.Добавить("смартПартнерАдресДоставкиПеревозчика", Тип("ПолеФормы"), смартДоставка);
	смартПартнерАдресДоставкиПеревозчика.ПутьКДанным = "Объект.смартПартнерАдресДоставкиПеревозчика";
	смартПартнерАдресДоставкиПеревозчика.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерАдресДоставкиПеревозчика.УстановитьДействие("НачалоВыбора", "смартПартнерАдресНачалоВыбора");
	смартПартнерАдресДоставкиПеревозчика.КнопкаВыпадающегоСписка = Истина;
	смартПартнерАдресДоставкиПеревозчика.КнопкаВыбора = Истина;
	
	смартПартнерЗонаДоставки = Элементы.Добавить("смартПартнерЗонаДоставки", Тип("ПолеФормы"), смартДоставка);
	смартПартнерЗонаДоставки.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерЗонаДоставки.ПутьКДанным = "Объект.смартПартнерЗонаДоставки";
	
	смартГруппаВремяДоставки = Элементы.Добавить("смартГруппаВремяДоставки", Тип("ГруппаФормы"), смартДоставка);
	смартГруппаВремяДоставки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВремяДоставки.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаВремяДоставки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартГруппаВремяДоставки.ОтображатьЗаголовок = Ложь;
	
	смартВремяДоставки = Элементы.Добавить("смартВремяДоставки", Тип("ДекорацияФормы"), смартГруппаВремяДоставки);
	смартВремяДоставки.Вид = ВидДекорацииФормы.Надпись;
	смартВремяДоставки.Заголовок = "Время доставки";
	
	смартПартнерВремяДоставкиС = Элементы.Добавить("смартПартнерВремяДоставкиС", Тип("ПолеФормы"), смартГруппаВремяДоставки);
	смартПартнерВремяДоставкиС.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерВремяДоставкиС.ПутьКДанным = "Объект.смартПартнерВремяДоставкиС";
	смартПартнерВремяДоставкиС.Заголовок = "с";
	
	смартПартнерВремяДоставкиПо = Элементы.Добавить("смартПартнерВремяДоставкиПо", Тип("ПолеФормы"), смартГруппаВремяДоставки);
	смартПартнерВремяДоставкиПо.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерВремяДоставкиПо.ПутьКДанным = "Объект.смартПартнерВремяДоставкиПо";
	смартПартнерВремяДоставкиПо.Заголовок = "по";
	
	смартПартнерДополнительнаяИнформацияПоДоставке = Элементы.Добавить("смартПартнерДополнительнаяИнформацияПоДоставке", Тип("ПолеФормы"), смартДоставка);
	смартПартнерДополнительнаяИнформацияПоДоставке.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерДополнительнаяИнформацияПоДоставке.ПутьКДанным = "Объект.смартПартнерДополнительнаяИнформацияПоДоставке";
	смартПартнерДополнительнаяИнформацияПоДоставке.МногострочныйРежим = Истина;
	//смартПартнерДополнительнаяИнформацияПоДоставке.АвтоМаксимальнаяШирина = Ложь;
	
	смартПартнерОсобыеУсловияПеревозки = Элементы.Добавить("смартПартнерОсобыеУсловияПеревозки", Тип("ПолеФормы"), смартДоставка);
	смартПартнерОсобыеУсловияПеревозки.Вид = ВидПоляФормы.ПолеФлажка;
	смартПартнерОсобыеУсловияПеревозки.ПутьКДанным = "Объект.смартПартнерОсобыеУсловияПеревозки";
	смартПартнерОсобыеУсловияПеревозки.УстановитьДействие("ПриИзменении", "смартПартнерОсобыеУсловияПеревозкиПриИзменении");
	
	смартПартнерОсобыеУсловияПеревозкиОписание = Элементы.Добавить("смартПартнерОсобыеУсловияПеревозкиОписание", Тип("ПолеФормы"), смартДоставка);
	смартПартнерОсобыеУсловияПеревозкиОписание.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерОсобыеУсловияПеревозкиОписание.МногострочныйРежим = Истина;
	смартПартнерОсобыеУсловияПеревозкиОписание.ПутьКДанным = "Объект.смартПартнерОсобыеУсловияПеревозкиОписание";
	смартПартнерОсобыеУсловияПеревозкиОписание.Заголовок = "Особые условия перевозки";
	
	смартПартнерКонтактноеЛицо = Элементы.Добавить("смартПартнерКонтактноеЛицо", Тип("ПолеФормы"), смартДоставка);
	смартПартнерКонтактноеЛицо.ПутьКДанным = "Объект.смартПартнерКонтактноеЛицо";
	смартПартнерКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерКонтактноеЛицо.УстановитьДействие("ПриИзменении", "смартПартнерКонтактноеЛицоПриИзменении");
	смартПартнерКонтактноеЛицо.УстановитьДействие("НачалоВыбора", "смартПартнерКонтактноеЛицоНачалоВыбора");
	
	смартПартнерТелефонКонтактногоЛица = Элементы.Добавить("смартПартнерТелефонКонтактногоЛица", Тип("ПолеФормы"), смартДоставка);
	смартПартнерТелефонКонтактногоЛица.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерТелефонКонтактногоЛица.ПутьКДанным = "Объект.смартПартнерТелефонКонтактногоЛица";
	смартПартнерТелефонКонтактногоЛица.КнопкаВыпадающегоСписка = Истина;

	смартГруппаДополнительныеРеквизитыДоставки = Элементы.Добавить("смартГруппаДополнительныеРеквизитыДоставки", Тип("ГруппаФормы"), смартДоставка);
	смартГруппаДополнительныеРеквизитыДоставки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаДополнительныеРеквизитыДоставки.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	смартГруппаДополнительныеРеквизитыДоставки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаДополнительныеРеквизитыДоставки.Заголовок = "Дополнительные реквизиты доставки";
	
	смартПартнерПропускнаяСистема = Элементы.Добавить("смартПартнерПропускнаяСистема", Тип("ПолеФормы"), смартГруппаДополнительныеРеквизитыДоставки);
	смартПартнерПропускнаяСистема.Вид = ВидПоляФормы.ПолеФлажка;
	смартПартнерПропускнаяСистема.ПутьКДанным = "Объект.смартПартнерПропускнаяСистема";

	смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией = Элементы.Добавить("смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией", Тип("ПолеФормы"), смартГруппаДополнительныеРеквизитыДоставки);
	смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией.ПутьКДанным = "Объект.смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией";

	смартПартнерСпособДоставкиТовара = Элементы.Добавить("смартПартнерСпособДоставкиТовара", Тип("ПолеФормы"), смартГруппаДополнительныеРеквизитыДоставки);
	смартПартнерСпособДоставкиТовара.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерСпособДоставкиТовара.ПутьКДанным = "Объект.смартПартнерСпособДоставкиТовара";

	смартПартнерПлатильщикЗаДоставкуГруза = Элементы.Добавить("смартПартнерПлатильщикЗаДоставкуГруза", Тип("ПолеФормы"), смартГруппаДополнительныеРеквизитыДоставки);
	смартПартнерПлатильщикЗаДоставкуГруза.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерПлатильщикЗаДоставкуГруза.ПутьКДанным = "Объект.смартПартнерПлатильщикЗаДоставкуГруза";
	
	//++ #Б-3552 смарт: Фролов 26.06.2025 //Заполнение раздела Доставка в заказе клиента на регулярной основе. 
    смартДоставкаАдмирал.Видимость = Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал;
	смартДоставка.Видимость = НЕ Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал;
	//-- #Б-3552 смарт: Фролов 26.06.2025
	
	//++ #4286 смарт: Тимофеева 08.09.2025 / Форма справочника Партнеры. Доставка по умолчанию. Доработка.
	Элементы.смартПартнерДополнительнаяИнформацияПоДоставке.РастягиватьПоВертикали = Ложь;
	Элементы.смартПартнерДополнительнаяИнформацияПоДоставке.Ширина = 56;
	Элементы.смартПартнерДополнительнаяИнформацияПоДоставке.Высота = 3;

	Элементы.Переместить(Элементы.смартГруппаДополнительныеРеквизитыДоставки, Элементы.смартДоставкаГлавная);
	
	смартГруппаСпособДоставки = Элементы.Добавить("смартГруппаСпособДоставки", Тип("ГруппаФормы"), Элементы.смартДоставкаГлавная);
	смартГруппаСпособДоставки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаСпособДоставки.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаСпособДоставки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартГруппаСпособДоставки.Заголовок = "Способ доставки/Перевозчик";
	смартГруппаСпособДоставки.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.смартГруппаСпособДоставки, Элементы.смартДоставкаГлавная, Элементы.смартПартнерАдресДоставки);	
	Элементы.Переместить(Элементы.смартПартнерСпособДоставки, Элементы.смартГруппаСпособДоставки);
	Элементы.Переместить(Элементы.смартПартнерПеревозчикПартнер, Элементы.смартГруппаСпособДоставки);
	Элементы.смартПартнерПеревозчикПартнер.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; 
	МассивПеревозчиков = ПолучитьМассивПеревозчиков();
	Элементы.смартПартнерПеревозчикПартнер.СписокВыбора.ЗагрузитьЗначения(МассивПеревозчиков);	
	Элементы.смартПартнерПеревозчикПартнер.КнопкаСпискаВыбора = Истина;	
	
	//Элементы.смартПартнерАдресДоставки.КнопкаВыпадающегоСписка = Ложь;
	//Элементы.смартПартнерАдресДоставки.УстановитьДействие("Автоподбор",      "АдресДоставкиАвтоподбор");
	//Элементы.смартПартнерАдресДоставки.УстановитьДействие("ОбработкаВыбора", "АдресДоставкиОбработкаВыбора"); 
	
	Элементы.смартДоставка.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	смартГруппаКонтактноеЛицо = Элементы.Добавить("смартГруппаКонтактноеЛицо", Тип("ГруппаФормы"), Элементы.смартДоставкаГлавная);
	смартГруппаКонтактноеЛицо.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаКонтактноеЛицо.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаКонтактноеЛицо.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаКонтактноеЛицо.Заголовок = "Контактное лицо";
	смартГруппаКонтактноеЛицо.ОтображатьЗаголовок = Ложь;
	Элементы.Переместить(Элементы.смартГруппаКонтактноеЛицо, Элементы.смартДоставкаГлавная, Элементы.смартГруппаДополнительныеРеквизитыДоставки);
    Элементы.Переместить(Элементы.смартПартнерКонтактноеЛицо, Элементы.смартГруппаКонтактноеЛицо);
	Элементы.Переместить(Элементы.смартПартнерТелефонКонтактногоЛица, Элементы.смартГруппаКонтактноеЛицо); 
	
	Элементы.Переместить(Элементы.смартДоставкаАдмирал, Элементы.смартДоставкаГлавная);
	
	ЭтоСамовывоз	= Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	ЭтоДоКлиента	= Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
	ЭтоСиламиПеревозчикаПоАдресу	= Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу;
	ЭтоСиламиПеревозчика	= Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
	ЭтоКПолучателюОпределяетСлужбаДоставки	= Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки;
	ЭтосмартСамовывозСоСкладаАдмирал	= Объект.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал;
	
	Элементы.смартПартнерАдресДоставки.Видимость	= НЕ ЭтосмартСамовывозСоСкладаАдмирал И НЕ ЭтоСамовывоз; 
	Элементы.смартПартнерАдресДоставки.Заголовок	= ?(ЭтоСиламиПеревозчикаПоАдресу ИЛИ ЭтоСиламиПеревозчика, "Адрес доставки до клиента", "Адрес доставки");
	Элементы.смартПартнерАдресДоставки.ПоложениеЗаголовка = ?(ЭтоСиламиПеревозчикаПоАдресу ИЛИ ЭтоСиламиПеревозчика, ПоложениеЗаголовкаЭлементаФормы.Верх,
																ПоложениеЗаголовкаЭлементаФормы.Авто);
	Элементы.смартПартнерПеревозчикПартнер.Видимость	= ЭтоСиламиПеревозчикаПоАдресу ИЛИ ЭтоСиламиПеревозчика; 
	
	// 1 - Самовывоз
	// - 
	
	// 2 - До клиента
	Элементы.смартДоставка.Видимость	= ЭтоДоКлиента;
	Элементы.смартПартнерОсобыеУсловияПеревозки.Видимость	= Ложь;
	Элементы.смартПартнерОсобыеУсловияПеревозкиОписание.Видимость = Ложь; 
	//Элементы.смартПартнерКонтактноеЛицо.Видимость	= Ложь;
	//Элементы.смартПартнерТелефонКонтактногоЛица.Видимость	= Ложь;

	// 3 - Силами перевозчика по адресу
	// 
	смартГруппаСиламиПеревозчикаПоАдресу = Элементы.Добавить("смартГруппаСиламиПеревозчикаПоАдресу", Тип("ГруппаФормы"), Элементы.смартДоставкаГлавная);
	смартГруппаСиламиПеревозчикаПоАдресу.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаСиламиПеревозчикаПоАдресу.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаСиламиПеревозчикаПоАдресу.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаСиламиПеревозчикаПоАдресу.Заголовок = "Доставка силами перевозчика(наша транспортная компания до перевозчика)";
	смартГруппаСиламиПеревозчикаПоАдресу.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.смартГруппаСиламиПеревозчикаПоАдресу, Элементы.смартДоставкаГлавная, Элементы.смартПартнерАдресДоставки);
	Элементы.Переместить(Элементы.смартПартнерАдресДоставкиПеревозчика, Элементы.смартГруппаСиламиПеревозчикаПоАдресу);
	Элементы.смартПартнерАдресДоставкиПеревозчика.Заголовок = "Адрес доставки до перевозчика";
	Элементы.смартПартнерАдресДоставкиПеревозчика.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Элементы.смартПартнерАдресДоставкиПеревозчика.УстановитьДействие("Автоподбор",      "АдресДоставкиАвтоподбор");
	Элементы.смартПартнерАдресДоставкиПеревозчика.УстановитьДействие("ОбработкаВыбора", "АдресДоставкиОбработкаВыбора"); 
	
	смартГруппаЗонаВремяДоставки = Элементы.Добавить("смартГруппаЗонаВремяДоставки", Тип("ГруппаФормы"), смартГруппаСиламиПеревозчикаПоАдресу);
	смартГруппаЗонаВремяДоставки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаЗонаВремяДоставки.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаЗонаВремяДоставки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартГруппаЗонаВремяДоставки.ОтображатьЗаголовок = Ложь;
		
	смартПартнерЗонаДоставки1 = Элементы.Добавить("смартПартнерЗонаДоставки1", Тип("ПолеФормы"), смартГруппаЗонаВремяДоставки);	
	смартПартнерЗонаДоставки1.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерЗонаДоставки1.Заголовок = "Зона доставки до перевозчика";
	смартПартнерЗонаДоставки1.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	смартПартнерЗонаДоставки1.ПутьКДанным = "Объект.смартПартнерЗонаДоставки";
	
	смартПартнерВремяДоставкиС1 = Элементы.Добавить("смартПартнерВремяДоставкиС1", Тип("ПолеФормы"), смартГруппаЗонаВремяДоставки);
	смартПартнерВремяДоставкиС1.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерВремяДоставкиС1.ПутьКДанным = "Объект.смартПартнерВремяДоставкиС";
	смартПартнерВремяДоставкиС1.Заголовок = "Время доставки перевозчику с";
	
	смартПартнерВремяДоставкиПо1 = Элементы.Добавить("смартПартнерВремяДоставкиПо1", Тип("ПолеФормы"), смартГруппаЗонаВремяДоставки);
	смартПартнерВремяДоставкиПо1.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерВремяДоставкиПо1.ПутьКДанным = "Объект.смартПартнерВремяДоставкиПо";
	смартПартнерВремяДоставкиПо1.Заголовок = "по";
	
	смартПартнерДополнительнаяИнформацияПоДоставке1 = Элементы.Добавить("смартПартнерДополнительнаяИнформацияПоДоставке1", Тип("ПолеФормы"), смартГруппаСиламиПеревозчикаПоАдресу);
	смартПартнерДополнительнаяИнформацияПоДоставке1.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерДополнительнаяИнформацияПоДоставке1.Заголовок = "Дополнительная информация по доставке до перевозчика";
	смартПартнерДополнительнаяИнформацияПоДоставке1.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	смартПартнерДополнительнаяИнформацияПоДоставке1.ПутьКДанным = "Объект.смартПартнерДополнительнаяИнформацияПоДоставке";
	смартПартнерДополнительнаяИнформацияПоДоставке1.МногострочныйРежим = Истина;
	смартПартнерДополнительнаяИнформацияПоДоставке1.РастягиватьПоВертикали = Ложь;
	смартПартнерДополнительнаяИнформацияПоДоставке1.Ширина = 56;
	смартПартнерДополнительнаяИнформацияПоДоставке1.Высота = 3;
	
	Элементы.смартГруппаСиламиПеревозчикаПоАдресу.Видимость = ЭтоСиламиПеревозчикаПоАдресу;
	
	// 4 - Силами перевозчика
	
	смартГруппаСиламиПеревозчика = Элементы.Добавить("смартГруппаСиламиПеревозчика", Тип("ГруппаФормы"), Элементы.смартДоставкаГлавная);
	смартГруппаСиламиПеревозчика.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаСиламиПеревозчика.Отображение = ОтображениеОбычнойГруппы.Нет;
	смартГруппаСиламиПеревозчика.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаСиламиПеревозчика.Заголовок = "Доставка силами перевозчика";
	смартГруппаСиламиПеревозчика.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.смартГруппаСиламиПеревозчика, Элементы.смартДоставкаГлавная, Элементы.смартГруппаКонтактноеЛицо);
	
	смартПартнерДополнительнаяИнформацияПоДоставке2 = Элементы.Добавить("смартПартнерДополнительнаяИнформацияПоДоставке2", Тип("ПолеФормы"), смартГруппаСиламиПеревозчика);
	смартПартнерДополнительнаяИнформацияПоДоставке2.Вид = ВидПоляФормы.ПолеВвода;
	смартПартнерДополнительнаяИнформацияПоДоставке2.Заголовок = "Дополнительная информация по доставке";
	смартПартнерДополнительнаяИнформацияПоДоставке2.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	смартПартнерДополнительнаяИнформацияПоДоставке2.ПутьКДанным = "Объект.смартПартнерДополнительнаяИнформацияПоДоставке";
	смартПартнерДополнительнаяИнформацияПоДоставке2.МногострочныйРежим = Истина;
	смартПартнерДополнительнаяИнформацияПоДоставке2.РастягиватьПоВертикали = Ложь;
	смартПартнерДополнительнаяИнформацияПоДоставке2.Ширина = 56;
	смартПартнерДополнительнаяИнформацияПоДоставке2.Высота = 3;
		
	Элементы.смартГруппаСиламиПеревозчика.Видимость = ЭтоСиламиПеревозчика;
    
	// 5 - 
	Элементы.смартГруппаДополнительныеРеквизитыДоставки.Видимость = НЕ ЭтосмартСамовывозСоСкладаАдмирал;
	
 	//-- #4286 смарт: Тимофеева 08.09.2025
	#КонецОбласти
	
	//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
	смартКомандаСкидки = ЭтаФорма.Команды.Добавить("БыстрыйВвод_Скидки");
    смартКомандаСкидки.Действие = "БыстрыйВвод_СменитьСтраницу";

    смартКнопкаСкидки = Элементы.Вставить("БыстрыйВвод_Скидки", Тип("КнопкаФормы"), Элементы.Лента_КомандыЛево, Элементы.БыстрыйВвод_Взаимодействие);
    смартКнопкаСкидки.Заголовок = "Скидки";
    смартКнопкаСкидки.ИмяКоманды = "БыстрыйВвод_Скидки";
	смартКнопкаСкидки.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	смартКнопкаСкидки.РастягиватьПоВертикали = Ложь;
	смартКнопкаСкидки.ЦветТекста = Новый Цвет(0, 160,242);
	
    смартСтраницаСкидки = Элементы.Вставить("БыстрыйВвод_СтраницаСкидки", Тип("ГруппаФормы"), Элементы.БыстрыйВвод_Страницы, Элементы.БыстрыйВвод_СтраницаВзаимодействие);
	смартСтраницаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартСтраницаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартСтраницаСкидки.ОтображатьЗаголовок = Ложь;
	смартСтраницаСкидки.Видимость = Ложь;
	
    смартКнопкаСоздатьСкидки = Элементы.Вставить("БыстрыйВвод_СоздатьСкидки", Тип("КнопкаФормы"), Элементы.БыстрыйВвод_СтраницаСкидки);
	смартКнопкаСоздатьСкидки.ИмяКоманды = "БыстрыйВвод_Скидки";
	смартКнопкаСоздатьСкидки.Видимость = Ложь;

	смартКоманднаяПанельСкидки = Элементы.Вставить("смартКоманднаяПанельСкидки", Тип("ГруппаФормы"), Элементы.БыстрыйВвод_СтраницаСкидки);
	смартКоманднаяПанельСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартКоманднаяПанельСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартКоманднаяПанельСкидки.ОтображатьЗаголовок = Ложь;
	
	смартКомандаДобавитьСкидку = ЭтаФорма.Команды.Добавить("смартКомандаДобавитьСкидку");
    смартКомандаДобавитьСкидку.Действие = "смартДобавитьСкидку";

    смартКнопкаДобавитьСкидку = Элементы.Вставить("смартКнопкаДобавитьСкидку", Тип("КнопкаФормы"), Элементы.смартКоманднаяПанельСкидки);
    смартКнопкаДобавитьСкидку.Заголовок = "Добавить скидку";
    смартКнопкаДобавитьСкидку.ИмяКоманды = "смартКомандаДобавитьСкидку";
	смартКнопкаДобавитьСкидку.Картинка = БиблиотекаКартинок.сфпДобавитьКонтакт;
	смартКнопкаДобавитьСкидку.Отображение = ОтображениеКнопки.КартинкаИТекст;

	НовыеРеквизиты = Новый Массив;
	МассивТиповРеквизитДатаИндивидуальныхСкидок = Новый Массив;
	МассивТиповРеквизитДатаИндивидуальныхСкидок.Добавить(Тип("Дата"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("смартДатаИндивидуальныхСкидок", Новый ОписаниеТипов(МассивТиповРеквизитДатаИндивидуальныхСкидок, , Новый КвалификаторыДаты(ЧастиДаты.Дата))));
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	ЭтаФорма.смартДатаИндивидуальныхСкидок = ТекущаяДата();
	
	ПолеВводаРеквизитДатаИндивидуальныхСкидок = Элементы.Добавить("смартПолеДатаИндивидуальныхСкидок", Тип("ПолеФормы"), Элементы.смартКоманднаяПанельСкидки);
	ПолеВводаРеквизитДатаИндивидуальныхСкидок.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаРеквизитДатаИндивидуальныхСкидок.ПутьКДанным = "смартДатаИндивидуальныхСкидок";
	ПолеВводаРеквизитДатаИндивидуальныхСкидок.УстановитьДействие("ПриИзменении", "смартДатаИндивидуальныхСкидокПриИзменении");
	ПолеВводаРеквизитДатаИндивидуальныхСкидок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеВводаРеквизитДатаИндивидуальныхСкидок.Заголовок = "Скидки на дату";
	ПолеВводаРеквизитДатаИндивидуальныхСкидок.Ширина = 7;
	
	//Список индивидуальных скидок
	МассивКолонокСкидки = Новый Массив;
	МассивКолонокСкидки.Добавить("Начало действия,Период");
	МассивКолонокСкидки.Добавить("Срок действия,СрокДействия");
	МассивКолонокСкидки.Добавить("Группа/Номенклатура,Номенклатура");
	МассивКолонокСкидки.Добавить("% скидки,ПроцентСкидки");
	МассивКолонокСкидки.Добавить("Ответственный,Ответственный");
	МассивКолонокСкидки.Добавить("Документ установки скидок,Регистратор");

	ТекстЗапросаСкидки = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Период КАК Период,
	|	Клиент КАК Клиент,
	|	Номенклатура КАК Номенклатура,
	|	ПроцентСкидки КАК ПроцентСкидки,
	|	Регистратор КАК Регистратор,
	|	СрокДействия КАК СрокДействия,
	|	Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.смартИндивидуальныеСкидкиКлиентов.СрезПоследних(&Дата, Клиент = &Клиент)
	|ГДЕ
	|	ПроцентСкидки <> 0";

	ПараметрыЗапросаСкидки = Новый Структура;
	ПараметрыЗапросаСкидки.Вставить("Клиент", Объект.Ссылка);
	//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
	ПараметрыЗапросаСкидки.Вставить("Дата", КонецДня(ЭтаФорма.смартДатаИндивидуальныхСкидок));
	//--#1868 смарт: Лопато 19.06.2024
	
	смартСозданиеДинамическогоСписка("смартИндивидуальныеСкидкиКлиентов", ТекстЗапросаСкидки, МассивКолонокСкидки, 
									 Неопределено, "", "БыстрыйВвод_СтраницаСкидки", , Ложь, ПараметрыЗапросаСкидки);
	
	Элементы.смартИндивидуальныеСкидкиКлиентовПериод.Ширина = 5;
	Элементы.смартИндивидуальныеСкидкиКлиентовПериод.Формат = "ДФ=dd.MM.yyyy";
	Элементы.смартИндивидуальныеСкидкиКлиентовСрокДействия.Ширина = 5;
	Элементы.смартИндивидуальныеСкидкиКлиентовПроцентСкидки.Ширина = 3;
	Элементы.смартИндивидуальныеСкидкиКлиентовНоменклатура.Ширина = 20;

	смартУстановитьДоступностьРедактированияИндивидуальныхСкидок();
	
	Элементы.смартИндивидуальныеСкидкиКлиентов.УстановитьДействие("Выбор", "смартОткрытьРедактированиеИндивидуальнойСкидки");
	
	Элементы.смартИндивидуальныеСкидкиКлиентов.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.ИспользоватьВсегда;
	Элементы.смартИндивидуальныеСкидкиКлиентов.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.ИспользоватьВсегда;
	//--#1323 смарт: Лопато 25.09.2023
	
КонецПроцедуры //-- смарт:ММ 15.06.2021

//++ #1262 смарт: Фролов 30.11.2022 //Перенос адреса веб сайта в карточке клиента  
// Богус++
//&НаКлиенте
//Процедура смарт_СайтНажатиеПосле(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка=Ложь;
//	ЗапуститьПриложение(Объект.Сайт);
//КонецПроцедуры

//&НаКлиенте
//Процедура смарт_РедактироватьСайтВместо(Команда)
//	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПослеВводаИмениСайта",ЭтаФорма),?(ПустаяСтрока(Объект.Сайт),"",Объект.Сайт),"Введите ссылку на сайт партнера",100);
//КонецПроцедуры

//&НаСервере
//Процедура ПослеВводаИмениСайта(Стр,ДопПараметры)Экспорт 
//	Если Не (Стр=Неопределено Или СтрНачинаетсяС(Стр,"http")) Тогда  
//			Стр="http://"+Стр;
//	КонецЕсли;	
//	Объект.Сайт=Стр;
//	Модифицированность=Истина;
//КонецПроцедуры	
// Богус--
//-- #1262 смарт: Фролов 30.11.2022

//--------------Оборудование клиента------------------------

//Процедуры и функции для реализации функционала управления оборудованием клиента
&НаКлиенте
Процедура РасшСмарт_смартДобавитьОборудованиеКлиента(Команда)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Добавить оборудование");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Вернуться назад");

	ТекстВопроса = НСтр("ru = 'Перед выбором убедитесь, что оборудования, которое вы хотите добавить, нет в списке'");

	Оповещение = Новый ОписаниеОповещения("РасшСмарт_ПослеОтветаНаВопросДобавитьОборудование", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 0,, "Добавление оборудования клиента");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ПослеОтветаНаВопросДобавитьОборудование(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		РасшСмарт_ОткрытьФормуВыбораОборудования();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ОткрытьФормуВыбораОборудования()
	
	ПараметрЗаголовок = НСтр("ru = 'Добавление оборудования для %Справочник%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", НСтр("ru='(новый клиент)'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДобавления", 	Дата(ТекущаяДата()));
	ПараметрыФормы.Вставить("Партнер", 			Объект.Ссылка);
	
	//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
	ПараметрыФормы.Вставить("смартТипОборудованияКлиента", ПредопределенноеЗначение("Перечисление.смартТипыОборудованияКлиента.Оборудование"));
	//-- смарт:ММ 23.04.2020
	
	ПараметрыТовара = РасшСмарт_ПараметрыТаблицыОборудование();
	
	ОткрытьФорму("Справочник.Партнеры.Форма.РасшСмарт_ФормаДобавленияОборудования", 
				ПараметрыФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				Новый ОписаниеОповещения("РасшСмарт_ДобавитьОборудованиеКлиентаПослеВыбора", ЭтотОбъект, ПараметрыТовара),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ДобавитьОборудованиеКлиентаПослеВыбора(ПодобранноеОборудование, ДополнительныеПараметры) Экспорт 
	
	Если ПодобранноеОборудование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасшСмарт_ДобавитьОборудованиеКлиентаЗавершение(ДополнительныеПараметры, ПодобранноеОборудование);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ДобавитьОборудованиеКлиентаЗавершение(ПараметрыОборудования, НовыеСтроки)
	
	//++ #5306 смарт: Тимофеева 20.01.26 / Cписок оборудования клиента в карточке клиента
	
	////ТекстОповещения = РасшСмарт_ДобавитьОборудованиеВСписокНаКлиенте(ПараметрыОборудования, НовыеСтроки);
	//
	//Отбор = Новый Структура("смартОборудованиеКлиента");
	//
	//Для каждого НоваяСтрока Из НовыеСтроки Цикл
	//	
	//	ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
	//	                  
	//	РезультатПоиска = Объект.смартОборудованиеКлиентов.НайтиСтроки(Отбор);
	//	
	//	Если РезультатПоиска.Количество() = 0 Тогда
	//		
	//		ТекущаяСтрока = Объект.смартОборудованиеКлиентов.Добавить();
	//		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Отбор);
	//		ТекущаяСтрока.смартДатаДобавления = Дата(ТекущаяДата());
	//		ТекущаяСтрока.смартКомментарий = НоваяСтрока.смартКомментарий; 
	//		
	//		Если НовыеСтроки.Количество() > 0 Тогда
	//			Элементы.смартОборудованиеКлиентов.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Это оборудование уже добавлено");
	//	КонецЕсли;
	//		
	//	//Если Не РасшСмарт_АдминистраторСервисЦентра() Тогда			
	//	//	ТекстОповещения = НСтр("ru = 'Добавлено новое оборудование клиенту'");	
	//	//КонецЕсли;
	//	
	//КонецЦикла;

	Для Каждого НоваяСтрока Из НовыеСтроки Цикл		
		ТекущаяСтрока	= Объект.смартОборудованиеКлиентов.Добавить();
		ТекущаяСтрока.смартОборудованиеКлиента 			 = НоваяСтрока.смартОборудованиеКлиента;
		ТекущаяСтрока.смартДатаДобавления 				 = Дата(ТекущаяДата());
		ТекущаяСтрока.смартКомментарий 					 = НоваяСтрока.смартКомментарий;
		ТекущаяСтрока.смартИдентификатор				 = Строка(Новый УникальныйИдентификатор);
		
		Элементы.смартОборудованиеКлиентов.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
	КонецЦикла; 
	
	//-- #5306 смарт: Тимофеева 20.01.26
КонецПроцедуры

&НаКлиенте
Функция РасшСмарт_ДобавитьОборудованиеВСписокНаКлиенте(ПараметрыОборудования, НовыеСтроки)

	
	
	//Возврат ТекстОповещения;
	
КонецФункции 

&НаСервере
Функция РасшСмарт_ПараметрыТаблицыОборудование()

	ПараметрыТаблицыОборудование = Новый Структура;
	ПараметрыТаблицыОборудование.Вставить("смартНаименованиеОборудования", "");
	ПараметрыТаблицыОборудование.Вставить("смартОборудованиеКлиента", ПредопределенноеЗначение("Справочник.смартОборудованиеКлиентов.ПустаяСсылка"));
	ПараметрыТаблицыОборудование.Вставить("смартДатаДобавления", '00010101');
	ПараметрыТаблицыОборудование.Вставить("смартКомментарий", "");
	
	Возврат ПараметрыТаблицыОборудование;

КонецФункции // ПараметрыТаблицыОборудование()

&НаСервере
Функция РасшСмарт_АдминистраторСервисЦентра()

	АдминистраторСЦ = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеСоставаОборудованияПартнера");

	Возврат АдминистраторСЦ;
	
КонецФункции // РасшСмарт_АдминистраторСервисЦентра()

&НаКлиенте
Процедура РасшСмарт_смартРазрешитьРедактированиеОборудования(Команда)
	
	РасшСмарт_смартРазрешитьРедактированиеОборудованияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РасшСмарт_смартРазрешитьРедактированиеОборудованияНаСервере()
	
	Если РасшСмарт_АдминистраторСервисЦентра() Тогда
		
		//++ смарт:ММ #108 550 16.06.2021 Объединение с CRM
		//Элементы.смартОборудованиеКлиентовИзменить.Видимость 					= Истина;
		//Элементы.смартОборудованиеКлиентовУдалить.Видимость 					= Истина;
		//Элементы.смартОборудованиеКлиентовсмартОборудованиеКлиента.Доступность 	= Истина;
		//Элементы.смартОборудованиеКлиентовсмартДатаДобавления.Доступность 		= Истина;
		//Элементы.смартОборудованиеКлиентов.ЦветФона 							= ЦветаСтиля.ЦветФонаПоля;
		//Элементы.смартОборудованиеКлиентов.ИзменятьСоставСтрок 					= Истина;
		Элементы.смартОборудованиеКлиентов.ИзменятьСоставСтрок = Истина;
		Элементы.смартОборудованиеКлиентов.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
		Элементы.смартОборудованиеКлиентовсмартОборудованиеКлиента.Доступность 	= Истина;
		Элементы.смартОборудованиеКлиентовсмартДатаДобавления.Доступность 		= Истина;
		//-- смарт:ММ 16.06.2021
	Иначе
		Сообщить("Изменение доступно не всем, обратитесь к администратору");
	КонецЕсли;
	
КонецПроцедуры

//--------------конец Оборудование клиента------------------------

//--------------Чернила клиента------------------------------
#Область ОборудованиеКлиента

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура смарт_смартРазрешитьРедактированиеЧернилПосле(Команда)
	
	РасшСмарт_смартРазрешитьРедактированиеЧернилНаСервере();
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаСервере
Процедура РасшСмарт_смартРазрешитьРедактированиеЧернилНаСервере()
	
	Если РасшСмарт_АдминистраторСервисЦентра() Тогда
		
		//Элементы.смартЧернилаКлиентаИзменить.Видимость 					= Истина;
		//Элементы.смартЧернилаКлиентаУдалить.Видимость 					= Истина;
		Элементы.смартЧернилаКлиентасмартЧернилаКлиента.Доступность 	= Истина;
		Элементы.смартЧернилаКлиентасмартДатаДобавления.Доступность 	= Истина;
		Элементы.смартЧернилаКлиента.ЦветФона 							= ЦветаСтиля.ЦветФонаПоля;
		Элементы.смартЧернилаКлиента.ИзменятьСоставСтрок 				= Истина;
		
	Иначе
		Сообщить("Изменение доступно не всем, обратитесь к администратору");
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура смарт_смартДобавитьЧернилаКлиентаПосле(Команда)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Добавить расходный материал");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Вернуться назад");

	ТекстВопроса = НСтр("ru = 'Перед выбором убедитесь, что расходного материала, который вы хотите добавить, нет в списке'");

	Оповещение = Новый ОписаниеОповещения("РасшСмарт_ПослеОтветаНаВопросДобавитьЧернила", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 0,, "Добавление расходного материала клиента");

КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ПослеОтветаНаВопросДобавитьЧернила(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		РасшСмарт_ОткрытьФормуВыбораЧернил();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ОткрытьФормуВыбораЧернил()
	
	ПараметрЗаголовок = НСтр("ru = 'Добавление чернил для %Справочник%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", НСтр("ru='(новый клиент)'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДобавления", 	Дата(ТекущаяДата()));
	ПараметрыФормы.Вставить("Партнер", 			Объект.Ссылка);
	ПараметрыФормы.Вставить("смартТипОборудованияКлиента", ПредопределенноеЗначение("Перечисление.смартТипыОборудованияКлиента.Чернила"));
	
	ПараметрыТовара = РасшСмарт_ПараметрыТаблицыОборудование();
	
	ОткрытьФорму("Справочник.Партнеры.Форма.РасшСмарт_ФормаДобавленияОборудования", 
				ПараметрыФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				Новый ОписаниеОповещения("РасшСмарт_ДобавитьЧернилаКлиентаПослеВыбора", ЭтотОбъект, ПараметрыТовара),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	Возврат;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ДобавитьЧернилаКлиентаПослеВыбора(ПодобранноеОборудование, ДополнительныеПараметры) Экспорт 
	
	Если ПодобранноеОборудование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасшСмарт_ДобавитьЧернилаКлиентаЗавершение(ДополнительныеПараметры, ПодобранноеОборудование);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ДобавитьЧернилаКлиентаЗавершение(ПараметрыОборудования, НовыеСтроки)
	
	Отбор = Новый Структура("смартЧернилаКлиента");
	
	Для Каждого НоваяСтрока Из НовыеСтроки Цикл
		
		Отбор.смартЧернилаКлиента = НоваяСтрока.смартОборудованиеКлиента;
		                  
		РезультатПоиска = Объект.смартЧернилаКлиента.НайтиСтроки(Отбор);
		
		Если РезультатПоиска.Количество() = 0 Тогда
			
			ТекущаяСтрока = Объект.смартЧернилаКлиента.Добавить();
			ТекущаяСтрока.смартЧернилаКлиента = НоваяСтрока.смартОборудованиеКлиента;
			ТекущаяСтрока.смартДатаДобавления = Дата(ТекущаяДата());
			ТекущаяСтрока.смартКомментарий = НоваяСтрока.смартКомментарий; 
			
			Если НовыеСтроки.Количество() > 0 Тогда
				Элементы.смартЧернилаКлиента.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		Иначе
			Сообщить("Эти чернила уже добавлены");
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

#КонецОбласти
//--------------конец Чернила клиента------------------------

//++ смарт:ММ #082 397 28.02.2021 Заявка на ремонтные работы
Функция смартПолучитьТекстЗапросаДинамическогоСписка()
	
	// ++ 16.03.2021 - функция переделана полностью
	ТекстЗапроса = "";
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	МассивТекстовЗапроса = Новый Массив;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.смартЗаявкаНаГарантийныйРемонт, ТекПользователь) Тогда  
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК Заявка,
		|	смартЗаявкаНаГарантийныйРемонт.Контрагент КАК Контрагент,
		|	смартЗаявкаНаГарантийныйРемонт.Статус КАК Статус
		|ИЗ
		|	Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
		|ГДЕ
		|	смартЗаявкаНаГарантийныйРемонт.Клиент = &Клиент";
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.смартЗаявкаНаПускоНаладку, ТекПользователь) Тогда  
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЗаявкаНаПускоНаладку.Ссылка КАК Заявка,
		|	смартЗаявкаНаПускоНаладку.Контрагент КАК Контрагент,
		|	смартЗаявкаНаПускоНаладку.Статус КАК Статус
		|ИЗ
		|	Документ.смартЗаявкаНаПускоНаладку КАК смартЗаявкаНаПускоНаладку
		|ГДЕ
		|	смартЗаявкаНаПускоНаладку.Партнер = &Клиент";
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.смартЗаявкаНаРемонтныеРаботы, ТекПользователь) Тогда  
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЗаявкаНаРемонтныеРаботы.Ссылка КАК Заявка,
		|	смартЗаявкаНаРемонтныеРаботы.Контрагент КАК Контрагент,
		|	смартЗаявкаНаРемонтныеРаботы.Статус КАК Статус
		|ИЗ
		|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
		|ГДЕ
		|	смартЗаявкаНаРемонтныеРаботы.Партнер = &Клиент";
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстИтог = "";
	
	Если МассивТекстовЗапроса.Количество() = 0 Тогда
		ТекстИтог = 
		"ВЫБРАТЬ
		|	"""" КАК Заявка,
		|	"""" КАК Контрагент,
		|	"""" КАК Статус
		|ГДЕ
		|	ЛОЖЬ
		|	И &Клиент = ЛОЖЬ";
	Иначе
		Для Каждого ТекстЗапроса Из МассивТекстовЗапроса Цикл
			
			Если ТекстИтог = "" Тогда
				ТекстИтог = ТекстЗапроса;
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
				ТекстИтог = ТекстИтог + "
				|ОБЪЕДИНИТЬ ВСЕ
				|" + ТекстЗапроса;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекстИтог;
	
КонецФункции //-- смарт:ММ 28.02.2021

//++ смарт:ММ #082 397 28.02.2021 Заявка на ремонтные работы
&НаСервере
Процедура смартСозданиеДинамическогоСписка(
	
	ИмяСписка = "Список", 			//тип строка - имя будущего списка на форме и реквизита
	ТекстЗапроса = "", 				//тип строка - запрос, если он не указан, необходимо указать таблицу
	МассивКолонок,                  //тип массив - массив создаваемых колонок, значения тип строка. Пример: "Д,ДоговораКонтрагента" значит будет создана колонка
									//				с заголовком "Д" и колонкой списка "ДоговораКонтрагента". Если указать просто "ДоговораКонтрагента", 
									//				заголовок будет идентичен заголовку по умолчанию типа "Договор контрагента".
	СписокДействий = Неопределено,  //типа структура - структура содержит действия (свойства) динамического списка, можно указать только те которые необходимы.
									//				пример: СписокДействий = Новый Структура("Выбор,ПриАктивизацииСтроки","СписокВыбор","СписокПриАктивизацииСтроки")
	ТаблицаСписка = "",				//тип строка - содержит имя основной таблицы, пример: "Документ.РеализацияТоваровУслуг"	
	ДобавитьВ = "",                 //тип строка - имя элемента на который будет размещен список, если пустое, тогда добавляется на форму
	ВставитьПеред = "",             //тип строка - имя элемента перед которым будет размещен список, если пустое, будет просто добавлен в конец
	СвояКоманднаяПанель = ЛОЖЬ,     //тип булево - если ИСТИНА, скрывает стандартную панель и создает свою пустую для будушего наполнения ИмяСписка+"КоманднаяПанель2"
	ПараметрыЗапроса = Неопределено)//тип структура - содержит перечень параметров, если они используются в запросе.
	
	// ++ 15.03.2021
	УстановитьПривилегированныйРежим(Истина);
	// --
	
	// Защита от дурака
	Если ТекстЗапроса = "" И ТаблицаСписка = "" Тогда Сообщить("Ошибка формирования динамического списка, укажите запрос или таблицу"); Возврат; КонецЕсли;
																									
	// Создаем свою командную панель, тот случай когда я не нашел способа снять галочку "Автозаполнение"
	Если СвояКоманднаяПанель Тогда
		Если ВставитьПеред = "" Тогда
			ГруппаДинамическогоСписка  = Элементы.Добавить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]));
		Иначе
			ГруппаДинамическогоСписка  = Элементы.Вставить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]),ЭтаФорма.Элементы[ВставитьПеред]);			
		КонецЕсли;
		ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДинамическогоСписка.ОтображатьЗаголовок = Ложь;
		ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КоманднаяПанельСписка  = Элементы.Добавить(ИмяСписка + "КоманднаяПанель2",Тип("ГруппаФормы"),ГруппаДинамическогоСписка);
		КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;			
	КонецЕсли;
									
	// Создаем реквизит формы
	ТипыРеквизита = Новый Массив;                             
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита); 
	ДинамическийСписок = Новый РеквизитФормы(ИмяСписка, ОписаниеТиповДляРеквизита,,"",ЛОЖЬ); //Имя реквизита
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);        
	
	// Задаем свойства реквизиту
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
	РеквизитДинамическийСписок = ЭтаФорма[ИмяСписка]; //Имя реквизита
	
	Если ТекстЗапроса = "" Тогда
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ЛОЖЬ;
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
	Иначе
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ИСТИНА;
		РеквизитДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
		РеквизитДинамическийСписок.ДинамическоеСчитываниеДанных = Ложь;
		Если ТаблицаСписка <> "" Тогда РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка; КонецЕсли;		
	КонецЕсли;
	
	// Заполняем параметры, если они были указаны
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметра из ПараметрыЗапроса Цикл
			РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Параметра.Ключ,Параметра.Значение);	
		КонецЦикла;		 
	КонецЕсли;

	// Размещаем реквизит на форме
	Если ЛОЖЬ
		ИЛИ ВставитьПеред = "" 
		ИЛИ СвояКоманднаяПанель // Если своя командная панель, тогда нет логики уже в параметре ВставитьПеред
		Тогда
		ТаблицаФормы = Элементы.Добавить(ИмяСписка,Тип("ТаблицаФормы"),?(СвояКоманднаяПанель,ГруппаДинамическогоСписка,?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ])));
	Иначе
		ТаблицаФормы = Элементы.Вставить(ИмяСписка,Тип("ТаблицаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]),ЭтаФорма.Элементы[ВставитьПеред]);	
	КонецЕсли;		
	ТаблицаФормы.ПутьКДанным = ИмяСписка; //Имя реквизита 
	
	// Если своя панель, тогда скрываем стандартную
	//Если СвояКоманднаяПанель Тогда
		Элементы[ИмяСписка].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	//КонецЕсли;

	// Создание колонок на основание МассивКолонок
	Для Каждого Элемента Из МассивКолонок Цикл
		ПараметрыКолонки = СтрЗаменить(Элемента,",",Символы.ПС);
		Если СтрЧислоСтрок(ПараметрыКолонки) > 1 Тогда
			мЗаголовок = СтрПолучитьСтроку(ПараметрыКолонки, 1);
			ИмяКолонки = СтрПолучитьСтроку(ПараметрыКолонки, 2);
		Иначе
			мЗаголовок = "";
			ИмяКолонки = ПараметрыКолонки; 
		КонецЕсли;	
		НоваяКолонкаТаблицы = Элементы.Добавить(ИмяСписка + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		Если мЗаголовок <> "" Тогда НоваяКолонкаТаблицы.Заголовок = мЗаголовок; КонецЕсли;
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСписка + "." + ИмяКолонки; 	
	КонецЦикла;
	
	// Задаем действия (События) на основание СписокДействий, если он определен
	Если СписокДействий <> Неопределено Тогда 	
		ПереченьСвойств = "ПриИзменении
						|Выбор
						|ПриАктивизацииСтроки
						|ВыборЗначения
						|ПриАктивизацииПоля
						|ПриАктивизацииЯчейки
						|ПередНачаломДобавления
						|ПередНачаломИзменения
						|ПередУдалением
						|ПриНачалеРедактирования
						|ПередОкончаниемРедактирования
						|ПриОкончанииРедактирования
						|ОбработкаВыбора
						|ПередРазворачиванием
						|ПередСворачиванием
						|ПослеУдаления
						|ПриСменеТекущегоРодителя
						|ОбработкаЗаписиНового
						|ПриСохраненииПользовательскихНастроекНаСервере
						|ПередЗагрузкойПользовательскихНастроекНаСервере
						|ПриЗагрузкеПользовательскихНастроекНаСервере
						|ПриОбновленииСоставаПользовательскихНастроекНаСервере
						|ОбработкаЗапросаОбновления
						|ПриПолученииДанныхНаСервере
						|НачалоПеретаскивания
						|ПроверкаПеретаскивания
						|ОкончаниеПеретаскивания
						|Перетаскивание";
		Для Счетчик = 1 по 28 Цикл
			ИмяСвойства = СтрПолучитьСтроку(ПереченьСвойств, Счетчик);
			Элементы[ИмяСписка].УстановитьДействие(ИмяСвойства,?(СписокДействий.Свойство(ИмяСвойства),СписокДействий[ИмяСвойства],""));
		КонецЦикла;
	КонецЕсли;	

	// ++ 15.03.2021
	УстановитьПривилегированныйРежим(Ложь);
	// --

КонецПроцедуры //-- смарт:ММ 28.02.2021

//++ смарт:ММ #082 397 01.03.2021 Заявка на ремонтные работы
&НаКлиенте
Процедура смартСервисноеОбслуживаниеКлиентаВыбор(ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.смартСервисноеОбслуживаниеКлиента.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Заявка);
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 01.03.2021

// Фролов+
&НаСервере
Процедура ЗаполнитьСпискиАдресовДоставки(Партнер, ИмяРеквизита)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Партнер);
	
	//++ #4286 смарт: Тимофеева 08.09.2025 / Форма справочника Партнеры. Доставка по умолчанию. Доработка.
	//Запрос.Текст="ВЫБРАТЬ
	//             |	ПартнерыКонтактнаяИнформация.Представление КАК Адрес
	//             |ИЗ
	//             |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	//             |ГДЕ
	//             |	ПартнерыКонтактнаяИнформация.Ссылка = &Ссылка
	//             |	И ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)"; 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Представление КАК Адрес,
	|	ВЫБОР
	|		КОГДА ПартнерыКонтактнаяИнформация.Вид = &АдресДоставки
	|			ТОГДА 1
	|		КОГДА ПартнерыКонтактнаяИнформация.Вид = &АдресДоставкиАльтернативный
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Приоритет,
	//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
	|	ПартнерыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	ПартнерыКонтактнаяИнформация.Значение КАК Значение
	//-- #Б4248 смарт: Шляпников 16.09.2025
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Ссылка = &Ссылка
	|	И ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
    Запрос.УстановитьПараметр("АдресДоставки", Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресДоставки", 
												Справочники.ВидыКонтактнойИнформации.СправочникПартнеры));
	Запрос.УстановитьПараметр("АдресДоставкиАльтернативный", Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресДоставкиАльтернативный", 
												Справочники.ВидыКонтактнойИнформации.СправочникПартнеры));
	//-- #4286 смарт: Тимофеева 08.09.2025
	
	//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
	//Элементы[ИмяРеквизита].СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адрес"));
	//Если Элементы[ИмяРеквизита].СписокВыбора.Количество()=1 И Не ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда 
	//	Объект[ИмяРеквизита]=Элементы[ИмяРеквизита].СписокВыбора[0].Значение;
	//КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы[ИмяРеквизита].СписокВыбора.Добавить(Новый Структура("смартЗначение,смартЗначенияПолей, Представление", Выборка.Значение, Выборка.ЗначенияПолей, Выборка.Адрес), Выборка.Адрес);
	КонецЦикла;
	
	Если Элементы[ИмяРеквизита].СписокВыбора.Количество() = 1 И НЕ ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда 
		
		Объект[ИмяРеквизита] = Элементы[ИмяРеквизита].СписокВыбора[0].Представление;
		
		Если ИмяРеквизита = "смартПартнерАдресДоставки" Тогда
			Объект.смартПартнерАдресДоставкиЗначенияПолей = Элементы[ИмяРеквизита].СписокВыбора[0].Значение.смартЗначенияПолей;
			Объект.смартПартнерАдресДоставкиЗначение = Элементы[ИмяРеквизита].СписокВыбора[0].Значение.смартЗначение;
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4248 смарт: Шляпников 16.09.2025
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТелефоновКонтактногоЛица(КонтактноеЛицо)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",КонтактноеЛицо);
	Запрос.Текст="ВЫБРАТЬ
	             |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Телефон
	             |ИЗ
	             |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	             |ГДЕ
	             |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	             |	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	Элементы.смартПартнерТелефонКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Телефон"));
	Если Элементы.смартПартнерТелефонКонтактногоЛица.СписокВыбора.Количество()=1 Тогда 
		Объект.смартПартнерТелефонКонтактногоЛица=Элементы.смартПартнерТелефонКонтактногоЛица.СписокВыбора[0].Значение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗонуДоставки()
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2 Ссылка ИЗ Справочник.ЗоныДоставки");
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Количество()=1 Тогда
		рез.Следующий();
		Объект.смартПартнерЗонаДоставки=Рез.Ссылка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерОсобыеУсловияПеревозкиПриИзменении(Элемент)
	Элементы.смартПартнерОсобыеУсловияПеревозкиОписание.Видимость=Объект.смартПартнерОсобыеУсловияПеревозки;
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерКонтактноеЛицоПриИзменении(Элемент)
	ЗаполнитьСписокТелефоновКонтактногоЛица(Объект[Элемент.Имя])
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Фильтр=Новый Структура("Отбор",Новый Структура("Владелец",Объект.Ссылка));
	ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.Форма.ФормаВыбора",Фильтр,Элемент,,,,
				Новый ОписаниеОповещения("ПослеВыбораКонтактногоЛица",ЭтаФорма),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтактногоЛица(ЗначениеВыбора,ДопПараметры)Экспорт 
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда 
		Объект.смартПартнерКонтактноеЛицо=ЗначениеВыбора;
	КонецЕсли;	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин 27.11.2019 17:55:37
&НаКлиенте
Процедура смартВызовКоманды(СсылкаОбъект)
	ПараметрыФормы = Новый Структура("Предмет",СсылкаОбъект);
	ОткрытьФорму("Справочник.Заметки.Форма.ЗаметкиПоПредмету", ПараметрыФормы, ЭтаФорма, Истина, ЭтаФорма.Окно);
КонецПроцедуры

&НаКлиенте
Процедура смартВызовКомандыНапоминания(СсылкаОбъект)
	КлючЗаписи = ПолучитьКлючЗаписиПоИсточнику(СсылкаОбъект);
	Если КлючЗаписи <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	Иначе
		ПараметрыФормы = Новый Структура("Источник", СсылкаОбъект);		
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", ПараметрыФормы, ЭтаФорма, , );

КонецПроцедуры

//Смарт }Подкин 27.11.2019 17:55:37

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.09.2021 15:48:55
&НаСервере
Функция ПолучитьКлючЗаписиПоИсточнику(Источник)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НапоминанияПользователя.Пользователь,
	|	НапоминанияПользователя.ВремяСобытия,
	|	НапоминанияПользователя.Источник
	|ИЗ
	|	РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
	|ГДЕ
	|	НапоминанияПользователя.Пользователь = &Пользователь
	|	И НапоминанияПользователя.Источник = &Источник";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыНапоминания = Новый Структура("Пользователь,Источник,ВремяСобытия");
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыНапоминания, Выборка);
		Результат = РегистрыСведений.НапоминанияПользователя.СоздатьКлючЗаписи(ПараметрыНапоминания);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции // Фролов-

//Смарт }Подкин Алексей Иванович 23.09.2021 15:48:55

&НаКлиенте
Процедура смартПартнерАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПартнера"));
	ПараметрыОткрытия.Вставить("Представление", Объект[Элемент.Имя]);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Объект", Объект);
	ДопПараметры.Вставить("ИмяРеквизитаАдреса", Элемент.Имя);
	ДопПараметры.Вставить("Элемент", Элемент);
	
	//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
	Если Элемент.Имя = "смартПартнерАдресДоставки" Тогда
		ПараметрыОткрытия.Вставить("ЗначенияПолей", ДоставкаТоваровКлиентСервер.ПреобразоватьСтрокуВСписокПолей(Объект.смартПартнерАдресДоставкиЗначенияПолей));
		ПараметрыОткрытия.Вставить("Значение", Объект.смартПартнерАдресДоставкиЗначение);
	КонецЕсли;
	//-- #Б4248 смарт: Шляпников 16.09.2025
	
	Оповещение=Новый ОписаниеОповещения("смартПартнерАдресНачалоВыбораЗавершение" ,ЭтотОбъект,ДопПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерАдресНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ДопПараметры.Объект[ДопПараметры.ИмяРеквизитаАдреса] = Результат.Представление;
		
		//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
		Если ДопПараметры.ИмяРеквизитаАдреса = "смартПартнерАдресДоставки" Тогда
			Объект.смартПартнерАдресДоставкиЗначенияПолей = Результат.КонтактнаяИнформация;
			Объект.смартПартнерАдресДоставкиЗначение = Результат.Значение;
		КонецЕсли;
		//-- #Б4248 смарт: Шляпников 16.09.2025

	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура смартПартнерПеревозчикПартнерПриИзменении(Элемент)
	ЗаполнитьСпискиАдресовДоставки(Объект[Элемент.Имя],Элементы.смартПартнерАдресДоставкиПеревозчика.Имя);
КонецПроцедуры

//++ смарт:КМД 810 14.12.2021
&НаСервере
Процедура смартДобавитьЭлементыПрограммноОбменСУТКовчег()
	НоваяКоманда = Команды.Добавить("смартВыгрузитьПартнераВУТКовчег");
	НоваяКоманда.Действие = "смартВыгрузитьПартнераВУТКовчег";
	НоваяКоманда.Заголовок = "Выгрузить партнера в УТ ""Ковчег""";
	
	ПодменюВыгрузить = Элементы.Добавить("смартПодменюВыгрузить", Тип("ГруппаФормы"), Элементы.КоманднаяПанельСоздать);
	ПодменюВыгрузить.Вид = ВидГруппыФормы.Подменю;
	ПодменюВыгрузить.Заголовок = "Выгрузить";
	ПодменюВыгрузить.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
	ПодменюВыгрузить.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	
	НовыйЭлемент = Элементы.Добавить("ЭлементОткрытьОтпуска", Тип("КнопкаФормы"), ПодменюВыгрузить);
	НовыйЭлемент.ИмяКоманды = "смартВыгрузитьПартнераВУТКовчег";
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
КонецПроцедуры

//++ смарт:КМД 810 14.12.2021
&НаКлиенте
Процедура смартВыгрузитьПартнераВУТКовчег(Команда)
	//проверка на ошибки
	ЕстьОшибка = Ложь;
	
	Если Параметры.Ключ.Пустая() тогда
		ПоказатьПредупреждение(, "Для выгрузки партнера его необходимо сначала записать!");
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если Модифицированность тогда
		ПоказатьПредупреждение(, "Партнер изменен! Перед выгрузкой необходимо записать элемент справочника.");
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если смарт_ОбменКонтрагентамиУТКовчегСервер.ЕстьКонтрагентыПоПартнеру(Объект.Ссылка) = Ложь тогда
		ПоказатьПредупреждение(, "Для выгрузки партнера и контрагентов для партнера должен быть создан хотя-бы один контрагент!");
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЕстьОшибка тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("смарт_смартВыгрузитьПартнераВУТКовчегЗавершение", ЭтаФорма), "Выгрузить партнера """ + Строка(Объект.Ссылка) + """ и связанные с ним данные?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

//++ смарт:КМД 810 14.12.2021
&НаКлиенте
Процедура смарт_смартВыгрузитьПартнераВУТКовчегЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		РезультатВыполнения = смарт_ОбменКонтрагентамиУТКовчегСервер.ВыгрузитьПартнера(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при вводе электронной почты и телефона
&НаКлиенте
&После("Подключаемый_КонтактнаяИнформацияНажатие")
Процедура смарт_Подключаемый_КонтактнаяИнформацияНажатие(Команда)
	
	Если СтрНайти(Команда.Имя, "КомандаИзменитьКИ") > 0 Тогда
		ЭлементСпискаКИ = Элементы.Найти(СтрЗаменить(Команда.Имя, "КомандаИзменитьКИ", "ГруппаЗаголовокКИ"));
		Если ЭлементСпискаКИ <> Неопределено Тогда
			
			Для каждого Стр Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				
				Если Стр.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
					
					ЭлемНомерТелефона = ЭтотОбъект.Элементы.Найти(Стр.ИмяРеквизита);
					Если ЭлемНомерТелефона <> Неопределено Тогда
						
						ЭлемНомерТелефона.ПодсказкаВвода = "+7 ХХХ ХХХ ХХ ХХ или 8 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
						ЭлемНомерТелефона.Подсказка = "Если номер имеет заграничный формат, нажмите на кнопку выбора или F4 и введите номер";
						ЭлемНомерТелефона.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
&После("Контакт_МобТелефонПриИзменении")
Процедура смарт_Контакт_МобТелефонПриИзменении(Элемент)

	Текст = Элемент.ТекстРедактирования;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхСтроки = Новый Структура();
	
	СтруктураДанныхСтроки.Вставить("Значение",Неопределено);
	СтруктураДанныхСтроки.Вставить("Представление",Текст);
	
	//++ #2004 смарт: Лопато 28.01.2025 //Ошибка при проверке номера телефона  
	СтруктураДанныхСтроки.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка"));
	СтруктураДанныхСтроки.Вставить("Владелец", Объект.Ссылка);
	//-- #2004 смарт: Лопато 28.01.2025
	
	ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураДанныхСтроки); 
	
	Если ИтогПроверки.КодОшибки <> 0 Тогда
		
		СообщениеОбщееПояснение = "Если номер имеет другой формат (например, это заграничный номер), нажмите на кнопку выбора или F4 и введите номер";		
		СообщениеДляВывода = ИтогПроверки.СообщениеОшибки + Символы.ПС + СообщениеОбщееПояснение; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеДляВывода  , , Элемент.Имя);
		Контакт_МобТелефон = "";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("Контакт_ТелефонПриИзменении")
Процедура смарт_Контакт_ТелефонПриИзменении(Элемент)
	
	Текст = Элемент.ТекстРедактирования;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхСтроки = Новый Структура();
	
	СтруктураДанныхСтроки.Вставить("Значение",Неопределено);
	СтруктураДанныхСтроки.Вставить("Представление",Текст);

	//++ #2004 смарт: Лопато 28.01.2025 //Ошибка при проверке номера телефона  
	СтруктураДанныхСтроки.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка"));
	СтруктураДанныхСтроки.Вставить("Владелец", Объект.Ссылка);
	//-- #2004 смарт: Лопато 28.01.2025
	
	ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураДанныхСтроки); 
	
	Если ИтогПроверки.КодОшибки <> 0 Тогда
		
		СообщениеОбщееПояснение = "Если номер имеет другой формат (например, это заграничный номер), нажмите на кнопку выбора или F4 и введите номер";		
		СообщениеДляВывода = ИтогПроверки.СообщениеОшибки + Символы.ПС + СообщениеОбщееПояснение; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеДляВывода  , , Элемент.Имя);
		Контакт_Телефон = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("Контакт_EmailПриИзменении")
Процедура смарт_Контакт_EmailПриИзменении(Элемент)
	смартОбщегоНазначенияКлиент.ПроверитьПочтуПриИзменении(Элемент,Объект.Ссылка,ЭтаФорма);
КонецПроцедуры
//--#1012 смарт: Холопов 04.05.2022 

#Область КомандыИОбработчикиЭлементов

//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
&НаКлиенте
Процедура смартПартнерАдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение.Свойство("Представление") Тогда
			Объект.смартПартнерАдресДоставки = ВыбранноеЗначение.Представление;
		КонецЕсли;
		
		Если ВыбранноеЗначение.Свойство("смартЗначение") Тогда
			Объект.смартПартнерАдресДоставкиЗначение = ВыбранноеЗначение.смартЗначение;
		КонецЕсли;
		
		Если ВыбранноеЗначение.Свойство("смартЗначенияПолей") Тогда
			Объект.смартПартнерАдресДоставкиЗначенияПолей = ВыбранноеЗначение.смартЗначенияПолей;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПеренесеноСДоработкамиСмарт

&НаКлиенте
&ИзменениеИКонтроль("БыстрыйВвод_ДатаНачалаПриИзменении")
//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Процедура смарт_БыстрыйВвод_ДатаНачалаПриИзменении(Элемент)

	Если БыстрыйВвод_ДатаНачала = НачалоДня(БыстрыйВвод_ДатаНачала) И БыстрыйВвод_КэшированноеВремя > 0 Тогда
		БыстрыйВвод_ДатаНачала = БыстрыйВвод_ДатаНачала + БыстрыйВвод_КэшированноеВремя;
		БыстрыйВвод_КэшированноеВремя = 0;
	КонецЕсли;

	Если НачалоДня(БыстрыйВвод_КэшированнаяДатаНачала) = НачалоДня(БыстрыйВвод_ДатаОкончания) Тогда
		ВремяЗавершения = БыстрыйВвод_ДатаОкончания - НачалоДня(БыстрыйВвод_ДатаОкончания);
		БыстрыйВвод_ДатаОкончания = НачалоДня(БыстрыйВвод_ДатаНачала) + ВремяЗавершения;
	КонецЕсли;

	Если БыстрыйВвод_ДатаНачала > БыстрыйВвод_ДатаОкончания Тогда

		СрокПоУмолчанию = 3600;
		Если БыстрыйВвод_ТекущийТипОбъекта = "Взаимодействие" Тогда
			СрокПоУмолчанию = 1800;
		КонецЕсли;

		БыстрыйВвод_ДатаОкончания = БыстрыйВвод_ДатаНачала + СрокПоУмолчанию;
		БыстрыйВвод_ЗадачаВариантСрока = ПредопределенноеЗначение("Перечисление.CRM_ВариантыУстановкиДаты.ЧерезЧас");
	КонецЕсли;

	БыстрыйВвод_КэшированнаяДатаНачала = БыстрыйВвод_ДатаНачала;
	
	#Вставка
	//++ #Б-5002 смарт: Фролов 17.11.2025 //Ограничение количества планируемых взаимодействий на день.
	Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Ложь;
	//-- #Б-5002 смарт: Фролов 17.11.2025
	
	//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	Если Объект.ОсновнойМенеджер = БыстрыйВвод_ВзаимодействиеОтправитель Тогда
		
		ПредельныйСрок = смартОбщегоНазначения.ПулучитьПредельныйСрокВзаимодействияПоПартнеру(Объект.Ссылка);
		Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Заголовок = "Выбранная дата больше " 
		+ ПредельныйСрок + " дней. Взаимодействие будет согласовано РОПом.";
		Если ПредельныйСрок > 0 И БыстрыйВвод_ДатаНачала > ТекущаяДата() + 3600 * 24 * ПредельныйСрок Тогда
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Истина;
		Иначе	
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Ложь;
		КонецЕсли; 
		
		//++ #Б-5042 смарт: Фролов 24.11.2025 //Ошибка. Контроль максимального срока взаимодействий только для основных менеджеров! 
		СрокМаксимальногоПланированияВзаимодействийВДнях = смартОбщегоНазначения.ПолучитьЗначениеСправочникаПредопределенныеПоНовому(
			"СрокМаксимальногоПланированияВзаимодействийВДнях");
		
		Если СрокМаксимальногоПланированияВзаимодействийВДнях > 0 
			И БыстрыйВвод_ДатаНачала > ТекущаяДата() + 3600 * 24 * СрокМаксимальногоПланированияВзаимодействийВДнях Тогда
			
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Заголовок = 
				"Нельзя планировать взаимодействия на срок более " + СрокМаксимальногоПланированияВзаимодействийВДнях + " дней!";
			
			Элементы.смартПредупреждениеОПревышенииПредельногоСрока.Видимость = Истина;
			БыстрыйВвод_ДатаНачала = Неопределено;
			
		КонецЕсли;
		//-- #Б-5042 смарт: Фролов 24.11.2025
		
	КонецЕсли;	
	//-- #Б-2208 смарт: Фролов 25.02.2025
	
	//++ #Б-5002 смарт: Фролов 17.11.2025 //Ограничение количества планируемых взаимодействий на день.	
	МаксимальноеКоличествоВзаимодействий = смартОбщегоНазначения.ПолучитьЗначениеСправочникаПредопределенныеПоНовому(
		"МаксимальноеКоличествоПланируемыхВзаимодействийСПартнерамиБезИнтересов");
	
	Если МаксимальноеКоличествоВзаимодействий > 0 Тогда
		
		КоличествоВзаимодействий = смартОбщегоНазначения.ПолучитьВзаимодействияПоОтветственному(БыстрыйВвод_ДатаНачала, 
			БыстрыйВвод_ВзаимодействиеОтправитель); 
		
		Если КоличествоВзаимодействий >= МаксимальноеКоличествоВзаимодействий Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("На " + Формат(БыстрыйВвод_ДатаНачала, "ДФ=dd.MM.yyyy") 
				+ ". уже запланировано " + МаксимальноеКоличествоВзаимодействий + 
				" взаимодействий с партнерами без активного интереса! Выберите другую дату!");
				
			БыстрыйВвод_ДатаНачала = Неопределено;	
			
		КонецЕсли;		
		
	КонецЕсли;	
	//-- #Б-5002 смарт: Фролов 17.11.2025	
	
	//++ #Б-2600 смарт: Фролов 07.03.2025 //Доработка планирования взаимодействий.
	Если ЭтаФорма.смартПереключательСтатусаВзаимодействия = 2 И НЕ НачалоДня(БыстрыйВвод_ДатаНачала) = НачалоДня(ТекущаяДата()) Тогда
		
		ЭтаФорма.смартПереключательСтатусаВзаимодействия = 1;
		смартПереключательСтатусаВзаимодействияПриИзменении(Элементы.БыстрыйВвод_ПереключательСтатусаВзаимодействия);
		
	КонецЕсли;
	//-- #Б-2600 смарт: Фролов 07.03.2025
	#КонецВставки

КонецПроцедуры //-- #Б-2208 смарт: Фролов 25.02.2025

&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ)
	
	//++#1283 смарт: Лопато 23.12.2022 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  
	смартУстановитьНадписьОсталосьДнейСрокПроверкиКлючевойКлиент();
	//--#1283 смарт: Лопато 23.12.2022
	
	//++ #Б-1008 смарт: Фролов 01.10.2024 //Доработка функционала Рабочего стола сотрудника
	Если ЭтаФорма.смартКлючОткрываемойАктивности <> Неопределено Тогда
		ПодключитьОбработчикОжидания("смартПозиционироватьНаВзаимодействие", 0.2, Истина);
	КонецЕсли;
	//-- #Б-1008 смарт: Фролов 01.10.2024
	
	//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера", 1);
	КонецЕсли;
	//-- #Б1174 смарт: Шляпников 21.10.2024
	
КонецПроцедуры

&НаКлиенте
&После("ПереключитьСтраницуБыстрогоВвода")
Процедура смарт_ПереключитьСтраницуБыстрогоВводаПосле(Знач НовыйТипОбъекта, Знач ПолныйСброс)
	
	//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
	Если БыстрыйВвод_ТекущийТипОбъекта = "Скидки" Тогда
		НеЗаполнятьЛенту = Истина;
		Элементы.Лента_HTML.Видимость = Ложь;
	Иначе
		НеЗаполнятьЛенту = Ложь;
		Элементы.Лента_HTML.Видимость = Истина;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЛенту", 0.1, Истина);
	КонецЕсли;
	//--#1323 смарт: Лопато 25.09.2023
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НастроитьОбластьВводаПоСтранице")
Процедура смарт_НастроитьОбластьВводаПоСтранице(Знач ПолныйСброс)

	// Общее
	ТекущаяДата = ТекущаяДатаСеанса();
	БыстрыйВвод_ДатаНачала = ТекущаяДата;
	Если ПолныйСброс Тогда
		// При создании или отмене создания объекта.
		БыстрыйВвод_Тема = "";
		БыстрыйВвод_Содержание = "";
		Если БыстрыйВвод_Вложения.Количество() > 0 Тогда
			БыстрыйВвод_Вложения.Очистить();
			CRM_ЛентаСобытий.ОбновитьЭлементыВложений(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

	Если БыстрыйВвод_ТекущийТипОбъекта = "Примечание" Тогда

		ТемаЗаполнена = ЗначениеЗаполнено(БыстрыйВвод_Тема);
		ВысотаТемы = ?(ТемаЗаполнена, 3, 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_ПримечаниеТема", "Высота", ВысотаТемы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_КомандыПримечание", "Видимость", ТемаЗаполнена);

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Взаимодействие" Тогда

		БыстрыйВвод_Тема = СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " ");

		ДанныеВидаВзаимодействия = CRM_ЛентаСобытий.ДанныеВидаВзаимодействияПоУмолчанию("ЛентаКлиента");
		БыстрыйВвод_ВзаимодействиеВид = ДанныеВидаВзаимодействия.Ссылка;
		Если БыстрыйВвод_Тема = "" Тогда
			БыстрыйВвод_Тема = ДанныеВидаВзаимодействия.Описание;
		КонецЕсли;
		
		#Вставка
		//++ #Б-2136 смарт: Фролов 11.02.2025 //Планирование взаимодействий на весь день
		БыстрыйВвод_ВзаимодействиеНаВесьДень = Истина;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Время.Видимость = Ложь;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаОкончания_Время.Видимость = Ложь;
		
		ПараметрыДня = CRM_ЛентаСобытий.ПараметрыРабочегоДня(ТекущийПользователь);
		БыстрыйВвод_ДатаНачала = НачалоДня(БыстрыйВвод_ДатаНачала) + (ПараметрыДня.ВремяНачала - Дата('00010101'));
		БыстрыйВвод_ДатаОкончания = НачалоДня(БыстрыйВвод_ДатаНачала) + (ПараметрыДня.ВремяОкончания - Дата('00010101'));
		//-- #Б-2136 смарт: Фролов 11.02.2025
		#КонецВставки
		
		#Удаление //++ #Б-2136 смарт: Фролов 11.02.2025 //Планирование взаимодействий на весь день
		БыстрыйВвод_ВзаимодействиеНаВесьДень = Ложь;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Время.Видимость = Истина;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаОкончания_Время.Видимость = Истина;
		БыстрыйВвод_ДатаНачала = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(БыстрыйВвод_ДатаНачала, 30);
		БыстрыйВвод_ДатаОкончания = БыстрыйВвод_ДатаНачала + 1800;
		#КонецУдаления
		
		БыстрыйВвод_ВзаимодействиеОтправитель = ТекущийПользователь;

		МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступомУровниДоступа");
		Если МодульУправлениеДоступом = Неопределено ИЛИ НЕ МодульУправлениеДоступом.РазрешенТолькоБазовыйДоступ(Объект.CRM_ОсновноеКонтактноеЛицо) Тогда
			БыстрыйВвод_ВзаимодействиеПолучатель = Объект.CRM_ОсновноеКонтактноеЛицо;
		КонецЕсли;

		Элементы.БыстрыйВвод_ВзаимодействиеПолучатель.Видимость = CRM_ЛентаСобытий.ЭтоПартнерСКонтактами(Объект.Ссылка);
		
		#Вставка
		//++ #Б-1698 смарт: Фролов 05.02.2025 //Вид встречи по умолчанию при планировании взаимодействия.
		Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.Настройки.ТелефонныйЗвонокВПартнере) Тогда
			БыстрыйВвод_ВзаимодействиеВид = Справочники.смартПредопределенныеЗначения.Настройки.ТелефонныйЗвонокВПартнере;
			БыстрыйВвод_Тема = "Телефонный звонок клиенту";
		КонецЕсли;	
		//-- #Б-1698 смарт: Фролов 05.02.2025
		#КонецВставки

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Задача" Тогда

		БыстрыйВвод_Тема = СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " ");

		БыстрыйВвод_ЗадачаВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДень;
		БыстрыйВвод_ДатаОкончания = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(ТекущаяДата, 30) + 86400;
		
		#Удаление //++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
		БыстрыйВвод_ЗадачаПолучатель = ТекущийПользователь;
		#КонецУдаления
		
		#Вставка
		//++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
		Если ЗначениеЗаполнено(Объект.ОсновнойМенеджер) Тогда
			БыстрыйВвод_ЗадачаПолучатель = Объект.ОсновнойМенеджер;
		Иначе
			БыстрыйВвод_ЗадачаПолучатель = ТекущийПользователь;	
		КонецЕсли;
		//-- #1915 смарт: Фролов 15.07.2024
		#КонецВставки
		
		#Вставка 
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		Если Элементы.Найти("смартВидЗадачи") = Неопределено Тогда
			НовыйЭлемент = Элементы.Вставить("смартВидЗадачи", Тип("ПолеФормы"), Элементы.БыстрыйВвод_СтраницаЗадача, Элементы.БыстрыйВвод_ЗадачаПолучатель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Вид задачи";
			НовыйЭлемент.Видимость = Истина;
			НовыйЭлемент.ПутьКДанным = "БыстрыйВвод_ЗадачаСмартВидЗадачи";
		КонецЕсли;
		//-- #1929 смарт: Фролов 23.07.2024
		#КонецВставки
		
	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Письмо" Тогда

		БыстрыйВвод_Тема = СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " ");

		БыстрыйВвод_ПисьмоПолучатели.Очистить();
		БыстрыйВвод_ПисьмоПолучателиКопий.Очистить();
		БыстрыйВвод_ПисьмоПолучателиСкрытыхКопий.Очистить();
		БыстрыйВвод_ПисьмоСписокПолучателейПисьма = "";
		БыстрыйВвод_ПисьмоСписокПолучателейКопий = "";
		БыстрыйВвод_ПисьмоСписокПолучателейСкрытыхКопий = "";

		УчетныеЗаписиПочтыСписокВыбора = Элементы.БыстрыйВвод_ПисьмоОтправительПредставление.СписокВыбора;
		УчетныеЗаписиПочтыСписокВыбора.Очистить();
		CRM_УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписиДляОтправки(УчетныеЗаписиПочтыСписокВыбора,, ТекущийПользователь);
		Если УчетныеЗаписиПочтыСписокВыбора.Количество() > 0 Тогда
			УчетнаяЗаписьПоУмолчанию = CRM_ЛентаСобытий.УчетнаяЗаписьПоУмолчанию(ТекущийПользователь);
			ЭлементСписка = УчетныеЗаписиПочтыСписокВыбора.НайтиПоЗначению(УчетнаяЗаписьПоУмолчанию);
			Если ЭлементСписка = Неопределено Тогда
				ЭлементСписка = УчетныеЗаписиПочтыСписокВыбора[0];
			КонецЕсли;
			БыстрыйВвод_ПисьмоУчетнаяЗапись = ЭлементСписка.Значение;
			БыстрыйВвод_ПисьмоОтправительПредставление = ЭлементСписка.Представление;
		КонецЕсли;

		ВладельцыКонтактнойИнформации = Новый Массив;
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ВладельцыКонтактнойИнформации.Добавить(Объект.Ссылка);
			КонтактыПартнера = CRM_ЛентаСобытий.КонтактыПартнера(Объект.Ссылка);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВладельцыКонтактнойИнформации, КонтактыПартнера);
		КонецЕсли;

		ДанныеКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ВладельцыКонтактнойИнформации, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		БыстрыйВвод_ПисьмоИсторияАдресов.Очистить();
		Для Каждого Строка Из ДанныеКонтактнойИнформации Цикл
			ПредставлениеАдресаКонтакта = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Строка.Объект, Строка.Представление, "");
			БыстрыйВвод_ПисьмоИсторияАдресов.Добавить(ПредставлениеАдресаКонтакта);
		КонецЦикла;

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Файл" Тогда

		ЕстьВложения = (БыстрыйВвод_Вложения.Количество() > 0);
		ВысотаТемы = ?(ЗначениеЗаполнено(БыстрыйВвод_Тема), 3, 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_ФайлОписание", "Высота", ВысотаТемы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_КомандыФайл", "Видимость", ЕстьВложения);

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Чат" Тогда

		// +Рарус alexpr
		//// Если смогли переключиться на эту страницу - значит, получатели есть.
		//ПервыйПолучатель = БыстрыйВвод_ЧатПолучатели[0];
		//БыстрыйВвод_ЧатИдентификаторПолучателя = ПервыйПолучатель.Идентификатор;
		//БыстрыйВвод_ЧатАдрес = ПервыйПолучатель.Адрес;
		//БыстрыйВвод_ЧатПолучатель = ПервыйПолучатель.Контакт;
		//БыстрыйВвод_ЧатПредставлениеПолучателя = ПервыйПолучатель.Представление;
		//БыстрыйВвод_ЧатУчетнаяЗапись = ПервыйПолучатель.УчетнаяЗапись;
		//БыстрыйВвод_ЧатГруппа = ПервыйПолучатель.Группа;
		Если БыстрыйВвод_ЧатПолучатели.Количество() > 0 Тогда
			ПервыйПолучатель = БыстрыйВвод_ЧатПолучатели[0];
			БыстрыйВвод_ЧатИдентификаторПолучателя = ПервыйПолучатель.Идентификатор;
			БыстрыйВвод_ЧатАдрес = ПервыйПолучатель.Адрес;
			БыстрыйВвод_ЧатПолучатель = ПервыйПолучатель.Контакт;
			БыстрыйВвод_ЧатПредставлениеПолучателя = ПервыйПолучатель.Представление;

			// учетная запись есть в списке доступных пользователю
			Если БыстрыйВвод_ЧатУчетныеЗаписи.НайтиСтроки(Новый Структура("УчетнаяЗапись", ПервыйПолучатель.УчетнаяЗапись)).Количество() > 0 Тогда
				БыстрыйВвод_ЧатУчетнаяЗапись = ПервыйПолучатель.УчетнаяЗапись;
				БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи = ПервыйПолучатель.УчетнаяЗапись;
			КонецЕсли;

			БыстрыйВвод_ЧатГруппа = ПервыйПолучатель.Группа;
			БыстрыйВвод_ЧатЭтоНомерТелефона = ПервыйПолучатель.ЭтоНомерТелефона;
			БыстрыйВвод_ЧатВидКИ = ПервыйПолучатель.ВидКИ;
		КонецЕсли;
		// -Рарус alexpr

	КонецЕсли;

КонецПроцедуры

//++ #Б-2286 смарт: Лопато 11.02.2025 //Ввод нового регламента. Исключение совершения действий в карточке партнера для неосновного менеджера. Дополнение  
&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПартнерыИКонтрагенты.ПартнерФормаЭлементаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	Если CRM_ИспользоватьПартнеровКакКонтрагентов Тогда
	
		ЗаписатьКонтрагентаПартнера();
		УправлениеДоступностью();
		
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		ПараметрыЗаписиСПАРКРиски = Новый Структура("КонтрагентСсылка", КонтрагентПартнера);
		СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписиСПАРКРиски);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		
	Иначе
		
		МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
		
	КонецЕсли;
	
	// +Классификаторы
	CRM_КлассификаторыЭкспортныеМетоды.ФормаОбъектаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	CRM_КлассификаторыЭкспортныеМетоды.ФормаОбъектаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект.Ссылка);
	// -Классификаторы
	
	// +CRM
	Если КорректироватьНапоминание Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		               |ГДЕ
		               |	КонтактныеЛицаПартнеров.Владелец = &Владелец";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			CRM_ОповещенияСервер.CRM_СформироватьУдалитьНапоминанияОКлючевыхСобытиях(Выборка.Ссылка);
		КонецЦикла;
		КорректироватьНапоминание = Ложь;
	КонецЕсли;
	
	СоздатьКонтактФормыРегистрацииНаСервере(ТекущийОбъект.Ссылка);
	
	ЗаполнитьЗаголовокНадписиЗаполненность();
	// -CRM
	
	УстановитьЗаголовок();
	
	#Вставка
	//++ #Б-2286 смарт: Лопато 11.02.2025 //Ввод нового регламента. Исключение совершения действий в карточке партнера для неосновного менеджера. Дополнение  
	Если НЕ Справочники.смартПредопределенныеЗначения.Настройки.ЗапретВзаимодействийНеОсновнымПользователям Тогда
		
		Элементы.БыстрыйВвод_Взаимодействие.Доступность = Истина;
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.смартСостояниеПартнеров
		|ГДЕ
		|	Партнер = &Партнер
		|	И Состояние = &Состояние");
		
		Запрос.УстановитьПараметр("Партнер", 	 ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("Состояние", 	 Перечисления.смартСостоянияПартнеров.Свободен);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Элементы.БыстрыйВвод_Взаимодействие.Доступность = Истина;
			
		Иначе
			
			Если (Пользователи.РолиДоступны("смартРуководительCRM")
				  ИЛИ ПараметрыСеанса.ТекущийПользователь = ТекущийОбъект.ОсновнойМенеджер
				  ИЛИ ПараметрыСеанса.ТекущийПользователь = ТекущийОбъект.смартМенеджерПоРасходнымМатериалам
				  ИЛИ ПараметрыСеанса.ТекущийПользователь = ТекущийОбъект.смартОсновнойМенеджерСервисЦентра) Тогда
				
				Элементы.БыстрыйВвод_Взаимодействие.Доступность = Истина;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	//-- #Б-2286 смарт: Лопато 11.02.2025
	#КонецВставки 
	
	#Вставка 
	//++ #4286 смарт: Тимофеева 08.09.2025 / Форма справочника Партнеры. Доставка по умолчанию. Доработка.
	ЗаполнитьСпискиАдресовДоставки(Объект.Ссылка, Элементы.смартПартнерАдресДоставки.Имя);
	Если ЗначениеЗаполнено(Объект.смартПартнерАдресДоставкиПеревозчика) Тогда 
		ЗаполнитьСпискиАдресовДоставки(Объект.смартПартнерАдресДоставкиПеревозчика, Элементы.смартПартнерАдресДоставкиПеревозчика.Имя);
	КонецЕсли; 
	//-- #4286 смарт: Тимофеева 08.09.2025
	#КонецВставки
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаКлиенте
//++ #Б-1008 смарт: Фролов 01.10.2024 //Доработка функционала Рабочего стола сотрудника
Процедура смартПозиционироватьНаВзаимодействие()
	
	ПараметрыАктивности = Новый Структура;
	ПараметрыАктивности.Вставить("Ключ", ЭтаФорма.смартКлючОткрываемойАктивности);
	ОткрытьФорму("РегистрСведений.CRM_ЗапланированныеАктивности.ФормаЗаписи",
		ПараметрыАктивности, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры //-- #Б-1008 смарт: Фролов 01.10.2024

&НаКлиенте
Процедура смартДействиеПоказатьИнформацию(Команда)
//++#1283 смарт: Лопато 23.12.2022 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  
	
	Если СтрНайти(Команда.Имя, "смартСрокПроверкиКлючевойКлиент") <> 0 Тогда

		ИнформацияЗаголовок = "Срок действия признака ""Ключевой клиент по расходным материалам""";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'В поле <b>Срок проверки</b> указывается дата, до которой не производится автоматическая проверка и снятие признака <b>Ключевой клиент по расходным материалам</b>.'")
			  + Символы.ПС
			  + Символы.ПС
		  + НСтр("ru = 'Срок проверки автоматически рассчитывается при установке признака <b>Ключевой клиент по расходным материалам</b> регламентным заданием'")
			);

	Иначе
		ИнформацияЗаголовок = "";
		ИнформацияТекст = "";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры //--#1283 смарт: Лопато 23.12.2022

&НаКлиенте
Процедура смартСрокПроверкиКлючевойКлиентПриИзменении(Элемент)
//++#1283 смарт: Лопато 23.12.2022 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  

	смартУстановитьНадписьОсталосьДнейСрокПроверкиКлючевойКлиент();

КонецПроцедуры //--#1283 смарт: Лопато 23.12.2022

&НаКлиенте
Процедура смартУстановитьНадписьОсталосьДнейСрокПроверкиКлючевойКлиент()
//++#1283 смарт: Лопато 23.12.2022 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  

	ТекстОсталосьДней = "";
	
	Если ЗначениеЗаполнено(Объект.смартСрокПроверкиКлючевойКлиент) Тогда
		Если НачалоДня(Объект.смартСрокПроверкиКлючевойКлиент) > НачалоДня(ТекущаяДата()) Тогда
			ТекстОсталосьДней = "Через " + ИнтеграцияС1СДокументооборотКлиентСервер.РазностьДатВДнях(НачалоДня(Объект.смартСрокПроверкиКлючевойКлиент), НачалоДня(ТекущаяДата()), Ложь);
			Элементы.смартСрокПроверкиОсталосьДней.ЦветТекста = Новый Цвет(0, 128, 0);
		Иначе
			ТекстОсталосьДней = "Срок проверки истек";
			Элементы.смартСрокПроверкиОсталосьДней.ЦветТекста = Новый Цвет(200, 0, 0);
		КонецЕсли;	
	КонецЕсли;
	
	Элементы.смартСрокПроверкиОсталосьДней.Заголовок = ТекстОсталосьДней;
	
КонецПроцедуры //--#1283 смарт: Лопато 23.12.2022

//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаКлиенте
Процедура смартДобавитьСкидку()
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиент не записан! Добавления скидки невозможно!");
		Возврат;
	Иначе
		Если смартОбщегоНазначения.смартПравоРедактированияИндивидуальныхСкидокПартнера(Объект.Ссылка) Тогда
			ОткрытьФорму("Документ.смартУстановкаИндивидуальныхСкидокКлиентов.ФормаОбъекта", 
						 Новый Структура("Клиент", Объект.Ссылка), ЭтаФорма, , , , 
						 Новый ОписаниеОповещения("смартОповещениеОВводеНовойСкидки", ЭтаФорма));
		КонецЕсли;		
	КонецЕсли;	

КонецПроцедуры //--#1323 смарт: Лопато 25.09.2023	

//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаКлиенте
Процедура смартОповещениеОВводеНовойСкидки(Результат, ДополнительныеПараметры) Экспорт

	Элементы.смартИндивидуальныеСкидкиКлиентов.Обновить();

КонецПроцедуры //--#1323 смарт: Лопато 25.09.2023	

//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаСервере
Процедура смартУстановитьДоступностьРедактированияИндивидуальныхСкидок()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПравоРедактированияИндивидуальныхСкидокПартнера = смартОбщегоНазначения.смартПравоРедактированияИндивидуальныхСкидокПартнера(Объект.Ссылка);
	Иначе	
		ПравоРедактированияИндивидуальныхСкидокПартнера = Ложь;
	КонецЕсли;
	
	Элементы.БыстрыйВвод_СтраницаСкидки.ТолькоПросмотр 					   = НЕ ПравоРедактированияИндивидуальныхСкидокПартнера;
	Элементы.смартКоманднаяПанельСкидки.Доступность 					   = ПравоРедактированияИндивидуальныхСкидокПартнера;

	Элементы.смартИндивидуальныеСкидкиКлиентов.ТолькоПросмотр 			   = НЕ ПравоРедактированияИндивидуальныхСкидокПартнера;
	
КонецПроцедуры //--#1323 смарт: Лопато 25.09.2023	

//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаКлиенте
Процедура смартОткрытьРедактированиеИндивидуальнойСкидки(Элемент)

	ПравоРедактированияИндивидуальныхСкидокПартнера = смартОбщегоНазначения.смартПравоРедактированияИндивидуальныхСкидокПартнера(Объект.Ссылка);
	
	Если ПравоРедактированияИндивидуальныхСкидокПартнера Тогда
		ТекДанные = Элементы.смартИндивидуальныеСкидкиКлиентов.ТекущиеДанные;	
		ПоказатьЗначение(, ТекДанные.Регистратор);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У Вас нет права редактирования индивидуальных скидок данного клиента!");
	КонецЕсли;	
	
КонецПроцедуры //--#1323 смарт: Лопато 25.09.2023	

//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаКлиенте
Процедура смартДатаИндивидуальныхСкидокПриИзменении(Элемент)
	
	ЭтаФорма.смартИндивидуальныеСкидкиКлиентов.Параметры.УстановитьЗначениеПараметра("Дата", ЭтаФорма.смартДатаИндивидуальныхСкидок);
	Элементы.смартИндивидуальныеСкидкиКлиентов.Обновить();

КонецПроцедуры //--#1323 смарт: Лопато 25.09.2023	

//++ #1537 смарт: Корбутов 02.11.2023 исправить бизнес-регионы
//Функция возвращает уровень справочника Бизнес-Регионы, или выозвращает -1 для полноправного пользователя
//Сделано так для того, что бы не делать отдельную функцию проверки роли
&НаСервере
Функция ПолучитьУровеньРегиона(ЭлементСправочникаРегионы)
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат -1;
	КонецЕсли;
	РодительРегиона = ЭлементСправочникаРегионы.Родитель;
	Если ЗначениеЗаполнено(РодительРегиона) Тогда
		РодительРодителя = РодительРегиона.Родитель;
		Если ЗначениеЗаполнено(РодительРодителя) Тогда
			Возврат 2;
		Иначе 
			возврат 1;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
//-- #1537 смарт: Корбутов 02.11.2023

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
		
	Если СтрДлина(СокрЛП(Текст)) >= 3 Тогда
		
		ДанныеВыбора = смартПолучитьДанныеВыбораБизнесРегиона(Текст); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьДанныеВыбораБизнесРегиона(Текст) 
	
	Возврат Справочники.БизнесРегионы.смартПолучитьДанныеВыбораБизнесРегиона(Текст);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
		
		ВыбранноеЗначение = смартСоздатьБизнесРегион(ВыбранноеЗначение);  
		
	Иначе
		
		СтруктураВозврата = смартПолучитьУровеньКодСубьектаСправочника(ВыбранноеЗначение); 
		
		Если СтруктураВозврата.Уровень = 0 ИЛИ (СтруктураВозврата.Уровень = 1 И СтруктураВозврата.КодСубъекта <> 0) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для субъектов РФ необходимо выбрать населенный пункт'"));
			
			ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.БизнесРегионы.ПустаяСсылка");  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартСоздатьБизнесРегион(ВыбранноеЗначение) 
	
	Возврат Справочники.БизнесРегионы.смартСоздатьБизнесРегион(ВыбранноеЗначение);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьУровеньКодСубьектаСправочника(ЭлементСправочника) 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Уровень", ЭлементСправочника.Уровень());
	СтруктураВозврата.Вставить("КодСубъекта", ЭлементСправочника.СмартКодСубъектаРФ);
	
	Возврат СтруктураВозврата;

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ОбновитьЛенту")
Процедура смарт_Подключаемый_ОбновитьЛенту()

	ПараметрыЛенты = Новый Структура;
	ПараметрыЛенты.Вставить("Режим",				"ЛентаКлиента");
	ПараметрыЛенты.Вставить("Объект",				Объект.Ссылка);
	ПараметрыЛенты.Вставить("АдресКартинок",		Лента_АдресКартинок);
	ПараметрыЛенты.Вставить("АдресКартинокФайлов",	Лента_АдресКартинокФайлов);
	ПараметрыЛенты.Вставить("Отбор",				Лента_Отбор);
	ПараметрыЛенты.Вставить("ОбъектовИстории",		Лента_КоличествоОбъектовИстории);
	ПараметрыЛенты.Вставить("Прокрутить",			Лента_Прокрутить);
	ПараметрыЛенты.Вставить("Пустая",				Не ЗначениеЗаполнено(Объект.Ссылка) Или НеЗаполнятьЛенту);

	ПолучателиЧата = Новый Массив;
	Лента_HTML = CRM_ЛентаСобытий.СформироватьЛенту(ПараметрыЛенты, ПолучателиЧата);

	Лента_Прокрутить = Ложь;

	// +Рарус alexpr
	//Если Лента_ЗначенияНастроек.ИспользоватьЧаты Тогда
	//	CRM_ЛентаСобытийКлиент.НастроитьОбластьВводаПослеФормированияЛенты(ПолучателиЧата, ЭтотОбъект);
	//	ВидимостьКомандыЧат = (БыстрыйВвод_ЧатПолучатели.Количество() > 0);
	//	Если БыстрыйВвод_ТекущийТипОбъекта = "Чат" И Не ВидимостьКомандыЧат Тогда
	//		ПереключитьСтраницуБыстрогоВвода("Примечание");
	//	КонецЕсли;
	//КонецЕсли;
	CRM_ЛентаСобытийКлиентСервер.ОбластьВводаНастритьВидимостьКомандПослеФормированияЛенты(ЭтотОбъект);

	Если Лента_ЗначенияНастроек.ИспользоватьЧаты Тогда

		ПараметрыДополнения = Новый Структура;
		ПараметрыДополнения.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыДополнения.Вставить("УчетнаяЗапись", БыстрыйВвод_ЧатУчетнаяЗапись);
		ПараметрыДополнения.Вставить("ПартнерыКИ", ЭтотОбъект["КонтактнаяИнформацияОписаниеДополнительныхРеквизитов"]);

		МассивКонтактов = Новый Массив;
		МассивКонтактов.Добавить(Объект.Ссылка);
		Для Каждого Строка Из ЭтотОбъект["КонтактныеЛицаПартнера"] Цикл
			МассивКонтактов.Добавить(Строка.КонтактноеЛицо);
		КонецЦикла;
		ПараметрыДополнения.Вставить("МассивКонтактов", МассивКонтактов);

		CRM_КлиентыСервер.ДополнитьПолучателейЧата(ПолучателиЧата, ПараметрыДополнения);

		УчетныеЗаписиМессенджеров = CRM_КлиентыСервер.УчетныеЗаписиМессенджеров(БыстрыйВвод_ЧатВидКИ, Объект.Ссылка);
		CRM_ЛентаСобытийКлиентСервер.НастроитьОбластьВводаУчетныеЗаписиМессенджеров(УчетныеЗаписиМессенджеров, ЭтотОбъект);

		CRM_ЛентаСобытийКлиентСервер.НастроитьОбластьВводаПослеФормированияЛенты(ПараметрыЛенты, ПолучателиЧата, ЭтотОбъект);

	КонецЕсли;
	// -Рарус alexpr
	
	#Вставка
	Если ПолучателиЧата.Количество() > 0 Тогда
		
		Элементы.смартДекорацияНетПолучателейЧата.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатСодержание.Видимость = Истина;
		Элементы.БыстрыйВвод_КомандыЧат.Видимость = Истина;
		
	Иначе
		
		Элементы.смартДекорацияНетПолучателейЧата.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатСодержание.Видимость = Ложь;
		Элементы.БыстрыйВвод_КомандыЧат.Видимость = Ложь;
		
	КонецЕсли;
	#КонецВставки
	
		
	#Вставка
	//++ #Б-2372 смарт: Фролов 18.02.2025 //Пересчет регистра состояние партнеров при проведении Взаимодействия.
	СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка);
	Элементы.смартСостояниеОтветственного.Заголовок = СтруктураНовогоСостояния.Состояние;
	
	Если НЕ СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") Тогда
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Заголовок = "Станет свободным через:";
		Элементы.смартОтветственныйСтанетСвободным.Заголовок = "" + СтруктураНовогоСостояния.КоличествоДней + " " 
			+ смартОбщегоНазначения.ПолучитьДниВСклонении(СтруктураНовогоСостояния.КоличествоДней);
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Истина;
		Элементы.смартОтветственныйСтанетСвободным.Видимость = Истина;
		
		//++ #Б-2754 смарт: Фролов 21.03.2025 //Доработка рабочего места сотрудника.
		Если НЕ смартПользователи.РольДоступнаПользователю("смартРуководительCRM") 
			И НЕ смартПользователи.РольДоступнаПользователю("ПолныеПрава") Тогда
			
			Элементы.ОсновнойМенеджер.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		//-- #Б-2754 смарт: Фролов 21.03.2025
		
	Иначе	
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовок.Видимость = Ложь;
		Элементы.смартОтветственныйСтанетСвободным.Видимость = Ложь;
		
	КонецЕсли;	
	//-- #Б-2372 смарт: Фролов 18.02.2025
	
	//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
	//++ #Б-2484 смарт: Фролов 05.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
	//СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка, Истина);
	СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка, "СЦ");
	//-- #Б-2782 смарт: Фролов 25.03.2025
	
	Элементы.смартСостояниеОтветственногоСЦ.Заголовок = СтруктураНовогоСостояния.Состояние;
	
	Если НЕ СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") 
		//++ #Б-2852 смарт: Фролов 08.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
		И НЕ СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Архивный") Тогда
		//-- #Б-2852 смарт: Фролов 08.04.2025
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовокСЦ.Заголовок = "Станет свободным через:";
		Элементы.смартОтветственныйСтанетСвободнымСЦ.Заголовок = "" + СтруктураНовогоСостояния.КоличествоДней + " " 
			+ смартОбщегоНазначения.ПолучитьДниВСклонении(СтруктураНовогоСостояния.КоличествоДней);
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовокСЦ.Видимость = Истина;
		Элементы.смартОтветственныйСтанетСвободнымСЦ.Видимость = Истина;
		
		//++ #Б-3092 смарт: Фролов 16.04.2025 //Ошибка. Сделать возможным перевод партнера в Архив в состоянии Ведется работа.
		//++ #Б-2852 смарт: Фролов 11.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
		//Элементы.смартСостояниеОтветственногоСЦ.Гиперссылка = Ложь;
		//-- #Б-2852 смарт: Фролов 11.04.2025
		//-- #Б-3092 смарт: Фролов 16.04.2025
		
	Иначе	
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовокСЦ.Видимость = Ложь;
		Элементы.смартОтветственныйСтанетСвободнымСЦ.Видимость = Ложь;
		
		//++ #Б-3092 смарт: Фролов 16.04.2025 //Ошибка. Сделать возможным перевод партнера в Архив в состоянии Ведется работа.
		//++ #Б-2852 смарт: Фролов 11.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
		//Элементы.смартСостояниеОтветственногоСЦ.Гиперссылка = Истина;
		//-- #Б-2852 смарт: Фролов 11.04.2025
		//-- #Б-3092 смарт: Фролов 16.04.2025
		
	КонецЕсли;
	//-- #Б-2484 смарт: Фролов 05.03.2025
	
	//++ #Б-2852 смарт: Фролов 10.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
	Если СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Архивный") Тогда
		
		Элементы.смартСостояниеОтветственногоСЦ.ЦветТекста = Новый Цвет(255, 0, 0);
		
		Если ТипЗнч(СтруктураНовогоСостояния.ПричинаПереводаКлиентовВАрхив) 
				= Тип("СправочникСсылка.смартПричиныПереводаКлиентовВАрхив") Тогда
				
			Элементы.смартПричинаАрхивированияКлиентаСЦ.Видимость = Истина;
			Элементы.смартПричинаАрхивированияКлиентаСЦ.Заголовок = СтруктураНовогоСостояния.ПричинаПереводаКлиентовВАрхив;
			
		Иначе	
			
			Элементы.смартПричинаАрхивированияКлиентаСЦ.Видимость = Ложь;
			
		КонецЕсли;	
		
	Иначе
		
		Элементы.смартСостояниеОтветственногоСЦ.ЦветТекста = Новый Цвет(0, 150, 70);
		Элементы.смартПричинаАрхивированияКлиентаСЦ.Видимость = Ложь;
		
	КонецЕсли;
	//-- #Б-2852 смарт: Фролов 10.04.2025	
	
	//++ #Б-3056 смарт: Фролов 14.04.2025 //Изменение логики смены ответственного СЦ в партнере.
	Если СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") Тогда 
		
		//++ #Б-7140 смарт: Фролов 10.08.2026 //Исключения для руководителей ОП по смене закрепленного партнера в рамках своего ОП
		//++ #Б-7658 смарт: Фролов 03.08.2026 //Проверить какая роль запрещает менять ответственного РМ и СЦ
		//Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = Ложь;
		//Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = НЕ смартПользователи.РольДоступнаПользователю("CRM_ПередачаДелОтветственному");
		Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = НЕ смартПользователи.РольДоступнаПользователю("CRM_ПередачаДелОтветственному")
			И НЕ ПользователиКлиент.ЭтоПолноправныйПользователь();
		//-- #Б-7658 смарт: Фролов 04.08.2026
		//-- #Б-7140 смарт: Фролов 10.08.2026
		
	Иначе
		
		Если смартПользователи.РольДоступнаПользователю("смартРуководительCRM") ИЛИ ПользователиКлиент.ЭтоПолноправныйПользователь() Тогда
			
			//++ #Б-7140 смарт: Фролов 10.08.2026 //Исключения для руководителей ОП по смене закрепленного партнера в рамках своего ОП
			//Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = Ложь;
			//-- #Б-7140 смарт: Фролов 10.08.2026	
			
		Иначе
			
			Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = Истина;
		
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-3056 смарт: Фролов 14.04.2025
	
	//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
	СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка, "РМ");
	
	Элементы.смартСостояниеОтветственногоРМ.Заголовок = СтруктураНовогоСостояния.Состояние;
	
	Если НЕ СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") Тогда
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовокРМ.Заголовок = "Станет свободным через:";
		Элементы.смартОтветственныйСтанетСвободнымРМ.Заголовок = "" + СтруктураНовогоСостояния.КоличествоДней + " " 
			+ смартОбщегоНазначения.ПолучитьДниВСклонении(СтруктураНовогоСостояния.КоличествоДней);
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовокРМ.Видимость = Истина;
		Элементы.смартОтветственныйСтанетСвободнымРМ.Видимость = Истина;
		
	Иначе	
		
		Элементы.смартОтветственныйСтанетСвободнымЗаголовокРМ.Видимость = Ложь;
		Элементы.смартОтветственныйСтанетСвободнымРМ.Видимость = Ложь;
		
	КонецЕсли;
	//-- #Б-2782 смарт: Фролов 25.03.2025
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
//++ #1920 смарт: Фролов 12.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартЗакрепленОтветственныйПриИзменении(Элемент)
	
	Если ЭтаФорма.смартЗакрепленОтветственный Тогда
		
		ДополнительныеПараметры = Новый Структура("ТипУслуги, НаименованиеРеквизитаБулево, НаименованиеРеквизита, ТипДействия", 
			"ПоставкаТоварыУслуги", "смартЗакрепленОтветственный", "ОсновнойМенеджер", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановкаСнятиеЗакрепленияОтветственного", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Вы хотите закрепить за Менеджером " + Объект.ОсновнойМенеджер + 
			" партнера " + Объект.Наименование + ", Продолжить ?",РежимДиалогаВопрос.ДаНет, 60);
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура("ТипУслуги, НаименованиеРеквизитаБулево, НаименованиеРеквизита, ТипДействия", 
			"ПоставкаТоварыУслуги", "смартЗакрепленОтветственный", "ОсновнойМенеджер", Ложь);
		ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановкаСнятиеЗакрепленияОтветственного", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Вы хотите снять закрепление партнера " + Объект.Наименование + 
			" за " + Объект.ОсновнойМенеджер +", Продолжить ?",РежимДиалогаВопрос.ДаНет, 60);
		
	КонецЕсли;	
	
КонецПроцедуры //-- #1920 смарт: Фролов 12.07.2024

&НаКлиенте
//++ #1920 смарт: Фролов 16.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартЗакрепленОтветственныйРМПриИзменении(Элемент)
	
	Если ЭтаФорма.смартЗакрепленОтветственныйПоРасхМатериалам Тогда
		
		ДополнительныеПараметры = Новый Структура("ТипУслуги, НаименованиеРеквизитаБулево, НаименованиеРеквизита, ТипДействия", 
			"ПоставкаРасходныеМатериалы", "смартЗакрепленОтветственныйПоРасхМатериалам", "смартМенеджерПоРасходнымМатериалам", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановкаСнятиеЗакрепленияОтветственного", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Вы хотите закрепить за Менеджером " + Объект.смартМенеджерПоРасходнымМатериалам + 
			" партнера " + Объект.Наименование + ", Продолжить ?",РежимДиалогаВопрос.ДаНет, 60);
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура("ТипУслуги, НаименованиеРеквизитаБулево, НаименованиеРеквизита, ТипДействия", 
			"ПоставкаРасходныеМатериалы", "смартЗакрепленОтветственныйПоРасхМатериалам", "смартМенеджерПоРасходнымМатериалам", Ложь);
		ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановкаСнятиеЗакрепленияОтветственного", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Вы хотите снять закрепление партнера " + Объект.Наименование + 
			" за " + Объект.смартМенеджерПоРасходнымМатериалам +", Продолжить ?",РежимДиалогаВопрос.ДаНет, 60);
		
	КонецЕсли;	
	
КонецПроцедуры //-- #1920 смарт: Фролов 16.07.2024

&НаКлиенте
//++ #1920 смарт: Фролов 16.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартЗакрепленОтветственныйСЦПриИзменении(Элемент)
	
	Если ЭтаФорма.смартЗакрепленОтветственныйСервЦентра Тогда
		
		ДополнительныеПараметры = Новый Структура("ТипУслуги, НаименованиеРеквизитаБулево, НаименованиеРеквизита, ТипДействия", 
			"ПоставкаЗапасныеЧасти", "смартЗакрепленОтветственныйСервЦентра", "смартОсновнойМенеджерСервисЦентра", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановкаСнятиеЗакрепленияОтветственного", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Вы хотите закрепить за Менеджером " + Объект.смартОсновнойМенеджерСервисЦентра + 
			" партнера " + Объект.Наименование + ", Продолжить ?",РежимДиалогаВопрос.ДаНет, 60);
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура("ТипУслуги, НаименованиеРеквизитаБулево, НаименованиеРеквизита, ТипДействия", 
			"ПоставкаЗапасныеЧасти", "смартЗакрепленОтветственныйСервЦентра", "смартОсновнойМенеджерСервисЦентра", Ложь);
		ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановкаСнятиеЗакрепленияОтветственного", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Вы хотите снять закрепление партнера " + Объект.Наименование + 
			" за " + Объект.смартОсновнойМенеджерСервисЦентра +", Продолжить ?",РежимДиалогаВопрос.ДаНет, 60);
		
		
	КонецЕсли;	
	
КонецПроцедуры //-- #1920 смарт: Фролов 16.07.2024

&НаКлиенте
//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартУстановкаСнятиеЗакрепленияОтветственного(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		смартУстановитьСнятьЗакреплениеМенеджера(Новый Структура("Менеджер, ТипУслуги, ТипДействия", 
			Объект[ДополнительныеПараметры.НаименованиеРеквизита], ДополнительныеПараметры.ТипУслуги, ДополнительныеПараметры.ТипДействия));
			
		смартУстановитьЗначенияЗакрепленияМенеджеров(ПредопределенноеЗначение("Справочник.CRM_ТипУслуги." + 
			ДополнительныеПараметры.ТипУслуги));
			
	Иначе
		
		ЭтаФорма[ДополнительныеПараметры.НаименованиеРеквизитаБулево] = НЕ ДополнительныеПараметры.ТипДействия;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1920 смарт: Фролов 17.07.2024	

&НаКлиенте
//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартОсновнойМенеджерПриИзменении(Элемент)
	
	//++#1952 смарт: Лопато 29.07.2024 //Механизм закрепления Партнеров ответственными менеджерами. Исправление ошибок (продолжение 1920)
	//Элементы.смартЗакрепленОтветственный.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.ОсновнойМенеджер);			
	//--#1952 смарт: Лопато 29.07.2024
	
	//++ #Б-7140 смарт: Фролов 10.08.2026 //Исключения для руководителей ОП по смене закрепленного партнера в рамках своего ОП
	СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка);
	
	Если СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") Тогда
	
		//++#1936 смарт: Лопато 29.07.2024 //Управление запретом изменять основного менеджера клиента  
		смартПроверитьОграниченияИзмененияОсновногоМенеджераСервер();
		//--#1936 смарт: Лопато 29.07.2024
		
	КонецЕсли;
	//-- #Б-7140 смарт: Фролов 10.08.2026
	
	//++ #Б-4320 смарт: Фролов 15.09.2025 //Возможность выбора ответственного в партнере только при наличии нужной квалификации.
	Если НЕ ПользователиКлиент.ЭтоПолноправныйПользователь() Тогда
	
		смартПроверитьКвалификациюОтветственного();
		
	КонецЕсли;
	//-- #Б-4320 смарт: Фролов 15.09.2025
	
КонецПроцедуры //-- #1920 смарт: Фролов 17.07.2024 

&НаСервере
//++ #Б-4320 смарт: Фролов 15.09.2025 //Возможность выбора ответственного в партнере только при наличии нужной квалификации.
Процедура смартПроверитьКвалификациюОтветственного()
	
	Если Справочники.смартПредопределенныеЗначения.Настройки.ПроверятьКвалификациюОтветственногоПартнера Тогда
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.смартКвалификацииМенеджеров.Пользователи
		|ГДЕ
		|	Пользователь = &Пользователь
		|	И Ссылка.ТипПродукта = ЗНАЧЕНИЕ(Справочник.смартТипыПродуктов.Оборудование)");
		Запрос.УстановитьПараметр("Пользователь", Объект.ОсновнойМенеджер);
		
		Если Запрос.Выполнить().Пустой() Тогда
			
			Объект.ОсновнойМенеджер = Неопределено;	
			
			ОбщегоНазначения.СообщитьПользователю("У выбираемого пользователя нет квалификации по оборудованию!", , "ОсновнойМенеджер");	
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры //-- #Б-4320 смарт: Фролов 15.09.2025	

&НаКлиенте
//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартМенеджерПоРасходнымМатериаламПриИзменении(Элемент)
	
	//++#1952 смарт: Лопато 29.07.2024 //Механизм закрепления Партнеров ответственными менеджерами. Исправление ошибок (продолжение 1920)
	//Элементы.смартЗакрепленОтветственныйПоРасхМатериалам.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.смартМенеджерПоРасходнымМатериалам);
	//--#1952 смарт: Лопато 29.07.2024
	
	//++ #Б-7140 смарт: Фролов 10.08.2026 //Исключения для руководителей ОП по смене закрепленного партнера в рамках своего ОП
	СтруктураНовогоСостояния = смартОбщегоНазначения.ПолучитьНовоеСостояниеПартнера(Объект.Ссылка, "РМ");
	
	Если СтруктураНовогоСостояния.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияПартнеров.Свободен") Тогда
	
		//++ #Б-5040 смарт: Фролов 24.11.2025 //Сделать возможным изменение ответственного по РМ, при соблюдении условий
		смартПроверитьОграниченияИзмененияМенеджераРМСервер();
		//-- #Б-5040 смарт: Фролов 24.11.2025
	
	КонецЕсли;
	//-- #Б-7140 смарт: Фролов 10.08.2026
	
КонецПроцедуры //-- #1920 смарт: Фролов 17.07.2024

&НаКлиенте
//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартОсновнойМенеджерСервисЦентраПриИзменении(Элемент)
	
	//++#1952 смарт: Лопато 29.07.2024 //Механизм закрепления Партнеров ответственными менеджерами. Исправление ошибок (продолжение 1920)
	//Элементы.смартЗакрепленОтветственныйСервЦентра.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.смартОсновнойМенеджерСервисЦентра);
	//--#1952 смарт: Лопато 29.07.2024
	
КонецПроцедуры //-- #1920 смарт: Фролов 17.07.2024

&НаСервере
//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартУстановитьСнятьЗакреплениеМенеджера(СтруктураЗаписи)

	МенеджерЗаписи = РегистрыСведений.смартИсторияЗакрепленияПартнеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Партнер = Объект.Ссылка;
	МенеджерЗаписи.ТипУслуги = Справочники.CRM_ТипУслуги[СтруктураЗаписи.ТипУслуги];
	МенеджерЗаписи.Менеджер = ?(СтруктураЗаписи.ТипДействия, СтруктураЗаписи.Менеджер, Неопределено);
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры //-- #1920 смарт: Фролов 17.07.2024

&НаСервере
//++ #1920 смарт: Фролов 17.07.2024 //Механизм закрепления Партнеров ответственными менеджерами.
Процедура смартУстановитьЗначенияЗакрепленияМенеджеров(ТипУслуги);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Менеджер КАК Менеджер,
	|	Период КАК Период
	|ИЗ
	|	РегистрСведений.смартИсторияЗакрепленияПартнеров.СрезПоследних(
	|			,
	|			ТипУслуги = &ТипУслуги
	|				И Партнер = &Партнер)");
	Запрос.УстановитьПараметр("ТипУслуги", ТипУслуги);
	Запрос.УстановитьПараметр("Партнер", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги Тогда
			
			ЭтаФорма.смартЗакрепленОтветственный = ЗначениеЗаполнено(Выборка.Менеджер);
			ЭтаФорма.смартЗакрепленОтветственныйДата = ?(ЗначениеЗаполнено(Выборка.Менеджер), Выборка.Период, "");
			Элементы.ОсновнойМенеджер.ТолькоПросмотр = ЭтаФорма.смартЗакрепленОтветственный;
			
		ИначеЕсли ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаРасходныеМатериалы Тогда

			ЭтаФорма.смартЗакрепленОтветственныйПоРасхМатериалам = ЗначениеЗаполнено(Выборка.Менеджер);
			ЭтаФорма.смартЗакрепленОтветственныйРМДата = ?(ЗначениеЗаполнено(Выборка.Менеджер), Выборка.Период, "");
			//++ #Б-7658 смарт: Фролов 03.08.2026 //Проверить какая роль запрещает менять ответственного РМ и СЦ
			//Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = ЭтаФорма.смартЗакрепленОтветственныйПоРасхМатериалам;
			Элементы.смартМенеджерПоРасходнымМатериалам.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("CRM_ПередачаДелОтветственному");
			//-- #Б-7658 смарт: Фролов 04.08.2026
			
		ИначеЕсли ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда

			ЭтаФорма.смартЗакрепленОтветственныйСервЦентра = ЗначениеЗаполнено(Выборка.Менеджер);
			ЭтаФорма.смартЗакрепленОтветственныйСЦДата = ?(ЗначениеЗаполнено(Выборка.Менеджер), Выборка.Период, "");
			//++ #Б-7658 смарт: Фролов 03.08.2026 //Проверить какая роль запрещает менять ответственного РМ и СЦ
			//Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = ЭтаФорма.смартЗакрепленОтветственныйСервЦентра;
			Элементы.смартОсновнойМенеджерСервисЦентра.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("CRM_ПередачаДелОтветственному");
			//-- #Б-7658 смарт: Фролов 04.08.2026
			
		КонецЕсли;	
		
	Иначе
		
		Если ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги Тогда
			
			ЭтаФорма.смартЗакрепленОтветственный = Ложь;
			ЭтаФорма.смартЗакрепленОтветственныйДата = "";
			
		ИначеЕсли ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаРасходныеМатериалы Тогда

			ЭтаФорма.смартЗакрепленОтветственныйПоРасхМатериалам = Ложь;
			ЭтаФорма.смартЗакрепленОтветственныйРМДата = "";
			
		ИначеЕсли ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти Тогда

			ЭтаФорма.смартЗакрепленОтветственныйСервЦентра = Ложь;
			ЭтаФорма.смартЗакрепленОтветственныйСЦДата = "";
			
		КонецЕсли;	
		
	КонецЕсли;	

КонецПроцедуры //-- #1920 смарт: Фролов 17.07.2024

//++#1936 смарт: Лопато 29.07.2024 //Управление запретом изменять основного менеджера клиента  
&НаСервере
Процедура смартПроверитьОграниченияИзмененияОсновногоМенеджераСервер()

	Если НЕ Объект.Ссылка.Пустая() 
		И НЕ Пользователи.РолиДоступны("ПолныеПрава,
									   |смартДоступРедактироватьЗаблокированогоМенеджераКлиента",
									   Пользователи.АвторизованныйПользователь()) Тогда
									   
		ПрошлыйОсновнойМенеджер = Объект.Ссылка.ОсновнойМенеджер;
		
		Если ЗначениеЗаполнено(ПрошлыйОсновнойМенеджер)
			И Объект.ОсновнойМенеджер <> ПрошлыйОсновнойМенеджер Тогда
		
			//++ #2051 смарт: Фролов 11.09.2024 //Делаем механизм изменения основного менеджера по звонку для всех партнеров,а не только для Джавадовой (продолжение 1936)
			//МассивМенеджеров = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(
			//					   "ОсновныеМенеджерыДляОграниченияДоступаРедактированияПартнеров", Истина);

			//Если МассивМенеджеров.Количество() > 0
			//	И МассивМенеджеров.Найти(ПрошлыйОсновнойМенеджер) <> Неопределено Тогда
			//-- #2051 смарт: Фролов 11.09.2024
			
				Если НЕ смартОбщегоНазначения.смартБылЗвонокОтветственногоПартнеру(Пользователи.АвторизованныйПользователь(),
																				   Объект.Ссылка,
																				   Дата(2024, 7, 22),
																				   
				//++ #Б-1134 смарт: Фролов 14.10.2024 //Изменить время после которого можно поменять ответственного
				                                                                   3600 * 24 * 30,
				//++ #Б-6000 смарт: Фролов 10.03.2026 //Вынести в предопределенные настройки параметр длительности звонка.																   
				//++ #Б-1572 смарт: Фролов 05.12.2024 //Вернуть длительность звонка - 30 сек. необходимую для смены ответственного.
																				//60)
																					//30)
																					Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера)
				//-- #Б-1572 смарт: Фролов 05.12.2024												
				//-- #Б-6000 смарт: Фролов 10.03.2026																   
																				   Тогда

					Объект.ОсновнойМенеджер = ПрошлыйОсновнойМенеджер;

					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						//++ #Б-6018 смарт: Фролов 11.03.2026 //Исправить оповещение о нужной длительности звонка.
						//НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более 30 сек.'"));
						НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более "
						+ Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера + "сек.'")); 
						//-- #Б-6018 смарт: Фролов 11.03.2026
				//-- #Б-1134 смарт: Фролов 14.10.2024	
					
				КонецЕсли;	
				
			//++ #2051 смарт: Фролов 11.09.2024 //Делаем механизм изменения основного менеджера по звонку для всех партнеров,а не только для Джавадовой (продолжение 1936)		
			//КонецЕсли;
			//-- #2051 смарт: Фролов 11.09.2024

		КонецЕсли;	
			
	КонецЕсли;

КонецПроцедуры //--#1936 смарт: Лопато 29.07.2024	

&НаСервере
//++ #Б-5040 смарт: Фролов 24.11.2025 //Сделать возможным изменение ответственного по РМ, при соблюдении условий
Процедура смартПроверитьОграниченияИзмененияМенеджераРМСервер()

	Если НЕ Объект.Ссылка.Пустая() 
		И НЕ Пользователи.РолиДоступны("ПолныеПрава,
									   |смартДоступРедактироватьЗаблокированогоМенеджераКлиента",
									   Пользователи.АвторизованныйПользователь()) Тогда
									   
		ПрошлыйМенеджерРМ = Объект.Ссылка.смартМенеджерПоРасходнымМатериалам;
		
		Если ЗначениеЗаполнено(ПрошлыйМенеджерРМ)
			И Объект.смартМенеджерПоРасходнымМатериалам <> ПрошлыйМенеджерРМ Тогда
		
				Если НЕ смартОбщегоНазначения.смартБылЗвонокОтветственногоПартнеру(Пользователи.АвторизованныйПользователь(),
																				   Объект.Ссылка,
																				   Дата(2024, 7, 22),
																				   3600 * 24 * 30,
					//++ #Б-6000 смарт: Фролов 10.03.2026 //Вынести в предопределенные настройки параметр длительности звонка.																   
																					//30)
																					   Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера)
					//-- #Б-6000 смарт: Фролов 10.03.2026																   
																				   Тогда

					Объект.смартМенеджерПоРасходнымМатериалам = ПрошлыйМенеджерРМ;

					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						//++ #Б-6018 смарт: Фролов 11.03.2026 //Исправить оповещение о нужной длительности звонка.
						//НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более 30 сек.'"));
						НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более "
						+ Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера + "сек.'")); 
						//-- #Б-6018 смарт: Фролов 11.03.2026
					
				КонецЕсли;	

		КонецЕсли;	
			
	КонецЕсли;

КонецПроцедуры //-- #Б-5040 смарт: Фролов 24.11.2025	

&НаКлиенте
//++ #Б-1170 смарт: Фролов 18.10.2024 //Сделать возможным быстрое отражение состоявшегося взаимодействия
Процедура смартПереключательСтатусаВзаимодействияПриИзменении(Элемент)
	
	Если ЭтаФорма.смартПереключательСтатусаВзаимодействия = 1 Тогда
		Элементы.БыстрыйВвод_ВзаимодействиеТема.Видимость = Истина; 
		Элементы.БыстрыйВвод_Содержание.ПодсказкаВвода = "Опишите содержание планируемого взаимодействия";
		Элементы.БыстрыйВвод_Содержание.Заголовок = "Содержание";
	Иначе
		Элементы.БыстрыйВвод_ВзаимодействиеТема.Видимость = Ложь; 
		Элементы.БыстрыйВвод_Содержание.ПодсказкаВвода = "Укажите результат прошедшего взаимодействия"; 
		Элементы.БыстрыйВвод_Содержание.Заголовок = "Результат взаимодействия";
	КонецЕсли;
	
КонецПроцедуры //-- #Б-1170 смарт: Фролов 18.10.2024

//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
&НаКлиенте
Процедура ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера() Экспорт
	
	ЗаданиеВыполнено = ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнераСервер();
	Если ЗаданиеВыполнено Тогда
		ОтключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнера");
	КонецЕсли;
	
КонецПроцедуры

//++ #Б1174 смарт: Шляпников 21.10.2024 / При открытии карточки партнера или интереса, проверять по телефонам контактов наличие дублей
&НаСервере
Функция ПроверитьЗавершениеФоновогоЗаданияПроверкиПартнераСервер() Экспорт
	
	ПродолжатьРаботу = Ложь;
	Реквизиты = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого стрРеквизит Из Реквизиты Цикл
		Если стрРеквизит.Имя = "ИдентификаторЗаданияПроверкиПартнера" Тогда
			ПродолжатьРаботу = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПродолжатьРаботу Тогда
		Возврат Истина;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ЭтаФорма.ИдентификаторЗаданияПроверкиПартнера));
	Если Задание = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		Дубли = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилища);
		
		Если Дубли.Количество() > 0 Тогда
			
			ПолучитьСообщенияПользователю(Истина);
			
			МассивСообщений = смартПроверкаПартнеров.СформироватьМассивСообщенийПоТаблицеДублейПартнеров(Дубли);
			Для каждого стрСообщение Из МассивСообщений Цикл
				ОбщегоНазначения.СообщитьПользователю(стрСообщение.Сообщение, стрСообщение.Ключ);
			КонецЦикла;
			
			ОбщегоНазначения.СообщитьПользователю("Необходимо оставить телефон только у одного Партнера! Иначе телефонные звонки на эти номера не будут отображаться в 1С!");
			
		КонецЕсли;
		
		Возврат Истина;
		
	ИначеЕсли НЕ Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
//++ #Б-2852 смарт: Фролов 08.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
Процедура смартУбратьВАрхивНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Партнер", Объект.Ссылка);
		
		ПараметрыДляФормыАрхивирования = смартВернутьПараметрыФормыАрхивированияРазархивированияКлиента();
		
		ПараметрыОткрытия.Вставить("Дата", ПараметрыДляФормыАрхивирования.Дата);
		ПараметрыОткрытия.Вставить("Ответственный", ПараметрыДляФормыАрхивирования.Ответственный);
		ПараметрыОткрытия.Вставить("Причина", ПараметрыДляФормыАрхивирования.Причина);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("смартУбратьВАрхивПартнера", ЭтаФорма);
		
		ОткрытьФорму(ПараметрыДляФормыАрхивирования.ИмяФормы, ПараметрыОткрытия, ЭтаФорма, , , , ОповещениеОЗакрытии, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-2852 смарт: Фролов 08.04.2025

&НаКлиенте
//++ #Б-5258 смарт: Фролов 16.12.2025 //Создание механизма сегментации партнеров.
Процедура смартРедактироватьВидыДеятельности(Элемент) 
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("Партнер", Объект.Ссылка); 
	
	МассивВидовДеятельности = Новый Массив;
	
	Для Каждого СтрВидыДеятельности Из Объект.смартВидыДеятельности Цикл
		
		//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
		СтруктураВидаДеятельность = Новый Структура("ВидДеятельности, УстановленМенеджером, УстановленИИ, ОбоснованиеВыбораИИ",
			СтрВидыДеятельности.ВидДеятельности, СтрВидыДеятельности.УстановленМенеджером, СтрВидыДеятельности.УстановленИИ, СтрВидыДеятельности.ОбоснованиеВыбораИИ);
			
		МассивВидовДеятельности.Добавить(СтруктураВидаДеятельность);	
		//МассивВидовДеятельности.Добавить(СтрВидыДеятельности.ВидДеятельности);
		//-- #Б-7322 смарт: Фролов 06.07.2026
		
	КонецЦикла;
	
	МассивТипичноеОборудование = Новый Массив;
	МассивНаших = Новый Массив;
	
	Для Каждого СтрТипичноеОборудование Из Объект.смартТипичноеОборудование Цикл
		
		МассивТипичноеОборудование.Добавить(СтрТипичноеОборудование.ТипичноеОборудование);
		
		Если СтрТипичноеОборудование.КупленоВСМАРТ Тогда
			
			МассивНаших.Добавить(СтрТипичноеОборудование.ТипичноеОборудование);	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ПараметрыОткрытия.Вставить("МассивВидовДеятельности", МассивВидовДеятельности);
	ПараметрыОткрытия.Вставить("МассивТипичноеОборудование", МассивТипичноеОборудование);
	ПараметрыОткрытия.Вставить("МассивНаших", МассивНаших);
	
	//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера
	ВидДеятельностиДругое = ВидДеятельностиДругое();
	ВидДеятельностиДругоеРасшифровка = Новый Структура("ВидДеятельности, ДругоеРасшифровка", ВидДеятельностиДругое, "");
	НайденныеСтроки = Объект.смартВидыДеятельности.НайтиСтроки(Новый Структура("ВидДеятельности", ВидДеятельностиДругое));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ВидДеятельностиДругоеРасшифровка, НайденныеСтроки[0]);
	КонецЕсли;
	
	ТипичноеОборудованиеДругое = ТипичноеОборудованиеДругое();
	ТипичноеОборудованиеДругоеРасшифровка = Новый Структура("ТипичноеОборудование, ДругоеРасшифровка", ТипичноеОборудованиеДругое, "");
	НайденныеСтроки = Объект.смартТипичноеОборудование.НайтиСтроки(Новый Структура("ТипичноеОборудование", ТипичноеОборудованиеДругое));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ТипичноеОборудованиеДругоеРасшифровка, НайденныеСтроки[0]);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ВидДеятельностиДругоеРасшифровка", ВидДеятельностиДругоеРасшифровка);
	ПараметрыОткрытия.Вставить("ТипичноеОборудованиеДругоеРасшифровка", ТипичноеОборудованиеДругоеРасшифровка);
	//-- #6764 смарт: Тимофеева 15.05.2026 
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("смартЗакрытаФормаРедактированияВидовДеятельности", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Партнеры.Форма.смарт_ФормаРедактированияВидовДеятельности", ПараметрыОткрытия, ЭтаФорма, , , , 
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- #Б-5258 смарт: Фролов 16.12.2025

//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера 
&НаСервереБезКонтекста
Функция ВидДеятельностиДругое()
	Возврат Справочники.смартВидыДеятельностиПартнера.НайтиПоНаименованию("Другое", Истина);
КонецФункции

&НаСервереБезКонтекста
Функция ТипичноеОборудованиеДругое()
	Возврат Справочники.смартТипичноеОборудование.НайтиПоНаименованию("Другое", Истина);
КонецФункции  
//-- #6764 смарт: Тимофеева 15.05.2026 
	
&НаСервере
//++ #Б-2852 смарт: Фролов 09.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
Функция смартВернутьПараметрыФормыАрхивированияРазархивированияКлиента()

	Если Элементы.смартСостояниеОтветственногоСЦ.Заголовок = "Архивный" Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач
		|ГДЕ
		|	РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.смартОтветственныйЗаСогласованиеСтатусаПартнера)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостояниеСЦ КАК СостояниеСЦ,
		|	ДатаПереводаВАрхив КАК ДатаПереводаВАрхив,
		|	ПричинаПереводаКлиентовВАрхив КАК ПричинаПереводаКлиентовВАрхив,
		|	ОтветственныйЗаПереводВАрхив КАК ОтветственныйЗаПереводВАрхив,
		|	СогласованоПомещениеВАрхив КАК СогласованоПомещениеВАрхив
		|ИЗ
		|	РегистрСведений.смартСостояниеПартнеров
		|ГДЕ
		|	Партнер = &Партнер");
		Запрос.УстановитьПараметр("Партнер", Объект.Ссылка);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Выборка = МассивРезультатов[1].Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.СостояниеСЦ = Перечисления.смартСостоянияПартнеров.Архивный Тогда
				
					МассивСогласователей = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("Исполнитель");
					
					Если НЕ МассивСогласователей.Найти(ПараметрыСеанса.ТекущийПользователь) = Неопределено 
						И НЕ Выборка.СогласованоПомещениеВАрхив Тогда
					
						Возврат Новый Структура("Дата, Ответственный, ИмяФормы, Причина", Выборка.ДатаПереводаВАрхив, Выборка.ОтветственныйЗаПереводВАрхив, 
										"Справочник.Партнеры.Форма.смарт_ФормаПереводаВАрхив", Выборка.ПричинаПереводаКлиентовВАрхив);	
						
					Иначе
						
						Возврат Новый Структура("Дата, Ответственный, ИмяФормы, Причина", Выборка.ДатаПереводаВАрхив, Выборка.ОтветственныйЗаПереводВАрхив, 
										"Справочник.Партнеры.Форма.смарт_ФормаВозвращенияИзАрхива", Выборка.ПричинаПереводаКлиентовВАрхив);
					
					КонецЕсли;
			
			Иначе
				
				Возврат Новый Структура("Дата, Ответственный, ИмяФормы, Причина", ТекущаяДата(), ПараметрыСеанса.ТекущийПользователь, 
						"Справочник.Партнеры.Форма.смарт_ФормаПереводаВАрхив", Выборка.ПричинаПереводаКлиентовВАрхив);	
			
			КонецЕсли;
		
		Иначе
			
			Возврат Новый Структура("Дата, Ответственный, ИмяФормы, Причина", ТекущаяДата(), ПараметрыСеанса.ТекущийПользователь, 
						"Справочник.Партнеры.Форма.смарт_ФормаПереводаВАрхив", "");
			
		КонецЕсли;

	Иначе
			
		Возврат Новый Структура("Дата, Ответственный, ИмяФормы, Причина", ТекущаяДата(), ПараметрыСеанса.ТекущийПользователь, 
						"Справочник.Партнеры.Форма.смарт_ФормаПереводаВАрхив", "");
		
	КонецЕсли;	
	
КонецФункции //-- #Б-2852 смарт: Фролов 09.04.2025	

&НаКлиенте
//++ #Б-5258 смарт: Фролов 16.12.2025 //Создание механизма сегментации партнеров.
Процедура смартЗакрытаФормаРедактированияВидовДеятельности(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Объект.смартВидыДеятельности.Очистить();
		
		Для Каждого Стр Из Результат.МассивВидовДеятельности Цикл
			
			СтрокасмартВидыДеятельности = Объект.смартВидыДеятельности.Добавить();
			//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
			ЗаполнитьЗначенияСвойств(СтрокасмартВидыДеятельности, Стр);
			//СтрокасмартВидыДеятельности.ВидДеятельности = Стр;
			//-- #Б-7322 смарт: Фролов 06.07.2026
			
		КонецЦикла; 
		
		Объект.смартТипичноеОборудование.Очистить();
		
		Для Каждого Стр Из Результат.МассивТипичноеОборудование Цикл
			
			СтрокасмартТипичноеОборудование = Объект.смартТипичноеОборудование.Добавить();
			СтрокасмартТипичноеОборудование.ТипичноеОборудование = Стр;
			
			Если НЕ Результат.МассивНаших.Найти(Стр) = Неопределено Тогда
				
				СтрокасмартТипичноеОборудование.КупленоВСМАРТ = Истина;	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера 
		Если Результат.Свойство("ВидДеятельностиДругоеРасшифровка") Тогда
			НайденныеСтроки = Объект.смартВидыДеятельности.НайтиСтроки(Новый Структура("ВидДеятельности", Результат.ВидДеятельностиДругоеРасшифровка.ВидДеятельности));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].ДругоеРасшифровка = Результат.ВидДеятельностиДругоеРасшифровка.ДругоеРасшифровка;		
			КонецЕсли;
		КонецЕсли;   
		Если Результат.Свойство("ТипичноеОборудованиеДругоеРасшифровка") Тогда
			НайденныеСтроки = Объект.смартТипичноеОборудование.НайтиСтроки(Новый Структура("ТипичноеОборудование", Результат.ТипичноеОборудованиеДругоеРасшифровка.ТипичноеОборудование));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].ДругоеРасшифровка = Результат.ТипичноеОборудованиеДругоеРасшифровка.ДругоеРасшифровка;		
			КонецЕсли;
		КонецЕсли;
		//-- #6764 смарт: Тимофеева 15.05.2026 

		ЭтаФорма.Модифицированность = Истина;
		
		Элементы.смартВидыДеятельности.Обновить();	
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-5258 смарт: Фролов 16.12.2025

&НаКлиенте
//++ #Б-2852 смарт: Фролов 08.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
Процедура смартУбратьВАрхивПартнера(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Подключаемый_ОбновитьЛенту();
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-2852 смарт: Фролов 08.04.2025

&НаКлиенте
//++ #Б-3552 смарт: Фролов 26.06.2025 //Заполнение раздела Доставка в заказе клиента на регулярной основе. 
Процедура смартПартнерСпособДоставкиПриИзменении(Элемент) 
	
	//++ #4286 смарт: Тимофеева 08.09.2025 / Форма справочника Партнеры. Доставка по умолчанию. Доработка.
	//Элементы.смартДоставкаАдмирал.Видимость = Объект.смартПартнерСпособДоставки 
	//	= ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал");
	//Элементы.смартДоставка.Видимость = НЕ Объект.смартПартнерСпособДоставки 
	//	= ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал");	
	
	ЭтоСамовывоз							= Объект.смартПартнерСпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз");
	ЭтоДоКлиента 							= Объект.смартПартнерСпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента");
	ЭтоСиламиПеревозчикаПоАдресу 			= Объект.смартПартнерСпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу");
	ЭтоСиламиПеревозчика 					= Объект.смартПартнерСпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика");
	ЭтоКПолучателюОпределяетСлужбаДоставки 	= Объект.смартПартнерСпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки");
	ЭтосмартСамовывозСоСкладаАдмирал		= Объект.смартПартнерСпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал");
	
	Элементы.смартПартнерАдресДоставки.Видимость     = НЕ ЭтосмартСамовывозСоСкладаАдмирал И НЕ ЭтоСамовывоз;
	Элементы.смартПартнерАдресДоставки.Заголовок	= ?(ЭтоСиламиПеревозчикаПоАдресу ИЛИ ЭтоСиламиПеревозчика, "Адрес доставки до клиента", "Адрес доставки");
	Элементы.смартПартнерАдресДоставки.ПоложениеЗаголовка = ?(ЭтоСиламиПеревозчикаПоАдресу ИЛИ ЭтоСиламиПеревозчика, ПоложениеЗаголовкаЭлементаФормы.Верх,
																ПоложениеЗаголовкаЭлементаФормы.Авто);

	Элементы.смартПартнерПеревозчикПартнер.Видимость = ЭтоСиламиПеревозчикаПоАдресу ИЛИ ЭтоСиламиПеревозчика; 
	
	Элементы.смартДоставка.Видимость	= ЭтоДоКлиента;
	Элементы.смартГруппаСиламиПеревозчикаПоАдресу.Видимость = ЭтоСиламиПеревозчикаПоАдресу;
	Элементы.смартГруппаСиламиПеревозчика.Видимость = ЭтоСиламиПеревозчика;
    Элементы.смартДоставкаАдмирал.Видимость = ЭтосмартСамовывозСоСкладаАдмирал;
	Элементы.смартГруппаДополнительныеРеквизитыДоставки.Видимость = НЕ ЭтосмартСамовывозСоСкладаАдмирал;
	
	//-- #4286 смарт: Тимофеева 08.09.2025

КонецПроцедуры //-- #Б-3552 смарт: Фролов 26.06.2025	

//++ #4286 смарт: Тимофеева 08.09.2025 / Форма справочника Партнеры. Доставка по умолчанию. Доработка.
&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект[Элемент.Имя] = ВыбранноеЗначение.Представление;
	Иначе
		Объект[Элемент.Имя] = ВыбранноеЗначение;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры  

Функция ПолучитьМассивПеревозчиков()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 5
	|	Т.Перевозчик КАК Перевозчик,
	|	МАКСИМУМ(Т.Дата) КАК РаспоряжениеДата
	|ИЗ
	|	РегистрСведений.СостоянияИРеквизитыДоставки КАК Т
	|ГДЕ
	|	Т.Перевозчик <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Перевозчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Т.Дата) УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Перевозчик");	
КонецФункции

//-- #4286 смарт: Тимофеева 08.09.2025

&НаКлиенте
//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
Процедура смартОповеститьОбИнциденте(Команда)

	смартОповеститьОбИнцидентеНаСервере();

КонецПроцедуры //-- #Б-5762 смарт: Фролов 18.02.2026

&НаСервере 
//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
Процедура смартОповеститьОбИнцидентеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.смартИнцидентКтоБудетОповещен) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено поле Кто будет оповещен!");
		Возврат;	
		
	КонецЕсли;
	
	Если СокрЛП(ЭтаФорма.смартИнцидентУточнение) = "" Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено уточнение!");
		Возврат;	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартИнцидент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартИнцидент КАК смартИнцидент
	|ГДЕ
	|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
	|	И НЕ смартИнцидент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВидыИнцидентов.Ссылка КАК Ссылка,
	|	смартВидыИнцидентов.Наименование КАК Наименование,
	|	смартВидыИнцидентов.Код КАК Код
	|ИЗ
	|	Справочник.смартВидыИнцидентов КАК смартВидыИнцидентов
	|ГДЕ
	|	смартВидыИнцидентов.Использовать
	|	И смартВидыИнцидентов.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИнцидентов.ДляПартнеров))
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартВидыИнцидентов.Порядок");
	Запрос.УстановитьПараметр("ОбъектИнцидента", Объект.Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если МассивРезультатов[0].Пустой() Тогда
		
		ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаОбъект.Дата = ТекущаяДата();
		ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		ЗадачаОбъект.Исполнитель = ЭтаФорма.смартИнцидентКтоБудетОповещен;
		ЗадачаОбъект.Предмет = Объект.Ссылка;
		ЗадачаОбъект.ПредметСтрокой = Строка(Объект.Ссылка);
		ЗадачаОбъект.CRM_Личная = Истина;
		ЗадачаОбъект.CRM_Партнер = Объект.Ссылка;
		ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
		ЗадачаОбъект.ДатаНачала = ТекущаяДата() + 300;
		ЗадачаОбъект.ПринятаКИсполнению = Истина;
		ЗадачаОбъект.СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
 		ЗадачаОбъект.СрокИсполнения = смартОбщегоНазначения.ПолучитьРабочуюДатуОтносительноИсходной(ТекущаяДата(), 1, "Вперед");
		
		ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.РазобратьсяСИнцидентом;
		
		ЗадачаОбъект.Описание = ЭтаФорма.смартИнцидентУточнение;
		ЗадачаОбъект.Наименование = "Необходимо разобраться с инцидентом";
		ЗадачаОбъект.Записать();
		
		ДокументИнцидент = Документы.смартИнцидент.СоздатьДокумент();
		ДокументИнцидент.ОбъектИнцидента = Объект.Ссылка;
		ДокументИнцидент.Задача = ЗадачаОбъект.Ссылка;
		ДокументИнцидент.Ответственный = Пользователи.ТекущийПользователь();
		ДокументИнцидент.Описание = ЭтаФорма.смартИнцидентУточнение;
		ДокументИнцидент.Адресат = ЭтаФорма.смартИнцидентКтоБудетОповещен;
		ДокументИнцидент.Дата = ТекущаяДата();
		
		ТекстПисьма = "Партнер: " + Объект.Наименование + Символы.ПС + Символы.ПС;
		ТекстПисьма = ТекстПисьма + ЭтаФорма.смартИнцидентУточнение + Символы.ПС + Символы.ПС;
		
		Выборка = МассивРезультатов[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидИнцидента = Элементы.Найти("смартВидИнцидента" + Выборка.Код);
			
			Если НЕ ВидИнцидента = Неопределено Тогда
				
				Если ЭтаФорма["смартВидИнцидента" + Выборка.Код] Тогда
					
					СтрВидыИнцидентов = ДокументИнцидент.ВидыИнцидентов.Добавить();
					СтрВидыИнцидентов.ВидИнцидента = Выборка.Ссылка;
					
					ТекстПисьма = ТекстПисьма + Выборка.Наименование + Символы.ПС;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ДокументИнцидент.Записать(РежимЗаписиДокумента.Запись);
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
		
		ТестовыеАдресаСтрока = "";
		ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(ЭтаФорма.смартИнцидентКтоБудетОповещен, АдресаДляОтправкиСтрокой);
		
		//++ #Б-6630 смарт: Фролов 13.05.2026 //Сделать механизм оповещений о новых Инцидентах.
		МассивПользователей = смартОбщегоНазначения.ПолучитьПользователейПоНастройкамОбОповещениях("Инциденты", "Все подразделения", Неопределено);
		
		Если НЕ МассивПользователей = Неопределено Тогда
			
			Для Каждого Пользователь Из МассивПользователей Цикл
				
				МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", Пользователь.смартРабочаяПочта, Пользователь.смартРабочаяПочта));
				АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Пользователь.смартРабочаяПочта;
				
			КонецЦикла;
		
		КонецЕсли;
		//-- #Б-6630 смарт: Фролов 13.05.2026

		НавСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка);
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Ссылка на объект инцидента: " + НавСсылка;
		
		ТемаПисьма = "Новый инцидент, требует вашего внимания!";
		
		Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			ДанныеОтправки = Новый Структура("Тема, Заголовок", ТемаПисьма, ТекстПисьма);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Исключение
				ТекстСообщения = "Не удалось отправить письмо ответственному " + ЭтаФорма.смартИнцидентКтоБудетОповещен 
					+ " по инциденту " + ДокументИнцидент.Ссылка + Символы.ПС + ОписаниеОшибки(); 
				ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
		
		Элементы.смартГруппаОповеститьОбИнцидентеВертикальная.ТолькоПросмотр = Истина;
		Элементы.смартКнопкаОповеститьОбИнциденте.Доступность = Ложь;
	
	КонецЕсли;

КонецПроцедуры //-- #Б-5762 смарт: Фролов 18.02.2026

&НаКлиенте
//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
Процедура смартОтреагироватьНаИнцидент(Команда)

	смартОтреагироватьНаИнцидентНаСервере();		
	
КонецПроцедуры //-- #Б-5762 смарт: Фролов 18.02.2026

&НаСервере
//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
Процедура смартОтреагироватьНаИнцидентНаСервере()
	
	Если СокрЛП(ЭтаФорма.смартИнцидентПринятоеРешение) = "" Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено Принятое решение!");
		Возврат;	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартИнцидент.Ссылка КАК Ссылка,
	|	смартИнцидент.Задача КАК Задача
	|ИЗ
	|	Документ.смартИнцидент КАК смартИнцидент
	|ГДЕ
	|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
	|	И НЕ смартИнцидент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВидыРеакцийНаИнцидент.Ссылка КАК Ссылка,
	|	смартВидыРеакцийНаИнцидент.Наименование КАК Наименование,
	|	смартВидыРеакцийНаИнцидент.Код КАК Код
	|ИЗ
	|	Справочник.смартВидыРеакцийНаИнцидент КАК смартВидыРеакцийНаИнцидент
	|ГДЕ
	|	смартВидыРеакцийНаИнцидент.Использовать
	|	И смартВидыРеакцийНаИнцидент.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыРеакцийНаИнцидент.ДляПартнеров))
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартВидыРеакцийНаИнцидент.Порядок");
	Запрос.УстановитьПараметр("ОбъектИнцидента", Объект.Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент = МассивРезультатов[0].Выбрать();
	
	Если ВыборкаДокумент.Следующий() Тогда
	
		ДокументИнцидент = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокументИнцидент.Решение = ЭтаФорма.смартИнцидентПринятоеРешение;
		//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
		//ДокументИнцидент.Оценка = ЭтаФорма.смартИнцидентОценкаРаботыОКК;
		//ДокументИнцидент.КомментарийКОценке = ЭтаФорма.смартИнцидентКомментарийКОценке;
		//-- #Б-5928 смарт: Фролов 05.03.2026
		ДокументИнцидент.ДатаРеакции = ТекущаяДата();
		ДокументИнцидент.ЕстьРеакция = Истина;
		ДокументИнцидент.КтоОтреагировал = Пользователи.ТекущийПользователь(); 
		
		ТекстПисьма = "Партнер: " + Объект.Наименование + Символы.ПС + Символы.ПС;
		ТекстПисьма = ТекстПисьма + ЭтаФорма.смартИнцидентПринятоеРешение + Символы.ПС + Символы.ПС;
		
		Выборка = МассивРезультатов[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидИнцидента = Элементы.Найти("смартВидРеакции" + Выборка.Код);
			
			Если НЕ ВидИнцидента = Неопределено Тогда
				
				Если ЭтаФорма["смартВидРеакции" + Выборка.Код] Тогда
					
					СтрВидыРеакцииНаИнцидент = ДокументИнцидент.ВидыРеакцииНаИнцидент.Добавить();
					СтрВидыРеакцииНаИнцидент.ВидРеакцииНаИнцидент = Выборка.Ссылка;	
					
					ТекстПисьма = ТекстПисьма + Выборка.Наименование + Символы.ПС;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ДокументИнцидент.Записать(РежимЗаписиДокумента.Запись);
		
		//++ #Б-7740 смарт: Фролов 05.08.2026 //Задачи от ком отдела от 04.08
		//ОбъектЗадача = ВыборкаДокумент.Задача.ПолучитьОбъект();
		//ОбъектЗадача.Выполнена = Истина;
		//ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
		//ОбъектЗадача.РезультатВыполнения = ЭтаФорма.смартИнцидентПринятоеРешение;
		//ОбъектЗадача.Записать();
		//-- #Б-7740 смарт: Фролов 05.08.2026
		
		ЭтаФорма.смартИнцидентДатаРеакции = ТекущаяДата();
		ЭтаФорма.смартИнцидентКтоОтреагировал = Пользователи.ТекущийПользователь();
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
		
		ТестовыеАдресаСтрока = "";
		ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(ЭтаФорма.смартИнцидентКтоОповестил, АдресаДляОтправкиСтрокой);

		НавСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка); 
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Автор " + Пользователи.ТекущийПользователь() + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Оценка работы " 
			+ Лев(ЭтаФорма.смартИнцидентОценкаРаботыОКК, СтрНайти(Строка(ЭтаФорма.смартИнцидентОценкаРаботыОКК), " ") - 1) + Символы.ПС;
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Ссылка на объект инцидента: " + НавСсылка;
		
		ТемаПисьма = "Реакция на инцидент";
		
		Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			ДанныеОтправки = Новый Структура("Тема, Заголовок", ТемаПисьма, ТекстПисьма);
			ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Исключение
				ТекстСообщения = "Не удалось отправить письмо ответственному " + ЭтаФорма.смартИнцидентКтоОповестил 
					+ " по инциденту " + ДокументИнцидент.Ссылка + Символы.ПС + ОписаниеОшибки(); 
				ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
		
		Элементы.смартГруппаРеакцияНаИнцидентВертикальная.ТолькоПросмотр = Истина;
		Элементы.смартКнопкаОтреагироватьНаИнцидент.Доступность = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-5762 смарт: Фролов 18.02.2026

&НаКлиенте
//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
Процедура смартЗаписатьИтоговыйРезультат(Команда)

	смартЗаписатьИтоговыйРезультатНаСервере();
	
КонецПроцедуры //-- #Б-5928 смарт: Фролов 05.03.2026

&НаСервере
//++ #Б-5928 смарт: Фролов 05.03.2026 //Доработка механизма Инциденты.
Процедура смартЗаписатьИтоговыйРезультатНаСервере()

	УстановитьПривилегированныйРежим(Истина); 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартИнцидент.Ссылка КАК Ссылка,
	|	смартИнцидент.Задача КАК Задача
	|ИЗ
	|	Документ.смартИнцидент КАК смартИнцидент
	|ГДЕ
	|	смартИнцидент.ОбъектИнцидента = &ОбъектИнцидента
	|	И НЕ смартИнцидент.ПометкаУдаления
	//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартВидыИтоговыхРезультатовИнцидентов.Ссылка КАК Ссылка,
	|	смартВидыИтоговыхРезультатовИнцидентов.Наименование КАК Наименование,
	|	смартВидыИтоговыхРезультатовИнцидентов.Код КАК Код
	|ИЗ
	|	Справочник.смартВидыИтоговыхРезультатовИнцидентов КАК смартВидыИтоговыхРезультатовИнцидентов
	|ГДЕ
	|	смартВидыИтоговыхРезультатовИнцидентов.Использовать
	|	И смартВидыИтоговыхРезультатовИнцидентов.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.смартВидыИтоговыхРезультатовИнцидентов.ДляПартнеров))
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартВидыИтоговыхРезультатовИнцидентов.Порядок");
	Запрос.УстановитьПараметр("ОбъектИнцидента", Объект.Ссылка);
	
	//ВыборкаДокумент = Запрос.Выполнить().Выбрать();
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент = МассивРезультатов[0].Выбрать();
	//-- #Б-6288 смарт: Фролов 02.04.2026
	
	Если ВыборкаДокумент.Следующий() Тогда
	
		ДокументИнцидент = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокументИнцидент.ИтоговыйРезультат = ЭтаФорма.смартИнцидентИтоговыйРезультат;
		ДокументИнцидент.Оценка = ЭтаФорма.смартИнцидентОценкаРаботыОКК;
		ДокументИнцидент.КомментарийКОценке = ЭтаФорма.смартИнцидентКомментарийКОценке; 
		ДокументИнцидент.ДатаРезультата = ТекущаяДата();
		
		//++ #Б-6288 смарт: Фролов 02.04.2026 //Доработка Инцидентов.
		Выборка = МассивРезультатов[1].Выбрать();
		
		ДокументИнцидент.ВидыРезультатов.Очистить();
		
		Пока Выборка.Следующий() Цикл
			
			ВидРезультата = Элементы.Найти("смартВидРезультата" + Выборка.Код);
			
			Если НЕ ВидРезультата = Неопределено Тогда
				
				Если ЭтаФорма["смартВидРезультата" + Выборка.Код] Тогда
					
					СтрВидыРеакцииНаИнцидент = ДокументИнцидент.ВидыРезультатов.Добавить();
					СтрВидыРеакцииНаИнцидент.ВидРезультата = Выборка.Ссылка;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
		//-- #Б-6288 смарт: Фролов 02.04.2026
		
		ДокументИнцидент.Записать(РежимЗаписиДокумента.Запись);
		
		//++ #Б-7740 смарт: Фролов 05.08.2026 //Задачи от ком отдела от 04.08
		ОбъектЗадача = ВыборкаДокумент.Задача.ПолучитьОбъект();
		ОбъектЗадача.Выполнена = Истина;
		ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
		ОбъектЗадача.РезультатВыполнения = ЭтаФорма.смартИнцидентПринятоеРешение;
		ОбъектЗадача.Записать();
		//-- #Б-7740 смарт: Фролов 05.08.2026
		
		ЭтаФорма.смартИнцидентДатаРезультата = ТекущаяДата();
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-5928 смарт: Фролов 05.03.2026

&НаКлиенте
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Процедура смартТаблицаDEERAYПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	смартОчиститьТабличныйДокументРасщифровкаРазговора();
	ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = Неопределено;
	Элементы.смартПрослушатьРазговорDEERAY.Заголовок = "Прослушать разговор";
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		смартидентификаторDeeray = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Элемент.ТекущиеДанные.смартЗвонкиDEERAYСсылка, "смартидентификаторDeeray");
			ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = Элемент.ТекущиеДанные.смартЗвонкиDEERAYСсылка;
		
		смартВывестиДанныеРасшифровкиРазговора(смартидентификаторDeeray);
		
		ТекстРезюме = Элемент.ТекущиеДанные.смартРезюмеDEERAY;
		ТекстРезюме = СтрЗаменить(ТекстРезюме, """", "");
		ТекстРезюме = СтрЗаменить(ТекстРезюме, Символы.ПС, "<br>");
		ТекстРезюме = СтрЗаменить(ТекстРезюме, "¶", "<br>");
		
		смартРезюмеHTMLDEERAY = СтрЗаменить(СтрЗаменить(ЭтаФорма.смартРезюмеHTMLПредварительныйDEERAY, "ТекстРезюмеHTMLDEERAY", ТекстРезюме), "|", "");
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-6082 смарт: Фролов 16.03.2026

&НаКлиенте
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Процедура смартТаблицаДанныеСценариевDEERAYПриАктивизацииПоля(Элемент)
	
	ИмяКолонки = Элемент.ТекущийЭлемент.Имя;
	ИдентификаторКолонки = СтрЗаменить(ИмяКолонки, "Звонок_", "");
	
	смартРезюмеHTMLDEERAY = СтрЗаменить(СтрЗаменить(ЭтаФорма.смартРезюмеHTMLПредварительныйDEERAY, "ТекстРезюмеHTMLDEERAY", ""), "|", "");
	смартОчиститьТабличныйДокументРасщифровкаРазговора();
	ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = Неопределено;
	Элементы.смартПрослушатьРазговорDEERAY.Заголовок = "Прослушать разговор";
	
	Если НЕ ИмяКолонки = ИдентификаторКолонки Тогда
		
		СтрокисмартИдентификаторыЗвонковDEERAY = ЭтаФорма.смартИдентификаторыЗвонковDEERAY.НайтиСтроки(Новый Структура("смартСценарииDEERAYИдентификатор", ИдентификаторКолонки));
		
		Если СтрокисмартИдентификаторыЗвонковDEERAY.Количество() > 0 Тогда
			
			СтрокисмартДанныеСценариевDEERAYДляОбработки = ЭтаФорма.смартДанныеСценариевDEERAYДляОбработки.НайтиСтроки(Новый Структура("смартДанныеСценариевDEERAYДляОбработкиТелефонныйЗвонок", 
				СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок));
				
			ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок = СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок;
			
			смартидентификаторDeeray = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СтрокисмартИдентификаторыЗвонковDEERAY[0].смартСценарииDEERAYЗвонок, "смартидентификаторDeeray"); 
			
			смартВывестиДанныеРасшифровкиРазговора(смартидентификаторDeeray);
						
			Если СтрокисмартДанныеСценариевDEERAYДляОбработки.Количество() > 0 Тогда
				
				ТекстРезюме = СтрокисмартДанныеСценариевDEERAYДляОбработки[0].смартДанныеСценариевDEERAYДляОбработкиРезюме;
				ТекстРезюме = СтрЗаменить(ТекстРезюме, """", "");
				ТекстРезюме = СтрЗаменить(ТекстРезюме, Символы.ПС, "<br>");
				ТекстРезюме = СтрЗаменить(ТекстРезюме, "¶", "<br>");
				
				смартРезюмеHTMLDEERAY = СтрЗаменить(СтрЗаменить(ЭтаФорма.смартРезюмеHTMLПредварительныйDEERAY, "ТекстРезюмеHTMLDEERAY", ТекстРезюме), "|", "");
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-6082 смарт: Фролов 16.03.2026

&НаСервере
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Процедура смартВывестиДанныеРасшифровкиРазговора(смартидентификаторDeeray)
	
	ИмяФайла = "" + Справочники.смартПредопределенныеЗначения.Настройки.РасположениеПапкиФайловDEERAY + смартидентификаторDeeray + ".json";
	
	Данные = смартИнтеграцияDeeray.ПолучитьДанныеJSON(ИмяФайла);
	
	Если НЕ Данные = Неопределено Тогда
		
		смартВывестиТабличныйДокументРасщифровкаРазговора(Данные);
		
	КонецЕсли;
			
КонецПроцедуры //-- #Б-6082 смарт: Фролов 16.03.2026			

&НаСервере 
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Процедура смартОчиститьТабличныйДокументРасщифровкаРазговора()
	
	ЭтаФорма.смартРасшифровкаРазговораDEERAY.Очистить();	
	
КонецПроцедуры //-- #Б-6082 смарт: Фролов 16.03.2026	

&НаСервере 
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Процедура смартВывестиТабличныйДокументРасщифровкаРазговора(Данные)
	
	ТабДок = ЭтаФорма.смартРасшифровкаРазговораDEERAY;
	
	ТабДок.Очистить();
	
	Макет = Документы.CRM_Интерес.ПолучитьМакет("смартРасшифровкаРазговора");
		
	Если НЕ Данные = Неопределено Тогда
		
		РазделДанные = Данные.Получить("data")[0];
		
		Сообщения = РазделДанные.Получить("messages");
		
		ПредыдущийАвтор = "";
		
		Для Каждого СтрСообщения Из Сообщения Цикл
			
			АвторСообщения = СтрСообщения.Получить("author");
			АвторСообщенияИмя = АвторСообщения.Получить("name");
			МассивСообщений = СтрСообщения.Получить("sentences");
			УчастникЗвонка = СтрСообщения.Получить("originator");
			
			Если УчастникЗвонка = "customer" Тогда
				ОбластьНиз = Макет.ПолучитьОбласть("НизОператор");
			Иначе
				ОбластьНиз = Макет.ПолучитьОбласть("НизКлиент");
			КонецЕсли;	
			
			Если НЕ ПредыдущийАвтор = АвторСообщенияИмя Тогда
				
				Если НЕ ПредыдущийАвтор = "" Тогда
					ТабДок.Вывести(ОбластьНиз);
				КонецЕсли;	
				
				ОбластьРазделитель = Макет.ПолучитьОбласть("РазделительБлоков");
				ТабДок.Вывести(ОбластьРазделитель);
				
			КонецЕсли;
			
			Если УчастникЗвонка = "customer" Тогда
				
				ОбластьШапка = Макет.ПолучитьОбласть("ШапкаКлиент");
				ОбластьШапка.Параметры.Клиент = АвторСообщенияИмя;
				Если НЕ ПредыдущийАвтор = АвторСообщенияИмя Тогда
					ТабДок.Вывести(ОбластьШапка);
				КонецЕсли;	
				ОбластьСтрока = Макет.ПолучитьОбласть("ТекстКлиент");
	
			Иначе
				
				ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОператор");
				ОбластьШапка.Параметры.Оператор = АвторСообщенияИмя;
				Если НЕ ПредыдущийАвтор = АвторСообщенияИмя Тогда
					ТабДок.Вывести(ОбластьШапка);
				КонецЕсли;	
				ОбластьСтрока = Макет.ПолучитьОбласть("ТекстОператор");
				
			КонецЕсли;	
				
			ДанныеВремени = СтрСообщения.Получить("time");
			Начало = ДанныеВремени.Получить("from");
			
			Если НЕ МассивСообщений = Неопределено Тогда
				
				Для Каждого СтрМассивСообщений Из МассивСообщений Цикл
					
					ОбластьСтрока.Параметры.Текст = СтрМассивСообщений.Получить("body"); 
					ОбластьСтрока.Параметры.Начало = Начало;
					
					ТабДок.Вывести(ОбластьСтрока);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ПредыдущийАвтор = АвторСообщенияИмя;
			
		КонецЦикла;	
		
	КонецЕсли;

	Если УчастникЗвонка = "customer" Тогда
		ОбластьНиз = Макет.ПолучитьОбласть("НизКлиент");
	Иначе
		ОбластьНиз = Макет.ПолучитьОбласть("НизОператор");
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьНиз);
	
КонецПроцедуры //-- #Б-6082 смарт: Фролов 16.03.2026

&НаКлиенте
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Процедура смартПрослушатьРазговорНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок) Тогда
	
		ДанныеЗвонка = смартПолучитьДанныеДляЗвонка(ЭтаФорма.смартВыбранныйДляПрослушиванияЗвонок);
		
		Если НЕ ДанныеЗвонка = Неопределено Тогда
			
			ПараметрыЗвонка = Новый Структура("ИдентификаторЗвонка, ИдентификаторЗаписи, Ответственный, Входящий, НомерТелефона, ВнутреннийНомер, ДатаНачала, ДатаОкончания, Звонок",
				ДанныеЗвонка.сфпИдентификаторЗвонка, ДанныеЗвонка.сфпИдентификаторЗаписи, ДанныеЗвонка.Ответственный, 
				ДанныеЗвонка.Входящий, ДанныеЗвонка.АбонентКакСвязаться, ДанныеЗвонка.сфпВнутреннийНомер, ДанныеЗвонка.сфпДатаНачала, 
				ДанныеЗвонка.сфпДатаОкончания, ДанныеЗвонка.Ссылка);
			
			сфпСофтФонПроКлиент.НачатьПрослушиваниеЗаписиРазговора(ПараметрыЗвонка, ЭтаФорма, Элементы.смартПрослушатьРазговорDEERAY);
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры //-- #Б-6082 смарт: Фролов 16.03.2026

&НаСервере
//++ #Б-6082 смарт: Фролов 16.03.2026 //Добавить раздел DEERAY в партнеры.
Функция смартПолучитьДанныеДляЗвонка(ОбъектЗвонка)
	
	Если НЕ ОбъектЗвонка.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	сфпИсторияЗвонков.ВнутреннийНомер КАК ВнутреннийНомер,
		|	сфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
		|	сфпИсторияЗвонков.ДатаОтвета КАК ДатаОтвета,
		|	сфпИсторияЗвонков.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.сфпИсторияЗвонков КАК сфпИсторияЗвонков
		|ГДЕ
		|	сфпИсторияЗвонков.Звонок = &Звонок
		|	И сфпИсторияЗвонков.ИдентификаторЗвонка = &ИдентификаторЗвонка");
		Запрос.УстановитьПараметр("Звонок", ОбъектЗвонка.Ссылка);
		Запрос.УстановитьПараметр("ИдентификаторЗвонка", ОбъектЗвонка.сфпИдентификаторЗвонка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда   			
			
			СтруктураНужныхДанных = Новый Структура();
			СтруктураНужныхДанных.Вставить("сфпВнутреннийНомер", Выборка.ВнутреннийНомер); 
			СтруктураНужныхДанных.Вставить("сфпДатаНачала", Выборка.ДатаНачала); 
			СтруктураНужныхДанных.Вставить("сфпДатаОтвета", Выборка.ДатаОтвета); 
			СтруктураНужныхДанных.Вставить("сфпДатаОкончания", Выборка.ДатаОкончания); 
			СтруктураНужныхДанных.Вставить("сфпИдентификаторЗвонка", ОбъектЗвонка.сфпИдентификаторЗвонка);
			СтруктураНужныхДанных.Вставить("сфпИдентификаторЗаписи", ОбъектЗвонка.сфпИдентификаторЗаписи);
			СтруктураНужныхДанных.Вставить("Ответственный", ОбъектЗвонка.Ответственный);
			СтруктураНужныхДанных.Вставить("Входящий", ОбъектЗвонка.Входящий);
			СтруктураНужныхДанных.Вставить("АбонентКакСвязаться", ОбъектЗвонка.АбонентКакСвязаться);
			СтруктураНужныхДанных.Вставить("Ссылка", ОбъектЗвонка.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураНужныхДанных;
	
КонецФункции //-- #Б-6082 смарт: Фролов 16.03.2026

//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
&НаСервере
Функция ПолучитьТекстИнформацииОКонтролеТехническойОтсрочки()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.смартНеКонтролироватьТехническуюОтсрочку) Тогда
		Возврат "Нет информации";
	Иначе
		
		ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Объект.Ссылка, Объект.смартИДНеКонтролироватьТехническуюОтсрочку, "НеКонтролироватьТехническуюОтсрочку");
		
		Если ДанныеОРазрешении <> Неопределено Тогда
			Возврат СтрШаблон("%1 пользователем %2 %3", ?(ДанныеОРазрешении.Разрешено, "Установлено", "Снято"), ДанныеОРазрешении.Ответственный, ДанныеОРазрешении.ДатаИзменения);
		КонецЕсли;
		
		Возврат "Нет информации";
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура смартОткрытьСтопЛистТехническойОтсрочки(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Партнер", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.смартСтопЛистТехническойОтсрочки.Форма.ФормаСтопЛист", 
				ПараметрыОткрытияФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаСервере
Процедура смартОбновитьСостояниеСтопЛистаТехническойОтсрочки()
	
	Если НЕ Элементы.Найти("ГруппаСтопЛистТехническойОтсрочки") = Неопределено Тогда
		Если Объект.Клиент Тогда 
			Элементы.ГруппаСтопЛистТехническойОтсрочки.Видимость = Истина;
			ОтгрузкаЗапрещена = РегистрыСведений.смартСтопЛистТехническойОтсрочки.КлиентуЗапрещенаТехническаяОтсрочка(Объект.Ссылка);
			Элементы.смартОткрытьСтопЛистТехническойОтсрочки.Видимость = ОтгрузкаЗапрещена;
			Элементы.смартОткрытьСтопЛистТехническойОтсрочки1.Видимость = НЕ ОтгрузкаЗапрещена;
		Иначе
			Элементы.ГруппаСтопЛистТехническойОтсрочки.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура смартОбновитьСостояниеБлокировокПоДоговорам()
	
	Если НЕ Элементы.Найти("ГруппаБлокировкиПоДоговорам") = Неопределено Тогда
		Элементы.ГруппаБлокировкиПоДоговорам.Видимость = Объект.Клиент
														И смартКонтрольДебиторскойЗадолженности.ЕстьАктивныеБлокировкиПоДоговорамПартнера(Объект.Ссылка);
	КонецЕсли;   
	
КонецПроцедуры
//-- #4792 смарт: Тимофеева 17.03.26

&НаКлиенте
//++ #Б-6636 смарт: Фролов 22.04.2026 //В спр.Партнеры реализовать возможность отражения посещения наших мероприятий/выставок.
Процедура смартТаблицаМероприятийПриИзменении(Элемент)
	
	Элементы.смартГруппаМероприятий.Заголовок = "Участие в наших мероприятиях (" + Объект.смартТаблицаМероприятий.Количество() + ")";
	
КонецПроцедуры //-- #Б-6636 смарт: Фролов 23.04.2026

#КонецОбласти

