
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	// мПланы = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.
	ПрефиксИБ									= ОбменДаннымиСервер.ПрефиксИнформационнойБазы(); 
	ПланыОбменаБСП = ОбменДаннымиПовтИсп.ПланыОбменаБСП();
	
	// +CRM
	CRM_СинхронизацияСiCRMНовый.УдалитьИзСпискаПлановОбмена(ПланыОбменаБСП); 
	// -CRM
	
	ПриложенияДоОбновления = СписокУзловОбмена.Выгрузить(, "УзелИнформационнойБазы").ВыгрузитьКолонку("УзелИнформационнойБазы");
	ТаблицаМонитора = ОбменДаннымиСервер.ТаблицаМонитораОбменаДанными(ПланыОбменаБСП);
	ПриложенияПослеОбновления = ТаблицаМонитора.ВыгрузитьКолонку("УзелИнформационнойБазы");
  	
	СписокУзловОбмена.Загрузить(ТаблицаМонитора);
	
	Для Каждого СтрокаПриложение Из СписокУзловОбмена Цикл
		
		УстановитьПривилегированныйРежим(Истина);
		СтрокаПриложение.НаименованиеКорреспондента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СтрокаПриложение.УзелИнформационнойБазы, "Наименование");
		УстановитьПривилегированныйРежим(Ложь);
				
	КонецЦикла;	
		
	Если Параметры.Свойство("СтруктураНоменклатурыМассив") и Параметры.СтруктураНоменклатурыМассив.Свойство("МассивНоменклатуры") Тогда
		
		Для Каждого  СтрокаНоменклатура из Параметры.СтруктураНоменклатурыМассив.МассивНоменклатуры Цикл
			
			СтрСписок =	СписокНоменклатуры.Добавить();
			СтрСписок.Номенклатура = СтрокаНоменклатура;
			СтрСписок.ВыборОбмен = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеУзлыНаСервере(мЗначениеФлага)
	
	Для Каждого СтрокаПриложение Из СписокУзловОбмена Цикл
		
		СтрокаПриложение.ВыборОбмен = мЗначениеФлага;
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеУзлы(Команда)
	ВыбратьВсеУзлыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеУзлы(Команда)
	
	ВыбратьВсеУзлыНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсюНоменклатуруНаСервере(мЗначениеФлага)
	
	Для Каждого СтрокаНоменклатура Из СписокНоменклатуры Цикл
		
		СтрокаНоменклатура.ВыборОбмен = мЗначениеФлага;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсюНоменклатуру(Команда)
	ВыбратьВсюНоменклатуруНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсюНоменклатуру(Команда)
	ВыбратьВсюНоменклатуруНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуРегистрации()
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоОтобранныхУзлов()
	
	мОтбор = Новый Структура;
	мОтбор.Вставить("ВыборОбмен",Истина);
	
	СтрокиУзлыВЫбранные = СписокУзловОбмена.НайтиСтроки(мОтбор);
	
	Возврат СтрокиУзлыВЫбранные.Количество();
	
КонецФункции	

&НаСервере
Функция ПолучитьКоличествоОтобраннойНоменклатуры()
	
	мОтбор = Новый Структура;
	мОтбор.Вставить("ВыборОбмен",Истина);
	
	СтрокиНоменклатураВЫбранные = СписокНоменклатуры.НайтиСтроки(мОтбор);
	
	Возврат СтрокиНоменклатураВЫбранные.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьОтобранныеУзлыОбмена()
	
	мОтбор = Новый Структура;
	мОтбор.Вставить("ВыборОбмен",Истина);
	
	СтрокиУзлыВЫбранные = СписокУзловОбмена.НайтиСтроки(мОтбор);
	
	Возврат СтрокиУзлыВЫбранные;
	
КонецФункции	

&НаСервере
Функция ПолучитьОтобраннуюНоменклатуру()
	
	мОтбор = Новый Структура;
	мОтбор.Вставить("ВыборОбмен",Истина);
	
	СтрокиНоменклатураВЫбранные = СписокНоменклатуры.НайтиСтроки(мОтбор);
	
	Возврат СтрокиНоменклатураВЫбранные;
	
КонецФункции


&НаКлиенте
Процедура Зарегистрировать(Команда)
		
	МассивСтрокУзлов = ПолучитьКоличествоОтобранныхУзлов();

	Если МассивСтрокУзлов = 0 Тогда
		
		ПоказатьПредупреждение(, "Не выбрано ни одного узла обмена для регистрации!",, "Ошибка");
		Возврат;		
		
	КонецЕсли;
	
	МассивСтрокНоменклатуры = ПолучитьКоличествоОтобраннойНоменклатуры();
	
	Если МассивСтрокНоменклатуры = 0 Тогда
		
		ПоказатьПредупреждение(, "Не выбрано ни одной номенклатуры для обмена!",, "Ошибка");
		Возврат;	
		
	КонецЕсли;
		
	ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ЗарегистрироватьКОбменуЗавершение", ЭтаФорма), "Продолжить?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗарегистрироватьКОбменуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		смарт_ЗарегистрироватьНаУзлахОбмена();
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура смарт_ЗарегистрироватьНаУзлахОбменаНаСервере()
	
	МассивСтрокУзлов = ПолучитьОтобранныеУзлыОбмена();
    МассивСтрокНоменклатуры = ПолучитьОтобраннуюНоменклатуру();
		
	Для Каждого СтрокаУзла из МассивСтрокУзлов Цикл
		
		Для Каждого СтрокаНоменклатура из МассивСтрокНоменклатуры Цикл			
			
			ОбменДаннымиСобытия.ЗарегистрироватьИзмененияДанных(СтрокаУзла.УзелИнформационнойБазы,СтрокаНоменклатура.Номенклатура,Истина);
					
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура смарт_ЗарегистрироватьНаУзлахОбмена() 
	
	 смарт_ЗарегистрироватьНаУзлахОбменаНаСервере();
	 
	 Сообщить("Обработка по регистрации номенклатуры выполнена");
	  
	 ЗакрытьФормуРегистрации();
	 
КонецПроцедуры  

&НаКлиенте
Процедура Отмена(Команда)
   ЗакрытьФормуРегистрации();
КонецПроцедуры

