
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
//++ #1836 смарт: Фролов 30.05.2024 //Доработка механизма Неудачного Завершения интереса.
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ПричинаОтказаУстановить.УстановитьДействие("ПриИзменении", "смартПричинаОтказаУстановитьПриИзменении");   
	
	//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО       
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("смартСценарий", Новый ОписаниеТипов("СправочникСсылка.CRM_СостоянияИнтересов")));
	ИзменитьРеквизиты(МассивРеквизитов);  
	
	ЭтотОбъект.смартСценарий = СостояниеИнтересаУстановить.Родитель;

	Элементы.ПричинаОтказаУстановить.УстановитьДействие("НачалоВыбора", "смартПричинаОтказаУстановитьНачалоВыбора");   
	Элементы.ПричинаОтказаУстановить.УстановитьДействие("АвтоПодбор", "смартПричинаОтказаУстановитьАвтоПодбор");   
	//-- #Б-1136 смарт: Мосолов 15.10.2024 
	
КонецПроцедуры //-- #1836 смарт: Фролов 30.05.2024

#КонецОбласти

#Область ДоработкиСмарт

&НаКлиенте
//++ #1836 смарт: Фролов 30.05.2024 //Доработка механизма Неудачного Завершения интереса.
Процедура смартПричинаОтказаУстановитьПриИзменении(Элемент)
	
	Если ПричинаОтказаУстановить = смартСервер.ПолучитьсмартПредопределенноеЗначение("ПричинаЗавершенияОтпалаПотребность") Тогда
		Проверка = смартСервер.ПроверитьБылЛиИнтересКвалифицирован(Интерес);
		Если НЕ Проверка Тогда
			ПричинаОтказаУстановить = Неопределено;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя выбирать причину ""Отпала потребность"" при неудачном завершении Интереса не прошедшего квалификацию! Выберите другую причину!");
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры //-- #1836 смарт: Фролов 30.05.2024

#КонецОбласти  

//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
&НаКлиенте
Процедура смартПричинаОтказаУстановитьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ПараметрыФормыВыбора = Новый Структура("Сценарий, ТипОбращения", ЭтотОбъект.смартСценарий, ИнтересОбъект.ТипОбращения); 
	
	Обработчик = Новый ОписаниеОповещения("смартПричинаОтказаУстановитьЗавершениеВыбора", ЭтотОбъект);    
	
	ОткрытьФорму("Справочник.CRM_ПричиныОтказаПоИнтересам.ФормаВыбора", ПараметрыФормыВыбора, ЭтотОбъект, , , , Обработчик);
		
КонецПроцедуры //-- #Б-1136 смарт: Мосолов 15.10.2024

//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
&НаКлиенте
Процедура смартПричинаОтказаУстановитьЗавершениеВыбора(Результат, ПараметрыВыполнения) Экспорт  
	
	Если Результат <> Неопределено Тогда
		ПричинаОтказаУстановить = Результат;
	КонецЕсли;   
	
КонецПроцедуры //-- #Б-1136 смарт: Мосолов 15.10.2024  

//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
&НаКлиенте
Процедура смартПричинаОтказаУстановитьАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Не Ожидание = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСписка = смартПолучитьКодыЗавершения(); 
	
	Если ТаблицаСписка.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ТаблицаСписка;  
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-1136 смарт: Мосолов 15.10.2024

//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
&НаСервере
Функция смартПолучитьКодыЗавершения()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка КАК Ссылка,
	|	ПричиныЗавершения.Наименование КАК Наименование
	|ПОМЕСТИТЬ ДоступныеПричины
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = &ТипОбращения
	|	И ПричиныЗавершения.Сценарий = &Сценарий
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка,
	|	ПричиныЗавершения.Наименование
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = &ТипОбращения
	|	И ПричиныЗавершения.Сценарий = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка,
	|	ПричиныЗавершения.Наименование
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.ПустаяСсылка)
	|	И ПричиныЗавершения.Сценарий = &Сценарий
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка,
	|	ПричиныЗавершения.Наименование
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.ПустаяСсылка)
	|	И ПричиныЗавершения.Сценарий = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеПричины.Ссылка КАК Ссылка,
	|	ДоступныеПричины.Наименование КАК Наименование
	|ИЗ
	|	ДоступныеПричины КАК ДоступныеПричины
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоступныеПричины.Наименование");
	
	Запрос.Параметры.Вставить("ТипОбращения", ЭтотОбъект.ИнтересОбъект.ТипОбращения);
	Запрос.Параметры.Вставить("Сценарий", ЭтотОбъект.смартСценарий);  
	
	КодыЗавершения = Новый СписокЗначений;   
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат КодыЗавершения;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		КодыЗавершения.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат КодыЗавершения;
	
КонецФункции //-- #Б-1136 смарт: Мосолов 15.10.2024

&НаСервере
&ИзменениеИКонтроль("ПолучитьСрокОповещенияПоВарианту") 
//++ #Б-3744 смарт: Фролов 14.07.2025 //Интервал между взаимодействиями с клиентом по расходным материалам. Изменения в CRM
Процедура смарт_ПолучитьСрокОповещенияПоВарианту(ВариантСрока)

	ТекущаяДатадляСрока = ТекущаяДатаСеанса();

	Если ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.Сейчас Тогда

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.Через15Минут Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 900;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезЧас Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 3600;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.Через4Часа Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 14400;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.Через8Часов Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 28800;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДень Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 86400;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезТриДня Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 259200;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезНеделю Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 604800;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДвеНедели Тогда	

		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 1209600;

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезМесяц Тогда	

		НоваяЗадача.СрокИсполнения	= ДобавитьМесяц(ТекущаяДатадляСрока,1);
		
	#Вставка //++ #Б-3744 смарт: Фролов 14.07.2025 //Интервал между взаимодействиями с клиентом по расходным материалам. Изменения в CRM
	ИначеЕсли ВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.смартЧерез44Дня Тогда
		НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока + 86400 * 44;
	#КонецВставки

	ИначеЕсли ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.ЧерезТриМесяца Тогда	

		НоваяЗадача.СрокИсполнения	= ДобавитьМесяц(ТекущаяДатадляСрока,3);

	Иначе //Если Объект.ВариантСрока=Перечисления.CRM_ВариантыУстановкиДаты.Вручную Тогда	

		Если НоваяЗадача.СрокИсполнения=Дата(1,1,1) Тогда

			НоваяЗадача.СрокИсполнения	= ТекущаяДатадляСрока;	

		КонецЕсли; 

	КонецЕсли;	

КонецПроцедуры //-- #Б-3744 смарт: Фролов 14.07.2025

