
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторСтрокиПолучателя;

&НаКлиенте
Перем ИмяЭлемента;

&НаКлиенте
Перем ПроверкаСуществованияФайлов;

&НаКлиенте
Перем ТекущийНомерВложения;

&НаКлиенте
Перем ПолучаемыеФайлы;

&НаКлиенте
Перем ПолученныеФайлы;

&НаКлиенте
Перем КэшСвойстваДинамическогоСписка;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПринудительнаяАктивизацияСтроки;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	Если НЕ CRM_РежимФормЗакладкиСервер.ВосстановлениеФормыПриЗапускеСеанса(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// -Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	
	Попытка
		Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно открыть Почтовый клиент. Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)';en='Unable to open email client. Subsystem 1C: CRM is not used! (see Personal settings of the user)'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Работа почтового клиента в этом режиме не поддерживается!';en='The operation of the mail customer in this mode is not supported!'"));
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ОграничитьВыводКлиентскойБазы(ЭтотОбъект, "СписокПисем");
	КонецЕсли;
	
	КэшТипыСправочниковПрисоединенныхФайлов = ПолучитьОписаниеТиповПрисоединенныхФайлов();
	
	ЕстьПравоДобавленияУчетныхЗаписей = ПравоДоступа("Добавление", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты);
	
	// Оформление списка
	
	ЗаполнитьСписокУчетныхЗаписей(УчетныеЗаписи);
	ЗаполнитьДеревоУчетныхЗаписей();
	
	Элементы.СписокПисемПоказатьСкрытьПисьмо.Пометка		= ПоказатьСкрытьПисьмоПометка;
	Элементы.Описание.Видимость								= ПоказатьСкрытьПисьмоПометка;
	УстановитьКартинкуЭлементаПоказатьСкрытьПисьмо();
	
	// Восстановление сортировки списка
	// CRM_ОбщегоНазначенияСервер.ВосстановитьСортировкуСписка(СписокПисем, "Обработка.CRM_МенеджерПочты.СписокПисем");
	
	// Показать/Скрыть список учетных записей
	ПоказатьСписокУчетныхЗаписей = ХранилищеОбщихНастроекЗагрузить(ЭтотОбъект.ИмяФормы, "СписокУчетныхЗаписей");
	Если ПоказатьСписокУчетныхЗаписей = Неопределено Тогда
		Элементы.ПанельУправления.Видимость = Истина;
		ХранилищеОбщихНастроекСохранить(ЭтотОбъект.ИмяФормы, "СписокУчетныхЗаписей", Истина);
	Иначе
		Элементы.ПанельУправления.Видимость = ПоказатьСписокУчетныхЗаписей;
	КонецЕсли;
	Если Элементы.ПанельУправления.Видимость Тогда
		Элементы.ПоказатьСкрытьДеревоУчетныхЗаписей.Заголовок = НСтр("ru='Скрыть список учетных записей';en='Hide Account List'");
	Иначе
		Элементы.ПоказатьСкрытьДеревоУчетныхЗаписей.Заголовок = НСтр("ru='Показать список учетных записей';en='Show Account List'");
	КонецЕсли;
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();	
	
	ИспользоватьЗаявки = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьЗаявки") И (Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("CRM_ДобавлениеИзменениеЗаявок"));
	
	Элементы.ПанельУправленияКонтекстноеМенюРедактироватьПапку.Видимость	= ЕстьПравоДобавленияУчетныхЗаписей;
	
	Элементы.ОткрытьНастройкиУчетныхЗаписей.Видимость = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("CRM_ДобавлениеИзменениеБазовойНСИ");
	
	ПолучитьПочтуПриОткрытии = Параметры.Свойство("ПолучитьПочтуПриОткрытии");
	
	
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Константы.ИспользоватьРазделениеПоОбластямДанных.Получить() Тогда	
		Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем);
		Если Задание.Использование Тогда
			ПериодОтправкиПисем = Задание.Расписание.ПериодПовтораВТечениеДня;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаймаутОтметкиОПрочтении = ХранилищеОбщихНастроекЗагрузить("ТаймаутОтметкиОПрочтении", "ТаймаутОтметкиОПрочтении", 5);
	
	// 0 - стандартный, 1 - горизонтальный, 2 - вертикальный
	РежимОтображения = ХранилищеОбщихНастроекЗагрузить("CRM_МенеджерПочты.РежимОтображения", "АРМПочта", 0);
	РасположитьОкнаСогласноРежимуОтображения(Ложь);
	
	CRM_СмещениеДатыТекущегоСеанса = СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
	СписокПисем.Параметры.УстановитьЗначениеПараметра("CRM_СмещениеДатыТекущегоСеанса", CRM_СмещениеДатыТекущегоСеанса);
	
	ВсеВложенияПометка = ХранилищеОбщихНастроекЗагрузить("ПоказыватьВсеВложения", "ПоказыватьВсеВложения", Ложь);
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// -Рабочий стол
	// +Доступные пользователи
	МассивЭлементовОтбора = Новый Массив;
	МассивЭлементовОтбора.Добавить("Ответственный");
	УстановитьОтборВСпискеПоДоступнымпользователям(СписокПисем, МассивЭлементовОтбора,, Истина);
	// -Доступные пользователи
	УстановитьУО();
	
	// Заполняем массив с картинками расширений файлов
	Для ИндексКартинки = 0 По 38 Цикл
		СписокИконокФайлов.Добавить(БиблиотекаКартинок["CRM_ИконкаТипаФайла_"+ИндексКартинки*2]);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	ПринудительнаяАктивизацияСтроки = Ложь;
	
	Если ЗначениеЗаполнено(ВидПапкиВыбранный) Тогда
		Если ВидПапкиВыбранный = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Входящие") Тогда
			НаименованиеПапки = НСтр("ru = 'Входящие'; en = 'Incoming'");
		ИначеЕсли ВидПапкиВыбранный = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики") Тогда
			НаименованиеПапки = НСтр("ru = 'Черновики'; en = 'Drafts'");
		КонецЕсли;
	Иначе
		НаименованиеПапки = НСтр("ru = 'Входящие'; en = 'Incoming'");
	КонецЕсли;
	
	Ссылка = СправочникНайтиПоНаименованию("ПапкиЭлектронныхПисем",НаименованиеПапки, УчетнаяЗаписьВыбранная);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтруктураОтбора = Новый Структура("Папка",Ссылка);
		НомерСтроки = ДеревоНайтиСтрокуПоСвойству(ДеревоУчетныхЗаписей,СтруктураОтбора);
		Элементы.ПанельУправления.ТекущаяСтрока = НомерСтроки;
	ИначеЕсли ЗначениеЗаполнено(УчетнаяЗаписьВыбранная) Тогда
		Элементы.ПанельУправления.ТекущаяСтрока = 0;
	КонецЕсли;
	
	Если НетУчетныхЗаписей Тогда
		Если ЕстьПравоДобавленияУчетныхЗаписей Тогда
			ОповещениеВопрос = Новый ОписаниеОповещения("ОбработкаПодключитьУчетнуюЗапись", ЭтотОбъект);
			ТекстВопроса = НСтр("ru='Нет доступных учетных записей. Подключить новую?';en='No available accounts. Add new?'");
			ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ТекстСообщения = НСтр("ru='Нет доступных учетных записей. Для добавления обратитесь к администратору.';en='No available accounts. Contact to administrator to add.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

	ОбновитьКоличествоНовыхПисемВПапках();
	
	Если Элементы.СписокПисем.АвтоОбновление Тогда
		ПодключитьОбработчикОжидания("ОбновитьКоличествоНовыхПисемВПапках",Элементы.СписокПисем.ПериодАвтоОбновления);
	КонецЕсли;
	
	ВосстановитьСостояниеУзловДереваУчетныхЗаписей();
	
		
	Если ПолучитьПочтуПриОткрытии Тогда
		ВыполнитьПолучениеПочты();
	КонецЕсли;
	
	Если ПериодОтправкиПисем > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьНадписьДатыЗагрузки", ПериодОтправкиПисем, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработки ответа на вопрос - Подключить ли учетную запись.
//
// Параметры:
//   Параметры - КодВозвратаДиалога
//   дополнительно - неопределно, не передаем.
//
Процедура ОбработкаПодключитьУчетнуюЗапись(Параметры, Дополнительно) Экспорт
	
	Если Параметры = КодВозвратаДиалога.Да Тогда
		ПодключитьУчетнуюЗапись();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "CRM_ПисьмоПеремещеноВПапку" Тогда
		
		Элементы.СписокПисем.Обновить();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	ИначеЕсли ИмяСобытия = "CRM_УстановленФлагОбработано" Тогда
		
		Элементы.СписокПисем.Обновить();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	ИначеЕсли ИмяСобытия = "CRM_УстановленНовыйОтветственный" ИЛИ ИмяСобытия = "УстановленНовыйОтветственный" Тогда
		
		Элементы.СписокПисем.Обновить();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	ИначеЕсли ИмяСобытия = "ПолученыНовыеЭлектронныеПисьма" Тогда
		
		Элементы.СписокПисем.Обновить();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	ИначеЕсли ИмяСобытия = "СохраненаЛичнаяЗадача" И ТипЗнч(Параметр) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		
		Элементы.СписокПисем.Обновить();
		ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
		
	ИначеЕсли ИмяСобытия = "Запись_УчетнаяЗаписьЭлектроннойПочты" ИЛИ ИмяСобытия = "ИзмененыНастройкиСинхронизацииПапок" Тогда
		ОбновитьСоставПапок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПриЗакрытии".
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	
	ПриЗакрытииНаСервере();
	СохранитьСостояниеУзловДереваУчетныхЗаписей();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	CRM_РежимФормЗакладкиСервер.ПриЗакрытииНаСервере(ЭтотОбъект);
	// Сохранение сортировки списка.
	//CRM_ОбщегоНазначенияСервер.СохранитьСортировкуСписка(СписокПисем, "Обработка.CRM_МенеджерПочты.СписокПисем");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПисем

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	ОтобратьСписок(СтрокаПоиска, "Везде");

КонецПроцедуры

&НаКлиенте
Процедура СписокПисемПриИзменении(Элемент)
	ОбновитьКоличествоНовыхПисемВПапках();
КонецПроцедуры

&НаКлиенте
Процедура СписокПисемПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.СписокПисемПринятьОбращение.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюПринятьОбращение.Видимость = Ложь;
		
		Элементы.СписокПисемОтклонитьОбращение.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюОтклонитьОбращение.Видимость = Ложь;
		
		Элементы.СписокПисемКонтекстноеМенюСтруктураПодчиненности.Доступность = Ложь;
		
		Элементы.СписокПисемСнятьУстановитьОтметкуОПрочтении.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюСнятьУстановитьОтметкуОПрочтении.Видимость = Ложь;
		
		Элементы.СписокПисемПеренаправить.Видимость = Ложь;
		Элементы.СписокПисемПеренаправитьНаРоль.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюГруппаПеренаправить.Видимость = Ложь;
		
		Если ИспользоватьЗаявки Тогда
			Элементы.СписокПисемДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Ложь;
			Элементы.СписокПисемКонтекстноеМенюДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Ложь;
		КонецЕсли;

		Возврат;
		
	КонецЕсли;
	
	Элементы.СписокПисемКонтекстноеМенюСтруктураПодчиненности.Доступность = Истина;
	
	Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Элементы.СписокПисемКонтекстноеМенюСкопировать.Видимость = Ложь;
		Элементы.СписокПисемДокументЭлектронноеПисьмоВходящееОтветить.Доступность = Истина;
		Элементы.СписокПисемДокументЭлектронноеПисьмоВходящееОтветитьВсем.Доступность = Истина;
		Элементы.КонтекстноеМенюСписокПисемОтветить.Доступность = Истина;
		Элементы.КонтекстноеМенюСписокПисемОтветитьВсем.Доступность = Истина;
		
		Элементы.СписокПисемПринятьОбращение.Видимость = Истина;
		Элементы.СписокПисемКонтекстноеМенюПринятьОбращение.Видимость = Истина;
		
		Элементы.СписокПисемОтклонитьОбращение.Видимость =
											(Элемент.ТекущиеДанные.СостояниеЛида = ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Новый"));
		Элементы.СписокПисемКонтекстноеМенюОтклонитьОбращение.Видимость =
											(Элемент.ТекущиеДанные.СостояниеЛида = ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Новый"));
		
		Элементы.СписокПисемСнятьУстановитьОтметкуОПрочтении.Видимость = Истина;
		Элементы.СписокПисемКонтекстноеМенюСнятьУстановитьОтметкуОПрочтении.Видимость = Истина;
		
		Элементы.СписокПисемПеренаправить.Видимость = Истина;
		Элементы.СписокПисемПеренаправитьНаРоль.Видимость = Истина;
		Элементы.СписокПисемКонтекстноеМенюГруппаПеренаправить.Видимость = Истина;
		
		Если ИспользоватьЗаявки Тогда
			Элементы.СписокПисемДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = НЕ УчетнаяЗаписьЯвляетсяИсточникомЛидов;
			Элементы.СписокПисемКонтекстноеМенюДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Элементы.СписокПисемДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Элемент.ТекущаяСтрока) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		Элементы.СписокПисемКонтекстноеМенюСкопировать.Видимость = Истина;
		Элементы.СписокПисемДокументЭлектронноеПисьмоВходящееОтветить.Доступность = Истина;
		Элементы.СписокПисемДокументЭлектронноеПисьмоВходящееОтветитьВсем.Доступность = Истина;
		Элементы.КонтекстноеМенюСписокПисемОтветить.Доступность = Истина;
		Элементы.КонтекстноеМенюСписокПисемОтветитьВсем.Доступность = Истина;
		
		Элементы.СписокПисемПринятьОбращение.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюПринятьОбращение.Видимость = Ложь;
		
		Элементы.СписокПисемОтклонитьОбращение.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюОтклонитьОбращение.Видимость = Ложь;
		
		Элементы.СписокПисемСнятьУстановитьОтметкуОПрочтении.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюСнятьУстановитьОтметкуОПрочтении.Видимость = Ложь;
		
		Элементы.СписокПисемПеренаправить.Видимость = Ложь;
		Элементы.СписокПисемПеренаправитьНаРоль.Видимость = Ложь;
		Элементы.СписокПисемКонтекстноеМенюГруппаПеренаправить.Видимость = Ложь;
		
		Если ИспользоватьЗаявки Тогда
			Элементы.СписокПисемДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Ложь;
			Элементы.СписокПисемКонтекстноеМенюДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияСписокПисемПриАктивизацииСтроки", 0.5, Истина);
	
	Если ТаймаутОтметкиОПрочтении > 0 Тогда
		ПодключитьОбработчикОжидания("АвтоустановкаРассмотренностиПисьма", ТаймаутОтметкиОПрочтении, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПисемПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	Если Копирование Тогда
		ПараметрыОткрытия = Новый Структура("ЗначениеКопирования", Элемент.ТекущаяСтрока);
	Иначе
		ПараметрыОткрытия = Новый Структура();
	КонецЕсли;
		
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПисемПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
КонецПроцедуры

&НаКлиенте
Процедура СписокПисемПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
	Если ПеретаскиваетсяФайл(ПараметрыПеретаскивания.Значение) = Истина Тогда
		СоздатьЭлектронноеПисьмоПеретаскиваниемФайла(ПараметрыПеретаскивания.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПисемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		ИЛИ ТипЗнч(Элементы.СписокПисем.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат; КонецЕсли;
	
	МассивПисем = Новый Массив;
	МассивПисем.Добавить(ТекущиеДанные.Ссылка);
	
	Если Поле.Имя = "СписокПисемИзбранный" Тогда
		
		СтандартнаяОбработка = Ложь;
		ИзменитьСостояниеИзбранности(МассивПисем, НЕ ТекущиеДанные.Избранный);
		
	ИначеЕсли Поле.Имя = "СписокПисемРассмотрено" Тогда
		
		СтандартнаяОбработка = Ложь;
		ИзменитьСостояниеПрочтенности(МассивПисем, НЕ ТекущиеДанные.Рассмотрено);
		
	Иначе
		
		ОтключитьОбработчикОжидания("АвтоустановкаРассмотренностиПисьма");
		АвтоустановкаРассмотренностиПисьма();	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Настройки

&НаКлиенте
Процедура ОткрытьПерсональныеНастройки(Команда)
	
	ОписаниеОповещенияНастроек = Новый ОписаниеОповещения("ОткрытьПерсональныеНастройкиЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АРМПочта");
	ПараметрыОткрытия.Вставить("ТекущаяСтраница", "ЭлектроннаяПочта");
	ОткрытьФорму("ОбщаяФорма.CRM_ПерсональныеНастройки", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПерсональныеНастройкиЗавершение(Результат, ДопПараметры) Экспорт
	
	ТаймаутОтметкиОПрочтении = ХранилищеОбщихНастроекЗагрузить("ТаймаутОтметкиОПрочтении", "ТаймаутОтметкиОПрочтении", 5);
		
	ВсеВложенияПометка = ХранилищеОбщихНастроекЗагрузить("ПоказыватьВсеВложения", "ПоказыватьВсеВложения", Ложь);
	ПоказатьСкрытьВсеВложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	ОписаниеОповещенияНастроек = Новый ОписаниеОповещения("ОткрытьНастройкиЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ОткрытьФорму("Обработка.CRM_МенеджерПочты.Форма.ФормаНастроек", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		ТаймаутОтметкиОПрочтении = ХранилищеОбщихНастроекЗагрузить("ТаймаутОтметкиОПрочтении", "ТаймаутОтметкиОПрочтении", 5);
		
		ВсеВложенияПометка = ХранилищеОбщихНастроекЗагрузить("ПоказыватьВсеВложения", "ПоказыватьВсеВложения", Ложь);
		ПоказатьСкрытьВсеВложения();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Фильтр

&НаКлиенте
Процедура ОткрытьФильтр(Команда)
	
	ОписаниеОповещенияФильтра = Новый ОписаниеОповещения("ОткрытьФильтрЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	СтруктураФильтра = Новый Структура;
	
	СтруктураФильтра.Вставить("Период", ФильтрПериод);
	СтруктураФильтра.Вставить("Отправитель", ФильтрОтправитель);
	СтруктураФильтра.Вставить("Получатель", ФильтрПолучатель);
	СтруктураФильтра.Вставить("Тема", ФильтрТема);
	СтруктураФильтра.Вставить("ТекстПисьма", ФильтрТекстПисьма);
	СтруктураФильтра.Вставить("Ответственный", ФильтрОтветственный);
	СтруктураФильтра.Вставить("ПоказатьТолькоНепрочитанные", ФильтрПоказатьТолькоНепрочитанные);
	СтруктураФильтра.Вставить("НастройкиКомпоновки", ФильтрНастройкиКомпоновки);
	
	ПараметрыОткрытия.Вставить("СтруктураФильтра", СтруктураФильтра);
	ОткрытьФорму("Обработка.CRM_МенеджерПочты.Форма.ФормаФильтра", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияФильтра, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтр(Результат)
	
	// Сброс и блокировка строки поиска
	СтрокаПоиска = "";
	Элементы.СтрокаПоиска.Доступность = Ложь;
	
	Для Каждого ЭлементСтруктуры Из Результат Цикл
		ЭтотОбъект["Фильтр" + ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
	КонецЦикла;
	
	// Установка/сброс фильтров:
	
	// Используем "ДобавитьЭлементКомпоновки" вместо "УстановитьЭлементОтбора", потому что в группе 2 поля с одним именем.
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокПисем, "Дата");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокПисем.Отбор, "Дата", ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
															ФильтрПериод.ДатаНачала,, ЗначениеЗаполнено(ФильтрПериод.ДатаНачала));
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокПисем.Отбор, "Дата", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
															КонецДня(ФильтрПериод.ДатаОкончания),, ЗначениеЗаполнено(ФильтрПериод.ДатаОкончания));
	
	ОтобратьСписок("", "Везде", Истина);
	
	ПоказатьТолькоНепрочитанные(ФильтрПоказатьТолькоНепрочитанные);
	
	УстановитьФильтрНаСервере();
	
	// Разблокирование строки поиска
	Если КоличествоФильтров = 0 Тогда
		Элементы.СтрокаПоиска.Доступность = Истина;
	КонецЕсли;
	
	Элементы.СписокПисем.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрНаСервере()
	
	ВыбранПользователь = (ТипЗнч(ФильтрОтветственный) = Тип("СправочникСсылка.Пользователи"));
	
	ИспользоватьОтборПоОтветственному = ВыбранПользователь И ЗначениеЗаполнено(ФильтрОтветственный);
	ИспользоватьОтборПоРоли = НЕ ВыбранПользователь И ЗначениеЗаполнено(ФильтрОтветственный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Ответственный_Роль", ФильтрОтветственный,
																				ВидСравненияКомпоновкиДанных.Равно,, ИспользоватьОтборПоРоли);
	
	Если Константы.CRM_ИспользоватьДоступныхПользователей.Получить() Тогда
		// +Доступные пользователи	
		МассивЭлементовОтбора = Новый Массив;
		МассивЭлементовОтбора.Добавить("Ответственный");
		
		МассивДоступныхПользователей = Неопределено;
		
		Если ВыбранПользователь Тогда
			Если ЗначениеЗаполнено(ФильтрОтветственный) Тогда
				МассивДоступныхПользователей = Новый Массив;
				МассивДоступныхПользователей.Добавить(ФильтрОтветственный);
			КонецЕсли;
		Иначе
			МассивДоступныхПользователей = Новый Массив;
		КонецЕсли;
		УстановитьОтборВСпискеПоДоступнымпользователям(СписокПисем, МассивЭлементовОтбора, МассивДоступныхПользователей, Истина);
		// -Доступные пользователи
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Ответственный", ФильтрОтветственный,
																				ВидСравненияКомпоновкиДанных.Равно,, ИспользоватьОтборПоОтветственному);
	КонецЕсли;
	
	
	// Оформление команды Фильтр
	КоличествоФильтров = 0;
	ПустойФильтр = ПустаяСтруктураФильтра();
	Для Каждого ЭлементСтруктуры Из ПустойФильтр Цикл
		Если ЭтотОбъект["Фильтр" + ЭлементСтруктуры.Ключ] <> ЭлементСтруктуры.Значение Тогда
			Если ЭлементСтруктуры.Ключ = "Ответственный" И ЭтотОбъект["Фильтр" + ЭлементСтруктуры.Ключ] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			КоличествоФильтров = КоличествоФильтров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОткрытьФильтр.Заголовок = ?(КоличествоФильтров > 0, НСтр("ru='Фильтр: ';en='Filter: '") + КоличествоФильтров, НСтр("ru='Фильтр';en='Filter'"));
	Элементы.ОткрытьФильтр.Картинка = ?(КоличествоФильтров > 0, БиблиотекаКартинок.CRM_ФильтрАктивный, БиблиотекаКартинок.CRM_ФильтрНеАктивный);
	Элементы.ОткрытьФильтр.ЦветТекста = ?(КоличествоФильтров > 0, ЦветаСтиля.CRM_ОсновнойГолубой, Новый Цвет(77, 77, 77));

КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФильтрЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьФильтр(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПустаяСтруктураФильтра()
	
	СтруктураФильтра = Новый Структура;
	
	СтруктураФильтра.Вставить("Период", Новый СтандартныйПериод);
	СтруктураФильтра.Вставить("Отправитель", "");
	СтруктураФильтра.Вставить("Получатель", "");
	СтруктураФильтра.Вставить("Тема", "");
	СтруктураФильтра.Вставить("ТекстПисьма", "");
	СтруктураФильтра.Вставить("Ответственный", ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	СтруктураФильтра.Вставить("ПоказатьТолькоНепрочитанные", Ложь);
	СтруктураФильтра.Вставить("НастройкиКомпоновки", Неопределено);
	
	Возврат СтруктураФильтра;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьФильтр(Команда)
	
	УстановитьФильтр(ПустаяСтруктураФильтра());
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СвойстваУчетнойЗаписи(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ПараметрыФормы = ПолучитьТекущуюУЗ();
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта",ПараметрыФормы,ЭтотОбъект,,);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеПрочтенности(МассивПисем, Прочитаны)
	
	Если НЕ Прочитаны Тогда
		ОтключитьОбработчикОжидания("АвтоустановкаРассмотренностиПисьма");
	КонецЕсли;
	
	УстановитьСнятьПометкуОПрочтении(МассивПисем, Прочитаны);
	
	// Проверим напоминания о входящих письмах.
	Если Прочитаны Тогда
		ПроверитьНапоминанияОВходящихПисьмах(МассивПисем);
	КонецЕсли;
	
	Элементы.СписокПисем.Обновить();
	ОбновитьКоличествоНовыхПисемВПапках();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьУстановитьОтметкуОПрочтении(Команда)
	
	ЕстьПрочитанныеПисьма = Ложь;
	ЕстьНепрочитанныеПисьма = Ложь;
	
	ВыделенныеПисьма = Элементы.СписокПисем.ВыделенныеСтроки;
	
	Если ВыделенныеПисьма.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Для Каждого ВыделенноеПисьмо Из ВыделенныеПисьма Цикл
		
		ДанныеСтроки = Элементы.СписокПисем.ДанныеСтроки(ВыделенноеПисьмо);
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.Рассмотрено Тогда
			ЕстьПрочитанныеПисьма = Истина;
		Иначе
			ЕстьНепрочитанныеПисьма = Истина;
		КонецЕсли;
		
		Если ЕстьПрочитанныеПисьма И ЕстьНепрочитанныеПисьма Тогда
			ИзменитьСостояниеПрочтенности(ВыделенныеПисьма, Истина);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьОтметкуОПрочтении = ЕстьНепрочитанныеПисьма;
	ИзменитьСостояниеПрочтенности(ВыделенныеПисьма, УстановитьОтметкуОПрочтении);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьВсем(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ПроверитьНаВозможностьОтправкиПисьма(ТекущиеДанныеДерева.УчетнаяЗапись) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Учетная запись не предназначена для отправки писем';en='Login account is not intended for sending of letters'"));
		Возврат;
		
	КонецЕсли;
	
	Основание = Новый Структура("Основание, Команда", ТекущиеДанные.Ссылка, "ОтветитьВсем");
	ПараметрыОткрытия = Новый Структура("Основание, Ключ", Основание,ПолучитьСсылкуНовогоДокумента());
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Переслать(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ПроверитьНаВозможностьОтправкиПисьма(ТекущиеДанныеДерева.УчетнаяЗапись) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Учетная запись не предназначена для отправки писем';en='Login account is not intended for sending of letters'"));
		Возврат;
		
	КонецЕсли;
	
	Основание = Новый Структура("Основание, Команда", ТекущиеДанные.Ссылка, "Переслать");
	ПараметрыОткрытия = Новый Структура("Основание, Ключ", Основание,ПолучитьСсылкуНовогоДокумента());
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Результат = "";
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли; 		
	
	Результат = СоздатьПисьмо(ТекущиеДанные.УчетнаяЗапись); 	
	
	Если Результат = "" Тогда
		
		СсылкаНового = ПолучитьСсылкуНовогоДокумента();
		ПараметрыОткрытия = Новый Структура("УчетнаяЗапись, Ключ", ТекущиеДанные.УчетнаяЗапись, ПолучитьСсылкуНовогоДокумента());
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолучениеПочты(МассивУчетныхЗаписей = Неопределено)
	
	СписокПолученныхПисем = Новый СписокЗначений;
	
	// CRM_УправлениеЭлектроннойПочтойКлиент.ЗагрузитьПочтуПользователя(Элементы.СписокПисем, ТекущаяУчетнаяЗапись);
	ПоказатьОповещениеПользователя(,,НСтр("ru='Идет получение электронной почты ...';en='There are an obtaining of e-mail...'"), БиблиотекаКартинок.CRM_Ожидание);
	ПолученоПисем = 0;
	ДоступноУчетныхЗаписей = 0;
	ЕстьОшибки = Ложь;
	
	СписокПолученныхПисем = Новый СписокЗначений;
	
	Результат = ПолучитьПочтуНаСервере(ПолученоПисем, ДоступноУчетныхЗаписей, ЕстьОшибки, СписокПолученныхПисем, МассивУчетныхЗаписей);
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияПоучениеПочты", 1, Истина);
		// ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
		
	Иначе
		Элементы.СписокПисем.Обновить();
		УстановитьНадписьДатыЗагрузки();
		ПоказатьОповещениеПользователя(,,НСтр("ru='Почта получена ...';en='Mail received ...'"));
	КонецЕсли;
	
	
	// CRM_УправлениеЭлектроннойПочтой.ЗагрузитьПочтуПользователя(ПолученоПисем, ДоступноУчетныхЗаписей, ЕстьОшибки,
	// СписокПолученныхПисем, УчетнаяЗаписьОтбор);
	//
	
	ОбновитьКоличествоНовыхПисемВПапках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтправкуПочты(МассивУчетныхЗаписей = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("ОтправленоПисем",        0);
	Результат.Вставить("ПолученоПисем",          0);
	Результат.Вставить("ДоступноУчетныхЗаписей", 0);
	Результат.Вставить("ЕстьОшибки",             Ложь);
	
	CRM_УправлениеЭлектроннойПочтой.ОтправитьПочтуПользователя(МассивУчетныхЗаписей, Результат);
	Элементы.СписокПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолучитьПисьма(Команда)
	
	ТекущаяУчетнаяЗапись = Неопределено;
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущаяУчетнаяЗапись = ТекущиеДанные.УчетнаяЗапись;
	КонецЕсли;
	
	Если ТекущаяУчетнаяЗапись = Неопределено Тогда Возврат; КонецЕсли;
	
	МассивУчетныхЗаписей = Новый Массив;
	МассивУчетныхЗаписей.Добавить(ТекущаяУчетнаяЗапись);
	
	ОтправитьПолучитьПисьмаУчетныхЗаписей(МассивУчетныхЗаписей);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолучитьПисьмаВсехУчетныхЗаписей()
	
	МассивУчетныхЗаписей = Новый Массив;
	
	КоллекцияЭлементовДерева = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.УчетнаяЗапись) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивУчетныхЗаписей.Добавить(СтрокаДерева.УчетнаяЗапись);
		
	КонецЦикла;
	
	ОтправитьПолучитьПисьмаУчетныхЗаписей(МассивУчетныхЗаписей);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолучитьПисьмаУчетныхЗаписей(МассивУчетныхЗаписей)
	
	ВыполнитьОтправкуПочты(МассивУчетныхЗаписей);
	ВыполнитьПолучениеПочты(МассивУчетныхЗаписей);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальнаяЗагрузкаЭлектроннойПочты(Команда)
	
	ТекущаяУчетнаяЗапись = Неопределено;
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущаяУчетнаяЗапись = ТекущиеДанные.УчетнаяЗапись;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяУчетнаяЗапись) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не выбрана учетная запись!';en='Login account is not selected!'"), 10);
		Возврат;
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура("УчетнаяЗапись", ТекущаяУчетнаяЗапись);
	ОткрытьФорму("Обработка.CRM_ПервоначальнаяЗагрузкаЭлектроннойПочты.Форма", СтруктураПараметры, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекущиеДанныеДерева = Элементы.ПанельУправления.ТекущиеДанные;
	Если НЕ ПроверитьНаВозможностьОтправкиПисьма(ТекущиеДанныеДерева.УчетнаяЗапись) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Учетная запись не предназначена для отправки писем';en='Login account is not intended for sending of letters'"));
		Возврат;
		
	КонецЕсли;
	
	Основание = Новый Структура("Основание, Команда", ТекущиеДанные.Ссылка, "Ответить");
	ПараметрыОткрытия = Новый Структура("Основание, Ключ", Основание, ПолучитьСсылкуНовогоДокумента());
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФильтр(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ЭлементыОтбора = Новый Структура("Владелец", ТекущиеДанные.УчетнаяЗапись);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ФормаФильтра = ПолучитьФорму("Справочник.ПравилаОбработкиЭлектроннойПочты.ФормаОбъекта", ПараметрыФормы);
	Если ФормаФильтра = Неопределено Тогда Возврат; КонецЕсли;	
	ФормаФильтра.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьПравилаОбработки(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;	
	ПараметрыФормы = Новый Структура("УчетнаяЗапись", ТекущиеДанные.УчетнаяЗапись);
	ФормаФильтра = ПолучитьФорму("Справочник.ПравилаОбработкиЭлектроннойПочты.Форма.ПрименениеПравил", ПараметрыФормы);
	Если ФормаФильтра = Неопределено Тогда Возврат; КонецЕсли;	
	ФормаФильтра.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстанавливатьФормуПриОткрытии(Команда)
	Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка = НЕ Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка;
	CRM_ХранилищеНастроек.Сохранить(ЭтотОбъект.ИмяФормы, "ВосстанавливатьФормуПриОткрытии", Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОбращение(Команда)
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	ОтправительАдрес = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Ссылка, "ОтправительАдрес");
	ОтправительКонтакт = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Ссылка, "ОтправительКонтакт");
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПисьмоВходящее", ТекущиеДанные.Ссылка);
	МассивСсылок = Новый Массив;
	Если ЗначениеЗаполнено(ОтправительКонтакт) Тогда
		МассивСсылок.Добавить(ОтправительКонтакт);
	КонецЕсли;
	// Для Каждого СтрокаДанных Из ЭтотОбъект.CRM_ТаблицаИнтересов Цикл
	//	МассивСсылок.Добавить(СтрокаДанных.Ссылка);
	// КонецЦикла;
	ПараметрыФормы.Вставить("МассивСсылок", МассивСсылок);
	ПараметрыФормы.Вставить("АдресЭП", ОтправительАдрес);
	ПараметрыФормы.Вставить("ТемаПисьма", ТекущиеДанные.Тема);
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма", ПараметрыФормы, ЭтотОбъект, ОтправительАдрес);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОбращение(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	
	ЕстьЛиды = ЕстьЛидыВВыбранныхСтроках(Ложь);
	ЕстьЛидыСУказаниемПричиныОтклонения = ЕстьЛидыВВыбранныхСтроках(Истина);
	
	Если ЕстьЛиды Тогда
		Если ЕстьЛидыСУказаниемПричиныОтклонения Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтклонитьОбращениеЗавершение", ЭтотОбъект, Истина);
			ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", , ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	
			Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
				ЗадатьВопросПриПереносеВОбработанные();
			Иначе
				ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет обращений для отклонения.'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОбращениеЗавершение(Результат, ЕстьЛиды) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("ПричинаОтказа")
			И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
			
		Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
			ЗадатьВопросПриПереносеВОбработанные(Результат);
		Иначе
			ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, Результат);
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчентыеЗаписиЭлектроннойПочты(Команда)
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ТекстСообщения = НСтр("ru = 'Можно перенаправлять только входящие письма'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(ТекущиеДанные.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьНаРоль(Команда)
	
	ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ТекстСообщения = НСтр("ru = 'Можно перенаправлять только входящие письма'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(ТекущиеДанные.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект), Тип("СправочникСсылка.РолиИсполнителей"));

КонецПроцедуры

&НаКлиенте
Процедура CRM_ЗагрузитьВложения(Команда)
	
	ТекущееПисьмо = Элементы.СписокПисем.ТекущаяСтрока;
	
	Если ТекущееПисьмо = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("CRM_ЗагрузитьВложенияЗавершение", ЭтотОбъект);
	CRM_УправлениеЭлектроннойПочтойКлиент.ЗагрузитьВложения(ТекущееПисьмо, ЭтотОбъект, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ЗагрузитьВложенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Возврат;
	КонецЕсли;
	
	ПринудительнаяАктивизацияСтроки = Истина;
	ОбработчикОжиданияСписокПисемПриАктивизацииСтроки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьЛидыВВыбранныхСтроках(СУказаниемПричиныОтклонения = Истина)
	
	МассивСсылок = Новый Массив;
	
	Для Каждого ТекСтрока Из Элементы.СписокПисем.ВыделенныеСтроки Цикл
		МассивСсылок.Добавить(ТекСтрока.Ссылка);
	КонецЦикла;
	
	Возврат РегистрыСведений.CRM_СостоянияЛидов.ЕстьЛидыВМассивеСсылок(МассивСсылок, СУказаниемПричиныОтклонения);
	
КонецФункции

&НаКлиенте
Процедура ВопросПриПереносеВОбработанныеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	ПереноситьПисьмаВОбработанные = (Результат = КодВозвратаДиалога.Да);
	
	УказанаПричинаОтказа = (ДополнительныеПараметры <> Неопределено);
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ПапкаОбработанные = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(УчетнаяЗаписьВыбранная, ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные"));
	ДополнительныеПараметры.Вставить("Папка", ПапкаОбработанные);
	ДополнительныеПараметры.Вставить("ВидПапки", ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные"));
	ДополнительныеПараметры.Вставить("МассивСсылок", Новый Массив);
	ДополнительныеПараметры.Вставить("ПереноситьПисьмаВОбработанные", ПереноситьПисьмаВОбработанные);
		
	СообщениеОФильтрацииМассива = НСтр("ru = 'Операция отклонения не доступна для письма с темой ""%1"".'");
	ДополнительныеПараметры.МассивСсылок = ПолучитьИзМассиваОбращенияСостояния(Элементы.СписокПисем.ВыделенныеСтроки,
																			ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Новый"),
																			СообщениеОФильтрацииМассива);
	Если ДополнительныеПараметры.МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если УказанаПричинаОтказа Тогда
		ОбработатьИзменениеПапки(ДополнительныеПараметры, ДополнительныеПараметры);
	Иначе
		ОбработатьИзменениеПапки(Истина, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры = Неопределено)
	ТекстВопроса = НСтр("ru = 'Перенести письмо в папку Обработанные?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриПереносеВОбработанныеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,,);
КонецПроцедуры

&НаСервере
Функция НеобходимоЗадатьВопросПриПереносеВОбработанные()
		
	Для Каждого ТекСтрока Из Элементы.СписокПисем.ВыделенныеСтроки Цикл
		Если ТекСтрока <> Неопределено Тогда
			Если ТипЗнч(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
				УчетнаяЗапись = ТекСтрока.УчетнаяЗапись;
				Если УчетнаяЗапись.CRM_ЗадаватьВопросПриПереносеВОбработанные Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
					
КонецФункции

&НаСервере
Процедура УстановитьКартинкуЭлементаПоказатьСкрытьПисьмо()
	
	НайденнаяКоманда = Команды.Найти("ПоказатьСкрытьПисьмо");
	ПодсказкаКоманды = "";
	
	Если ПоказатьСкрытьПисьмоПометка Тогда
		
		Если РежимОтображения = 0 Тогда // Стандартный вид
			Элементы.СписокПисемПоказатьСкрытьПисьмо.Картинка = БиблиотекаКартинок.CRM_ПросмотрПисьмаСтандартный24;
		ИначеЕсли РежимОтображения = 1 Тогда // Горизонтальный вид
			Элементы.СписокПисемПоказатьСкрытьПисьмо.Картинка = БиблиотекаКартинок.CRM_ПросмотрПисьмаВоВсюШирину24;
		ИначеЕсли РежимОтображения = 2 Тогда // Вертикальный вид
			Элементы.СписокПисемПоказатьСкрытьПисьмо.Картинка = БиблиотекаКартинок.CRM_ПросмотрПисьмаВоВсюВысоту24;
		КонецЕсли;
		
		ПодсказкаКоманды = НСтр("ru = 'Просмотр письма включен'");
		
	Иначе		
		Элементы.СписокПисемПоказатьСкрытьПисьмо.Картинка = БиблиотекаКартинок.CRM_ПросмотрПисьмаОтключен24;
		ПодсказкаКоманды = НСтр("ru = 'Просмотр письма отключен'");
	КонецЕсли;

	Если НайденнаяКоманда <> Неопределено Тогда
		НайденнаяКоманда.Подсказка = ПодсказкаКоманды;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасположитьОкнаСогласноРежимуОтображения(ВключатьОтображениеПисьма = Истина)
		
	// Включение отображения письма
	Если ВключатьОтображениеПисьма И НЕ ПоказатьСкрытьПисьмоПометка Тогда
		ПоказатьСкрытьПисьмоНаСервере(Истина);
	КонецЕсли;

	ХранилищеОбщихНастроекСохранить("CRM_МенеджерПочты.РежимОтображения", "АРМПочта", РежимОтображения);
	
	Если РежимОтображения = 0 Тогда // Стандартный вид
		Элементы.ГруппаПисьма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Элементы.Переместить(Элементы.Описание, Элементы.ГруппаПисьмаОписание);
	ИначеЕсли РежимОтображения = 1 Тогда // Горизонтальный вид
		Элементы.ГруппаПисьма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.Переместить(Элементы.Описание, Элементы.ГруппаПодвал);
	ИначеЕсли РежимОтображения = 2 Тогда // Вертикальный вид
		Элементы.ГруппаПисьма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Элементы.Переместить(Элементы.Описание, Элементы.ГруппаГоризонтальная2);
	КонецЕсли;
	
	УстановитьКартинкуЭлементаПоказатьСкрытьПисьмо();
	
	СформироватьСсылкиВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборПоиска(КоллекцияЭлементовОтбора)
	
	Для Каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Получатель")
				ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправитель")
				ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Тема")
				ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Текст") Тогда
				
				КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
				
			КонецЕсли;
		
		ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			Если ЭлементОтбора.Представление = "Адрес"
				ИЛИ ЭлементОтбора.Представление = "ПоискВезде" Тогда
				
				КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
				
			КонецЕсли;
		
	    КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСписок(ЗначениеПоиска, ПараметрПоиска, ЭтоФильтр = Ложь)
	
	ОчиститьОтборПоиска(СписокПисем.Отбор.Элементы);
	ОчиститьОтборПоиска(СписокПисем.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы);
	
	Если ПустаяСтрока(ЗначениеПоиска) И НЕ ЭтоФильтр Тогда Возврат; КонецЕсли;

	Если ПараметрПоиска = "Адрес" Тогда 
		ГруппаАдрес = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(СписокПисем.Отбор.Элементы, "Адрес", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаАдрес, "Получатель", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ЗначениеПоиска));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаАдрес, "Отправитель", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ЗначениеПоиска));
	ИначеЕсли ПараметрПоиска = "Тема"  Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Тема", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит, , ЗначениеЗаполнено(ЗначениеПоиска));
	ИначеЕсли ПараметрПоиска = "Текст письма"  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Текст", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит, , ЗначениеЗаполнено(ЗначениеПоиска));
	ИначеЕсли ПараметрПоиска = "Везде" Тогда
		
		ГруппаВезде = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(СписокПисем.Отбор.Элементы, "ПоискВезде", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		Если ЭтоФильтр Тогда
			Если ФильтрНастройкиКомпоновки = Неопределено Тогда
				Если ЗначениеЗаполнено(ФильтрПолучатель) Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Получатель", ФильтрПолучатель, ВидСравненияКомпоновкиДанных.Содержит,, Истина);
				КонецЕсли;
				Если ЗначениеЗаполнено(ФильтрОтправитель) Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Отправитель", ФильтрОтправитель, ВидСравненияКомпоновкиДанных.Содержит,, Истина);
				КонецЕсли;
				Если ЗначениеЗаполнено(ФильтрТема) Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Тема", ФильтрТема, ВидСравненияКомпоновкиДанных.Содержит,, Истина);
				КонецЕсли;
				Если ЗначениеЗаполнено(ФильтрТекстПисьма) Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Текст", ФильтрТекстПисьма, ВидСравненияКомпоновкиДанных.Содержит,, Истина);
				КонецЕсли;
			Иначе
				ГруппаВезде.ТипГруппы = ФильтрНастройкиКомпоновки.Отбор.Элементы[0].ТипГруппы;
				Для каждого ЭлементОтбора из ФильтрНастройкиКомпоновки.Отбор.Элементы[0].Элементы Цикл
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, ?(Строка(ЭлементОтбора.ЛевоеЗначение) = "ТекстПисьма", "Текст", Строка(ЭлементОтбора.ЛевоеЗначение)),
						ЭлементОтбора.ПравоеЗначение, ЭлементОтбора.ВидСравнения,, ЭлементОтбора.Использование);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Получатель", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ЗначениеПоиска));
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Отправитель", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ЗначениеПоиска));
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Тема", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ЗначениеПоиска));
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаВезде, "Текст", ЗначениеПоиска, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ЗначениеПоиска));
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Ссылка", ПредопределенноеЗначение("Документ.ЭлектронноеПисьмоВходящее.ПустаяСсылка"), ВидСравненияКомпоновкиДанных.Равно);	
	КонецЕсли;
	
	Элементы.СписокПисем.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьНадписьДатыЗагрузки()
	
	Если Элементы.СписокПисем.АвтоОбновление Тогда
		УстановитьНадписьДатыЗагрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьДатыЗагрузки(УчетнаяЗапись = Неопределено)

	Если УчетнаяЗапись = Неопределено Тогда
		
		ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;	
		УчетнаяЗапись = ТекущиеДанные.УчетнаяЗапись;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Элементы.СписокПисемДекорацияДатаПолученияПисем.Видимость = Ложь;
	КонецЕсли;
	
	Сведения = ПолучитьСведенияПоУчетнойЗаписи(УчетнаяЗапись);
	Если Сведения.ПротоколВходящейПочты = "IMAP" Тогда
	
		ШаблонДекорацияДатаПолученияПисем = НСтр("ru = 'обновлено: %1'");
		
		Если ЗначениеЗаполнено(Сведения.ДатаЗагрузкиПисем) Тогда		
			ФорматДаты = "ДФ='dd.MM.yy HH:mm'";
			Если НачалоДня(ТекущаяДата()) = НачалоДня(Сведения.ДатаЗагрузкиПисем) Тогда
				ФорматДаты = "ДФ='HH:mm'";
			КонецЕсли;
			ДатаПолученияПисем = Формат(Сведения.ДатаЗагрузкиПисем, ФорматДаты);		
		Иначе		
			ДатаПолученияПисем = НСтр("ru = 'никогда'");
		КонецЕсли;
		
		Элементы.СписокПисемДекорацияДатаПолученияПисем.Видимость = Истина;
		Элементы.СписокПисемДекорацияДатаПолученияПисем.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДекорацияДатаПолученияПисем, ДатаПолученияПисем);
		
	Иначе
		
		Элементы.СписокПисемДекорацияДатаПолученияПисем.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСостояниеУзловДереваУчетныхЗаписей()
	
	Если НЕ Элементы.ПанельУправления.Видимость Тогда Возврат; КонецЕсли;
	
	СостояниеУзловДерева = ХранилищеОбщихНастроекЗагрузить(ЭтотОбъект.ИмяФормы, "СостояниеУзловДерева", Новый Массив);
	
	КоллекцияЭлементовДерева = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		
		РазвернутьСтроку = Истина;
		ИдСтроки = СтрокаДерева.ПолучитьИдентификатор();
		
		Для Каждого СостояниеУзла Из СостояниеУзловДерева Цикл

			Если СтрокаДерева.УчетнаяЗапись <> СостояниеУзла.УчетнаяЗапись Тогда
				Продолжить;
			КонецЕсли;

			Если ЗначениеЗаполнено(СостояниеУзла.Развернут) Тогда
				РазвернутьСтроку = СостояниеУзла.Развернут;
			КонецЕсли;
			
			Прервать;
		
		КонецЦикла;
		
		Если РазвернутьСтроку Тогда
			Элементы.ПанельУправления.Развернуть(ИдСтроки);
		Иначе
			Элементы.ПанельУправления.Свернуть(ИдСтроки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьСостояниеУзловДереваУчетныхЗаписей()

	СостояниеУзловДерева = Новый Массив;
	КоллекцияЭлементовДерева = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		
		ИдСтроки = СтрокаДерева.ПолучитьИдентификатор();
		
		СостояниеУзловДерева.Добавить( Новый Структура("УчетнаяЗапись, Развернут", 
		СтрокаДерева.УчетнаяЗапись,
		Элементы.ПанельУправления.Развернут(ИдСтроки)) );
		
	КонецЦикла;
	
	ХранилищеОбщихНастроекСохранить(ЭтотОбъект.ИмяФормы, "СостояниеУзловДерева", СостояниеУзловДерева);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовок(НепрочитанныхПисем)
	
	Если НепрочитанныхПисем = 0 Тогда
		Заголовок = НСтр("ru = 'Почта'; en = 'Mail'");
	Иначе
		ШаблонЗаголовка = НСтр("ru = 'Почта %1 %2'");
		
		НовоеНовых = ?(НепрочитанныхПисем <> 11 И (НепрочитанныхПисем - 1) % 10 = 0, НСтр("ru = 'новое'"), НСтр("ru = 'новых'"));
		
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, НепрочитанныхПисем, НовоеНовых);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияСписокПисемПриАктивизацииСтроки()
	
	Если Элементы.СписокПисем.ТекущаяСтрока = Неопределено Или ТипЗнч(Элементы.СписокПисем.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ОписаниеПисьма = СформироватьПустоеОписание();
		ТекущееПисьмо = Неопределено;
		
		Попытка		СтрОтправитель = Элементы.СписокПисем.ТекущиеДанные.Отправитель;
		Исключение	СтрОтправитель = "";
		КонецПопытки;
		
		Попытка		СтрКому = Элементы.СписокПисем.ТекущиеДанные.Получатель;
		Исключение	СтрКому = "";
		КонецПопытки;
		
		Попытка		СтрТема = Элементы.СписокПисем.ТекущиеДанные.Тема;
		Исключение	СтрТема = "";
		КонецПопытки;
		
		Возврат;
	КонецЕсли;
	
	Если ПринудительнаяАктивизацияСтроки Тогда
		ПринудительнаяАктивизацияСтроки = Ложь;
	Иначе
		Если ТекущееПисьмо = Элементы.СписокПисем.ТекущаяСтрока Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекущееПисьмо = Элементы.СписокПисем.ТекущаяСтрока;
	
	Если ТекущееПисьмо = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоказатьСкрытьПисьмоПометка Тогда
		СтруктураОписанияПисьма = СформироватьОписаниеТекущегоПисьма(ТекущееПисьмо);
		
		Если СтруктураОписанияПисьма = Неопределено Тогда
			ОписаниеПисьма = СформироватьПустоеОписание();
			СтрОтправитель = "";
			СтрКому = "";
			СтрТема = "";
		Иначе
			ОписаниеПисьма = СтруктураОписанияПисьма.Тело;
			
			СтрОтправитель = СтруктураОписанияПисьма.От;
			СтрКому = СтруктураОписанияПисьма.Кому;
			СтрТема = СтруктураОписанияПисьма.Тема;
		КонецЕсли;
		
		СформироватьСсылкиВложений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияПанельУправленияПриАктивизацииСтроки()
	
	ОписаниеПисьма = СформироватьПустоеОписание();
	
	СтрОтправитель = "";
	СтрКому = "";
	СтрТема = "";
	
	Вложения.Очистить();
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	
	Если НетУчетныхЗаписей Тогда
		ОтборДинамическогоСписка = СписокПисем.КомпоновщикНастроек.Настройки.Отбор;
		УчетнаяЗаписьОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(ОтборДинамическогоСписка.Элементы,"УчетнаяЗапись");
		УчетнаяЗаписьОтбор.ПравоеЗначение =  ПустаяУчетнаяЗапись;
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда 
		УчетнаяЗаписьОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(СписокПисем.Отбор.Элементы,"УчетнаяЗапись");
		Если ЗначениеЗаполнено(УчетнаяЗаписьОтбор) Тогда
			УчетнаяЗаписьОтбор.ПравоеЗначение =  ПустаяУчетнаяЗапись;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьВыбранная = ТекущиеДанные.УчетнаяЗапись;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	ОтборДинамическогоСписка = СписокПисем.КомпоновщикНастроек.Настройки.Отбор;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписокПисем.Отбор, "Папка");
	
	Если Родитель = Неопределено Тогда
		УчетнаяЗаписьОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(ОтборДинамическогоСписка.Элементы,"УчетнаяЗапись");
		УчетнаяЗаписьОтбор.ПравоеЗначение =  ТекущиеДанные.УчетнаяЗапись;
		УчетнаяЗаписьОтбор.Использование = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Папка",ПредопределенноеЗначение("Справочник.ПапкиЭлектронныхПисем.ПустаяСсылка"),,,Ложь,,); 
	Иначе
		УчетнаяЗаписьОтбор = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(ОтборДинамическогоСписка.Элементы,"УчетнаяЗапись");
		УчетнаяЗаписьОтбор.ПравоеЗначение =  ТекущиеДанные.УчетнаяЗапись;
		УчетнаяЗаписьОтбор.Использование = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "Папка",ТекущиеДанные.Папка,,,Истина,,);
	КонецЕсли;
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПисем, "СкрытьИзСписка",Ложь,,,Истина,,);
	
	УчетнаяЗаписьЯвляетсяИсточникомЛидов = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(УчетнаяЗаписьВыбранная, "CRM_ИсточникЛидов");
	
	Если ИспользоватьЗаявки Тогда
		Элементы.СписокПисемДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = НЕ УчетнаяЗаписьЯвляетсяИсточникомЛидов;
		Элементы.СписокПисемКонтекстноеМенюДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Элементы.СписокПисемДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость;
	КонецЕсли;
	
	УстановитьНадписьДатыЗагрузки(УчетнаяЗаписьВыбранная);
			
	Если ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие")
		ИЛИ ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные")
		ИЛИ ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики") Тогда
		
		Элементы.СписокПисемСостояниеЛида.Видимость = Ложь;
		Элементы.СписокПисемИнтересЛида.Видимость = Ложь;
		
	Иначе
		
		Элементы.СписокПисемСостояниеЛида.Видимость = УчетнаяЗаписьЯвляетсяИсточникомЛидов;
		Элементы.СписокПисемИнтересЛида.Видимость = УчетнаяЗаписьЯвляетсяИсточникомЛидов;
		
	КонецЕсли;
	
	Если ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие")
		ИЛИ ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные") Тогда
		Элементы.Отправитель.Видимость = Ложь;
	Иначе
		Элементы.Отправитель.Видимость = Истина;
	КонецЕсли;
	
	// Является папкой Входящие/Обработанные или находится на первом уровне иерархии в этих папках
	Если ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Входящие")
		ИЛИ ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные")
		ИЛИ Родитель <> Неопределено И (Родитель.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Входящие")
		ИЛИ Родитель.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные")) Тогда
		Элементы.Получатель.Видимость = Ложь;
	Иначе
		Элементы.Получатель.Видимость = Истина;
	КонецЕсли;

	Если Родитель = Неопределено Тогда // выбрана учетная запись
		Элементы.СписокПисемВходящее.Видимость = Истина;
		Элементы.СписокПисемПапка.Видимость = Истина;
	Иначе
		Элементы.СписокПисемВходящее.Видимость = Ложь;
		Элементы.СписокПисемПапка.Видимость = Ложь;
	КонецЕсли;
	
	ПереместитьВ_ЗаполнитьСписокКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВ_ЗаполнитьСписокКоманд()
	
	ИсключаемыеВидыПапок = Новый Массив;
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие"));
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные"));
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики"));
	
	МассивПапокСИерархией = Новый Массив;
	ДеревоПапок = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	Для Каждого СтрокаДереваПапок Из ДеревоПапок Цикл
		
		Если СтрокаДереваПапок.УчетнаяЗапись <> УчетнаяЗаписьВыбранная Тогда Продолжить; КонецЕсли;
		МассивПапокУчетнойЗаписиСИерархией(СтрокаДереваПапок.ПолучитьЭлементы(), МассивПапокСИерархией, ИсключаемыеВидыПапок,, Истина);
		
	КонецЦикла;
	
	ПереместитьВ_ЗаполнитьСписокКомандНаСервере(МассивПапокСИерархией);
	
КонецПроцедуры
	
&НаСервере
Процедура ПереместитьВ_ЗаполнитьСписокКомандНаСервере(МассивПапокСИерархией)
	
	МассивУдаляемыхЭлементов = Новый Массив;
	
	Для Каждого ЭлементГруппы Из Элементы.СписокПисемКонтекстноеМенюГруппаПереместитьВ.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементГруппы) = Тип("ГруппаФормы") Тогда Продолжить; КонецЕсли;
		МассивУдаляемыхЭлементов.Добавить(ЭлементГруппы);
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элемент)
	КонецЦикла;
	
	Для Каждого ЭлементСтуктура Из МассивПапокСИерархией Цикл
		
		Если ЭлементСтуктура.ВнизСписка Тогда Продолжить; КонецЕсли;
		
		ИдентификаторЭлемента = ЭлементСтуктура.Ссылка;
		ИдентификаторЭлементаНормализованный = СтрЗаменить(ИдентификаторЭлемента, "-", "_");
		
		ИмяКомандыФормы = "ПереместитьВ_" + ИдентификаторЭлементаНормализованный;
		
		ИмяЭлементаФормы = "ПереместитьВКМ_" + ИдентификаторЭлементаНормализованный;
		СоздатьКнопкуПереместитьВ(ИмяКомандыФормы, ИмяЭлементаФормы, ЭлементСтуктура.Имя, Элементы.СписокПисемКонтекстноеМенюГруппаПереместитьВ, Ложь);
		
	КонецЦикла;
	
	// Корзина, Спам
	Для Каждого ЭлементСтуктура Из МассивПапокСИерархией Цикл
		
		Если НЕ ЭлементСтуктура.ВнизСписка Тогда Продолжить; КонецЕсли;
		
		ИдентификаторЭлемента = ЭлементСтуктура.Ссылка;
		ИдентификаторЭлементаНормализованный = СтрЗаменить(ИдентификаторЭлемента, "-", "_");
		
		ИмяКомандыФормы = "ПереместитьВ_" + ИдентификаторЭлементаНормализованный;
		
		ИмяЭлементаФормы = "ПереместитьВКМ_" + ИдентификаторЭлементаНормализованный;
		СоздатьКнопкуПереместитьВ(ИмяКомандыФормы, ИмяЭлементаФормы, ЭлементСтуктура.Имя, Элементы.СписокПисемКонтекстноеМенюГруппаПереместитьВ, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуПереместитьВ(ИмяКомандыФормы, ИмяЭлементаФормы, ЗаголовокЭлемента, РодительЭлемента, ЭтоКоманднаяПанель)
	
	НовыйПунктМеню = Элементы.Добавить(ИмяЭлементаФормы, Тип("КнопкаФормы"), РодительЭлемента);
	//НовыйПунктМеню.Картинка = БиблиотекаКартинок.CRM_Обновить;
	НовыйПунктМеню.Отображение = ОтображениеКнопки.Авто;
	
	Если ЭтоКоманднаяПанель Тогда
		НовыйПунктМеню.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйПунктМеню.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
		НовыйПунктМеню.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
	КонецЕсли;
	
	Если Команды.Найти(ИмяКомандыФормы) = Неопределено Тогда
		НоваяКомандаФормы = Команды.Добавить(ИмяКомандыФормы);
		НоваяКомандаФормы.Заголовок					= ЗаголовокЭлемента;
		НоваяКомандаФормы.Действие					= "Подключаемый_ПереместитьВ";
		НоваяКомандаФормы.ИзменяетСохраняемыеДанные	= Ложь;
	КонецЕсли;
	
	НовыйПунктМеню.ИмяКоманды = ИмяКомандыФормы;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПереместитьВ(Команда)
	
	ИдентификаторПапки = СтрЗаменить(Команда.Имя, "ПереместитьВ_", "");
	ИдентификаторПапки = СтрЗаменить(ИдентификаторПапки, "_", "-");
	СсылкаНаПапку = ПолучитьСсылкуСправочникаПоИдентификатору("ПапкиЭлектронныхПисем", ИдентификаторПапки);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаПапку) Тогда Возврат; КонецЕсли;
	
	// действие
	МассивПеремещаемыхПисем = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокПисем.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.СписокПисем.ДанныеСтроки(ВыделеннаяСтрока);
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивПеремещаемыхПисем.Добавить(ДанныеСтроки.Ссылка);
		
	КонецЦикла;
	
		
	ПодготовитьПеремещениеПисем(СтруктураПапки(СсылкаНаПапку), МассивПеремещаемыхПисем);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция СтруктураПапки(СсылкаНаПапку)
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Папка", СсылкаНаПапку);
	СтруктураРезультат.Вставить("УчетнаяЗапись", СсылкаНаПапку.Владелец);
	СтруктураРезультат.Вставить("ВидПапки", СсылкаНаПапку.CRM_Вид);
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура АвтоустановкаРассмотренностиПисьма()
	Если Элементы.СписокПисем.ТекущаяСтрока <> Неопределено И ТипЗнч(Элементы.СписокПисем.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ТекущиеДанные = Элементы.СписокПисем.ТекущиеДанные;
		
		Если Не ТекущиеДанные = Неопределено 
		И ТекущиеДанные.Тип = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
		И Не ТекущиеДанные.Рассмотрено Тогда
			ВыделенныеПисьма = Новый Массив;
			ВыделенныеПисьма.Добавить(ТекущиеДанные.Ссылка);
			Если ФильтрПоказатьТолькоНепрочитанные Тогда
				СписокНеПрочитанные.Добавить(ТекущиеДанные.Ссылка);
				ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокПисем.Отбор,, "Непрочитанные")[0];
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ссылка", СписокНеПрочитанные, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
			КонецЕсли;
			УстановитьСнятьПометкуОПрочтении(ВыделенныеПисьма, Истина);
			ПроверитьНапоминанияОВходящихПисьмах(ВыделенныеПисьма);
			ОбновитьКоличествоНовыхПисемВПапках();
			Элементы.СписокПисем.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры// АвтоустановкаРассмотренностиПисьма()

&НаКлиенте
Процедура ПолучитьИдентификаторыПапокВДереве(ЭлементыДерева,СоответсвиеПапокИИдентификаторов, ИсключаемыеВидыПапок = Неопределено, ПолучатьГУИД = Ложь)
	
	Для Каждого папка Из ЭлементыДерева Цикл
		
		Если ТипЗнч(ИсключаемыеВидыПапок) = Тип("Массив") Тогда
			
			ПапкаИсключена = Ложь;
			
			Для Каждого ВидПапкиКИсключение Из ИсключаемыеВидыПапок Цикл
				Если папка.ВидПапки = ВидПапкиКИсключение Тогда
					ПапкаИсключена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ПапкаИсключена Тогда Продолжить; КонецЕсли;
			
		КонецЕсли;
		
		Если ПолучатьГУИД Тогда
			СоответсвиеПапокИИдентификаторов.Вставить(папка.Папка,папка.Папка.УникальныйИдентификатор());
		Иначе
			СоответсвиеПапокИИдентификаторов.Вставить(папка.Папка,Папка.ПолучитьИдентификатор());
		КонецЕсли;
		ПолучитьИдентификаторыПапокВДереве(папка.ПолучитьЭлементы(),СоответсвиеПапокИИдентификаторов, ИсключаемыеВидыПапок, ПолучатьГУИД);
		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура МассивПапокУчетнойЗаписиСИерархией(ЭлементыДерева, МассивПапок, ИсключаемыеВидыПапок = Неопределено, Иерархия = "", ПолучатьГУИД = Ложь)
	
	Для Каждого папка Из ЭлементыДерева Цикл
		
		Если ТипЗнч(ИсключаемыеВидыПапок) = Тип("Массив") Тогда
			
			ПапкаИсключена = Ложь;
			
			Для Каждого ВидПапкиКИсключение Из ИсключаемыеВидыПапок Цикл
				Если папка.ВидПапки = ВидПапкиКИсключение Тогда
					ПапкаИсключена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ПапкаИсключена Тогда Продолжить; КонецЕсли;
			
		КонецЕсли;
		
		СтруктураЭлемента = Новый Структура;
		СтруктураЭлемента.Вставить("Имя", Иерархия + папка.Папка);
		
		Если ПолучатьГУИД Тогда
			СтруктураЭлемента.Вставить("Ссылка", папка.Папка.УникальныйИдентификатор());
		Иначе
			СтруктураЭлемента.Вставить("Ссылка", папка.Папка);
		КонецЕсли;

		Если папка.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта")
			ИЛИ папка.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Удаленные") Тогда
			СтруктураЭлемента.Вставить("ВнизСписка", Истина);
		Иначе
			СтруктураЭлемента.Вставить("ВнизСписка", Ложь);
		КонецЕсли;
		
		МассивПапок.Добавить(СтруктураЭлемента);
		
		МассивПапокУчетнойЗаписиСИерархией(папка.ПолучитьЭлементы(),МассивПапок, ИсключаемыеВидыПапок, Иерархия + "  ", ПолучатьГУИД);
		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоНовыхПисемВПапках()
	
	СоответсвиеПапокИИдентификаторов = Новый Соответствие;
	ДеревоПапок = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	Для Каждого УчетнаяЗапись Из ДеревоПапок Цикл
		ПолучитьИдентификаторыПапокВДереве(УчетнаяЗапись.ПолучитьЭлементы(), СоответсвиеПапокИИдентификаторов);
	КонецЦикла;
	
	МассивНовыеПисьма = ПолучитьКоличествоНовыхПисемВПапках(УчетныеЗаписи, СоответсвиеПапокИИдентификаторов);
	
	НепрочитанныхПисемВсего = 0;
	Для Каждого НовыеПисьмаВПапке Из  МассивНовыеПисьма Цикл
		
		НепрочитанныхПисемВсего = НепрочитанныхПисемВсего + НовыеПисьмаВПапке.НепрочитанныхПисем;
		
		ЭлементДерева = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(НовыеПисьмаВПапке.Идентификатор);
		ЭлементДерева.НепрочитанныхПисем =  НовыеПисьмаВПапке.НепрочитанныхПисем;
		ЭлементДерева.Наименование = ?(НовыеПисьмаВПапке.НепрочитанныхПисем = 0,ЭлементДерева.ПапкаНаименование,ЭлементДерева.ПапкаНаименование + "(" + Строка(НовыеПисьмаВПапке.НепрочитанныхПисем) + ")");
		
	КонецЦикла;
	
	ОбновитьЗаголовок(НепрочитанныхПисемВсего);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлектронноеПисьмоПеретаскиваниемФайла(МассивФайловИлиФайл, УчетнаяЗаписьЭлектронногоПисьма = Неопределено)
	Если ТипЗнч(МассивФайловИлиФайл) = Тип("Массив") Тогда
		МассивФайлов = МассивФайловИлиФайл;
	Иначе
		МассивФайлов = Новый Массив();
		МассивФайлов.Добавить(МассивФайловИлиФайл);
	КонецЕсли;
	
	МассивФайловДляОбработки = Новый Массив();
	Для Каждого ЭлементМассива Из МассивФайлов Цикл
		Если Не ПеретаскиваетсяФайл(ЭлементМассива) = Истина Тогда
			Продолжить;
		КонецЕсли;
		МассивФайловДляОбработки.Добавить(ЭлементМассива);
	КонецЦикла;
	
	Если МассивФайловДляОбработки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЭлектронногоПисьма) Тогда
		УчетнаяЗаписьЭлектронногоПисьма = УчетнаяЗаписьВыбранная;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	
	СписокВложений = Новый СписокЗначений();
	
	Для Каждого Файл Из МассивФайловДляОбработки Цикл
		Если ТипЗнч(Файл) = Тип("Файл") Тогда
			// это файл
			СписокВложений.Добавить(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя), УникальныйИдентификатор), Файл.Имя);
			
		Иначе
			// Это элемент справочника *ПрисоединенныеФайлы.
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(Файл, УникальныйИдентификатор, Истина);
			Если ТипЗнч(ДанныеФайла) = Тип("Структура") Тогда
				СписокВложений.Добавить(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ДанныеФайла.ИмяФайла);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОткрытия.Вставить("Вложения", СписокВложений);
	ПараметрыОткрытия.Вставить("УчетнаяЗапись", УчетнаяЗаписьЭлектронногоПисьма);
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Функция ПеретаскиваетсяФайл(ЗначениеПеретаскивания)
	Если	(ТипЗнч(ЗначениеПеретаскивания) = Тип("Файл") И ЗначениеПеретаскивания.ЭтоФайл())
		Или	(ТипЗнч(ЗначениеПеретаскивания) = Тип("Массив") И ЗначениеПеретаскивания.Количество() > 0 И ТипЗнч(ЗначениеПеретаскивания[0]) = Тип("Файл") И ЗначениеПеретаскивания[0].ЭтоФайл())
		Или КэшТипыСправочниковПрисоединенныхФайлов.СодержитТип(ТипЗнч(ЗначениеПеретаскивания))
		Или	(ТипЗнч(ЗначениеПеретаскивания) = Тип("Массив") И ЗначениеПеретаскивания.Количество() > 0 И КэшТипыСправочниковПрисоединенныхФайлов.СодержитТип(ТипЗнч(ЗначениеПеретаскивания[0]))) Тогда
		//
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(ЗначениеПеретаскивания) = Тип("ДанныеФормыЭлементДерева") Тогда
		бПеретаскиваетсяПрисоединенныйФайлСВерсионированием = Ложь;
		Попытка
			Если КэшТипыСправочниковПрисоединенныхФайлов.СодержитТип(ТипЗнч(ЗначениеПеретаскивания.Ссылка)) Тогда
				бПеретаскиваетсяПрисоединенныйФайлСВерсионированием = Истина;
			КонецЕсли;
		Исключение
			бПеретаскиваетсяПрисоединенныйФайлСВерсионированием = Ложь;
		КонецПопытки;
		Возврат бПеретаскиваетсяПрисоединенныйФайлСВерсионированием;
		
	Иначе
		Если ТипЗнч(ЗначениеПеретаскивания) = Тип("Файл") Тогда
			Если Не ЗначениеПеретаскивания.ЭтоФайл() Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(ЗначениеПеретаскивания) = Тип("Массив") И ЗначениеПеретаскивания.Количество() > 0 И ТипЗнч(ЗначениеПеретаскивания[0]) = Тип("Файл") И Не ЗначениеПеретаскивания[0].ЭтоФайл() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНапоминанияОВходящихПисьмах(МассивПисем)
	
	ОбновитьНапоминанияОВходящихПисьмах = Ложь;
	
	Для Каждого Письмо Из МассивПисем Цикл
		
		ОбновитьНапоминанияОВходящихПисьмах = ОбновитьНапоминанияОВходящихПисьмах ИЛИ CRM_НапоминанияСервер.CRM_ПроверитьНапоминанияОПисьме(Письмо);
		
	КонецЦикла;
	
	Если ОбновитьНапоминанияОВходящихПисьмах Тогда
				
		Оповестить("ОбновитьНапоминания", Новый Структура("ОбновитьНапоминанияОВходящихПисьмах", Истина));
				
	КонецЕсли;
	
КонецПроцедуры//  ПроверитьНапоминанияОВходящихПисьмах(МассивПисем)

&НаСервереБезКонтекста
Функция ПолучитьОписаниеТиповПрисоединенныхФайлов()
	МассивТипов = Новый Массив();
	Для Каждого СправочникМд Из Метаданные.Справочники Цикл
		Если Прав(СправочникМд.Имя, 19) = "ПрисоединенныеФайлы" Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка." + СправочникМд.Имя));
		КонецЕсли;
	КонецЦикла;
	Возврат Новый ОписаниеТипов(МассивТипов);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокУчетныхЗаписей(УчетныеЗаписи)
	
	// Получение доступных учетных записей.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписи.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписи.CRM_ИсточникЛидов КАК CRM_ИсточникЛидов
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК НастройкиУчетныхЗаписей
	|		ПО (НастройкиУчетныхЗаписей.УчетнаяЗапись = УчетныеЗаписи.Ссылка)
	|ГДЕ
	|	НастройкиУчетныхЗаписей.Пользователь В(&Пользователь)
	|	И НЕ УчетныеЗаписи.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УчетныеЗаписи.Ссылка,
	|	УчетныеЗаписи.CRM_ИсточникЛидов
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписи
	|ГДЕ
	|	УчетныеЗаписи.CRM_ЭтоОбщаяУчетнаяЗапись";

	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь);
	РолиПользователя.Добавить(ТекущийПользователь);
	Запрос.УстановитьПараметр("Пользователь", РолиПользователя);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	УчетныеЗаписи.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УчетныеЗаписи.Добавить(ВыборкаДетальныеЗаписи.УчетнаяЗапись);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоНовыхПисемВПапках(УчетныеЗаписи, СоответсвиеПапокИИдентификаторов) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчетныеЗаписи", УчетныеЗаписи);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПапкиЭлектронныхПисем.Ссылка КАК Ссылка,
		|	ПапкиЭлектронныхПисем.Владелец КАК Владелец,
		|	ПапкиЭлектронныхПисем.CRM_Вид КАК Вид,
		|	СУММА(ВЫБОР
		|			КОГДА CRM_НепрочитанныеЭлектронныеПисьма.Письмо ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК НепрочитанныхПисем
		|ИЗ
		|	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НепрочитанныеЭлектронныеПисьма КАК CRM_НепрочитанныеЭлектронныеПисьма
		|			ПО ПредметыПапкиВзаимодействий.Взаимодействие = CRM_НепрочитанныеЭлектронныеПисьма.Письмо
		|		ПО ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма = ПапкиЭлектронныхПисем.Ссылка
		|ГДЕ
		|	ПапкиЭлектронныхПисем.Владелец В(&УчетныеЗаписи)
		|	И ПапкиЭлектронныхПисем.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПапкиЭлектронныхПисем.Ссылка,
		|	ПапкиЭлектронныхПисем.Владелец,
		|	ПапкиЭлектронныхПисем.CRM_Вид
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПапкиЭлектронныхПисем.РеквизитДопУпорядочивания
		|ИТОГИ ПО
		|	Владелец,
		|	Ссылка ИЕРАРХИЯ";
		
	МассивРезультатов	= Новый Массив;
	МассивСсылок		= Новый Массив;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураРезультат = Новый Структура("Ссылка,НепрочитанныхПисем,Идентификатор");
		ЗаполнитьЗначенияСвойств(СтруктураРезультат,ВыборкаДетальныеЗаписи);
		СтруктураРезультат.Идентификатор = СоответсвиеПапокИИдентификаторов.Получить(ВыборкаДетальныеЗаписи.Ссылка);
		Если (СтруктураРезультат.Идентификатор = Неопределено) 
			ИЛИ НЕ (МассивСсылок.Найти(СтруктураРезультат.Ссылка) = Неопределено) Тогда Продолжить; КонецЕсли;
		МассивСсылок.Добавить(СтруктураРезультат.Ссылка);
		МассивРезультатов.Добавить(СтруктураРезультат);
		
	КонецЦикла;

	Возврат МассивРезультатов;	
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПеренестиПисьмаВПапку(Письма, Папка)
	
	Если Папка.CRM_Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные Тогда
		Для Каждого Письмо Из Письма Цикл
			ПисьмоОбъект = Письмо.ПолучитьОбъект();
			ПисьмоОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	Иначе
		Взаимодействия.УстановитьПапкуДляМассиваПисем(Письма, Папка);
	КонецЕсли;
	
КонецПроцедуры
  
&НаСервереБезКонтекста
Функция ПолучитьСсылкуНовогоДокумента()
	
	НоваяСсылка = Документы.ЭлектронноеПисьмоВходящее.ПолучитьСсылку();
	
	Возврат НоваяСсылка;
	
КонецФункции

&НаСервереБезКонтекста
// Функция загружает настройку из хранилища общих настроек.
//
// Параметры:
//   Соответствуют методу ХранилищеОбщихНастроек.Загрузить,
//   подробнее - см. параметры функции ХранилищеЗагрузить().
//
Функция ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек = "", ЗначениеПоУмолчанию = Неопределено, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено)
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию, ОписаниеНастроек, ИмяПользователя);
КонецФункции // ХранилищеОбщихНастроекЗагрузить()

&НаСервере
// Процедура сохраняет настройку в хранилище общих настроек.
// 
// Параметры:
//   Соответствуют методу ХранилищеОбщихНастроекСохранить.Сохранить, 
//   подробнее - см. параметры процедуры ХранилищеСохранить().
// 
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек = "", Значение, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено, НужноОбновитьПовторноИспользуемыеЗначения = Ложь)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, Значение, ОписаниеНастроек, ИмяПользователя, НужноОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры // ХранилищеОбщихНастроекСохранить()

&НаСервере
Функция ПолучитьТекущуюУЗ()

	мТекСтр = Элементы.ПанельУправления.ТекущаяСтрока;
	ЭлементДерева = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(мТекСтр);
	Если ЭлементДерева <> Неопределено Тогда
	
		ПараметрыФормы = Новый Структура("Ключ",ЭлементДерева.УчетнаяЗапись);
	Иначе
		ПустаяСсылка = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
		ПараметрыФормы = Новый Структура("Ключ",ПустаяСсылка);
	
	КонецЕсли; 
	
	Возврат ПараметрыФормы;
КонецФункции // ПолучитьСсылкуВыделеннойУЗ()

&НаСервере
Процедура ДобавитьСтрокуВДеревоПапок(Дерево,знач ВыборкаДетальныеЗаписи)
	
	ВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = Дерево.Строки.Добавить();
		ПапкаНаименование = ВыборкаДетальныеЗаписи.Ссылка.Наименование;
		НоваяСтрока.Наименование	= ?(ВыборкаДетальныеЗаписи.НепрочитанныхПисем>0,ПапкаНаименование+"("+Строка(ВыборкаДетальныеЗаписи.НепрочитанныхПисем)+")",ПапкаНаименование);
		НоваяСтрока.УчетнаяЗапись	= ВыборкаДетальныеЗаписи.Владелец;
		НоваяСтрока.Папка = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.ВидПапки = ВыборкаДетальныеЗаписи.Вид;
		НоваяСтрока.Подписаться = ВыборкаДетальныеЗаписи.Подписаться;
		НоваяСтрока.СинхронизироватьПапки = ВыборкаДетальныеЗаписи.СинхронизироватьПапки;
		НоваяСтрока.ПапкаНаименование =  ПапкаНаименование;
		НоваяСтрока.НепрочитанныхПисем         = ВыборкаДетальныеЗаписи.НепрочитанныхПисем;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка.Родитель) Тогда
			Если  ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Входящие Тогда
				НоваяСтрока.Картинка		= 0;
			ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Исходящие Тогда
				НоваяСтрока.Картинка		= 1;
			ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Отправленные Тогда
				НоваяСтрока.Картинка		= 2;
			ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Черновики Тогда
				НоваяСтрока.Картинка		= 3;
			ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные Тогда
				НоваяСтрока.Картинка		= 4;
			ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные Тогда
				НоваяСтрока.Картинка		= 6;
			ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта Тогда
				НоваяСтрока.Картинка		= 7;
			Иначе
				НоваяСтрока.Картинка		= 8;
			КонецЕсли;
		Иначе
			НоваяСтрока.Картинка		= 8;
		КонецЕсли;
	
		ДобавитьСтрокуВДеревоПапок(НоваяСтрока,ВыборкаДетальныеЗаписи);
		// Вставить обработку выборки ВыборкаДетальныеЗаписи.
	КонецЦикла;
		
КонецПроцедуры	

&НаСервере
Функция УбратьОшибкиИтоговПоИерархии(Строки, Поле="Папка", Родитель=Неопределено)
    // Убираем все элементы, равные текущему.
    Всего=Строки.Количество();
    Для Инд=1 По Всего Цикл
        Стр=Строки[Всего-Инд];
        Зн=Стр[Поле];
        Если Родитель<>Неопределено И Зн=Родитель Тогда
            Строки.Удалить(Стр);
        Иначе
            УбратьОшибкиИтоговПоИерархии(Стр.Строки, Поле, Зн);
        КонецЕсли;
    КонецЦикла;
КонецФункции

&НаСервере
Функция СоздатьПисьмо(УчетнаяЗаписьСсылка) 
	
	Результат = "";
	
	Если НЕ УчетнаяЗаписьСсылка.ИспользоватьДляОтправки Тогда
		Результат = НСтр("ru='Учетная запись не предназначена для отправки писем';en='Login account is not intended for sending of letters'");
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьНаВозможностьОтправкиПисьма(УчетнаяЗаписьСсылка) 
	
	Если НЕ УчетнаяЗаписьСсылка.ИспользоватьДляОтправки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПустоеОписание()
	Возврат
	"<html>
	|<head>  
	|<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
	|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
	|<body scroll=""auto"">
	|</body>
	|</html>";
КонецФункции

&НаСервере
Функция СформироватьОписаниеТекущегоПисьма(ПисьмоСсылка)
	
	ВложенияОчищеныПоНастройке = Ложь;
	
	СтруктураОписания = Новый Структура;
	
	// Проверим доступность письма по RLS.
	Попытка
		СсылкаДоступна = ПисьмоСсылка.Дата;
	Исключение
	    // письмо не доступно
		
		Начало = "
		|<html>
		|<head>  
		|<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
		|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
		|<body scroll=""auto"">";
		
		Описание = НСтр("ru='Письмо не доступно данному пользователю из-за ограничения прав доступа!';en='A letter is not available to this user because of restricted access rights!'");
		
		Конец = "
		|</body>
		|</html>";
		
		Текст = Начало + Описание + Конец;
		
		СтруктураОписания.Вставить("Тело", Текст);
		СтруктураОписания.Вставить("От",   "");
		СтруктураОписания.Вставить("Кому", "");
		СтруктураОписания.Вставить("Тема", "");
		
		Возврат СтруктураОписания;
		
	КонецПопытки;
	
	Если ПисьмоСсылка = Неопределено Или ТипЗнч(ПисьмоСсылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Предмет = Взаимодействия.ПолучитьЗначениеПредмета(ПисьмоСсылка);
	ЭтоПисьмоРассылки = (ТипЗнч(ПисьмоСсылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
						И ЗначениеЗаполнено(Предмет)
						И ТипЗнч(Предмет) = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем"));
	
	Если ПисьмоСсылка.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст Тогда
		ДокументHTML	= Взаимодействия.ПолучитьДокументHTMLИзОбычногоТекста(ПисьмоСсылка.Текст);
		Текст			= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
	Иначе
		Текст = CRM_Взаимодействия.CRM_ОбработатьТекстHTML(ПисьмоСсылка, УникальныйИдентификатор,ЭтоПисьмоРассылки);
	КонецЕсли;
	
	Если ЭтоПисьмоРассылки И НЕ ПисьмоСсылка.CRM_РазрешеноРедактирование Тогда
		табВложения = CRM_УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(Предмет);
	Иначе
		табВложения = CRM_УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(ПисьмоСсылка);
	КонецЕсли;
	
	Вложения.Очистить();
	Для Каждого Стр Из табВложения Цикл
		НовСтр 										= Вложения.Добавить();
		НовСтр.Ссылка         						= Стр.Ссылка;
		НовСтр.ИмяФайла       						= Стр.ИмяФайла;
		НовСтр.ИндексКартинки 						= Стр.ИндексКартинки;
		НовСтр.Размер        						= Стр.Размер;
		РазмерВложения								= Цел(Стр.Размер/1024);
		НовСтр.РазмерСтрокой   						= ?(РазмерВложения > 0, Строка(РазмерВложения) + " кб", Строка(Стр.Размер) + " байт");
		НовСтр.Расположение  						= 0;
		// НовСтр.ИДФайлаЭлектронногоПисьмаОтбор	= Стр.ИДФайлаЭлектронногоПисьмаОтбор;
		НовСтр.ИДФайлаЭлектронногоПисьмаОтбор = ?(Стр.ИДФайлаЭлектронногоПисьма = "", "#", Стр.ИДФайлаЭлектронногоПисьма);
		НовСтр.ИДФайлаЭлектронногоПисьма = ?(Стр.ИДФайлаЭлектронногоПисьма = "", "#", Стр.ИДФайлаЭлектронногоПисьма);
		
		Если Не ВложенияОчищеныПоНастройке И Стр.ОчищенПоНастройке Тогда
			ВложенияОчищеныПоНастройке = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(ПисьмоСсылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Для Каждого УдаленноеВложение Из ПисьмоСсылка.НепринятыеВложения Цикл
			НовоеВложение = Вложения.Добавить();
			НовоеВложение.ИмяФайла = УдаленноеВложение.ИмяВложение;
			НовоеВложение.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(".msg") + 1;
			НовоеВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#";
			НовоеВложение.ИДФайлаЭлектронногоПисьма = "#";
		КонецЦикла;
	КонецЕсли;
	
	Вложения.Сортировать("ИДФайлаЭлектронногоПисьмаОтбор");
	
	Описание = "";
	//
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПисьмоСсылка));
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураОписания.Вставить("Тело", Текст);
	СтруктураОписания.Вставить("От", ПисьмоСсылка.ОтправительПредставление);
	СтруктураОписания.Вставить("Кому", ПисьмоСсылка.СписокПолучателейПисьма);
	СтруктураОписания.Вставить("Тема", ПисьмоСсылка.Тема);
	
	Возврат СтруктураОписания;
	
КонецФункции

#Область ОбработчикиСобытийФормы

&НаКлиенте
Функция ДеревоНайтиСтрокуПоСвойству(Дерево,СтруктураОтбора)
	
	НомерСтроки = Неопределено;
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого Элемент Из ЭлементыДерева Цикл
		
		Для каждого Отбор Из СтруктураОтбора Цикл
			ЗначениеСвойстваДерева = Неопределено;
			Найдено = Элемент.Свойство(Отбор.Ключ,ЗначениеСвойстваДерева);
			НомерСтроки = Элемент.ПолучитьИдентификатор();
			Если Найдено И ЗначениеСвойстваДерева = Отбор.Значение Тогда
				Возврат НомерСтроки;
			КонецЕсли;
			
		КонецЦикла;
		НомерСтроки = ДеревоНайтиСтрокуПоСвойству(Элемент,СтруктураОтбора);
		Если НомерСтроки <> Неопределено Тогда
			Возврат НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерСтроки;
КонецФункции

&НаСервереБезКонтекста
Функция СправочникНайтиПоНаименованию(ИмяСправочника, Наименование, Владелец = Неопределено)
	Ссылка = Неопределено;
	Попытка
		Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(Наименование,,,Владелец);
	Исключение КонецПопытки;
	Возврат Ссылка;
КонецФункции 
 
&НаСервере
Процедура УстановитьУО()

	Запрос = Новый Запрос;
	
	Запрос.Текст =	"ВЫБРАТЬ
					|	CRM_Теги.Ссылка
					|ИЗ
					|	Справочник.CRM_Теги КАК CRM_Теги"; 
					
	Выборка = Запрос.Выполнить().Выбрать();				
					
	Пока Выборка.Следующий() Цикл
	
		ЭлементОформления1 = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления1.Использование = Истина;
		
		ЭлементОтбораТег1 = ЭлементОформления1.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбораТег1.Использование = Истина;		
        ЭлементОтбораТег1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокПисем.Тег1");
        ЭлементОтбораТег1.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
        ЭлементОтбораТег1.ПравоеЗначение = Выборка.Ссылка;
		
		Элемент1 = ЭлементОформления1.Оформление.Элементы[0];
		
		ЦветТега = ЦветаСтиля.CRM_ОсновнойГолубой;

		ЭлементОформления1.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветТега);
		Элемент1.Использование = Истина;
		
		ПолеОформления1 = ЭлементОформления1.Поля.Элементы.Добавить();
		ПолеОформления1.Поле = Новый ПолеКомпоновкиДанных("СписокПисемТег1");
		ПолеОформления1.Использование = Истина;		
		
		ЭлементОформления2 = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбораТег2 = ЭлементОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбораТег2.Использование = Истина;		
        ЭлементОтбораТег2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокПисем.Тег2");
        ЭлементОтбораТег2.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
        ЭлементОтбораТег2.ПравоеЗначение = Выборка.Ссылка;
		
		Элемент2 = ЭлементОформления2.Оформление.Элементы[0];
		
		ЭлементОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветТега);
		Элемент2.Использование = Истина;
		
		ПолеОформления2 = ЭлементОформления2.Поля.Элементы.Добавить();
		ПолеОформления2.Поле = Новый ПолеКомпоновкиДанных("СписокПисемТег2");
		ПолеОформления2.Использование = Истина;		
		
		ЭлементОформления3 = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбораТег3 = ЭлементОформления3.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбораТег3.Использование = Истина;		
        ЭлементОтбораТег3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокПисем.Тег3");
        ЭлементОтбораТег3.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
        ЭлементОтбораТег3.ПравоеЗначение = Выборка.Ссылка;
		
		Элемент3 = ЭлементОформления3.Оформление.Элементы[0];
		
		ЭлементОформления3.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветТега);
		Элемент3.Использование = Истина;
		
		ПолеОформления3 = ЭлементОформления3.Поля.Элементы.Добавить();
		ПолеОформления3.Поле = Новый ПолеКомпоновкиДанных("СписокПисемТег3");
		ПолеОформления3.Использование = Истина;		
			
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУчетныхЗаписей()
	// заполнение дерева папок
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПапкиЭлектронныхПисем.Ссылка КАК Ссылка,
		|	ПапкиЭлектронныхПисем.Владелец КАК Владелец,
		|	ПапкиЭлектронныхПисем.CRM_Вид КАК Вид,
		|	СУММА(ВЫБОР
		|			КОГДА CRM_НепрочитанныеЭлектронныеПисьма.Письмо ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК НепрочитанныхПисем,
		|	ПапкиЭлектронныхПисем.Владелец.CRM_СинхронизироватьПапкиСПочтовымСервером
		|			И (ПапкиЭлектронныхПисем.CRM_Подписаться
		|				ИЛИ ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие))
		|		ИЛИ НЕ ПапкиЭлектронныхПисем.Владелец.CRM_СинхронизироватьПапкиСПочтовымСервером КАК Подписаться,
		|	ПапкиЭлектронныхПисем.Владелец.CRM_СинхронизироватьПапкиСПочтовымСервером КАК СинхронизироватьПапки
		|ИЗ
		|	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НепрочитанныеЭлектронныеПисьма КАК CRM_НепрочитанныеЭлектронныеПисьма
		|			ПО ПредметыПапкиВзаимодействий.Взаимодействие = CRM_НепрочитанныеЭлектронныеПисьма.Письмо
		|		ПО (ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма = ПапкиЭлектронныхПисем.Ссылка)
		|ГДЕ
		|	ПапкиЭлектронныхПисем.Владелец В(&УчетныеЗаписи)
		|	И ПапкиЭлектронныхПисем.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ПапкиЭлектронныхПисем.Владелец.CRM_ОтображатьТолькоПодписанныеПапки
		|				ТОГДА ПапкиЭлектронныхПисем.CRM_Подписаться
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПапкиЭлектронныхПисем.Ссылка,
		|	ПапкиЭлектронныхПисем.Владелец,
		|	ПапкиЭлектронныхПисем.CRM_Вид,
		|	ПапкиЭлектронныхПисем.Владелец.CRM_СинхронизироватьПапкиСПочтовымСервером
		|			И (ПапкиЭлектронныхПисем.CRM_Подписаться
		|				ИЛИ ПапкиЭлектронныхПисем.ПредопределеннаяПапка)
		|		ИЛИ НЕ ПапкиЭлектронныхПисем.Владелец.CRM_СинхронизироватьПапкиСПочтовымСервером,
		|	ПапкиЭлектронныхПисем.Владелец.CRM_СинхронизироватьПапкиСПочтовымСервером
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПапкиЭлектронныхПисем.Владелец.Наименование,
		|	ПапкиЭлектронныхПисем.РеквизитДопУпорядочивания
		|ИТОГИ ПО
		|	Владелец,
		|	Ссылка ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("УчетныеЗаписи", УчетныеЗаписи);

	Результат = Запрос.Выполнить();
	
	Дерево = РеквизитФормыВЗначение("ДеревоУчетныхЗаписей");
	Дерево.Строки.Очистить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаУЗ = Дерево.Строки.Добавить();
		СтрокаУЗ.Наименование	= ВыборкаДетальныеЗаписи.Владелец.Наименование;
		СтрокаУЗ.УчетнаяЗапись	= ВыборкаДетальныеЗаписи.Владелец;
		СтрокаУЗ.Картинка		= -1;
		СтрокаУЗ.Подписаться = Истина;
		СтрокаУЗ.СинхронизироватьПапки = ВыборкаДетальныеЗаписи.СинхронизироватьПапки;
		
		ДобавитьСтрокуВДеревоПапок(СтрокаУЗ,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	// Удалим дубли строк (ошибка платформы).
	УбратьОшибкиИтоговПоИерархии(Дерево.Строки);
	
	ЗначениеВДанныеФормы(Дерево, ДеревоУчетныхЗаписей);
	
	НетУчетныхЗаписей = (Дерево.Строки.Количество() = 0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуСправочникаПоИдентификатору(ИмяСправочника, Идентификатор)
	Возврат Справочники[ИмяСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
КонецФункции

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

#Область ПроцедурыОбработчикиСобытийОстальныхЭлементовУправленияФормы

&НаКлиенте
Процедура ПанельУправленияПриАктивизацииСтроки(Элемент)
	
	Если ПанельУправленияТекущаяСтрока = Элементы.ПанельУправления.ТекущаяСтрока Тогда
		Возврат;
	Иначе
		ПанельУправленияТекущаяСтрока = Элементы.ПанельУправления.ТекущаяСтрока;
	КонецЕсли;
	
	ТекущееПисьмо = Неопределено;
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
	
		Если ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Удаленные") ИЛИ ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта") Тогда
			Элементы.ПанельУправленияКонтекстноеМенюОчиститьПапку.Видимость = Истина;
		Иначе
			Элементы.ПанельУправленияКонтекстноеМенюОчиститьПапку.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ПанельУправленияКонтекстноеМенюНастройкаСинхронизацииПапок.Видимость = ТекущиеДанные.СинхронизироватьПапки;
		Элементы.ПанельУправленияКонтекстноеМенюРедактироватьПапку.Видимость = ЗначениеЗаполнено(ТекущиеДанные.Папка)
																				И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидПапки);
																				
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПанельУправленияПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельУправленияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;    
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") И Не ПеретаскиваетсяФайл(ПараметрыПеретаскивания.Значение) = Истина Тогда
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
		
	Иначе	
		
		СтрокаНазначение = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(Строка);
		
		Если НЕ ЗначениеЗаполнено(СтрокаНазначение.Папка) Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
			Возврат;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельУправленияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ЭтоПеретаскиваетсяФайл = ПеретаскиваетсяФайл(ПараметрыПеретаскивания.Значение);
	
	Если ЭтоПеретаскиваетсяФайл = Истина Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
		
		Если Строка <> Неопределено Тогда
			// Создание нового письма с присоедненным файлом.
			СтрокаПеретаскивания = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(Строка);
			Если СтрокаПеретаскивания <> Неопределено Тогда
				СоздатьЭлектронноеПисьмоПеретаскиваниемФайла(ПараметрыПеретаскивания.Значение, СтрокаПеретаскивания.УчетнаяЗапись);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(УчетнаяЗаписьВыбранная) Тогда
			СоздатьЭлектронноеПисьмоПеретаскиваниемФайла(ПараметрыПеретаскивания.Значение, УчетнаяЗаписьВыбранная);
		КонецЕсли;
		
	ИначеЕсли ЭтоПеретаскиваетсяФайл = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
		
	Иначе
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.НеОбрабатывать;
		Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") И ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
			Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") И 
				ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")  Тогда
				Возврат;
			КонецЕсли;
			
			ПапкаНазначения = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(Строка);
			ПодготовитьПеремещениеПисем(ПапкаНазначения, ПараметрыПеретаскивания.Значение); 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПеремещениеПисем(ПапкаНазначения, МассивПисем)
	
	ТекущийПользовательРазрешенаЗапись = CRM_УправлениеЭлектроннойПочтой.ТекущийПользовательПолучитьПравоУчетнойЗаписи(ПапкаНазначения.УчетнаяЗапись, "Запись");
	Если ПапкаНазначения.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие") ИЛИ ПапкаНазначения.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные") Тогда
		Возврат;
	ИначеЕсли ПапкаНазначения.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики") Тогда
		СообщениеОФильтрацииМассива = НСтр("ru = 'Перемещение в Черновики невозможно для входящего письма с темой ""%1""'");
		МассивПисем = УдалитьИзМассиваОбъектыТипа(МассивПисем, Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"), СообщениеОФильтрацииМассива);
		Если МассивПисем.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийПользовательРазрешенаЗапись Тогда
		
		УчетнаяЗаписьПисьма = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(МассивПисем[0], "УчетнаяЗапись");
		Если УчетнаяЗаписьПисьма<>ПапкаНазначения.УчетнаяЗапись Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Перетаскивать письма можно только в рамках одной учетной записи!';en='You can only drag and drop emails within the same account!'"));
			Возврат;
		КонецЕсли;
		
		ЕстьЛиды = ЕстьЛидыВВыбранныхСтроках(Ложь);
		ЕстьЛидыСУказаниемПричиныОтклонения = ЕстьЛидыВВыбранныхСтроках(Истина);
		
		ПараметрыОбработкиПеремещения = Новый Структура;
		ПараметрыОбработкиПеремещения.Вставить("МассивСсылок", МассивПисем);
		ПараметрыОбработкиПеремещения.Вставить("Папка", ПапкаНазначения.Папка);
		ПараметрыОбработкиПеремещения.Вставить("ВидПапки", ПапкаНазначения.ВидПапки);
		
		Если ЕстьЛиды И ПапкаНазначения.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные") Тогда
			Если ЕстьЛидыСУказаниемПричиныОтклонения Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ПанельУправленияПеретаскиваниеЗавершение", ЭтотОбъект, ПараметрыОбработкиПеремещения);
				ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", , ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе	
				ПанельУправленияПеретаскиваниеЗавершение(Истина, ПараметрыОбработкиПеремещения);
			КонецЕсли;
		Иначе
			ПанельУправленияПеретаскиваниеЗавершение(Ложь, ПараметрыОбработкиПеремещения);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Недостаточно прав для работы с письмами данной учетной записи!"
"Для текущего пользователя должно быть установлено право ""Отправка""';en='Insufficient rights to work with emails to this account!"
"For current user must be set right ""Send""'"));
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИзМассиваОбъектыТипа(МассивОбъектов, Тип, ТекстСообщения = "")
	
	ОставленныеОбъекты = Новый Массив;
	
	Для Каждого ЭлементОбъект Из МассивОбъектов Цикл
		Если ТипЗнч(ЭлементОбъект) = Тип Тогда
			ОставленныеОбъекты.Добавить(ЭлементОбъект);
		Иначе
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОставленныеОбъекты;
	
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьИзМассиваОбъектыТипа(МассивОбъектов, Тип, ШаблонСообщения = "")
	
	ОставленныеОбъекты = Новый Массив;
	
	Для Каждого ЭлементОбъект Из МассивОбъектов Цикл
		Если ТипЗнч(ЭлементОбъект) = Тип Тогда
			Если ЗначениеЗаполнено(ШаблонСообщения) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ЭлементОбъект.Тема);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ОставленныеОбъекты.Добавить(ЭлементОбъект);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОставленныеОбъекты;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИзМассиваОбращенияСостояния(Знач МассивОбъектов, Состояние, ШаблонСообщения = "")
	
	СостоянияЛидов = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛидов(МассивОбъектов);
	
	ОставленныеОбъекты = Новый Массив;
	
	Для Каждого ЭлементОбъект Из МассивОбъектов Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Лид", ЭлементОбъект);
		
		Строки = СостоянияЛидов.НайтиСтроки(Отбор);
		
		Если Строки.Количество() > 0 Тогда
			
			Если Строки[0].Состояние = Состояние Тогда
				
				ОставленныеОбъекты.Добавить(ЭлементОбъект);
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШаблонСообщения) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ЭлементОбъект.Тема);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОставленныеОбъекты;
	
КонецФункции

&НаКлиенте
Процедура ПанельУправленияПеретаскиваниеЗавершение(Результат, ДопПараметры) Экспорт
	
	ОбработатьИзменениеПапки(Результат, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПапки(Результат, ДопПараметры)
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("ПричинаОтказа")
			И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
		МассивЛидов = ПолучитьИзМассиваОбращенияСостояния(ДопПараметры.МассивСсылок, ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Новый"));
		ОтклонитьОбращениеНаСервере(МассивЛидов, Результат.ПричинаОтказа, Результат.Комментарий);
	ИначеЕсли Результат Тогда
		МассивЛидов = ПолучитьИзМассиваОбращенияСостояния(ДопПараметры.МассивСсылок, ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Новый"));
		ОтклонитьОбращениеНаСервере(МассивЛидов, Неопределено, "");
	КонецЕсли;
	
	// Флаг не передан, либо он равен Истина:
	Если НЕ ДопПараметры.Свойство("ПереноситьПисьмаВОбработанные") ИЛИ ДопПараметры.ПереноситьПисьмаВОбработанные Тогда
		ПеренестиПисьмаВПапку(ДопПараметры.МассивСсылок,ДопПараметры.Папка);
	КонецЕсли;
		
	МассивВходящихПисем = ПолучитьИзМассиваОбъектыТипа(ДопПараметры.МассивСсылок, Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));				
	
	Если ДопПараметры.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные") Тогда			
		УстановитьСнятьПометкуОПрочтении(МассивВходящихПисем, Истина);
	КонецЕсли;
	
	ПроверитьНапоминанияОВходящихПисьмах(МассивВходящихПисем);
	
	Элементы.СписокПисем.Обновить();
	ОбновитьКоличествоНовыхПисемВПапках();
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьОбращениеНаСервере(МассивСсылок, ПричинаОтказа, Комментарий)
	Для каждого Ссылка Из МассивСсылок Цикл
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Ссылка, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа, Комментарий);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьПометкуОПрочтении(ВыделенныеПисьма, УстановитьПометку = Ложь)
	
	CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(ВыделенныеПисьма, УстановитьПометку);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьСкрытьВсеВложения()
	
	СформироватьСсылкиВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	РасширениеВложения = ДополнительныеПараметры.РасширениеВложения;
	текДанные = ДополнительныеПараметры.текДанные;
		
	Если Подключено Тогда
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ВыборФайла.МножественныйВыбор = Ложь;
		ВыборФайла.ПолноеИмяФайла = текДанные.ИмяФайла;
		ВыборФайла.Расширение = РасширениеВложения;
		ВыборФайла.Фильтр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Все файлы (*.%1)|*.%1'"), РасширениеВложения, РасширениеВложения);
		СтруктураДанных = Новый Структура("ВыборФайла, текДанные", ВыборФайла, текДанные);
		ОповещениеНовое = Новый ОписаниеОповещения("СохранитьВложениеЗавершениеВыборФайла", ЭтотОбъект, СтруктураДанных);
		ВыборФайла.Показать(ОповещениеНовое);
	Иначе
		#Если ВебКлиент Тогда
			ПолучитьФайл(текДанные.ИмяФайлаНаКомпьютере, текДанные.ИмяФайла, Истина);
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеЗавершениеВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры1) Экспорт
	
	ВыборФайла = ДополнительныеПараметры1.ВыборФайла;
	текДанные = ДополнительныеПараметры1.текДанные;
		
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполняется сохранение файла ""%1"" ..."
"Пожалуйста, подождите.'"), текДанные.ИмяФайла);
		Состояние(ТекстПояснения);
		ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(ВыборФайла.ПолноеИмяФайла, текДанные.ИмяФайлаНаКомпьютере);
		ПолучаемыеФайлы = Новый Массив;
		ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
		ПолученныеФайлы = Новый Массив;
		СтруктураДанных = Новый Структура("ВыборФайла", ВыборФайла);
		ОповещениеНовое = Новый ОписаниеОповещения("СохранитьВложениеЗавершениеПолучитьФайлы", ЭтотОбъект, СтруктураДанных);
		НачатьПолучениеФайлов(ОповещениеНовое,ПолучаемыеФайлы, ВыборФайла, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеЗавершениеПолучитьФайлы(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	ВыборФайла = ДополнительныеПараметры.ВыборФайла;
		
	Если ПолученныеФайлы.Количество() > 0 Тогда
		Состояние(НСтр("ru='Файл успешно сохранен'"), , ВыборФайла.ПолноеИмяФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложения()
	ВыделенныеВложения = Новый Массив;
	КоличествоВложений = Вложения.Количество();
	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(Неопределено);
	СтруктураДанных = Новый Структура("ВыделенныеВложения, КоличествоВложений, ТолькоВыделенные", 
		ВыделенныеВложения, КоличествоВложений, Ложь);
	Оповещение = Новый ОписаниеОповещения("СохранитьВложенияПодключеноРасширение", ЭтотОбъект, СтруктураДанных);
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияПодключеноРасширение(Подключено, ДополнительныеПараметры) Экспорт
	
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТолькоВыделенные = ДополнительныеПараметры.ТолькоВыделенные;
		
	Если Подключено Тогда
		КаталогСохранения = ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПапкаДляСохранитьКак");
		Если НЕ ЗначениеЗаполнено(КаталогСохранения) Тогда
			КаталогСохранения = "";
			КаталогСохранения = РаботаСФайламиСлужебныйКлиент.КаталогВыгрузки();
		КонецЕсли;
		ВыборКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ВыборКаталога.МножественныйВыбор = Ложь;
		ВыборКаталога.Каталог = КаталогСохранения;
		ДополнительныеПараметры.Вставить("ВыборКаталога", ВыборКаталога);
		ДополнительныеПараметры.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);
		Оповещение = Новый ОписаниеОповещения("СохранитьВложенияПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
		ВыборКаталога.Показать(Оповещение);
        Возврат;
	Иначе
		#Если ВебКлиент Тогда
			Для НомерВложения = 0 По КоличествоВложений Цикл
				Если ТолькоВыделенные Тогда
					Если ВыделенныеВложения.Найти(НомерВложения) = Неопределено Тогда Продолжить; КонецЕсли;
				КонецЕсли;	
				ТекущееВложение = Вложения[НомерВложения];
				// Разрешаем сохранять картинки, вставленные в текст письма через вставку картинки, а также через интернет.
				// Если НЕ (ТекущееВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#") Тогда Продолжить; КонецЕсли;
				// 
				ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущееВложение.Ссылка, УникальныйИдентификатор);
				РасширениеВложения = ВРег(СокрЛП(ДанныеФайла.Расширение));
				Если РасширениеВложения = "EML" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
					Продолжить;
				КонецЕсли;
				ПолучитьФайл(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ДанныеФайла.ИмяФайла, Истина);
			КонецЦикла;	
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ВыборКаталога = ДополнительныеПараметры.ВыборКаталога;
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТолькоВыделенные = ДополнительныеПараметры.ТолькоВыделенные;
	ПроверкаСуществованияФайлов = ДополнительныеПараметры.ПроверкаСуществованияФайлов;
		
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда Возврат; КонецЕсли;
	КаталогСохранения = ВыборКаталога.Каталог;
	Если НЕ ЗначениеЗаполнено(КаталогСохранения) Тогда Возврат; КонецЕсли;
	Если НЕ (Прав(КаталогСохранения, 1) = "\") Тогда
		КаталогСохранения = КаталогСохранения + "\";
	КонецЕсли;
	
	Если ПроверкаСуществованияФайлов Тогда
		ДополнительныеПараметры.Вставить("КаталогСохранения", КаталогСохранения);
		ДополнительныеПараметры.Вставить("ТекущийНомерВложения", 0);
		ПроверитьНаличиеФайловНаДиске(ВыбранныеФайлы, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;		
	
	ПерезаписатьВсе		= ?(ДополнительныеПараметры.Свойство("ПерезаписатьВсе"),ДополнительныеПараметры.ПерезаписатьВсе, Ложь);
	ПереименоватьВсе	= ?(ДополнительныеПараметры.Свойство("ПереименоватьВсе"),ДополнительныеПараметры.ПереименоватьВсе, Ложь);
	Если ДополнительныеПараметры.Свойство("ТекущийНомерВложения") Тогда
		ТекущийНомерВложения = ДополнительныеПараметры.ТекущийНомерВложения + 1;
	Иначе 
		ТекущийНомерВложения = 0;
	КонецЕсли;
	Если ТекущийНомерВложения <= КоличествоВложений - 1 Тогда			
		Если ТолькоВыделенные Тогда
			Если ВыделенныеВложения.Найти(ТекущийНомерВложения) = Неопределено Тогда Возврат; КонецЕсли;
		КонецЕсли;	
		ТекущееВложение = Вложения[ТекущийНомерВложения];
		Если НЕ ЗначениеЗаполнено(ТекущееВложение.Ссылка) Тогда 						
			// Разрешаем сохранять картинки, вставленные в текст письма через вставку картинки, а также через интернет.
			// Если НЕ (ТекущееВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#") Тогда Продолжить; КонецЕсли;
			// 
			Если ТекущееВложение.Расположение = 4 Тогда
				ДанныеФайла = ТекущееВложение.ИмяФайлаНаКомпьютере;
				Файл = Новый Файл(ТекущееВложение.ИмяФайла);				
				РасширениеВложения = ВРег(СокрЛП(Файл.Расширение));
				Если РасширениеВложения = ".EML" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
					Возврат;
				КонецЕсли;
				ДополнительныеПараметры.Вставить("РазмерФайла", ТекущееВложение.Размер);
				ДополнительныеПараметры.Вставить("ДанныеФайла", ТекущееВложение.ИмяФайлаНаКомпьютере);												
			КонецЕсли;	
		Иначе
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущееВложение.Ссылка, УникальныйИдентификатор);
			РасширениеВложения = ВРег(СокрЛП(ДанныеФайла.Расширение));
			Если РасширениеВложения = "EML" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
				Возврат;
			КонецЕсли;	
			ДополнительныеПараметры.Вставить("ДанныеФайла", ДанныеФайла);							
		КонецЕсли;
		ПолноеИмяФайла = КаталогСохранения + ТекущееВложение.ИмяФайла;
		
		// Проверяем файл на существование, и, если он существует, то выбираем дальнейшее действие.
		ДополнительныеПараметры.Вставить("КаталогСохранения", КаталогСохранения);
		ДополнительныеПараметры.Вставить("ПерезаписатьВсе",   ПерезаписатьВсе);
		ДополнительныеПараметры.Вставить("ПереименоватьВсе",  ПереименоватьВсе);
		ДополнительныеПараметры.Вставить("ПолноеИмяФайла",    ПолноеИмяФайла);		
		ДополнительныеПараметры.Вставить("ВыбранныеФайлы",    ВыбранныеФайлы);				
		Оповещение = Новый ОписаниеОповещения("ФайлПослеИнициализации", ЭтотОбъект, ДополнительныеПараметры); 		
		Файл = Новый Файл();
		Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеФайловНаДиске(ВыбранныеФайлы, ДополнительныеПараметры)
	
	КаталогСохранения = ДополнительныеПараметры.КаталогСохранения;
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТекущийНомерВложения = ДополнительныеПараметры.ТекущийНомерВложения;
	Если ТекущийНомерВложения <= КоличествоВложений - 1 Тогда			
		ТекущееВложение = Вложения[ТекущийНомерВложения];
		Если НЕ ЗначениеЗаполнено(ТекущееВложение.Ссылка) Тогда 
			Если ТекущееВложение.Расположение = 4 Тогда 
				ПолноеИмяФайла = КаталогСохранения + ТекущееВложение.ИмяФайла;
				Файл = Новый Файл(ПолноеИмяФайла);				
				РасширениеВложения = ВРег(СокрЛП(Файл.Расширение));
				Если РасширениеВложения = ".EML" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
					Возврат;
				КонецЕсли;
				ДополнительныеПараметры.Вставить("ПолноеИмяФайла",    ПолноеИмяФайла);
				ДополнительныеПараметры.Вставить("ДанныеФайла",       ТекущееВложение.ИмяФайлаНаКомпьютере);								
				ДополнительныеПараметры.Вставить("ВыбранныеФайлы",    ВыбранныеФайлы);						
				Оповещение = Новый ОписаниеОповещения("ФайлПроверитьПослеИнициализации", ЭтотОбъект, ДополнительныеПараметры); 		
				Файл = Новый Файл();
				Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);						
				Возврат;
			Иначе				
				Возврат; 
			КонецЕсли;				
		КонецЕсли;						
		// Если картинка из текста письма, то ее пропускаем.
		// Разрешаем сохранять картинки, вставленные в текст письма через вставку картинки, а также через интернет.
		// Если НЕ (ТекущееВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#") Тогда Продолжить; КонецЕсли;
		// 			
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущееВложение.Ссылка, УникальныйИдентификатор);
		РасширениеВложения = ВРег(СокрЛП(ДанныеФайла.Расширение));		
		ПолноеИмяФайла = КаталогСохранения + ТекущееВложение.ИмяФайла;
		ДополнительныеПараметры.Вставить("ПолноеИмяФайла",    ПолноеИмяФайла);		
		ДополнительныеПараметры.Вставить("ДанныеФайла",       ДанныеФайла);				
		ДополнительныеПараметры.Вставить("ВыбранныеФайлы",    ВыбранныеФайлы);						
		Оповещение = Новый ОписаниеОповещения("ФайлПроверитьПослеИнициализации", ЭтотОбъект, ДополнительныеПараметры); 		
		Файл = Новый Файл();
		Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);		
	Иначе
		ПроверкаСуществованияФайлов = Ложь;
		ДополнительныеПараметры.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);		
		ДополнительныеПараметры.Удалить("ТекущийНомерВложения");
		СохранитьВложенияПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлПроверитьПослеИнициализации(Файл, ПараметрыВложения) Экспорт
	 ФайлПроверитьНаСуществование(Файл, ПараметрыВложения);
КонецПроцедуры	

&НаКлиенте
Процедура ФайлПроверитьНаСуществование(Файл, ПараметрыВложения)
	ПараметрыВложения.Вставить("Файл", Файл);				
	Оповещение = Новый ОписаниеОповещения("ПроверкаНаСуществованиеФайлаДляВопроса", ЭтотОбъект, ПараметрыВложения);
	Файл.НачатьПроверкуСуществования(Оповещение);
КонецПроцедуры	

&НаКлиенте
Процедура ПроверкаНаСуществованиеФайлаДляВопроса(Существует, ПараметрыВложения) Экспорт
	Если Существует Тогда
		ПроверкаСуществованияФайлов = Ложь;
		ПараметрыВложения.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);
		СохранитьВложенияВопрос(ПараметрыВложения);
		ПараметрыВложения.Удалить("ТекущийНомерВложения");
		Возврат;
	ИначеЕсли ПараметрыВложения.ТекущийНомерВложения = ПараметрыВложения.КоличествоВложений Тогда
		ПроверкаСуществованияФайлов = Ложь;
		ПараметрыВложения.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);
		ПараметрыВложения.Удалить("ТекущийНомерВложения");
		СохранитьВложенияПослеВыбораКаталога(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения);
	Иначе		
		ПараметрыВложения.Вставить("ТекущийНомерВложения", ПараметрыВложения.ТекущийНомерВложения + 1);
		ПроверитьНаличиеФайловНаДиске(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения)
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ФайлПослеИнициализации(Файл, ПараметрыВложения) Экспорт
	СохранитьВложенияПослеВыбораКаталогаФрагмент(Файл, ПараметрыВложения);
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияПослеВыбораКаталогаФрагмент(Файл, ПараметрыВложения)
	
	ПараметрыВложения.Вставить("Файл", Файл);				
	Оповещение = Новый ОписаниеОповещения("ПроверкаНаСуществованиеФайла", ЭтотОбъект, ПараметрыВложения);
	Файл.НачатьПроверкуСуществования(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНаСуществованиеФайла(Существует, ПараметрыВложения) Экспорт
	
	Если Существует Тогда
		СохранитьВложенияПослеВыбораКаталогаФрагментУсловие(ПараметрыВложения);				
	Иначе
		ПослеУдаленияПереименованияФайла(ПараметрыВложения);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияПослеВыбораКаталогаФрагментУсловие(ПараметрыВложения)
		
	Если ПараметрыВложения.ПерезаписатьВсе Тогда
		Оповещение = Новый ОписаниеОповещения("УстановкаТолькоЧтенияУФайла", ЭтотОбъект, ПараметрыВложения);
		Файл = ПараметрыВложения.Файл;
		Файл.НачатьУстановкуТолькоЧтения(Оповещение, Ложь);
	ИначеЕсли ПараметрыВложения.ПереименоватьВсе Тогда
		НомерПоПорядку		= "";
		ИмяБезРасширения	= ПараметрыВложения.Файл.ИмяБезРасширения;
		Расширение			= ПараметрыВложения.Файл.Расширение;
		ПараметрыВложения.Вставить("НомерПоПорядку", НомерПоПорядку);
		ПараметрыВложения.Вставить("Расширение", 	 Расширение);
		ПараметрыВложения.Вставить("ИмяБезРасширения", ИмяБезРасширения);		
		СохранитьВложенияФрагментУсловие(ПараметрыВложения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановкаТолькоЧтенияУФайла(ПараметрыВложения) Экспорт
	Оповещение = Новый ОписаниеОповещения("ПослеУдаленияПереименованияФайла", ЭтотОбъект, ПараметрыВложения);
	НачатьУдалениеФайлов(Оповещение, ПараметрыВложения.ПолноеИмяФайла);	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеУдаленияПереименованияФайла(ПараметрыВложения) Экспорт
	
	ПолноеИмяФайла	= ПараметрыВложения.ПолноеИмяФайла;
	Если ПараметрыВложения.Свойство("РазмерФайла") Тогда
		СсылкаНаДвоичныеДанныеФайла	= ПараметрыВложения.ДанныеФайла;
		ИмяФайла					= ПараметрыВложения.Файл.Имя;			
	Иначе	
		ДанныеФайла	= ПараметрыВложения.ДанныеФайла;
		СсылкаНаДвоичныеДанныеФайла = ПараметрыВложения.ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		ИмяФайла	= ДанныеФайла.ИмяФайла;
	КонецЕсли;		
	
	Если ПараметрыВложения.Свойство("РазмерФайла") Тогда
		РазмерВМб = ПараметрыВложения.РазмерФайла;
		ПараметрыВложения.Удалить("РазмерФайла");
	Иначе		
		РазмерВМб = ДанныеФайла.Размер / (1024 * 1024);
	КонецЕсли;	
	ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='Сохраняется файл ""%1"" (%2 Мб)"
"Пожалуйста, подождите...'"), ИмяФайла, 
	РаботаСФайламиСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб));
	Состояние(ТекстПояснения);
	ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, СсылкаНаДвоичныеДанныеФайла);
	ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	Если ТекущийНомерВложения = ПараметрыВложения.КоличествоВложений - 1 Тогда
		
		// Выполняем проверку на дубли и меняем дублям имена сохраняемых файлов.
		СписокИменФайлов = Новый СписокЗначений;
		Для Каждого ПолучаемыйФайл Из ПолучаемыеФайлы Цикл
			ЭлементСписка = СписокИменФайлов.НайтиПоЗначению(ПолучаемыйФайл.Имя);
			Если ЭлементСписка = Неопределено Тогда
				СписокИменФайлов.Добавить(ПолучаемыйФайл.Имя, "0");
			Иначе
				Файл = Новый Файл(ПолучаемыйФайл.Имя);
				ЭлементСписка.Представление = Строка(Число(ЭлементСписка.Представление) + 1);
				ПолучаемыйФайл.Имя = Файл.Путь + Файл.ИмяБезРасширения + "(" + ЭлементСписка.Представление + ")" + Файл.Расширение;
			КонецЕсли;
		КонецЦикла;
		// Выполняем сохранение файлов.
		Оповещение = Новый ОписаниеОповещения("СохранитьВложенияЗавершение", ЭтотОбъект, ПараметрыВложения);
		НачатьПолучениеФайлов(Оповещение, ПолучаемыеФайлы, ПараметрыВложения.ВыборКаталога.Каталог, Ложь);
	Иначе
		ПараметрыВложения.Вставить("ТекущийНомерВложения", ТекущийНомерВложения);
		СохранитьВложенияПослеВыбораКаталога(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения);	
	КонецЕсли;		
	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияФрагментУсловие(ПараметрыВложения)
	
	Если ПараметрыВложения.НомерПоПорядку = "" Тогда
		ПолноеИмяФайла = ПараметрыВложения.КаталогСохранения + ПараметрыВложения.ИмяБезРасширения 
			+ ПараметрыВложения.Расширение;
	Иначе			
		ПолноеИмяФайла = ПараметрыВложения.КаталогСохранения + ПараметрыВложения.ИмяБезРасширения 
			+ "(" + Формат(ПараметрыВложения.НомерПоПорядку, "ЧРГ=") + ")" + ПараметрыВложения.Расширение;			
		КонецЕсли;
	ПараметрыВложения.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);	
	Оповещение = Новый ОписаниеОповещения("ФайлПерезаписиПослеИнициализации", ЭтотОбъект, ПараметрыВложения);
	Файл = Новый Файл();
	Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ФайлПерезаписиПослеИнициализации (Файл, ПараметрыВложения) Экспорт
	ПараметрыВложения.Вставить("Файл",       Файл);				
	СохранитьВложенияУсловиеЗавершениеЦикла(ПараметрыВложения);	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияУсловиеЗавершениеЦикла(ПараметрыВложения)
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьНаСуществованиеФайлаПередСохранением", ЭтотОбъект, ПараметрыВложения);
	Файл = ПараметрыВложения.Файл;
	Файл.НачатьПроверкуСуществования(Оповещение);	

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаСуществованиеФайлаПередСохранением(Существует, ПараметрыВложения) Экспорт
	Если Существует Тогда
		НомерПоПорядку = ПараметрыВложения.НомерПоПорядку;
		ПараметрыВложения.Вставить("НомерПоПорядку", ?(НЕ ЗначениеЗаполнено(НомерПоПорядку),1,НомерПоПорядку + 1));
		СохранитьВложенияФрагментУсловие(ПараметрыВложения);
	Иначе
		ПослеУдаленияПереименованияФайла(ПараметрыВложения);
	КонецЕсли;			
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КаталогСохранения = ДополнительныеПараметры.КаталогСохранения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТолькоВыделенные = ДополнительныеПараметры.ТолькоВыделенные;
		
	Если ПолученныеФайлы.Количество() > 0  Тогда
		ХранилищеОбщихНастроекСохранить("НастройкиПрограммы", "ПапкаДляСохранитьКак",  КаталогСохранения);
		Состояние(НСтр("ru='Файлы успешно сохранены.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияВопрос(ПараметрыВложения)
	
	Перем ОтветНаВопрос, СписокКнопок, ТекстВопроса;
	
	ШаблонТекстаВопроса	= НСтр("ru='Файл %1 уже существует.%2Выберите действие для всех существующих файлов:'");
	ТекстВопроса	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаВопроса, ПараметрыВложения.ПолноеИмяФайла, Символы.ПС);
	СписокКнопок	= Новый СписокЗначений;
	СписокКнопок.Добавить("Перезаписать",	НСтр("ru='Перезаписать'"));
	СписокКнопок.Добавить("Переименовать",	НСтр("ru='Переименовать'"));
	СписокКнопок.Добавить("Отмена",			НСтр("ru='Отмена'"));
	Оповещение = Новый ОписаниеОповещения("СохранитьВложенияВопросЗавершение", ЭтотОбъект, ПараметрыВложения);
	ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, , "Отмена");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияВопросЗавершение(РезультатВопроса, ПараметрыВложения) Экспорт
	
	ТолькоВыделенные = ПараметрыВложения.ТолькоВыделенные;
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = "Перезаписать" Тогда
		ПараметрыВложения.Вставить("ПерезаписатьВсе", Истина);
		ПараметрыВложения.Вставить("ПереименоватьВсе", Ложь);
	ИначеЕсли ОтветНаВопрос = "Переименовать" Тогда
		ПараметрыВложения.Вставить("ПерезаписатьВсе", Ложь);
		ПараметрыВложения.Вставить("ПереименоватьВсе", Истина);
	Иначе
		ПараметрыВложения.Вставить("ПерезаписатьВсе", Ложь);
		ПараметрыВложения.Вставить("ПереименоватьВсе", Ложь);		
		Возврат;
	КонецЕсли;
	СохранитьВложенияПослеВыбораКаталога(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВсеВложениеВыполнить(Команда)
	ПолучаемыеФайлы = Новый Массив;
	ПолученныеФайлы = Новый Массив;	
	ПроверкаСуществованияФайлов = Истина;
	СохранитьВложения();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьПисьмо(Команда)
	
	ПоказатьСкрытьПисьмоНаСервере(НЕ Элементы.СписокПисемПоказатьСкрытьПисьмо.Пометка);
	
	УстановитьКартинкуЭлементаПоказатьСкрытьПисьмо();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьПисьмоНаСервере(Показать = Истина)
	
	Элементы.СписокПисемПоказатьСкрытьПисьмо.Пометка = Показать;
	ПоказатьСкрытьПисьмоПометка	= Элементы.СписокПисемПоказатьСкрытьПисьмо.Пометка;
	Элементы.Описание.Видимость	= ПоказатьСкрытьПисьмоПометка;
	Если ПоказатьСкрытьПисьмоПометка Тогда
		Элементы.ОписаниеПисьмаHTML.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьДеревоУчетныхЗаписей(Команда)
	Элементы.ПанельУправления.Видимость = НЕ Элементы.ПанельУправления.Видимость;
	Если Элементы.ПанельУправления.Видимость Тогда
		Элементы.ПоказатьСкрытьДеревоУчетныхЗаписей.Заголовок = НСтр("ru='Скрыть список учетных записей'");
	Иначе
		Элементы.ПоказатьСкрытьДеревоУчетныхЗаписей.Заголовок = НСтр("ru='Показать список учетных записей'");
	КонецЕсли;
	ХранилищеОбщихНастроекСохранить(ЭтотОбъект.ИмяФормы, "СписокУчетныхЗаписей", Элементы.ПанельУправления.Видимость);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ Настройки["ПоказатьСкрытьПисьмоПометка"] = Неопределено Тогда
		ПоказатьСкрытьПисьмоПометка	= Настройки["ПоказатьСкрытьПисьмоПометка"];
	Иначе
		ПоказатьСкрытьПисьмоПометка	= Истина;
	КонецЕсли;
	Элементы.СписокПисемПоказатьСкрытьПисьмо.Пометка	= ПоказатьСкрытьПисьмоПометка;
	Элементы.Описание.Видимость							= ПоказатьСкрытьПисьмоПометка;
	УстановитьКартинкуЭлементаПоказатьСкрытьПисьмо();

	Если УчетныеЗаписи.Количество() > 0 Тогда
		
		НайденноеЗначение = УчетныеЗаписи.НайтиПоЗначению(УчетнаяЗаписьВыбранная);
		
		Если НайденноеЗначение = Неопределено Тогда
			УчетнаяЗаписьВыбранная = ДеревоУчетныхЗаписей.ПолучитьЭлементы()[0].УчетнаяЗапись;
		КонецЕсли;
		
	Иначе
		УчетнаяЗаписьВыбранная = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ Настройки["ХранениеШириныКолонокРежимов"] = Неопределено ИЛИ Настройки["ХранениеШириныКолонокРежимов"] = Неопределено Тогда
		ХранениеШириныКолонокРежимов	= Новый Структура;
	Иначе
		ХранениеШириныКолонокРежимов	= Настройки["ХранениеШириныКолонокРежимов"];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеПисьмаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	CRM_ОбщегоНазначенияКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element, ТекущееПисьмо, Элемент.Документ);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИИсправлениеВходящихПисем(Команда)
	
	ОткрытьФорму("Обработка.CRM_ПроверкаВходящихПисем.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПапкуВходящиеУчетнойЗаписи(УчетнаяЗаписьПапки, ВидПапки = Неопределено) Экспорт // АПК:78 - исключить из проверки.
	
	УчетнаяЗаписьВыбранная = УчетнаяЗаписьПапки;
	
	Если ВидПапки = Неопределено ИЛИ ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Входящие") Тогда
		НаименованиеПапки = "Входящие";
	ИначеЕсли ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики") Тогда
		НаименованиеПапки = "Черновики";
	КонецЕсли;
	
	Ссылка = СправочникНайтиПоНаименованию("CRM_ПапкиЭлектронныхПисем",НаименованиеПапки, УчетнаяЗаписьВыбранная);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтруктураОтбора = Новый Структура("Папка",Ссылка);
		НомерСтроки = ДеревоНайтиСтрокуПоСвойству(ДеревоУчетныхЗаписей, СтруктураОтбора);
		Элементы.ПанельУправления.ТекущаяСтрока = НомерСтроки;
	ИначеЕсли ЗначениеЗаполнено(УчетнаяЗаписьВыбранная) Тогда
		Элементы.ПанельУправления.ТекущаяСтрока = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИдентификаторПапки(СтрокаДерева, Папка)

	СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Для каждого Подстрока Из СтрокиДерева Цикл
		Если Подстрока.Папка = Папка Тогда
		
			Возврат Подстрока.ПолучитьИдентификатор();
		Иначе
			ИД = ПолучитьИдентификаторПапки(Подстрока, Папка);
			Если ЗначениеЗаполнено(ИД) Тогда
			
				Возврат ИД;
			
			КонецЕсли; 
		
		КонецЕсли; 
		
	
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции // ПолучитьИдентификаторПапки()

&НаКлиенте
Процедура ПоказатьТолькоНепрочитанные(ТолькоНепрочитанные)
	
	Если ТолькоНепрочитанные Тогда
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(СписокПисем.Отбор.Элементы, "Непрочитанные", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Рассмотрено", Ложь, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		СписокНеПрочитанные.Очистить();
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокПисем,, "Непрочитанные");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОчиститьКорзинуНаСервере()
	
	ТекущиеДанные = ДеревоУчетныхЗаписей.НайтиПоИдентификатору(Элементы.ПанельУправления.ТекущаяСтрока);
	
	ПараметрыВыгрузки = Новый Структура;
	
	Если ТекущиеДанные.Папка.CRM_Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные ИЛИ ТекущиеДанные.Папка.CRM_Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта Тогда
		ПапкаУдаленные = ТекущиеДанные.Папка;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец",ТекущиеДанные.УчетнаяЗапись);
		Запрос.УстановитьПараметр("CRM_Вид",Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные);
		Запрос.УстановитьПараметр("Родитель",Справочники.ПапкиЭлектронныхПисем.ПустаяСсылка());
		Запрос.Текст = "ВЫБРАТЬ
		|	ПапкиЭлектронныхПисем.Ссылка
		|ИЗ
		|	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
		|ГДЕ
		|	ПапкиЭлектронныхПисем.Владелец = &Владелец
		|	И ПапкиЭлектронныхПисем.CRM_Вид = &CRM_Вид
		|	И ПапкиЭлектронныхПисем.Родитель = &Родитель
		|	И НЕ ПапкиЭлектронныхПисем.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПапкаУдаленные = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("УчетнаяЗапись", ТекущиеДанные.УчетнаяЗапись);
	ПараметрыВыгрузки.Вставить("Папка", ПапкаУдаленные);
	
	НаименованиеЗадания = НСтр("ru='Очистка папки удаленные'") + " ";
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.CRM_МенеджерПочты.ОчиститьПапку", 
		ПараметрыВыгрузки,
		НаименованиеЗадания);
		
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьРезультат();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПочтуНаСервере(ПолученоПисем, ДоступноУчетныхЗаписей, ЕстьОшибки, СписокПолученныхПисем, МассивУчетныхЗаписей)
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("МассивУчетныхЗаписей", МассивУчетныхЗаписей);
	
	НаименованиеЗадания = НСтр("ru='Получение почты'") + " ";
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.CRM_МенеджерПочты.ЗагрузитьПочтуПользователя", 
		ПараметрыВыгрузки,
		НаименованиеЗадания);
		
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьРезультат();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции	

&НаСервере
Процедура ЗагрузитьРезультат()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(Результат) = Тип("Строка")
		И ЗначениеЗаполнено(Результат) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ЗагрузитьРезультат();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				Элементы.СписокПисем.Обновить();
				// Оповестить("ПримененыПравилаОбработкиПисем");
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
					Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияПоучениеПочты()
	
	Попытка
		// Если ФормаДлительнойОперации.Открыта() 
		//	И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ЗагрузитьРезультат();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				Элементы.СписокПисем.Обновить();
				УстановитьНадписьДатыЗагрузки();
				ПоказатьОповещениеПользователя(,,НСтр("ru='Почта получена ...'"));
				// Оповестить("ПримененыПравилаОбработкиПисем");
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗаданияПоучениеПочты", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
					Истина);
			КонецЕсли;
		// КонецЕсли;
	Исключение
		//// ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	ОповещениеВопросОчиститьКорзину = Новый ОписаниеОповещения("ОбработкаОчисткиКорзины", ЭтотОбъект);
	Если ТекущиеДанные.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Удаленные") Тогда
		ТекстВопроса = НСтр("ru='Очистить папку ""Удаленные""?'");
	Иначе
		ТекстВопроса = НСтр("ru='Очистить папку ""Нежелательная почта""?'");
	КонецЕсли;
	ПоказатьВопрос(ОповещениеВопросОчиститьКорзину, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработки ответа на вопрос - отменить все запланированные взаимодействия.
//
// Параметры:
//   Параметры - КодВозвратаДиалога
//   дополнительно - неопределно, не передаем.
Процедура ОбработкаОчисткиКорзины(Параметры, Дополнительно) Экспорт
	
	Если Параметры = КодВозвратаДиалога.Да Тогда
		Результат = ОчиститьКорзинуНаСервере();
		
		Если НЕ Результат.ЗаданиеВыполнено Тогда
			ИдентификаторЗадания = Результат.ИдентификаторЗадания;
			АдресХранилища       = Результат.АдресХранилища;
			
			ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
			ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
			
		Иначе
			Элементы.СписокПисем.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСсылкиВложений()
	
	ГруппаСсылокВложений = Элементы.ГруппаСсылкиВложений;
	
	МаксимальнаяДлинаИмениВложения = 50;
	МаксимальнаяДлинаСтроки = 150;
	
	Если РежимОтображения = 0 Тогда // Стандартный вид	
		МаксимальнаяДлинаСтроки = 150;
	ИначеЕсли РежимОтображения = 1 Тогда // Горизонтальный вид
		МаксимальнаяДлинаСтроки = 200;
	ИначеЕсли РежимОтображения = 2 Тогда // Вертикальный вид
		МаксимальнаяДлинаСтроки = 70;
	КонецЕсли;
	
	МассивЭкранов = ПолучитьИнформациюЭкрановКлиента();
	// Защита от Толстого клиента - в нем ПолучитьИнформациюЭкрановКлиента() возвращает Неопределено и падает ошибка
	Если МассивЭкранов <> Неопределено Тогда
		ШиринаЭкрана = ПолучитьИнформациюЭкрановКлиента()[0].Ширина;
	Иначе
		ШиринаЭкрана = 1440;
	КонецЕсли;
	МаксимальнаяДлинаСтроки = МаксимальнаяДлинаСтроки*(ШиринаЭкрана/1920);
	
	// Удаление предыдущих элементов
	МассивУдаляемыхЭлементов = Новый Массив;
	Для Каждого Элемент Из ГруппаСсылокВложений.ПодчиненныеЭлементы Цикл
		МассивУдаляемыхЭлементов.Добавить(Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	МассивУдаляемыхКоманд = Новый Массив;
	Для Каждого КомандаФормы Из Команды Цикл
		Если СтрЧислоВхождений(КомандаФормы.Имя, "Команда_Сохранить_СсылкаВложения_") > 0 Тогда
			МассивУдаляемыхКоманд.Добавить(КомандаФормы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КомандаФормы Из МассивУдаляемыхКоманд Цикл
		Команды.Удалить(КомандаФормы);
	КонецЦикла;
		
	НомерЭлемента = 0;
	НомерСтрокиЭлементов = 0;
	ТекущаяДлинаСтроки = 0;
	
	Для Каждого ЭлементТаблицы Из Вложения Цикл
		ПредставлениеСсылки = "";
		Если НЕ ВсеВложенияПометка И ЭлементТаблицы.ИДФайлаЭлектронногоПисьмаОтбор = "#" Тогда
			ПредставлениеСсылки = ЭлементТаблицы.ИмяФайла;
		ИначеЕсли ВсеВложенияПометка Тогда
			ПредставлениеСсылки = ЭлементТаблицы.ИмяФайла;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеСсылки) Тогда
			Продолжить;
		КонецЕсли;
		
		// Расчет длины текущей строки
		Если СтрДлина(ПредставлениеСсылки) > МаксимальнаяДлинаИмениВложения Тогда
			ПредставлениеСсылки = Лев(ПредставлениеСсылки, МаксимальнаяДлинаИмениВложения) + "...";
		КонецЕсли;
		ШиринаЭлемента = СтрДлина(ПредставлениеСсылки);
		Если ШиринаЭлемента > 8 Тогда 
			ШиринаЭлемента = ШиринаЭлемента*0.8;
		КонецЕсли;
		ТекущаяДлинаСтроки = ТекущаяДлинаСтроки + ШиринаЭлемента;
		
		// Создание следующей горизонтальной группы
		Если НомерСтрокиЭлементов = 0 Или ТекущаяДлинаСтроки > МаксимальнаяДлинаСтроки Тогда
			
			ТекущаяДлинаСтроки = СтрДлина(ПредставлениеСсылки) + 2;
			НомерСтрокиЭлементов = НомерСтрокиЭлементов + 1;
			
			ГруппаСтрокаВложений = Элементы.Добавить("СтрокаВложений" + НомерСтрокиЭлементов, Тип("ГруппаФормы"), ГруппаСсылокВложений);
			ГруппаСтрокаВложений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтрокаВложений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаСтрокаВложений.ОтображатьЗаголовок = Ложь;
			ГруппаСтрокаВложений.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСтрокаВложений.РастягиватьПоВертикали = Ложь;
			ГруппаСтрокаВложений.Высота = 1;
			ГруппаСтрокаВложений.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
			ГруппаСтрокаВложений.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			
		КонецЕсли;
		
		ИдентификаторСсылкиВложения = ЭлементТаблицы.ПолучитьИдентификатор();
		
		// Вывод иконки типа вложения
		ДекорацияИконкаВложения = Элементы.Добавить("ИконкаВложения_" + ИдентификаторСсылкиВложения, Тип("ДекорацияФормы"), ГруппаСтрокаВложений);
		ДекорацияИконкаВложения.Вид = ВидДекорацииФормы.Картинка;
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ЭлементТаблицы.ИмяФайла);
		ИндексКартинки	= РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(РасширениеФайла);
		//ДекорацияИконкаВложения.Картинка = БиблиотекаКартинок["CRM_ИконкаТипаФайла_"+ИндексКартинки];
		ДекорацияИконкаВложения.Картинка = СписокИконокФайлов[ИндексКартинки/2].Значение;
		
		
		// Создание элемента-вложения
		ДекорацияСсылкаВложения = Элементы.Добавить("СсылкаВложения_" + ИдентификаторСсылкиВложения, Тип("ДекорацияФормы"), ГруппаСтрокаВложений);
		ДекорацияСсылкаВложения.Заголовок = ПредставлениеСсылки;
		ДекорацияСсылкаВложения.Гиперссылка = Не ВложенияОчищеныПоНастройке;
		ДекорацияСсылкаВложения.ЦветТекста = ?(ВложенияОчищеныПоНастройке, ЦветаСтиля.CRM_ЦветДополнительногоТекста, ЦветаСтиля.CRM_ОсновнойГолубой);
		
		ДекорацияСсылкаВложения.УстановитьДействие("Нажатие", "ДекорацияСсылкаВложенияНажатие");
		
		// Формирование контекстного меню декорации:
		ИмяЭлементаКнопки = "Сохранить_" + ДекорацияСсылкаВложения.Имя;
		КнопкаСохранитьВложение = Элементы.Найти(ИмяЭлементаКнопки);
		Если КнопкаСохранитьВложение = Неопределено Тогда
			
			КнопкаСохранитьВложение = Элементы.Добавить(ИмяЭлементаКнопки, Тип("КнопкаФормы"), ДекорацияСсылкаВложения.КонтекстноеМеню);
			
			ИмяКоманды = "Команда_" + ИмяЭлементаКнопки;
			
			Команда = Команды.Добавить(ИмяКоманды);
			Команда.Заголовок = НСтр("ru='Сохранить';en='Save'");
			Команда.Подсказка = НСтр("ru='Сохранить';en='Save'");
			Команда.Картинка = БиблиотекаКартинок.CRM_СохранитьКак;
			Команда.Действие = "Подключаемый_СохранитьВложениеКонтекстноеМеню";
			Команда.ИзменяетСохраняемыеДанные = Ложь;
			
			КнопкаСохранитьВложение.ИмяКоманды = Команда.Имя;
			
			
		КонецЕсли;
		КнопкаСохранитьВложение.Видимость = Истина;
		
		НомерЭлемента = НомерЭлемента + 1;
		
	КонецЦикла;
	
	Если ГруппаСсылокВложений.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ДекорацияВложения.Заголовок = НСтр("ru = 'Нет вложений'; en = 'No attachments'");
		Элементы.СохранитьВсеВложения.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияВложения.Заголовок = НСтр("ru = ''; en = ''");
		Элементы.СохранитьВсеВложения.Видимость = Истина;
	КонецЕсли;
	
	Элементы.CRM_ЗагрузитьВложения.Видимость = ВложенияОчищеныПоНастройке;
	Элементы.СохранитьВсеВложения.Доступность = Не ВложенияОчищеныПоНастройке;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаВложенияНажатие(Элемент)
	
	ИдентификаторСсылкиВложения = СтрЗаменить(Элемент.Имя, "СсылкаВложения_", "");
	ОткрытьВложениеПоИдентификатору(ИдентификаторСсылкиВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложениеПоИдентификатору(ИдентификаторСсылкиВложения)
	
	ТекущиеДанныеПисьма = Элементы.СписокПисем.ТекущиеДанные;
	ТекущиеДанные = Вложения.НайтиПоИдентификатору(ИдентификаторСсылкиВложения);
	
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если ВзаимодействияКлиентСервер.ЭтоФайлПисьмо(ТекущиеДанные.ИмяФайла) Тогда
			
		ПараметрыВложения = ВзаимодействияКлиент.ПустаяСтруктураПараметровПисьмаВложения();
		ПараметрыВложения.ДатаПисьмаОснования = ТекущиеДанныеПисьма.Дата;
		ПараметрыВложения.ПисьмоОснование     = ТекущиеДанныеПисьма.Ссылка;
		ПараметрыВложения.ТемаПисьмаОснования = ТекущиеДанныеПисьма.Тема;
		ВзаимодействияКлиент.ОткрытьВложениеПисьмо(ТекущиеДанные.Ссылка, ПараметрыВложения, ЭтотОбъект);
		
	Иначе
		
		УправлениеЭлектроннойПочтойКлиент.ОткрытьВложение(ТекущиеДанные.Ссылка, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьВложениеКонтекстноеМеню(Команда)
	
	ИдентификаторСсылкиВложения = СтрЗаменить(Команда.Имя, "Команда_Сохранить_СсылкаВложения_", "");
	СохранитьВложениеПоИдентификатору(ИдентификаторСсылкиВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеПоИдентификатору(ИдентификаторСсылкиВложения)
	
	// +CRM
	ТекущиеДанные = Вложения.НайтиПоИдентификатору(ИдентификаторСсылкиВложения);
	
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если (ТекущиеДанные.Расположение = 0) ИЛИ (ТекущиеДанные.Расположение = 1) Тогда
		CRM_УправлениеЭлектроннойПочтойКлиент.СохранитьВложение(ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	ИначеЕсли ТекущиеДанные.Расположение = 2 Тогда
		
	ИначеЕсли ТекущиеДанные.Расположение = 4 Тогда
		ФайлВложения = Новый Файл(ТекущиеДанные.ИмяФайла);
		РасширениеВложения = ?(ПустаяСтрока(ФайлВложения.Расширение), ФайлВложения.Расширение, Прав(ФайлВложения.Расширение, СтрДлина(ФайлВложения.Расширение)-1));
		Если РасширениеВложения = "EML" Тогда
			ПоказатьПредупреждение(,НСтр("ru='Это вложение не может быть сохранено.'"));
			Возврат;
		КонецЕсли;
		ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(Неопределено);
		СтруктураДанных = Новый Структура("РасширениеВложения, текДанные", РасширениеВложения, ТекущиеДанные);
		ОповещениеНовое = Новый ОписаниеОповещения("СохранитьВложениеЗавершение", ЭтотОбъект, СтруктураДанных);
		НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеНовое);	
	КонецЕсли;
	// -CRM
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПочтовуюПапку(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	СтруктураТекущейУЗ = ПолучитьТекущуюУЗ();
	ПараметрыЗаполнения = Новый Структура("Владелец", СтруктураТекущейУЗ.Ключ);
	ПараметрыЗаполнения.Вставить("Родитель", ТекущиеДанные.Папка);
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ОписаниеОповещенияОкончание = Новый ОписаниеОповещения("РедактироватьПочтовыеПапкиОкончание", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОкончание);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПочтовуюПапку(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	СтруктураТекущейУЗ = ПолучитьТекущуюУЗ();	
	ПараметрыЗаполнения = Новый Структура("Владелец", СтруктураТекущейУЗ.Ключ);
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.Папка);
	ОписаниеОповещенияОкончание = Новый ОписаниеОповещения("РедактироватьПочтовыеПапкиОкончание", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОкончание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОбработки(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	СтруктураТекущейУЗ = ПолучитьТекущуюУЗ();
	СтруктураОтбора = Новый Структура("Владелец", СтруктураТекущейУЗ.Ключ);
	ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.ПравилаОбработкиЭлектроннойПочты.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПочтовыеПапки(Команда)
	
	ТекущиеДанные = Элементы.ПанельУправления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	СтруктураТекущейУЗ = ПолучитьТекущуюУЗ();
	СтруктураОтбора = Новый Структура("Владелец", СтруктураТекущейУЗ.Ключ);
	ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбора);
	ОписаниеОповещенияОкончание = Новый ОписаниеОповещения("РедактироватьПочтовыеПапкиОкончание", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаСписка", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОкончание);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПочтовыеПапкиОкончание(Параметры, Дополнительно) Экспорт
	ЗаполнитьДеревоУчетныхЗаписей();
	ПереместитьВ_ЗаполнитьСписокКоманд();
	Если НЕ НетУчетныхЗаписей Тогда
		CRM_ОбщегоНазначенияКлиент.РазвернутьДеревоЗначенийСвойств(Элементы.ПанельУправления, ДеревоУчетныхЗаписей);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСоставПапок()
	
	ЗаполнитьСписокУчетныхЗаписей(УчетныеЗаписи);
	ЗаполнитьДеревоУчетныхЗаписей();
	
	Если НЕ НетУчетныхЗаписей Тогда
		CRM_ОбщегоНазначенияКлиент.РазвернутьДеревоЗначенийСвойств(Элементы.ПанельУправления, ДеревоУчетныхЗаписей);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияПанельУправленияПриАктивизацииСтроки", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьУчетнуюЗапись()
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеПодключенияУчетнойЗаписи", ЭтотОбъект);
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.CRM_ПомощникНастройкиУчетнойЗаписи",,,,,,ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияУчетнойЗаписи(Результат, Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат Тогда
		
		ОбновитьСоставПапок();
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ЗаписьВыполнена = CRM_НачалоРаботыСПрограммойСервер.ЗаписатьНастроенныйРазделРешения(ПредопределенноеЗначение("Перечисление.CRM_РазделыНастройкиРешения.ПочтовыйКлиент"));
			Если ЗаписьВыполнена Тогда
				Оповестить("ОбновитьНастроенныеРазделы");
				CRM_РабочийСтолКлиент.ПереинициализироватьРабочийСтолКлиент("Обработка.CRM_МенеджерПочты.Форма.Форма");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПроцедурыОбработчикиСобытийОстальныхЭлементовУправленияФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// +Рабочий стол
#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ПолеHTMLНапоминанийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLНапоминанийПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLНапоминанийПриНажатии()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти
// -Рабочий стол

&НаКлиенте
Процедура Справка(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("АРМПочта"));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСинхронизацииПапок(Команда)
	ОткрытьФорму("Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаСинхронизацииПапок", 
		Новый Структура("УчетнаяЗапись", УчетнаяЗаписьВыбранная), ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРежимОтображения(Команда)

	Список = Новый СписокЗначений;
	Список.Добавить(0, НСтр("ru = 'Обычный'"), (РежимОтображения = 0), БиблиотекаКартинок.CRM_ПросмотрПисьмаСтандартный16);
	Список.Добавить(1, НСтр("ru = 'Горизонтальный'"), (РежимОтображения = 1), БиблиотекаКартинок.CRM_ПросмотрПисьмаВоВсюШирину16);
	Список.Добавить(2, НСтр("ru = 'Вертикальный'"), (РежимОтображения = 2), БиблиотекаКартинок.CRM_ПросмотрПисьмаВоВсюВысоту16);

	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюРежимОтображения", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.СписокПисемВыбратьРежимОтображения);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМенюРежимОтображения(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	
	РежимОтображения = ВыбранныйЭлемент.Значение;
	РасположитьОкнаСогласноРежимуОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолучитьПисьма_ВыбратьУчетнуюЗапись(Команда)
	
	ПустаяСсылка = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка");
	
	Список = Новый СписокЗначений;
	Список.Добавить(ПустаяСсылка, НСтр("ru = 'Все новые сообщения'"),, БиблиотекаКартинок.CRM_Обновить);
	
	КоллекцияЭлементовДерева = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.УчетнаяЗапись) Тогда
			Продолжить;
		КонецЕсли;
		
		Список.Добавить(СтрокаДерева.УчетнаяЗапись, СтрокаДерева.УчетнаяЗапись,, БиблиотекаКартинок.CRM_Обновить);
		
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюВыбратьУчетнуюЗапись", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.ОтправитьПолучитьПисьма_ВыбратьУчетнуюЗапись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМенюВыбратьУчетнуюЗапись(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка") Тогда
		ОтправитьПолучитьПисьмаВсехУчетныхЗаписей();
	Иначе
		МассивУчетныхЗаписей = Новый Массив;
		МассивУчетныхЗаписей.Добавить(ВыбранныйЭлемент.Значение);
	
		ОтправитьПолучитьПисьмаУчетныхЗаписей(МассивУчетныхЗаписей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Избранный(Команда)
	
	ЕстьИзбранныеПисьма = Ложь;
	ЕстьНеизбранныеПисьма = Ложь;
	
	ВыделенныеПисьма = Элементы.СписокПисем.ВыделенныеСтроки;
	
	Если ВыделенныеПисьма.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Для Каждого ВыделенноеПисьмо Из ВыделенныеПисьма Цикл
		
		ДанныеСтроки = Элементы.СписокПисем.ДанныеСтроки(ВыделенноеПисьмо);
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.Избранный Тогда
			ЕстьИзбранныеПисьма = Истина;
		Иначе
			ЕстьНеизбранныеПисьма = Истина;
		КонецЕсли;
		
		Если ЕстьИзбранныеПисьма И ЕстьНеизбранныеПисьма Тогда
			ИзменитьСостояниеИзбранности(ВыделенныеПисьма, Истина);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьИзбранный = ЕстьНеизбранныеПисьма;
	ИзменитьСостояниеИзбранности(ВыделенныеПисьма, УстановитьИзбранный);
		
КонецПроцедуры

&НаСервере
Процедура ИзменитьСостояниеИзбранности(МассивПисем, Избранный)

	Для Каждого ПисьмоСсылка Из МассивПисем Цикл
		ПисьмоОбъект = ПисьмоСсылка.ПолучитьОбъект();
		ПисьмоОбъект.CRM_Избранный = Избранный;
		
		Попытка
			ПисьмоОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
		
	Элементы.СписокПисем.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПереместитьВПапку(Команда)

	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюПереместитьВПапку", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(Оповещение, СписокПереместитьВПапку(), Элементы.СписокПисемПереместитьВПапку);

КонецПроцедуры

&НаКлиенте
Функция СписокПереместитьВПапку()
	
	ИсключаемыеВидыПапок = Новый Массив;
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие"));
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные"));
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики"));
	
	МассивПапокСИерархией = Новый Массив;
	ДеревоПапок = ДеревоУчетныхЗаписей.ПолучитьЭлементы();
	Для Каждого СтрокаДереваПапок Из ДеревоПапок Цикл
		
		Если СтрокаДереваПапок.УчетнаяЗапись <> УчетнаяЗаписьВыбранная Тогда Продолжить; КонецЕсли;
		МассивПапокУчетнойЗаписиСИерархией(СтрокаДереваПапок.ПолучитьЭлементы(), МассивПапокСИерархией, ИсключаемыеВидыПапок);
		
	КонецЦикла;
	
	Возврат СписокПереместитьВПапкуНаСервере(МассивПапокСИерархией);
	
КонецФункции

&НаСервере
Функция СписокПереместитьВПапкуНаСервере(МассивПапокСИерархией)
	
	Список = Новый СписокЗначений;	
	
	Для Каждого ЭлементСтуктура Из МассивПапокСИерархией Цикл
		
		Если ЭлементСтуктура.ВнизСписка Тогда Продолжить; КонецЕсли;
		
		Список.Добавить(ЭлементСтуктура.Ссылка, ЭлементСтуктура.Имя,,);
		
	КонецЦикла;
	
	Для Каждого ЭлементСтуктура Из МассивПапокСИерархией Цикл
		
		Если НЕ ЭлементСтуктура.ВнизСписка Тогда Продолжить; КонецЕсли;
		
		Список.Добавить(ЭлементСтуктура.Ссылка, ЭлементСтуктура.Имя,,);
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораИзМенюПереместитьВПапку(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	
	СсылкаНаПапку = ВыбранныйЭлемент.Значение;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаПапку) Тогда Возврат; КонецЕсли;
	
	// действие
	МассивПеремещаемыхПисем = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокПисем.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.СписокПисем.ДанныеСтроки(ВыделеннаяСтрока);
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивПеремещаемыхПисем.Добавить(ДанныеСтроки.Ссылка);
		
	КонецЦикла;
		
	ПодготовитьПеремещениеПисем(СтруктураПапки(СсылкаНаПапку), МассивПеремещаемыхПисем);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

&НаСервереБезКонтекста
Функция ПолучитьСведенияПоУчетнойЗаписи(УчетнаяЗапись)
	
	Результат = Новый Структура;
	Результат.Вставить("ПротоколВходящейПочты", УчетнаяЗапись.ПротоколВходящейПочты);
	
	МенеджерЗаписи = РегистрыСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	МенеджерЗаписи.Прочитать();
	Результат.Вставить("ДатаЗагрузкиПисем", МенеджерЗаписи.ДатаЗагрузкиПисем);
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////

// &НаСервере
// Функция ПолучитьСвойстваДинамическогоСпискаСервер()
//	Возврат CRM_ОбщегоНазначенияСервер.ПолучитьСвойстваДинамическогоСписка(	ЭтотОбъект,
//																			"СписокПисем",
//																			"Обработка.CRM_МенеджерПочты",
//																			Неопределено,
//																			Неопределено,
//																			Неопределено,
//																			"ПодменюВидСписка",
//																			"ВидСпискаИдентификаторТекущейНастройки",
//																			"Подключаемый_КомандаВидСписка");
//	//
// КонецФункции



