
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Смарт Фролов+ Задача № 85
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		смартУстановитьВидыЦенПоБазовомуВиду();
	КонецЕсли;	
	// Фролов-
КонецПроцедуры

&НаСервере
&После("ПриИзмененииСоглашенияСервер")
Процедура смарт_ПриИзмененииСоглашенияСервер(ЗаполнитьУсловияПродаж)
	//смартКаратеев ++
	Объект.РазбиватьРасходныеОрдераПоРаспоряжениям = Объект.Соглашение.РазбиватьРасходныеОрдераПоРаспоряжениям;
	РазбиватьРасходныеОрдераПоРаспоряжениямЧисло = Число(Объект.Соглашение.РазбиватьРасходныеОрдераПоРаспоряжениям);
	//Каратеев --
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
	МаксимальныйПроцентРучнойСкидки = Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
	Если ТекущийОбъект.ОграничиватьРучныеСкидки И ТекущийОбъект.ПроцентРучнойСкидки > МаксимальныйПроцентРучнойСкидки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процент ручной скидки не может быть выше макимального (" + МаксимальныйПроцентРучнойСкидки + ")!", , "ПроцентРучнойСкидки", "Объект.ПроцентРучнойСкидки", Отказ);
	КонецЕсли;	
	//--#1323 смарт: Лопато 15.03.2023

КонецПроцедуры

&НаСервере
Процедура смарт_ПроцентРучнойСкидкиПриИзмененииПослеНаСервере()

	//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
	смартПроверитьПроцентРучнойСкидки();
	//--#1323 смарт: Лопато 15.03.2023
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПроцентРучнойСкидкиРегулированиеПосле(Элемент, Направление, СтандартнаяОбработка)
	
	//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
	смартПроверитьПроцентРучнойСкидки();
	//--#1323 смарт: Лопато 15.03.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Смарт Фролов+ Задача № 84
// Событие формы "Перед записью"
&НаКлиенте
Процедура смарт_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если Не смартДопПараметры=Неопределено Тогда // Ошибки уже были, больше о них не сообщаем.
		Возврат;
	КонецЕсли;	
	МассивСтрок=Объект.Товары.НайтиСтроки(Новый Структура("ВидЦены",ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")));
	Если МассивСтрок.Количество() И Не смартРазрешениеПоРолям() Тогда
		// Переходим к первому полю с ошибкой
		Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.СтраницаУточнениеПоТоварам;
		Элементы.Товары.ТекущаяСтрока=МассивСтрок[0].ПолучитьИдентификатор();
		Элементы.Товары.ТекущийЭлемент=Элементы.ТоварыВидЦены;
		
		смартДопПараметры=Новый Структура("ЗакрыватьФорму",Ложь);
		
		Оповещение=Новый ОписаниеОповещения("смартПослеЗакрытияФормыВопроса",ЭтаФорма);
		ТекстВопроса="Соглашение не будет действовать (есть 'произвольные' цены).
					|Для согласования 'произвольной цены' обратитесь к руководителю.";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОКОтмена,30,,"Записать со статусом 'Не согласовано'?");
	КонецЕсли;
КонецПроцедуры

// Смарт Фролов+ Задача № 84
// Событие формы "Перед закрытием"
&НаКлиенте
Процедура смарт_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Перем Закрывать;
	Если ТипЗнч(смартДопПараметры)=Тип("Структура") И смартДопПараметры.Свойство("ЗакрыватьФорму",Закрывать) И Не Закрывать Тогда 
		Отказ=Не Закрывать;
		смартДопПараметры.ЗакрыватьФорму=Истина;
	КонецЕсли;
КонецПроцедуры

// Смарт Фролов+ Задача № 85
// Процедура событие элемента формы "ВидЦены" ПриИзменении
&НаКлиенте
Процедура смарт_ВидЦенПриИзмененииВместо(Элемент)
	смартУстановитьВидыЦенПоБазовомуВиду();
КонецПроцедуры

// Смарт Задача № 85
// Процедура устанавливает фильтр выбора "Вида цены" в табличной части "Товары"
&НаСервере
Процедура смартУстановитьВидыЦенПоБазовомуВиду()
	МассивПараметровВыбора=Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",Объект.ВидЦен));
	Элементы.ТоварыВидЦены.ПараметрыВыбора=Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	Элементы.ТоварыВидЦены.СвязиПараметровВыбора=Новый ФиксированныйМассив(Новый Массив);
	
	МассивВидовЦен=Справочники.ВидыЦен.ДоступныеВидыЦен(Новый Структура("БазовыйВидЦены,ЦенаВключаетНДС",Объект.ВидЦен,Объект.ЦенаВключаетНДС));
	
	Элементы.ТоварыВидЦены.СписокВыбора.ЗагрузитьЗначения(МассивВидовЦен);
	Элементы.ТоварыВидЦены.СписокВыбора.Добавить(Справочники.ВидыЦен.ПустаяСсылка(), НСтр("ru='<произвольная>'"));
КонецПроцедуры	
// Фролов-

// Смарт Фролов+ Задача № 84
// Процедура после закрытия формы Вопроса
&НаКлиенте
Процедура смартПослеЗакрытияФормыВопроса(Результат,ДопПараметры) Экспорт
	Если Результат=КодВозвратаДиалога.ОК Тогда
		Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано");
		Объект.Согласован=Ложь;
		ЭтаФорма.Записать();
		Закрывать=Неопределено;
		Если ТипЗнч(смартДопПараметры)=Тип("Структура") И смартДопПараметры.Свойство("ЗакрыватьФорму",Закрывать) И Закрывать Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		смартДопПараметры=Неопределено;
	КонецЕсли;
КонецПроцедуры

// Смарт Задача № 84
// Функция возвращает разрешено ли пользователю записывать Соглашение с произвольными ценами
&НаСервереБезКонтекста
Функция смартРазрешениеПоРолям()
	Возврат РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеПравилВеденияСделок");
КонецФункции	
// Фролов-

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаСервере
Процедура смартПроверитьПроцентРучнойСкидки()
	
	МаксимальныйПроцентРучнойСкидки = Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
	Если Объект.ОграничиватьРучныеСкидки И Объект.ПроцентРучнойСкидки > МаксимальныйПроцентРучнойСкидки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процент ручной скидки не может быть выше макимального (" + МаксимальныйПроцентРучнойСкидки + ")!");
	КонецЕсли;	
	
КонецПроцедуры //--#1323 смарт: Лопато 15.03.2023

#КонецОбласти