Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат ДЛ_ДеловыеЛинии.МассивДвухЭлементов("uid", "uid");
	
КонецФункции  

Функция ПолучитьСтруктуруПолейЗначений() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("description", "Наименование");	
	
	Возврат Результат;
	
КонецФункции         

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = ДЛ_ДеловыеЛинии.НоваяТаблицаПолейЗначений();
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Наименование", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "inn", "ИНН", "Реквизит");	 
		
	Возврат Результат;
	
КонецФункции    

