
&ИзменениеИКонтроль("НачатьПрослушиваниеЗаписиРазговора")
Процедура смарт_НачатьПрослушиваниеЗаписиРазговора(ПараметрыЗвонка, Форма, Элемент)
	
	// Прежде, чем искать запись мы должны выяснить, есть ли права на прослушку у данного пользователя
	ТекстПредупреждения = Нстр("ru='У данного пользователя нет прав на прослушивание разговора пользователя '");
	
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	МассивПрослушиваемыхПользователей = сфпСофтФонПроСервер.сфпПолучитьМассивПрослушиваемыхПользователей(ТекПользователь);
	Если МассивПрослушиваемыхПользователей.Количество() > 0 Тогда
		Если МассивПрослушиваемыхПользователей.Найти(ПараметрыЗвонка.Ответственный) = Неопределено Тогда
			ТекстПредупреждения = ТекстПредупреждения + """" + ПараметрыЗвонка.Ответственный + """" + ".";
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецЕсли;

	Иначе				
		ТекстПредупреждения = ТекстПредупреждения + """" + ПараметрыЗвонка.Ответственный + """" + ".";
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ВерсияСофтФон = сфпОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("сфпИспользуемаяВерсияСофтФон");
	ПараметрыЗвонка.Вставить("ВерсияСофтФон", ВерсияСофтФон);
	
	СписокВыбора = Новый СписокЗначений();
	СписокВыбора.Добавить("Прослушать");
	СписокВыбора.Добавить("Скачать");
		
	#Вставка
	//++#1359 смарт: Балашов 25.07.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)
	Если ЗначениеЗаполнено(ПараметрыЗвонка.ИдентификаторЗаписи) Тогда
		СсылкаНаЗапись = ПараметрыЗвонка.ИдентификаторЗаписи;
		ОткрытьНавигационнуюСсылку(СсылкаНаЗапись);	
		ВерсияСофтФон = "";
	Иначе                                                                      
		СсылкаНаЗапись = сфпСофтФонПроСервер.смартПолучитьСсылкуНаЗаписьЗвонка(ПараметрыЗвонка.ИдентификаторЗвонка);
		Если Не СсылкаНаЗапись = Неопределено Тогда
			ОткрытьНавигационнуюСсылку(СсылкаНаЗапись);	
			ВерсияСофтФон = "";
		КонецЕсли;	
	КонецЕсли;
	Если ВерсияСофтФон = "" Тогда
		Возврат;
	КонецЕсли;	
	//--#1359 смарт: Балашов 25.07.2023
	#КонецВставки
		
	Если ВерсияСофтФон = ПредопределенноеЗначение("Перечисление.сфпВерсииСофтФон.СофтФотPROSTO") Тогда
		Если ЗначениеЗаполнено(ПараметрыЗвонка.ИдентификаторЗаписи) Тогда
			#Если ВебКлиент Тогда
				ВыбранныйЭлемент = СписокВыбора.НайтиПоЗначению("Скачать");
				ПродолжитьПрослушиваниеЗаписиРазговора(ВыбранныйЭлемент, ПараметрыЗвонка);
			#Иначе
				Оповещение = Новый ОписаниеОповещения("ПродолжитьПрослушиваниеЗаписиРазговора", сфпСофтФонПроКлиент, ПараметрыЗвонка);
				Форма.ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
			#КонецЕсли
		КонецЕсли;
		
	Иначе
		ВыбранныйЭлемент = СписокВыбора.НайтиПоЗначению("Прослушать");
		ПродолжитьПрослушиваниеЗаписиРазговора(ВыбранныйЭлемент, ПараметрыЗвонка);
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("сфпПроверитьДоступностьСофтФон")
Функция смарт_сфпПроверитьДоступностьСофтФон(ВыводитьПредупреждения)
	
	#Вставка
	//++#1352 смарт: Лопато 15.06.2023 //Звонки из 1С (через городской стационарный телефон)  
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#Иначе
		Если НЕ смартОбщегоНазначения.смартПроверитьДоступностьЗвонков() Тогда

			Если ВыводитьПредупреждения Тогда
				ПоказатьПредупреждение(, НСтр("ru='У текущего пользователя не заполнены номера телефонов!'"), 5);
			КонецЕсли;	

			Возврат Ложь;
			
		КонецЕсли;	
        
		Возврат Истина;
	#КонецЕсли
	//--#1352 смарт: Лопато 15.06.2023
	#КонецВставки
		
	Если сфпСофтФонПроСервер.ИспользуемаяВерсияСофтФона() = ПредопределенноеЗначение("Перечисление.сфпВерсииСофтФон.СофтФотPROSTO") Тогда
		Если НЕ сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
			Если ВыводитьПредупреждения Тогда
				//CRM_ОбщегоНазначенияКлиент.ОткрытьФормуОшибкиПодключения("СофтФон");
			КонецЕсли;	
			
			Возврат Ложь;
		ИначеЕсли НЕ сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон") Тогда	
			Если ВыводитьПредупреждения Тогда
				ПоказатьПредупреждение(, НСтр("ru='В персональных настройках пользователя отключено использование СофтФон'"), 5);
			КонецЕсли;	
			
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
			
	Иначе
		#Если ВебКлиент Тогда
			Возврат Ложь;
		#Иначе
			Если НЕ сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
				Если ВыводитьПредупреждения Тогда
					CRM_ОбщегоНазначенияКлиент.ОткрытьФормуОшибкиПодключения("СофтФон");
				КонецЕсли;	
				
				Возврат Ложь;
			ИначеЕсли НЕ сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон") Тогда	
				Если ВыводитьПредупреждения Тогда
					ПоказатьПредупреждение(, НСтр("ru='В персональных настройках пользователя отключено использование СофтФон'"), 5);
				КонецЕсли;	
				
				Возврат Ложь;
			ИначеЕсли сфпПанельУправления = Неопределено Тогда
				Если ВыводитьПредупреждения Тогда
					ПоказатьПредупреждение(, НСтр("ru='Отсутствует подключение к серверу СофтФона'"), 5);
				КонецЕсли;	
				
				Возврат Ложь;
			КонецЕсли;	
			
			Возврат Истина;
		#КонецЕсли
	КонецЕсли;

КонецФункции

&ИзменениеИКонтроль("сфпПолучитьКлючПоиска")
Функция смарт_сфпПолучитьКлючПоиска(hCall)
	
	Если ТипЗнч(hCall) = Тип("Число") Тогда
		  КлючПоиска = "_" + Формат(hCall, "ЧГ=0");
	Иначе КлючПоиска = "_" + СтрЗаменить(hCall, Символы.НПП, "");
		#Вставка
		//++#1398 смарт: Балашов 20.07.2023 //Доработать карточку интереса (исправить логику)
		КлючПоиска = "_" + СтрЗаменить(hCall, ".", "");
		//--#1398 смарт: Балашов 20.07.2023
		#КонецВставки
	КонецЕсли;
	
	Возврат КлючПоиска;

КонецФункции

&ИзменениеИКонтроль("сфпВыполнитьЗвонок")
Функция смарт_сфпВыполнитьЗвонок(ДополнительныеПараметры)
	
	#Вставка
	//++#1352 смарт: Лопато 15.06.2023 //Звонки из 1С (через городской стационарный телефон)  
	Ошибка = "";
	СтрокаПояснения = "";

	Если НЕ смартОбщегоНазначения.смартПроверитьДоступностьЗвонков() Тогда
		Ошибка = "У текущего пользователя не заполнены номера телефонов!";
	Иначе
		смартОбщегоНазначенияКлиент.смартВыполнитьЗвонок(ДополнительныеПараметры, Ошибка, СтрокаПояснения);
	КонецЕсли;	
	
	ОбработатьРезультатВызова(Ошибка, СтрокаПояснения);

	Возврат ПустаяСтрока(Ошибка);
	//--#1352 смарт: Лопато 15.06.2023
	#КонецВставки
		
	Если ПустаяСтрока(ДополнительныеПараметры.Телефон) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ContactID		= "";
	ContactName		= "";
	ContactDopInfo	= "";
	ContactImage	= ""; 
	Если ЗначениеЗаполнено(ДополнительныеПараметры.СсылкаНаОбъект) Тогда
		ContactName = сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ДополнительныеПараметры.СсылкаНаОбъект);
		Если НЕ (ТипЗнч(ДополнительныеПараметры.СсылкаНаОбъект) = Тип("Строка")) Тогда
			ContactID			= сфпСофтФонПроСервер.сфпПолучитьИдентификаторКонтакта(ДополнительныеПараметры.СсылкаНаОбъект);
			ВладелецКонтакта	= сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(ДополнительныеПараметры.СсылкаНаОбъект);
			Если ЗначениеЗаполнено(ВладелецКонтакта) Тогда
				ContactDopInfo	= сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ВладелецКонтакта);
			Иначе	
				ContactDopInfo	= "";
			КонецЕсли;	
			ContactImage		= сфпСофтФонПроСервер.сфпПолучитьАватарКонтакта(ДополнительныеПараметры.СсылкаНаОбъект, Истина);	
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.Телефон = СтрЗаменить(ДополнительныеПараметры.Телефон, "+", "");
		
	Ошибка = "";
	Если сфпСофтФонПроСервер.ИспользуемаяВерсияСофтФона() = ПредопределенноеЗначение("Перечисление.сфпВерсииСофтФон.СофтФотPROSTO") Тогда
		СтрокаПояснения = "";
		Событие = Неопределено;
		
		Если ЗначениеЗаполнено(ДополнительныеПараметры.СсылкаНаОбъект) Тогда
			сфпСофтФонПроСервер.СохранитьКонтактЗвонка(ДополнительныеПараметры.Телефон, ДополнительныеПараметры.СсылкаНаОбъект);
		КонецЕсли;
		
		сфпЛицензированиеЭкспортныеМетоды.ПозвонитьПоНомеру(ДополнительныеПараметры.Телефон, ДополнительныеПараметры.СсылкаНаОбъект, Событие, Ошибка, СтрокаПояснения);
		ОбработатьРезультатВызова(Ошибка, СтрокаПояснения);

	Иначе
		ТелефонДляВызова = ДополнительныеПараметры.Телефон;
		
		ЕстьПоддержкаDTMF = Ложь;
		
		ВерсияПанели = Лев(ПараметрыПриложения["сфпВерсияПанели"], 3);
		Если ВерсияПанели = "3.0" Тогда
			ЕстьПоддержкаDTMF = (ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ПараметрыПриложения["сфпВерсияПанели"], "3.0.3.139") >= 0);
				
		ИначеЕсли ВерсияПанели = "3.1" Тогда
			ЕстьПоддержкаDTMF = (ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ПараметрыПриложения["сфпВерсияПанели"], "3.1.3.139") >= 0);
		КонецЕсли;
			
		Если ЕстьПоддержкаDTMF Тогда
			Если ДополнительныеПараметры.Свойство("ДобавочныйНомер") Тогда
				Если ЗначениеЗаполнено(ДополнительныеПараметры.ДобавочныйНомер) Тогда
					ЗадержкаДобавочногоНомера = 0;
					Если ДополнительныеПараметры.Свойство("ЗадержкаДобавочногоНомера") Тогда
						ЗадержкаДобавочногоНомера = ДополнительныеПараметры.ЗадержкаДобавочногоНомера;
					КонецЕсли;
					ЗадержкаДобавочногоНомера = ?(ЗадержкаДобавочногоНомера = 0, 5, ЗадержкаДобавочногоНомера);
						
					СтрокаЗадержки = ",";
					Для к = 1 По ЗадержкаДобавочногоНомера Цикл
						СтрокаЗадержки = СтрокаЗадержки + "P";
					КонецЦикла;	
									
					ТелефонДляВызова = ТелефонДляВызова + СтрокаЗадержки + ДополнительныеПараметры.ДобавочныйНомер;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			Результат = сфпПанельУправления.MakeCall("", ТелефонДляВызова, ContactID, ContactName, ContactDopInfo, ContactImage);
			Если Результат = -2 Тогда
				ContactImage = "";
				Результат = сфпПанельУправления.MakeCall("", ТелефонДляВызова, ContactID, ContactName, ContactDopInfo, ContactImage);
			КонецЕсли;
			сфпДанныеЗаполнения	= ДополнительныеПараметры.ДанныеЗаполнения;
		Исключение
			Ошибка = ОписаниеОшибки();
			сфпДанныеЗаполнения	= Неопределено;
			Состояние(НСтр("ru='Не удалось создать звонок'"));	
		КонецПопытки;
	КонецЕсли;
	
	Возврат ПустаяСтрока(Ошибка);

КонецФункции
