
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ПараметрыФормы = Новый Структура("", );
		ОткрытьФорму("Справочник.Партнеры.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ПараметрыОтбора = Новый Структура("Клиент", Истина);
		
		ОткрытьФорму("Справочник.Партнеры.ФормаСписка",
		             Новый Структура("Отбор", ПараметрыОтбора),
		             ПараметрыВыполненияКоманды.Источник,
		             Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000002"),
		             ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

