#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
	НайденныйУзел = ПланыОбмена.смартОбменСоСкладомАтлант.НайтиПоНаименованию(Наименование);
	
	Если ЗначениеЗаполнено(НайденныйУзел) 
		И НайденныйУзел.Ссылка <> ЭтотОбъект.Ссылка Тогда
		
		Сообщить("Уже существует такое наименование настройки обмена. Укажите новое наименование");
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ ИспользоватьРегламентныеЗадания Тогда
		
		УдалитьРегламентноеЗадание();
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	УдалитьРегламентноеЗадание();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	ТестовыйКонтур = Ложь;
	ИдентификаторРегламентногоЗадания = НеОпределено;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРегламентноеЗадание() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Задание;
	
КонецФункции

Процедура УдалитьРегламентноеЗадание() Экспорт

	Задание = ПолучитьРегламентноеЗадание();

	Если НЕ Задание = Неопределено Тогда

		УстановитьПривилегированныйРежим(Истина);

		Задание.Удалить();

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли