
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НоваяВерсия", НоваяВерсия); 
	Параметры.Свойство("Описание", Описание);  
	Параметры.Свойство("СсылкаНаФайл", СсылкаНаФайл);
	
	Если Параметры.Свойство("МассивЗадач") Тогда
	
		МассивЗадач.ЗагрузитьЗначения(Параметры.МассивЗадач);
		
	КонецЕсли;  
	
	Если НоваяВерсия = Константы.ДЛ_НеОповещатьОВерсии.Получить() Тогда
		
		НеОповещать = Истина;	
		
	КонецЕсли;  
	
	Элементы.грСостав.Видимость = МассивЗадач.Количество() <> 0; 
	
	ОписаниеЗадач = "";
	
	Для Каждого Задача Из МассивЗадач Цикл
		
		ОписаниеЗадач = ОписаниеЗадач + "* " + Задача.Значение + Символы.ПС;		
		
	КонецЦикла; 
	
	Элементы.днМассивЗадач.Заголовок = ОписаниеЗадач;
	
КонецПроцедуры

&НаСервере
Процедура НеОповещатьПриИзмененииНаСервере()
	
	Константы.ДЛ_НеОповещатьОВерсии.Установить(?(НеОповещать, НоваяВерсия, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура НеОповещатьПриИзменении(Элемент) 
	
	НеОповещатьПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовуюВерсиюНаСервере() 	
	
	Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПараметрыФайла = ПарситьГиперссылку(СсылкаНаФайл);
		 
		ПараметрыПодключения = ДЛ_ДеловыеЛинии.ПолучитьПараметрыПодключения();
	
		Соединение = Новый HTTPСоединение(ПараметрыФайла.Сервер,,,, ДЛ_ДеловыеЛинии.НовыйИнтернетПрокси(ПараметрыПодключения.Прокси), ПараметрыПодключения.Таймаут, Новый ЗащищенноеСоединениеOpenSSL());
		Запрос     = Новый HTTPЗапрос(ПараметрыФайла.ПутьКФайлу);
		
		Ответ      = Соединение.Получить(Запрос);	
	
		Если Ответ.КодСостояния = 200 Тогда 
			
			Расширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "ДоставкаДеловыеЛинии"));
			
			Если Расширения.Количество() Тогда 
				
				Если Прав(ПараметрыФайла.ПутьКФайлу, 4) = ".cfe" Или СтрНайти(ПараметрыФайла.ПутьКФайлу, ".cfe?") > 0 Тогда					
					
					ОбновитьРасширение(Расширения[0], Ответ.ПолучитьТелоКакДвоичныеДанные());	
					
				КонецЕсли; 			
				
			КонецЕсли;
			
		Иначе
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ответ.ПолучитьТелоКакСтроку());
		
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьРасширение(Расширение, ДвоичныеДанные)
	
	Попытка
		
		Расширение.Записать(ДвоичныеДанные);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расширение обновлено. Перезапустите 1С!");
		
	Исключение   
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки; 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовуюВерсию(Команда)  
	
	УстановитьНовуюВерсиюНаСервере(); 
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПарситьГиперссылку(Гиперссылка) Экспорт 
	
	ТекстСсылки = СтрПолучитьСтроку(СтрЗаменить(СокрЛП(Гиперссылка), "://" , Символы.ПС), 2); 
	ПозицияКонцаСервера = Найти(ТекстСсылки, "/");
	
    Возврат Новый Структура("Сервер, ПутьКФайлу", Сред(ТекстСсылки, 1, ПозицияКонцаСервера - 1), Сред(ТекстСсылки,  ПозицияКонцаСервера + 1));
		
КонецФункции


