
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ВидФормы") Тогда
		Отказ = Истина;
		
	ИначеЕсли Параметры.ВидФормы = "СофтФон" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСофтФон;
		Элементы.ДекорацияНастройкаПодключенияСофтФон.Гиперссылка = ПравоДоступа("Администрирование", Метаданные);
		Если Параметры.Свойство("ТекстОшибки") Тогда
			ОписаниеОшибки = Параметры.ТекстОшибки;
		КонецЕсли;	
		
	ИначеЕсли Параметры.ВидФормы = "СМС" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСМС;
		Элементы.ДекорацияНастройкаПодключенияСМС.Гиперссылка = ПравоДоступа("Администрирование", Метаданные);
		
	ИначеЕсли Параметры.ВидФормы = "Google" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаGoogle;
		Элементы.ДекорацияGooglreНастройкаПодключения.Гиперссылка = ПравоДоступа("Администрирование", Метаданные);
		
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияПодробнаяИнформация".
//
Процедура ДекорацияПодробнаяИнформация(Элемент)
	ПерейтиПоНавигационнойСсылке("http://rarus.ru/1c-crm/1c-rarus-integratsiya-s-telefoniey-softfon-redaktsiya-3/");
КонецПроцедуры // ДекорацияПодробнаяИнформация()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияНастройкаПодключенияСофтФон".
//
Процедура ДекорацияНастройкаПодключенияСофтФон(Элемент)
	
	//ФормаНастроек = ПолучитьФорму("ОбщаяФорма.сфпОбщиеНастройки");
	//Если ФормаНастроек.Открыта() Тогда
	//	ФормаНастроек.Активизировать();
	//Иначе
	//	ФормаНастроек.Открыть();
	//КонецЕсли;
	
	ИмяОткрываемойФормы = "Обработка.сфпАРМ_Телефония.Форма.Форма";
	ОткрытьФорму(ИмяОткрываемойФормы);
	
КонецПроцедуры // ДекорацияНастройкаПодключенияСофтФон()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияНастройкаПодключенияСМС".
//
Процедура ДекорацияНастройкаПодключенияСМС(Элемент)
	ФормаНастроек = ПолучитьФорму("ОбщаяФорма.НастройкаОтправкиSMS");
	Если ФормаНастроек.Открыта() Тогда
		ФормаНастроек.Активизировать();
	Иначе
		ФормаНастроек.Открыть();
	КонецЕсли;	
КонецПроцедуры // ДекорацияНастройкаПодключенияСМС()

&НаКлиенте
// Процедура - обработчик события "Нажатие элемента" формы "ДекорацияGoogleПодробнаяИнформация".
//
Процедура ДекорацияGoogleПодробнаяИнформацияНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапускПриложенияНажатие", ЭтотОбъект);
	НачатьЗапускПриложения(ОписаниеОповещения, "http://daclouds.ru/#order_subscribe");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	Если Найти(НавигационнаяСсылка, "@") > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, НавигационнаяСсылка);
		НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключениеРасширенияРаботыСФайламиЗавершение(Результат, НавигационнаяСсылка) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапускПриложенияНажатие", ЭтотОбъект);
	НачатьЗапускПриложения(ОписаниеОповещения, "mailto:" + НавигационнаяСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложенияНажатие(КодВозврата, ДополнительныеПараметры) Экспорт
	// Действие не требуется	
	Результат = Истина;
КонецПроцедуры

#КонецОбласти
