#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ТекстРасчетаДоступныхОстатков")
Функция смарт_ТекстРасчетаДоступныхОстатков()

	Текст =
	РегистрыНакопления.ГрафикПоступленияТоваров.ТекстЗапросаОборотов(Ложь)
	+ РегистрыНакопления.ГрафикПоступленияТоваров.ТекстЗапросаОстатков(Ложь)
	+ "ВЫБРАТЬ
	|	Т.Номенклатура                                КАК Номенклатура,
	|	Т.Характеристика                              КАК Характеристика,
	|	Т.Склад                                       КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)  КАК Назначение,
	|	ЕСТЬNULL(ОборотыГрафика.Период,
	|		ДАТАВРЕМЯ(1,1,1))                         КАК Период,
	|	ЕСТЬNULL(ОборотыГрафика.Количество,0)         КАК Оборот,
	|	ЕСТЬNULL(ОстаткиГрафика.Количество,0)         КАК Остаток
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ЕСТЬNULL(ОборотыГрафика.КоличествоГарантийные, 0)        КАК ОборотГарантийные,
	|	ЕСТЬNULL(ОстаткиГрафика.КоличествоГарантийные, 0)        КАК ОстатокГарантийные
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ИЗ
	|	ВтТовары КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиГрафика КАК ОстаткиГрафика
	|		ПО Т.Номенклатура   = ОстаткиГрафика.Номенклатура
	|		 И Т.Характеристика = ОстаткиГрафика.Характеристика
	|		 И Т.Склад          = ОстаткиГрафика.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОборотыГрафика КАК ОборотыГрафика
	|		ПО Т.Номенклатура   = ОборотыГрафика.Номенклатура
	|		 И Т.Характеристика = ОборотыГрафика.Характеристика
	|		 И Т.Склад          = ОборотыГрафика.Склад
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад,
	|	Период УБЫВ
	|;
	|
	|/////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура                                КАК Номенклатура,
	|	Т.Характеристика                              КАК Характеристика,
	|	Т.Склад                                       КАК Склад,
	|	ДоступныеОстаткиДоИзменения.ДатаДоступности   КАК ДатаДоступности,
	|	ДоступныеОстаткиДоИзменения.Количество        КАК Количество
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	|	, ДоступныеОстаткиДоИзменения.смартКоличествоГарантийные        КАК смартКоличествоГарантийные
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	|ИЗ
	|	ВтТовары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ДоступныеОстаткиДоИзменения
	|		ПО Т.Номенклатура   = ДоступныеОстаткиДоИзменения.Номенклатура
	|		 И Т.Характеристика = ДоступныеОстаткиДоИзменения.Характеристика
	|		 И Т.Склад          = ДоступныеОстаткиДоИзменения.Склад
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад,
	|	ДатаДоступности УБЫВ";

	Возврат Текст;

КонецФункции

#КонецОбласти