

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	//++ #Б-5892 смарт: Фролов 07.04.2026 //Создание механизма гибкой настройки ЗРР.
	СписокВыбораЭлемент = Элементы.КонтрольПереходовПоЭтапамИмяРеквизита.СписокВыбора; 
	
	СписокВыбораЭлемент.Добавить("ИтогоБесплатныеУслуги", "Итого бесплатные услуги (руб.)");
	СписокВыбораЭлемент.Добавить("ПояснениеПоВалюте", "Внимание! Вне зависимости от вида цена, цены всегда пересчитываются в Рубли");
	СписокВыбораЭлемент.Добавить("ПостроениеЦветовыхПрофилей", "Построение цветовых профилей");
	СписокВыбораЭлемент.Добавить("ПереченьНеобходимыхРабот", "Перечень необходимых работ");
	СписокВыбораЭлемент.Добавить("ДокументыОтКлиента", "Документы от клиента");
	СписокВыбораЭлемент.Добавить("КтоОплачиваетВыездСИ", "Выезд сервисного инженера оплачивает");
	СписокВыбораЭлемент.Добавить("ДоговорНаСервисноеОбслуживание", "Договор на сервисное обслуживание");
	СписокВыбораЭлемент.Добавить("КомментарийМенеджера", "Комментарий менеджера");
	СписокВыбораЭлемент.Добавить("ДанныеИзПисьмаОснования", "Данные из письма основания");
	СписокВыбораЭлемент.Добавить("ОписаниеНеисправности", "Описание неисправности");
	СписокВыбораЭлемент.Добавить("ЗаключениеИнженераОВозможностиДопГарантии", "Возможность предоставления доп. гарантии");
	СписокВыбораЭлемент.Добавить("КомментарийОВозможномПредоставленииДопГарантии", "Комментарий о возможном предоставлении доп гарантии");
	СписокВыбораЭлемент.Добавить("НеобходимыеЗапчасти", "Необходимые запчасти");
	СписокВыбораЭлемент.Добавить("ЗаключениеОВыезде", "Заключениео выезде");
	СписокВыбораЭлемент.Добавить("ОСКлиента", "ОС клиента");
	СписокВыбораЭлемент.Добавить("СостояниеЗаявки", "Состояние заявки");
	СписокВыбораЭлемент.Добавить("ПричинаЗакрытия", "Причина закрытия");
	СписокВыбораЭлемент.Добавить("ВариантПроблемы", "Вариант проблем");
	СписокВыбораЭлемент.Добавить("ГарантияПроверена", "Гарантия проверена");
	СписокВыбораЭлемент.Добавить("СерийныйНомерСверен", "Серийный номер сверен");
	СписокВыбораЭлемент.Добавить("НоменклатураПроверена", "Номенклатура проверена");
	СписокВыбораЭлемент.Добавить("ДоговорЕсть", "Договор есть");
	СписокВыбораЭлемент.Добавить("ДополнительноеСоглашение", "Дополнительное соглашение");
	СписокВыбораЭлемент.Добавить("РезультатДиагностики", "Результат диагностики");
	СписокВыбораЭлемент.Добавить("ВариантПроблемыТекст", "Вариант проблемы текст");
	СписокВыбораЭлемент.Добавить("Срочно", "Срочно");
	
	СписокВыбораЭлемент.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона = Новый ХранилищеЗначения(ЦветФона);
	ТекущийОбъект.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	ЦветФона = СправочникОбъект.ЦветФона.Получить();
	ЦветТекста = СправочникОбъект.ЦветТекста.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПереходовПоЭтапамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанныеПереходы = Элементы.ДоступныеСтатусыИПереходы.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ ТекущиеДанныеПереходы = Неопределено Тогда
		
		ТекущиеДанные.Статус = ТекущиеДанныеПереходы.Статус;	
		ТекущиеДанные.Этап = ТекущиеДанныеПереходы.Этап;	
		
	Иначе
		
		Возврат;
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти
