
#Область ПеренесеноСДоработками


// Фролов+
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Элементы.Груз.Доступность=РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов");
	ДоступностьЭлементаГруз();
	//++ смарт:rnp 221 19.07.2021
	ДобавитьЭлементыПрограммно();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.смартЗапчастиГарантийные = Истина; //чтобы документ без флажка не улетел в Бух; убрать после доработки синхронизации гарантийных запчастей
	КонецЕсли;
	//-- смарт:rnp 19.07.2021

КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Фролов+
&НаСервере
Процедура ДоступностьЭлементаГруз()
	Элементы.ДекорацияГруз.Заголовок=Объект.Груз.СтатусГруза;
	Если Объект.Груз.СтатусГруза=ПредопределенноеЗначение("Перечисление.СтатусыГрузов.Принят") Тогда 
		Элементы.Груз.ТолькоПросмотр=Не РольДоступна("ПолныеПрава");
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.Зеленый;
	Иначе
		Элементы.Груз.ТолькоПросмотр=Не (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов"));
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.ТемноОранжевый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ГрузНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	смартКешируемоеЗначениеГруза=Объект.Груз;
КонецПроцедуры

&НаКлиенте
Процедура смарт_ГрузПриИзменении(Элемент)
	Если Не Объект.Груз=смартКешируемоеЗначениеГруза Тогда 
		ТекстВопроса="При изменении 'Груза'
					|будет очищена табличная часть
					|'Расходы и прочие активы'.
					|Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСменеГруза",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСменеГруза(Результат,ДопПараметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Да Тогда
		Объект.Расходы.Очистить();
		ДоступностьЭлементаГруз();
	Иначе
		Объект.Груз=смартКешируемоеЗначениеГруза;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаполнитьПоГрузу(Команда)
	Если ЗначениеЗаполнено(Объект.Груз) Тогда 
		ОписаниеОповещения=Новый ОписаниеОповещения("ПослеВыбораПараметровЗагрузкиПоГрузу",ЭтаФорма);
		ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.Форма.смарт_ФормаЗаполненияПоГрузу",,ЭтаФорма,,,,ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Груз' не заполнено",,"Объект.Груз");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметровЗагрузкиПоГрузу(Результат,ДопПараметры)Экспорт 
	Если Не Результат=Неопределено Тогда 
		ЗаполнитьРасходыПоГрузуСервер(Результат,КэшированныеЗначения);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьРасходыПоГрузуСервер(Данные,КэшированныеЗначения)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	                    |ГДЕ
	                    |	ПриобретениеТоваровУслуг.Груз = &Груз");
	Запрос.УстановитьПараметр("Груз",Объект.Груз);
	
	Объект.Расходы.Очистить();
	
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Стр=Объект.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Данные);
		Стр.АналитикаРасходов=Рез.Ссылка;
		Стр.Количество=1;
		
		Элементы.Расходы.ТекущаяСтрока=Стр.ПолучитьИдентификатор();
		РасходыСтатьяРасходовПриИзмененииСервер(КэшированныеЗначения);
	КонецЦикла;	
КонецПроцедуры	

Процедура ДобавитьЭлементыПрограммно()
	
	//++ смарт:rnp 221 19.07.2021
	смартЗапчастиГарантийные = Элементы.Вставить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	смартЗапчастиГарантийные.Вид = ВидПоляФормы.ПолеФлажка;
	смартЗапчастиГарантийные.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	смартЗапчастиГарантийные.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
	смартЗапчастиГарантийные.Заголовок = "Запчасти гарантийные (смарт)";
	//-- смарт:rnp 19.07.2021

КонецПроцедуры 

#КонецОбласти