#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументБронирования(Ссылка) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаркетинговыеМероприятияДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.ДокументОснование = &ДокументОснование
	|	И НЕ МаркетинговыеМероприятияДокумент.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаркетинговыеМероприятияДокумент.Дата УБЫВ";
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	Возврат Документы.МаркетинговыеМероприятияДокумент.ПустаяСсылка();
КонецФункции

#КонецОбласти

#КонецЕсли