//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 11.03.2021 15:55:55- задача 552
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Элемент = Элементы.Добавить("смартЭлектроннаяПочтаНаСайте", Тип("ПолеФормы"),Элементы.СмартГруппаБитрикс);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.МаксимальнаяШирина=30;
	Элемент.АвтоМаксимальнаяШирина=Ложь;
	Элемент.ПутьКДанным = "Объект.смартЭлектроннаяПочтаНаСайте";
	
	Элемент1 = Элементы.Добавить("смартЛогинНаСайте", Тип("ПолеФормы"),Элементы.СмартГруппаБитрикс);
	Элемент1.Вид = ВидПоляФормы.ПолеВвода;
	Элемент1.МаксимальнаяШирина=30;
	Элемент1.АвтоМаксимальнаяШирина=Ложь;
	Элемент1.ПутьКДанным = "Объект.смартЛогинНаСайте";
	
	Элемент2 = Элементы.Добавить("смартТелефонНаСайте", Тип("ПолеФормы"),Элементы.СмартГруппаБитрикс);
	Элемент2.Вид = ВидПоляФормы.ПолеВвода;
	Элемент2.Заголовок="Телефон на сайте";
	Элемент2.МаксимальнаяШирина=20;
	Элемент2.АвтоМаксимальнаяШирина=Ложь;
	Элемент2.ПутьКДанным = "Объект.смартТелефонНаСайте";

	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элемент.ТолькоПросмотр = Истина;
		Элемент1.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И РольДоступна("ПолныеПрава") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	смартИдентификаторыСоответствияБитрикс.ИДсайта КАК ИДсайта
		|ИЗ
		|	РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
		|ГДЕ
		|	смартИдентификаторыСоответствияБитрикс.СсылкаМет = &СсылкаМет";
		
		
		Запрос.УстановитьПараметр("СсылкаМет", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартИдКонтактного", Тип("ДекорацияФормы"),Элементы.ГруппаСвязьСПартнером);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.ЦветТекста=Новый Цвет(0,194,0);
			НовыйЭлемент.Заголовок = ВыборкаДетальныеЗаписи.ИДсайта;
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры
