
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Смарт Фролов+ ТЗ № 77
	// Для пользователей с не полными парвами запрещаем редактировать реквизиты формы в Договоре у которого есть движения.
	Если Не РольДоступна("ПолныеПрава") И ЗначениеЗаполнено(Объект.Ссылка)
		И Справочники.ДоговорыКонтрагентов.ПоДоговоруЕстьДвижения(Объект.Ссылка) Тогда
		Элементы.смартПричинаБлокировкиДоговора.Заголовок="Реквизиты договора заблокированы! По договору есть движения в документах.";
		КнопкаРазрешитьРедактирование=Элементы.Найти("РазрешитьРедактированиеРеквизитовОбъекта");
		Если Не КнопкаРазрешитьРедактирование=Неопределено Тогда 
			КнопкаРазрешитьРедактирование.Видимость=Ложь;
		КонецЕсли;	
	КонецЕсли;		
	// Фролов-
	
	//смартКаратеев ++
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Подразделение = Пользователи.ТекущийПользователь().Подразделение;
		Объект.ТипДоговора = ?(Объект.Партнер.Клиент, Перечисления.ТипыДоговоров.СПокупателем, Перечисления.ТипыДоговоров.ПустаяСсылка());
		Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	КонецЕсли;
	//Каратеев --
	
	//смарт+ Вахов Владимир /317 / 09.04.2021   
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("СтраницаПечатьДоговоров",Тип("ГруппаФормы"),ЭтаФорма.Элементы.ГруппаСтраницы,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Печать договоров";
	НовыйЭлемент.Подсказка = "Страница печать договоров";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСтраницыТиповДоговоров",Тип("ГруппаФормы"),ЭтаФорма.Элементы.СтраницаПечатьДоговоров,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страницы;
	НовыйЭлемент.Заголовок = "Смарт страницы типов договоров";
	НовыйЭлемент.Подсказка = "Смарт страницы типов договоров";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСтраницаСервисныйОтдел",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницыТиповДоговоров,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Сервисный отдел";
	НовыйЭлемент.Подсказка = "Смарт страница сервисный отдел";
	
	//++ #Б4754 смарт: Шляпников 28.10.2025 / Справочник Договоры Контрагентов. Добавить новые реквизиты. 
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартВидДоговораСервисногоОтдела", "смартСтраницаСервисныйОтдел", "Вид договора", 1, "Объект.смартВидДоговораСервисногоОтдела");
	//-- #Б4754 смарт: Шляпников 28.10.2025

	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСтраницыДоговоров",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницаСервисныйОтдел,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страницы;
	НовыйЭлемент.Заголовок = "Смарт страницы договоров";
	НовыйЭлемент.Подсказка = "Смарт страницы договоров";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДоговорДГСО",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницыДоговоров,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Договор ДГСО";
	НовыйЭлемент.Подсказка = "Смарт договор ДГСО";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудование",Тип("ТаблицаФормы"),ЭтаФорма.Элементы.смартДоговорДГСО,Неопределено);
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудование";
	НовыйЭлемент.АвтоВводНовойСтроки = Истина;
	НовыйЭлемент.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.РежимВыделения = РежимВыделенияТаблицы.Множественный;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеГрафикПроведенияРабот",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудование,Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудование.ГрафикПроведенияРабот";
	НовыйЭлемент.МногострочныйРежим = Истина;
	НовыйЭлемент.РасширенноеРедактирование = Истина;
	//НовыйЭлемент.МаксимальнаяВысота = 0;
	//НовыйЭлемент.Высота = 20;
	//НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
	
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеБренд",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудование,ЭтаФорма.Элементы.смартОборудованиеГрафикПроведенияРабот);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудование.Бренд";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеСерия",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудование,ЭтаФорма.Элементы.смартОборудованиеБренд);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудование.Серия";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеОборудованиеКлиента",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудование,ЭтаФорма.Элементы.смартОборудованиеСерия);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудование.ОборудованиеКлиента";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеНомерСтроки",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудование,ЭтаФорма.Элементы.смартОборудованиеОборудованиеКлиента);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудование.НомерСтроки";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартАдресОбслуживания",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорДГСО,ЭтаФорма.Элементы.смартОборудование);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресОбслуживания";
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении","смартАдресОбслуживанияПриИзменении");
	НовыйЭлемент.УстановитьДействие("НачалоВыбора","смартАдресОбслуживанияНачалоВыбора");
	НовыйЭлемент.УстановитьДействие("Очистка","смартАдресОбслуживанияОчистка");
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора","смартАдресОбслуживанияОбработкаВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДоговорРТО",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницыДоговоров,ЭтаФорма.Элементы.смартДоговорДГСО);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Договор РТО";
	НовыйЭлемент.Подсказка = "Смарт договор РТО";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДоставкаЗаСчетЗаказчика",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорРТО,Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартДоставкаЗаСчетЗаказчика";
	
	//++ #Б-6270 смарт: Фролов 01.04.2026 //Заявка на ремонтные работы. Добавить реквизит для ДС. Обновить доработку по сервисным договорам РТО.
	смартГруппаСрокПоставки = Этаформа.Элементы.Вставить("смартГруппаДопСоглашение", Тип("ГруппаФормы"), Элементы.смартДоговорРТО);
	смартГруппаСрокПоставки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаСрокПоставки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартГруппаСрокПоставки.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДополнительноеСоглашение", Тип("ПолеФормы"), Элементы.смартГруппаДопСоглашение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартДополнительноеСоглашение";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДополнительноеСоглашениеДата", Тип("ПолеФормы"), Элементы.смартГруппаДопСоглашение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартДополнительноеСоглашениеДата";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСоглашениеПодписано", Тип("ПолеФормы"), Элементы.смартГруппаДопСоглашение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСоглашениеПодписано";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","смартСоглашениеПодписаноПриИзменении");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСоглашениеПодписаноДата", Тип("ПолеФормы"), Элементы.смартГруппаДопСоглашение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСоглашениеПодписаноДата";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Шрифт = Новый Шрифт(, , , , Истина);
	//-- #Б-6270 смарт: Фролов 01.04.2026
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДоговорПоручительства",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницыДоговоров,ЭтаФорма.Элементы.смартДоговорРТО);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Договор поручительства";
	НовыйЭлемент.Подсказка = "Смарт договор поручительства";
	
	//++ #Б-3340 смарт: Фролов 26.05.2025 //Договоры контрагентов. Доработка. Печать договоров.
	//НовыйЭлемент = Этаформа.Элементы.Вставить("смартСрокПоставки1",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорПоручительства,Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.смартСрокПоставки";
	//НовыйЭлемент.КнопкаРегулирования = Истина;
	//-- #Б-3340 смарт: Фролов 26.05.2025

	//++ #1368 смарт: Фролов 07.06.2023 //Договор на перемывку чернил  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДоговорПеремывкаЧернил",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницыТиповДоговоров,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Договор на перемывку";
	НовыйЭлемент.Подсказка = "Договор на перемывку чернил";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеПеремывка",Тип("ТаблицаФормы"),ЭтаФорма.Элементы.смартДоговорПеремывкаЧернил,Неопределено);
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудованиеПеремывка";
	НовыйЭлемент.АвтоВводНовойСтроки = Истина;
	НовыйЭлемент.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.РежимВыделения = РежимВыделенияТаблицы.Множественный;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеПеремывкаСерия",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудованиеПеремывка,Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудованиеПеремывка.Серия";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеПеремывкаОборудованиеКлиента",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудованиеПеремывка,ЭтаФорма.Элементы.смартОборудованиеПеремывкаСерия);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудованиеПеремывка.ОборудованиеКлиента";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОборудованиеПеремывкаНомерСтроки",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартОборудованиеПеремывка,ЭтаФорма.Элементы.смартОборудованиеПеремывкаОборудованиеКлиента);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОборудованиеПеремывка.НомерСтроки";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартАдресОбслуживания1",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорПеремывкаЧернил,ЭтаФорма.Элементы.смартОборудованиеПеремывка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресОбслуживания";
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении","смартАдресОбслуживанияПриИзменении");
	НовыйЭлемент.УстановитьДействие("НачалоВыбора","смартАдресОбслуживанияНачалоВыбора");
	НовыйЭлемент.УстановитьДействие("Очистка","смартАдресОбслуживанияОчистка");
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора","смартАдресОбслуживанияОбработкаВыбора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСрокВыполненияРабот",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорПеремывкаЧернил,ЭтаФорма.Элементы.смартАдресОбслуживания1);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСрокВыполненияРабот";
	//-- #1368 смарт: Фролов 07.06.2023
	
	//++ #Б-3340 смарт: Фролов 26.05.2025 //Договоры контрагентов. Доработка. Печать договоров.
	//НовыйЭлемент = Этаформа.Элементы.Вставить("смартПоручитель",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорПоручительства,ЭтаФорма.Элементы.смартСрокПоставки1); 
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартПоручитель",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартДоговорПоручительства);
	//-- #Б-3340 смарт: Фролов 26.05.2025
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартПоручитель";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСтраницаКоммерческийОтдел",Тип("ГруппаФормы"),ЭтаФорма.Элементы.смартСтраницыТиповДоговоров,ЭтаФорма.Элементы.смартСтраницаСервисныйОтдел);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Коммерческий отдел";
	НовыйЭлемент.Подсказка = "Смарт страница коммерческий отдел";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартШаблонБренда",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартШаблонБренда";
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.РедактированиеТекста = Ложь;
	
	//++ #1497 смарт: Фролов 12.10.2023 //Рефакторинг получения списка шаблонов бренда
	СписВыб=смартСервер.ПолучитьСписокШаблоновБренда(Объект.Организация);
	//-- #1497 смарт: Фролов 12.10.2023

	Для Каждого ЭлементСписка Из СписВыб Цикл
		НовыйЭлемент.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла; 
	
	//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСкладСамовывоза",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСкладСамовывоза";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартАдресПусконаладки",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресПусконаладки";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");; 
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартАдресДоставки",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АдресДоставки";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");  
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартУполномоченноеЛицоЗаПодписаниеДоговораФИО",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартУполномоченноеЛицоЗаПодписаниеДоговораФИО";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");

	НовыйЭлемент = Этаформа.Элементы.Вставить("смартУполномоченноеЛицоЗаПодписаниеДоговораДолжность",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартУполномоченноеЛицоЗаПодписаниеДоговораДолжность";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");

	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОснованиеПодписи",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОснованиеПодписи";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");  
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартЭлектроннаяПочтаДляДоговора",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартЭлектроннаяПочтаДляДоговора";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартТелефонДляДоговора",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартТелефонДляДоговора";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартТекстЗаданияНаПодготовку",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартТекстЗаданияНаПодготовку";
	НовыйЭлемент.МногострочныйРежим = Истина;
	НовыйЭлемент.Высота=10;         
	НовыйЭлемент.Ширина=20;
	НовыйЭлемент.ТолькоПросмотр=Истина;
	
	ТаблицаШаблоныБрендов = ЭтаФорма.Элементы.Добавить("ШаблоныБрендов", Тип("ТаблицаФормы"),ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел);
	ТаблицаШаблоныБрендов.Заголовок = "Шаблоны брендов (смарт)"; 
	ТаблицаШаблоныБрендов.ПутьКДанным = "Объект.смартШаблоныБренда"; 
	ТаблицаШаблоныБрендов.Высота=4;
	ТаблицаШаблоныБрендов.Ширина=30;
	ТаблицаШаблоныБрендов.ТолькоПросмотр=Истина;
 
	ЭлементТаблицыФормы = Элементы.Добавить("ШаблоныБрендовШаблонБренда", Тип("ПолеФормы"),ТаблицаШаблоныБрендов);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартШаблоныБренда.ШаблонБренда";
	ЭлементТаблицыФормы.Ширина=10;
 
	ЭлементТаблицыФормы = Элементы.Добавить("ШаблоныБрендовОборудование", Тип("ПолеФормы"),ТаблицаШаблоныБрендов);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартШаблоныБренда.Оборудование";
	ЭлементТаблицыФормы.Ширина=20; 
	
	Если ЗначениеЗаполнено(Объект.смартЗаказКлиента) Тогда
		смартГруппаДокументОснование = Этаформа.Элементы.Вставить("смартГруппаДокументОснование", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаОсновное,ЭтаФорма.Элементы.ГруппаШапкаДоговора);
		смартГруппаДокументОснование.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		смартГруппаДокументОснование.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		смартГруппаДокументОснование.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		смартГруппаДокументОснование.ОтображатьЗаголовок = Ложь;

		НовыйЭлемент = Этаформа.Элементы.Добавить("ТекстДокументОснование",Тип("ДекорацияФормы"),смартГруппаДокументОснование);
		НовыйЭлемент.Вид  = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок       = "Документ основание: ";
		
		НовыйЭлемент = Этаформа.Элементы.Добавить("смартЗаказКлиента",Тип("ДекорацияФормы"),смартГруппаДокументОснование);
		НовыйЭлемент.Вид  = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.Заголовок       = ""+Объект.смартЗаказКлиента+"";
		НовыйЭлемент.УстановитьДействие("Нажатие", "смартЗаказКлиентаНажатие");
	КонецЕсли;
	

	//-- #1334 смарт: Фролов 03.04.2023
	//++ #Б2762 смарт: Шляпников 08.04.2025 / Автоматические уведомления для Партнёров
	смартГруппаСрокПоставки = Этаформа.Элементы.Вставить("смартГруппаСрокПоставки", Тип("ГруппаФормы"), ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел, ЭтаФорма.Элементы.смартШаблонБренда);
	смартГруппаСрокПоставки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаСрокПоставки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартГруппаСрокПоставки.ОтображатьЗаголовок = Ложь;
	смартГруппаСрокПоставки.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартОтветственныйЗаПодписаниеДоговора,ПолныеПрава");
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартСрокПоставки", Тип("ПолеФормы"), смартГруппаСрокПоставки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСрокПоставки";
	НовыйЭлемент.КнопкаРегулирования = Истина;
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартПродлениеСрокаПоставки", Тип("ПолеФормы"), смартГруппаСрокПоставки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартПродлениеСрокаПоставки";
	НовыйЭлемент.КнопкаРегулирования = Истина;
	
	смартГруппаВидДоговора = Этаформа.Элементы.Вставить("смартГруппаВидДоговора", Тип("ГруппаФормы"), ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел, смартГруппаСрокПоставки);
	смартГруппаВидДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВидДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	смартГруппаВидДоговора.ОтображатьЗаголовок = Ложь;

	НовыйЭлемент = Этаформа.Элементы.Добавить("смартВидДоговора", Тип("ПолеФормы"), смартГруппаВидДоговора);
	//-- #Б2762 смарт: Шляпников 08.04.2025
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартВидДоговора";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","смартВидДоговораПриИзменении");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОтветственноеЛицоКонтрагента",Тип("ПолеФормы"),ЭтаФорма.Элементы.СтраницаПечатьДоговоров,ЭтаФорма.Элементы.смартСтраницыТиповДоговоров);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОтветственноеЛицоКонтрагента";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОтветственноеЛицоОрганизации",Тип("ПолеФормы"),ЭтаФорма.Элементы.СтраницаПечатьДоговоров,ЭтаФорма.Элементы.смартОтветственноеЛицоКонтрагента);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОтветственноеЛицоОрганизации";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора","смартОтветственноеЛицоОрганизацииНачалоВыбора");
	//++ #1272 смарт: Фролов 26.04.2023 //Функционал печати договора из Заказа клиента -изменить шаблон  
	//НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора"); //+- смарт:Каратеев 28.04.2023//Убрал блокировку, СЦ нужно для печати своих договоров
	//-- #1272 смарт: Фролов 26.04.2023
	//смарт- Вахов Владимир /317 / 09.04.2021
	//смарт+ Вахов Владимир /568 / 28.06.2021   
	//++ #Б2764 смарт: Шляпников 03.04.2025 / Автоматические уведомления для менеджеров.
	//УБРАЛ КОД
	//ЭлементСрокПоставки = Элементы.Найти("смартСрокПоставки");
	//Если ЭлементСрокПоставки <> Неопределено Тогда
	//	ЭлементСрокПоставки.Видимость = Ложь;
	//КонецЕсли;
	//-- #Б2764 смарт: Шляпников 03.04.2025
	//смарт- Вахов Владимир /568 / 28.06.2021	
	
	//++ #5440 смарт: Тимофеева 20.01.26 / Новая ставка НДС22. Доработки. Справочник Договоры Контрагентов.

	////смарт+ Вахов Владимир /317 / 05.05.2021	
	//Если Объект.Ссылка.Пустая() 
	//	И Объект.Организация = Справочники.Организации.НайтиПоНаименованию("СМАРТ-Т ООО")
	//	И Не ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
	//	Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	//КонецЕсли;   
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		И ЭтоОрганизацияГруппыКомпанийРФ(Объект.Организация)
		И Объект.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		И НЕ ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
	КонецЕсли;
	//-- #5440 смарт: Тимофеева 20.01.26
	
	//смарт+ Вахов Владимир /317 / 05.05.2021	
	//++ #1436 смарт: Лопато 25.09.2023 //Проверка валюты в Заказе и Договоре при проведении 
	Справочники.ДоговорыКонтрагентов.смартПроставитьГруппуФинансовогоУчета(Объект);
	//-- #1436 смарт: Лопато 25.09.2023
	
	//смарт+ Вахов Владимир /398 / 17.03.2021   
	смартЗаполнитьСписокВыбораАдресаОбслуживания();
	//смарт- Вахов Владимир /398 / 17.03.2021
	
	//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГрузополучатель", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаПартнерКонтрагент);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартГрузополучатель";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартГрузополучательПриИзменении");
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.МаксимальнаяШирина = 29;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартАдресГрузополучателя", Тип("ДекорацияФормы"), ЭтаФорма.Элементы.ГруппаПартнерКонтрагент);
	НовыйЭлемент.МаксимальнаяШирина = 29;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;

	смартУстановитьВидимостьДанныеПолейГрузополучателя();
	//--#1138 смарт: Лопато 26.09.2022
	
	//#1329 смарт: Лопато 21.03.2023 //Признак подписания договора
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаСтатусДоговора", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаШапкаПраво, ЭтаФорма.Элементы.ГруппаПериодДействия);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.Статус, Элементы.смартГруппаСтатусДоговора); 
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартДоговорПодписан", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаСтатусДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартДоговорПодписан";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	//--#1329 смарт: Лопато 21.03.2023
	
	//++ #Б-3512 смарт: Фролов 19.06.2025 //Договоры контрагентов. Доработка. Дополнительные сведения
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартДоговорПодписанПриИзменении");
	
	НовыйЭлемент = Элементы.Вставить("смартДекорацияДатаПодписания", Тип("ДекорацияФормы"), Элементы.смартГруппаСтатусДоговора);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = ?(ЗначениеЗаполнено(Объект.смартДатаПодписания), Формат(Объект.смартДатаПодписания, "ДФ=dd.MM.yyyy"), "");
	НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
	НовыйЭлемент.Шрифт = Новый Шрифт(, , , , Истина);
	
	
	НовыйЭлемент = Элементы.Вставить("смартГруппаКонтрагентЛизинг", Тип("ГруппаФормы"), Элементы.ГруппаПартнерКонтрагент, Элементы.ГруппаИндексыСПАРКРиски);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.Контрагент, Элементы.смартГруппаКонтрагентЛизинг); 
	
	НовыйЭлемент = Элементы.Вставить("смартДекорацияКонтрагентЛизинг", Тип("ДекорацияФормы"), Элементы.смартГруппаКонтрагентЛизинг);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = ?(ЗначениеЗаполнено(Объект.Контрагент) И Объект.Контрагент.смартЛизинговаяКомпания, "ЛИЗИНГ", "");
	НовыйЭлемент.ЦветТекста = Новый Цвет(0, 150, 70);
	НовыйЭлемент.Шрифт = Новый Шрифт(, , , , Истина);
	//-- #Б-3512 смарт: Фролов 19.06.2025
	
	//++ #Б-1728 смарт: Фролов 25.12.2024 //Создание пользователя ИМ на основании договора поставки. Подготовка переменных текста
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартКонтактноеЛицоДляЛК",Тип("ПолеФормы"),  Элементы.смартСтраницаКоммерческийОтдел, Элементы.смартТекстЗаданияНаПодготовку);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартКонтактноеЛицоДляЛК";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартТелефонДляЛК",Тип("ПолеФормы"),  Элементы.смартСтраницаКоммерческийОтдел, Элементы.смартТекстЗаданияНаПодготовку);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартТелефонДляЛК";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартЭлектроннаяПочтаДляЛК",Тип("ПолеФормы"),  Элементы.смартСтраницаКоммерческийОтдел, Элементы.смартТекстЗаданияНаПодготовку);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартЭлектроннаяПочтаДляЛК";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("смартОтветственныйЗаПодписаниеДоговора");
	//-- #Б-1728 смарт: Фролов 25.12.2024
	
	//++ #Б-2064 смарт: Фролов 31.01.2025 //Создание пользователя ИМ на основании договора поставки. Регистрация клиента на сайте.
	МассивДобавляемыхРеквизитов = Новый Массив;                   
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартДоговорПодписанКонтроль", Новый ОписаниеТипов("Булево"), ""));
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	ЭтаФорма.УстановитьДействие("ПриЗаписиНаСервере", "смартПриЗаписиНаСервере");
	//-- #Б-2064 смарт: Фролов 31.01.2025
	
	//++ #Б2762 смарт: Шляпников 08.04.2025 / Автоматические уведомления для Партнёров
	Если ДоступностьОтправкиУведомленияОГотовностиКПередаче() Тогда
		
		Команда = ЭтаФорма.Команды.Добавить("смартОтправитьУведомлениеОГотовностиКПередаче");
		Команда.Заголовок = "Отправить Уведомление о готовности к передаче";
		Команда.Действие = "смартОтправитьУведомлениеОГотовностиКПередаче";
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартОтправитьУведомлениеОГотовностиКПередаче", Тип("КнопкаФормы"), смартГруппаВидДоговора);
		НовыйЭлемент.Заголовок = "Отправить Уведомление о готовности к передаче";
		НовыйЭлемент.ИмяКоманды = "смартОтправитьУведомлениеОГотовностиКПередаче";
		
	КонецЕсли;
	//-- #Б2762 смарт: Шляпников 08.04.2025
	
	//++ #Б-3346 смарт: Лопато 17.06.2025 //Печать договора из Заказа клиента и Договор контрагента. Доработка Условий оплаты. Этап 2.  
	ТаблицаПравилаОплаты = ЭтаФорма.Элементы.Добавить("ПравилаОплаты", Тип("ТаблицаФормы"), ЭтаФорма.Элементы.смартСтраницаКоммерческийОтдел);
	ТаблицаПравилаОплаты.Заголовок = "Правила оплаты (смарт)"; 
	ТаблицаПравилаОплаты.ПутьКДанным = "Объект.смартПравилаОплаты"; 
	ТаблицаПравилаОплаты.Высота = 4;
	ТаблицаПравилаОплаты.Ширина = 30;
	ТаблицаПравилаОплаты.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	
	//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
	ТаблицаПравилаОплаты.УстановитьДействие("ПриИзменении", "смартТаблицаПравилаОплатыПриИзменении");
	
	МассивДобавляемыхРеквизитов = Новый Массив;                   
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("смартТаблицаПравилаОплатыИзменена", Новый ОписаниеТипов("Булево"), ""));
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	//-- #3940 смарт: Ермаков 04.08.2025
	
	ЭлементТаблицыФормы = Элементы.Добавить("ПравилаОплатыНомерСтроки", Тип("ПолеФормы"), ТаблицаПравилаОплаты);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартПравилаОплаты.НомерСтроки";
	ЭлементТаблицыФормы.Ширина = 4;
 
	ЭлементТаблицыФормы = Элементы.Добавить("ПравилаОплатыВариантОплаты", Тип("ПолеФормы"), ТаблицаПравилаОплаты);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартПравилаОплаты.ВариантОплаты";
	ЭлементТаблицыФормы.Ширина = 10; 
 
	ЭлементТаблицыФормы = Элементы.Добавить("ПравилаОплатыДатаПлатежа", Тип("ПолеФормы"), ТаблицаПравилаОплаты);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартПравилаОплаты.ДатаПлатежа";
	ЭлементТаблицыФормы.Ширина = 10; 
 
	ЭлементТаблицыФормы = Элементы.Добавить("ПравилаОплатыДни", Тип("ПолеФормы"), ТаблицаПравилаОплаты);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартПравилаОплаты.Дни";
	ЭлементТаблицыФормы.Ширина = 5; 
 
	ЭлементТаблицыФормы = Элементы.Добавить("ПравилаОплатыПроцентПлатежа", Тип("ПолеФормы"), ТаблицаПравилаОплаты);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартПравилаОплаты.ПроцентПлатежа";
	ЭлементТаблицыФормы.Ширина = 5; 
 
	ЭлементТаблицыФормы = Элементы.Добавить("ПравилаОплатыУведомление", Тип("ПолеФормы"), ТаблицаПравилаОплаты);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартПравилаОплаты.Уведомление";
	ЭлементТаблицыФормы.Ширина = 30; 
	//-- #Б-3346 смарт: Лопато 17.06.2025

	//++ #Б-3940 смарт: Лопато 30.07.2025 //Договор клиента. Дополнения.  
	Если РольДоступна("смартОтветственныйЗаПодписаниеДоговора") Тогда
		
		ТаблицаПравилаОплаты.ТолькоПросмотр = Ложь;
		ТаблицаПравилаОплаты.ИзменятьСоставСтрок = Ложь;
		ТаблицаПравилаОплаты.ИзменятьПорядокСтрок = Ложь;
		
		Для Каждого ЭлементТаблицаПравилаОплаты Из ТаблицаПравилаОплаты.ПодчиненныеЭлементы Цикл
			
			Если НЕ (ЭлементТаблицаПравилаОплаты.Имя = "ПравилаОплатыДатаПлатежа"
					 ИЛИ ЭлементТаблицаПравилаОплаты.Имя = "ПравилаОплатыДни"
					 ИЛИ ЭлементТаблицаПравилаОплаты.Имя = "ПравилаОплатыПроцентПлатежа"
					 ИЛИ ЭлементТаблицаПравилаОплаты.Имя = "ПравилаОплатыУведомление") Тогда

				ЭлементТаблицаПравилаОплаты.ТолькоПросмотр = Истина;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	//-- #Б-3940 смарт: Лопато 30.07.2025
	
	//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
    Элементы.ГруппаКонтрольЗадолженности.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартОтветственныйЗаПодписаниеДоговора");
	//-- #4822 смарт: Тимофеева 02.04.2026
КонецПроцедуры

&НаСервере
&После("ОрганизацияПриИзмененииСервер")
Процедура смарт_ОрганизацияПриИзмененииСервер()
	
	//смартКаратеев ++
	Если Объект.Организация.ИНН = "7709461879" Тогда
		
		РежимНалогообложения = 0;
		Объект.НалогообложениеНДСОпределяетсяВДокументе = ?(РежимНалогообложения = 0, Истина, Ложь);
		Элементы.НалогообложениеНДС.Доступность = ?(РежимНалогообложения = 0, Истина, Ложь);
		
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		//++ #5440 смарт: Тимофеева 20.01.26 / Новая ставка НДС22. Доработки. Справочник Договоры Контрагентов.
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
		//-- #5440 смарт: Тимофеева 20.01.26

	КонецЕсли;
	//Каратеев --
	
КонецПроцедуры

&НаСервере
&После("ПорядокОплатыПриИзмененииСервер")
Процедура смарт_ПорядокОплатыПриИзмененииСервер()
	//смарт+ Вахов Владимир /317 / 05.05.2021	
	//++ #1436 смарт: Лопато 25.09.2023 //Проверка валюты в Заказе и Договоре при проведении 
	Справочники.ДоговорыКонтрагентов.смартПроставитьГруппуФинансовогоУчета(Объект);
	//-- #1436 смарт: Лопато 25.09.2023
КонецПроцедуры

&НаКлиенте
Процедура смартОтветственноеЛицоОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//смарт+ Вахов Владимир /317 / 09.03.2021   
	
	СтандартнаяОбработка = Ложь;
	ДанныеДляСпискаВыбора = смартПолучитьДанныеДляСпискаВыбора();
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ДанныеДляСпискаВыбора);
	
КонецПроцедуры

&НаСервере	
Функция смартПолучитьДанныеДляСпискаВыбора()
//смарт+ Вахов Владимир /317 / 09.03.2021   
	
	МассивОтветственныхЛиц = Новый Массив;
	Отбор = Новый Структура("Дата, Организация", Объект.Дата, Объект.Организация);	
	ТЗОЛ =  ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Отбор);
	ТЗОЛ.Сортировать("Наименование Возр");
	МассивОтветственныхЛиц = ТЗОЛ.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивОтветственныхЛиц;			
	
КонецФункции

&НаКлиенте
Процедура смартВидДоговораПриИзменении(Элемент)
//смарт+ Вахов Владимир /317 / 09.03.2021   
	
	Если смартСоответствуетРабочейОрганизации(Объект.Организация) И ЗначениеЗаполнено(Объект.смартВидДоговора) Тогда
		//++ смарт:Белоусова 638 17.09.2021
		Если не ЗначениеЗаполнено(объект.Дата) тогда
			ТекстОшибки = "Не заполнена дата договора!"; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Дата",,Истина);
			возврат;
		КонецЕсли;
		//-- смарт:Белоусова 638 17.09.2021
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("смартПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Проставить номер автоматически?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//++ #Б-3512 смарт: Фролов 25.06.2025 //Договоры контрагентов. Доработка. Дополнительные сведения.
Процедура смартДоговорПодписанПриИзменении(Элемент)

	Если Объект.смартДоговорПодписан Тогда
		
		Объект.смартДатаПодписания = ТекущаяДата();
		Элементы.смартДекорацияДатаПодписания.Заголовок = Формат(Объект.смартДатаПодписания, "ДФ=dd.MM.yyyy");
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-3512 смарт: Фролов 25.06.2025	

&НаСервереБезКонтекста
Функция смартСоответствуетРабочейОрганизации(Организация)
//смарт+ Вахов Владимир /317 / 09.03.2021   
	
	Соответствует = Ложь;
	
	Если Организация = Справочники.Организации.НайтиПоНаименованию("СМАРТ-Т ООО", Истина) Тогда
		Соответствует =  Истина;
	ИначеЕсли  Организация = Справочники.Организации.НайтиПоНаименованию("СМАРТ-Т ТЕКСТИЛЬ ООО", Истина) Тогда
		Соответствует =  Истина
	КонецЕсли;
	
	Возврат Соответствует;
КонецФункции	

&НаКлиенте
Процедура смартПослеЗакрытияВопроса(Результат, Параметры) Экспорт
//смарт+ Вахов Владимир /317 / 09.03.2021   
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		смартСформироватьНомерДоговора();
		//++ смарт:Белоусова 638 20.09.2021 доработка
		смарт_ЗаполнитьНаименованиеДоговора();
		смарт_ЗаполнитьНаименованиеДляПечатиДоговора();

		//-- смарт:Белоусова 638 20.09.2021  доработка
	КонецЕсли;	
	
КонецПроцедуры

//Руководство по нумерации договоров от Фаниса
//Нумерация всех договоров в пределах года.
//Шаблон номера:
//Префикс-Номер/Год
//Префиксы:
//О – оборудование,
//Р – расходка,
//ОТ – оборудование Смарт-Т Текстиль.
//Номер: число знаков – 4
//Год: 2 знака.
&НаСервере
Процедура смартСформироватьНомерДоговора()
//смарт+ Вахов Владимир /317 / 09.03.2021   
	
	Префикс = "";
	
	Если Объект.смартВидДоговора = Перечисления.смартВидыДоговоров.Оборудование 
		И Объект.Организация = Справочники.Организации.НайтиПоНаименованию("СМАРТ-Т ООО", Истина) Тогда
		Префикс = "О";
	ИначеЕсли Объект.смартВидДоговора = Перечисления.смартВидыДоговоров.Оборудование 
		И Объект.Организация = Справочники.Организации.НайтиПоНаименованию("СМАРТ-Т ТЕКСТИЛЬ ООО", Истина) Тогда	
		Префикс = "ОТ";
	Иначе
		Префикс = "Р"
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Номер КАК Номер
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка
	|	И ДоговорыКонтрагентов.Номер ПОДОБНО &Номер
	|	И ДоговорыКонтрагентов.Организация = &Организация";
	
	ГодДвеЦифры = Формат(Объект.Дата,"ДФ=гг");
	ШаблонНомера = Префикс + "-____/" + ГодДвеЦифры;
	Запрос.УстановитьПараметр("Номер", ШаблонНомера);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивНомеровДоговора = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПозицияНомера = СтрНайти(ВыборкаДетальныеЗаписи.Номер, "-");
		
		Если ПозицияНомера <> 0 Тогда 
			
			СтрНомерДоговора = Сред(ВыборкаДетальныеЗаписи.Номер, ПозицияНомера+1, 4);
			
			ЧислоНомерДоговора = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтрНомерДоговора);
			
			Если ЧислоНомерДоговора <> Неопределено Тогда
				МассивНомеровДоговора.Добавить(ЧислоНомерДоговора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивНомеровДоговора.Количество() = 0 Тогда
		ПорядковыйНомерДоговора = 1;
	Иначе
		ПорядковыйНомерДоговора = МассивНомеровДоговора[МассивНомеровДоговора.ВГраница()] + 1;
	КонецЕсли;	
	
	СтрПорядковыйНомерДоговора = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СтрЗаменить(Строка(ПорядковыйНомерДоговора), Символы.НПП, ""), 4);
	Объект.Номер = СтрШаблон("%1-%2/%3", Префикс, СтрПорядковыйНомерДоговора, ГодДвеЦифры);
	
КонецПроцедуры	
//смарт- Вахов Владимир /317 / 09.03.2021

&НаКлиенте
Процедура смартАдресОбслуживанияПриИзменении(Элемент)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	ИмяРеквизитаАдресОбслуживания = "смартАдресОбслуживания";
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	Элемент,
	Объект[ИмяРеквизитаАдресОбслуживания],
	Объект[ИмяРеквизитаАдресОбслуживания + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура смартАдресОбслуживанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	ИмяРеквизитаАдресОбслуживания = "смартАдресОбслуживания";
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	Элемент,
	Объект,
	ИмяРеквизитаАдресОбслуживания,
	СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура смартАдресОбслуживанияОчистка(Элемент, СтандартнаяОбработка)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	ИмяРеквизитаАдресОбслуживания = "смартАдресОбслуживания";
	
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
	Объект[ИмяРеквизитаАдресОбслуживания],
	Объект[ИмяРеквизитаАдресОбслуживания + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура смартАдресОбслуживанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	СтандартнаяОбработка = Ложь;
	
	смартАдресОбслуживанияПриИзменении(Элемент);
	
	Объект.смартАдресОбслуживания = ВыбранноеЗначение.АдресДоставки;
	Объект.смартАдресОбслуживанияЗначенияПолей = ВыбранноеЗначение.АдресДоставкиЗначенияПолей;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура смартЗаполнитьСписокВыбораАдресаОбслуживания()
//смарт+ Вахов Владимир /398 / 17.03.2021   
	СписокВыбора = Новый СписокЗначений;

	// Адреса из Контрагента и Партнера
	АдресаИзКонтактнойИнформации = смартАдресаИзКонтактнойИнформации(Объект.Партнер, Объект.Контрагент);
	
	Для Каждого Стр Из АдресаИзКонтактнойИнформации Цикл
		
		НайденныйЭлемент = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		
		Если НайденныйЭлемент = Неопределено Тогда
			СтруктураВыбора = смартСтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
		Иначе
			смартДозаполнитьПустыеСвойства(НайденныйЭлемент.Значение, Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	смартСкопироватьСписокЗначений(Элементы.смартАдресОбслуживания.СписокВыбора, СписокВыбора);
	//++ #1368 смарт: Фролов 07.06.2023 //Договор на перемывку чернил  
	смартСкопироватьСписокЗначений(Элементы.смартАдресОбслуживания1.СписокВыбора, СписокВыбора);
	//-- #1368 смарт: Фролов 07.06.2023
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция смартАдресаИзКонтактнойИнформации(Партнер, Контрагент)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Партнер
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Контрагент
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
		
	Запрос.УстановитьПараметр("Партнер", 	Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция смартСтруктураВыбора()
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции

&НаСервереБезКонтекста
Процедура смартДозаполнитьПустыеСвойства(СтруктураПриемник, Источник)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура смартСкопироватьСписокЗначений(СписокПриемник, СписокИсточник)
//смарт+ Вахов Владимир /398 / 17.03.2021   
	
	СписокПриемник.Очистить();
	Для Каждого Элемент Из СписокИсточник Цикл
		СписокПриемник.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&После("ПартнерПриИзмененииНаСервере")
Процедура смарт_ПартнерПриИзмененииНаСервере()
	
	//смарт+ Вахов Владимир /398 / 17.03.2021   
	смартЗаполнитьСписокВыбораАдресаОбслуживания();
	//смарт- Вахов Владимир /398 / 17.03.2021
	
КонецПроцедуры

&НаСервере
&После("КонтрагентПриИзмененииНаСервере")
Процедура смарт_КонтрагентПриИзмененииНаСервере()
	//смарт+ Вахов Владимир /398 / 17.03.2021   
	смартЗаполнитьСписокВыбораАдресаОбслуживания();
	//смарт- Вахов Владимир /398 / 17.03.2021
	
	//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
	смартУстановитьСписокВыбораГрузополучателя(Объект.Контрагент);
	//--#1138 смарт: Лопато 26.09.2022

КонецПроцедуры

//++ смарт:Белоусова 638 17.09.2021

&НаКлиенте
Процедура смарт_НомерПриИзмененииПосле(Элемент)
	смарт_ЗаполнитьНаименованиеДоговора();
КонецПроцедуры
//-- смарт:Белоусова 638 17.09.2021

//++ смарт:Белоусова 638 17.09.2021
&НаСервере
Процедура смарт_ЗаполнитьНаименованиеДоговора()
	Элементы.Наименование.СписокВыбора.Очистить();
	если ЗначениеЗаполнено(объект.номер) и ЗначениеЗаполнено(объект.Дата) тогда
		Элементы.Наименование.СписокВыбора.Добавить(Объект.номер + " от " + формат(объект.Дата,"ДФ=dd.MM.yyyy"));
	КонецЕсли;;
	
	если ЗначениеЗаполнено(объект.номер) и не ЗначениеЗаполнено(объект.Дата) тогда
		Элементы.Наименование.СписокВыбора.Добавить(Объект.номер);
	КонецЕсли;

	если не ЗначениеЗаполнено(объект.номер) и не ЗначениеЗаполнено(объект.Дата) тогда
		Элементы.Наименование.СписокВыбора.Очистить();
	КонецЕсли;	
КонецПроцедуры
//-- смарт:Белоусова 638 17.09.2021

//++ смарт:Белоусова 638 20.09.2021 доработка
&НаСервере
Процедура смарт_ЗаполнитьНаименованиеДляПечатиДоговора()
	Элементы.НаименованиеДляПечати.СписокВыбора.Очистить();
	если ЗначениеЗаполнено(объект.номер) и ЗначениеЗаполнено(объект.Дата) тогда
		Элементы.НаименованиеДляПечати.СписокВыбора.Добавить(Объект.номер + " от " + формат(объект.Дата,"ДФ=dd.MM.yyyy"));
	КонецЕсли;;
	
	если ЗначениеЗаполнено(объект.номер) и не ЗначениеЗаполнено(объект.Дата) тогда
		Элементы.НаименованиеДляПечати.СписокВыбора.Добавить(Объект.номер);
	КонецЕсли;

	если не ЗначениеЗаполнено(объект.номер) и не ЗначениеЗаполнено(объект.Дата) тогда
		Элементы.НаименованиеДляПечати.СписокВыбора.Очистить();
	КонецЕсли;	
КонецПроцедуры
//-- смарт:Белоусова 638 20.09.2021 доработка


//++ смарт:Белоусова 638 17.09.2021
&НаКлиенте
Процедура смарт_ДатаПриИзмененииПосле(Элемент)
	смарт_ЗаполнитьНаименованиеДоговора();

КонецПроцедуры
//-- смарт:Белоусова 638 17.09.2021

&НаСервере 
//++ #1334 смарт: Фролов 18.04.2023 //Заявка на формирование и подписание договора из 1С  
//Процедура смарт_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
Процедура смарт_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//-- #1334 смарт: Фролов 18.04.2023	
	//++#1138 смарт: Лопато 17.10.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
	Если Перечисления.ТипыДоговоров.ЭтоДоговорПродажи(Объект.ТипДоговора) Тогда	
		Если НЕ ЗначениеЗаполнено(Объект.смартГрузополучатель) Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен грузополучатель!'"), , "смартГрузополучатель", "Объект.смартГрузополучатель");	
			Если Не УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
				Отказ = Истина;
			КонецЕсли;		
		КонецЕсли;		
	Иначе				
		Если ЗначениеЗаполнено(Объект.смартГрузополучатель) Тогда
			Объект.смартГрузополучатель = Неопределено;
		КонецЕсли;		
	КонецЕсли;	
	//--#1138 смарт: Лопато 17.10.2022
	
	//++#1575 смарт: Лопато 18.12.2023 //В договорах разрешить вариант приемки товаров только "После оформления заказа"  
	Если Объект.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
		ИЛИ Объект.ТипДоговора = Перечисления.ТипыДоговоров.ВвозИзЕАЭС
		ИЛИ Объект.ТипДоговора = Перечисления.ТипыДоговоров.Импорт Тогда
		
		Если Объект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным
		 ИЛИ Объект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеНакладных	 
		 Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В договоре на поставку в поле ""Оформление поступления доступно"" не должно быть установлено значение ""После оформления накладной""'"), , "ОформлениеОрдера");

			Отказ = Не Пользователи.ЭтоПолноправныйПользователь();		
			
		КонецЕсли;
		
	КонецЕсли;
	//--#1575 смарт: Лопато 18.12.2023
	
	//++ #Б-2064 смарт: Фролов 31.01.2025 //Создание пользователя ИМ на основании договора поставки. Регистрация клиента на сайте.
	ЭтаФорма.смартДоговорПодписанКонтроль = Объект.Ссылка.смартДоговорПодписан;
	//-- #Б-2064 смарт: Фролов 31.01.2025
		
КонецПроцедуры

&НаСервере
&После("ТипДоговораПриИзмененииСервер")
Процедура смарт_ТипДоговораПриИзмененииСерверПосле()
	//++#1138 смарт: Лопато 17.10.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
	смартУстановитьВидимостьДанныеПолейГрузополучателя();
	//--#1138 смарт: Лопато 17.10.2022	
КонецПроцедуры


#КонецОбласти

#Область ДоработкиСмарт

//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
&НаКлиенте
Процедура смартГрузополучательПриИзменении(Элемент)

	смартУстановитьНадписьАдресГрузополучателя(Объект.смартГрузополучатель);
	
КонецПроцедуры //--#1138 смарт: Лопато 26.09.2022

//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
&НаСервере
Процедура смартУстановитьНадписьАдресГрузополучателя(Грузополучатель)
	
	Если ЗначениеЗаполнено(Грузополучатель) Тогда
		Элементы.смартАдресГрузополучателя.Заголовок = смартПолучитьАдресГрузополучателя(Грузополучатель);
		Элементы.смартАдресГрузополучателя.ЦветТекста = Новый Цвет(0, 0, 255);
	Иначе	
		Элементы.смартАдресГрузополучателя.Заголовок = "Грузополучатель не заполнен";
		Элементы.смартАдресГрузополучателя.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
		
КонецПроцедуры //--#1138 смарт: Лопато 26.09.2022

//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
&НаСервереБезКонтекста
Функция смартПолучитьАдресГрузополучателя(Грузополучатель)
	
	Если ЗначениеЗаполнено(Грузополучатель) Тогда
		АдресГрузополучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Грузополучатель,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
			ТекущаяДатаСеанса());
	Иначе
		АдресГрузополучателя = " ";
	КонецЕсли;	
	
	Возврат АдресГрузополучателя;
	
КонецФункции //--#1138 смарт: Лопато 26.09.2022

//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
&НаСервере
Процедура смартУстановитьСписокВыбораГрузополучателя(КонтрагентДоговора)

	Элементы.смартГрузополучатель.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(КонтрагентДоговора) Тогда
		Элементы.смартГрузополучатель.СписокВыбора.Добавить(КонтрагентДоговора, "Он же");
	КонецЕсли;	
	
КонецПроцедуры //--#1138 смарт: Лопато 26.09.2022

//++#1138 смарт: Лопато 26.09.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.
&НаСервере
Процедура смартУстановитьВидимостьДанныеПолейГрузополучателя()
	
	ЭтоДоговорПродажи = Перечисления.ТипыДоговоров.ЭтоДоговорПродажи(Объект.ТипДоговора);

	Элементы.смартГрузополучатель.Видимость = ЭтоДоговорПродажи;
	Элементы.смартАдресГрузополучателя.Видимость = ЭтоДоговорПродажи;
	
	Если ЭтоДоговорПродажи Тогда
		
		смартУстановитьСписокВыбораГрузополучателя(Объект.Контрагент);
		смартУстановитьНадписьАдресГрузополучателя(Объект.смартГрузополучатель);
		
	КонецЕсли;
		
КонецПроцедуры //--#1138 смарт: Лопато 26.09.2022 

&НаКлиенте
Процедура смартЗаказКлиентаНажатие(Элемент);                                   
	ПараметрыОткрытия=Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ",Объект.смартЗаказКлиента);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента",ПараметрыОткрытия);
КонецПроцедуры

&НаСервере
//++ #Б-2064 смарт: Фролов 11.02.2025 //Создание пользователя ИМ на основании договора поставки. Регистрация клиента на сайте.
Процедура смартПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.Настройки.ДатаНачалаКонтроляПользователяИМВДоговоре)
		И ТекущийОбъект.Дата >= Справочники.смартПредопределенныеЗначения.Настройки.ДатаНачалаКонтроляПользователяИМВДоговоре Тогда
		
		Если НЕ ЭтаФорма.смартДоговорПодписанКонтроль И ТекущийОбъект.смартДоговорПодписан 
			И ЗначениеЗаполнено(ТекущийОбъект.смартКонтактноеЛицоДляЛК) 
			И НЕ ЗначениеЗаполнено(ТекущийОбъект.смартКонтактноеЛицоДляЛК.смартЛогинНаСайте) Тогда
			
			Результат = смартИнтернетМагазин.ЗарегистрироватьПользователяНаСайте(Объект.смартКонтактноеЛицоДляЛК, Объект.смартТелефонДляЛК, Объект.смартЭлектроннаяПочтаДляЛК);	
			
			Если НЕ Результат = Истина Тогда
				ОбщегоНазначения.СообщитьПользователю("Не удаллось зарегистрировать пользователя личного кабинета по причине:"
				+ Символы.ПС + Результат + Символы.ПС + "Запись не возможна!");
				Отказ = Истина;
			КонецЕсли;	
				
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-2064 смарт: Фролов 11.02.2025	

//++ #Б2762 смарт: Шляпников 08.04.2025 / Автоматические уведомления для Партнёров
&НаСервере
Функция ДоступностьОтправкиУведомленияОГотовностиКПередаче()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПроцентОплаты", 30);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ВТДанныеЗаказа
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиентаТовары.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураСегмента.Номенклатура
	|			И (НоменклатураСегмента.Сегмент.смартИдентификаторДляФормул = ""СегментАппаратноеОбеспечение"")
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Договор = &Ссылка
	|	И СостоянияЗаказовКлиентов.ПроцентОплаты >= &ПроцентОплаты
	|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТДанныеЗаказа.Ссылка.Договор КАК Договор,
	|	ВТДанныеЗаказа.Ссылка.Договор.Номер КАК ДоговорНомер,
	|	ВТДанныеЗаказа.Ссылка.Договор.Дата КАК ДоговорДата,
	|	ВТДанныеЗаказа.Ссылка.Менеджер КАК Менеджер,
	|	ВТДанныеЗаказа.Ссылка.Договор.смартУполномоченноеЛицоЗаПодписаниеДоговораФИО КАК КонтактКлиента,
	|	ВТДанныеЗаказа.Ссылка.Договор.смартЭлектроннаяПочтаДляДоговора КАК ЭлектроннаяПочтаДляДоговора,
	|	ВТДанныеЗаказа.Ссылка КАК Ссылка
	|ИЗ
	|	ВТДанныеЗаказа КАК ВТДанныеЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				(Номенклатура, Серия) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						Т.Серия
	|					ИЗ
	|						ВТДанныеЗаказа КАК Т)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТДанныеЗаказа.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТДанныеЗаказа.Серия = ТоварыНаСкладахОстатки.Серия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

//++ #Б2762 смарт: Шляпников 08.04.2025 / Автоматические уведомления для Партнёров
&НаСервере
Функция ПолучитьДанныеДляЗаполненияПисьмаДляОтправкиУведомленияОГотовностиКпередаче()
	
	Результат = Новый Структура;
	
	Тема = СтрШаблон("Уведомление о готовности к передаче по Договору поставки № %1 от %2",
							Объект.Номер,
							Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
	Результат.Вставить("Тема", Тема);
	
	Тело = СтрШаблон("Уважаемый(ая), %1!
							|
							|Просим ознакомиться с уведомлением.
				            |
							|С уважением,
							|%2
							|ООО ""СМАРТ-Т""", Объект.смартУполномоченноеЛицоЗаПодписаниеДоговораФИО);
	Результат.Вставить("Текст", Тело);
	
	//Получатель = Новый Структура("Адрес,Представление", Объект.смартЭлектроннаяПочтаДляДоговора, Объект.смартУполномоченноеЛицоЗаПодписаниеДоговораФИО);
	//Результат.Вставить("СписокАдресов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Получатель));
	Результат.Вставить("Кому", Объект.смартЭлектроннаяПочтаДляДоговора);
	
	Вложение = Новый Структура("АдресВоВременномХранилище,Представление");
	Вложение.АдресВоВременномХранилище = Справочники.ДоговорыКонтрагентов.ПолучитьФайлУведомленияОГотовностиКПередаче(Объект.Ссылка);
	Вложение.Представление = СтрШаблон("%1.pdf", Тема);
	Результат.Вставить("Вложения", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение));
	
	Возврат Результат;
							
КонецФункции

//++ #Б2762 смарт: Шляпников 08.04.2025 / Автоматические уведомления для Партнёров
&НаКлиенте
Процедура смартОтправитьУведомлениеОГотовностиКПередаче(Команда)
	
	ПараметрыЗаполнения = ПолучитьДанныеДляЗаполненияПисьмаДляОтправкиУведомленияОГотовностиКпередаче();
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыЗаполнения);
	
КонецПроцедуры

//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
&НаКлиенте
Процедура смартТаблицаПравилаОплатыПриИзменении(Элемент) Экспорт
	
	//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
	ЭтаФорма["смартТаблицаПравилаОплатыИзменена"] = Истина;	
	//-- #3940 смарт: Ермаков 04.08.2025
	
КонецПроцедуры

//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
&НаКлиенте
Процедура смарт_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//++ #Б-6270 смарт: Фролов 01.04.2026 //Заявка на ремонтные работы. Добавить реквизит для ДС. Обновить доработку по сервисным договорам РТО.
	Если Объект.смартДополнительноеСоглашение И Не ЗначениеЗаполнено(Объект.смартДополнительноеСоглашениеДата) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена дата дополнительного соглашения!", , "Объект.смартДополнительноеСоглашениеДата", , Отказ);
		
	КонецЕсли;
	//-- #Б-6270 смарт: Фролов 01.04.2026
	
	//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
	Если Не Отказ Тогда
		
		// Если сумма процентов по строкам не равна 100
		Если Объект.смартПравилаОплаты.Количество() > 0 Тогда
			
			Если Не Объект.смартПравилаОплаты.Итог("ПроцентПлатежа") = 100 Тогда
				
				ТекстОшибки = НСтр("ru='Проценты оплат разнесены некорректно.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					ТекстОшибки,
					Объект.Ссылка,
					"Объект.смартПравилаОплаты",,
					Отказ);
				
			КонецЕсли;
				
		КонецЕсли;
			
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// Если даты по строкам не последовательны
		Для Каждого СтрокаТаблицы Из Объект.смартПравилаОплаты Цикл
			
			Если Объект.смартПравилаОплаты.Индекс(СтрокаТаблицы) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПредыдущаяСтрока = 
				Объект.смартПравилаОплаты[Объект.смартПравилаОплаты.Индекс(СтрокаТаблицы) - 1];
				
			Если СтрокаТаблицы.ДатаПлатежа <= ПредыдущаяСтрока.ДатаПлатежа Тогда
					
				ТекстОшибки = НСтр("ru='Некорректная последовательность дат платежей.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					ТекстОшибки,
					Объект.Ссылка,
					"Объект.смартПравилаОплаты",,
					Отказ);									
					
				Прервать;
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Если ЭтаФорма["смартТаблицаПравилаОплатыИзменена"] 
			И Объект.смартПравилаОплаты.Количество() > 0 Тогда
			
			Отказ = Истина;
			ЭтаФорма["смартТаблицаПравилаОплатыИзменена"] = Ложь;
			
			ПоказатьПредупреждение(
				Новый ОписаниеОповещения("смартПослеВыводаПредупрежденияОбИзмененииТаблицыПравилаОплаты", ЭтаФорма),
				"Внимание! Измененные реквизиты оплат необходимо актуализировать в связанном Заказе клиента.",
				120,
				"Информация об изменениях"
			);
				
		КонецЕсли;
		
	КонецЕсли;
	//-- #3940 смарт: Ермаков 04.08.2025
	
КонецПроцедуры

//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
&НаКлиенте
Процедура смартПослеВыводаПредупрежденияОбИзмененииТаблицыПравилаОплаты(ДополнительныеПараметры) Экспорт
	
	//++ #3940 смарт: Ермаков 04.08.2025 / Договор клиента. Дополнения.
	Записать();
    //-- #3940 смарт: Ермаков 04.08.2025
	
КонецПроцедуры

//++ #5440 смарт: Тимофеева 20.01.26 / Новая ставка НДС22. Доработки. Справочник Договоры Контрагентов.
&НаСервере
Функция ЭтоОрганизацияГруппыКомпанийРФ(Организация)	
	Результат 				= Ложь;
	ЮридическийАдрес		= "";
	ЮридическийАдресТаблица	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
															ТекущаяДатаСеанса(), 
															Ложь);
	Если ЮридическийАдресТаблица.Количество() > 0 Тогда 	
		Если ЗначениеЗаполнено(ЮридическийАдресТаблица[0].Значение) Тогда			
			ЮридическийАдрес = ЮридическийАдресТаблица[0].Значение;
		Иначе
			ЮридическийАдрес = ЮридическийАдресТаблица[0].ЗначенияПолей;
		КонецЕсли; 	
		ДанныеСтраны 	= УправлениеКонтактнойИнформацией.СтранаАдресаКонтактнойИнформации(ЮридическийАдрес);		
		Результат 		= ДанныеСтраны.Ссылка = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	КонецЕсли;
	Возврат Результат;							
КонецФункции          

&НаСервере
&ИзменениеИКонтроль("НалогообложениеНДСПриИзмененииСервер")
Процедура смарт_НалогообложениеНДСПриИзмененииСервер()
	
	#Вставка
	//++ #5440 смарт: Тимофеева 20.01.26 / Новая ставка НДС22. Доработки. Справочник Договоры Контрагентов.
    Если ЭтоОрганизацияГруппыКомпанийРФ(Объект.Организация)
		И Объект.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		И НЕ ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
	КонецЕсли;
	//-- #5440 смарт: Тимофеева 20.01.26
	#КонецВставки
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС
		ИЛИ Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД
		ИЛИ Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя
		ИЛИ Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт
		ИЛИ Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС
		//++ Локализация
		ИЛИ Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту
		//-- Локализация
		Тогда 
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;

	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт Тогда 
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
	КонецЕсли;

	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС  Тогда 
		Объект.УчетАгентскогоНДС = Истина;
	Иначе
		Объект.УчетАгентскогоНДС = Ложь;
		Объект.ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.ПустаяСсылка();
	КонецЕсли;

	УстановитьСвойстваЭлементовНалогообложенияИРаздельногоУчетаНДС();

КонецПроцедуры
//-- #5440 смарт: Тимофеева 20.01.26 

&НаКлиенте
//++ #Б-6270 смарт: Фролов 01.04.2026 //Заявка на ремонтные работы. Добавить реквизит для ДС. Обновить доработку по сервисным договорам РТО.
Процедура смартСоглашениеПодписаноПриИзменении(Элемент)
	
	Объект.смартСоглашениеПодписаноДата = ?(Объект.смартСоглашениеПодписано, ТекущаяДата(), Неопределено);
	
КонецПроцедуры //-- #Б-6270 смарт: Фролов 01.04.2026

#КонецОбласти