// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.
// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область СлужебныйПрограммныйИнтерфейс

#Область ОпределениеФормОбъектов

Процедура ОбработкаПолученияФормОбъектов(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	#Область ПереопределениеФормыОтчетов
	
	Если ВидФормы = "ФормаСписка" Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Обработка.CRM_УниверсальныйЖурналДокументов.Форма.Форма";
		Параметры.Вставить("ВидЖурнала", Справочники.CRM_ГруппыУниверсальногоЖурнала.Контакты);
		Параметры.Вставить("БлокироватьИзменениеВидаЖурнала", Истина);
		Параметры.Вставить("ОткрытаФормаЖурналаВзаимодействия", Истина);
		
	КонецЕсли;	
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти // ОпределениеФормОбъектов

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
