
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьДоступныеТипы();
	Если Параметры.Свойство("ВладелецМакета") И НЕ ПустаяСтрока(Параметры.ВладелецМакета) Тогда
		ВладелецМакета	= Параметры.ПредставлениеВладельца;
		ТекущийВладелец	= СписокДокументов.НайтиПоЗначению(ВладелецМакета);
		Если ТекущийВладелец = Неопределено Тогда
			ТекущийВладелец = СписокСправочников.НайтиПоЗначению(ВладелецМакета);
			Если НЕ (ТекущийВладелец = Неопределено) Тогда
				ТекущийЭлемент = Элементы.ГруппаСправочников;
				Элементы.ГруппаСправочников.ПодчиненныеЭлементы.СписокСправочников.ТекущаяСтрока = СписокСправочников.Индекс(ТекущийВладелец);
			КонецЕсли;	
		Иначе	
			ТекущийЭлемент = Элементы.ГруппаДокументов;	
			Элементы.ГруппаДокументов.ПодчиненныеЭлементы.СписокДокументов.ТекущаяСтрока = СписокДокументов.Индекс(ТекущийВладелец);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля формы "СписокДокументов".
//
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Новый Структура("Значение,Представление", Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.Представление));
КонецПроцедуры // СписокДокументовВыбор()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСправочников

&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля формы "СписокСправочников".
//
Процедура СписокСправочниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Новый Структура("Значение,Представление", Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.Представление));
КонецПроцедуры // СписокСправочниковВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды формы "ОК".
//
Процедура ОК(Команда)
	Если Элементы.ПанельСписков.ТекущаяСтраница = Элементы.ГруппаДокументов Тогда
		Закрыть(Новый Структура("Значение,Представление", Элементы.СписокДокументов.ТекущиеДанные.Значение, Элементы.СписокДокументов.ТекущиеДанные.Представление));
	ИначеЕсли Элементы.ПанельСписков.ТекущаяСтраница = Элементы.ГруппаСправочников Тогда
		Закрыть(Новый Структура("Значение,Представление", Элементы.СписокСправочников.ТекущиеДанные.Значение, Элементы.СписокСправочников.ТекущиеДанные.Представление));
	КонецЕсли;
КонецПроцедуры // ОК()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура заполняет доступные типы макетов.
//
// Параметры:
//	Нет.
//
Процедура ПолучитьДоступныеТипы()
	
	СписокДокументов.Добавить(Метаданные.Документы.КоммерческоеПредложениеКлиенту.ПолноеИмя(), Метаданные.Документы.КоммерческоеПредложениеКлиенту.Представление(), , БиблиотекаКартинок.Документ);
	СписокДокументов.Добавить(Метаданные.Документы.CRM_Интерес.ПолноеИмя(), Метаданные.Документы.CRM_Интерес.Представление(), , БиблиотекаКартинок.Документ);
	
КонецПроцедуры // ПолучитьДоступныеТипы() 

#КонецОбласти 

