


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Записывать=Истина;
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КорректировкаРегистров.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	                    |ГДЕ
	                    |	КорректировкаРегистров.смартКорректировкаГТДНеДляПродажи = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбКорректировка=Выборка.Ссылка.ПолучитьОбъект();	
	Иначе
		ОбКорректировка=Документы.КорректировкаРегистров.СоздатьДокумент();
		ОбКорректировка.Дата=Дата;
		ОбКорректировка.Операция=Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;
		ОбКорректировка.Ответственный=Ответственный; 
		ОбКорректировка.смартКорректировкаГТДНеДляПродажи=Ссылка;
		ОбКорректировка.Комментарий=""+Ответственный.Наименование+"; Восстановление ГТД списанной для ремонта запчасти.";
	КонецЕсли;
	ОбКорректировка.Движения.ТоварыОрганизаций.Очистить();
	ОбКорректировка.ТаблицаРегистров.Очистить();
	СтрТаблицаРегистров=ОбКорректировка.ТаблицаРегистров.Добавить(); 
	СтрТаблицаРегистров.Имя="ТоварыОрганизаций";
	ОбКорректировка.Записать(РежимЗаписиДокумента.Запись);
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Номенклатура КАК Номенклатура,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению КАК НомерГТДКВозмещению,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДПриход КАК НомерГТДПриход,
	                    |	СУММА(смартКорректировкаГТДНеДляПродажиСостав.КоличествоДляЗамены) КАК КоличествоДляЗамены,
	                    |	СУММА(смартКорректировкаГТДНеДляПродажиСостав.КоличествоПоступившее) КАК КоличествоПоступившее,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Партия КАК Партия,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ВидЗапасов КАК ВидЗапасов,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Организация КАК Организация,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению.смартНеДляПродажи КАК НомерГТДсмартНеДляПродажи
	                    |ИЗ
	                    |	Документ.смартКорректировкаГТДНеДляПродажи.Состав КАК смартКорректировкаГТДНеДляПродажиСостав
	                    |ГДЕ
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Ссылка = &Ссылка
	                    |	И смартКорректировкаГТДНеДляПродажиСостав.Пометка
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ВидЗапасов,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДПриход,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Партия,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Организация,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.АналитикаУчетаНоменклатуры,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.Номенклатура,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.ЗаявкаНаГарантийныйРемонт,
	                    |	смартКорректировкаГТДНеДляПродажиСостав.НомерГТДКВозмещению.смартНеДляПродажи");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);  
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДвижениеГТД=Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Добавить();
		ДвижениеГТД.Период=Дата;
		ДвижениеГТД.ВидДвижения=ВидДвиженияНакопления.Расход;
		ДвижениеГТД.ЗаявкаНаГарантийныйРемонт=Выборка.ЗаявкаНаГарантийныйРемонт;
		ДвижениеГТД.Номенклатура=Выборка.Номенклатура;
		ДвижениеГТД.НомерГТДКВозмещению=Выборка.НомерГТДКВозмещению;
		ДвижениеГТД.КВозмещению=Истина;  
		Если Выборка.НомерГТДсмартНеДляПродажи Тогда 
			ДвижениеГТД.НеКомпенсировать=Истина;	
		КонецЕсли;
		ДвижениеГТД.Количество=Выборка.КоличествоДляЗамены;
		
		ДвижениеГТД=Движения.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Добавить();
		ДвижениеГТД.Период=Дата;
		ДвижениеГТД.ВидДвижения=ВидДвиженияНакопления.Расход;
		ДвижениеГТД.ЗаявкаНаГарантийныйРемонт=Выборка.ЗаявкаНаГарантийныйРемонт;
		ДвижениеГТД.Номенклатура=Выборка.Номенклатура;
		ДвижениеГТД.НомерГТДПриход=Выборка.НомерГТДПриход;
		ДвижениеГТД.Партия=Выборка.Партия;
		ДвижениеГТД.Количество=Выборка.КоличествоПоступившее;
		
		Если ЗначениеЗаполнено(Выборка.АналитикаУчетаНоменклатуры) И ЗначениеЗаполнено(Выборка.ВидЗапасов) Тогда
			СтрКорректировка=ОбКорректировка.Движения.ТоварыОрганизаций.Добавить();
			СтрКорректировка.Организация=Выборка.Организация; 
			СтрКорректировка.Регистратор=ОбКорректировка.Ссылка;
			СтрКорректировка.Период=Дата;
			СтрКорректировка.Активность=Истина;
			СтрКорректировка.ВидДвижения=ВидДвиженияНакопления.Расход;
			СтрКорректировка.НомерГТД=Выборка.НомерГТДКВозмещению;
			СтрКорректировка.АналитикаУчетаНоменклатуры=Выборка.АналитикаУчетаНоменклатуры;
			СтрКорректировка.ВидЗапасов=Выборка.ВидЗапасов;
			СтрКорректировка.Количество=Выборка.КоличествоДляЗамены; 
			СтрКорректировка.РасчетПартий=Ложь;
			СтрКорректировка.Первичное=Ложь; 
			
			СтрКорректировка=ОбКорректировка.Движения.ТоварыОрганизаций.Добавить();
			СтрКорректировка.Организация=Выборка.Организация;
			СтрКорректировка.Регистратор=ОбКорректировка.Ссылка;
			СтрКорректировка.Период=Дата;
			СтрКорректировка.Активность=Истина;
			СтрКорректировка.ВидДвижения=ВидДвиженияНакопления.Приход;
			СтрКорректировка.НомерГТД=Выборка.НомерГТДПриход;
			СтрКорректировка.АналитикаУчетаНоменклатуры=Выборка.АналитикаУчетаНоменклатуры;
			СтрКорректировка.ВидЗапасов=Выборка.ВидЗапасов;
			СтрКорректировка.Количество=Выборка.КоличествоПоступившее; 
			СтрКорректировка.РасчетПартий=Ложь;
			СтрКорректировка.Первичное=Ложь; 
		КонецЕсли;
	КонецЦикла;
	ОбКорректировка.Движения.ТоварыОрганизаций.Записать();  
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Отбор=Новый Структура("Пометка",Истина);
		ТабПомеченных=Состав.Выгрузить(Отбор,);
		Состав.Загрузить(ТабПомеченных); 
	Иначе	
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	КорректировкаРегистров.Ссылка КАК Ссылка
		                    |ИЗ
		                    |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		                    |ГДЕ
		                    |	КорректировкаРегистров.смартКорректировкаГТДНеДляПродажи = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Ссылка); 
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбКорректировка=Выборка.Ссылка.ПолучитьОбъект(); 
			ОбКорректировка.Движения.ТоварыОрганизаций.Очистить();
			ОбКорректировка.ТаблицаРегистров.Очистить(); 
			ОбКорректировка.Записать(РежимЗаписиДокумента.Запись);
			ОбКорректировка.Движения.ТоварыОрганизаций.Записать();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
