
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
Функция ЭтоПредопределенноеЗначение(Элемент)
	
	Возврат Элемент.Предопределенный;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрокаСписка)
	
	ПолеТекстовогоДокумента.УстановитьТекст(ТекущаяСтрокаСписка.Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		Элементы.ФормаВосстановитьИзМакета.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если (Элементы.Список.ВыделенныеСтроки.Количество() = 1) Тогда
		СписокПриАктивизацииСтрокиНаСервере(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
	ВыделенныеСтроки	= Элементы.Список.ВыделенныеСтроки;
	ЭлементСписка		= Элементы.Список.ДанныеСтроки(ВыделенныеСтроки[0]);
	Если ЭлементСписка = Неопределено Тогда
		Элементы.ФормаВосстановитьИзМакета.Доступность = Ложь;
	Иначе	
		Элементы.ФормаВосстановитьИзМакета.Доступность = (ЭлементСписка.ИзМакета ИЛИ ЭтоПредопределенноеЗначение(ВыделенныеСтроки[0]));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_СписокПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ВосстановитьЗначениеИзМакета(ВыделенныеСтроки)
	
	Справочники.CRM_ШаблоныАвтотекста.ВосстановитьЗначениеИзМакета(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьИзМакета(Команда)
	
	ВыделенныеСтроки	= Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВосстановитьИзМакетаЗавершение", ЭтотОбъект, ВыделенныеСтроки);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Выделенные элементы будут перезаполнены из макета справочника. Продолжить?';en='Selected items will be re-written from catalog template. Continue?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьИзМакетаЗавершение(Ответ, ВыделенныеСтроки) экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВосстановитьЗначениеИзМакета(ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



