
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Склад", Склад);
	Параметры.Свойство("смартЗапчастиГарантийные", смартЗапчастиГарантийные);
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	
	Элементы.Сценарий.СписокВыбора.Очистить();
	Элементы.Сценарий.СписокВыбора.Добавить(Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Товары.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	АдресВХранилище = ПоместитьВыбранныеСтрокиВоВременноеХранилище();
	Если АдресВХранилище = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отметьте строки для переноса (колонка «Перенести»).'"));
		Возврат;
	КонецЕсли;
	
	Закрыть(АдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	
	Товары.Очистить();
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличии,
	|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ТоварыНаСкладахОстатки.Назначение = Назначения.Ссылка
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И Назначения.ТипНазначения = &ТипНазначения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика,
	|	ТоварыНаСкладахОстатки.Склад,
	|	ТоварыНаСкладахОстатки.Назначение,
	|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Характеристика КАК Характеристика,
	|	СвободныеОстатки.Склад КАК Склад,
	|	СвободныеОстатки.ВНаличииОстаток
	|		- СвободныеОстатки.ВРезервеСоСкладаОстаток
	|		- СвободныеОстатки.ВРезервеПодЗаказОстаток КАК СвободноКоммерческое,
	|	СвободныеОстатки.смартВНаличииГарантийныеОстаток
	|		- СвободныеОстатки.смартВРезервеСоСкладаГарантийныеОстаток
	|		- СвободныеОстатки.смартВРезервеПодЗаказГарантийныеОстаток КАК СвободноГарантийное
	|ПОМЕСТИТЬ ВТ_СвободныеОстатки
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(, Склад = &Склад) КАК СвободныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	|	СУММА(
	|		ТоварыКОтгрузкеОстатки.ВРезервеОстаток
	|			+ ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) КАК РезервКоммерческий,
	|	СУММА(
	|		ТоварыКОтгрузкеОстатки.смартВРезервеГарантийныеОстаток
	|			+ ТоварыКОтгрузкеОстатки.смартКОтгрузкеГарантийныеОстаток) КАК РезервГарантийный
	|ПОМЕСТИТЬ ВТ_РезервыКОтгрузке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузкеОстатки.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика,
	|	ТоварыКОтгрузкеОстатки.Склад,
	|	ТоварыКОтгрузкеОстатки.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ТоварыДокумента.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТ_Исключения
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ТоварыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ШапкаПеремещения
	|		ПО ТоварыДокумента.Ссылка = ШапкаПеремещения.Ссылка
	|ГДЕ
	|	ШапкаПеремещения.Проведен
	|	И ШапкаПеремещения.Ссылка <> &ДокументВладелец
	|	И ТоварыДокумента.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И ТоварыДокумента.Назначение.ТипНазначения = &ТипНазначения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Назначение
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТоварыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ШапкаПотребления
	|		ПО ТоварыДокумента.Ссылка = ШапкаПотребления.Ссылка
	|ГДЕ
	|	ШапкаПотребления.Проведен
	|	И ШапкаПотребления.Ссылка <> &ДокументВладелец
	|	И ТоварыДокумента.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И ТоварыДокумента.Назначение.ТипНазначения = &ТипНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНаСкладах.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиНаСкладах.Назначение КАК Назначение,
	|	ВТ_ОстаткиНаСкладах.Склад КАК Склад,
	|	ВТ_ОстаткиНаСкладах.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &Гарантийные
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ОстаткиНаСкладах.ВНаличии < ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноГарантийное, 0)
	|						ТОГДА ВТ_ОстаткиНаСкладах.ВНаличии
	|					ИНАЧЕ ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноГарантийное, 0)
	|				КОНЕЦ - ЕСТЬNULL(ВТ_РезервыКОтгрузке.РезервГарантийный, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ОстаткиНаСкладах.ВНаличии < ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноКоммерческое, 0)
	|					ТОГДА ВТ_ОстаткиНаСкладах.ВНаличии
	|				ИНАЧЕ ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноКоммерческое, 0)
	|			КОНЕЦ - ЕСТЬNULL(ВТ_РезервыКОтгрузке.РезервКоммерческий, 0)
	|	КОНЕЦ КАК ДоступноеКоличество,
	|	ВТ_ОстаткиНаСкладах.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_ОстаткиНаСкладах КАК ВТ_ОстаткиНаСкладах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_СвободныеОстатки.Номенклатура
	|			И ВТ_ОстаткиНаСкладах.Характеристика = ВТ_СвободныеОстатки.Характеристика
	|			И ВТ_ОстаткиНаСкладах.Склад = ВТ_СвободныеОстатки.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыКОтгрузке КАК ВТ_РезервыКОтгрузке
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_РезервыКОтгрузке.Номенклатура
	|			И ВТ_ОстаткиНаСкладах.Характеристика = ВТ_РезервыКОтгрузке.Характеристика
	|			И ВТ_ОстаткиНаСкладах.Склад = ВТ_РезервыКОтгрузке.Склад
	|			И ВТ_ОстаткиНаСкладах.Назначение = ВТ_РезервыКОтгрузке.Назначение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Исключения КАК ВТ_Исключения
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_Исключения.Номенклатура
	|			И ВТ_ОстаткиНаСкладах.Назначение = ВТ_Исключения.Назначение
	|ГДЕ
	|	ВТ_Исключения.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОстаткиНаСкладах.Номенклатура.Наименование,
	|	ВТ_ОстаткиНаСкладах.Назначение.Наименование";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТипНазначения", Сценарий);
	Запрос.УстановитьПараметр("Гарантийные", смартЗапчастиГарантийные);
	Запрос.УстановитьПараметр("ДокументВладелец", ДокументВладелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ДоступноеКоличество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Перенести = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВыбранныеСтрокиВоВременноеХранилище()
	
	ТаблицаПереноса = Новый ТаблицаЗначений;
	ТаблицаПереноса.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПереноса.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если Не СтрокаТоваров.Перенести Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПереноса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров, "Номенклатура, Назначение");
		
	КонецЦикла;
	
	Если ТаблицаПереноса.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПереноса, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
