#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция УсловиеВыполнено(Условие, Обращение) Экспорт
	
	Если Условие = БезУсловия Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Условие.ВидУсловия = Перечисления.CRM_ВидыУсловийОбработкиОбращений.СписокСлов Тогда
		Возврат УсловиеНаСписокСловВыполнено(Условие, Обращение);
	ИначеЕсли Условие.ВидУсловия = Перечисления.CRM_ВидыУсловийОбработкиОбращений.МеткаПомощника Тогда
		Возврат УсловиеНаМеткуКлассификацииВыполнено(Условие, Обращение);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция УсловиеНаСписокСловВыполнено(Условие, Обращение)
	
	Если СокрЛП(Условие.СодержитТекст) = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Поиск по содержанию
	МетаданныеОбъекта = Обращение.Метаданные();
	ТекстДляПоиска = "";
	
	Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Тема", МетаданныеОбъекта) Тогда
		ТекстДляПоиска = ТекстДляПоиска + Обращение["Тема"];
	КонецЕсли;
	Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Комментарий", МетаданныеОбъекта) Тогда
		ТекстДляПоиска = ТекстДляПоиска + Обращение["Комментарий"];
	КонецЕсли;
	Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Текст", МетаданныеОбъекта) Тогда
		ТекстДляПоиска = ТекстДляПоиска + Обращение["Текст"];
	КонецЕсли;
	Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("ТекстСообщения", МетаданныеОбъекта) Тогда
		ТекстДляПоиска = ТекстДляПоиска + Обращение["ТекстСообщения"];
	КонецЕсли;
	
	Если СокрЛП(ТекстДляПоиска) = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекстДляПоиска = ВРег(ТекстДляПоиска);
	
	МассивИскомыхСтрок = СтрРазделить(ВРег(Условие.СодержитТекст), ";", Ложь);
	Для каждого ИскомаяСтрока из МассивИскомыхСтрок Цикл
		Если СтрНайти(ТекстДляПоиска, СокрЛП(ИскомаяСтрока)) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция УсловиеНаМеткуКлассификацииВыполнено(Условие, Обращение)
	
	Если Не Обращение.ДополнительныеСвойства.Свойство("МеткаКлассификации") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Условие.Метка = Обращение.ДополнительныеСвойства.МеткаКлассификации Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецЕсли