
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Фролов+
	Если Не (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеВозвратовТоваровОтКлиентов")) Тогда
		Объект.Статус=?(Объект.Ссылка.Пустая(),Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована,Объект.Статус);
		Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивСтатусовОграниченный(Объект.Статус));
		Элементы.Статус.Доступность=Объект.Статус=Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована
									Или Объект.Статус=Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Отклонена;
	КонецЕсли;	
	// Фролов-
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 17.05.2021 12:24:07 задача 520
	НовыйРеквизит = Элементы.Добавить("смартСклад", Тип("ПолеФормы"), Элементы.ВозвращаемыеТовары);
	НовыйРеквизит.Заголовок = "Склад";
	НовыйРеквизит.Вид = ВидПоляФормы.ПолеВвода;
	НовыйРеквизит.ПутьКДанным = "Объект.ВозвращаемыеТовары.смартСклад";
	//Смарт }Подкин Алексей Иванович 17.05.2021 12:24:07
	
	//++ #Б6826 смарт: Шляпников 23.06.2026 / Маркировка. Возврат товара / Корректировка реализации в 1С УТ РФ. Реализация механизма.
	смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма, "ВозвращаемыеТовары", "ВозвращаемыеТоварыНоменклатура", "Объект.ВозвращаемыеТовары.Номенклатура");
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	Элементы.ВозвращаемыеТовары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6826 смарт: Шляпников 23.06.2026
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПартнерПриИзменении")
Процедура смарт_ПартнерПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено (Объект.Партнер) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
		УстановитьВидимостьЗапретаОтгрузкиПартнеру();
		Возврат;
	КонецЕсли;

	ПартнерПриИзмененииСервер();

	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
	КонецЕсли;

	#Вставка
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_ЗаявкаНаВозвратТоваровОтКлиента", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #Б6948 смарт: Шляпников 11.06.2026 / Маркировка. Алгоритм действий системы и БП при заказе нового товара при наличии остатков на складах.
	смартМаркировкаКлиент.ВывестиСообщениеОБудущейМаркировкеНоменклатурыПоДокументу(Объект);
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6948 смарт: Шляпников 11.06.2026
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Фролов+
&НаСервереБезКонтекста
Функция ПолучитьМассивСтатусовОграниченный(УстановленныСтатус)
	Список=Новый Массив;
	Список.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована);
	Список.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Отклонена);
	Если Список.Найти(УстановленныСтатус)=Неопределено Тогда 
		Список.Вставить(1,УстановленныСтатус);
	КонецЕсли;
	Возврат Список;
КонецФункции

// ++ Смарт: Белоусова 499 29.04.2021
&НаКлиенте
Процедура смарт_ВозвращаемыеТоварыНоменклатураНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	п = смарт_ВозвращаемыеТоварыНоменклатураНачалоВыбораПослеНаСервере() ;
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",п,элемент);
	
КонецПроцедуры

// ++ Смарт: Белоусова 499 29.04.2021
&НаСервере
функция смарт_ВозвращаемыеТоварыНоменклатураНачалоВыбораПослеНаСервере()
	группа1 = перечисления.ТипыНоменклатуры.Услуга;
	отбор1 = новый структура;
	отбор1.Вставить("ТипНоменклатуры",группа1);
	
	группа2 = перечисления.ТипыНоменклатуры.Товар;
	отбор2 = новый структура;
	отбор2.Вставить("ТипНоменклатуры",группа2);
	
	группа3 = перечисления.ТипыНоменклатуры.МногооборотнаяТара;
	отбор3 = новый структура;
	отбор3.Вставить("ТипНоменклатуры",группа2);

	п = новый структура;                       
	п.Вставить("Отбор1",отбор1);
	п.Вставить("Отбор2",отбор2);
	п.Вставить("Отбор3",отбор3);
	возврат п;
КонецФункции

//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерийВСтроке()
	
	ЭлементВозвращаемыеТовары = Элементы.ВозвращаемыеТовары;
	
	ТекущиеДанные 			   = ЭлементВозвращаемыеТовары.ТекущиеДанные;
	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		
	ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(ТекущаяСтрокаИдентификатор, КэшированныеЗначения, "Возвращаемые");	
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(ЭлементВозвращаемыеТовары, КэшированныеЗначения, ПараметрыУказанияСерий.Возвращаемые);

КонецПроцедуры //--#1775 смарт: Лопато 12.04.2024					

//++ #Б6826 смарт: Шляпников 23.06.2026 / Маркировка. Возврат товара / Корректировка реализации в 1С УТ РФ. Реализация механизма.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.ВозвращаемыеТовары);
	
КонецПроцедуры

//++ #Б6826 смарт: Шляпников 23.06.2026 / Маркировка. Возврат товара / Корректировка реализации в 1С УТ РФ. Реализация механизма.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();

КонецПроцедуры

#КонецОбласти