
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НомерСтационарный.Заголовок = Параметры.ПользовательВнутреннийНомер;
	Элементы.НомерМобильный.Заголовок    = Параметры.ПользовательВнутреннийНомерВАТС;
	
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	Если Параметры.Свойство("ПользовательВнутреннийНомерВАТСДополнительный") 
		И ЗначениеЗаполнено(Параметры.ПользовательВнутреннийНомерВАТСДополнительный) Тогда
		
		Элементы.НомерМобильный.Заголовок    = Параметры.ПользовательВнутреннийНомерВАТСДополнительный;
		
	Иначе
		
		Элементы.ГруппаМобильныйДополнительный.Видимость = Ложь;
		
	КонецЕсли;	
	//-- #Б-6744 смарт: Фролов 28.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтационарныйТелефон(Команда)
	
	Закрыть(Новый Структура("ВыбранныйТипНомера", "ПользовательВнутреннийНомер"));

КонецПроцедуры

&НаКлиенте
Процедура КомандаМобильныйТелефон(Команда)

	Закрыть(Новый Структура("ВыбранныйТипНомера", "ПользовательВнутреннийНомерВАТС"));

КонецПроцедуры

&НаКлиенте
//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
Процедура КомандаМобильныйТелефонДополнительный(Команда)
	
	Закрыть(Новый Структура("ВыбранныйТипНомера", "ПользовательВнутреннийНомерВАТСДополнительный"));	
	
КонецПроцедуры //-- #Б-6744 смарт: Фролов 28.05.2026

&НаКлиенте
Процедура ДекорацияОтменаНажатие(Элемент)
	
	Закрыть(Неопределено);
	
КонецПроцедуры


	