
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокРегЗаданий.Добавить("CRM_ВыполнениеТриггеров");
	СписокРегЗаданий.Добавить("SMS4B_ПолучениеSMS");
	СписокРегЗаданий.Добавить("CRM_ОжиданиеСобытийМессенджера");
	СписокРегЗаданий.Добавить("CRM_ОтправкаОповещенийПоСМС");
	СписокРегЗаданий.Добавить("CRM_ОтправкаОповещенийПоЭлектроннойПочте");
	СписокРегЗаданий.Добавить("CRM_ОтправкаРассылокЭлектронныхПисем");
	СписокРегЗаданий.Добавить("CRM_СинхронизацияКалендарей");
	СписокРегЗаданий.Добавить("CRM_СтатусыEmailРассылок");
	СписокРегЗаданий.Добавить("CRM_ФормированиеОповещений");
	СписокРегЗаданий.Добавить("CRM_ФормированиеПоздравленийСДнемРождения");
	СписокРегЗаданий.Добавить("CRM_СинхронизацияС_iCRM");
	СписокРегЗаданий.Добавить("ПолучениеИОтправкаЭлектронныхПисем");
	СписокРегЗаданий.Добавить("CRM_ОтложенноеВыполнениеТриггеров");
	
	Для а = 1 По 13 Цикл
		Если а = 2 Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания.SMS4B_ПолучениеSMS.ИмяМетода);
			Задания = ОчередьЗаданий.ПолучитьЗадания(Отбор);
			
			// Проверяем, что задание найдено.
			Если Задания.Количество() = 1 Тогда
				ЭтотОбъект["Расписание"+а] = Задания[0].Расписание;
				ЭтотОбъект["Использование"+а] = Задания[0].Использование;
			Иначе	
				ЭтотОбъект["Расписание"+а] = Новый РасписаниеРегламентногоЗадания;
				ЭтотОбъект["Использование"+а] = Ложь;
			КонецЕсли;	
		Иначе	
			Отбор = Новый Структура();
			Отбор.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания[СписокРегЗаданий[а-1].Значение].ИмяМетода);
			Задания = ОчередьЗаданий.ПолучитьЗадания(Отбор);
			
			// Проверяем, что задание найдено.
			Если Задания.Количество() = 1 Тогда
				ЭтотОбъект["Расписание"+а] = Задания[0].Расписание;
				ЭтотОбъект["Использование"+а] = Задания[0].Использование;
			Иначе	
				ЭтотОбъект["Расписание"+а] = Новый РасписаниеРегламентногоЗадания;
				ЭтотОбъект["Использование"+а] = Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	ОтключитьЗаданиеНаСервере();
	Для а = 1 По 13 Цикл
		Если ЭтотОбъект["Использование"+а] Тогда
			Если а = 2 Тогда
				ПараметрыЗадания = Новый Структура;
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.SMS4B_ПолучениеSMS);
				ПараметрыЗадания.Вставить("Расписание", ЭтотОбъект["Расписание"+а]);
				ПараметрыЗадания.Вставить("Использование", Истина);
				РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
				
				ПараметрыЗадания = Новый Структура;
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОтправкаSMS);
				ПараметрыЗадания.Вставить("Расписание", ЭтотОбъект["Расписание"+а]);
				ПараметрыЗадания.Вставить("Использование", Истина);
				РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
				
				ПараметрыЗадания = Новый Структура;
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбновлениеСтатусовДоставкиSMS);
				ПараметрыЗадания.Вставить("Расписание", ЭтотОбъект["Расписание"+а]);
				ПараметрыЗадания.Вставить("Использование", Истина);
				РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			Иначе
				ПараметрыЗадания = Новый Структура;
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания[СписокРегЗаданий[а-1].Значение]);
				ПараметрыЗадания.Вставить("Расписание", ЭтотОбъект["Расписание"+а]);
				ПараметрыЗадания.Вставить("Использование", Истина);
				РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРасписание1(Команда)
	НомерЗадания = СтрЗаменить(Команда.Имя, "НастроитьРасписание", "");
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект["Расписание"+НомерЗадания]);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НомерЗадания", НомерЗадания);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект, ДопПараметры));
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ПриЗакрытииНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, ДопПараметры) Экспорт

	Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект["Расписание"+ДопПараметры.НомерЗадания] = НовоеРасписание;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьЗаданиеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Для а = 1 По 12 Цикл
		Если а = 2 Тогда
			РегламентныеЗаданияСервер.УдалитьЗадание(Метаданные.РегламентныеЗадания.SMS4B_ПолучениеSMS);
			РегламентныеЗаданияСервер.УдалитьЗадание(Метаданные.РегламентныеЗадания.ОтправкаSMS);
			РегламентныеЗаданияСервер.УдалитьЗадание(Метаданные.РегламентныеЗадания.ОбновлениеСтатусовДоставкиSMS);
		Иначе	
			РегламентныеЗаданияСервер.УдалитьЗадание(Метаданные.РегламентныеЗадания[СписокРегЗаданий[а-1].Значение]);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти







