
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
&ИзменениеИКонтроль("ПриЗаполненииОграниченияДоступа")
Процедура смарт_ПриЗаполненииОграниченияДоступа(Ограничение)
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ВЫБОР КОГДА ВладелецУчетнойЗаписи = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) ТОГДА
	|		ЗначениеРазрешено(Ссылка)
	|	ИНАЧЕ
	|		ЗначениеРазрешено(Ссылка, Отключено КАК Ложь)
	|		ИЛИ ЗначениеРазрешено(ВладелецУчетнойЗаписи, Отключено КАК Ложь)
	|		ИЛИ ЭтоАвторизованныйПользователь(ВладелецУчетнойЗаписи)
	|	КОНЕЦ
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЗначениеРазрешено(ВладелецУчетнойЗаписи, ПустаяСсылка КАК Ложь)";
	
	#Вставка
	
	//++ #1950 смарт: Ермаков 14.08.2024 / Доступ к уч записи почты в 1С
	// Чтение разрешается, если связка "уч.запись + пользователь" заявлены в регистре сведений CRM_УчетныеЗаписиЭлектроннойПочты
	Ограничение.Текст = "
	|ПрисоединитьДополнительныеТаблицы
	|	ЭтотСписок КАК ЭтотСписок
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписи ПО УчетныеЗаписи.УчетнаяЗапись = ЭтотСписок.Ссылка
	|;    
	|РазрешитьЧтение
	|ГДЕ
	|	ДляОднойИзСтрок(ЗначениеРазрешено(УчетныеЗаписи.Пользователь))
	|	ИЛИ
	|	ВЫБОР КОГДА ВладелецУчетнойЗаписи = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) ТОГДА
	|		ЗначениеРазрешено(Ссылка)
	|	ИНАЧЕ
	|		ЗначениеРазрешено(Ссылка, Отключено КАК Ложь)
	|		ИЛИ ЗначениеРазрешено(ВладелецУчетнойЗаписи, Отключено КАК Ложь)
	|		ИЛИ ЭтоАвторизованныйПользователь(ВладелецУчетнойЗаписи)
	|	КОНЕЦ
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ДляОднойИзСтрок(ЗначениеРазрешено(УчетныеЗаписи.Пользователь))
	|	ИЛИ  ЗначениеРазрешено(ВладелецУчетнойЗаписи, ПустаяСсылка КАК Ложь)";
	//-- #1950 смарт: Ермаков 14.08.2024
	
	#КонецВставки
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти  

#КонецЕсли