#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УзелОбменаЭтаИБ = Объект.Ссылка = ПланыОбмена.Б_ОбменССайтом.УзелОбменаЭтойИБСервер();

	Если УзелОбменаЭтаИБ Тогда

		Возврат;

	КонецЕсли;

	ПриЧтенииСозданииНаСервере();

	Если Объект.Ссылка.пустая() тогда
		Объект.ВыгружатьТолькоИзменения 				= Истина;
		Объект.ДеактивироватьТоварыЕслиПолнаяВыгрузка 	= Истина;
		Объект.ВыгружатьЛогНаСайт 						= Истина;

	Иначе

	КонецЕсли;	

	#Если ВебКлиент ТОГДА
		Элементы.ПереключательНазначениеОбмена.СписокВыбора.Очистить();
		Элементы.ПереключательНазначениеОбмена.СписокВыбора.Добавить(0, "Выгружать на сайт");

		Элементы.КаталогЛога.Видимость 			= Ложь;     
		Элементы.ДекорацияКаталогЛога.Видимость = Ложь;
		Элементы.ДекорацияЛога.Видимость 		= Ложь;
	#КОНЕЦЕСЛИ

	Если НЕ ЗначениеЗаполнено(Объект.КодировкаФайлаЛога) Тогда Объект.КодировкаФайлаЛога = "ANSI" КонецЕсли;
	
	#Вставка
	НовыйРеквизит = Новый РеквизитФормы("ЗагрузкаПодписок", Новый ОписаниеТипов("Булево"),, "Загрузка подписок");
	ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйРеквизит), Новый Массив);
	
	Группа = Элементы.Добавить("ГруппаЗагрузкаПодписок", Тип("ГруппаФормы"), Элементы.ГруппаРежимОбменаДанных);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Истина;
	Группа.Заголовок = "Загрузка подписок";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Элементы.Переместить(Группа, Элементы.ГруппаРежимОбменаДанных, Элементы.ГруппаВыгружатьИзмененияОбщая);
	
	НовыйЭлемент = Элементы.Добавить("ЗагрузкаПодписок", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "ЗагрузкаПодписок";
	НовыйЭлемент.Заголовок = "Активировать";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ОбновитьОтображениеКнопокРежимовОбменаПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("ЗагрузкаПодписокНаРассылкуИнформация", Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "Активация данного режима дает возможность загружать в 1с статусы подписок на рассылку";
	#КонецВставки

КонецПроцедуры

&Вместо("ЗаполнитьСпкОбъектовДляВерсий")
Функция смарт_ЗаполнитьСпкОбъектовДляВерсий()
	лСпкУстановкаВерсий = Новый СписокЗначений;
	
	лСпкУстановкаВерсий.Добавить("Свойств");
	лСпкУстановкаВерсий.Добавить("Значений свойств");
	лСпкУстановкаВерсий.Добавить("Складов");
	лСпкУстановкаВерсий.Добавить("Типов цен");
	лСпкУстановкаВерсий.Добавить("Единиц измерений");
	лСпкУстановкаВерсий.Добавить("Групп");
	лСпкУстановкаВерсий.Добавить("Товаров",,Истина);
	лСпкУстановкаВерсий.Добавить("Предложений");
	лСпкУстановкаВерсий.Добавить("Документов");
	лСпкУстановкаВерсий.Добавить("Контрагентов");
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 22.05.2020 11:22:54
	лСпкУстановкаВерсий.Добавить("Партнеров");
	//Смарт }Подкин Алексей Иванович 22.05.2020 11:22:54
	лСпкУстановкаВерсий.Добавить("Скидок");
	лСпкУстановкаВерсий.Добавить("Карт лояльности");
	лСпкУстановкаВерсий.Добавить("Видов карт лояльности");
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.05.2020 14:19:51
	лСпкУстановкаВерсий.Добавить("СоглашенийСКлиентами");
	лСпкУстановкаВерсий.Добавить("КонтактныхЛицПартнеров");
	//Смарт }Подкин Алексей Иванович 29.05.2020 14:19:51
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.06.2020 10:26:30
	лСпкУстановкаВерсий.Добавить("ТранспортныхКомпании");
	//Смарт }Подкин Алексей Иванович 09.06.2020 10:26:30
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 19.06.2020 10:50:56
	лСпкУстановкаВерсий.Добавить("ДоговоровКонтрагентов");
	//Смарт }Подкин Алексей Иванович 19.06.2020 10:50:56
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.07.2020 12:00:36
	лСпкУстановкаВерсий.Добавить("Пользователей");
	//Смарт }Подкин Алексей Иванович 06.07.2020 12:00:36
	Возврат лСпкУстановкаВерсий;

КонецФункции

&НаСервере
&Вместо("ПолучитьНастройкиЗаказовПоУмолчанию")
Функция смарт_ПолучитьНастройкиЗаказовПоУмолчанию()
	Результат = Новый Структура;
	
	Результат.Вставить("ОбменДокументами"		 	, Истина);	
	Результат.Вставить("ВыгружатьВсеДокументы"		, Ложь);	
	Результат.Вставить("ТочкаАктуальностиВыгрузкиДокументов", НачалоМесяца(ТекущаяДата()));	
	
	Результат.Вставить("ВыгрузкаОплат"				, Ложь);
	Результат.Вставить("ВыгрузкаОтгрузок"			, Ложь);	
	Результат.Вставить("ЗагрузкаОплат"				, Ложь);
	Результат.Вставить("ЗагрузкаОтгрузок"			, Ложь);	                                                     	
	Результат.Вставить("ПроводитьЕслиОтгружен"		, Ложь);
	Результат.Вставить("ПроводитьЕслиОплачен"		, Ложь);	
	
	Результат.Вставить("НеРедактироватьДокументыПришедшиеССайта", Ложь);	
	
	Результат.Вставить("УстанавливатьРучнуюСкидкуВДокументе", Ложь);	
	Результат.Вставить("КоличествоДокументовВПакете", 20);	
	
	СтруктураССхемамиК = Б_ОбменССайтомСервер.ПолучитьСтруктуруСхемКомпоновки();
	
	КомпоновщикНастроекКомпоновкиДанныхЗаказов = Новый КомпоновщикНастроекКомпоновкиДанных;		
	АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемамиК.Заказы, УникальныйИдентификатор);
	КомпоновщикНастроекКомпоновкиДанныхЗаказов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	КомпоновщикНастроекКомпоновкиДанныхЗаказов.ЗагрузитьНастройки(СтруктураССхемамиК.Заказы.НастройкиПоУмолчанию);
	
	Результат.Вставить("НастройкиКомпоновкиДанныхЗаказов", КомпоновщикНастроекКомпоновкиДанныхЗаказов.ПолучитьНастройки());	
	
	КомпоновщикНастроекКомпоновкиДанныхОплат = Новый КомпоновщикНастроекКомпоновкиДанных;		
	АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемамиК.Оплаты, УникальныйИдентификатор);
	КомпоновщикНастроекКомпоновкиДанныхОплат.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	КомпоновщикНастроекКомпоновкиДанныхОплат.ЗагрузитьНастройки(СтруктураССхемамиК.Оплаты.НастройкиПоУмолчанию);
	
	Результат.Вставить("НастройкиКомпоновкиДанныхОплат", КомпоновщикНастроекКомпоновкиДанныхОплат.ПолучитьНастройки());	
	
	КомпоновщикНастроекКомпоновкиДанныхОтгрузок = Новый КомпоновщикНастроекКомпоновкиДанных;		
	АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемамиК.Отгрузки, УникальныйИдентификатор);
	КомпоновщикНастроекКомпоновкиДанныхОтгрузок.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	КомпоновщикНастроекКомпоновкиДанныхОтгрузок.ЗагрузитьНастройки(СтруктураССхемамиК.Отгрузки.НастройкиПоУмолчанию);
	
	Результат.Вставить("НастройкиКомпоновкиДанныхОтгрузок", КомпоновщикНастроекКомпоновкиДанныхОтгрузок.ПолучитьНастройки());	
	
	
	Результат.Вставить("ГруппаДляНовойНоменклатуры"		, Справочники.Номенклатура.ПустаяСсылка());	
	Результат.Вставить("ВидНоменклатурыТовар"			, ПолучитьВидНоменклатурыПоУмолчанию("Товар"));	
	Результат.Вставить("ВидНоменклатурыУслуга"			, ПолучитьВидНоменклатурыПоУмолчанию("Услуга"));	
	Результат.Вставить("КонтрагентФизлицо"				, Справочники.Контрагенты.ПустаяСсылка());	
	Результат.Вставить("СоглашениеКонтрагентаФизлицо"	, Справочники.СоглашенияСКлиентами.ПустаяСсылка());	
	Результат.Вставить("ПричинаОтменыЗаказа"			, Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка());	
	Результат.Вставить("СтатусЗаказаОтменен"			, "");
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ЭквайринговыеТерминалы"));
	ОписаниеТиповЭТ = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Кассы"));
	ОписаниеТиповК = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СписокЗначений"));
	ОписаниеТиповСпк = Новый ОписаниеТипов(Массив);
	
	СоответствиеПлатежныхСистемИКасс = Новый ТаблицаЗначений;
	СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("ПлатежнаяСистема"		, ОписаниеТиповСпк);
	СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("Касса"					, ОписаниеТиповК);
	СоответствиеПлатежныхСистемИКасс.Колонки.Добавить("Терминал"				, ОписаниеТиповЭТ);
	
	Результат.Вставить("СоответствиеПлатежныхСистемИКасс", СоответствиеПлатежныхСистемИКасс);	
	
	Результат.Вставить("СохраненныеНастройкиЗагружаемыхДокументов" 	, ПланыОбмена.Б_ОбменССайтом.ЗаполнениеСоответствийЗагружаемыхДокументовПоУмолчанию());
	
	
	ЗагружаемыеТипыОплат = Новый СписокЗначений;
	ЗагружаемыеТипыОплат.Добавить("Выплата наличных денег"		,, Истина);
	ЗагружаемыеТипыОплат.Добавить("Эквайринговая операция"		,, Истина);
	ЗагружаемыеТипыОплат.Добавить("Выплата безналичных денег"	,, Истина);
	
	Результат.Вставить("ЗагружаемыеТипыОплат"	, ЗагружаемыеТипыОплат);
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 13.07.2020 12:19:24
	Результат.Вставить("ВыгружатьСтатусыТоваров",Ложь);
	//Смарт }Подкин Алексей Иванович 13.07.2020 12:19:24
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.07.2020 9:50:33
	Результат.Вставить("ВыгружатьФайлыПрикрепляемыеКЗаказу",Ложь);
	//Смарт }Подкин Алексей Иванович 30.07.2020 9:50:33
	
	Возврат Результат;
	
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьОбъектыОбменаСервер")
Процедура смарт_ЗаполнитьОбъектыОбменаСервер()

	СохраненнаяСтруктураНастроек = РеквизитФормыВЗначение("Объект").СохраненныеНастройки.Получить();

	Если ТипЗнч(СохраненнаяСтруктураНастроек) = Тип("Структура") Тогда

		ВыгрузкаИнформацииОНоменклатуре = СохраненнаяСтруктураНастроек.ИнформацияОНоменклатуре.ВыгрузкаИнформацииОНоменклатуре;
		ВыгрузкаКартЛояльности 			= СохраненнаяСтруктураНастроек.КартыЛояльности.ВыгрузкаКартЛояльности;
		ВыгрузкаКонтрагентов 			= СохраненнаяСтруктураНастроек.Контрагенты.ВыгрузкаКонтрагентов;
		ВыгрузкаПользовательскихСправочников = СохраненнаяСтруктураНастроек.ПользовательскиеСправочники.ВыгрузкаПользовательскихСправочников;
		ВыгрузкаСкидок 					= СохраненнаяСтруктураНастроек.Скидки.ВыгрузкаСкидок;
		ОбменДокументами 				= СохраненнаяСтруктураНастроек.Заказы.ОбменДокументами;
		
		#Вставка
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 20.08.2021 12:08:56 задача 552
		Если СохраненнаяСтруктураНастроек.Свойство("Подписки") Тогда
			ЗагрузкаПодписок = СохраненнаяСтруктураНастроек.Подписки.ЗагрузкаПодписок;	
		КонецЕсли; 
		//Смарт }Подкин Алексей Иванович 20.08.2021 12:08:56
		#КонецВставки
		
		АдресНастроекОбмена				= ПоместитьВоВременноеХранилище (СохраненнаяСтруктураНастроек, УникальныйИдентификатор);
		
		#Вставка
		//++ смарт:Подкин #552 17.02.2022 10:57:09 для сохранения версионности 
        Если СпкУстановкаВерсий.Количество() = 0 тогда
            СпкУстановкаВерсий = ПолучитьНастройкиВерсионности();
        КонецЕсли;
        //-- смарт:Подкин #552 17.02.2022 10:57:09
		#КонецВставки

	Иначе
		Объект.АдресСайта = "<Введите адрес сайта>/bitrix/admin/1c_exchange.php";

		ВыгрузкаИнформацииОНоменклатуре = Истина;
		ОбменДокументами = Истина;

		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("ИнформацияОНоменклатуре"	, ПолучитьНастройкиИнформацииТоваровПоУмолчанию());
		СтруктураНастроек.Вставить("ПользовательскиеСправочники", ПолучитьНастройкиПользовательскихСправочниковПоУмолчанию());
		СтруктураНастроек.Вставить("КартыЛояльности", ПолучитьНастройкиКартЛояльностиПоУмолчанию());
		СтруктураНастроек.Вставить("Контрагенты"	, ПолучитьНастройкиКонтрагентовПоУмолчанию());
		СтруктураНастроек.Вставить("Скидки"			, ПолучитьНастройкиСкидокПоУмолчанию());
		СтруктураНастроек.Вставить("Заказы"			, ПолучитьНастройкиЗаказовПоУмолчанию());

		#Вставка
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 20.08.2021 11:46:43 задача 552
		СтруктураНастроек.Вставить("Подписки"			, ПолучитьНастройкиПодписокПоУмолчанию());
		//Смарт }Подкин Алексей Иванович 20.08.2021 11:46:43
		#КонецВставки
		
		АдресНастроекОбмена	= ПоместитьВоВременноеХранилище (СтруктураНастроек, УникальныйИдентификатор);

		СпкУстановкаВерсий = ЗаполнитьСпкОбъектовДляВерсий();

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьОтображениеКнопокРежимовОбмена")
Процедура смарт_ОбновитьОтображениеКнопокРежимовОбмена()

	Элементы.НастроитьИнфомациоОТоварах.Доступность 					= ВыгрузкаИнформацииОНоменклатуре;
	Элементы.НастроитьВыгрузкуКартЛояльности.Доступность				= ВыгрузкаКартЛояльности;
	Элементы.НастроитьВыгрузкуКонтрагентов.Доступность 					= ВыгрузкаКонтрагентов;
	Элементы.НастроитьВыгрузкуСкидок.Доступность 						= ВыгрузкаСкидок;
	Элементы.НастроитьОбменЗаказов.Доступность 							= ОбменДокументами;
	Элементы.НастроитьВыгрузкуПользовательскихСправочников.Доступность 	= ВыгрузкаПользовательскихСправочников;

	Объект.ОбменДокументами		= ОбменДокументами;
	Объект.ОбменТоварами 		= ВыгрузкаИнформацииОНоменклатуре;
	Объект.ОбменПользовательскимиСправочниками = ВыгрузкаПользовательскихСправочников;

	#Вставка
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 20.08.2021 12:50:00 задача 552
	объект.смартЗагрузкаПодписок = ЭтаФорма.ЗагрузкаПодписок;
	//Смарт }Подкин Алексей Иванович 20.08.2021 12:50:00
	#КонецВставки
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекОбмена) тогда

		Настройки 	= ПолучитьИзВременногоХранилища(АдресНастроекОбмена);

		Настройки.ИнформацияОНоменклатуре.ВыгрузкаИнформацииОНоменклатуре 			= ВыгрузкаИнформацииОНоменклатуре; 
		Настройки.ПользовательскиеСправочники.ВыгрузкаПользовательскихСправочников 	= ВыгрузкаПользовательскихСправочников; 
		Настройки.КартыЛояльности.ВыгрузкаКартЛояльности 							= ВыгрузкаКартЛояльности; 
		Настройки.Скидки.ВыгрузкаСкидок 											= ВыгрузкаСкидок; 
		Настройки.Контрагенты.ВыгрузкаКонтрагентов 									= ВыгрузкаКонтрагентов; 
		Настройки.Заказы.ОбменДокументами 											= ОбменДокументами; 

		#Вставка
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 20.08.2021 12:01:06 задача 552
		Если Настройки.Свойство("Подписки") Тогда
			Настройки.Подписки.ЗагрузкаПодписок = ЭтаФорма.ЗагрузкаПодписок;
		КонецЕсли; 
		//Смарт }Подкин Алексей Иванович 20.08.2021 12:01:06
		#КонецВставки
		
		АдресНастроекОбмена = ПоместитьВоВременноеХранилище (Настройки, УникальныйИдентификатор);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 20.08.2021 11:48:06 задача 552
&НаСервере
Функция ПолучитьНастройкиПодписокПоУмолчанию()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЗагрузкаПодписок", Ложь);	

	Возврат Результат;
	
КонецФункции

#КонецОбласти