#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Порядок = 0;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Порядок = 0 Тогда
		Порядок = ПолучитьНовоеЗначениеПорядка();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Отбор") И
		ТипЗнч(ДополнительныеСвойства.Отбор) = Тип("ОтборКомпоновкиДанных") Тогда
		Отбор = Новый ХранилищеЗначения(ДополнительныеСвойства.Отбор, Новый СжатиеДанных(9));
		ОтборСтрока = Строка(Строка(ДополнительныеСвойства.Отбор));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНовоеЗначениеПорядка()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Порядок КАК Порядок
	|ИЗ
	|	Справочник.CRM_УровниПоддержки КАК Таблица
	|ГДЕ
	|	НЕ Таблица.Ссылка = ЗНАЧЕНИЕ(Справочник.CRM_УровниПоддержки.ПоУмолчанию)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат ?(Не ЗначениеЗаполнено(Выборка.Порядок), 1, Выборка.Порядок + 1);
	
КонецФункции

#КонецОбласти

#КонецЕсли
