
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОписаниеМетки(АдресСсылка) Экспорт
	ОписаниеМетки = Новый Структура;
	ОписаниеМетки.Вставить("Заголовок","<a href = ""#"">"+АдресСсылка.Владелец.Наименование+"</a>");
	ОписаниеМетки.Вставить("Описание", "<b>"+АдресСсылка.Наименование+"</b>");
	ОписаниеМетки.Вставить("Подвал","<b>Адрес: </b>" + АдресСсылка.ПредставлениеАдреса);
	ОписаниеМетки.Вставить("Подсказка",);
	ОписаниеМетки.Вставить("Широта", ?(АдресСсылка.Широта = 0, 55.751574, АдресСсылка.Широта));
	ОписаниеМетки.Вставить("Долгота", ?(АдресСсылка.Долгота = 0, 37.573856, АдресСсылка.Долгота));
	ОписаниеМетки.Вставить("Наименование", АдресСсылка.Наименование);
	ОписаниеМетки.Вставить("Адрес", АдресСсылка.ПредставлениеАдреса);
	Возврат ОписаниеМетки;
КонецФункции

#КонецОбласти