#Область ОбработчикиСобытийФормы

//++ #Б-3788 смарт: Лопато 16.07.2025 //Маркировка радиоэлектронной продукции. Доработка справочника "Коды ТН ВЭД"  
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьФормуПоОбъекту();
	КонецЕсли;
	
	#Вставка
	//++ #Б5134 смарт: Шляпников 18.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Коды ТН ВЭД". Добавить перечисления Вид маркировки.
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартВидМаркировки",,, 2, "Объект.смартВидМаркировки",,, "СырьевойТовар");
	//-- #Б5134 смарт: Шляпников 18.12.2025

	//++ #Б-3788 смарт: Лопато 16.07.2025 //Маркировка радиоэлектронной продукции. Доработка справочника "Коды ТН ВЭД"  
	НовыйЭлемент = Элементы.Добавить("смартОбязательнаяМаркировка", Тип("ПолеФормы"), ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОбязательнаяМаркировка";
    НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииПризнакаМаркировки");
	
	НовыйЭлемент = Элементы.Добавить("смартЭкспериментальныйРежимМаркировки", Тип("ПолеФормы"), ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартЭкспериментальныйРежимМаркировки";
    НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииПризнакаМаркировки");
	//-- #Б-3788 смарт: Лопато 16.07.2025
	
	//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
	УстановитьВидимостьДоступность();
	//-- #Б3790 смарт: Шляпников 12.08.2025 
	
	//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартБазоваяСтавка", ЭтаФорма,, 1, "Объект.смартБазоваяСтавка"); 
	смартФормированиеИнтерфейса.СздПолеФлажок(ЭтаФорма, "смартПовышенныйТаможенныйСбор", ЭтаФорма, , , "Объект.смартПовышенныйТаможенныйСбор");
	//-- #6726  смарт: Тимофеева 22.05.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
&НаКлиенте
Процедура ПриИзмененииПризнакаМаркировки(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.смартЭкспериментальныйРежимМаркировки.Доступность = НЕ Объект.смартОбязательнаяМаркировка;
	Элементы.смартОбязательнаяМаркировка.Доступность = НЕ Объект.смартЭкспериментальныйРежимМаркировки;
	
КонецПроцедуры

#КонецОбласти