#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить настройки
//
// Параметры:
//  ЭлементНастройки - ДанныеФормыСтруктура, Ссылка	 - элемент, для которого следует получать настройки.
// 
// Возвращаемое значение:
//  Структура - сохраненные настройки.
// 
Функция ПолучитьНастройки(ЭлементНастройки) Экспорт

	
	Если ТипЗнч(ЭлементНастройки) = Тип("ДанныеФормыСтруктура") Тогда
		ЭлементНастройкиСсылка = ЭлементНастройки.Ссылка;
	Иначе
		ЭлементНастройкиСсылка = ЭлементНастройки;
	КонецЕсли;
	
	Возврат ЭлементНастройкиСсылка.Настройки.Получить();
		
КонецФункции // ПолучитьНастройки()

#КонецОбласти

#КонецЕсли