
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	Если Объект.СтатусВзаимодействия = ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Завершено") Тогда
		СтруктураПоиска = Новый Структура("Выполнено", Истина);
		СтрокиЗавершено = Объект.ЧекЛист.НайтиСтроки(СтруктураПоиска);
		Если СтрокиЗавершено.Количество() = Объект.ЧекЛист.Количество() Тогда
			Объект.ПосещениеПодтверждено = Истина;
			Элементы.Состояние.ЦветФона = WebЦвета.СветлоЗеленый;
			ПоследнееСостояниеВзаимодействия = Объект.СтатусВзаимодействия;
		ИначеЕсли Объект.ЧекЛист.Количество() = 0 Тогда	
			Элементы.Состояние.ЦветФона = ?(Объект.ПосещениеПодтверждено, WebЦвета.СветлоЗеленый, WebЦвета.ЛососьСветлый);
			ПоследнееСостояниеВзаимодействия = Объект.СтатусВзаимодействия;
		Иначе	
			Если ПроверитьВозможностьЗавершения() Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаОЗавершении", ЭтотОбъект, Новый Структура("ПосещениеПодтверждено", Ложь));
				ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Не все задачи по чек-листу выполнены. 
				|Завершить взаимодействие ?'"), РежимДиалогаВопрос.ДаНет);
			Иначе
				ОбработкаОтветаОЗавершении(КодВозвратаДиалога.Нет,  Новый Структура("ПосещениеПодтверждено", Ложь));	
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.Состояние.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьЗавершения()
	СтруктураПоиска = Новый Структура("Выполнено", Ложь);
	СтрокиНЕЗавершено = Объект.ЧекЛист.НайтиСтроки(СтруктураПоиска);
	МожноЗавершить = Истина;
	Для Каждого СтрокаЧЛ Из СтрокиНЕЗавершено Цикл
		Если СтрокаЧЛ.Обязательный Тогда
			МожноЗавершить = Ложь;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ МожноЗавершить Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выполнены обязательные пункты чек-листа. 
		|Завершить взаимодействие невозможно'");
		Сообщение.Сообщить();
	КонецЕсли;	
	Возврат МожноЗавершить;
КонецФункции

&НаКлиенте
Процедура ОбработкаОтветаОЗавершении(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ПосещениеПодтверждено = ДопПараметры.ПосещениеПодтверждено;
		Объект.СтатусВзаимодействия = ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Завершено");
		Элементы.Состояние.ЦветФона = ?(Объект.ПосещениеПодтверждено, WebЦвета.СветлоЗеленый, WebЦвета.ЛососьСветлый);
		Модифицированность = Истина;
	Иначе	
		Объект.СтатусВзаимодействия = ПоследнееСостояниеВзаимодействия;
		Элементы.Состояние.ЦветФона = WebЦвета.Белый;
		Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПосещение(Команда)
	ОписаниеМетки = ПолучитьОписаниеМетки(Объект.АдресОфиса);
	Объект.ДолготаЗавершенияВстречи = ОписаниеМетки.Долгота;
	Объект.ШиротаЗавершенияВстречи = ОписаниеМетки.Широта;
	Объект.ПосещениеПодтверждено = Истина;
	Объект.СтатусВзаимодействия = ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Завершено");
	Элементы.Состояние.ЦветФона = WebЦвета.СветлоЗеленый;
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ОткрыватьФорму")
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование)<>Тип("СправочникСсылка.CRM_ЖурналыВстреч") Тогда
		// CRM Модуль
		//НеОбрабатыватьОткрытие = Истина;
		//Возврат;
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		Если МодульУправлениеДоступом <> Неопределено Тогда
			НеОбрабатыватьОткрытие = МодульУправлениеДоступом.ЧтениеРазрешено(Объект.ДокументОснование);
		Иначе
			НеОбрабатыватьОткрытие = Истина;
		КонецЕсли;
		Если НеОбрабатыватьОткрытие Тогда
			Возврат;
		КонецЕсли;
		// CRM Модуль
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "КоманднаяПанельФормы");
		ДополнительныеПараметры.Вставить("Объект", Объект);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ВидВзаимодействия") И
			ЗначениеЗаполнено(Параметры.ВидВзаимодействия) Тогда
			Объект.ВидВзаимодействия = Параметры.ВидВзаимодействия;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытоИзФормыНапоминаний = Ложь;
	Параметры.Свойство("ОткрытоИзФормыНапоминаний", ОткрытоИзФормыНапоминаний);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ОтрисоватьКатегорииНаФорме();
	ЗаполнитьГруппуОповещений();
	ПериодическоеСтароеЗначение = Объект.Периодическое;
	
	СписокТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	СписокТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	CRM_УправлениеКонтактнойИнформацией.ИнициализацияКонтактнойИнформации(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.Партнер, "ГруппаКИКлиента", СписокТиповКИ.ВыгрузитьЗначения());
		CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.КонтактноеЛицо, "ГруппаКИКонтакта", СписокТиповКИ.ВыгрузитьЗначения());
	ИначеЕсли ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда	
		CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.ПотенциальныйКлиент, "ГруппаКИПотенциальногоКлиента", СписокТиповКИ.ВыгрузитьЗначения());
	КонецЕсли;
	
	ЗаполнитьУчастников();
	ПараметрыВыбораВида = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.Направление", Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес));
			СостоянияИнтереса = Новый Массив;
			УстановитьПривилегированныйРежим(Истина);
			СостоянияИнтереса.Добавить(Объект.ДокументОснование.СостояниеИнтереса);
			УстановитьПривилегированныйРежим(Ложь);
			СостоянияИнтереса.Добавить(Справочники.CRM_СостоянияИнтересов.ПустаяСсылка());
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.СостояниеИнтереса", Новый ФиксированныйМассив(СостоянияИнтереса)));
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.Задача_ЗадачаИсполнителя));
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("СправочникСсылка.CRM_ЖурналыВстреч") Тогда
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));	
		Иначе
			ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));
		КонецЕсли;
	Иначе
		ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));
	КонецЕсли;
	
	Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВида);
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("СправочникСсылка.CRM_ЖурналыВстреч") Тогда
		Элементы.ОбъектВзаимодействия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.CRM_ЖурналыВстреч");
	Иначе	
		Элементы.ОбъектВзаимодействия.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.CRM_Интерес");
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		Элементы.ДекорацияВыбратьГруппу.Доступность = Ложь;
	КонецЕсли;
	СформироватьПредставлениеВложений();
	CRM_ОбщегоНазначенияПовтИсп.ЗаполнитьСписокВыбораВариантовСроков(Элементы.ДатаНачала);
	
	ЭтоВстречаЖурнала = ТипЗнч(Объект.ДокументОснование) = Тип("СправочникСсылка.CRM_ЖурналыВстреч");
	
	Если ЭтоВстречаЖурнала Тогда
		ПараметрыВыбораВидВзаимодействия = Новый Массив;
		ПараметрыВыбораВидВзаимодействия.Добавить(Новый ПараметрВыбора("Отбор.ПланироватьвЖурналеВстреч", Истина));
		Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВидВзаимодействия);
	КонецЕсли;
	
	Если ЭтоВстречаЖурнала Тогда
		Элементы.ГруппаПериодВзаимодействия.Доступность = НЕ (Объект.ДокументОснование.Статус = Перечисления.CRM_СтатусыСогласованияПланированияВстреч.Действует);
		
		Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Объект.ДокументОснование) Тогда
			МассивЗадач = CRM_БизнесПроцессыСервер.ПолучитьНеВыполненныеЗадачи(Объект.ДокументОснование, Ложь);	
			Если МассивЗадач.Количество() > 0 Тогда
				ТекущаяЗадача = МассивЗадач[0];
				Если ТекущаяЗадача.Исполнитель <> Пользователи.ТекущийПользователь() Тогда
					Элементы.ГруппаПериодВзаимодействия.Доступность = Ложь;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	Если Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
		Элементы.Состояние.ЦветФона = ?(Объект.ПосещениеПодтверждено, WebЦвета.СветлоЗеленый, WebЦвета.ЛососьСветлый);
	КонецЕсли;	
	
	Элементы.ГруппаЧекЛист.Видимость = (Объект.ЧекЛист.Количество() > 0);
	ПоследнееСостояниеВзаимодействия = Объект.СтатусВзаимодействия;
	Элементы.ГруппаАдресОфиса.Видимость	= ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПланированиеВстреч");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НеОбрабатыватьОткрытие Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			ПараметрыОткрытия = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", Объект.ДокументОснование, Объект.Ссылка);
			ОткрытьФорму("Документ.CRM_Интерес.ФормаОбъекта", ПараметрыОткрытия);
		Иначе
			ПоказатьЗначение(, Объект.ДокументОснование);
		КонецЕсли;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	// Поиск себя.
	МассивСтрок = Участники.НайтиСтроки(Новый Структура("Участник", ТекущийПользователь));
	Если МассивСтрок.Количество() > 0 Тогда
		Элементы.Участники.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ЭтотОбъект.Заголовок = СформироватьЗаголовокФормы(Объект.Ссылка, Объект.Тема);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// При открытии Интереса вместо взаимодействия отрабатывает оповещение и падает на УправлениеСвойствамиКлиент
	Если ИмяСобытия = "СПАРКРиски:ИзмененоСостояниеФоновогоЗадания" Тогда
		Возврат;
	КонецЕсли;
	Если ИмяСобытия = "УстановленНовыйОтветственный" Тогда
		ДобавитьОтветственногоВУчастники();
	ИначеЕсли ИмяСобытия = "ИзменениеСпискаПрисоединенныхФайлов" И (Объект.Ссылка = Параметр) Тогда
		СформироватьПредставлениеВложений();
	ИначеЕсли ИмяСобытия = "Запись_Файл" И (ТипЗнч(Источник) = Тип("СправочникСсылка.CRM_ВзаимодействиеПрисоединенныеФайлы")
		ИЛИ ТипЗнч(Источник) = Тип("Массив") И Источник.Количество() > 0  И ТипЗнч(Источник[0]) = Тип("СправочникСсылка.CRM_ВзаимодействиеПрисоединенныеФайлы")) Тогда
		СформироватьПредставлениеВложений();
	ИначеЕсли ИмяСобытия = "ОбновитьОблакоТегов" И (ЭтотОбъект = Параметр) Тогда
		ОбновитьОблакоТегов();
	КонецЕсли;
	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		Если МодульУправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбновитьЭлементыДополнительныхРеквизитов();
		КонецЕсли;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриЧтенииСозданииНаСервере();
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	CRM_СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, Неопределено);
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// CRM_УправлениеДоступом
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступомУровниДоступа");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец CRM_УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ОткрытоИзФормыНапоминаний И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Оповестить("ПисьмоУспешноОткрытоИзНапоминания",Новый Структура("Ссылка, Пользователь", Объект.Ссылка, ПользователиКлиентСервер.ТекущийПользователь()));
	КонецЕсли; 	
	Если НЕ ЗначениеЗаполнено(Объект.СостояниеИнтереса) И ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		Объект.СостояниеИнтереса = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.ДокументОснование, "СостояниеИнтереса");	
	КонецЕсли; 
	Если ЭтотОбъект.Модифицированность Тогда
		ВопросИзмененияЗадавался = Ложь;
		ЭтотОбъект.Модифицированность = Ложь;
	КонецЕсли;
	ДатаНовая				= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	ОкончаниеСобытияНовое	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончанияПлан, ВремяОкончанияПлан);
	Объект.ПлановаяДата				= ДатаНовая;
	Объект.ПлановаяДатаЗавершение	= ОкончаниеСобытияНовое;
	СохранитьУчастников();
	Если НЕ ВопросИзмененияЗадавался Тогда
		ПериодическоеСобытиеСпособИзмененияРяда = "";
		Если ЗначениеЗаполнено(Объект.РядСобытий) Тогда
			бПризнакИзмененоВРяде = Неопределено;
			Если Объект.Периодическое И НЕ Объект.ИзмененоВРяде И НЕ ПризнакПериодическоеСобытиеИнициализация Тогда
				// Проверка на то, что даты были изменены больше чем на день - для периодического события это означает установку
				// флага ИзмененоВРяде.
				ДатаСтарая				= Объект.ПлановаяДата;
				ОкончаниеСобытияСтарое	= Объект.ПлановаяДатаЗавершение;
				бИзмененаДатаНачала		= НЕ (НачалоДня(ДатаСтарая) = НачалоДня(ДатаНовая));
				бИзмененаДатаОкончания	= НЕ (НачалоДня(ОкончаниеСобытияСтарое) = НачалоДня(ОкончаниеСобытияНовое));
				Если бИзмененаДатаНачала ИЛИ бИзмененаДатаОкончания Тогда
					бПризнакИзмененоВРяде = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.РядСобытий) Тогда
			Если НЕ ПризнакПериодическоеСобытиеИнициализация Тогда
				Если Объект.Периодическое Тогда
					Если НЕ Объект.ИзмененоВРяде И (бПризнакИзмененоВРяде = Истина) Тогда
						Объект.ИзмененоВРяде = Истина;
					КонецЕсли;
				ИначеЕсли ПериодическоеСтароеЗначение И НЕ Объект.ИзмененоВРяде Тогда
					// Снята пометка "Периодическое".
					ПериодическоеСобытиеСпособИзмененияРяда = "УдалитьВсеСобытияРяда";
				КонецЕсли;
				Если Объект.Периодическое И НЕ Объект.ИзмененоВРяде Тогда
					Если ПризнакПериодическоеСобытиеИнициализация Тогда
						ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд";
					Иначе
						Если НЕ Модифицированность И НЕ ПризнакИзмененоРасписание Тогда
							ПериодическоеСобытиеСпособИзмененияРяда = "";
						Иначе
							ПараметрыФормы = Новый Структура("ДоступныеДействия", Новый Массив());
							Если НЕ ПризнакИзмененоРасписание Тогда
								ПараметрыФормы.ДоступныеДействия.Добавить("ТолькоТекущее");
							КонецЕсли;
							ПараметрыФормы.ДоступныеДействия.Добавить("ДоКонцаРяда");
							ПараметрыФормы.ДоступныеДействия.Добавить("ВесьРяд");
							
							Отказ = Истина;
							ОП = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект);
							ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаИзменениеПериодическогоСобытия", ПараметрыФормы, ЭтотОбъект,,,,ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
							Возврат;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Параметры, Дополнительно) Экспорт
	Если Параметры <> Неопределено Тогда
		Если Параметры.ПринятьИзменения = Истина Тогда 
			ПериодическоеСобытиеСпособИзмененияРяда = Параметры.СпособИзмененияРяда;
			ВопросИзмененияЗадавался = Истина;
			Записать();
		Иначе
			ВопросИзмененияЗадавался = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЭтоНовыйОбъект = ТекущийОбъект.Ссылка.Пустая();
	ПризнакНовогоМероприятия = ЭтоНовыйОбъект;
	Если ТекущийОбъект.СтатусВзаимодействия.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.Завершено И ТекущийОбъект.СтатусВзаимодействия<>ТекущийОбъект.Ссылка.СтатусВзаимодействия Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) И ТипЗнч(ТекущийОбъект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			УстановитьПривилегированныйРежим(Истина);
			ТекущийОбъект.СостояниеИнтереса = ТекущийОбъект.ДокументОснование.СостояниеИнтереса;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		ТекущийОбъект.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
		ТекущийОбъект.ЗавершившийПользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;	
	Если ТекущийОбъект.СтатусВзаимодействия.ТипСостояния <> Перечисления.CRM_ТипыСостоянийСобытий.Завершено И ЗначениеЗаполнено(ТекущийОбъект.ДатаЗавершенияВзаимодействия) Тогда
		ТекущийОбъект.ДатаЗавершенияВзаимодействия = Дата(1,1,1);
	КонецЕсли;
	ТекущийОбъект.ОрганизаторGApi = ТекущийОбъект.Ответственный;
	ТекущийОбъект.СторонниеЛица.Свернуть("Партнер,КонтактноеЛицо,ПотенциальныйКлиент,Адрес,ПредставлениеАдреса,Принадлежность,Телефон,ПосетитМероприятие,АдресОфиса","ОтправлятьСМС,ОтправлятьПоПочте");
	// Периодичность
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПериодическоеСобытиеСпособИзмененияРяда",ПериодическоеСобытиеСпособИзмененияРяда);
	Если ЗначениеЗаполнено(ТекущийОбъект.РядСобытий) Тогда
		Если (ПризнакПериодическоеСобытиеИнициализация Или ПризнакИзмененоРасписание) И ТекущийОбъект.Периодическое Тогда
			Если ПризнакПериодическоеСобытиеИнициализация Тогда
				ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд";
			КонецЕсли;
			Если ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд" Тогда
				МассивДатРасписания = Справочники.CRM_РядыСобытий.ПолучитьМассивДатРасписания(ТекущийОбъект.РядСобытий.ДатаНачала, ТекущийОбъект.РядСобытий.ДатаОкончания, ТекущийОбъект.РядСобытий);
			ИначеЕсли ПериодическоеСобытиеСпособИзмененияРяда = "ДоКонцаРяда" Тогда
				МассивДатРасписания = Справочники.CRM_РядыСобытий.ПолучитьМассивДатРасписания(ТекущийОбъект.ПлановаяДата, ТекущийОбъект.РядСобытий.ДатаОкончания, ТекущийОбъект.РядСобытий);
			Иначе
				МассивДатРасписания = Справочники.CRM_РядыСобытий.ПолучитьМассивДатРасписания(ТекущийОбъект.РядСобытий.ДатаНачала, ТекущийОбъект.РядСобытий.ДатаОкончания, ТекущийОбъект.РядСобытий);
			КонецЕсли;
			Если МассивДатРасписания.Количество() = 0 Тогда
				Если ПризнакПериодическоеСобытиеИнициализация Или ПериодическоеСобытиеСпособИзмененияРяда = "ВесьРяд" Тогда
					Отказ = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Расписание периодического события настроенно некорректно - в указанный период не попадает ни одного события!';en='The schedule of periodic event are adjust incorrectly - to the specified period did not get any event!'"));
					Элементы.РядСобытийНаименование.Доступность = (Объект.Периодическое И ЗначениеЗаполнено(Объект.РядСобытий) И Не Объект.ИзмененоВРяде);
					Элементы.РядСобытийНаименование.Видимость = Объект.Периодическое;
					Возврат;
				КонецЕсли;
			Иначе
				ДатаВремяПервоеСобытие = МассивДатРасписания[0];
				ТекущийОбъект.ПлановаяДата = НачалоДня(ДатаВремяПервоеСобытие) + (ТекущийОбъект.ПлановаяДата - НачалоДня(ТекущийОбъект.ПлановаяДата)) ;
				ТекущийОбъект.ПлановаяДатаЗавершение = НачалоДня(ДатаВремяПервоеСобытие) + (ТекущийОбъект.ПлановаяДатаЗавершение - НачалоДня(ТекущийОбъект.ПлановаяДатаЗавершение));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Признаки. по которым в дальнейшем после записи будем определять, надо ли	оповестить участников мероприятия.
	ЭтоНовыйОбъект = ТекущийОбъект.Ссылка.Пустая();
	ПризнакНовогоМероприятия = ЭтоНовыйОбъект;
	Если НЕ ЭтоНовыйОбъект Тогда
		Если НЕ (ТекущийОбъект.ПлановаяДата = ТекущийОбъект.Ссылка.ПлановаяДата) ИЛИ НЕ (ТекущийОбъект.ПлановаяДатаЗавершение = ТекущийОбъект.Ссылка.ПлановаяДатаЗавершение) Тогда
			ПризнакИзмененаДата = Истина;
		КонецЕсли;
		Если НЕ (ТекущийОбъект.Место = ТекущийОбъект.Ссылка.Место) Тогда
			ПризнакИзмененоМестоМероприятия = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ (Год(ТекущийОбъект.Дата) = Год(ТекущийОбъект.Ссылка.Дата)) Тогда
		ТекущийОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	ПроверитьНаличиеНовыхУчастников(ТекущийОбъект);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбъектЗаписанПользователем");
	Если ТекущийПользователь = Объект.Ответственный Или Не ПризнакНовогоМероприятия Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеСоздаватьОповещенияПоУмолчанию");
	КонецЕсли;
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.ПлановаяДата	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ТаблицаНастроекОповещений = ДанныеФормыВЗначение(ЭтотОбъект._ТаблицаОповещений, Тип("ТаблицаЗначений"));
	СтруктураИзменений = Новый Структура;
	СтруктураИзменений.Вставить("Новое",				ПризнакНовогоМероприятия);
	СтруктураИзменений.Вставить("ИзмененаДата",			ПризнакИзмененаДата);
	СтруктураИзменений.Вставить("ИзмененоМесто",		ПризнакИзмененоМестоМероприятия);
	СтруктураИзменений.Вставить("ИзмененСостав",		ИзмененСоставСтороннихУчастников);
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаНастроекОповещений",					ТаблицаНастроекОповещений);
	СтруктураДанных.Вставить("ОтменаИлиЗавершениеВзаимодействия",			
		Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или
		Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено);
	СтруктураДанных.Вставить("НовыеУчастники",								НовыеУчастники);
	СтруктураДанных.Вставить("УдаленныеУчастники",							УдаленныеУчастники);
	СтруктураДанных.Вставить("ЭтоНовоеСобытие",								ПризнакНовогоМероприятия);
	СтруктураДанных.Вставить("ИзмененСоставУчастников",						ИзмененСоставУчастников);
	СтруктураДанных.Вставить("ПризнакПериодическоеСобытиеИнициализация",	ПризнакПериодическоеСобытиеИнициализация);
	СтруктураДанных.Вставить("Пользователь",								ТекущийПользователь);
	СтруктураДанных.Вставить("Состояние",									СтруктураИзменений);
	АдресНастроек = ПоместитьВоВременноеХранилище(СтруктураДанных, УникальныйИдентификатор);
	Если ПризнакИзмененыОповещения ИЛИ ПризнакПериодическоеСобытиеИнициализация ИЛИ ИзмененСоставУчастников Тогда
		// Тут надо формировать записи оповещений.
		CRM_ОповещенияСервер.СформироватьОповещенияПоСобытию(ТекущийОбъект.Ссылка, АдресНастроек);
		ИзмененСоставУчастников	= Ложь;
		ПризнакИзмененыОповещения	= Ложь;
	КонецЕсли;
	// Периодичность
	Если ЗначениеЗаполнено(ТекущийОбъект.РядСобытий) Тогда
		Если ПериодическоеСобытиеСпособИзмененияРяда = "УдалитьВсеСобытияРяда" Тогда
			// Если удаляются все события ряда, форма должна быть закрыта после записи, т.к. объекта, связанного с формой, уже
			// не будет.
			ЗакрытьФормуПослеЗаписиСОповещением = Истина;
			// Объект нужно разблокировать т.к. он будет удаляться программно.
			Попытка
				ТекущийОбъект.Разблокировать();
			Исключение
			КонецПопытки;
			CRM_МероприятияСервер.ИзменитьМероприятияРяда(ТекущийОбъект.Ссылка, ПериодическоеСобытиеСпособИзмененияРяда, ТекущийОбъект.ПлановаяДата,,АдресНастроек);
		ИначеЕсли ТекущийОбъект.Периодическое И Не ТекущийОбъект.ИзмененоВРяде И ЗначениеЗаполнено(ПериодическоеСобытиеСпособИзмененияРяда) Тогда
			Если ПризнакИзмененоРасписание Тогда
				//ЗакрытьФормуПослеЗаписиСОповещением = Истина;
				// Объект нужно разблокировать т.к. он будет изменяться программно.
				Попытка
					ТекущийОбъект.Разблокировать();
				Исключение
				КонецПопытки;
			КонецЕсли;
			CRM_МероприятияСервер.ИзменитьМероприятияРяда(ТекущийОбъект.Ссылка, ПериодическоеСобытиеСпособИзмененияРяда, ТекущийОбъект.ПлановаяДата,,АдресНастроек);
		КонецЕсли;
		ПериодическоеСобытиеСпособИзмененияРяда		= "";
		ПризнакПериодическоеСобытиеИнициализация	= Ложь;
		ПризнакИзмененоРасписание					= Ложь;
	КонецЕсли;
	CRM_СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьПланировщик", Объект.ДокументОснование);
	ЭтотОбъект.Заголовок = СформироватьЗаголовокФормы(Объект.Ссылка, Объект.Тема);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПередНачаломИзменения(Элемент, Отказ)
	ТекСтрока = Элемент.ТекущиеДанные;
	ТекЭлемент = Элемент.ТекущийЭлемент;
	Если ТекСтрока<>Неопределено И ТекЭлемент<>Неопределено Тогда
		Если ТекСтрока.ЗаполненоИзШаблона Тогда
			Если ТекЭлемент.Имя = "ЧекЛистВыполнено" Тогда
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru='Запрещено редактировать эту строку чек-листа'");
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПередУдалением(Элемент, Отказ)
	ТекСтрока = Элемент.ТекущиеДанные;
	Если ТекСтрока<>Неопределено Тогда
		Если ТекСтрока.ЗаполненоИзШаблона Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Запрещено удалять эту строку чек-листа'");
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СтруктураПоиска = Новый Структура("Выполнено", Истина);
    СтрокиЗавершено = Объект.ЧекЛист.НайтиСтроки(СтруктураПоиска);
	Если СтрокиЗавершено.Количество() = Объект.ЧекЛист.Количество() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаОЗавершении", ЭтотОбъект, Новый Структура("ПосещениеПодтверждено", Истина));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Все задачи по чек-листу выполнены. 
		|Завершить взаимодействие ?'"), РежимДиалогаВопрос.ДаНет);
	ИначеЕсли Объект.СтатусВзаимодействия = ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Завершено") Тогда
		Объект.СтатусВзаимодействия = ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Запланировано");
		Объект.ПосещениеПодтверждено = Ложь;
		Элементы.Состояние.ЦветФона = WebЦвета.Белый;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	CRM_ТрудозатратыКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	CRM_ТрудозатратыКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТемаПриИзменении(Элемент)
	ЭтотОбъект.Заголовок = СформироватьЗаголовокФормы(Объект.Ссылка, Объект.Тема);
КонецПроцедуры

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ИндексЦвета = Результат[0].Картинка;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ИндексЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ИндексЦвета);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
Процедура ДекорацияАвторДатаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Объект.Автор);
КонецПроцедуры

&НаКлиенте
Процедура ВидВзаимодействияПриИзменении(Элемент)
	Если Объект.ЧекЛист.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаОСменеВида", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Чек-лист будет очищен. Продолжить ?'"), РежимДиалогаВопрос.ДаНет);
	Иначе	
		ВидВзаимодействияПриИзмененииНаСервере();
		ПоследнийВидВзаимодействия = Объект.ВидВзаимодействия;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОСменеВида(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ЧекЛист.Очистить();
		ВидВзаимодействияПриИзмененииНаСервере();
		ПоследнийВидВзаимодействия = Объект.ВидВзаимодействия;
		Модифицированность = Истина;
	Иначе	
		Объект.ВидВзаимодействия = ПоследнийВидВзаимодействия;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЭтоВстречаЖурнала Тогда
		Если НЕ ПроверитьКорректностьДаты(ДатаНачала, "ДатаНачала") Тогда
			ДатаНачала = Объект.ПлановаяДата;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	СтараяДатаНачала	= Объект.ПлановаяДата; 
	Объект.ПлановаяДата	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	Если НачалоДня(Объект.ПлановаяДата) > НачалоДня(Объект.ПлановаяДатаЗавершение) Тогда
		Если НачалоДня(СтараяДатаНачала) = ДатаОкончанияПлан Тогда
			ДатаОкончанияПлан	= ДатаНачала;
		Иначе	
			ДатаОкончанияПлан	= НачалоДня(ДатаНачала + (Объект.ПлановаяДатаЗавершение - СтараяДатаНачала));
		КонецЕсли;	
		Объект.ПлановаяДатаЗавершение	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончанияПлан, ВремяОкончанияПлан);
	КонецЕсли;
	Если Объект.Периодическое Тогда
		ПризнакИзмененоРасписание = Истина;
	КонецЕсли;
	ПересчитатьДатыОповещений();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		ПараметрыОткрытия.Вставить("ДатаПоУмолчанию", ДатаНачала);
	КонецЕсли;
	CRM_ВзаимодействияКлиент.ДатаВзаимодействияНачалоВыбора(Объект, Элемент, ДанныеВыбора, СтандартнаяОбработка, ПараметрыОткрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
	
&НаКлиенте
Процедура ДатаНачалаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ЭтоРезультатРаботыСКалендарем") Тогда
			СтандартнаяОбработка	= Ложь;
			ДатаНачала				= НачалоДня(ВыбранноеЗначение.Начало);
			ВремяНачала				= ВыбранноеЗначение.Начало - ДатаНачала;
			ДатаОкончанияПлан		= НачалоДня(ВыбранноеЗначение.Конец);
			ВремяОкончанияПлан		= ВыбранноеЗначение.Конец - ДатаОкончанияПлан;
			ДатаНачалаПриИзменении(Элементы.ДатаНачала);
		КонецЕсли;		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ПеречислениеСсылка.CRM_ВариантыУстановкиДаты") Тогда
		// Осуществляется перенос обеих дат на указанный интервал
		СтандартнаяОбработка	= Ложь;
		ДлительностьИнтервала	= Объект.ПлановаяДатаЗавершение - Объект.ПлановаяДата;
		Объект.ПлановаяДата		= CRM_ОбщегоНазначенияСервер.ДатаПоВариантуИнтервала(
			CRM_ОбщегоНазначенияСервер.БазоваяДатаПоВариантуИнтервала(Объект.ПлановаяДата, ВыбранноеЗначение), ВыбранноеЗначение);
		Объект.ПлановаяДатаЗавершение	= CRM_ОбщегоНазначенияСервер.ДатаПоВариантуИнтервала(
			CRM_ОбщегоНазначенияСервер.БазоваяДатаПоВариантуИнтервала(Объект.ПлановаяДатаЗавершение, ВыбранноеЗначение), ВыбранноеЗначение, ДлительностьИнтервала);
		ДатаИВремя			= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(Объект.ПлановаяДата);
		ДатаНачала			= ДатаИВремя.Дата;
		ВремяНачала			= ДатаИВремя.Время;
		ДатаИВремя			= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(Объект.ПлановаяДатаЗавершение);
		ДатаОкончанияПлан	= ДатаИВремя.Дата;
		ВремяОкончанияПлан	= ДатаИВремя.Время;
		Модифицированность	= Истина;
		ПересчитатьДатыОповещений();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	СтароеВремяНачала	= Дата('00010101') + (Объект.ПлановаяДата - НачалоДня(Объект.ПлановаяДата));
	Объект.ПлановаяДата	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	Если (ДатаНачала = ДатаОкончанияПлан) И (ВремяНачала > ВремяОкончанияПлан) Тогда
		ИнтервалВремени		= (ВремяОкончанияПлан - СтароеВремяНачала);
		ВремяОкончанияПлан	= ВремяНачала + ИнтервалВремени;
		Если ВремяНачала > ВремяОкончанияПлан Тогда
			ВремяОкончанияПлан	= КонецДня(ВремяНачала);
		КонецЕсли;	
	КонецЕсли;
	Если Объект.Периодическое Тогда
		ПризнакИзмененоРасписание = Истина;
	КонецЕсли;
	ПересчитатьДатыОповещений();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВремяНачалаНачалоВыбораЗавершение", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, ВремяНачала, Элемент,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаНачалоВыбораЗавершение(ВыбранноеВремя, СтандартнаяОбработка) Экспорт
	Если ВыбранноеВремя <> Неопределено Тогда
		ВремяНачала = ВыбранноеВремя.Значение;
		ВремяНачалаПриИзменении(Элементы.ВремяНачала);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПланПриИзменении(Элемент)
	Если ЭтоВстречаЖурнала Тогда
		Если НЕ ПроверитьКорректностьДаты(ДатаОкончанияПлан, "ДатаОкончания") Тогда
			ДатаОкончанияПлан = Объект.ПлановаяДатаЗавершение;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	СтараяДатаЗавершение			= Объект.ПлановаяДатаЗавершение; 
	Объект.ПлановаяДатаЗавершение	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончанияПлан, ВремяОкончанияПлан);
	Если НачалоДня(ДатаНачала) > НачалоДня(ДатаОкончанияПлан) Тогда
		Если НачалоДня(СтараяДатаЗавершение) = ДатаНачала Тогда
			ДатаНачала	= ДатаОкончанияПлан;
		Иначе	
			ДатаНачала	= НачалоДня(ДатаОкончанияПлан - (СтараяДатаЗавершение - Объект.ПлановаяДата));
		КонецЕсли;	
		Объект.ПлановаяДата	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	КонецЕсли;
	Если Объект.Периодическое Тогда
		ПризнакИзмененоРасписание = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПланПриИзменении(Элемент)
	СтароеВремяОкончания	= Дата('00010101') + (Объект.ПлановаяДатаЗавершение - НачалоДня(Объект.ПлановаяДатаЗавершение));
	Объект.ПлановаяДатаЗавершение = CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончанияПлан, ВремяОкончанияПлан);
	Если (ДатаНачала = ДатаОкончанияПлан) И (ВремяНачала > ВремяОкончанияПлан) Тогда
		ИнтервалВремени	= (СтароеВремяОкончания - ВремяНачала);
		ВремяНачала		= ВремяОкончанияПлан - ИнтервалВремени;
		Если ВремяНачала > ВремяОкончанияПлан Тогда
			ВремяНачала	= НачалоДня(ВремяОкончанияПлан);
		КонецЕсли;	
	КонецЕсли;
	Если Объект.Периодическое Тогда
		ПризнакИзмененоРасписание = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПланНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВремяОкончанияПланЗавершение", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, ВремяОкончанияПлан, Элемент,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПланЗавершение(ВыбранноеВремя, СтандартнаяОбработка) Экспорт
	Если ВыбранноеВремя <> Неопределено Тогда
		ВремяОкончанияПлан = ВыбранноеВремя.Значение;
		ВремяОкончанияПланПриИзменении(Элементы.ВремяОкончанияПлан);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаВесьДеньПриИзменении(Элемент)
	НастроитьВидимостьИДоступностьФормы();
	Если Объект.НаВесьДень Тогда
		УстановитьВремяНачалоВремяОкончание();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодическоеПриИзменении(Элемент)
	Если Объект.Периодическое Тогда
		Если НЕ ЗначениеЗаполнено(Объект.РядСобытий) Тогда
			СоздатьНовыйЭлементРядСобытий();
		ИначеЕсли НЕ Объект.Ссылка.Пустая() Тогда
			Если Объект.ИзмененоВРяде Тогда
				РядСобытийСтарый = Объект.РядСобытий;
				Объект.РядСобытий = ПредопределенноеЗначение("Справочник.CRM_РядыСобытий.ПустаяСсылка");
				СоздатьНовыйЭлементРядСобытий();
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если НЕ Объект.Ссылка.Пустая() И Объект.ИзмененоВРяде И ЗначениеЗаполнено(РядСобытийСтарый) Тогда
			Объект.РядСобытий = РядСобытийСтарый;
		КонецЕсли;
	КонецЕсли;
	НастроитьВидимостьИДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВключенаСинхронизацияКалендаря(Пользователь)
	Возврат CRM_СинхронизацияКалендарей.ВключенаСинхронизацияКалендаря(Пользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦветКалендаря(Пользователь, ИндексЦвета)
	Возврат CRM_СинхронизацияКалендарей.ПолучитьЦветКалендаря(Пользователь, ИндексЦвета);
КонецФункции

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ДобавитьОтветственногоВУчастники();
	ВключенаСинхронизацияКалендаря	= ВключенаСинхронизацияКалендаря(Объект.Ответственный);
	ЦветФонаКалендаря 				= ПолучитьЦветКалендаря(Объект.Ответственный, Объект.ИндексЦвета);
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	КонтактноеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПотенциальныйКлиентПриИзменении(Элемент)
	ПотенциальныйКлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	РезультатПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГостиМогутИзменятьМероприятиеПриИзменении(Элемент)
	Если Объект.ГостиМогутИзменятьМероприятие Тогда
		Объект.ГостиМогутПриглашатьДругихГостей = Истина;
		Объект.ГостиМогутВидетьСписокГостей = Истина;
	КонецЕсли;
	Элементы.ГостиМогутПриглашатьДругихГостей.Доступность = Не Объект.ГостиМогутИзменятьМероприятие;
	Элементы.ГостиМогутВидетьСписокГостей.Доступность = Не Объект.ГостиМогутИзменятьМероприятие;
КонецПроцедуры

&НаКлиенте
Процедура МестоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	ДополнительныеПараметры	= Новый Структура();
	ОповещениеВыбораМеста	= Новый ОписаниеОповещения("ОбработкаВыбораМеста", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыФормы			= Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Истина);
	ОткрытьФорму("Справочник.CRM_Помещения.ФормаВыбора", ПараметрыФормы, Элемент, , , , ОповещениеВыбораМеста);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМеста(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат; КонецЕсли;
	Объект.Место = СокрЛП(РезультатВыбора);
	Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.CRM_Помещения") Тогда
		Объект.Помещение					= РезультатВыбора;
		Элементы.Место.РедактированиеТекста	= Ложь;
	Иначе
		Объект.Помещение					= ПредопределенноеЗначение("Справочник.CRM_Помещения.ПустаяСсылка");
		Элементы.Место.РедактированиеТекста	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МестоОчистка(Элемент, СтандартнаяОбработка)
	Объект.Помещение = ПредопределенноеЗначение("Справочник.CRM_Помещения.ПустаяСсылка");
	Элементы.Место.РедактированиеТекста = Истина;
КонецПроцедуры // МестоОчистка()

&НаКлиенте
Процедура МестоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Массив = ВернутьПомещенияПоТексту(Текст);
	СписокПодбора = Новый СписокЗначений;
	Для Каждого Стр Из Массив Цикл
		СписокПодбора.Добавить(Стр);		
	КонецЦикла;
	ДанныеВыбора = СписокПодбора;
КонецПроцедуры // МестоАвтоПодбор()

&НаКлиенте
Процедура РядСобытийНаименованиеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.РядСобытий) Тогда
		СоздатьНовыйЭлементРядСобытий();
	Иначе
		ОткрытьФормуРасписания();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВзаимодействияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес")) Тогда
		Элементы.ОбъектВзаимодействия.Заголовок			= НСтр("ru='Основание'");
		Элементы.ОбъектВзаимодействия.ТолькоПросмотр	= ЗначениеЗаполнено(Объект.ДокументОснование);
	Иначе
		Элементы.ОбъектВзаимодействия.Заголовок			= НСтр("ru='Интерес'");
		Элементы.ОбъектВзаимодействия.ТолькоПросмотр	= Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВзаимодействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
		СтруктураОтбора.Вставить("Партнер", Объект.Партнер);
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Ложь);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
		ПараметрыФормыВыбора.Вставить("Отбор"				, СтруктураОтбора);
		ПараметрыФормыВыбора.Вставить("ЭтоВыборИнтереса"	, Истина);
		ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаСписка", ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
	Иначе
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Ложь);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
		ПараметрыФормыВыбора.Вставить("Отбор"				, СтруктураОтбора);
		ПараметрыФормыВыбора.Вставить("ЭтоВыборИнтереса"	, Истина);		
		ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаСписка", ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
	КонецЕсли;
КонецПроцедуры

#Область ПривязкаДокументовКИнтересамКлиентов

&НаКлиенте
Процедура Подключаемый_ИнтересНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.КлиентСписок) Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
		СтруктураОтбора.Вставить("Партнер", ЭтотОбъект.КлиентСписок);
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Ложь);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
		ПараметрыФормыВыбора.Вставить("Отбор"				, СтруктураОтбора);
		ПараметрыФормыВыбора.Вставить("ЭтоВыборИнтереса"	, Истина);
		ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаСписка", ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
	Иначе
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Ложь);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
		ПараметрыФормыВыбора.Вставить("Отбор"				, СтруктураОтбора);
		ПараметрыФормыВыбора.Вставить("ЭтоВыборИнтереса"	, Истина);		
		ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаСписка", ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНажатие(Команда)
	CRM_УправлениеКонтактнойИнформациейКлиент.КонтактнаяИнформацияНажатие(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ТаблицаИнтересовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(,Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ТаблицаИнтересовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
	ПараметрыФормыВыбора.Вставить("Отбор"				, СтруктураОтбора);
	ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаСписка", ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ТаблицаИнтересовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	CRM_ДобавитьИнтересНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ТаблицаИнтересовПередУдалением(Элемент, Отказ)
	Если НЕ Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные = Неопределено Тогда
		Отказ = Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные.ВведенНаОсновании;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ТаблицаИнтересовПослеУдаления(Элемент)
	ЭтотОбъект.CRM_ИнтересСтрокой = "";
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
// Динамически подключаемый обработчик изменения оповещения.
//
// Параметры:
//	Элемент	- ЭлементФормы	- Элемент формы.
//
Процедура Подключаемый_ОповещениеПриИзменении(Элемент)
	Если Найти(Элемент.Имя, "ПолеКанала_") > 0 Тогда
		ИдПолей = СтрЗаменить(Элемент.Имя, "ПолеКанала_","");
	ИначеЕсли Найти(Элемент.Имя, "ПолеСрокаОповещения_") > 0 Тогда
		ИдПолей = СтрЗаменить(Элемент.Имя, "ПолеСрокаОповещения_","");
	ИначеЕсли Найти(Элемент.Имя, "ПолеПериодаОповещения_") > 0 Тогда
		ИдПолей = СтрЗаменить(Элемент.Имя, "ПолеПериодаОповещения_","");
	КонецЕсли; 
	Если (Найти(Элемент.Имя, "ПолеСрокаОповещения_") > 0)
		ИЛИ (Найти(Элемент.Имя, "ПолеПериодаОповещения_") > 0) Тогда
		ДатаОповещения = ДатаНачала;
		ВремяОповещения = ВремяНачала;
		СрокОповещения = ЭтотОбъект["_СрокОповещения" + Строка(ИдПолей)];
		СтруктураОповещения = Новый Структура;
		СтруктураОповещения.Вставить("Предмет",			Новый Структура(" Дата", CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОповещения, ВремяОповещения)));
		СтруктураОповещения.Вставить("ВидОповещения",	ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ЗапланированныеСобытия"));
		СтруктураОповещения.Вставить("СрокОповещения",	СрокОповещения);
		СтруктураОповещения.Вставить("Периодичность",	ЭтотОбъект["_ПериодОповещения" + Строка(ИдПолей)]);
		СтруктураОповещения.Вставить("Получатель",		ПользователиКлиентСервер.ТекущийПользователь());
		СтруктураОповещения.Вставить("ВпередПоКалендарю", Ложь);
		ЭтотОбъект["_ДатаОповещения"+Строка(ИдПолей)]					= CRM_ОповещенияСервер.ПолучитьДатуОповещения(СтруктураОповещения);
		Элемент	= Элементы["ПолеДатыОповещения_" + Строка(ИдПолей)];
		Если ЭтотОбъект["_ДатаОповещения" + Строка(ИдПолей)] < CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса() Тогда
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения меньше текущего времени';en='Schedulable date of the notification is less than the current time'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
			Элемент.ЦветТекста				= Новый Цвет(255, 0, 0);
		Иначе	
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения';en='Schedulable date of the notification'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Всплывающая;
			Элемент.ЦветТекста				= Новый Цвет(0, 0, 0);
		КонецЕсли;	
	КонецЕсли;
	ПриИзмененииОповещения(ИдПолей);
	ПризнакИзмененыОповещения = Истина;
	CRM_ШаблоныОбъектовКлиент.ПоместитьКомандыГруппыТолькоВоВсеДействия(ЭтотОбъект);
КонецПроцедуры // Подключаемый_ОповещениеПриИзменении()

&НаКлиенте
// Динамически подключаемый обработчик удаления оповещения.
//
// Параметры:
//	Команда	- КомандаФормы 	- Команда формы.
//
Процедура Подключаемый_УдалитьОповещение(Команда)
	УдалитьОповещение(Команда.Имя);
	ПризнакИзмененыОповещения = Истина;
	CRM_ШаблоныОбъектовКлиент.ПоместитьКомандыГруппыТолькоВоВсеДействия(ЭтотОбъект);
КонецПроцедуры //  Подключаемый_УдалитьОповещение()

#КонецОбласти

#Область Тэги

&НаКлиенте
Процедура ТегПриИзменении(Элемент)
	CRM_ТегиКлиент.ТегПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТегОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	CRM_ТегиКлиент.ТегОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область Категории

&НаКлиенте
Процедура ДекорацияВыбратьГруппуНажатие(Элемент)
	МассивКатегорий = Новый Массив();
	Для Каждого КатегорияСтрока Из Объект.Категории Цикл
		МассивКатегорий.Добавить(КатегорияСтрока.Категория);
	КонецЦикла;
	СтруктураОписаниеКатегорий = Новый Структура("МассивКатегорий,ОсновнаяКатегория", МассивКатегорий, Объект.ОсновнаяКатегория);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДекорацияВыбратьГруппуНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыборКатегорий", Новый Структура("ОписаниеКатегорий", СтруктураОписаниеКатегорий), ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВыбратьГруппуНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	Модифицированность = Истина;
	Объект.Категории.Очистить();
	Для Каждого СтрокаКатегория Из Результат.СписокВыбранныеКатегории Цикл
		НоваяСтрока = Объект.Категории.Добавить();
		НоваяСтрока.Категория = СтрокаКатегория.Значение;
	КонецЦикла;
	Объект.ОсновнаяКатегория	= Результат.ОсновнаяКатегория;
	Объект.ИндексЦвета		    = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.ОсновнаяКатегория, "ЦветИндекс");
	Модифицированность			= Истина;
	ОтрисоватьКатегорииНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеВводаИгнорироватьОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеВводаИгнорироватьОбработчикОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеВводаИгнорироватьОбработчикОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

&НаКлиенте
Процедура УчастникиПриИзменении(Элемент)
	НайденныеСтроки = Участники.НайтиСтроки(Новый Структура("Участник", ТекущийПользователь));
	ТекущийПользовательУчастник = (НайденныеСтроки.Количество() > 0) ИЛИ (ТекущийПользователь = Объект.Ответственный);
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПриАктивизацииСтроки(Элемент)
	УстановитьПометкуУчастия();
	УстановитьДоступностьУчастия();
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПередУдалением(Элемент, Отказ)
	ТД = Элементы.Участники.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Если ТД.Участник = Объект.Ответственный Тогда
			Отказ	= Истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		Если ТД.Участник = Объект.КонтактноеЛицо Тогда
			Отказ	= Истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.Партнер) Тогда
		Если ТД.Участник = Объект.Партнер Тогда
			Отказ	= Истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
		Если ТД.Участник = Объект.ПотенциальныйКлиент Тогда
			Отказ	= Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиУчастникПриИзменении(Элемент)
	ТД = Элементы.Участники.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ПриИзмененииЛица(ТД);
КонецПроцедуры

&НаКлиенте
Процедура УчастникиАдресПриИзменении(Элемент)
	РезультатПроверки = CRM_ОбщегоНазначенияКлиентСервер.АнализАдресаЭП(СокрЛП(Элемент.ТекстРедактирования));
	Если НЕ (РезультатПроверки.КодОшибки = 0) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.Сообщение, , Элемент.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчастникиАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Участник) Тогда
		Возврат;
	КонецЕсли;
	ОповещениеЗавершения = Новый ОписаниеОповещения("ОбработкаВыбораАдреса", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущиеДанные));
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ОбъектКонтактнойИнформации", ТекущиеДанные.Участник); 
	СписокАдресов = CRM_ОбщегоНазначенияСервер.СформироватьСписокКонтактнойИнформации(СтруктураПоиска, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Если СписокАдресов.Количество() > 0 Тогда
		СписокАдресов.Удалить(0);
	КонецЕсли;	
	ПоказатьВыборИзСписка(ОповещениеЗавершения, СписокАдресов, Элемент);
КонецПроцедуры

#КонецОбласти

#Область РаботаСВложениями_Взаимодействие

&НаСервере
// Процедура заполняет надпись представление вложений.
//
// Параметры:
//	Нет.
//
Процедура СформироватьПредставлениеВложений()
	Вложения		= ПолучитьВложенияВзаимодействия();
	ВсегоВложений	= Вложения.Количество();
	Если ВсегоВложений = 0 Тогда
		ВложенияПредставление	= НСтр("ru='Файлы';en='Attachments'");
	Иначе	
		ВложенияПредставление	= НСтр("ru='Файлы';en='Attachments'") + " (" + Строка(ВсегоВложений) + ")";
	КонецЕсли;	
КонецПроцедуры // СформироватьПредставлениеВложений()

&НаСервере
Функция ПолучитьВложенияВзаимодействия()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ВзаимодействиеПрисоединенныеФайлы.Ссылка,
	|	CRM_ВзаимодействиеПрисоединенныеФайлы.Наименование КАК ИмяФайла,
	|	CRM_ВзаимодействиеПрисоединенныеФайлы.Размер
	|ИЗ
	|	Справочник.CRM_ВзаимодействиеПрисоединенныеФайлы КАК CRM_ВзаимодействиеПрисоединенныеФайлы
	|ГДЕ
	|	CRM_ВзаимодействиеПрисоединенныеФайлы.ВладелецФайла = &Взаимодействие
	|	И НЕ CRM_ВзаимодействиеПрисоединенныеФайлы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Взаимодействие", Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

&НаКлиенте
Процедура ВложенияПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Ссылка.Пустая() Тогда
		ТекстПредупреждения = Нстр("ru='Взаимодействие не записано. Добавление файлов невозможно!';en='Lead is not recorded. Adding files is impossible!'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;		
	ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);
	ПараметрыФормы.Вставить("ТолькоВложения",	Истина);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтотОбъект, Ложь, Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Позвонить(Команда)
	CRM_ВзаимодействияКлиент.CRM_Позвонить(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭлектронногоПисьма(СписокEmail)
	ПараметрыФормы = Новый Структура("Основание",	Объект.Ссылка);
	ПараметрыФормы.Вставить("ДанныеЗаполнения",		Объект.Ссылка);
	ПараметрыФормы.Вставить("Кому", 				СписокEmail);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСозданияПисьма(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуЭлектронногоПисьма(ДополнительныеПараметры.СписокEmail);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьEmailКлиент(Команда)
	ЕстьОшибки	= Ложь;
	СписокEmail	= Новый СписокЗначений;
	НомерСтроки	= 0;
	Для Каждого СтрокаУчастника Из Участники Цикл
		НомерСтроки	= НомерСтроки + 1;
		Если ПустаяСтрока(СтрокаУчастника.Адрес) Тогда
			Если НомерСтроки = 1 Тогда
				ЕстьОшибки	= Истина;
				ТекстСообщения = НСтр("ru='Не выбран адрес ответственного.';en='Is not specified the e-mail of responsible person.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			ИначеЕсли НомерСтроки = 2 Тогда
				ЕстьОшибки	= Истина;
				ТекстСообщения = НСтр("ru='Не выбран адрес клиента.';en='Is not specified the e-mail of client.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			Иначе
				ЕстьОшибки	= Истина;
				ТекстСообщения = НСтр("ru='Не выбран адрес участника ';en='Is not specified the e-mail of participant '") + "'" + СтрокаУчастника.Представление + "'";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;	
		Иначе
			СписокEmail.Добавить(СтрокаУчастника.Участник, СтрокаУчастника.Адрес);
		КонецЕсли;	
	КонецЦикла;
	Если ЕстьОшибки Тогда
		ОповещениеОтвета	= Новый ОписаниеОповещения("ОбработкаСозданияПисьма", ЭтотОбъект, Новый Структура("СписокEmail", СписокEmail));
		ТекстВопроса = НСтр("ru='Найдены незаполненные адреса участников. Продолжить?';en='Empty addresses of participants found. Continue?'");
		ПоказатьВопрос(ОповещениеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	Иначе
		ОткрытьФормуЭлектронногоПисьма(СписокEmail);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Контакт = ?(ЗначениеЗаполнено(Объект.ПотенциальныйКлиент),Объект.ПотенциальныйКлиент,Объект.КонтактноеЛицо);
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Контакт = ?(ЗначениеЗаполнено(Объект.КонтактноеЛицо),Объект.КонтактноеЛицо,Объект.Партнер);
	Иначе
		Контакт = Объект.ПотенциальныйКлиент;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Контакт) Тогда
		Возврат;
	КонецЕсли;
	СписокТелефонов = SMS4B_Взаимодействия.SMS4B_ТелефоныКонтакта(Контакт);
	Для Каждого ЭлементСписка Из СписокТелефонов Цикл
		КИ	= ЭлементСписка.Значение;
		Прервать;
	КонецЦикла;
	Если КИ = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан номер телефона';en='Missing phone number'"));
		Возврат;
	ИначеЕсли НЕ SMS4B_ОтправкаSMS.SMS4B_ИспользоватьSMS4B() Тогда
		CRM_ОбщегоНазначенияКлиент.ОткрытьФормуОшибкиПодключения("СМС");
		Возврат;
	ИначеЕсли НЕ SMS4B_ОтправкаSMS.НастройкаОтправкиSMSВыполнена() Тогда
		ОП = Новый ОписаниеОповещения("ОбработкаОповещенияОткрытияФормыНастроек", ЭтотОбъект);
		ПоказатьВопрос(ОП, "Отправка SMS невозможна так как не установлены параметры подключения.
						|Открыть форму настроек?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	Структура = Новый Структура();
	Структура.Вставить("Ссылка",	Контакт);
	Структура.Вставить("Телефон",	КИ);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Основание", Структура);
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ПараметрыФормы.Вставить("ДанныеЗаполнения", Объект.ДокументОснование);	
	Иначе
		ПараметрыФормы.Вставить("ДанныеЗаполнения", Объект.Ссылка);	
	КонецЕсли;
	ПараметрыФормы.Вставить("Взаимодействие", Объект.Ссылка);
	ОткрытьФорму("Документ.СообщениеSMS.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры // ОтправитьСМС()

&НаКлиенте
Процедура ПринятьОбращение(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	Если Модифицированность Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Взаимодействие", Объект.Ссылка);
	ДанныеВзаимодействия = Новый Структура;
	ДанныеВзаимодействия.Вставить("Тема", Объект.Тема);
	ДанныеВзаимодействия.Вставить("Партнер", Объект.Партнер);
	ДанныеВзаимодействия.Вставить("ПотенциальныйКлиент", Объект.ПотенциальныйКлиент);
	ДанныеВзаимодействия.Вставить("КонтактноеЛицо", Объект.КонтактноеЛицо);
	ДанныеВзаимодействия.Вставить("Организация", Объект.Организация);
	ДанныеВзаимодействия.Вставить("ВидВзаимодействия", Объект.ВидВзаимодействия);
	ПараметрыФормы.Вставить("ДанныеВзаимодействия", ДанныеВзаимодействия);
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;
	УдалитьВзаимодействиеИзКалендаря();
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМесто(Команда)
	ДополнительныеПараметры		= Новый Структура;
	ОписаниеПодбораМеста		= Новый ОписаниеОповещения("ОбработкаПодбораМеста", ЭтотОбъект, ДополнительныеПараметры); 
	ПараметрыСтруктура			= Новый Структура();
	ПараметрыСтруктура.Вставить("Место",							Объект.Помещение);
	ПараметрыСтруктура.Вставить("ПериодНачало",						ДатаНачала + (ВремяНачала - Дата("00010101")));
	ПараметрыСтруктура.Вставить("ПериодОкончание",					ДатаОкончанияПлан + (ВремяОкончанияПлан - Дата("00010101")));
	ПараметрыСтруктура.Вставить("ВыбиратьПериоды");
	ПараметрыСтруктура.Вставить("ЗакрыватьФормуПослеВыбораПериодов");
	ПараметрыСтруктура.Вставить("ПоказыватьПериодДокумента");
	ПараметрыСтруктура.Вставить("ИнтервалШкалыВремени",				30);
	ОткрытьФорму("ОбщаяФорма.CRM_ПодборПользователейПоКалендарю",	ПараметрыСтруктура, ЭтотОбъект, , , , ОписаниеПодбораМеста);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораМеста(РезультатОткрытия, ДополнительныеПараметры) Экспорт
	Если РезультатОткрытия = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(РезультатОткрытия) = Тип("Массив") Тогда
		МинимальнаяВыбраннаяДата = Неопределено;
		МаксимальнаяВыбраннаяДата = Неопределено;
		Для Каждого ДобавляемоеПомещение Из РезультатОткрытия Цикл
			Если НЕ ЗначениеЗаполнено(ДобавляемоеПомещение.Помещение) Тогда
				Продолжить;
			КонецЕсли;
			Если (МинимальнаяВыбраннаяДата = Неопределено) ИЛИ (МинимальнаяВыбраннаяДата > ДобавляемоеПомещение.НачалоПериода) Тогда
				МинимальнаяВыбраннаяДата = ДобавляемоеПомещение.НачалоПериода;
			КонецЕсли;
			Если (МаксимальнаяВыбраннаяДата = Неопределено) ИЛИ (МаксимальнаяВыбраннаяДата < ДобавляемоеПомещение.ОкончаниеПериода) Тогда
				МаксимальнаяВыбраннаяДата = ДобавляемоеПомещение.ОкончаниеПериода;
			КонецЕсли;
			Если ЗначениеЗаполнено(МинимальнаяВыбраннаяДата) И ЗначениеЗаполнено(МаксимальнаяВыбраннаяДата) Тогда
				Объект.Место		= СокрЛП(ДобавляемоеПомещение.Помещение);
				Объект.Помещение	= ДобавляемоеПомещение.Помещение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(МинимальнаяВыбраннаяДата) И ЗначениеЗаполнено(МаксимальнаяВыбраннаяДата) Тогда
			ДатаВремя		= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(МинимальнаяВыбраннаяДата);
			ДатаНачала		= ДатаВремя.Дата;
			ДатаНачалаПриИзменении(Неопределено);
			ВремяНачала		= ДатаВремя.Время;
			ВремяНачалаПриИзменении(Неопределено);
			ДатаВремя		= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(МаксимальнаяВыбраннаяДата);
			ДатаОкончанияПлан	= ДатаВремя.Дата;
			ДатаОкончанияПланПриИзменении(Неопределено);
			ВремяОкончанияПлан	= ДатаВремя.Время;
			ВремяОкончанияПланПриИзменении(Неопределено);
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // ОбработкаПодбораМеста()

&НаКлиенте
Процедура ДобавитьНовоеОповещение(Команда)
	ДобавитьОповещение();
	ПризнакИзмененыОповещения = Истина;
	CRM_ШаблоныОбъектовКлиент.ПоместитьКомандыГруппыТолькоВоВсеДействия(ЭтотОбъект);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУчастника(Команда)
	ПараметрыФормы = Новый Структура;
	ОповещениеЗавершения = Новый ОписаниеОповещения("ОбработкаВыбораУчастника", ЭтотОбъект);
	ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаВыбораКонтакта", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователя(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыборГруппПользователей", Ложь);
	СкрываемыеПользователи = Новый СписокЗначений;
	СкрываемыеПользователи.Добавить(Объект.Ответственный);
	ПараметрыФормы.Вставить("СкрываемыеПользователи", СкрываемыеПользователи);
	ОповещениеЗавершения	= Новый ОписаниеОповещения("ОбработкаВыбораУчастника", ЭтотОбъект);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ОповещениеЗавершения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФизЛицо(Команда)
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);	
	ОписаниеВыбораФизЛица	= Новый ОписаниеОповещения("ОбработкаВыбораУчастника", ЭтотОбъект);
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеВыбораФизЛица,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиСотрудниками(Команда)
	ОбработкаВыбора(Новый Структура, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПодразделению(Команда)
	ПодразделенияСУчетомИерархии = Истина;
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);		
	ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, ,);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект, ВыбранноеЗначение);
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда	
		Если Участники.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru='Очистить список участников?'");
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена,,,,);
		Иначе
			ОбработкаВыбораЗавершение(КодВозвратаДиалога.ОК, ВыбранноеЗначение)
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если Участники.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru='Очистить список участников?'");
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена,,,,);
		Иначе
			ОбработкаВыбораЗавершение(КодВозвратаДиалога.ОК, ВыбранноеЗначение)
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Ответ, ВыбранноеЗначение) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда	
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Участники.Очистить();
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;												
		КонецЕсли;
		ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда	
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Участники.Очистить();
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;												
		КонецЕсли;
		ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СтруктураПредприятия") Или ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда		
		мПользователи = ПолучитьПользователейПодразделения(ВыбранноеЗначение);
		Для Каждого Пользователь Из мПользователи Цикл
			Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
				СтрокаПолучатель					= Участники.Добавить();
				СтрокаПолучатель.Участник 			= Пользователь;
				СтрокаПолучатель.Представление		= СтрокаПолучатель.Участник.Наименование;
				СтрокаПолучатель.ПосетитМероприятие = 2;
				СтруктураПоиска = Новый Структура("ОбъектКонтактнойИнформации", СтрокаПолучатель.Участник); 
				СписокАдресов = CRM_ОбщегоНазначенияСервер.СформироватьСписокКонтактнойИнформации(СтруктураПоиска,
				ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
				Если СписокАдресов.Количество() > 0 Тогда
					ЕстьДляОповещений = Ложь;
					Для Каждого ЭлементСписка Из СписокАдресов Цикл
						Если ЭлементСписка.Пометка Тогда
							Адрес = ЭлементСписка.Значение;
							Если Адрес.Количество() = 0 Тогда
								СтрокаПолучатель.Адрес	= "";
							Иначе	
								СтрокаПолучатель.Адрес	= Адрес.Представление;
							КонецЕсли;
							ЕстьДляОповещений = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ ЕстьДляОповещений Тогда
						Адрес = СписокАдресов[0].Значение;
						Если Адрес.Количество() = 0 Тогда
							СтрокаПолучатель.Адрес		= "";
						Иначе	
							СтрокаПолучатель.Адрес		= Адрес.Представление;
						КонецЕсли;
					КонецЕсли;
				Иначе
					СтрокаПолучатель.Адрес				= "";
				КонецЕсли;
				ВыбранноеУчастие = "МожетБыть";
				ЭлементРодитель = Элементы.УчастникиПосещениеМероприятия;
				ПрефиксИмени = "Участники";
				Для Каждого ТекЭлемент Из ЭлементРодитель.ПодчиненныеЭлементы Цикл
					ТекЭлемент.Пометка = (ТекЭлемент.Имя = (ПрефиксИмени + ВыбранноеУчастие));
				КонецЦикла;	
			КонецЕсли;				
		КонецЦикла;			
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователейПодразделения(Подразделение)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СправочникПользователи.Ссылка КАК Ссылка,
	               |	СправочникПользователи.ПометкаУдаления КАК ПометкаУдаления,
	               |	СправочникПользователи.Предопределенный КАК Предопределенный,
	               |	СправочникПользователи.Наименование КАК Наименование,
	               |	СправочникПользователи.Подразделение КАК Подразделение
	               |ИЗ
	               |	Справочник.Пользователи КАК СправочникПользователи
	               |ГДЕ
	               |	НЕ СправочникПользователи.ПометкаУдаления
	               |	И СправочникПользователи.Подразделение В(&Подразделение)
	               |	И НЕ СправочникПользователи.Недействителен
	               |	И НЕ СправочникПользователи.Служебный";	 
	Если ТипЗнч(Подразделение) = Тип("Структура") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СправочникПользователи.Подразделение В(&Подразделение)", "");
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&Подразделение)", "В ИЕРАРХИИ(&Подразделение)");
	КонецЕсли;	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораУчастника(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора <> Неопределено Тогда
		НоваяСтрока					= Участники.Добавить();
		НоваяСтрока.Участник 		= РезультатВыбора;
		НоваяСтрока.Представление	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(НоваяСтрока.Участник, "Наименование");
		Если ТипЗнч(НоваяСтрока.Участник) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Владелец	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(НоваяСтрока.Участник, "Владелец");
			НоваяСтрока.Представление	= НоваяСтрока.Представление + " (" + CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Владелец, "Наименование") + ")";
		КонецЕсли;	
		ПриИзмененииЛица(НоваяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчастиеВМероприятии(Команда)
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли СтрНайти(Команда.Имя, "Да") Тогда
		ТекущиеДанные.ПосетитМероприятие = 1;
	ИначеЕсли СтрНайти(Команда.Имя, "МожетБыть") Тогда
		ТекущиеДанные.ПосетитМероприятие = 2;
	ИначеЕсли СтрНайти(Команда.Имя, "Нет") Тогда
		ТекущиеДанные.ПосетитМероприятие = 0;
	КонецЕсли;
	УстановитьПометкуУчастия();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьУчастников(Команда)
	МассивУчастников			= ПолучитьМассивУчастников();
	ДополнительныеПараметры		= Новый Структура("МассивУчастников", МассивУчастников);
	ОписаниеПодбораУчастников	= Новый ОписаниеОповещения("ОбработкаПодбораУчастников", ЭтотОбъект, ДополнительныеПараметры); 
	ПараметрыСтруктура			= Новый Структура();
	ПараметрыСтруктура.Вставить("Пользователи",						МассивУчастников);
	ПараметрыСтруктура.Вставить("ПериодНачало",						ДатаНачала + (ВремяНачала - Дата("00010101")));
	ПараметрыСтруктура.Вставить("ПериодОкончание",					ДатаОкончанияПлан + (ВремяОкончанияПлан - Дата("00010101")));
	ПараметрыСтруктура.Вставить("ВыбиратьПериоды");
	ПараметрыСтруктура.Вставить("ЗакрыватьФормуПослеВыбораПериодов");
	ПараметрыСтруктура.Вставить("ПоказыватьПериодДокумента");
	ПараметрыСтруктура.Вставить("ИнтервалШкалыВремени",				30);
	ОткрытьФорму("ОбщаяФорма.CRM_ПодборПользователейПоКалендарю",	ПараметрыСтруктура, ЭтотОбъект, , , , ОписаниеПодбораУчастников);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораУчастников(РезультатОткрытия, ДополнительныеПараметры) Экспорт
	Если Не ТипЗнч(РезультатОткрытия) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	МинимальнаяВыбраннаяДата	= Неопределено;
	МаксимальнаяВыбраннаяДата	= Неопределено;
	МассивВыбранныеПользователи	= Новый Массив();
	Для Каждого ДобавляемыйПользователь Из РезультатОткрытия Цикл
		МассивВыбранныеПользователи.Добавить(ДобавляемыйПользователь.Пользователь);
		Если Участники.НайтиСтроки(Новый Структура("Участник", ДобавляемыйПользователь.Пользователь)).Количество() = 0 Тогда
			НоваяСтрока = Участники.Добавить();
			НоваяСтрока.Участник		= ДобавляемыйПользователь.Пользователь;
			НоваяСтрока.Представление	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(НоваяСтрока.Участник, "Наименование");
			ПриИзмененииЛица(НоваяСтрока);
		КонецЕсли;
		Если МинимальнаяВыбраннаяДата = Неопределено Или МинимальнаяВыбраннаяДата > ДобавляемыйПользователь.НачалоПериода Тогда
			МинимальнаяВыбраннаяДата = ДобавляемыйПользователь.НачалоПериода;
		КонецЕсли;
		Если МаксимальнаяВыбраннаяДата = Неопределено Или МаксимальнаяВыбраннаяДата < ДобавляемыйПользователь.ОкончаниеПериода Тогда
			МаксимальнаяВыбраннаяДата = ДобавляемыйПользователь.ОкончаниеПериода;
		КонецЕсли;
	КонецЦикла;
	Для Каждого УдаляемыйПользователь Из ДополнительныеПараметры.МассивУчастников Цикл
		Если МассивВыбранныеПользователи.Найти(УдаляемыйПользователь) = Неопределено Тогда
			НайденныеСтроки = Участники.НайтиСтроки(Новый Структура("Участник", УдаляемыйПользователь));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Участники.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(МинимальнаяВыбраннаяДата) И ЗначениеЗаполнено(МаксимальнаяВыбраннаяДата) Тогда
		ДатаВремя		= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(МинимальнаяВыбраннаяДата);
		ДатаНачало		= ДатаВремя.Дата;
		ВремяНачало		= ДатаВремя.Время;
		ДатаВремя		= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(МаксимальнаяВыбраннаяДата);
		ДатаОкончание	= ДатаВремя.Дата;
		ВремяОкончание	= ДатаВремя.Время;
		ДатаНачалаПриИзменении(Неопределено);
		ВремяНачалаПриИзменении(Неопределено);
		ДатаОкончанияПланПриИзменении(Неопределено);
		ВремяОкончанияПланПриИзменении(Неопределено);
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

#Область ПривязкаДокументовКИнтересамКлиентов

&НаКлиенте
Процедура Подключаемый_СкрытьПоказатьИнтересы(Команда)
	Элементы.СкрытьПоказатьИнтересы.Пометка = НЕ Элементы.СкрытьПоказатьИнтересы.Пометка;
	Элементы.ГруппаCRM_ТаблицаИнтересов.Видимость = Элементы.СкрытьПоказатьИнтересы.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Основной(Команда)
	ТекущиеДанные = Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	CRM_ДобавитьИнтересНаСервере(ТекущиеДанные.Ссылка, Истина);
	ЭтотОбъект.CRM_ИнтересСтрокой	= "";
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры

#КонецОбласти

#Область СинхронизацияКалендарей

&НаКлиенте
Процедура ОткрытьВКалендаре(Команда)
	Если ЗначениеЗаполнено(ГиперссылкаВКалендаре) Тогда
		ПерейтиПоНавигационнойСсылке(ГиперссылкаВКалендаре);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьКорректностьДаты(ДатаПроверки, ТипДаты)
	Если ТипДаты = "ДатаНачала" Тогда
		Если ДатаПроверки < Объект.ДокументОснование.ДатаНачала Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Дата начала должна входить в планируемый период ('")+ПредставлениеПериода(Объект.ДокументОснование.ДатаНачала, КонецНедели(Объект.ДокументОснование.ДатаНачала))+")";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	Если ТипДаты = "ДатаОкончания" Тогда
		Если ДатаПроверки > КонецНедели(Объект.ДокументОснование.ДатаНачала) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Дата окончания должна входить в планируемый период ('")+ПредставлениеПериода(Объект.ДокументОснование.ДатаНачала, КонецНедели(Объект.ДокументОснование.ДатаНачала))+")";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	Возврат Истина;
КонецФункции	

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ДатаИВремя = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(Объект.ПлановаяДата);
	ДатаНачала = ДатаИВремя.Дата;
	ВремяНачала = ДатаИВремя.Время;
	ДатаИВремя = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(Объект.ПлановаяДатаЗавершение);
	ДатаОкончанияПлан = ДатаИВремя.Дата;
	ВремяОкончанияПлан = ДатаИВремя.Время;
	ТекущийПользователь	= Пользователи.ТекущийПользователь();
	МассивРуководителей	= CRM_УправлениеДоступомПовтИсп.ПолучитьРуководителейПользователя(Объект.Ответственный);
	ЭтоПолноправныйПользователь = (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("CRM_ПросмотрЗадачДругихПользователейВКалендаре") 
		ИЛИ (Объект.Автор = ТекущийПользователь) ИЛИ (Объект.Ответственный = ТекущийПользователь)
		ИЛИ НЕ (МассивРуководителей.Найти(ТекущийПользователь) = Неопределено));
	НайденныеСтроки = Объект.СвоиЛица.НайтиСтроки(Новый Структура("Лицо", ТекущийПользователь));
	ТекущийПользовательУчастник = (НайденныеСтроки.Количество() > 0) ИЛИ (ТекущийПользователь = Объект.Ответственный);
	// Проверку доступности синхронизации производим по ответственному.
	ВключенаСинхронизацияКалендаря	= ВключенаСинхронизацияКалендаря(Объект.Ответственный);
	ЦветФонаКалендаря				= ПолучитьЦветКалендаря(Объект.Ответственный, Объект.ИндексЦвета);
	ИспользоватьКатегорииВзаимодействий	= Константы.CRM_ИспользоватьКатегорииВзаимодействий.Получить();
	Элементы.ГруппаКатегории.Видимость	= (ИспользоватьКатегорииВзаимодействий = Истина);
	ВключеныТеги						= ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТеги") И (Константы.CRM_ИспользоватьТегиДляВзаимодействий.Получить() = Истина);
	Элементы.ОблакоТегов.Видимость		= ВключеныТеги;
	Если ВключеныТеги Тогда
		ОбновитьОблакоТегов();
	КонецЕсли;
	Календарь = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("КалендарьДляСинхронизации");
	Если ЗначениеЗаполнено(Календарь) Тогда
		СервисКалендарей = Календарь.СервисКалендарей;
	Иначе
		СервисКалендарей = Неопределено;
	КонецЕсли;
	ДанныеЗаписиКалендаря = РегистрыСведений.CRM_СобытияКалендаря.ИдентификаторыПоСобытиюКалендаря(Объект.Ссылка, ТекущийПользователь);
	ГиперссылкаВКалендаре = ДанныеЗаписиКалендаря.Гиперссылка;
	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Строка(Объект.Автор), , ЦветаСтиля.CRM_ОсновнойГолубой, , "Автор"));
	КомпонентыФС.Добавить(" " + Формат(Объект.Дата, "ДФ=d.MM.yyyy")+" " + НСтр("ru='в';en='in'") + " " + Формат(Объект.Дата, "ДФ=HH.mm"));
	Элементы.ДекорацияАвторДата.Заголовок = Новый ФорматированнаяСтрока(КомпонентыФС, , );
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		СтарыйКлиент	= Объект.КонтактноеЛицо;
	ИначеЕсли ЗначениеЗаполнено(Объект.Партнер) Тогда
		СтарыйКлиент	= Объект.Партнер;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
		СтарыйКлиент	= Объект.ПотенциальныйКлиент;
	КонецЕсли;
	НастроитьВидимостьИДоступностьФормы();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИДоступностьФормы()
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес")) Тогда
		Элементы.ОбъектВзаимодействия.Заголовок			= НСтр("ru='Основание'");
		Элементы.ОбъектВзаимодействия.ТолькоПросмотр	= ЗначениеЗаполнено(Объект.ДокументОснование);
	Иначе
		Элементы.ОбъектВзаимодействия.Заголовок			= НСтр("ru='Интерес'");
		Элементы.ОбъектВзаимодействия.ТолькоПросмотр	= Ложь;
	КонецЕсли;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ТекущийПользователь.Подразделение);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Тег.ПараметрыВыбора = НовыеПараметры;
	Элементы.ВремяОкончанияПлан.Видимость = (НЕ Объект.НаВесьДень);
	Элементы.ВремяНачала.Видимость    = (НЕ Объект.НаВесьДень);                                 
	Элементы.ВремяОкончанияПлан.Видимость = (НЕ Объект.НаВесьДень);
	// видимость расписания
	Элементы.РядСобытийНаименование.Видимость = Объект.Периодическое И Не Объект.ИзмененоВРяде;
	Если Элементы.РядСобытийНаименование.Видимость Тогда
		Элементы.Периодическое.Доступность = (Не Объект.ИзмененоВРяде);
		Элементы.РядСобытийНаименование.Доступность = (Объект.Периодическое И ЗначениеЗаполнено(Объект.РядСобытий) И Не Объект.ИзмененоВРяде);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) И НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		Элементы.ГруппаКлиентКонтакт.Видимость			= Ложь;
		Элементы.ГруппаПотенциальныйКлиент.Видимость	= Истина;
	Иначе
		Элементы.ГруппаПотенциальныйКлиент.Видимость	= Ложь;
		Элементы.ГруппаКлиентКонтакт.Видимость			= Истина;
	КонецЕсли;	
	Элементы.ОблакоТегов.Видимость			= ВключеныТеги;
	Элементы.ГруппаДатаЗавершения.Видимость	= НЕ (Объект.ДатаЗавершенияВзаимодействия = Дата('00010101'));
	Элементы.ИндексЦвета.Видимость			= НЕ ВключенаСинхронизацияКалендаря;
	Элементы.ИндексЦвета.Доступность		= ЭтоПолноправныйПользователь;
	Элементы.ЦветФонаКалендаря.Видимость	= ВключенаСинхронизацияКалендаря;
	Элементы.ЦветФонаКалендаря.ЦветТекста	= ЦветФонаКалендаря;
	Элементы.УстановитьНовогоОтветственного.Доступность	= ЭтоПолноправныйПользователь;
	Элементы.ВложенияПредставление.Доступность			= ЭтоПолноправныйПользователь;
	Если НЕ (Элементы.Найти("ЗапуститьПроизвольныйБизнесПроцесс") = Неопределено) Тогда
		Элементы.ЗапуститьПроизвольныйБизнесПроцесс.Доступность	= ЭтоПолноправныйПользователь;
	КонецЕсли;	
	Элементы.ДекорацияВыбратьГруппу.Доступность				= ЭтоПолноправныйПользователь;
	Если Объект.ВидВзаимодействия.ВидСобытия = Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда
		Элементы.ГруппаМесто.Видимость							= Истина;
		Элементы.ГруппаУчастники.Видимость						= Истина;
		Элементы.УчастникиОтправитьEmail.Видимость				= Истина;
		Элементы.УчастникиОткрытьВКалендаре.Видимость 			= ЗначениеЗаполнено(ГиперссылкаВКалендаре);
		Элементы.РассылатьУведомлениПриИзменении.Видимость		= Ложь;
		Элементы.РассылатьУведомлениПриИзменении.Доступность	= Ложь;
		Элементы.ДекорацияУчастникиМогут.Видимость				= Ложь;
		Элементы.ГруппаПраваГостей.Видимость					= Ложь;
		Элементы.ГостиМогутИзменятьМероприятие.Доступность		= Ложь;
		Элементы.ГостиМогутПриглашатьДругихГостей.Доступность	= Ложь;
		Элементы.ГостиМогутВидетьСписокГостей.Доступность		= Ложь;
		Элементы.УчастникиГруппаДобавить.Видимость				= Ложь;
		Элементы.УчастникиМенюДобавить.Видимость				= Ложь;
		Элементы.УчастникиПодобрать.Видимость					= Ложь;
		Элементы.УчастникиМенюПодобрать.Видимость				= Ложь;
		Элементы.ПодобратьМесто.Доступность						= Ложь;
		Если ЭтоПолноправныйПользователь Тогда	
			Элементы.РассылатьУведомлениПриИзменении.Видимость		= ВключенаСинхронизацияКалендаря;
			Элементы.РассылатьУведомлениПриИзменении.Доступность	= ВключенаСинхронизацияКалендаря;
			Элементы.ДекорацияУчастникиМогут.Видимость				= ВключенаСинхронизацияКалендаря;
			Элементы.ГруппаПраваГостей.Видимость					= ВключенаСинхронизацияКалендаря;
			Элементы.ГостиМогутИзменятьМероприятие.Доступность		= ВключенаСинхронизацияКалендаря;
			Элементы.ГостиМогутПриглашатьДругихГостей.Доступность	= ВключенаСинхронизацияКалендаря;
			Элементы.ГостиМогутВидетьСписокГостей.Доступность		= ВключенаСинхронизацияКалендаря;
			Элементы.УчастникиГруппаДобавить.Видимость			= Истина;
			Элементы.УчастникиМенюДобавить.Видимость			= Истина;
			Элементы.УчастникиПодобрать.Видимость				= Истина;
			Элементы.УчастникиМенюПодобрать.Видимость			= Истина;
			Элементы.ПодобратьМесто.Доступность					= Истина;
		ИначеЕсли ВключенаСинхронизацияКалендаря Тогда
			Элементы.РассылатьУведомлениПриИзменении.Видимость	= Истина;
			Элементы.ДекорацияУчастникиМогут.Видимость			= Истина;
			Элементы.ГруппаПраваГостей.Видимость				= Истина;
			Если Объект.ГостиМогутИзменятьМероприятие Тогда
				Элементы.УчастникиГруппаДобавить.Видимость		= Истина;
				Элементы.УчастникиМенюДобавить.Видимость		= Истина;
				Элементы.УчастникиПодобрать.Видимость			= Истина;
				Элементы.УчастникиМенюПодобрать.Видимость		= Истина;
			ИначеЕсли Объект.ГостиМогутПриглашатьДругихГостей Тогда
				Элементы.УчастникиГруппаДобавить.Видимость		= Истина;
				Элементы.УчастникиМенюДобавить.Видимость		= Истина;
				Элементы.УчастникиПодобрать.Видимость			= Истина;
				Элементы.УчастникиМенюПодобрать.Видимость		= Истина;
				Элементы.ГруппаФормаЛевая.ТолькоПросмотр		= Истина;
				Элементы.ГруппаЧекЛист.ТолькоПросмотр			= Истина;
			ИначеЕсли Объект.ГостиМогутВидетьСписокГостей Тогда
				Элементы.ГруппаШапка.ТолькоПросмотр				= Истина;
				Элементы.ГруппаФорма.ТолькоПросмотр				= Истина;
			Иначе	
				Элементы.ГруппаУчастники.Видимость				= Ложь;
				Элементы.ГруппаШапка.ТолькоПросмотр				= Истина;
				Элементы.ГруппаФорма.ТолькоПросмотр				= Истина;
			КонецЕсли;
		Иначе
			Элементы.РассылатьУведомлениПриИзменении.Видимость	= Ложь;
			Элементы.ДекорацияУчастникиМогут.Видимость			= Ложь;
			Элементы.ГруппаПраваГостей.Видимость				= Ложь;
			Элементы.ГруппаШапка.ТолькоПросмотр					= Истина;
			Элементы.ГруппаФорма.ТолькоПросмотр					= Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаМесто.Видимость			= Ложь;
		Элементы.ГруппаУчастники.Видимость		= Ложь;
		Если НЕ ЭтоПолноправныйПользователь Тогда
			ТолькоПросмотр						= Истина;
			Элементы.ГруппаШапка.ТолькоПросмотр	= Истина;
			Элементы.ГруппаФорма.ТолькоПросмотр	= Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры // НастроитьВидимостьИДоступностьФормы()

&НаСервере
Процедура ВидВзаимодействияПриИзмененииНаСервере()
	Объект.Баллы = Объект.ВидВзаимодействия.Баллы;
	Объект.СостояниеИнтереса = Объект.ВидВзаимодействия.СостояниеИнтереса;
	Если НЕ ЗначениеЗаполнено(Объект.Тема) Тогда
		Объект.Тема = Объект.ВидВзаимодействия.Описание;
	КонецЕсли;	
	ЗаполнитьЧекЛистНаСервере();
	НастроитьВидимостьИДоступностьФормы();
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЧекЛистНаСервере()
	Если ЗначениеЗаполнено(Объект.ВидВзаимодействия.ШаблонЧекЛиста) Тогда
		ШаблонЧекЛиста = Объект.ВидВзаимодействия.ШаблонЧекЛиста;
		Объект.ЧекЛист.Очистить();
		Для Каждого Строка Из ШаблонЧекЛиста.ЧекЛист Цикл
			Стр = Объект.ЧекЛист.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Строка);
			Стр.ЗаполненоИзШаблона = Истина;
		КонецЦикла;	
	КонецЕсли;
	Элементы.ГруппаЧекЛист.Видимость = (Объект.ЧекЛист.Количество() > 0);
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.Партнер, "ГруппаКИКлиента", СписокТиповКИ.ВыгрузитьЗначения());
	Объект.КонтактноеЛицо = Объект.Партнер.CRM_ОсновноеКонтактноеЛицо;
	КонтактноеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтветственногоВУчастники()
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Если Участники.Количество() > 0 Тогда
			НоваяСтрока	= Участники[0];
		Иначе
			НоваяСтрока	= Участники.Добавить();
		КонецЕсли;	
		НоваяСтрока.ПосетитМероприятие	= 1;
		НоваяСтрока.Участник			= Объект.Ответственный;
		НоваяСтрока.Представление		= НоваяСтрока.Участник.Наименование + " (ответственный)";
		КонтактнаяИнформация = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Объект.Ответственный, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
		Иначе	
			НоваяСтрока.Адрес	= "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ДобавитьКлиентаВУчастники()
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		МассивСтрок	= Участники.НайтиСтроки(Новый Структура("Участник", Объект.КонтактноеЛицо));
		Если МассивСтрок.Количество() > 0 Тогда
			Участники.Удалить(МассивСтрок[0]);
		КонецЕсли;	
		Если Участники.Количество() > 1 Тогда
			НоваяСтрока	= Участники[1];
			Если НЕ (НоваяСтрока.Участник = СтарыйКлиент) Тогда
				НоваяСтрока	= Участники.Вставить(1);
			КонецЕсли;	
		Иначе
			НоваяСтрока	= Участники.Добавить();
		КонецЕсли;	
		НоваяСтрока.ПосетитМероприятие	= 1;
		НоваяСтрока.Участник		= Объект.КонтактноеЛицо;
		УстановитьПривилегированныйРежим(Истина);
		НоваяСтрока.Представление	= НоваяСтрока.Участник.Наименование + " (" + НоваяСтрока.Участник.Владелец.Наименование + ")";
		УстановитьПривилегированныйРежим(Ложь);
		КонтактнаяИнформация = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Объект.КонтактноеЛицо, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
		Иначе	
			НоваяСтрока.Адрес	= "";
		КонецЕсли;
		СтарыйКлиент	= НоваяСтрока.Участник;
	ИначеЕсли ЗначениеЗаполнено(Объект.Партнер) Тогда
		МассивСтрок	= Участники.НайтиСтроки(Новый Структура("Участник", Объект.Партнер));
		Если МассивСтрок.Количество() > 0 Тогда
			Участники.Удалить(МассивСтрок[0]);
		КонецЕсли;	
		Если Участники.Количество() > 1 Тогда
			НоваяСтрока	= Участники[1];
			Если НЕ (НоваяСтрока.Участник = СтарыйКлиент) Тогда
				НоваяСтрока	= Участники.Вставить(1);
			КонецЕсли;	
		Иначе
			НоваяСтрока	= Участники.Добавить();
		КонецЕсли;	
		НоваяСтрока.ПосетитМероприятие	= 1;
		НоваяСтрока.Участник		= Объект.Партнер;
		УстановитьПривилегированныйРежим(Истина);
		НоваяСтрока.Представление	= НоваяСтрока.Участник.Наименование;
		УстановитьПривилегированныйРежим(Ложь);
		КонтактнаяИнформация = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Объект.Партнер, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
		Иначе	
			НоваяСтрока.Адрес	= "";
		КонецЕсли;
		СтарыйКлиент	= НоваяСтрока.Участник;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) Тогда
		Если Участники.Количество() > 1 Тогда
			НоваяСтрока	= Участники[1];
			Если НЕ (НоваяСтрока.Участник = СтарыйКлиент) Тогда
				НоваяСтрока	= Участники.Вставить(1);
			КонецЕсли;	
		Иначе
			НоваяСтрока	= Участники.Добавить();
		КонецЕсли;	
		НоваяСтрока.ПосетитМероприятие	= 1;
		НоваяСтрока.Участник			= Объект.ПотенциальныйКлиент;
		УстановитьПривилегированныйРежим(Истина);
		НоваяСтрока.Представление		= НоваяСтрока.Участник.Наименование;
		Если НЕ ПустаяСтрока(НоваяСтрока.Участник.Организация) Тогда
			НоваяСтрока.Представление		= НоваяСтрока.Представление + " (" + НоваяСтрока.Участник.Организация + ")";
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		КонтактнаяИнформация = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Объект.ПотенциальныйКлиент, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
		Иначе	
			НоваяСтрока.Адрес	= "";
		КонецЕсли;
		СтарыйКлиент	= НоваяСтрока.Участник;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьУчастников()
	Участники.Очистить();
	ДобавитьОтветственногоВУчастники();
	ДобавитьКлиентаВУчастники();
	Для Каждого СтрокаУчастника Из Объект.СвоиЛица Цикл
		Если ЗначениеЗаполнено(Объект.Ответственный) И (СтрокаУчастника.Лицо = Объект.Ответственный) Тогда
			Продолжить;
		КонецЕсли;	
		МассивСтрок	= Участники.НайтиСтроки(Новый Структура("Участник", СтрокаУчастника.Лицо));
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока						= Участники.Добавить();
			НоваяСтрока.Участник			= СтрокаУчастника.Лицо;
			НоваяСтрока.Представление		= НоваяСтрока.Участник.Наименование;
			НоваяСтрока.Адрес				= СтрокаУчастника.Адрес;
			НоваяСтрока.ПосетитМероприятие	= СтрокаУчастника.ПосетитМероприятие;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого СтрокаУчастника Из Объект.СторонниеЛица Цикл
		Если ЗначениеЗаполнено(СтрокаУчастника.КонтактноеЛицо) Тогда
			Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) И (СтрокаУчастника.КонтактноеЛицо = Объект.КонтактноеЛицо) Тогда
				Продолжить;
			КонецЕсли;	
			МассивСтрок	= Участники.НайтиСтроки(Новый Структура("Участник", СтрокаУчастника.КонтактноеЛицо));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока						= Участники.Добавить();
				НоваяСтрока.Участник			= СтрокаУчастника.КонтактноеЛицо;
				НоваяСтрока.Представление		= НоваяСтрока.Участник.Наименование + " (" + НоваяСтрока.Участник.Владелец.Наименование + ")";
				НоваяСтрока.Адрес				= СтрокаУчастника.Адрес;
				НоваяСтрока.ПосетитМероприятие	= СтрокаУчастника.ПосетитМероприятие;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУчастника.Партнер) Тогда
			Если ЗначениеЗаполнено(Объект.Партнер) И (СтрокаУчастника.Партнер = Объект.Партнер) Тогда
				Продолжить;
			КонецЕсли;	
			МассивСтрок	= Участники.НайтиСтроки(Новый Структура("Участник", СтрокаУчастника.Партнер));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока						= Участники.Добавить();
				НоваяСтрока.Участник			= СтрокаУчастника.Партнер;
				НоваяСтрока.Представление		= НоваяСтрока.Участник.Наименование;
				НоваяСтрока.Адрес				= СтрокаУчастника.Адрес;
				НоваяСтрока.ПосетитМероприятие	= СтрокаУчастника.ПосетитМероприятие;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУчастника.ПотенциальныйКлиент) Тогда
			Если ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) И (СтрокаУчастника.ПотенциальныйКлиент = Объект.ПотенциальныйКлиент) Тогда
				Продолжить;
			КонецЕсли;	
			МассивСтрок	= Участники.НайтиСтроки(Новый Структура("Участник", СтрокаУчастника.Партнер));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока						= Участники.Добавить();
				НоваяСтрока.Участник			= СтрокаУчастника.ПотенциальныйКлиент;
				НоваяСтрока.Представление		= НоваяСтрока.Участник.Наименование;
				НоваяСтрока.Адрес				= СтрокаУчастника.Адрес;
				НоваяСтрока.ПосетитМероприятие	= СтрокаУчастника.ПосетитМероприятие;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура СохранитьУчастников()
	Объект.СвоиЛица.Очистить();
	Объект.СторонниеЛица.Очистить();
	Для Каждого СтрокаУчастника Из Участники Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаУчастника.Участник) Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(СтрокаУчастника.Участник) = Тип("СправочникСсылка.Пользователи") Тогда
			МассивСтрок	= Объект.СвоиЛица.НайтиСтроки(Новый Структура("Лицо", СтрокаУчастника.Участник));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока			= Объект.СвоиЛица.Добавить();
				НоваяСтрока.Лицо	= СтрокаУчастника.Участник;
			Иначе
				НоваяСтрока	= МассивСтрок[0];
			КонецЕсли;	
		ИначеЕсли ТипЗнч(СтрокаУчастника.Участник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			МассивСтрок	= Объект.СвоиЛица.НайтиСтроки(Новый Структура("Лицо", СтрокаУчастника.Участник));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока			= Объект.СвоиЛица.Добавить();
				НоваяСтрока.Лицо	= СтрокаУчастника.Участник;
			Иначе
				НоваяСтрока	= МассивСтрок[0];
			КонецЕсли;	
		ИначеЕсли ТипЗнч(СтрокаУчастника.Участник) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			МассивСтрок	= Объект.СторонниеЛица.НайтиСтроки(Новый Структура("КонтактноеЛицо", СтрокаУчастника.Участник));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока					= Объект.СторонниеЛица.Добавить();
				НоваяСтрока.КонтактноеЛицо	= СтрокаУчастника.Участник;
				УстановитьПривилегированныйРежим(Истина);
				НоваяСтрока.Партнер			= СтрокаУчастника.Участник.Владелец;
				УстановитьПривилегированныйРежим(Ложь);
			Иначе
				НоваяСтрока	= МассивСтрок[0];
			КонецЕсли;	
		ИначеЕсли ТипЗнч(СтрокаУчастника.Участник) = Тип("СправочникСсылка.Партнеры") Тогда
			МассивСтрок	= Объект.СторонниеЛица.НайтиСтроки(Новый Структура("Партнер", СтрокаУчастника.Участник));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока			= Объект.СторонниеЛица.Добавить();
				НоваяСтрока.Партнер	= СтрокаУчастника.Участник;
			Иначе
				НоваяСтрока	= МассивСтрок[0];
			КонецЕсли;	
		ИначеЕсли ТипЗнч(СтрокаУчастника.Участник) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
			МассивСтрок	= Объект.СторонниеЛица.НайтиСтроки(Новый Структура("ПотенциальныйКлиент", СтрокаУчастника.Участник));
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока						= Объект.СторонниеЛица.Добавить();
				НоваяСтрока.ПотенциальныйКлиент	= СтрокаУчастника.Участник;
			Иначе
				НоваяСтрока	= МассивСтрок[0];
			КонецЕсли;	
		Иначе
			Продолжить;
		КонецЕсли;
		НоваяСтрока.Адрес				= СтрокаУчастника.Адрес;
		НоваяСтрока.ПосетитМероприятие	= СтрокаУчастника.ПосетитМероприятие;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура КонтактноеЛицоПриИзмененииНаСервере()
	CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.КонтактноеЛицо, "ГруппаКИКонтакта", СписокТиповКИ.ВыгрузитьЗначения());
	ДобавитьКлиентаВУчастники();
КонецПроцедуры

&НаСервере
Процедура ПотенциальныйКлиентПриИзмененииНаСервере()
	CRM_УправлениеКонтактнойИнформацией.ВывестиКонтактнуюИнформациюОбъекта(ЭтотОбъект, Объект.ПотенциальныйКлиент, "ГруппаКИПотенциальногоКлиента", СписокТиповКИ.ВыгрузитьЗначения());
	ДобавитьКлиентаВУчастники();
КонецПроцедуры

&НаСервере
Процедура РезультатПриИзмененииНаСервере()
	Объект.ДатаЗавершенияВзаимодействия = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	Объект.ЗавершившийПользователь = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЛица(ТекущаяСтрока)
	ТекущаяСтрока.ПосетитМероприятие = 2;
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Участник) Тогда
		ТекущаяСтрока.Адрес = "";
		Возврат;
	КонецЕсли;
	СтруктураПоиска = Новый Структура("ОбъектКонтактнойИнформации", ТекущаяСтрока.Участник); 
	СписокАдресов = CRM_ОбщегоНазначенияСервер.СформироватьСписокКонтактнойИнформации(СтруктураПоиска,
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Если СписокАдресов.Количество() > 0 Тогда
		ЕстьДляОповещений = Ложь;
		Для Каждого ЭлементСписка Из СписокАдресов Цикл
			Если ЭлементСписка.Пометка Тогда
				Адрес = ЭлементСписка.Значение;
				Если Адрес.Количество() = 0 Тогда
					ТекущаяСтрока.Адрес	= "";
				Иначе	
					ТекущаяСтрока.Адрес	= Адрес.Представление;
				КонецЕсли;
				ЕстьДляОповещений = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьДляОповещений Тогда
			Адрес = СписокАдресов[0].Значение;
			Если Адрес.Количество() = 0 Тогда
				ТекущаяСтрока.Адрес		= "";
			Иначе	
				ТекущаяСтрока.Адрес		= Адрес.Представление;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущаяСтрока.Адрес				= "";
	КонецЕсли;
	УстановитьПометкуУчастия();
КонецПроцедуры // ПриИзмененииЛица()

&НаКлиенте
Процедура УстановитьПометкуУчастия()
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущиеДанные.ПосетитМероприятие = 0 Тогда
		ВыбранноеУчастие = "Нет";
	ИначеЕсли ТекущиеДанные.ПосетитМероприятие = 1 Тогда
		ВыбранноеУчастие = "Да";
	Иначе
		ВыбранноеУчастие = "МожетБыть";
	КонецЕсли;
	ЭлементРодитель = Элементы.УчастникиПосещениеМероприятия;
	ПрефиксИмени = "Участники";
	Для Каждого ТекЭлемент Из ЭлементРодитель.ПодчиненныеЭлементы Цикл
		ТекЭлемент.Пометка = (ТекЭлемент.Имя = (ПрефиксИмени + ВыбранноеУчастие));
	КонецЦикла;	
	ЭлементРодитель = Элементы.УчастникиМенюПосещениеМероприятия;
	ПрефиксИмени = "УчастникиМеню";
	Для Каждого ТекЭлемент Из ЭлементРодитель.ПодчиненныеЭлементы Цикл
		ТекЭлемент.Пометка = (ТекЭлемент.Имя = (ПрефиксИмени + ВыбранноеУчастие));
	КонецЦикла;	
	ЭлементРодитель = Элементы.УчастникиГруппаПосещениеМероприятия;
	ПрефиксИмени = "УчастникиГруппа";
	Для Каждого ТекЭлемент Из ЭлементРодитель.ПодчиненныеЭлементы Цикл
		ТекЭлемент.Пометка = (ТекЭлемент.Имя = (ПрефиксИмени + ВыбранноеУчастие));
	КонецЦикла;	
КонецПроцедуры // УстановитьПометкуУчастия()

&НаКлиенте
Процедура УстановитьДоступностьУчастия()
	Элементы.УчастникиПосещениеМероприятия.Доступность		= Ложь;
	Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Ложь;
	Элементы.УчастникиМенюПосещениеМероприятия.Доступность	= Ложь;
	Элементы.УчастникиГруппаПосещениеМероприятия.Видимость	= Ложь;
	Элементы.УчастникиУдалить.Видимость						= Ложь;
	Элементы.УчастникиМенюУдалить.Видимость					= Ложь;
	Элементы.УчастникиПосетитМероприятие.Доступность		= Ложь;
	Элементы.УчастникиАдрес.Доступность						= Ложь;
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущиеДанные.Участник = Объект.Ответственный Тогда
		Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Элементы.УчастникиМенюДобавить.Видимость;
		Элементы.УчастникиАдрес.Доступность	= Истина;
	ИначеЕсли ЗначениеЗаполнено(Объект.КонтактноеЛицо) И (ТекущиеДанные.Участник = Объект.КонтактноеЛицо) Тогда
		Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Элементы.УчастникиМенюДобавить.Видимость;
		Элементы.УчастникиАдрес.Доступность	= Истина;
	ИначеЕсли ЗначениеЗаполнено(Объект.Партнер) И (ТекущиеДанные.Участник = Объект.Партнер) Тогда
		Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Элементы.УчастникиМенюДобавить.Видимость;
		Элементы.УчастникиАдрес.Доступность	= Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Партнер) И ЗначениеЗаполнено(Объект.ПотенциальныйКлиент) И (ТекущиеДанные.Участник = Объект.ПотенциальныйКлиент) Тогда
		Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Элементы.УчастникиМенюДобавить.Видимость;
		Элементы.УчастникиАдрес.Доступность	= Истина;
	ИначеЕсли ЭтоПолноправныйПользователь Тогда	
		Элементы.УчастникиПосещениеМероприятия.Доступность		= Истина;
		Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Истина;
		Элементы.УчастникиМенюПосещениеМероприятия.Доступность	= Истина;
		Элементы.УчастникиУдалить.Видимость						= Истина;
		Элементы.УчастникиМенюУдалить.Видимость					= Истина;
		Элементы.УчастникиПосетитМероприятие.Доступность		= Истина;
		Элементы.УчастникиАдрес.Доступность						= Истина;
	ИначеЕсли ТекущиеДанные.Участник = ТекущийПользователь Тогда
		Элементы.УчастникиПосещениеМероприятия.Доступность		= Истина;
		Если Элементы.УчастникиМенюДобавить.Видимость Тогда
			Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Истина;
			Элементы.УчастникиМенюПосещениеМероприятия.Доступность	= Истина;
		Иначе	
			Элементы.УчастникиГруппаПосещениеМероприятия.Видимость	= Истина;
		КонецЕсли;	
		Элементы.УчастникиПосетитМероприятие.Доступность		= Истина;
		Элементы.УчастникиАдрес.Доступность						= Истина;
	ИначеЕсли Элементы.УчастникиМенюДобавить.Видимость Тогда
		Элементы.УчастникиМенюПосещениеМероприятия.Видимость	= Истина;
		Элементы.УчастникиМенюПосещениеМероприятия.Доступность	= Ложь;
	КонецЕсли;
Конецпроцедуры	

&НаСервереБезКонтекста
Функция ВернутьПомещенияПоТексту(Текст)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Текст", СокрЛП(Текст) + "%");
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_Помещения.Ссылка
	               |ИЗ
	               |	Справочник.CRM_Помещения КАК CRM_Помещения
	               |ГДЕ
	               |	CRM_Помещения.Наименование ПОДОБНО &Текст
	               |	И (НЕ CRM_Помещения.ПометкаУдаления)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");                            
КонецФункции // ВернутьПомещенияПоТексту()

&НаСервере
Процедура УстановитьВремяНачалоВремяОкончание()
	ВремяНачалаРабочегоДня		= CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Объект.Ответственный,	"ВремяНачалаРабочегоДня");
	ВремяОкончанияРабочегоДня = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Объект.Ответственный,	"ВремяОкончанияРабочегоДня");
	Если НЕ ЗначениеЗаполнено(ВремяНачалаРабочегоДня) Тогда
		ВремяНачалаРабочегоДня = Константы.CRM_НачалоРабочегоДня.Получить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВремяОкончанияРабочегоДня) Тогда
		ВремяОкончанияРабочегоДня = Константы.CRM_КонецРабочегоДня.Получить();
	КонецЕсли;
	ВремяНачала		= ВремяНачалаРабочегоДня;
	ВремяОкончанияПлан = ВремяОкончанияРабочегоДня;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивУчастников()
	МассивУчастников = Новый Массив();
	Для Каждого СтрокаТаблицы Из Участники Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Участник) И ТипЗнч(СтрокаТаблицы.Участник) = Тип("СправочникСсылка.Пользователи") Тогда
			Если МассивУчастников.Найти(СтрокаТаблицы.Участник) = Неопределено Тогда
				МассивУчастников.Добавить(СтрокаТаблицы.Участник);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Возврат МассивУчастников;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораАдреса(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Адрес = РезультатВыбора.Значение;
	ДополнительныеПараметры.ТекущаяСтрока.Адрес = Адрес.Представление;
	Модифицированность = Истина;
КонецПроцедуры

#Область ПривязкаДокументовКИнтересамКлиентов

&НаСервере
Процедура CRM_ДобавитьИнтересНаСервере(ВыбранноеЗначение,ВНачало = Ложь)
	МассивСтрок = ЭтотОбъект.CRM_ТаблицаИнтересов.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
	Если МассивСтрок.Количество() = 0 Тогда
		Если ВНачало Тогда
			НоваяСтрока = ЭтотОбъект.CRM_ТаблицаИнтересов.Вставить(0);
		Иначе
			НоваяСтрока = ЭтотОбъект.CRM_ТаблицаИнтересов.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыбранноеЗначение);
	ИначеЕсли ВНачало Тогда
		ЭтотОбъект.CRM_ТаблицаИнтересов.Сдвинуть(ЭтотОбъект.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]),-ЭтотОбъект.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьЗаголовокФормы(Ссылка, Тема)
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат НСтр("ru='Взаимодействие (создание)'");
	Иначе
		СтрокаТемы	= СокрЛП(Тема);
		Если СтрДлина(СтрокаТемы) > 100 Тогда
			СтрокаТемы	= Лев(СтрокаТемы, 97) + "...";
		КонецЕсли;	
		Возврат НСтр("ru='Взаимодействие: '") + СтрокаТемы;
	КонецЕсли;	
КонецФункции	
	
#КонецОбласти

#Область Оповещения

&НаСервере
// Процедура удаляет оповещение.
//
// Параметры:
//	ИмяКоманды	- Строка	- Имя команды.
//
Процедура УдалитьОповещение(ИмяКоманды)
	ИдПолей = СтрЗаменить(ИмяКоманды, "УдалитьОповещение_","");
	Если НЕ Элементы.Найти("ПолеКанала_" + ИдПолей) = Неопределено Тогда
		Элементы.Удалить(Элементы["ПолеКанала_" + ИдПолей]);
	КонецЕсли;
	Если НЕ Элементы.Найти("ДекорацияПолеСрокаОповещения_" + ИдПолей) = Неопределено Тогда
		Элементы.Удалить(Элементы["ДекорацияПолеСрокаОповещения_" + ИдПолей]);
	КонецЕсли;
	Если НЕ Элементы.Найти("ПолеСрокаОповещения_" + ИдПолей) = Неопределено Тогда
		Элементы.Удалить(Элементы["ПолеСрокаОповещения_" + ИдПолей]);
	КонецЕсли;
	Если НЕ Элементы.Найти("ПолеПериодаОповещения_" + ИдПолей) = Неопределено Тогда
		Элементы.Удалить(Элементы["ПолеПериодаОповещения_" + ИдПолей]);
	КонецЕсли;
	Если НЕ Элементы.Найти("Кнопка_УдалитьОповещение_" + ИдПолей) = Неопределено Тогда
		Элементы.Удалить(Элементы["Кнопка_УдалитьОповещение_" + ИдПолей]);
	КонецЕсли;
	Если НЕ Элементы.Найти("ПолеДатыОповещения_" + ИдПолей) = Неопределено Тогда
		Элементы.Удалить(Элементы["ПолеДатыОповещения_" + ИдПолей]);
	КонецЕсли;
	МассивСтрок = _ТаблицаОповещений.НайтиСтроки(Новый Структура("ИмяПоля","ПолеКанала_" + ИдПолей));
	Если МассивСтрок.Количество() > 0 Тогда
		_ТаблицаОповещений.Удалить(_ТаблицаОповещений.Индекс(МассивСтрок[0]));
	КонецЕсли;
	Ид = 0;
	Для Каждого СтрокаТаб Из _ТаблицаОповещений Цикл
		Ид = Ид + 1;
		Если Ид>5 Тогда Продолжить; КонецЕсли;
		ЭлементФормы = Элементы.Найти(СтрокаТаб.ИмяПоля);
		ЭлементФормы.Заголовок = Строка(Ид);
	КонецЦикла;
	Элементы.ГруппаОповещений.Видимость			= (Ид > 0);
	Элементы.ДобавитьНовоеОповещение.Видимость	= (Ид < 5);
КонецПроцедуры // УдалитьОповещение()

&НаСервере
// Процедура добавляет оповещение.
//
// Параметры:
//	Нет.
//
Процедура ДобавитьОповещение()
	Ид = 0;
	Пока Ид < 5 Цикл
		Ид = Ид + 1;
		Если НЕ Элементы.Найти("ПолеКанала_"+Строка(Ид)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементГруппа = Элементы.Найти("ГруппаКанала_"+Строка(Ид));
		Если ЭлементГруппа = Неопределено Тогда
			ЭлементГруппа = Элементы.Вставить("ГруппаКанала_" + Строка(Ид), Тип("ГруппаФормы"), Элементы.ГруппаОповещений);
			ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ЭлементГруппа.ОтображатьЗаголовок = Ложь;
		КонецЕсли;
		НоваяСтрока = _ТаблицаОповещений.Добавить();
		НоваяСтрока.Канал			= Перечисления.CRM_КаналыОповещений.Напоминание;
		НоваяСтрока.СрокОповещения	= 10;
		НоваяСтрока.Периодичность	= Перечисления.CRM_ПериодичностьОповещений.Минута;
		НоваяСтрока.ИмяПоля			= "ПолеКанала_"+Строка(Ид);
		НоваяСтрока.ДатаОповещения	= "ПолеКанала_"+Строка(Ид);
		СтруктураОповещения = Новый Структура;
		СтруктураОповещения.Вставить("Предмет"			,Новый Структура("Дата", CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала)));
		СтруктураОповещения.Вставить("ВидОповещения"	,ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ЗапланированныеСобытия"));
		СтруктураОповещения.Вставить("СрокОповещения"	,НоваяСтрока.СрокОповещения);
		СтруктураОповещения.Вставить("Периодичность"	,НоваяСтрока.Периодичность);
		СтруктураОповещения.Вставить("ВпередПоКалендарю", Ложь);
		СтруктураОповещения.Вставить("Получатель"		,Пользователи.ТекущийПользователь());
		НоваяСтрока.ДатаОповещения	= CRM_ОповещенияСервер.ПолучитьДатуОповещения(СтруктураОповещения);
		Элемент = Элементы.Добавить("ПолеКанала_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					="_КаналОповещения"+Строка(Ид);
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.МаксимальнаяШирина		= 16;
		Элемент.Ширина						= 0; //17
		Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НачалоВыбора");
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		Если ИспользоватьНапоминания Тогда
			ЭтотОбъект["_КаналОповещения"+Строка(Ид)] = Перечисления.CRM_КаналыОповещений.Напоминание;
		ИначеЕсли ИспользоватьОповещенияЭлектроннаяПочта Тогда
			ЭтотОбъект["_КаналОповещения"+Строка(Ид)] = Перечисления.CRM_КаналыОповещений.ЭлектроннаяПочта;
		ИначеЕсли ИспользоватьОповещенияЭлектроннаяПочта Тогда
			ЭтотОбъект["_КаналОповещения"+Строка(Ид)] = Перечисления.CRM_КаналыОповещений.СМС;
		КонецЕсли;
 		Элемент = Элементы.Добавить("ДекорацияПолеСрокаОповещения_"+Строка(Ид),Тип("ДекорацияФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидДекорацииФормы.Надпись;
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.Заголовок = НСтр("ru='за';en='for'");
		Элемент = Элементы.Добавить("ПолеСрокаОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_СрокОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.КнопкаРегулирования			= Истина;
		Элемент.АвтоМаксимальнаяШирина		= Ложь;
		Элемент.МаксимальнаяШирина			= 6;
		Элемент.ГоризонтальноеПоложение		= ГоризонтальноеПоложениеЭлемента.Центр;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_СрокОповещения"+Строка(Ид)] = 10;
		Элемент = Элементы.Добавить("ПолеПериодаОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_ПериодОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.АвтоМаксимальнаяШирина		= Ложь;
		Элемент.МаксимальнаяШирина			= 5;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_ПериодОповещения"+Строка(Ид)] = Перечисления.CRM_ПериодичностьОповещений.Минута;
		Элемент = Элементы.Добавить("Кнопка_УдалитьОповещение_"+Строка(Ид),Тип("КнопкаФормы"), ЭлементГруппа);
		Элемент.ИмяКоманды					= "УдалитьОповещение_"+Строка(Ид);
		Элемент.Заголовок					= "Удалить";
		Элемент.Картинка					= БиблиотекаКартинок.CRM_УдалитьСерая;
		Элемент.ОтображениеФигуры			= ОтображениеФигурыКнопки.Нет;
		Элемент.Отображение					= ОтображениеКнопки.Картинка;
		Элемент = Элементы.Добавить("ПолеДатыОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеНадписи;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_ДатаОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.ТолькоПросмотр				= Истина;
		ЭтотОбъект["_ДатаОповещения"+Строка(Ид)] = НоваяСтрока.ДатаОповещения;
		Элемент.Ширина						= 12;
		Если ЭтотОбъект["_ДатаОповещения" + Строка(Ид)] < CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса() Тогда
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения меньше текущего времени';en='Schedulable date of the notification is less than the current time'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
			Элемент.ЦветТекста				= Новый Цвет(255, 0, 0);
		Иначе	
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения';en='Schedulable date of the notification'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Всплывающая;
			Элемент.ЦветТекста				= Новый Цвет(0, 0, 0);
		КонецЕсли;	
		Прервать;
	КонецЦикла;
	Ид = 0;
	Для Каждого СтрокаТаб Из _ТаблицаОповещений Цикл
		Ид = Ид + 1;
		ЭлементФормы = Элементы.Найти(СтрокаТаб.ИмяПоля);
		ЭлементФормы.Заголовок = Строка(Ид);
	КонецЦикла;
	Элементы.ГруппаОповещений.Видимость			= (Ид > 0);
	Элементы.ДобавитьНовоеОповещение.Видимость	= (Ид < 5);
	ПризнакИзмененыОповещения	= Ложь;
КонецПроцедуры // ДобавитьОповещение()

&НаСервере
// Процедура - обработчик события "ПриИзмененииОповещения".
//
// Параметры:
//	Ид	- Строка	- Идентификатор оповещения.
//
Процедура ПриИзмененииОповещения(Ид)
	МассивСтрок = _ТаблицаОповещений.НайтиСтроки(Новый Структура("ИмяПоля", "ПолеКанала_" + Ид));
	Если МассивСтрок.Количество() > 0 Тогда
		МассивСтрок[0].Канал			= ЭтотОбъект["_КаналОповещения" + Ид];
		МассивСтрок[0].СрокОповещения	= ЭтотОбъект["_СрокОповещения" + Ид];
		МассивСтрок[0].Периодичность	= ЭтотОбъект["_ПериодОповещения" + Ид];
		МассивСтрок[0].ДатаОповещения	= ЭтотОбъект["_ДатаОповещения" + Строка(Ид)];
	КонецЕсли;
КонецПроцедуры // ПриИзмененииОповещения()

&НаСервере
// Процедура заполняет настройки оповещений.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьГруппуОповещений()
	ИспользоватьНапоминания					= Константы.CRM_ИспользоватьНапоминания.Получить();
	ИспользоватьОповещенияСМС				= Константы.CRM_ИспользоватьОповещенияСМС.Получить();
	ИспользоватьОповещенияЭлектроннаяПочта	= Константы.CRM_ИспользоватьОповещенияЭлектроннаяПочта.Получить();
	Если НЕ ТекущийПользовательУчастник Тогда
		// Не нужно отрисовывать оповещения, если пользователь не имеет отношения к взаимодействию.
		Возврат;
	КонецЕсли;
	ЗаполнитьТаблицуОповещений(ТекущийПользователь);
	МассивДобавляемыхРеквизитов = Новый Массив();
	// Всего предполагается 5 полей оповещений, по аналогии с гуглом.
	Ид = 0;
	Пока НЕ Ид = 5 Цикл
		Ид = Ид + 1;
		ОписаниеТиповКанал = Новый ОписаниеТипов("ПеречислениеСсылка.CRM_КаналыОповещений");
		НовыйРеквизит = Новый РеквизитФормы("_КаналОповещения"+Строка(Ид), ОписаниеТиповКанал);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ОписаниеТиповСрок = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
		НовыйРеквизит = Новый РеквизитФормы("_СрокОповещения"+Строка(Ид), ОписаниеТиповСрок);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ОписаниеТиповПериод = Новый ОписаниеТипов("ПеречислениеСсылка.CRM_ПериодичностьОповещений");
		НовыйРеквизит = Новый РеквизитФормы("_ПериодОповещения"+Строка(Ид), ОписаниеТиповПериод);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ОписаниеТиповСрок = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		НовыйРеквизит = Новый РеквизитФормы("_ДатаОповещения"+Строка(Ид), ОписаниеТиповСрок);
		НовыйРеквизит.СохраняемыеДанные = Истина;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НоваяКомандаФормы = Команды.Добавить("УдалитьОповещение_"+Строка(Ид));
		НоваяКомандаФормы.Заголовок					= "Удалить";
		НоваяКомандаФормы.Подсказка					= "Удалить оповещение";
		НоваяКомандаФормы.Действие					= "Подключаемый_УдалитьОповещение";
		НоваяКомандаФормы.ИзменяетСохраняемыеДанные	= Истина;
	КонецЦикла;
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	Ид = 0;
	Для Каждого СтрокаТаб Из _ТаблицаОповещений Цикл
		Ид = Ид + 1;
		Если Ид > 5 Тогда Прервать; КонецЕсли; 
		ЭлементГруппа = Элементы.Добавить("ГруппаКанала_"+Строка(Ид),Тип("ГруппаФормы"),Элементы.ГруппаОповещений);
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ЭлементГруппа.ОтображатьЗаголовок = Ложь;
		СтрокаТаб.ИмяПоля = "ПолеКанала_"+Строка(Ид);
		Элемент = Элементы.Добавить("ПолеКанала_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					="_КаналОповещения"+Строка(Ид);
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.МаксимальнаяШирина		= 16;
		Элемент.Ширина					= 0;
		Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НачалоВыбора");
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_КаналОповещения"+Строка(Ид)] = СтрокаТаб.Канал;
 		Элемент = Элементы.Добавить("ДекорацияПолеСрокаОповещения_"+Строка(Ид),Тип("ДекорацияФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидДекорацииФормы.Надпись;
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.Заголовок = НСтр("ru='за';en='for'");
		Элемент = Элементы.Добавить("ПолеСрокаОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_СрокОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.КнопкаРегулирования			= Истина;
		Элемент.АвтоМаксимальнаяШирина		= Ложь;
		Элемент.МаксимальнаяШирина			= 6;
		Элемент.ГоризонтальноеПоложение		= ГоризонтальноеПоложениеЭлемента.Центр;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_СрокОповещения"+Строка(Ид)] = СтрокаТаб.СрокОповещения;
		Элемент = Элементы.Добавить("ПолеПериодаОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеВвода;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_ПериодОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.АвтоМаксимальнаяШирина		= Ложь;
		Элемент.МаксимальнаяШирина			= 5;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОповещениеПриИзменении");
		ЭтотОбъект["_ПериодОповещения"+Строка(Ид)] = СтрокаТаб.Периодичность;
		НовыйЭлемент = Элементы.Добавить("Кнопка_УдалитьОповещение_"+Строка(Ид),Тип("КнопкаФормы"), ЭлементГруппа);
		НовыйЭлемент.ИмяКоманды			= "УдалитьОповещение_"+Строка(Ид);
		НовыйЭлемент.Заголовок			= "Удалить";
		НовыйЭлемент.Картинка			= БиблиотекаКартинок.CRM_УдалитьСерая;
		НовыйЭлемент.ОтображениеФигуры	= ОтображениеФигурыКнопки.Нет;
		НовыйЭлемент.Отображение		= ОтображениеКнопки.Картинка;
		Элемент = Элементы.Добавить("ПолеДатыОповещения_"+Строка(Ид),Тип("ПолеФормы"),ЭлементГруппа);
		Элемент.Вид 						= ВидПоляФормы.ПолеНадписи;
		Элемент.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ПутьКДанным					= "_ДатаОповещения"+Строка(Ид);
		Элемент.РастягиватьПоГоризонтали	= Ложь;
		Элемент.ТолькоПросмотр				= Истина;
		ЭтотОбъект["_ДатаОповещения"+Строка(Ид)] = СтрокаТаб.ДатаОповещения;
		Элемент.Ширина						= 12;
		Если ЭтотОбъект["_ДатаОповещения" + Строка(Ид)] < CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса() Тогда
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения меньше текущего времени';en='Schedulable date of the notification is less than the current time'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
			Элемент.ЦветТекста				= Новый Цвет(255, 0, 0);
		Иначе	
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения';en='Schedulable date of the notification'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Всплывающая;
			Элемент.ЦветТекста				= Новый Цвет(0, 0, 0);
		КонецЕсли;	
	КонецЦикла;
	Элементы.ГруппаОповещений.Видимость			= (Ид > 0);
	Элементы.ДобавитьНовоеОповещение.Видимость	= (Ид < 5);
	ПересчитатьДатыОповещений();
КонецПроцедуры // ЗаполнитьГруппуОповещений()

&НаСервере
// Процедура заполняет таблицу оповещений.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьТаблицуОповещений(Пользователь)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИспользоватьНапоминания", ИспользоватьНапоминания);
	ДополнительныеПараметры.Вставить("ИспользоватьОповещенияСМС", ИспользоватьОповещенияСМС);
	ДополнительныеПараметры.Вставить("ИспользоватьОповещенияЭлектроннаяПочта", ИспользоватьОповещенияЭлектроннаяПочта);
	ДополнительныеПараметры.Вставить("ПлановаяДата", Объект.ПлановаяДата);
	ДополнительныеПараметры.Вставить("Ответственный", Объект.Ответственный);
	CRM_ОповещенияСервер.ЗаполнитьТаблицуОповещений(Объект.Ссылка, _ТаблицаОповещений, Пользователь, ПризнакИзмененыОповещения, ДополнительныеПараметры);
КонецПроцедуры // ЗаполнитьТаблицуОповещений()

&НаСервере
// Процедура пересчитывает даты оповещений.
//
// Параметры:
//	Нет.
//
Процедура ПересчитатьДатыОповещений()
	Для Каждого СтрокаТаб Из _ТаблицаОповещений Цикл
		Ид = СтрЗаменить(СтрокаТаб.ИмяПоля, "ПолеКанала_", "");
		ДатаОповещения = ДатаНачала;
		ВремяОповещения = ВремяНачала;
		СрокОповещения = СтрокаТаб.СрокОповещения;
		СтруктураОповещения = Новый Структура;
		СтруктураОповещения.Вставить("Предмет",			Новый Структура("Дата", CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОповещения, ВремяОповещения)));
		СтруктураОповещения.Вставить("ВидОповещения",	ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ЗапланированныеСобытия"));
		СтруктураОповещения.Вставить("СрокОповещения",	СрокОповещения);
		СтруктураОповещения.Вставить("Периодичность",	СтрокаТаб.Периодичность);
		СтруктураОповещения.Вставить("Получатель",		ПользователиКлиентСервер.ТекущийПользователь());
		СтруктураОповещения.Вставить("ВпередПоКалендарю"	,Ложь);
		СтрокаТаб.ДатаОповещения	= CRM_ОповещенияСервер.ПолучитьДатуОповещения(СтруктураОповещения);
		ЭтотОбъект["_ДатаОповещения"+Строка(Ид)] = СтрокаТаб.ДатаОповещения;
		Элемент	= Элементы["ПолеДатыОповещения_" + Строка(Ид)];
		Если СтрокаТаб.ДатаОповещения < CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса() Тогда
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения меньше текущего времени';en='Schedulable date of the notification is less than the current time'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;
			Элемент.ЦветТекста				= Новый Цвет(255, 0, 0);
		Иначе	
			Элемент.Подсказка				= НСтр("ru='Планируемая дата оповещения';en='Schedulable date of the notification'");
			Элемент.ОтображениеПодсказки	= ОтображениеПодсказки.Всплывающая;
			Элемент.ЦветТекста				= Новый Цвет(0, 0, 0);
		КонецЕсли;	
	КонецЦикла;
	ПризнакИзмененыОповещения = Истина;
КонецПроцедуры 

&НаСервере
// Процедура проверяет наличие новых участников.
//
// Параметры:
//	ТекущийОбъект	- ДокументОбъект	- Текущий документ.
//
Процедура ПроверитьНаличиеНовыхУчастников(ТекущийОбъект)
	НовыеУчастники.Очистить();
	Для Каждого СтрокаУчастника Из ТекущийОбъект.СвоиЛица Цикл
		Участник = СтрокаУчастника.Лицо;
		Если ТипЗнч(Участник) <> Тип("СправочникСсылка.Пользователи") Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = ТекущийОбъект.Ссылка.СвоиЛица.НайтиСтроки(Новый Структура("Лицо", Участник));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НовыеУчастники.Добавить(Участник);
		КонецЕсли;
	КонецЦикла;
	ЕстьНовыеУчастники = НовыеУчастники.Количество() > 0;
	УдаленныеУчастники.Очистить();
	Для Каждого СтрокаУчастника Из ТекущийОбъект.Ссылка.СвоиЛица Цикл
		Участник = СтрокаУчастника.Лицо;
		Если ТипЗнч(Участник) <> Тип("СправочникСсылка.Пользователи") Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = ТекущийОбъект.СвоиЛица.НайтиСтроки(Новый Структура("Лицо", Участник));
		Если НайденныеСтроки.Количество() = 0 Тогда
			УдаленныеУчастники.Добавить(Участник);
		КонецЕсли;
	КонецЦикла;
	ЕстьУдаленныеУчастники = УдаленныеУчастники.Количество() > 0;
	ИзмененСоставУчастников = ЕстьНовыеУчастники Или ЕстьУдаленныеУчастники;
КонецПроцедуры

#КонецОбласти

#Область Тэги

&НаСервере
// Процедура обновляет отображение тегов на форме.
//
Процедура ОбновитьОблакоТегов()
	CRM_Теги.ОбновитьОблакоТегов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область Категории

&НаСервере
Процедура ОтрисоватьКатегорииНаФорме()
	ПрефиксРеквизита = "ПолеВводаКатегория";
	МассивУдаляемыхРеквизитов = Новый Массив();
	нИндекс = 1;
	Пока Истина Цикл
		ИмяРеквизита = ПрефиксРеквизита + Формат(нИндекс, "ЧДЦ=0; ЧН=0; ЧГ=");
		Попытка
			ТестовыйРеквизит = ЭтотОбъект[ИмяРеквизита];
			МассивУдаляемыхРеквизитов.Добавить(ИмяРеквизита);
			нИндекс = нИндекс + 1;
		Исключение
			Прервать;
		КонецПопытки;
	КонецЦикла;
	МассивКатегорий = Новый Массив();
	Если ЗначениеЗаполнено(Объект.ОсновнаяКатегория) Тогда
		МассивКатегорий.Добавить(Объект.ОсновнаяКатегория);
	КонецЕсли;
	Для Каждого СтрокаКатегория Из Объект.Категории Цикл
		Если ЗначениеЗаполнено(СтрокаКатегория.Категория) И МассивКатегорий.Найти(СтрокаКатегория.Категория) = Неопределено Тогда
			МассивКатегорий.Добавить(СтрокаКатегория.Категория);
		КонецЕсли;
	КонецЦикла;
	МассивДобавляемыхРеквизитов = Новый Массив();
	нИндекс = 1;
	ОписаниеТиповКатегория = Новый ОписаниеТипов("СправочникСсылка.CRM_Категории");
	Для Каждого ДобавляемаяКатегория Из МассивКатегорий Цикл
		ИмяРеквизита = ПрефиксРеквизита + Формат(нИндекс, "ЧДЦ=0; ЧН=0; ЧГ=");
		РеквизитКатегория = Новый РеквизитФормы(ИмяРеквизита, ОписаниеТиповКатегория);
		МассивДобавляемыхРеквизитов.Добавить(РеквизитКатегория);
		нИндекс = нИндекс + 1;
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из МассивУдаляемыхРеквизитов Цикл
		Попытка Элементы.Удалить(Элементы[УдаляемыйЭлемент]);
		Исключение КонецПопытки;
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	нИндекс = 1;
	Для Каждого ДобавляемаяКатегория Из МассивКатегорий Цикл
		ИмяРеквизита = ПрефиксРеквизита + Формат(нИндекс, "ЧДЦ=0; ЧН=0; ЧГ=");
		ЭтотОбъект[ИмяРеквизита] = ДобавляемаяКатегория;
		ЦветФона = Новый Цвет(ДобавляемаяКатегория.ЦветКрасный, ДобавляемаяКатегория.ЦветЗеленый, ДобавляемаяКатегория.ЦветСиний);
		ЭлементыЗаголовка = Новый Массив;
		Если нИндекс = 1 Тогда
			ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(" " + ДобавляемаяКатегория.Наименование + " ", Новый Шрифт(, , Истина), CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(ЦветФона), ЦветФона));
		Иначе	
			ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(" " + ДобавляемаяКатегория.Наименование + " ",, CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(ЦветФона), ЦветФона));
		КонецЕсли;
		ЭлементКатегория = Элементы.Добавить(ИмяРеквизита, Тип("ДекорацияФормы"), Элементы.ГруппаКатегории);
		ЭлементКатегория.Вид = ВидДекорацииФормы.Надпись;
		ЭлементКатегория.Заголовок = Новый ФорматированнаяСтрока(ЭлементыЗаголовка);
		ЭлементКатегория.Подсказка = ДобавляемаяКатегория.Наименование;
		ЭлементКатегория.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементКатегория.АвтоМаксимальнаяШирина = Ложь;
		ЭлементКатегория.РастягиватьПоГоризонтали = Ложь;
		нИндекс = нИндекс + 1;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СинхронизацияКалендарей

&НаСервере
Процедура УдалитьВзаимодействиеИзКалендаря()
	CRM_СинхронизацияКалендарей.УдалитьВзаимодействиеИзКалендаря(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СозданиеЭлементаРядаСобытий()
	Объект.ПлановаяДата				= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);
	Объект.ПлановаяДатаЗавершение	= CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончанияПлан, ВремяОкончанияПлан);
	ПараметрыФормы				= Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("ДатаНачала", НачалоДня(ДатаНачала)));
	ПараметрыФормы.Вставить("ВремяНачала", ВремяНачала);
	ПараметрыФормы.Вставить("ВремяКонца", ВремяОкончанияПлан);
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("НовыйРяд", Истина);
	ОП = Новый ОписаниеОповещения("ОбработкаОповещенияОСозданииРядаСобытий", ЭтотОбъект, Дополнительно);
	ОткрытьФорму("Справочник.CRM_РядыСобытий.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, ,,, ОП);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияОСозданииРядаСобытий(Параметры, Дополнительно) Экспорт
	Если Параметры <> Неопределено Тогда
		Если Параметры.ПризнакЗакрытия = Истина Тогда
			Если Дополнительно.НовыйРяд Тогда
				Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
					Объект.РядСобытий	= Параметры.Ссылка;
					ВремяНачало			= Параметры.ВремяНачала;
					ВремяОкончание		= Параметры.ВремяКонца;
					ПризнакПериодическоеСобытиеИнициализация	= Истина;
					ПризнакИзмененоРасписание					= Истина;
					Объект.ИзмененоВРяде						= Ложь;
					Записать();
				Иначе
					Объект.Периодическое = Ложь;
				КонецЕсли;
			Иначе
				Если Параметры.ДанныеБылиИзменены Тогда
					ВремяНачало		 = Параметры.ВремяНачала;
					ВремяОкончание	 = Параметры.ВремяКонца;
					ПризнакИзмененоРасписание = Истина;
					Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НастроитьВидимостьИДоступностьФормы();
	Иначе
		Если Дополнительно.НовыйРяд Тогда
			Объект.Периодическое = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура открывает форму расписания.
//
// Параметры:
//	Нет.
//
Процедура ОткрытьФормуРасписания()
	ДатаВремяНачала		= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(Объект.ПлановаяДата);
	ДатаВремяОкончания	= CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(Объект.ПлановаяДатаЗавершение);
	ПараметрыФормы = Новый Структура("Ключ", Объект.РядСобытий);
	ПараметрыФормы.Вставить("ВремяНачала", ДатаВремяНачала.Время);
	ПараметрыФормы.Вставить("ВремяКонца", ДатаВремяОкончания.Время);
	ПараметрыФормы.Вставить("ДатаНачала", НачалоДня(Объект.Дата));
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("НовыйРяд", Ложь);
	ОП = Новый ОписаниеОповещения("ОбработкаОповещенияОСозданииРядаСобытий", ЭтотОбъект, Дополнительно);
	ОткрытьФорму("Справочник.CRM_РядыСобытий.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, ,,, ОП);
КонецПроцедуры // ОткрытьФормуРасписания()

&НаКлиенте
// Процедура создает новый элемент ряда событий.
//
// Параметры:
//	Нет.
//
Процедура СоздатьНовыйЭлементРядСобытий()
	Если ЗначениеЗаполнено(Объект.РядСобытий) Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстВопроса = (НСтр("ru='Данные еще не записаны."
"Установка признака периодичности возможна только после записи данных."
"Данные будут записаны.';en='Data has not been written yet."
"Installation of periodicity sign is possible only after writing data."
"Data will be written.'"));
		ОП = Новый ОписаниеОповещения("ОбработкаОповещенияВопросОЗаписи", ЭтотОбъект);
		ПоказатьВопрос(ОП, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		СозданиеЭлементаРядаСобытий();
	КонецЕсли;
КонецПроцедуры // СоздатьНовыйЭлементРядСобытий()

&НаКлиенте
// Процедура обработки ответа на вопрос о записи документа.
//
Процедура ОбработкаОповещенияВопросОЗаписи(Параметры, Дополнительно) Экспорт
	Если Параметры = КодВозвратаДиалога.Да Тогда
		Записать();
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Объект.Периодическое = Ложь;
		НастроитьВидимостьИДоступностьФормы();
		Возврат;
	КонецЕсли;
	СозданиеЭлементаРядаСобытий();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНаЯндексКарте(Команда)
	АдресОфисаТМП = Объект.АдресОфиса;
	Если НЕ АдресОфисаТМП.Пустая() Тогда
		ОписаниеМетки = ПолучитьОписаниеМетки(АдресОфисаТМП);
		ПараметрыОткрытия = Новый Структура("ОбъектСсылка, Широта, Долгота, Наименование, Режим",
		АдресОфисаТМП, ОписаниеМетки.Широта, ОписаниеМетки.Долгота, ОписаниеМетки.Наименование, "ДляПросмотра");
		ПараметрыОткрытия.Вставить("ОткрытаПоСценарию", Истина);
		ОткрытьФорму("Справочник.CRM_АдресаОфисовКомпании.Форма.ПросмотрКарты", ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеМетки(АдресСсылка)
	Возврат Справочники.CRM_АдресаОфисовКомпании.ПолучитьОписаниеМетки(АдресСсылка);
КонецФункции

&НаКлиенте
Процедура УчастникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "УчастникиУчастник" Тогда
		СтандартнаяОбработка	= Ложь;
		ТД	= Элементы.Участники.ТекущиеДанные;
		Если ТД = Неопределено Тогда Возврат; КонецЕсли;
		ПоказатьЗначение(, ТД.Участник);
	ИначеЕсли Поле.Имя = "УчастникиПосетитМероприятие" Тогда
		СтандартнаяОбработка = Ложь;
		ТД = Элементы.Участники.ТекущиеДанные;
		Если ТД = Неопределено Тогда Возврат; КонецЕсли;
		Если ТД.ПосетитМероприятие = 1 Тогда	
			// Да -> Нет
			ТД.ПосетитМероприятие = 0;	
		ИначеЕсли ТД.ПосетитМероприятие = 2 Тогда	
			// Может быть -> Да
			ТД.ПосетитМероприятие = 1;	
		Иначе
			// -> Может быть
			ТД.ПосетитМероприятие = 2;	
		КонецЕсли;
		Модифицированность = Истина;
		УстановитьПометкуУчастия();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОфисаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораадреса(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.АдресОфиса = Результат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАдрес(Команда)
	ОП = Новый ОписаниеОповещения("ПослеВыбораадреса", ЭтотОбъект);
	СтруктураОтбора = Новый Структура("Владелец", Объект.Партнер);
	
	ОткрытьФорму("Справочник.CRM_АдресаОфисовКомпании.Форма.ФормаВыбора", Новый структура("Отбор", СтруктураОтбора), ЭтотОбъект, ,,, ОП);

КонецПроцедуры

#КонецОбласти

#Область УчетРабочегоВремени

&НаКлиенте
Процедура Подключаемый_Команда_CRM_УказатьТрудозатраты(Команда)
	
	Подключаемый_Команда_CRM_УказатьТрудозатратыНаСервере();
	CRM_ТрудозатратыКлиент.УказатьТрудозатраты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатраты(Команда)
	
	Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатратыНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатратыНаСервере(ИмяКоманды)
	
	CRM_ТрудозатратыСервер.ВыполнитьДействиеНадТаблицейЗаписейТрудозатраты(ЭтотОбъект, ИмяКоманды);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_Команда_CRM_УказатьТрудозатратыНаСервере()
	
	CRM_ТрудозатратыСервер.УказатьТрудозатратыНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиПанельТрудозатрат()
	
	CRM_ТрудозатратыКлиент.ВывестиПанельТрудозатрат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьПанельТрудозатрат()
	
	CRM_ТрудозатратыКлиент.ЗакрытьПанельТрудозатрат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_РабочееВремяПользователейПриИзменении(Элемент)
	
	Отказ = Ложь;
	CRM_ТрудозатратыКлиент.РабочееВремяПользователейПриИзменении(ЭтотОбъект, Элемент, Отказ);
	
	Если НЕ Отказ Тогда
		Подключаемый_CRM_РабочееВремяПользователейПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_РабочееВремяПользователейПриИзмененииНаСервере()
	
	CRM_ТрудозатратыСервер.ТаблицаЗаписейПриИзмененииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавленияНаСервере()
	
	CRM_ТрудозатратыСервер.ТаблицаЗаписейПередНачаломДобавленияНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 
