#Область ОбработчикиСобытийФормы

//++ смарт:ММ #094 411 07.02.2021
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьЭлементыПрограммно();
	
	//++ смарт:КМД #3_2 501 13.06.2021
	смарт_ДобавитьЭлементыПрограммноОборачиваемость();
	//смарт_УстановитьУсловноеОформлениеНеликвиды();
	смарт_ЗаполнитьИнформациюОНеликвидах();
	//-- смарт:КМД #3_2 501 13.06.2021
	
	//++ #Б2028 смарт: Шляпников 11.02.2025 / Заявка на разборку оборудования. Формирование нового узла номенклатуры (результат разборки).
	смарт_ДобавитьЭлементыПрограммноРазобранноеОборудование();
	//-- #Б2028 смарт: Шляпников 11.02.2025
	
	//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
	УстановитьВидимостьПолейМаркировки();
	//-- #Б4670 смарт: Шляпников 21.10.2025
	
	//++ #Б-5504 смарт: Фролов 29.01.2026 //Справочник номенклатура. Доработка формы элемента.
	Если НЕ Элементы.Найти("ИсторияИзменений") = Неопределено Тогда
		Элементы.Переместить(Элементы.ИсторияИзменений, Элементы.ФормаКоманднаяПанель, Элементы.смартКомандаСинхронизироватьНоменклатуру);
	КонецЕсли;
	//-- #Б-5504 смарт: Фролов 29.01.2026
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаОповещения")
Процедура смарт_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;

	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Элементы.Штрихкод.Видимость
				И Элементы.Штрихкод.Доступность Тогда
				Штрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр).Штрихкод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

	Если ИмяСобытия = "Запись_ВидыНоменклатуры" Тогда

		ПриЗаписиВидаНоменклатуры();
	ИначеЕсли ИмяСобытия = "Запись_ШтрихкодыНоменклатуры"
		И Параметр = Объект.Ссылка Тогда

		НастроитьФормуИОбновитьКарточку();

	ИначеЕсли ИмяСобытия = "Запись_ТоварыДругогоКачества"
		И Параметр = Объект.Ссылка Тогда

		ОбработатьЗаписьТовараДругогоКачества();

	ИначеЕсли ИмяСобытия = "Запись_ВариантыКомплектацииНоменклатуры"
		И Параметр.Свойство("ВладелецКомплекта")
		И Параметр.ВладелецКомплекта = Объект.Ссылка Тогда

		Если Объект.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать")
			И Параметр.Свойство("Основной")
			И Параметр.Основной Тогда

			ВариантКомплектацииНоменклатуры = Параметр.Комплект;

		КонецЕсли;

		НастроитьФормуИОбновитьКарточку();

	ИначеЕсли ИмяСобытия = "Запись_ХарактеристикиНоменклатуры"
		И ЗначениеЗаполнено(Источник) Тогда

		ОбработкаОповещенияЗапись_ХарактеристикиНоменклатуры(Источник);

	ИначеЕсли ИмяСобытия = "Запись_УпаковкиНоменклатурыСписок"
		И (Параметр = Объект.Ссылка Или Параметр = Объект.НаборУпаковок) Тогда

		НастроитьФормуИОбновитьКарточку();

	ИначеЕсли ИмяСобытия = "Запись_СертификатНоменклатуры" Тогда
		ОбработкаОповещенияЗапись_Запись_СертификатыНоменклатурыСписок(Параметр);
	ИначеЕсли ИмяСобытия = "ВключитьУдалитьВСегмент"
		И Параметр = Объект.Ссылка Тогда

		НастроитьФормуИОбновитьКарточку();

	ИначеЕсли ИмяСобытия = "Запись_СоглашенияСПоставщиками" Тогда
		НастроитьФормуИОбновитьКарточку();
	ИначеЕсли ИмяСобытия = "ВыбранаУпаковкаДляОтчетов" Тогда

		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("Коэффициент") Тогда

			Объект.КоэффициентЕдиницыДляОтчетов = Параметр.Коэффициент;

		КонецЕсли;
		
	#Вставка
	//++ #Б2736 смарт: Шляпников 21.03.2025 / Конструктор КП. - Привязка справочника "Номенклатура" к справочнику "Конструктор оборудования".
	ИначеЕсли ИмяСобытия = "смартЗаписанКонструкторОборудования" Тогда
		
		смартКонструктор = ПолучитьКонструкторОборудованияСвязанныйСТекущейНоменклатурой();
		
		Если ЗначениеЗаполнено(смартКонструктор) Тогда
			Элементы.смартСсылкаНаКонструктор.Заголовок = СтрШаблон("Номенклатура связана с конструктором : %1", смартКонструктор);
			Элементы.смартСсылкаНаКонструктор.Подсказка = СтрШаблон("Открыть : %1", смартКонструктор);
		КонецЕсли;
	
	//-- #Б2736 смарт: Шляпников 21.03.2025
	#КонецВставки
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

//++ #Б2736 смарт: Шляпников 21.03.2025 / Конструктор КП. - Привязка справочника "Номенклатура" к справочнику "Конструктор оборудования".
&НаКлиенте
Процедура ПриНажатииНаСсылкуСвязиСКонструктором(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	смартКонструктор = ПолучитьКонструкторОборудованияСвязанныйСТекущейНоменклатурой();
	
	ПараметрыВопроса = Новый Структура;
	ПараметрыВопроса.Вставить("смартКонструктор", смартКонструктор);
	
	Если НЕ ЗначениеЗаполнено(смартКонструктор) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриНажатииНаСсылкуСвязиСКонструкторомЗавершение", ЭтаФорма, ПараметрыВопроса), 
						"Вы собираетесь связать эту номенклатуру с конструктором, продолжить?",
						РежимДиалогаВопрос.ДаНет);
	Иначе
		ПриНажатииНаСсылкуСвязиСКонструкторомЗавершение(КодВозвратаДиалога.Да, ПараметрыВопроса);
	КонецЕсли;
	
КонецПроцедуры

//++ #Б2736 смарт: Шляпников 21.03.2025 / Конструктор КП. - Привязка справочника "Номенклатура" к справочнику "Конструктор оборудования".
&НаКлиенте
Процедура ПриНажатииНаСсылкуСвязиСКонструкторомЗавершение(Значение, ДопПараметры) Экспорт
	
	Если Значение = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура", Объект.Ссылка);
		Если ЗначениеЗаполнено(ДопПараметры.смартКонструктор) Тогда
			ПараметрыФормы.Вставить("Ключ", ДопПараметры.смартКонструктор);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.смартКонструкторОборудования.Форма.ФормаЭлемента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("КодТНВЭДПриИзменении")
Процедура смарт_КодТНВЭДПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.КодТНВЭД) Тогда
		КодТНВЭДПриИзмененииСервер();
	Иначе
		Объект.ЕдиницаИзмеренияТНВЭД = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	КонецЕсли;

	#Вставка
	//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
	УстановитьВидимостьПолейМаркировки();
	//-- #Б4670 смарт: Шляпников 21.10.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область Команды

//++ смарт:КМД #3_2 501 13.06.2021
&НаКлиенте
Процедура смарт_ИсключитьИзНеликвидов(Команда)
	
	Если Параметры.Ключ.Пустая() тогда
		ПоказатьПредупреждение(, "Нельзя включать и исключать из неликвидов незаписанную номенклатуру!",, "Ошибка");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ИсключитьИзНеликвидовЗавершение", ЭтаФорма), "Вы уверены что хотите исключить номенклатуру из неликвидов?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

//++ смарт:КМД #3_2 501 13.06.2021
&НаКлиенте
Процедура смарт_ВключитьВНеликвиды(Команда)
	
	Если Параметры.Ключ.Пустая() тогда
		ПоказатьПредупреждение(, "Нельзя включать и исключать из неликвидов незаписанную номенклатуру!",, "Ошибка");
		Возврат;
	КонецЕсли;
	
	Если Объект["смартОбязательноеНаличие"] = Истина тогда
		ПоказатьПредупреждение(, "Номенклатуру с признаком ""Обязательное наличие"" нельзя включать в неликвиды!",, "Ошибка");
		Возврат;
	КонецЕсли;  
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("ВключитьВS", "Включить в сегмент S");
	СписокКнопок.Добавить("ВключитьВSПлюс", "Включить в сегмент S+");
	СписокКнопок.Добавить("Отмена", "Отмена");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ВключитьВНеликвидыЗавершение", ЭтаФорма), "В какой сегемент неликвидов включить номенклатуру?", СписокКнопок);
	
КонецПроцедуры

//++ Смарт:  Демичев №875 17.02.2022 ((
&НаКлиенте
Процедура смарт_КомандаСинхронизироватьНоменклатуру(Команда)
	
	//Возврат;//////
	Если Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(, "Нельзя зарегистрировать к обмену незаписанную номенклатуру!",, "Ошибка");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ЗарегистрироватьКОбменуЗавершение", ЭтаФорма), "Зарегистрировать номенклатуру к обмену?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры  


#КонецОбласти

&НаКлиенте
Процедура смарт_ВключитьВНеликвидыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "ВключитьВS" ИЛИ РезультатВопроса = "ВключитьВSПлюс" тогда
		смарт_ВключитьНоменклатуруВНеликвидыСервер(РезультатВопроса);
	КонецЕсли;

КонецПроцедуры

//++ смарт:КМД #3_2 501 13.06.2021
&НаСервере
Процедура смарт_ВключитьНоменклатуруВНеликвидыСервер(НастройкаСегмент)
	СтруктураНастройки = смартАвтоматизированныйРасчетНеликвидовСервер.ПолучитьСтруктуруНастройки();
	
	Если НастройкаСегмент = "ВключитьВS" тогда
		ВключенВНеликвидыS = Истина;
		ВключенВНеликвидыSПлюс = Ложь;
		Сегмент = СтруктураНастройки.СегментSОборачиваемость;
	Иначе
		ВключенВНеликвидыS = Ложь;
		ВключенВНеликвидыSПлюс = Истина;
		Сегмент = СтруктураНастройки.СегментSПлюсОборачиваемость;
	КонецЕсли;
	
	//запишем данные в регистр смартИсторияАвтоматизированногоРасчетаНеликвидов
	//++ #1305 смарт: Фролов 15.02.2023 //Отчет Стоимость использования оборудования  
	//смартАвтоматизированныйРасчетНеликвидовСервер.ДобавитьЗаписьВРегистр_смартИсторияАвтоматизированногоРасчетаНеликвидов(ТекущаяДатаСеанса(),
	//	Объект.Ссылка, Объект["смартСоответствиеСОбрудованиемИЧерниламиКлиентов"], 0, 0, 0, ВключенВНеликвидыS,
	//	ВключенВНеликвидыSПлюс, Истина);
	смартАвтоматизированныйРасчетНеликвидовСервер.ДобавитьЗаписьВРегистр_смартИсторияАвтоматизированногоРасчетаНеликвидов(ТекущаяДатаСеанса(),
		Объект.Ссылка, смарт_ПолучитьОборудованиеКлиента(Объект.Ссылка), 0, 0, 0, ВключенВНеликвидыS,
		ВключенВНеликвидыSПлюс, Истина);
	//-- #1305 смарт: Фролов 15.02.2023
	
	//включим в сегмент неликвидов
	смартАвтоматизированныйРасчетНеликвидовСервер.ВключитьНоменклатуруВСегментНеликвидов(Сегмент, Объект.Ссылка);
	
	смарт_ЗаполнитьИнформациюОНеликвидах();	
КонецПроцедуры


//++ смарт:КМД #3_2 501 13.06.2021
&НаКлиенте
Процедура смарт_ИсключитьИзНеликвидовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		смарт_ИсключитьНоменклатуруИзНеликвидовСервер();
	КонецЕсли;

КонецПроцедуры

//++ смарт:КМД #3_2 501 13.06.2021
&НаСервере
Процедура смарт_ИсключитьНоменклатуруИзНеликвидовСервер()
	СтруктураНастройки = смартАвтоматизированныйРасчетНеликвидовСервер.ПолучитьСтруктуруНастройки();
	
	НоменклатураИсключенаИзНеликвидов = смартАвтоматизированныйРасчетНеликвидовСервер.ИсключитьНоменклатуруИзСегментовНеликвидов(Объект.Ссылка, СтруктураНастройки.СегментSОборачиваемость, СтруктураНастройки.СегментSПлюсОборачиваемость);
	
	Если НоменклатураИсключенаИзНеликвидов = Истина тогда
		//запишем данные в регистр смартИсторияАвтоматизированногоРасчетаНеликвидов
		//++ #1305 смарт: Фролов 16.02.2023 //Отчет Стоимость использования оборудования  
		//смартАвтоматизированныйРасчетНеликвидовСервер.ДобавитьЗаписьВРегистр_смартИсторияАвтоматизированногоРасчетаНеликвидов(ТекущаяДатаСеанса(),
		//	Объект.Ссылка, Объект["смартСоответствиеСОбрудованиемИЧерниламиКлиентов"], 0, 0, 0, Ложь,
		//	Ложь, Истина);
		смартАвтоматизированныйРасчетНеликвидовСервер.ДобавитьЗаписьВРегистр_смартИсторияАвтоматизированногоРасчетаНеликвидов(ТекущаяДатаСеанса(),
			Объект.Ссылка, смарт_ПолучитьОборудованиеКлиента(Объект.Ссылка), 0, 0, 0, Ложь,
			Ложь, Истина);
		//-- #1305 смарт: Фролов 16.02.2023
	КонецЕсли;
		
	смарт_ЗаполнитьИнформациюОНеликвидах();	
КонецПроцедуры

//++ смарт:КМД #3_2 501 13.06.2021
&НаСервере
Процедура смарт_ЗаполнитьИнформациюОНеликвидах()
	СтруктураИнформация = смартАвтоматизированныйРасчетНеликвидовСервер.ПолучитьАктуальнуюИнформациюОНеликвидах(Объект.Ссылка);
	
	ЭтаФорма["НеликвидS"] = СтруктураИнформация.ВключенВНеликвидыS;
	ЭтаФорма["НеликвидSПлюс"] = СтруктураИнформация.ВключенВНеликвидыSПлюс;
	ЭтаФорма["ИзмененоВручную"] = СтруктураИнформация.ИзмененоВручную;
	
	//оформление
	Элементы["НеликвидS"].ШрифтЗаголовка = Новый Шрифт(Элементы["НеликвидS"].ШрифтЗаголовка,,, ЭтаФорма["НеликвидS"]);
	Элементы["НеликвидSПлюс"].ШрифтЗаголовка = Новый Шрифт(Элементы["НеликвидSПлюс"].ШрифтЗаголовка,,, ЭтаФорма["НеликвидSПлюс"]);
	Элементы["ИзмененоВручную"].ШрифтЗаголовка = Новый Шрифт(Элементы["ИзмененоВручную"].ШрифтЗаголовка,,, ЭтаФорма["ИзмененоВручную"]);
	
	//видимость кнопок
	Если ЭтаФорма["НеликвидS"] = Истина ИЛИ ЭтаФорма["НеликвидSПлюс"] = Истина тогда
		Элементы["смартВключитьВНеликвиды"].Видимость = Ложь;
		Элементы["смартИсключитьИзНеликвидов"].Видимость = Истина;
	Иначе
		Элементы["смартВключитьВНеликвиды"].Видимость = Истина;
		Элементы["смартИсключитьИзНеликвидов"].Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗарегистрироватьКОбменуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		смарт_ЗарегистрироватьНаУзлахОбменаОткрытьФормуРегистрации();
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура смарт_ЗарегистрироватьНаУзлахОбменаОткрытьФормуРегистрации() 
	
	мМассивТоваров = Новый Массив;
	мМассивТоваров.Добавить(Объект.Ссылка);
	
	смПараметры = Новый Структура;
	смПараметры.Вставить("МассивНоменклатуры",мМассивТоваров);
	
	ПараметрыВыбораУзла = Новый Структура;
	ПараметрыВыбораУзла.Вставить("РежимВыбора",Истина);
	ПараметрыВыбораУзла.Вставить("СтруктураНоменклатурыМассив",смПараметры);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.смарт_ФормаСинхронизацииНоменклатуры",ПараметрыВыбораУзла,
	ЭтаФорма);
	
КонецПроцедуры   
				
//-- Смарт:  Демичев №875 17.02.2022 ((

//++ #1305 смарт: Фролов 16.02.2023 //Отчет Стоимость использования оборудования  
&НаСервере
Функция смарт_ПолучитьОборудованиеКлиента(Номенклатура)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
					|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК ОборудованиеКлиентов
					|ИЗ
					|	РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
					|ГДЕ
					|	смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром
					|	И смартОборудованиеЧернилаКлиентов.Номенклатура = &Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОборудованиеКлиентов;
	Иначе
		Возврат Справочники.смартОборудованиеКлиентов.ПустаяСсылка();
	КонецЕсли;	
КонецФункции	

//++ #2057 смарт: Ермаков 17.09.2024 / Ошибка при копировании карточки номенклатуры
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПоПараметрам")
Процедура смарт_ЗаполнитьПоПараметрам()

	Если Параметры.Свойство("ДополнительныеПараметры")И
		(Параметры.ДополнительныеПараметры.Свойство("ВидАлкогольнойПродукцииЕГАИС")
		И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ВидАлкогольнойПродукцииЕГАИС))
		Или (Параметры.ДополнительныеПараметры.Свойство("ИмпортерЕГАИС")
		И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ИмпортерЕГАИС))
		Или (Параметры.ДополнительныеПараметры.Свойство("ОбъемЕГАИС")
		И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ОбъемЕГАИС))
		Или (Параметры.ДополнительныеПараметры.Свойство("ПроизводительЕГАИС")
		И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ПроизводительЕГАИС))
		Или (Параметры.ДополнительныеПараметры.Свойство("КрепостьЕГАИС")
		И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.КрепостьЕГАИС))Тогда

		РеквизитыЕГАИССтруктура = Новый Структура();
		РеквизитыЕГАИССтруктура.Вставить("ВидАлкогольнойПродукцииЕГАИС");
		РеквизитыЕГАИССтруктура.Вставить("ИмпортерЕГАИС");
		РеквизитыЕГАИССтруктура.Вставить("ПроизводительЕГАИС");
		РеквизитыЕГАИССтруктура.Вставить("ОбъемЕГАИС", 0);
		РеквизитыЕГАИССтруктура.Вставить("КрепостьЕГАИС", 0);

		ЗаполнитьЗначенияСвойств(РеквизитыЕГАИССтруктура, Параметры.ДополнительныеПараметры);

		РеквизитыЕГАИС = Новый ФиксированнаяСтруктура(РеквизитыЕГАИССтруктура);

		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыНоменклатуры.Ссылка) КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукциейИВидом
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА
		|	И ВидыНоменклатуры.ВидАлкогольнойПродукции = &ВидАлкогольнойПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыНоменклатуры.Ссылка) КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукцией
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка КАК Ссылка,
		|	ТаблицаКоличество.Количество КАК Количество
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукциейИВидом КАК ТаблицаКоличество
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА
		|	И ВидыНоменклатуры.ВидАлкогольнойПродукции = &ВидАлкогольнойПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка КАК Ссылка,
		|	ТаблицаКоличество.Количество КАК Количество
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукцией КАК ТаблицаКоличество
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА";
		Запрос.УстановитьПараметр("ВидАлкогольнойПродукции", РеквизитыЕГАИССтруктура.ВидАлкогольнойПродукцииЕГАИС);
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаПоВидуАлкогольнойПродукции = Результат[2].Выбрать();
		ВыборкаПоАлкогольнойПродукции = Результат[3].Выбрать();

		Если ВыборкаПоВидуАлкогольнойПродукции.Следующий() Тогда
			Если ВыборкаПоВидуАлкогольнойПродукции.Количество = 1 Тогда
				Объект.ВидНоменклатуры = ВыборкаПоВидуАлкогольнойПродукции.Ссылка;
			КонецЕсли;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры)
			И ВыборкаПоАлкогольнойПродукции.Следующий() Тогда
			Если ВыборкаПоАлкогольнойПродукции.Количество = 1 Тогда
				Объект.ВидНоменклатуры = ВыборкаПоАлкогольнойПродукции.Ссылка;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли Не ЗначениеЗаполнено(Объект.ВидНоменклатуры)
		И Параметры.Свойство("ДополнительныеПараметры")
		И (Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыВЕТИС")
		Или Параметры.ДополнительныеПараметры.Свойство("АртикулНоменклатурыВЕТИС")
		Или Параметры.ДополнительныеПараметры.Свойство("ШтрихкодВЕТИС")
		Или Параметры.ДополнительныеПараметры.Свойство("ЕдиницаИзмеренияВЕТИС")) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыНоменклатуры.Ссылка) КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоВидовНоменклатурыВЕТИС
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ПодконтрольнаяПродукцияВЕТИС
		|	Или ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС)
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////// 1
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка      КАК Ссылка,
		|	ТаблицаКоличество.Количество КАК Количество
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВидовНоменклатурыВЕТИС КАК ТаблицаКоличество
		|		ПО ИСТИНА
		|ГДЕ
		|	ВидыНоменклатуры.ПодконтрольнаяПродукцияВЕТИС
		|	Или ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС)";

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий()
			И Выборка.Количество = 1 Тогда

			Объект.ВидНоменклатуры = Выборка.Ссылка;

		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда

		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		СправочникОбъект.Заполнить(Неопределено);
		ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");

		ЕстьПравоРедактирования = Истина;

		// Новый элемент номенклатуры создан копированием, реквизиты формы заполняются
		// значениями реквизитов параметра копирования.
		ИсточникКопирования = Параметры.ЗначениеКопирования;

		#Удаление //++ #2057 смарт: Ермаков 17.09.2024 / Ошибка при копировании карточки номенклатуры
		ЗаполнитьЗначенияСвойств(Объект, ИсточникКопирования, , "ГруппаДоступа, ФайлКартинки, ФайлОписанияДляСайта, 
		|ДополнительныеРеквизиты, ДрагоценныеМатериалы, Код, 
		|ПометкаУдаления");
		#КонецУдаления //-- #2057 смарт: Ермаков 17.09.2024
		
		#Вставка
		//++ #2057 смарт: Ермаков 17.09.2024 / Ошибка при копировании карточки номенклатуры
		ЗаполнитьЗначенияСвойств(Объект, ИсточникКопирования, , "ГруппаДоступа, ФайлКартинки, ФайлОписанияДляСайта, 
		|ДополнительныеРеквизиты, ДрагоценныеМатериалы, Код,
		//++ #7954 смарт: Тимофеева 24.08.2026 / Справочник Номенклатура. Признак "Классификация номенклатуры"
		|смартКлассификацияНоменклатуры,
		//-- #7954 смарт: Тимофеева 24.08.2026
        |ПометкаУдаления, смартСнятыеКомплектующие");
		//-- #2057 смарт: Ермаков 17.09.2024
		#КонецВставки
		
		Объект.ДополнительныеРеквизиты.Загрузить(ИсточникКопирования.ДополнительныеРеквизиты.Выгрузить());

		СтруктураРеквизитовОбъектаКопирования = Новый Структура;
		СтруктураРеквизитовОбъектаКопирования.Вставить("ОбъектКопирования",          ИсточникКопирования);
		СтруктураРеквизитовОбъектаКопирования.Вставить("Наименование",               Объект.Наименование);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ВидНоменклатуры",            Объект.ВидНоменклатуры);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ИспользоватьУпаковки",       Объект.ИспользоватьУпаковки);
		СтруктураРеквизитовОбъектаКопирования.Вставить("НаборУпаковок",              Объект.НаборУпаковок);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ИспользованиеХарактеристик", Объект.ИспользованиеХарактеристик);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ТипНоменклатуры",            Объект.ТипНоменклатуры);

		РеквизитыОбъектаКопирования = Новый ФиксированнаяСтруктура(СтруктураРеквизитовОбъектаКопирования);

		НаименованиеЗаполнение       = Объект.Наименование;
		НаименованиеПолноеЗаполнение = Объект.НаименованиеПолное;
		ВидНоменклатуры              = Объект.ВидНоменклатуры;
		ВидНоменклатурыДоИзменения   = Объект.ВидНоменклатуры;
		ГруппаНоменклатуры           = Объект.Родитель;

		Если Параметры.Свойство("СозданиеНекачественногоТовара") Тогда

			Автозаголовок = Ложь;

			ТекстЗаголовка = НСтр("ru='Создание номенклатуры для испорченного товара ""%НаименованиеТовара%"".'");
			Заголовок = СтрЗаменить(ТекстЗаголовка, "%НаименованиеТовара%", Строка(Объект.Наименование));

			Объект.Качество        = Параметры.СозданиеНекачественногоТовара;
			Объект.СкладскаяГруппа = Справочники.СкладскиеГруппыНоменклатуры.ПустаяСсылка();
			Объект.ЦеноваяГруппа   = Справочники.ЦеновыеГруппы.ПустаяСсылка();
			Объект.ФайлКартинки    = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();

			НаименованиеЗаполнение       = Объект.Наименование + ", " + Строка(Объект.Качество);
			НаименованиеПолноеЗаполнение = Объект.НаименованиеПолное + ", " + Строка(Объект.Качество);

		ИначеЕсли Параметры.Свойство("НаименованиеНоменклатурыПартнера") 
			И ЗначениеЗаполнено(Параметры.НаименованиеНоменклатурыПартнера) Тогда

			НаименованиеЗаполнение = Параметры.НаименованиеНоменклатурыПартнера;

		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыЕГАИС")
			Или Параметры.ДополнительныеПараметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС") Тогда

			Если Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыЕГАИС")
				И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеЗаполнение = Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыЕГАИС;
			КонецЕсли;

			Если Параметры.ДополнительныеПараметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС")
				И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ПолноеНаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеПолноеЗаполнение = Параметры.ДополнительныеПараметры.ПолноеНаименованиеНоменклатурыЕГАИС;
			КонецЕсли;

		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыВЕТИС) Тогда

			НаименованиеЗаполнение = Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыВЕТИС;

		КонецЕсли;

		Если Параметры.Свойство("АртикулНоменклатурыПартнера")
			И ЗначениеЗаполнено(Параметры.АртикулНоменклатурыПартнера) Тогда

			Объект.Артикул = Параметры.АртикулНоменклатурыПартнера;

		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("АртикулНоменклатурыВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.АртикулНоменклатурыВЕТИС) Тогда

			Объект.Артикул = Параметры.ДополнительныеПараметры.АртикулНоменклатурыВЕТИС;

		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("ШтрихкодВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ШтрихкодВЕТИС) Тогда

			Штрихкод = Параметры.ДополнительныеПараметры.ШтрихкодВЕТИС;

		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("ЕдиницаИзмеренияВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ЕдиницаИзмеренияВЕТИС) Тогда

			Объект.ЕдиницаИзмерения = Параметры.ДополнительныеПараметры.ЕдиницаИзмеренияВЕТИС;

			ТипЕдиницы = "";
			ЭтоМернаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.ЭтоМернаяЕдиница(Объект.ЕдиницаИзмерения, ТипЕдиницы);

			Справочники.Номенклатура.ОтработатьЛогикуЗаполненияМеры(Объект, ЭтоМернаяЕдиница, ТипЕдиницы, ТипЕдиницы);

		КонецЕсли;

		Если ЗначениеЗаполнено(ИсточникКопирования.ФайлКартинки)
			Или ЗначениеЗаполнено(ИсточникКопирования.ФайлОписанияДляСайта) Тогда

			СкопироватьПрисоединенныеФайлы(ИсточникКопирования.ФайлКартинки, ИсточникКопирования.ФайлОписанияДляСайта);

		КонецЕсли;

		ЕстьИндивидуальныеХарактеристикиВОбъектеКопирования = 
		(РеквизитыОбъектаКопирования.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры);

		Объект.Наименование       = НаименованиеЗаполнение;
		Объект.НаименованиеПолное = НаименованиеПолноеЗаполнение;

		ЕстьИндивидуальныеУпаковкиВОбъектеКопирования = РеквизитыОбъектаКопирования.ИспользоватьУпаковки 
		И (РеквизитыОбъектаКопирования.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры);

		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////// 1
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеНоменклатурыВЕТИС.Продукция КАК ПродукцияВЕТИС
		|ИЗ
		|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
		|ГДЕ
		|	СоответствиеНоменклатурыВЕТИС.Номенклатура = &Номенклатура";

		Запрос.УстановитьПараметр("Номенклатура", ИсточникКопирования);

		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		УстановитьПривилегированныйРежим(Ложь);

		ЕстьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИСВОбъектеКопирования = Не РезультатЗапроса[0].Пустой();
		ЕстьСвязьСКлассификаторомПродукцииВЕТИСВОбъектеКопирования            = Не РезультатЗапроса[1].Пустой();

		КопироватьИндивидуальныеУпаковки       = ЕстьИндивидуальныеУпаковкиВОбъектеКопирования;
		КопироватьИндивидуальныеХарактеристики = ЕстьИндивидуальныеХарактеристикиВОбъектеКопирования;

		КопироватьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИС = ЕстьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИСВОбъектеКопирования;
		КопироватьСвязьСКлассификаторомПродукцииВЕТИС = ЕстьСвязьСКлассификаторомПродукцииВЕТИСВОбъектеКопирования;

		ВидНоменклатурыПриИзмененииНаСервере(Истина);

	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда

		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		СправочникОбъект.Заполнить(Неопределено);
		ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");

		ЕстьПравоРедактирования = Истина;

		// Создается новый элемент номенклатуры.
		Параметры.Свойство("ВидНоменклатуры", ВидНоменклатуры);
		Параметры.Свойство("Родитель", ГруппаНоменклатуры);
		Если ВидНоменклатуры = Неопределено
			И ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ВидНоменклатуры = Объект.ВидНоменклатуры;
		ИначеЕсли ВидНоменклатуры = Неопределено
			И Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		Если ГруппаНоменклатуры = Неопределено Тогда
			ГруппаНоменклатуры = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;

		Если Параметры.Свойство("ТекстЗаполнения")
			И ЗначениеЗаполнено(Параметры.ТекстЗаполнения) Тогда
			НаименованиеЗаполнение = Параметры.ТекстЗаполнения;
		КонецЕсли;

		Если Параметры.Свойство("НаименованиеНоменклатурыПартнера")
			И ЗначениеЗаполнено(Параметры.НаименованиеНоменклатурыПартнера) Тогда
			НаименованиеЗаполнение = Параметры.НаименованиеНоменклатурыПартнера;
		КонецЕсли;

		Если Параметры.Свойство("АртикулНоменклатурыПартнера")
			И ЗначениеЗаполнено(Параметры.АртикулНоменклатурыПартнера) Тогда
			Объект.Артикул = Параметры.АртикулНоменклатурыПартнера;
		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("АртикулНоменклатурыВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.АртикулНоменклатурыВЕТИС) Тогда

			Объект.Артикул = Параметры.ДополнительныеПараметры.АртикулНоменклатурыВЕТИС;

		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("ШтрихкодВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ШтрихкодВЕТИС) Тогда

			Штрихкод = Параметры.ДополнительныеПараметры.ШтрихкодВЕТИС;

		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("ЕдиницаИзмеренияВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ЕдиницаИзмеренияВЕТИС) Тогда

			Объект.ЕдиницаИзмерения = Параметры.ДополнительныеПараметры.ЕдиницаИзмеренияВЕТИС;

			ТипЕдиницы = "";
			ЭтоМернаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.ЭтоМернаяЕдиница(Объект.ЕдиницаИзмерения, ТипЕдиницы);

			Справочники.Номенклатура.ОтработатьЛогикуЗаполненияМеры(Объект, ЭтоМернаяЕдиница, ТипЕдиницы, ТипЕдиницы);

		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыЕГАИС")
			Или Параметры.ДополнительныеПараметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС") Тогда

			Если Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыЕГАИС")
				И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеЗаполнение = Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыЕГАИС;
			КонецЕсли;


			Если Параметры.ДополнительныеПараметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС")
				И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ПолноеНаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеПолноеЗаполнение = Параметры.ДополнительныеПараметры.ПолноеНаименованиеНоменклатурыЕГАИС;
			КонецЕсли;

		КонецЕсли;

		Если Параметры.ДополнительныеПараметры.Свойство("НаименованиеНоменклатурыВЕТИС")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыВЕТИС) Тогда

			НаименованиеЗаполнение = Параметры.ДополнительныеПараметры.НаименованиеНоменклатурыВЕТИС;

		КонецЕсли;

		Объект.Наименование       = НаименованиеЗаполнение;
		Объект.НаименованиеПолное = НаименованиеПолноеЗаполнение;

		РеквизитыОбъектаКопирования = Неопределено;

		Объект.Качество  = Перечисления.ГрадацииКачества.Новый;
		Объект.СтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию();

		ВидНоменклатурыГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ЭтоГруппа");

		Если ВидНоменклатуры.Пустая()
			Или ВидНоменклатурыГруппа Тогда
			ВидНоменклатуры = Справочники.ВидыНоменклатуры.ВидНоменклатурыПоУмолчанию();
		КонецЕсли;

		Объект.Родитель        = ГруппаНоменклатуры;
		Объект.ВидНоменклатуры = ВидНоменклатуры;

		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда

			Если Параметры.Свойство("АдресТаблицыПараметров") Тогда

				СтруктураПараметровДереваОтборов = Новый Структура("ВидНоменклатуры, АдресТаблицыСопоставления");
				СтруктураПараметровДереваОтборов.ВидНоменклатуры           = ВидНоменклатуры;
				СтруктураПараметровДереваОтборов.АдресТаблицыСопоставления = Параметры.АдресТаблицыСопоставления;

				АдресТаблицы = Параметры.АдресТаблицыПараметров;

			КонецЕсли;

			ТаблицаДопРеквизитов = Новый ТаблицаЗначений;
			ТаблицаДопРеквизитов.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(255)));

			ВидНоменклатурыПриИзмененииНаСервере();

			Если ЗначениеЗаполнено(АдресТаблицы) Тогда

				ТаблицаЗначенийРеквизитов = ПолучитьИзВременногоХранилища(АдресТаблицы);
				МассивРеквизитов = ТаблицаЗначенийРеквизитов.НайтиСтроки(Новый Структура("ЭтоДопРеквизит", Ложь));

				Для Каждого ЭлементМассива Из МассивРеквизитов Цикл
					Объект[ЭлементМассива.ИмяРеквизита] = ЭлементМассива.ЗначениеОтбора;
				КонецЦикла;

				МассивДопРеквизитов = ТаблицаЗначенийРеквизитов.НайтиСтроки(Новый Структура("ЭтоДопРеквизит", Истина));

				Если ИспользоватьДополнительныеРеквизитыИСведения И МассивДопРеквизитов.Количество() > 0 Тогда

					Для Каждого ЭлементМассива Из МассивДопРеквизитов Цикл

						НоваяСтрока = ТаблицаДопРеквизитов.Добавить();
						НоваяСтрока.ИмяРеквизита = ЭлементМассива.ИмяРеквизита;

					КонецЦикла;

					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаДопРеквизитов.ИмяРеквизита
					|ПОМЕСТИТЬ ТаблицаИменСвойств
					|ИЗ
					|	&ТаблицаДопРеквизитов КАК ТаблицаДопРеквизитов
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТаблицаИменСвойств.ИмяРеквизита КАК ИмяРеквизита,
					|	НаборыДополнительныхРеквизитов.Свойство КАК Свойство
					|ИЗ
					|	ТаблицаИменСвойств КАК ТаблицаИменСвойств
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитов
					|		ПО ТаблицаИменСвойств.ИмяРеквизита = НаборыДополнительныхРеквизитов.Свойство.Наименование
					|ГДЕ
					|	НаборыДополнительныхРеквизитов.Ссылка = &НаборРеквизитов";

					Запрос.УстановитьПараметр("ТаблицаДопРеквизитов", ТаблицаДопРеквизитов);
					Запрос.УстановитьПараметр("НаборРеквизитов",      РеквизитыВидаНоменклатуры.НаборСвойств);

					ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
					СтруктураПоиска = Новый Структура("ИмяРеквизита");

					Для Каждого СтрокаТаблицы Из ТаблицаСвойств Цикл

						СтруктураПоискаЗначения = Новый Структура("Свойство", СтрокаТаблицы.Свойство);
						МассивСтрок = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(СтруктураПоискаЗначения);
						ОписаниеСвойства = МассивСтрок[0];
						ПутьКДанным = ОписаниеСвойства.ИмяРеквизитаЗначение;

						СтруктураПоиска.ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
						МассивСтрокЗначение = ТаблицаЗначенийРеквизитов.НайтиСтроки(СтруктураПоиска);
						ЗначениеРеквизита = МассивСтрокЗначение[0].ЗначениеОтбора;
						ЭтаФорма[ПутьКДанным] = ЗначениеРеквизита;

					КонецЦикла;

				КонецЕсли;
			КонецЕсли;

		Иначе
			ОбновитьКешРеквизитовВидаНоменклатуры();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
//-- #1305 смарт: Фролов 16.02.2023

#Область Служебные

//++ смарт:ММ #094 411 07.02.2021
&НаСервере
Процедура ДобавитьЭлементыПрограммно()
	
	//++ #1305 смарт: Фролов 15.02.2023 //Отчет Стоимость использования оборудования  
	//НовыйЭлемент = Элементы.Добавить("смартСоответствиеСОбрудованиемИЧерниламиКлиентов", Тип("ПолеФормы"), Элементы.ГруппаЛево);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.смартСоответствиеСОбрудованиемИЧерниламиКлиентов";
    //-- #1305 смарт: Фролов 15.02.2023
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 24.05.2021 15:33:29
	НовыйЭлемент = Элементы.Добавить("смартНаименованиеСайт", Тип("ПолеФормы"), Элементы.ГруппаНаименование);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок="Наименование на сайт";
    НовыйЭлемент.ПутьКДанным = "Объект.смартНаименованиеСайт";
	//Смарт }Подкин Алексей Иванович 24.05.2021 15:33:29
	
	//++ Смарт:  Демичев №875 17.02.2022 ((
	КомандаСинхронизироватьНоменклатуру = Команды.Добавить("смартКомандаСинхронизироватьНоменклатуру");
	КомандаСинхронизироватьНоменклатуру.Действие = "смарт_КомандаСинхронизироватьНоменклатуру";
	КомандаСинхронизироватьНоменклатуру.Заголовок = "Синхронизировать номенклатуру";
	КомандаСинхронизироватьНоменклатуру.Подсказка = "Кнопка регистрирует номенклатуру для синхронизации. Доступна для пользователя с ролью ""Изменение финансовой группы номенклатуры""";
	
	Кнопка = Элементы.Добавить("смартКомандаСинхронизироватьНоменклатуру", Тип("КнопкаФормы"),ЭтаФорма.КоманднаяПанель);
	Кнопка.Заголовок = "Синхронизировать номенклатуру";	
	Кнопка.Картинка = БиблиотекаКартинок.ПланОбмена;
	Кнопка.ИмяКоманды = "смартКомандаСинхронизироватьНоменклатуру";	
	
	Кнопка.Доступность = РольДоступна("ИзменениеФинансовойГруппыНоменклатуры") или РольДоступна("ПолныеПрава");
	//-- Смарт:  Демичев №875 17.02.2022 (( 
	
	//++ #1305 смарт: Фролов 14.02.2023 //Отчет Стоимость использования оборудования  
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК ОборудованиеКлиентов
		|ИЗ
		|	РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
		|ГДЕ
		|	смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром
		|	И смартОборудованиеЧернилаКлиентов.Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		КоличествоОборудования=Выборка.Количество();
		ГруппаИнформацияПоОборудованию = ЭтаФорма.Элементы.Добавить("ГруппаИнформацияПоОборудованию", Тип("ГруппаФормы"),Элементы.ГруппаРаботаСНоменклатурой);
		ГруппаИнформацияПоОборудованию.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаИнформацияПоОборудованию.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаИнформацияПоОборудованию.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаИнформацияПоОборудованию.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		Если КоличествоОборудования=0 ИЛИ КоличествоОборудования>1 Тогда
			НовыйЭлемент5 = ЭтаФорма.Элементы.Добавить("КартинкаВнимание", Тип("ДекорацияФормы"),ГруппаИнформацияПоОборудованию);
			НовыйЭлемент5.Вид = ВидДекорацииФормы.Картинка;
			НовыйЭлемент5.Картинка=БиблиотекаКартинок.Внимание16; 
		КонецЕсли;
		НовыйЭлемент4 = ЭтаФорма.Элементы.Добавить("ТекстОборудование", Тип("ДекорацияФормы"),ГруппаИнформацияПоОборудованию);
		НовыйЭлемент4.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент4.Шрифт=Новый Шрифт(,,Истина,Истина,,);
		Если КоличествоОборудования=0  Тогда
			НовыйЭлемент4.Заголовок = "Не заполнено оборудование клиента"; 
			НовыйЭлемент4.ЦветТекста=WEBцвета.Красный; 
		ИначеЕсли КоличествоОборудования>1  Тогда
			НовыйЭлемент4.Заголовок = "К номенклатуре привязано более одного оборудования клиента"; 
			НовыйЭлемент4.ЦветТекста=WEBцвета.Красный; 
		Иначе
			НовыйЭлемент4.Заголовок = "Оборудование заполнено"; 
			НовыйЭлемент4.ЦветТекста=WEBцвета.Зеленый; 
		КонецЕсли;	
	КонецЕсли;
    //-- #1305 смарт: Фролов 14.02.2023
	
	//++ #Б2736 смарт: Шляпников 21.03.2025 / Конструктор КП. - Привязка справочника "Номенклатура" к справочнику "Конструктор оборудования".
	Страница = Элементы.Добавить("смартСтраницаКонструкторОборудования", Тип("ГруппаФормы"), Элементы.СтраницыКарточкаНоменклатуры);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = "Связь с конструктором";
	
	//++ #Б-3618 смарт: Фролов 24.06.2025 //Ошибка. Доступ к закладке "Связь с конструктором" в справочнике Номенклатура. 
	Страница.Видимость = Пользователи.РолиДоступны("смартДобавлениеИзменениеНСИВSMARTКонструкторе"); 
	//-- #Б-3618 смарт: Фролов 24.06.2025
	
	смартКонструктор = ПолучитьКонструкторОборудованияСвязанныйСТекущейНоменклатурой();
	
	Элемент = Элементы.Добавить("смартСсылкаНаКонструктор", Тип("ДекорацияФормы"), Страница);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = ?(НЕ ЗначениеЗаполнено(смартКонструктор),
						  "Связать с конструктором",
						  СтрШаблон("Номенклатура связана с конструктором : %1", смартКонструктор));
	Элемент.Гиперссылка = Истина;
	Элемент.Подсказка = ?(НЕ ЗначениеЗаполнено(смартКонструктор),
						  "Создать новый элемент Конструктора оборудования и установить с ним связь",
						  СтрШаблон("Открыть : %1", смартКонструктор));
	Элемент.УстановитьДействие("Нажатие", "ПриНажатииНаСсылкуСвязиСКонструктором");
	
	Группа = Элементы.Добавить("смартГруппаДополнительныеРеквизитыКонструктора", Тип("ГруппаФормы"), Страница);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("смартБаза", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартБаза";
	
	НовыйЭлемент = Элементы.Добавить("смартТипПечатающейГоловки", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартТипПечатающейГоловки";
	
	НовыйЭлемент = Элементы.Добавить("смартКоличествоПечатающихГоловок", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартКоличествоПечатающихГоловок";
	
	НовыйЭлемент = Элементы.Добавить("смартLEDБлок", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартLEDБлок";
	
	НовыйЭлемент = Элементы.Добавить("смартПодъемПортала", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартПодъемПортала";
	
	НовыйЭлемент = Элементы.Добавить("смартОбратныйВакуум", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартОбратныйВакуум";
	
	НовыйЭлемент = Элементы.Добавить("смартМагнитныйЛинейныйДвигатель", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартМагнитныйЛинейныйДвигатель";
	
	НовыйЭлемент = Элементы.Добавить("смартДополнительныйПриставнойСтол", Тип("ПолеФормы"), Группа);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартДополнительныйПриставнойСтол";
	//-- #Б2736 смарт: Шляпников 21.03.2025

	//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
	ГруппаМаркировка = смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаМаркировка", Элементы.КодТНВЭД.Родитель, 3,,,, "КодТНВЭД");
	ЭтаФорма.Элементы.Переместить(Элементы.КодТНВЭД, ГруппаМаркировка);
	
	ЭлементКартинка = смартФормированиеИнтерфейса.СздДекорацияКартинка(ЭтаФорма, "смартПризнакМаркировкаЭксперимент", ГруппаМаркировка, "смартЧестныйЗнак");
	ЭлементКартинка.Видимость = Ложь;
	ЭлементКартинка.Ширина = 2;
	ЭлементКартинка.Высота = 1;
	ЭлементКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементКартинка = смартФормированиеИнтерфейса.СздДекорацияКартинка(ЭтаФорма, "смартПризнакМаркировкаОбязательно", ГруппаМаркировка, "смартЧестныйЗнак32");
	ЭлементКартинка.Видимость = Ложь;
	ЭлементКартинка.Ширина = 2;
	ЭлементКартинка.Высота = 1;
	ЭлементКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
	//-- #Б4670 смарт: Шляпников 21.10.2025
	
	//++ #Б-6304 смарт: Фролов 02.04.2026 //Создать новый реквизит в карточке товаров
	НовыйЭлемент = Элементы.Добавить("смартВозможенВозвратаБракаПочтой", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаСведенияОПроизводителе);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартВозможенВозвратаБракаПочтой";
	//-- #Б-6304 смарт: Фролов 02.04.2026
	
	//++ #6416 смарт: Тимофеева 08.04.2026 / Справочник Номенклатура. Ввод таможенного описания.
	Элементы.СворачиваемаяГруппаКлассификаторы.РастягиватьПоВертикали = Ложь;
	НовыйЭлемент = Элементы.Добавить("смартТаможенноеОписание", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаКлассификаторы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартТаможенноеОписание";
	НовыйЭлемент.МногострочныйРежим = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	НовыйЭлемент.Высота = 3; 
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "НачалоВыбораТаможенногоОписания");
	//-- #6416 смарт: Тимофеева 08.04.2026
	
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	События = Новый Структура;
	События.Вставить("ПриИзменении", "смартОбязательнаяМаркировкаПриИзменении");
	
	Свойства = Новый Структура;
	Свойства.Вставить("Доступность", Пользователи.РолиДоступны("смартДобавлениеИзменениеПризнакаМаркировкиНоменклатуры"));
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартОбязательнаяМаркировка", "СворачиваемаяГруппаДополнительныеРеквизиты",, 2, "Объект.смартОбязательнаяМаркировка", Свойства, События);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартДатаНачалаОбязательнойМаркировки", "СворачиваемаяГруппаДополнительныеРеквизиты",, 1, "Объект.смартДатаНачалаОбязательнойМаркировки", Свойства);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартПроверкаПроведенаМаркировкаНеТребуется", "СворачиваемаяГруппаДополнительныеРеквизиты",, 2, "Объект.смартПроверкаПроведенаМаркировкаНеТребуется", Свойства, События);
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
	//++ #Б6848 смарт: Шляпников 12.05.2026 / Справочник "Номенклатура". Создать реквизит "Модельный ряд"
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартМодельныйРяд", "СворачиваемаяГруппаОсновныеПараметрыУчета",, 1, "Объект.смартМодельныйРяд");
	//-- #Б6848 смарт: Шляпников 12.05.2026
	
	//++ #Б-7288 смарт: Фролов 02.07.2026 //Справочник "Модельные ряды". Сделать иерархическим.
	//++ #Б-7258 смарт: Фролов 29.06.2026 //CRM. Конверсия демонстраций
	//смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартГруппаОборудования", "СворачиваемаяГруппаОсновныеПараметрыУчета",, 1, "Объект.смартГруппаОборудования",,, "ГруппаДоступа");
	//-- #Б-7258 смарт: Фролов 29.06.2026
	//-- #Б-7288 смарт: Фролов 02.07.2026
	
	//++ #7954 смарт: Тимофеева 24.08.2026 / Справочник Номенклатура. Признак "Классификация номенклатуры"
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартКлассификацияНоменклатуры", "СворачиваемаяГруппаОсновныеПараметрыУчета",, 1, "Объект.смартКлассификацияНоменклатуры");
	//-- #7954 смарт: Тимофеева 24.08.2026
КонецПроцедуры //-- смарт:ММ 07.02.2021

//++ смарт:КМД #3_2 501 13.06.2021
&НаСервере
Процедура смарт_ДобавитьЭлементыПрограммноОборачиваемость()
	//реквизиты формы
	ДобавляемыеРеквизиты = Новый Массив;
	Реквизит_НеликвидS = Новый РеквизитФормы("НеликвидS", Новый ОписаниеТипов("Булево"),, "Неликвид S");
	ДобавляемыеРеквизиты.Добавить(Реквизит_НеликвидS);
	Реквизит_НеликвидSПлюс = Новый РеквизитФормы("НеликвидSПлюс", Новый ОписаниеТипов("Булево"),, "Неликвид S+");
	ДобавляемыеРеквизиты.Добавить(Реквизит_НеликвидSПлюс);
	Реквизит_ИзмененоВручную = Новый РеквизитФормы("ИзмененоВручную", Новый ОписаниеТипов("Булево"),, "Изменено вручную");
	ДобавляемыеРеквизиты.Добавить(Реквизит_ИзмененоВручную);
	// Добавим новые реквизиты в форму
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//добавляем в дополнительные реквизиты
	ГруппаОборачиваемость = Элементы.Добавить("смартГруппаОборачиваемость", Тип("ГруппаФормы"), Элементы.ГруппаЛево);
	ГруппаОборачиваемость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОборачиваемость.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаОборачиваемость.ОтображатьЗаголовок = Истина; 
	ГруппаОборачиваемость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//ГруппаОборачиваемость.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ГруппаОборачиваемость.Заголовок = "Оборачиваемость (неликвиды)";
	
	ГруппаОборачиваемостьИнформация = Элементы.Добавить("смартГруппаОборачиваемостьИнформация", Тип("ГруппаФормы"), ГруппаОборачиваемость);
	ГруппаОборачиваемостьИнформация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОборачиваемостьИнформация.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОборачиваемостьИнформация.ОтображатьЗаголовок = Ложь; 
	ГруппаОборачиваемостьИнформация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	//информационные флажки
	НовыйЭлемент = Элементы.Добавить("НеликвидS", Тип("ПолеФормы"), ГруппаОборачиваемостьИнформация);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "НеликвидS";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Добавить("НеликвидSПлюс", Тип("ПолеФормы"), ГруппаОборачиваемостьИнформация);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "НеликвидSПлюс";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Добавить("ИзмененоВручную", Тип("ПолеФормы"), ГруппаОборачиваемостьИнформация);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "ИзмененоВручную";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	//кнопки
	ГруппаОборачиваемостьКнопки = Элементы.Добавить("смартГруппаОборачиваемостьКнопки", Тип("ГруппаФормы"), ГруппаОборачиваемость);
	ГруппаОборачиваемостьКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОборачиваемостьКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОборачиваемостьКнопки.ОтображатьЗаголовок = Ложь; 
	ГруппаОборачиваемостьКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	КомандаВключитьВНеликвиды = Команды.Добавить("смартВключитьВНеликвиды");
	КомандаВключитьВНеликвиды.Действие = "смарт_ВключитьВНеликвиды";
	КомандаВключитьВНеликвиды.Заголовок = "Включить в неликвиды";
	КомандаВключитьВНеликвиды.Подсказка = "Включить в неликвиды вручную";
	
	Кнопка = Элементы.Добавить("смартВключитьВНеликвиды", Тип("КнопкаФормы"), ГруппаОборачиваемостьКнопки);
	Кнопка.Заголовок = "Включить в неликвиды";
	//Кнопка.Подсказка = "Включить в неликвиды вручную";
	Кнопка.ИмяКоманды = "смартВключитьВНеликвиды";
	
	КомандаИсключитьИзНеликвидов = Команды.Добавить("смартИсключитьИзНеликвидов");
	КомандаИсключитьИзНеликвидов.Действие = "смарт_ИсключитьИзНеликвидов";
	КомандаИсключитьИзНеликвидов.Заголовок = "Исключить из неликвидов";
	КомандаИсключитьИзНеликвидов.Подсказка = "Исключить из неликвидов вручную";
	
	Кнопка = Элементы.Добавить("смартИсключитьИзНеликвидов", Тип("КнопкаФормы"), ГруппаОборачиваемостьКнопки);
	Кнопка.Заголовок = "Исключить из неликвидов";
	//Кнопка.Подсказка = "Исключить из неликвидов вручную";
	Кнопка.ИмяКоманды = "смартИсключитьИзНеликвидов";
	
	НовыйЭлемент = Элементы.Добавить("смартОбязательноеНаличие", Тип("ПолеФормы"), ГруппаОборачиваемость);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартОбязательноеНаличие";
КонецПроцедуры

//++ #Б2028 смарт: Шляпников 11.02.2025 / Заявка на разборку оборудования. Формирование нового узла номенклатуры (результат разборки).
Процедура смарт_ДобавитьЭлементыПрограммноРазобранноеОборудование()
	
	Если НЕ ЗначениеЗаполнено(Объект.смартРазобранноеОборудование) Тогда
		Возврат;
	КонецЕсли;
	
	Страница = Элементы.Добавить("смартГруппаИнформацияОРазобранномОборудовании", Тип("ГруппаФормы"), Элементы.СтраницыКарточкаНоменклатуры);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = "Информация о разобранном оборудовании";
	Страница.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Добавить("смартРазобранноеОборудование", Тип("ПолеФормы"), Страница);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудование";
	НовыйЭлемент.Заголовок = "Оборудование-источник";
	
	НовыйЭлемент = Элементы.Добавить("смартРазобранноеОборудованиеИдентификаторУзла", Тип("ПолеФормы"), Страница);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеИдентификаторУзла";
	НовыйЭлемент.Заголовок = "Идентификатор узла";
	
	Таблица = Элементы.Добавить("смартСнятыеКомплектующие", Тип("ТаблицаФормы"), Страница);
	Таблица.ПутьКДанным = "Объект.смартСнятыеКомплектующие";
	Таблица.Заголовок = "Снятые комплектующие";
	Таблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Таблица.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	
	НовыйЭлемент = Элементы.Добавить("смартСнятыеКомплектующиеНоменклатураАртикул", Тип("ПолеФормы"), Таблица);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСнятыеКомплектующие.Номенклатура.Артикул";
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("смартСнятыеКомплектующиеНоменклатура", Тип("ПолеФормы"), Таблица);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСнятыеКомплектующие.Номенклатура";
	
	НовыйЭлемент = Элементы.Добавить("смартСнятыеКомплектующиеКоличество", Тип("ПолеФормы"), Таблица);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартСнятыеКомплектующие.Количество";
	
КонецПроцедуры

//++ #Б2736 смарт: Шляпников 21.03.2025 / Конструктор КП. - Привязка справочника "Номенклатура" к справочнику "Конструктор оборудования".
Функция ПолучитьКонструкторОборудованияСвязанныйСТекущейНоменклатурой()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартКонструкторОборудования
	|ГДЕ
	|	Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
&НаСервере
Процедура УстановитьВидимостьПолейМаркировки()
	
	Если смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(ТекущаяДата()) Тогда
		
		Элементы.смартПризнакМаркировкаЭксперимент.Видимость = смартМаркировка.НоменклатураПодлежитЭксперементальнойМаркировке(Объект);
		Элементы.смартПризнакМаркировкаОбязательно.Видимость = смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(Объект);
		
	Иначе
		
		Элементы.смартПризнакМаркировкаЭксперимент.Видимость = Ложь;
		Элементы.смартПризнакМаркировкаОбязательно.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.смартДатаНачалаОбязательнойМаркировки.ТолькоПросмотр = НЕ Объект.смартОбязательнаяМаркировка;
	Элементы.смартОбязательнаяМаркировка.ТолькоПросмотр = Объект.смартПроверкаПроведенаМаркировкаНеТребуется;
	Элементы.смартПроверкаПроведенаМаркировкаНеТребуется.ТолькоПросмотр = Объект.смартОбязательнаяМаркировка;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВидНоменклатурыПриИзмененииНастройкаФормы")
//++ #Б-5692 смарт: Фролов 25.02.2026 //Номенклатура. Реквизит Дата начала серийного учета.
Процедура смарт_ВидНоменклатурыПриИзмененииНастройкаФормы()

	ВидНоменклатурыПриИзмененииНаСервере();
	НастроитьФормуИОбновитьКарточку();
	
	#Вставка
	//++ #Б-5692 смарт: Фролов 25.02.2026 //Номенклатура. Реквизит Дата начала серийного учета.
	Если НЕ Объект.ВидНоменклатуры.ИспользоватьСерии Тогда
		
		Если ЗначениеЗаполнено(Объект.смартДатаНачалаСерийногоУчетаВременная) Тогда
			
			Объект.смартДатаНачалаСерийногоУчетаВременная = Неопределено;
			
		КонецЕсли;
		
		Элементы.смартДатаНачалаСерийногоУчетаВременная.ТолькоПросмотр = НЕ Пользователи.ЭтоПолноправныйПользователь(Пользователи.АвторизованныйПользователь());
		
	Иначе
		
		Элементы.смартДатаНачалаСерийногоУчетаВременная.ТолькоПросмотр = Ложь;
		
	КонецЕсли;	
	//-- #Б-5692 смарт: Фролов 25.02.2026
	#КонецВставки

КонецПроцедуры //-- #Б-5692 смарт: Фролов 25.02.2026

//++ #6416 смарт: Тимофеева 08.04.2026 / Справочник Номенклатура. Ввод таможенного описания.
&НаКлиенте
Процедура НачалоВыбораТаможенногоОписания(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Объект.смартТаможенноеОписание = Элемент.ТекстРедактирования Тогда
		Объект.смартТаможенноеОписание = Элемент.ТекстРедактирования;
		Модифицированность = Истина;
	КонецЕсли;
	
	МассивТаможенныхОписаний = ПолучитьВозможныеТаможенныеОписания(Объект.Ссылка);
	Если МассивТаможенныхОписаний.Количество() > 0 Тогда
		СписокВариантов = Новый СписокЗначений;
		СписокВариантов.ЗагрузитьЗначения(МассивТаможенныхОписаний);
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораТаможенногоОписания", ЭтотОбъект);
			
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗначенияДляВыбора", СписокВариантов);
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Выбор описания из предварительных таможенных деклараций'"));
			
		ОткрытьФорму(
				"ОбщаяФорма.ВыборЗначенияИзСписка",
				ПараметрыОткрытия,
				ЭтаФорма,
				Новый УникальныйИдентификатор(),
				,
				,
				ОписаниеОповещенияОЗакрытии,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбор описания из предварительных таможенных деклараций: Нет данных для выбора!");			
	КонецЕсли;	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьВозможныеТаможенныеОписания(Номенклатура)
   	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартПредварительнаяТаможеннаяДекларацияИмпортТовары.ОписаниеПоДекларации КАК ОписаниеПоДекларации
	|ИЗ
	|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт.Товары КАК смартПредварительнаяТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	смартПредварительнаяТаможеннаяДекларацияИмпортТовары.Номенклатура = &Номенклатура"; 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОписаниеПоДекларации");
КонецФункции

&НаКлиенте
Процедура ПослеВыбораТаможенногоОписания(ТаможенноеОписание, ДополнительныеПараметры) Экспорт 
	Если НЕ ТаможенноеОписание = Неопределено 
		И НЕ Объект.смартТаможенноеОписание = ТаможенноеОписание Тогда
		Объект.смартТаможенноеОписание = ТаможенноеОписание;
		Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры
//-- #6416 смарт: Тимофеева 08.04.2026 

&НаКлиенте
Процедура смартОбязательнаяМаркировкаПриИзменении(Элемент)
	
	УстановитьВидимостьПолейМаркировки();
	
КонецПроцедуры

#КонецОбласти