
#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ УПРАВЛЕНИЯ ДОСТУПОМ - ГРУППЫ ДОСТУПА

// Процедура ОписанияНачальногоЗаполненияПрофилейГруппДоступа возвращает
// массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
//  Пустая структура может быть получена при помощи функции
// УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа().
//
//  Для автоматической подготовки содержимого процедуры следует
// воспользоваться инструментами разработчика для подсистемы
// Управление доступом.
//
Процедура ОписанияНачальногоЗаполненияПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

#Область Описание_профиля_CRM_Маркетолог
	
	// Дополнительные права CRM для профиля "Маркетолог"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя			  = "CRM_Маркетолог";
	ОписаниеПрофиля.Идентификатор = "8ba9f6d2-d614-4b16-b7a9-f1e0a20a947c";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Маркетолог CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализКлиентскойБазы");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПродажИВзаиморасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеИнтересов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПроведениеЭлектронныхРассылок");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПроведениеТелемаркетинга");
	ОписаниеПрофиля.Роли.Добавить("CRM_ИмпортИзФайлов");
	ОписаниеПрофиля.Роли.Добавить("CRM_УправлениеМаркетингом");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеЗаявок");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ");
	
	// Виды доступа.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Маркетолог""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_МенеджерПоЗакупкам
	
	// Дополнительные права CRM для профиля "МенеджерПоЗакупкам"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_МенеджерПоЗакупкам";
	ОписаниеПрофиля.Идентификатор = "387e4daf-cf84-42a5-b9b2-87e605291b30";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по закупкам CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализКлиентскойБазы");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПродажИВзаиморасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеИнтересов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеЗаявок");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	
	// Виды доступа.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации","ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Менеджер по закупкам""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_МенеджерПоПродажам
	
	// Дополнительные права CRM для профиля "МенеджерПоПродажам"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_МенеджерПоПродажам";
	ОписаниеПрофиля.Идентификатор = "9b3d6c1a-6c15-4ea9-a8fd-25b82ef2e24e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализКлиентскойБазы");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПродажИВзаиморасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеИнтересов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеЗаявок");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	
	// Виды доступа
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Менеджер по продажам""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_РуководительОтделаПродаж
	
	// Дополнительные права CRM для профиля "РуководительОтделаПродаж"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_РуководительОтделаПродаж";
	ОписаниеПрофиля.Идентификатор = "0cbb9ec5-d584-4d0b-9951-28025d282876";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководитель отдела продаж CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализКлиентскойБазы");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПродажИВзаиморасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеИнтересов");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ИмпортИзФайлов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПланироватьПоВсемПодразделениямМенеджерам");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеЗаявок");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПросмотрЗадачДругихПользователейВКалендаре");
	
	// Виды доступа
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Руководитель отдела продаж""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_МенеджерПоУправлениюЗапасами
	
	// Описание для заполнения профиля "CRM_МенеджерПоУправлениюЗапасами".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_МенеджерПоУправлениюЗапасами";
	ОписаниеПрофиля.Идентификатор = "7a816d03-40b7-4417-9f3b-3f13882536ae";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по управлению запасами CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Виды доступа.
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Менеджер по управлению запасами""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ОтветственныйЗаВедениеПартнеров
	
	// Дополнительные права CRM для профиля "ОтветственныйЗаВедениеПартнеров"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ОтветственныйЗаВедениеПартнеров";
	ОписаниеПрофиля.Идентификатор = "ea0eb770-fb5c-4722-9fd8-d96d00b19fcc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение партнеров CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Ответственный за ведение партнеров (дополнительный)""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ОтветственныйЗаВедениеВзаимодействий
	
	// Дополнительные права CRM для профиля "ОтветственныйЗаВедениеВзаимодействий"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ОтветственныйЗаВедениеВзаимодействий";
	ОписаниеПрофиля.Идентификатор = "0428916e-7c53-4db3-bbff-00161769ed7c";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение взаимодействий CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализКлиентскойБазы");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("CRM_Модуль_ДобавлениеИзменениеВзаимодействий");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, включает в себя права подсистемы CRM
	                                      | для типового профиля ""Ответственный за ведение взаимодействий""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_БазовыеПрава
	
	// Базовые права CRM
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_БазовыеПрава";
	ОписаниеПрофиля.Идентификатор = "58e53e7b-c92a-11eb-b061-d8cb8a9963f5";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Базовые права CRM (дополнительный)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Включает в себя базовые права CRM'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_БазовыеПраваНастройка
	
	// Базовые права и настройка подсистемы CRM
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_БазовыеПраваНастройка";
	ОписаниеПрофиля.Идентификатор = "19353826-8780-45c4-9e66-8825debcb7ac";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Настройка CRM (дополнительный)'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_НастройкаПрограммы");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Включает в себя базовые права CRM и права на настройку
	                                      | подсистемы CRM'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ВсеРолиCRM
	
	// Все роли CRM (служебный)!
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ВсеРолиCRM";
	ОписаниеПрофиля.Идентификатор = "e0baa83b-eda3-4238-8158-3721ef09e21b";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'ВСЕ РОЛИ CRM (СЛУЖЕБНЫЙ)'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АдминистрированиеБазыЗнаний");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализКлиентскойБазы");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПродажИВзаиморасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПроектов");
	ОписаниеПрофиля.Роли.Добавить("CRM_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("CRM_Модуль_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("CRM_ВводДокументаОтчетПоРаботам");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_НастройкаПрограммы");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеИнтересов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеТегов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ИмпортИзФайлов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ИнтеграцияQlikSense");
	ОписаниеПрофиля.Роли.Добавить("CRM_ОбменСMSOutlook_MSExchange");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПередачаДелОтветственному");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПланироватьПоВсемПодразделениямМенеджерам");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПроведениеТелемаркетинга");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПроведениеЭлектронныхРассылок");
	ОписаниеПрофиля.Роли.Добавить("CRM_СозданиеОбщихШаблоновДокументов");
	ОписаниеПрофиля.Роли.Добавить("CRM_УправлениеМаркетингом");
	ОписаниеПрофиля.Роли.Добавить("CRM_УправлениеПроектами");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеЗаявок");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ");
	ОписаниеПрофиля.Роли.Добавить("CRM_ПросмотрЗадачДругихПользователейВКалендаре");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Данный профиль включает в себя ВСЕ роли подсистемы CRM
	                                      |Внимание! Это служебный профиль. Используйте его только
										  |в случае проблем с правами CRM и только временно!'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ИмпортИзФайлов
	
	// Импорт клиентов и номенклатуры из внешних файлов
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ИмпортИзФайлов";
	ОписаниеПрофиля.Идентификатор = "3981f152-ea76-4c2c-a265-411b5cf6d080";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Импорт из файлов (дополнительный)'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_ИмпортИзФайлов");
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет использовать обработку загрузки клиентов 
	                                      |и номенклатуры из внешних файлов'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ОтправкаSMS
	
	// Отправление SMS-сообщений
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ОтправкаSMS";
	ОписаниеПрофиля.Идентификатор = "96b44c51-cbf2-414e-aaa3-71802a3a56a2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Отправка SMS (дополнительный)'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет отправлять SMS-сообщения'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_УправлениеБизнесПроцессами
	
	// Управление бизнес-процессами
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_УправлениеБизнесПроцессами";
	ОписаниеПрофиля.Идентификатор = "997d5d2d-c634-4585-89b5-834e4a0a127f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление бизнес процессами'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_УправлениеБизнесПроцессами");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Используется для настройки механизма бизнес-процессов'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_УправлениеПроектами
	
	// Управление проектами
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_УправлениеПроектами";
	ОписаниеПрофиля.Идентификатор = "763b2be5-1b4d-470e-8914-6c2ee51b45eb";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление проектами'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_АнализПроектов");
	ОписаниеПрофиля.Роли.Добавить("CRM_УправлениеПроектами");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление проектами и анализ'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ОбменСMSOutlook_MSExchange
	
	// Обмен с MS Outlook
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ОбменСMSOutlook_MSExchange";
	ОписаниеПрофиля.Идентификатор = "fcb9665c-758b-46a6-b480-6ae0319ebc71";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Обмен с MS Outlook и MS Exchange'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_ОбменСMSOutlook_MSExchange");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет выполнять обмены с MS Outlook и MS Exchange'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ПередачаДелОтветственному
	
	// Описание для заполнения профиля "ПередачаДелОтветственному".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ПередачаДелОтветственному";
	ОписаниеПрофиля.Идентификатор = "cc5239e2-9f67-48e4-99fb-4cdfc5b437ee";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Передача дел ответственному (дополнительный)'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_ПередачаДелОтветственному");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет перенаправлять документы, бизнесс-процессы 
										|и задачи новому ответсвенному, игнорируя права доступа'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_СозданиеОбщихШаблоновДокументов
	
	// Описание для заполнения профиля "CRM_СозданиеОбщихШаблоновДокументов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_СозданиеОбщихШаблоновДокументов";
	ОписаниеПрофиля.Идентификатор = "add31367-c272-48d6-b3aa-357a9459acbb";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Создание общих шаблонов документов CRM'");
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_СозданиеОбщихШаблоновДокументов");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет создавать общие шаблоны документов 
										|(управление флагом ""Общие"" для справочника ""Шаблоны документов"").'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_АдминистрированиеБазыЗнаний
	
	// Описание для заполнения профиля "Администрирование базы знаний".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_АдминистрированиеБазыЗнаний";
	ОписаниеПрофиля.Идентификатор = "144f3af0-6986-4999-9226-1b69c5db31fc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администрирование базы знаний (CRM)'");
	
	// Перечень доступных ролей
	ОписаниеПрофиля.Роли.Добавить("CRM_АдминистрированиеБазыЗнаний");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Администрирование базы знаний'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_УправлениеМаркетингом
	
	// Описание для заполнения профиля "Управление маркетингом".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_УправлениеМаркетингом";
	ОписаниеПрофиля.Идентификатор = "68e6a57e-a13b-434c-8a06-6e05dc2ae7dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление маркетингом (CRM)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	ОписаниеПрофиля.Роли.Добавить("CRM_УправлениеМаркетингом");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление маркетингом'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_Интеграция_с_Qlik_Sense
	
	// Описание для заполнения профиля "Интеграция с Qlik Sense".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "CRM_ИнтеграцияQlikSense";
	ОписаниеПрофиля.Идентификатор = "aa1ff40c-51a8-11e7-86ac-50e549caad4a";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Интеграция с сервисом визуализации данных Qlik Sense'");
	
	// Перечень доступных ролей
	ОписаниеПрофиля.Роли.Добавить("CRM_ИнтеграцияQlikSense");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Интеграция с сервисом визуализации данных Qlik Sense'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_ВнешнийПользовательДляАнкетирования
	
	Если ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрофилиГруппДоступа.CRM_ВнешнийПользовательДляАнкетирования")<>Неопределено Тогда
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Имя           = "CRM_ВнешнийПользовательДляАнкетирования";
		ОписаниеПрофиля.Идентификатор = "73ffc4f2-b09f-460f-ac9a-2d7bdd900873";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Внешний пользователь (для анкетирования)'");
		ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
		
		// Описание поставляемого профиля.
		ОписаниеПрофиля.Описание = НСтр("ru = 'Предназначен для пользователей, которые участвуют в анкетировании/опросах посредством внешнего доступа.'");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	КонецЕсли;
	
#КонецОбласти

#Область Описание_профиля_Добавление_Изменение_Должностей
	
	// Описание для заполнения профиля "CRM_ВнешнийПользовательДляАнкетирования".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "5739e1b2-a006-4a25-aeec-46e61e9b8456";
	ОписаниеПрофиля.Наименование  = "Добавление и изменение должностей";
	ОписаниеПрофиля.Имя 		  = "CRM_ДобавлениеИзменениеДолжностей";
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_ДобавлениеИзменениеДолжностей");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Набор ролей для пользователей, которые могут изменять должности и проекты.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_РазрешитьСохранениеКЛБезКИ
	
	// Описание для заполнения профиля "CRM_РазрешитьСохранениеКЛБезКИ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "1ea2bb1b-9d76-4118-9cdd-0200b9b3501a";
	ОписаниеПрофиля.Наименование  = "Сохранение контактных лиц без контактной информации";
	ОписаниеПрофиля.Имя 		  = "CRM_РазрешитьСохранениеКЛБезКИ";
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСохранениеКЛБезКИ");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Набор ролей для пользователей, которые могут  сохранять контактных лиц без контактной информации.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_CRM_РазрешитьСозданиеИнтересаБезКЛ
	
	// Описание для заполнения профиля "CRM_РазрешитьСозданиеИнтересаБезКЛ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "9058edc1-290c-4509-bb71-a18820a7669e";
	ОписаниеПрофиля.Наименование  = "Создание интересов без указания контактного лица";
	ОписаниеПрофиля.Имя 		  = "CRM_РазрешитьСозданиеИнтересаБезКЛ";
	
	// Роли
	ОписаниеПрофиля.Роли.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Набор ролей для пользователей, которые могут создавать интересы без указания контактного лица.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

КонецПроцедуры // ОписанияНачальногоЗаполненияПрофилейГруппДоступа()

// Служебная фунция
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("CRM_Модуль_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("CRM_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("CRM_ВводДокументаОтчетПоРаботам");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты","ВначалеВсеРазрешены");
	
КонецПроцедуры

// Процедура создает элементы справочника ГруппыДоступа на основании элементов справочника ПрофилиГруппДоступа.
//
Процедура СоздатьЭлементыСправочникаГруппыДоступа() Экспорт 
	
	СписокПрофилейГруппДоступа = Новый СписокЗначений();
	
	// Продажи
	СписокПрофилейГруппДоступа.Добавить("CRM_Маркетолог",							НСтр("ru = 'Маркетологи CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_МенеджерПоЗакупкам",					НСтр("ru = 'Менеджеры по закупкам CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_МенеджерПоПродажам",					НСтр("ru = 'Менеджеры по продажам CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_МенеджерПоУправлениюЗапасами",			НСтр("ru = 'Менеджеры по управлению запасами CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_РуководительОтделаПродаж",				НСтр("ru = 'Руководители отдела продаж CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("УправлениеМаркетингом",					НСтр("ru = 'Управление маркетингом'"));
	
	// Дополнительные
	СписокПрофилейГруппДоступа.Добавить("CRM_БазовыеПрава",							НСтр("ru = 'Базовые права CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ОтветственныйЗаВедениеВзаимодействий",	НСтр("ru = 'Ответственный за ведение взаимодействий CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ОтветственныйЗаВедениеПартнеров",		НСтр("ru = 'Ответственный за ведение партнеров CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_АдминистрированиеБазыЗнаний",			НСтр("ru = 'Администрирование базы знаний'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ИмпортИзФайлов",						НСтр("ru = 'Импорт из файлов'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ОбменСMSOutlook_MSExchange",			НСтр("ru = 'Обмен с MS Outlook и MS Exchange'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ОтправкаSMS",							НСтр("ru = 'Отправка SMS'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_УправлениеБизнесПроцессами",			НСтр("ru = 'Управление бизнес процессами'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_УправлениеПроектами",					НСтр("ru = 'Управление проектами'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ПередачаДелОтветственному",			НСтр("ru = 'Передача дел ответственному CRM (дополнительный)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_СозданиеОбщихШаблоновДокументов", 		НСтр("ru = 'Создание общих шаблонов документов CRM'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_УправлениеМаркетингом",				НСтр("ru = 'Управление маркетингом (CRM)'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ДобавлениеИзменениеДолжностей",		НСтр("ru='Добавление и изменение должностей'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_РазрешитьСохранениеКЛБезКИ",			НСтр("ru='Сохранение контактных лиц без контактной информации'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_РазрешитьСозданиеИнтересаБезКЛ",		НСтр("ru='Создание интересов без указания контактного лица'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ВнешнийПользовательДляАнкетирования",	НСтр("ru='Внешние пользователи (для анкетирования)';en='External users (for questionnaires)'"));
	
	// Типовые профили
	СписокПрофилейГруппДоступа.Добавить("ОтветственныйЗаВедениеНоменклатуры",	НСтр("ru = 'Ответственный за ведение номенклатуры (дополнительный)';
										|en = 'Employee responsible for products (additional)'"));
	СписокПрофилейГруппДоступа.Добавить("МенеджерПоПродажам",	НСтр("ru = 'Менеджер по продажам';
										|en = 'Sales representative'"));
	СписокПрофилейГруппДоступа.Добавить("РуководительОтделаПродаж",	НСтр("ru = 'Руководитель отдела продаж';
										|en = 'Sales Director'"));
	СписокПрофилейГруппДоступа.Добавить("МенеджерПоЗакупкам",	НСтр("ru = 'Менеджер по закупкам';
										|en = 'Chief procurement officer'"));
	СписокПрофилейГруппДоступа.Добавить("УчастникСогласованияУсловийПродаж",	НСтр("ru = 'Участник согласования условий продаж (дополнительный)';
										|en = 'Employee approving sales conditions (additional)'"));
	СписокПрофилейГруппДоступа.Добавить("УчастникСогласованияЦенНоменклатуры",	НСтр("ru = 'Участник согласования цен номенклатуры (дополнительный)';
										|en = 'Employee approving product prices (additional)'"));
	СписокПрофилейГруппДоступа.Добавить("ОтветственныйЗаВедениеНоменклатуры",	НСтр("ru = 'Ответственный за ведение номенклатуры (дополнительный)';
										|en = 'Employee responsible for products (additional)'"));
	СписокПрофилейГруппДоступа.Добавить("ОтветственныйЗаВедениеВзаимодействий",	НСтр("ru = 'Ответственный за ведение взаимодействий (дополнительный)';
										|en = 'Employee responsible for interactions (additional)'"));
	СписокПрофилейГруппДоступа.Добавить("ОтветственныйЗаВедениеПартнеров",	НСтр("ru = 'Ответственный за ведение партнеров (дополнительный)';
										|en = 'Employee responsible for partners (additional)'"));
	
	Для Каждого ЭлементСписка Из СписокПрофилейГруппДоступа Цикл
		Попытка		Профиль = Справочники.ПрофилиГруппДоступа[ЭлементСписка.Значение];
		Исключение	Продолжить;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ЭлементСписка.Представление) Тогда
			Наименование = ЭлементСписка.Представление;
		Иначе
			Наименование = Профиль.Наименование;
		КонецЕсли;
		
		ГруппаСсылка = Справочники.ГруппыДоступа.НайтиПоРеквизиту("Профиль", Профиль);
		Если ЗначениеЗаполнено(ГруппаСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаОбъект.Наименование = Наименование;
		ГруппаОбъект.Профиль	  = Профиль;
		ОбновитьСоставВидовДоступа(ГруппаОбъект, Профиль);
		ГруппаОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры //СоздатьЭлементыСправочникаГруппыДоступа

// Дополняет все профили групп доступа переданными ролями.
//
Процедура ДополнитьПрофилиГруппДоступаРолями(СписокРолей) Экспорт
	
	ОбязательныеРоли = Новый СписокЗначений;
	Для каждого Роль из СписокРолей Цикл
		Идентификатор = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", Роль.Значение);
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ОбязательныеРоли.Добавить(Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПрофилиГруппДоступа.Ссылка КАК Ссылка,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрофилиГруппДоступаРоли.Роль) КАК Роль
	                      |ПОМЕСТИТЬ ПрофилиТемп
	                      |ИЗ
	                      |	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	                      |		ПО (ПрофилиГруппДоступаРоли.Ссылка = ПрофилиГруппДоступа.Ссылка)
	                      |			И (ПрофилиГруппДоступаРоли.Роль В (&ОбязательныеРоли))
	                      |ГДЕ
	                      |	НЕ ПрофилиГруппДоступа.ЭтоГруппа
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПрофилиГруппДоступа.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПрофилиТемп.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	ПрофилиТемп КАК ПрофилиТемп
	                      |ГДЕ
	                      |	ПрофилиТемп.Роль < &КоличествоРолей");
	Запрос.УстановитьПараметр("ОбязательныеРоли", ОбязательныеРоли);
	Запрос.УстановитьПараметр("КоличествоРолей", ОбязательныеРоли.Количество());
	ПрофилиВыборка = Запрос.Выполнить().Выбрать();
	Пока ПрофилиВыборка.Следующий() Цикл
		
		ПрофильОбъект = ПрофилиВыборка.Ссылка.ПолучитьОбъект();
		Для каждого Роль из ОбязательныеРоли Цикл
			Если ПрофильОбъект.Роли.Найти(Роль.Значение, "Роль") = Неопределено Тогда
				НоваяСтрока = ПрофильОбъект.Роли.Добавить();
				НоваяСтрока.Роль = Роль.Значение;
			КонецЕсли;
		КонецЦикла;
		ПрофильОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ДополнитьВидыОграниченийПрав(Описание) Экспорт

	Описание = Описание + "
	|БизнесПроцесс.CRM_БизнесПроцесс.Чтение.ГруппыПартнеров
	|БизнесПроцесс.CRM_БизнесПроцесс.Чтение.Организации
	|БизнесПроцесс.CRM_БизнесПроцесс.Чтение.Подразделения
	|БизнесПроцесс.CRM_БизнесПроцесс.Чтение.Пользователи
	|БизнесПроцесс.CRM_БизнесПроцесс.Изменение.ГруппыПартнеров
	|БизнесПроцесс.CRM_БизнесПроцесс.Изменение.Организации
	|БизнесПроцесс.CRM_БизнесПроцесс.Изменение.Подразделения
	|БизнесПроцесс.CRM_БизнесПроцесс.Изменение.Пользователи	
	|Документ.CRM_Взаимодействие.Чтение.Объект.Документ.CRM_Взаимодействие
	|Документ.CRM_Взаимодействие.Изменение.Объект.Документ.CRM_Взаимодействие
	|Документ.CRM_Заявка.Чтение.Организации
	|Документ.CRM_Заявка.Чтение.Пользователи
	|Документ.CRM_Заявка.Изменение.Организации
	|Документ.CRM_Заявка.Изменение.Пользователи
	|Документ.CRM_Интерес.Чтение.ГруппыПартнеров
	|Документ.CRM_Интерес.Чтение.Организации
	|Документ.CRM_Интерес.Чтение.Подразделения
	|Документ.CRM_Интерес.Чтение.Склады
	|Документ.CRM_Интерес.Изменение.ГруппыПартнеров
	|Документ.CRM_Интерес.Изменение.Организации
	|Документ.CRM_Интерес.Изменение.Подразделения
	|Документ.CRM_Интерес.Изменение.Склады
	|Документ.CRM_ОтчетОРаботе.Чтение.Подразделения
	|Документ.CRM_ОтчетОРаботе.Чтение.Пользователи
	|Документ.CRM_ОтчетОРаботе.Изменение.Подразделения
	|Документ.CRM_ОтчетОРаботе.Изменение.Пользователи
	|Документ.CRM_ПланированиеВоронкиПродаж.Чтение.Подразделения
	|Документ.CRM_ПланированиеВоронкиПродаж.Чтение.Пользователи
	|Документ.CRM_ПланированиеВоронкиПродаж.Изменение.Подразделения
	|Документ.CRM_ПланированиеВоронкиПродаж.Изменение.Пользователи
	|Документ.CRM_РассылкаЭлектронныхПисем.Чтение.Объект.Документ.CRM_РассылкаЭлектронныхПисем
	|Документ.CRM_РассылкаЭлектронныхПисем.Изменение.Объект.Документ.CRM_РассылкаЭлектронныхПисем
	|Документ.CRM_Телемаркетинг.Чтение.Объект.Документ.CRM_Телемаркетинг
	|Документ.CRM_Телемаркетинг.Изменение.Объект.Документ.CRM_Телемаркетинг
	|Документ.CRM_УстановкаИспользуемыхПоказателей.Чтение.Подразделения
	|Документ.CRM_УстановкаИспользуемыхПоказателей.Чтение.Пользователи
	|Документ.CRM_УстановкаИспользуемыхПоказателей.Изменение.Подразделения
	|Документ.CRM_УстановкаИспользуемыхПоказателей.Изменение.Пользователи
	|ЖурналДокументов.CRM_Почта.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|ЖурналДокументов.CRM_Почта.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|РегистрСведений.CRM_ЖурналДокументов.Чтение.ГруппыПартнеров
	|РегистрСведений.CRM_ЖурналДокументов.Чтение.Организации
	|РегистрСведений.CRM_ЖурналДокументов.Чтение.Подразделения
	|РегистрСведений.CRM_ЖурналДокументов.Изменение.ГруппыПартнеров
	|РегистрСведений.CRM_ЖурналДокументов.Изменение.Организации
	|РегистрСведений.CRM_ЖурналДокументов.Изменение.Подразделения
	|РегистрСведений.CRM_ЗадачиПользователей.Чтение.ГруппыПартнеров
	|РегистрСведений.CRM_ЗадачиПользователей.Чтение.Пользователи
	|РегистрСведений.CRM_ЗадачиПользователей.Изменение.ГруппыПартнеров
	|РегистрСведений.CRM_ЗадачиПользователей.Изменение.Пользователи
	|РегистрСведений.CRM_ОбъектыАРМ.Чтение.Пользователи
	|РегистрСведений.CRM_ОбъектыАРМ.Изменение.Пользователи
	|РегистрСведений.CRM_ПартнерыСегментаПериодический.Чтение.ГруппыПартнеров
	|РегистрСведений.CRM_ПартнерыСегментаПериодический.Изменение.ГруппыПартнеров
	|РегистрСведений.CRM_СобытияКалендаря.Чтение.ГруппыПартнеров
	|РегистрСведений.CRM_СобытияКалендаря.Чтение.Пользователи
	|РегистрСведений.CRM_СобытияКалендаря.Изменение.ГруппыПартнеров
	|РегистрСведений.CRM_СобытияКалендаря.Изменение.Пользователи
	|РегистрСведений.CRM_ХолдингиПартнеров.Чтение.ГруппыПартнеров
	|РегистрСведений.CRM_ХолдингиПартнеров.Изменение.ГруппыПартнеров
	|Справочник.CRM_ВзаимодействиеПрисоединенныеФайлы.Чтение.Объект.Документ.CRM_Взаимодействие
	|Справочник.CRM_ВзаимодействиеПрисоединенныеФайлы.Изменение.Объект.Документ.CRM_Взаимодействие
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Чтение.Организации
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Чтение.Склады
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Изменение.Организации
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.CRM_ИнтересПрисоединенныеФайлы.Изменение.Склады
	|Справочник.CRM_РассылкаЭлектронныхПисемПрисоединенныеФайлы.Чтение.Объект.Документ.CRM_РассылкаЭлектронныхПисем
	|Справочник.CRM_РассылкаЭлектронныхПисемПрисоединенныеФайлы.Изменение.Объект.Документ.CRM_РассылкаЭлектронныхПисем
	|Справочник.CRM_ТелемаркетингПрисоединенныеФайлы.Чтение.Объект.Документ.CRM_Телемаркетинг
	|Справочник.CRM_ТелемаркетингПрисоединенныеФайлы.Изменение.Объект.Документ.CRM_Телемаркетинг
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Чтение.Организации
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Изменение.Организации
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.CRM_БизнесПроцессПрисоединенныеФайлы.Изменение.Пользователи
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.CRM_БизнесПроцесс
	|Справочник.КонтактныеЛицаПартнеровПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеровПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.CRM_БизнесПроцесс
	|Задача.ЗадачаИсполнителя.Чтение.Пользователи
	|Задача.ЗадачаИсполнителя.Изменение.Пользователи
	|";

КонецПроцедуры

Процедура ОбновитьСоставВидовДоступа(Объект, Профиль)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДоступаПрофиля.ВидДоступа,
	|	ВидыДоступаПрофиля.Предустановленный,
	|	ВидыДоступаПрофиля.ВсеРазрешены
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.ВидыДоступа КАК ВидыДоступаПрофиля
	|ГДЕ
	|	ВидыДоступаПрофиля.Ссылка = &Ссылка
	|	И НЕ ВидыДоступаПрофиля.Предустановленный";
	
	Запрос.УстановитьПараметр("Ссылка", Профиль);
	
	УстановитьПривилегированныйРежим(Истина);
	ВидыДоступаПрофиля = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ИзменилсяСоставВидовДоступа = Ложь;
	
	// Добавление недостающих видов доступа.
	Индекс = ВидыДоступаПрофиля.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Строка = ВидыДоступаПрофиля[Индекс];
		
		Отбор = Новый Структура("ВидДоступа", Строка.ВидДоступа);
		СвойстваВидаДоступа = УправлениеДоступомСлужебный.СвойстваВидаДоступа(Строка.ВидДоступа);
		
		Если СвойстваВидаДоступа = Неопределено Тогда
			ВидыДоступаПрофиля.Удалить(Строка);
		ИначеЕсли Объект.ВидыДоступа.НайтиСтроки(Отбор).Количество() = 0 Тогда
			ИзменилсяСоставВидовДоступа = Истина;
			НоваяСтрока = Объект.ВидыДоступа.Добавить();
			НоваяСтрока.ВидДоступа   = Строка.ВидДоступа;
			НоваяСтрока.ВсеРазрешены = Строка.ВсеРазрешены;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	// Удаление лишних видов доступа.
	Индекс = Объект.ВидыДоступа.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ВидДоступа = Объект.ВидыДоступа[Индекс].ВидДоступа;
		Отбор = Новый Структура("ВидДоступа", ВидДоступа);
		СвойстваВидаДоступа = УправлениеДоступомСлужебный.СвойстваВидаДоступа(ВидДоступа);
		
		Если СвойстваВидаДоступа = Неопределено
			ИЛИ ВидыДоступаПрофиля.НайтиСтроки(Отбор).Количество() = 0 Тогда
			ИзменилсяСоставВидовДоступа = Истина;
			Объект.ВидыДоступа.Удалить(Индекс);
			Для каждого ЭлементКоллекции Из Объект.ЗначенияДоступа.НайтиСтроки(Отбор) Цикл
				Объект.ЗначенияДоступа.Удалить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.CRM_Взаимодействие, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_Заявка, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_Интерес, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_ОтчетОРаботе, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_ПланированиеВоронкиПродаж, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_РассылкаЭлектронныхПисем, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_Телемаркетинг, Ложь);
	Списки.Вставить(Метаданные.Документы.CRM_УстановкаИспользуемыхПоказателей, Ложь);
	
	Списки.Вставить(Метаданные.Справочники.КонтактныеЛицаПартнеровПрисоединенныеФайлы, Ложь);
	Списки.Вставить(Метаданные.Справочники.CRM_БизнесПроцессПрисоединенныеФайлы, Ложь);
	Списки.Вставить(Метаданные.Справочники.CRM_ВзаимодействиеПрисоединенныеФайлы, Ложь);
	Списки.Вставить(Метаданные.Справочники.CRM_ИнтересПрисоединенныеФайлы, Ложь);
	Списки.Вставить(Метаданные.Справочники.CRM_ОтчетОРаботеПрисоединенныеФайлы, Ложь);
	Списки.Вставить(Метаданные.Справочники.CRM_РассылкаЭлектронныхПисемПрисоединенныеФайлы, Ложь);
	Списки.Вставить(Метаданные.Справочники.CRM_ТелемаркетингПрисоединенныеФайлы, Ложь);
	
	Списки.Вставить(Метаданные.ЖурналыДокументов.CRM_Почта, Ложь);
	
	Списки.Вставить(Метаданные.РегистрыСведений.CRM_ЖурналДокументов, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.CRM_ЗадачиПользователей, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.CRM_ОбъектыАРМ, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.CRM_ПартнерыСегментаПериодический, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.CRM_СобытияКалендаря, Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.CRM_ХолдингиПартнеров, Ложь);
	
	Списки.Вставить(Метаданные.БизнесПроцессы.CRM_БизнесПроцесс, Ложь);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	Если Список = Метаданные.Документы.CRM_Взаимодействие Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Подразделение, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Партнер, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(СторонниеЛица.Партнер, Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_Заявка Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Ответственный)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_Интерес Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Склад)
		|	И ЗначениеРазрешено(Партнер)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_ОтчетОРаботе Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Подразделение)
		|	И ЗначениеРазрешено(Сотрудник)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_ПланированиеВоронкиПродаж Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Подразделение)
		|	И ЗначениеРазрешено(Менеджер)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_РассылкаЭлектронныхПисем Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Подразделение, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(УчетнаяЗапись, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Получатели.Партнер ТОЛЬКО (Справочник.Партнеры, Справочник.Пользователи), Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_Телемаркетинг Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Подразделение, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Участники.Партнер ТОЛЬКО Справочник.Партнеры, Отключено КАК Ложь)";
		
	ИначеЕсли Список = Метаданные.Документы.CRM_УстановкаИспользуемыхПоказателей Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Подразделение)
		|	И ЗначениеРазрешено(Исполнитель)
		|	И ЗначениеРазрешено(Ответственный)";
		
	ИначеЕсли Список = Метаданные.Справочники.КонтактныеЛицаПартнеровПрисоединенныеФайлы
		Или Список = Метаданные.Справочники.CRM_БизнесПроцессПрисоединенныеФайлы
		Или Список = Метаданные.Справочники.CRM_ВзаимодействиеПрисоединенныеФайлы
		Или Список = Метаданные.Справочники.CRM_ИнтересПрисоединенныеФайлы
		Или Список = Метаданные.Справочники.CRM_ОтчетОРаботеПрисоединенныеФайлы
		Или Список = Метаданные.Справочники.CRM_РассылкаЭлектронныхПисемПрисоединенныеФайлы
		Или Список = Метаданные.Справочники.CRM_ТелемаркетингПрисоединенныеФайлы Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтение
		|ГДЕ
		|	ЧтениеОбъектаРазрешено(ВладелецФайла)
		|;
		|РазрешитьИзменениеЕслиРазрешеноЧтение
		|ГДЕ
		|	ИзменениеОбъектаРазрешено(ВладелецФайла)";
		
	ИначеЕсли Список = Метаданные.ЖурналыДокументов.CRM_Почта Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЧтениеОбъектаРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.CRM_ЖурналДокументов Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Клиент)
		|	И ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.CRM_ЗадачиПользователей Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Пользователь)
		|	И ЗначениеРазрешено(Клиент)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.CRM_ОбъектыАРМ Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Пользователь ТОЛЬКО Справочник.Пользователи)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.CRM_ПартнерыСегментаПериодический Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Партнер)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.CRM_СобытияКалендаря Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Пользователь)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.CRM_ХолдингиПартнеров Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Партнер)
		|	ИЛИ ЗначениеРазрешено(Холдинг)";
		
	ИначеЕсли Список = Метаданные.БизнесПроцессы.CRM_БизнесПроцесс Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Ответственный)
		|	И ЗначениеРазрешено(Партнер)
		|	И ЗначениеРазрешено(Подразделение)";
		
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Объект, Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.CRM_Взаимодействие") Тогда
		
		НомерНабора = 0;
		
		Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.Подразделение;
		КонецЕсли;
		
		МассивПартнеров = Новый Массив;
		
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			МассивПартнеров.Добавить(Объект.Партнер)
		КонецЕсли;
		
		Для Каждого Строка Из Объект.СторонниеЛица Цикл
			Если Не ЗначениеЗаполнено(Строка.Партнер) Тогда
				Продолжить;
			КонецЕсли;
			МассивПартнеров.Добавить(Строка.Партнер)
		КонецЦикла;
		
		МассивПартнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПартнеров);
		
		Для Каждого ПартнерСсылка Из МассивПартнеров Цикл
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = ПартнерСсылка;
		КонецЦикла;
		
		Если Таблица.Количество() = 0 Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.CRM_РассылкаЭлектронныхПисем") Тогда
		
		НомерНабора = 0;
		
		Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.Подразделение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.УчетнаяЗапись) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.УчетнаяЗапись;
		КонецЕсли;
		
		МассивПартнеров = Новый Массив;
		
		Для Каждого Строка Из Объект.Получатели Цикл
			Если Не ЗначениеЗаполнено(Строка.Партнер) Тогда
				Продолжить;
			КонецЕсли;
			МассивПартнеров.Добавить(Строка.Партнер)
		КонецЦикла;
		
		МассивПартнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПартнеров);
		
		Для Каждого ПартнерСсылка Из МассивПартнеров Цикл
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = ПартнерСсылка;
		КонецЦикла;
		
		Если Таблица.Количество() = 0 Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.CRM_Телемаркетинг") Тогда
		
		НомерНабора = 0;
		
		Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Объект.Подразделение;
		КонецЕсли;
		
		МассивПартнеров = Новый Массив;
		
		Для Каждого Строка Из Объект.Участники Цикл
			Если Не ЗначениеЗаполнено(Строка.Партнер) Тогда
				Продолжить;
			КонецЕсли;
			МассивПартнеров.Добавить(Строка.Партнер)
		КонецЦикла;
		
		МассивПартнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПартнеров);
		
		Для Каждого ПартнерСсылка Из МассивПартнеров Цикл
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = ПартнерСсылка;
		КонецЦикла;
		
		Если Таблица.Количество() = 0 Тогда
			НомерНабора = НомерНабора + 1;
			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
