
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.смартПланПродажПоМенеджерам.Записывать = Истина;
	
	Если Статус=перечисления.смартСтатусыПланаПродаж.Утвержден Тогда
		
		Для Каждого ТекСтрокаПланирование Из Планирование Цикл
			
			Движение = Движения.смартПланПродажПоМенеджерам.Добавить();
			Движение.Период = ТекСтрокаПланирование.Период;
			Движение.ВидПлана = ВидПлана;
			Движение.ТипУслуги = ТипУслуги;
			Движение.Менеджер = ТекСтрокаПланирование.Менеджер;
			Движение.Подразделение = ТекСтрокаПланирование.Подразделение;
			Движение.СегментНоменклатуры = ТекСтрокаПланирование.СегментНоменклатуры;
			Движение.Количество = (ТекСтрокаПланирование.НовыйПланКоличество - ТекСтрокаПланирование.СтарыйПланКоличество);
			Движение.Сумма = (ТекСтрокаПланирование.НовыйПлан - ТекСтрокаПланирование.СтарыйПлан);
			Движение.СуммаРегл = (ТекСтрокаПланирование.НовыйПлан - ТекСтрокаПланирование.СтарыйПлан) * КурсДляРасчетаРублевогоПлана;
			Движение.КоэффициентИзменения = ТекСтрокаПланирование.КоэффициентИзменения;
			Движение.Комментарий = Комментарий;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) ТОгда
		ОбщегоНазначения.СообщитьПользователю("Документ Корректировка плана, может быть создан только на основании Плана по Менеджерам");
		Возврат; 
	КонецЕсли;
	
	Если НЕ (ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Статус=Перечисления.смартСтатусыПланаПродаж.Утвержден) Тогда
		ОбщегоНазначения.СообщитьПользователю("Корректировать можно только утвержденный и проведенный документ!");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартПланПродажПоМенеджерам") Тогда
		
		КоэффициентИзмененияОбщий = 1;
		Периодичность=ДанныеЗаполнения.Периодичность;
		ВидПлана = ДанныеЗаполнения.ВидПлана;
		ТипУслуги = ДанныеЗаполнения.ТипУслуги;
		КурсДляРасчетаРублевогоПлана = ДанныеЗаполнения.КурсДляРасчетаРублевогоПлана;
		
		Если Периодичность = Перечисления.Периодичность.Месяц Тогда
			НачалоПериода = ?(НачалоМесяца(ТекущаяДата()) < ДанныеЗаполнения.НачалоПериода, ДанныеЗаполнения.НачалоПериода,НачалоМесяца(ТекущаяДата()));
		Иначе
			НачалоПериода = ?(НачалоКвартала(ТекущаяДата()) < ДанныеЗаполнения.НачалоПериода, ДанныеЗаполнения.НачалоПериода,НачалоКвартала(ТекущаяДата()));
		КонецЕсли;
		
		ОкончаниеПериода = ДанныеЗаполнения.ОкончаниеПериода;
		ДокументОснование = ДанныеЗаполнения;
		Статус=Перечисления.смартСтатусыПланаПродаж.Подготовка;
		
		Если ВидПлана = Перечисления.смартВидПлана.ПоПодразделениям Тогда
			
			МасПодразделение =  ДанныеЗаполнения.Планирование.Выгрузить(, "Подразделение").ВыгрузитьКолонку("Подразделение");
			МасПодразделение = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПодразделение);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
			|	смартПланПродажПоМенеджерамОбороты.Подразделение КАК Подразделение,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СтарыйПлан
			|ИЗ
			|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, 
			|" + ?(Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ") + ", Подразделение В (&МасПодразделение) 
			|	И ТипУслуги = &ТипУслуги И ВидПлана = &ВидПлана) КАК смартПланПродажПоМенеджерамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Период,
			|	смартПланПродажПоМенеджерамОбороты.Подразделение
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Подразделение.Наименование");
			Запрос.УстановитьПараметр("МасПодразделение", МасПодразделение);
			Запрос.УстановитьПараметр("ТипУслуги", ТипУслуги);
			Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
			Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Планирование.Добавить();
				НоваяСтрока.КоэффициентИзменения = 1;
				НоваяСтрока.Подразделение = Выборка.Подразделение;
				НоваяСтрока.НовыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.СтарыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.Период = Выборка.Период;
				
			КонецЦикла;
			
		ИначеЕсли ВидПлана = Перечисления.смартВидПлана.ПоМенеджерам Тогда	
			
			МасМенеджер = ДанныеЗаполнения.Планирование.Выгрузить(, "Менеджер").ВыгрузитьКолонку("Менеджер");
			МасМенеджер = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасМенеджер);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
			|	смартПланПродажПоМенеджерамОбороты.Менеджер КАК Менеджер,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СтарыйПлан
			|ИЗ
			|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, 
			|" + ?(Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ") + ", Менеджер В (&МасМенеджер) 
			|	И ТипУслуги = &ТипУслуги И ВидПлана = &ВидПлана) КАК смартПланПродажПоМенеджерамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Период,
			|	смартПланПродажПоМенеджерамОбороты.Менеджер
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Менеджер.Наименование");
			Запрос.УстановитьПараметр("МасМенеджер", МасМенеджер);
			Запрос.УстановитьПараметр("ТипУслуги", ТипУслуги);
			Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
			Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
			
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Планирование.Добавить();
				НоваяСтрока.КоэффициентИзменения = 1;
				НоваяСтрока.Менеджер = Выборка.Менеджер;
				НоваяСтрока.НовыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.СтарыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.Период = Выборка.Период;
				
			КонецЦикла;
			
		Иначе
			
			МасСегментов = ДанныеЗаполнения.Планирование.Выгрузить(, "СегментНоменклатуры").ВыгрузитьКолонку("СегментНоменклатуры");
			МасСегментов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасСегментов);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
			|	смартПланПродажПоМенеджерамОбороты.СегментНоменклатуры КАК СегментНоменклатуры,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СтарыйПлан,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.КоличествоОборот) КАК СтарыйПланКоличество
			|ИЗ
			|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, 
			|" + ?(Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ") + ", СегментНоменклатуры В (&МасСегментов) 
			|	И ВидПлана = &ВидПлана) КАК смартПланПродажПоМенеджерамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Период,
			|	смартПланПродажПоМенеджерамОбороты.СегментНоменклатуры
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.СегментНоменклатуры.Наименование");
			Запрос.УстановитьПараметр("МасСегментов", МасСегментов);
			Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
			Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Планирование.Добавить();
				НоваяСтрока.КоэффициентИзменения = 1;
				НоваяСтрока.СегментНоменклатуры = Выборка.СегментНоменклатуры;
				НоваяСтрока.НовыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.СтарыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.НовыйПланКоличество = Выборка.СтарыйПланКоличество;
				НоваяСтрока.СтарыйПланКоличество = Выборка.СтарыйПланКоличество;
				НоваяСтрока.Период = Выборка.Период;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли

