
&НаСервере
Функция ПередатьАртикулыНаСервере() 
	
	Результат = Ложь;
	
	МассивАктикулов = Новый Массив; 	
	
	Для Каждого СтрокаТаблицыАртикулов Из ТаблицаАртикулов Цикл
		
		СтруктураАртикула = Новый Структура;
		СтруктураАртикула.Вставить("cargoPlace", ?(ЗначениеЗаполнено(СтрокаТаблицыАртикулов.Артикул), СтрокаТаблицыАртикулов.Артикул, Неопределено)); 
		СтруктураАртикула.Вставить("amount", Макс(СтрокаТаблицыАртикулов.Количество, 1));
		
		МассивАктикулов.Добавить(СтруктураАртикула);
		
	КонецЦикла;
	
	СтруктураОтвета = ДЛ_ДеловыеЛинии.ПередатьАртикулыЗаказа(НомерЗаказа, МассивАктикулов); 
	
	Если СтруктураОтвета["errors"] <> Неопределено Тогда
		
		Для Каждого Ошибка Из СтруктураОтвета["errors"] Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка["detail"]);
			
		КонецЦикла;
		
	Иначе		
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередатьАртикулы(Команда)
	
	Если ТаблицаАртикулов.Количество() > 0 Тогда  
		
		ЗаполненоМест = ТаблицаАртикулов.Итог("Количество"); 
		
		Если  ЗаполненоМест <> КоличествоМест Тогда		
					
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В таблице указано %1 мест, при количестве мест в заявке %2", ЗаполненоМест, КоличествоМест)); 
			
			Возврат;
			
		КонецЕсли;
		
		Если ПередатьАртикулыНаСервере() Тогда
			
			ЭтаФорма.Закрыть();	 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Артикулы грузомест успешно отправлены");
			
		Иначе 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В процессе передачи данных артикулов возникли ошибки. Запрос не выполнен.");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КоличествоМест", КоличествоМест);
	Параметры.Свойство("НомерЗаказа", НомерЗаказа); 
	
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		
		Отказ = Истина;	
		
	КонецЕсли; 
	
	ЭтаФорма.Заголовок = "Заказ №" + НомерЗаказа;
	
КонецПроцедуры
