
&НаСервере
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++#1323 смарт: Лопато 02.10.2023 //Восстановить и переделать механизм индивидуальных скидок
	НовыеРеквизиты = Новый Массив;
	
	РеквизитВыгружатьИндивидуальныеСкидки = Новый РеквизитФормы("смартВыгружатьИндивидуальныеСкидки", Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(РеквизитВыгружатьИндивидуальныеСкидки);
	
	РеквизитВыгружатьАвтоматическиеСкидки = Новый РеквизитФормы("смартВыгружатьАвтоматическиеСкидки", Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(РеквизитВыгружатьАвтоматическиеСкидки);
	
	ИзменитьРеквизиты(НовыеРеквизиты);

	НовыйЭлемент = Элементы.Добавить("смартВыгружатьИндивидуальныеСкидки", Тип("ПолеФормы"), Элементы.ГруппаРазрешитьВыгрузкуЦен);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "смартВыгружатьИндивидуальныеСкидки";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Заголовок = "Выгружать индивидуальные скидки";

	НовыйЭлемент = Элементы.Добавить("смартВыгружатьАвтоматическиеСкидки", Тип("ПолеФормы"), Элементы.ГруппаРазрешитьВыгрузкуЦен);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "смартВыгружатьАвтоматическиеСкидки";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Заголовок = "Выгружать автоматические скидки";

	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроекОбмена) Тогда

		смартНастройкиОбмена = ПолучитьИзВременногоХранилища(Параметры.АдресНастроекОбмена);

		ЭтаФорма.смартВыгружатьИндивидуальныеСкидки = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(смартНастройкиОбмена.ИнформацияОНоменклатуре, "смартВыгружатьИндивидуальныеСкидки");
		ЭтаФорма.смартВыгружатьАвтоматическиеСкидки = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(смартНастройкиОбмена.ИнформацияОНоменклатуре, "смартВыгружатьАвтоматическиеСкидки");
		
	КонецЕсли;	
	//--#1323 смарт: Лопато 02.10.2023
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПрименитьНаСервере")
Функция смарт_ПрименитьНаСервере()

	НастройкиТовара = ПолучитьИзВременногоХранилища(АдресНастроекОбмена);

	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьЗначенияСвойствВПредложения 	= ВыгружатьЗначенияСвойствВПредложения;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьХарактеристикиПредложений 		= ВыгружатьХарактеристикиПредложений;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьЗначенияСвойствВТовары 		= ВыгружатьЗначенияСвойствВТовары;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьКартинкиИФайлы 				= ВыгружатьКартинкиИФайлы;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьКомплектующие 					= ВыгружатьКомплектующие;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьНоменклатуруКакПредложение 	= ВыгружатьНоменклатуруКакПредложение;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьОстатки 						= ВыгружатьОстатки;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьОстаткиПоСкладам 				= ВыгружатьОстаткиПоСкладам;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьОстаткиСУчетомРезерва 			= ВыгружатьОстаткиСУчетомРезерва;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьПредложения 					= ВыгружатьПредложения;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьПредложенияТолькоСЦеной 		= ВыгружатьПредложенияТолькоСЦеной;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьСвойства 						= ВыгружатьСвойства;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьТовары 						= ВыгружатьТовары;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьХарактеристикиТолькоСОстатками = ВыгружатьХарактеристикиТолькоСОстатками;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьЦены 							= ВыгружатьЦены;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьШтрихкоды 						= ВыгружатьШтрихкоды;
	НастройкиТовара.ИнформацияОНоменклатуре.КоличествоПредложенийВПакете 			= КоличествоПредложенийВПакете;
	НастройкиТовара.ИнформацияОНоменклатуре.КоличествоСвойствВПакете 				= КоличествоСвойствВПакете;
	НастройкиТовара.ИнформацияОНоменклатуре.КоличествоТоваровВПакете 				= КоличествоТоваровВПакете;
	НастройкиТовара.ИнформацияОНоменклатуре.КлассифицироватьПоВидамНоменклатуры 	= КлассифицироватьПоВидамНоменклатуры;

	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьПланируемуюДатуПоступленияПредложения 			= ВыгружатьПланируемуюДатуПоступленияПредложения;
	НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьТолькоИспользуемыеСправочныеЗначенияСвойств 	= ВыгружатьТолькоИспользуемыеСправочныеЗначенияСвойств;
	НастройкиТовара.ИнформацияОНоменклатуре.НастройкаСвойствТоваровИХарактеристик 					= НастройкаСвойствТоваровИХарактеристик.Выгрузить();
	НастройкиТовара.ИнформацияОНоменклатуре.СоответствиеДополнительныхРеквизитовНоменклатуры 		= СоответствиеДополнительныхРеквизитовНоменклатуры.Выгрузить();
	НастройкиТовара.ИнформацияОНоменклатуре.СоответствиеОсновныхРеквизитовНоменклатуры 				= СоответствиеОсновныхРеквизитовНоменклатуры.Выгрузить();

	#Вставка
	//++#1323 смарт: Лопато 02.10.2023 //Восстановить и переделать механизм индивидуальных скидок
	Если НастройкиТовара.ИнформацияОНоменклатуре.Свойство("смартВыгружатьИндивидуальныеСкидки") тогда
		НастройкиТовара.ИнформацияОНоменклатуре.смартВыгружатьИндивидуальныеСкидки = ЭтаФорма.смартВыгружатьИндивидуальныеСкидки;
	Иначе
		НастройкиТовара.ИнформацияОНоменклатуре.Вставить("смартВыгружатьИндивидуальныеСкидки", ЭтаФорма.смартВыгружатьИндивидуальныеСкидки);
	КонецЕсли;

	Если НастройкиТовара.ИнформацияОНоменклатуре.Свойство("смартВыгружатьАвтоматическиеСкидки") тогда
		НастройкиТовара.ИнформацияОНоменклатуре.смартВыгружатьАвтоматическиеСкидки = ЭтаФорма.смартВыгружатьАвтоматическиеСкидки;
	Иначе
		НастройкиТовара.ИнформацияОНоменклатуре.Вставить("смартВыгружатьАвтоматическиеСкидки", ЭтаФорма.смартВыгружатьАвтоматическиеСкидки);
	КонецЕсли;
	//--#1323 смарт: Лопато 02.10.2023
	#КонецВставки
	
	лАдресНастроекОбмена = ПоместитьВоВременноеХранилище(НастройкиТовара, УникальныйИдентификатор);


	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТаблицаКаталогов"		, ТаблицаКаталогов);

	ПараметрыФормы.Вставить("АдресНастроекОбмена"	, лАдресНастроекОбмена);


	//Проверяем и добавляем новые поля:

	Если НастройкиТовара.ИнформацияОНоменклатуре.Свойство("ВыгружатьКартинкиИФайлыПредложений") тогда
		НастройкиТовара.ИнформацияОНоменклатуре.ВыгружатьКартинкиИФайлыПредложений = ВыгружатьКартинкиИФайлыПредложений;
	Иначе
		НастройкиТовара.ИнформацияОНоменклатуре.Вставить("ВыгружатьКартинкиИФайлыПредложений", ВыгружатьКартинкиИФайлыПредложений);
	КонецЕсли;

	Возврат ПараметрыФормы;

КонецФункции
