#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	#Вставка
	//++ #Б980 смарт: Шляпников 07.10.2024 / Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеТоваровНаСклад
	//++ смарт:ММ #096 221 19.02.2021 Доработка Приобретения ТиУ
	Если ЗначениеЗаполнено(ЭтотОбъект.Распоряжение) И ТипЗнч(ЭтотОбъект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ЭтотОбъект.Распоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту  // Импорт
			ИЛИ ЭтотОбъект.Распоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС Тогда // Ввоз из ЕАЭС
			// Документ проводится, но без движений
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-- смарт:ММ 19.02.2021
	//-- #Б980 смарт: Шляпников 07.10.2024
	#КонецВставки

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ПоступлениеТоваровНаСклад.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьДатыПоступленияТоваровОрганизаций(ДополнительныеСвойства, Отказ);
	ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьДвижениеТоваров(ДополнительныеСвойства, Движения, Отказ);
	СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);
	Ценообразование.ОтразитьЦеныНоменклатурыПоставщика(ДополнительныеСвойства, Движения, Отказ);
	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	// Движения по оборотным регистрам управленческого учета
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияНоменклатураНоменклатура(ДополнительныеСвойства, Движения, Отказ);

	СформироватьСписокРегистровДляКонтроля();

	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.Проведение);	

	ПоступлениеТоваровНаСкладЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПараметрыЗаполнения = ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов();
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДокументНаОснованииЗаказаПоставщику")
Процедура смарт_ЗаполнитьДокументНаОснованииЗаказаПоставщику(ДокументОснование, СкладПоступления, ХозяйственнаяОперацияПриемки, ЗаполнятьПоНакладной, ЗаполнятьПоОрдеру)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК Ссылка,
	|	ЗаказПоставщику.Соглашение КАК Соглашение,
	|	ЗаказПоставщику.Партнер КАК Партнер,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Статус КАК СтатусДокумента,
	|	ЗаказПоставщику.Договор КАК Договор,
	|	ЗаказПоставщику.Сделка КАК Сделка,
	|	ЗаказПоставщику.Валюта КАК Валюта,
	|	ЕСТЬNULL(Соглашения.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)) КАК ВидЦеныПоставщика,
	|	ЗаказПоставщику.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказПоставщику.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказПоставщику.ЗакупкаПодДеятельность КАК ВидДеятельностиНДС,
	|	ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕ ЗаказПоставщику.Проведен КАК ЕстьОшибкиПроведен,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусызаказовПоставщикам.НеСогласован),ЗНАЧЕНИЕ(Перечисление.СтатусызаказовПоставщикам.Согласован))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиСтатус
	|ПОМЕСТИТЬ ВТРаспоряжение
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК Соглашения
	|		ПО ЗаказПоставщику.Соглашение = Соглашения.Ссылка
	|ГДЕ
	|	ЗаказПоставщику.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления,
	|	ТоварыКПоступлениюОстатки.Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение,
	|	ТоварыКПоступлениюОстатки.Серия,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток КАК Количество,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(,ДокументПоступления = &ДокументОснование 
	|		И ВЫБОР КОГДА &СкладУказан
	|			ТОГДА Склад = &СкладПоступления
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	&ЗаполнятьПоЗаказу
	|	И ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления,
	|	ТоварыКПоступлениюОстатки.Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение,
	|	ТоварыКПоступлениюОстатки.Серия,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток КАК Количество,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(,ДокументПоступления = &ДокументОснование 
	|		И ВЫБОР КОГДА &СкладУказан
	|			ТОГДА Склад = &СкладПоступления
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	&ЗаполнятьПоНакладной
	|	И ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления,
	|	ТоварыКПоступлениюОстатки.Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение,
	|	ТоварыКПоступлениюОстатки.Серия,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток КАК Количество,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(,ДокументПоступления = &ДокументОснование 
	|		И ВЫБОР КОГДА &СкладУказан
	|			ТОГДА Склад = &СкладПоступления
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	&ЗаполнятьПоОрдеру
	|	И ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаНоменклатуры.Ссылка КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ВТОтборТоварыОрганизацийУПартнеров
	|ИЗ
	|	ВТРаспоряжение КАК ТаблицаРаспоряжение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТовары КАК ТаблицаТовары
	|	ПО ТаблицаРаспоряжение.Ссылка = ТаблицаТовары.ДокументПоступления
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|	ПО АналитикаУчетаНоменклатуры.Номенклатура = ТаблицаТовары.Номенклатура
	|	И АналитикаУчетаНоменклатуры.Характеристика = ТаблицаТовары.Характеристика
	|	И АналитикаУчетаНоменклатуры.Серия = ТаблицаТовары.Серия
	|	И АналитикаУчетаНоменклатуры.Назначение = ТаблицаТовары.Назначение
	|	И АналитикаУчетаНоменклатуры.Договор = ТаблицаРаспоряжение.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаспоряжение.Ссылка          КАК Ссылка,
	|	ТаблицаРаспоряжение.Соглашение      КАК Соглашение,
	|	ТаблицаРаспоряжение.Партнер         КАК Партнер,
	|	ТаблицаРаспоряжение.Контрагент      КАК Контрагент,
	|	ТаблицаРаспоряжение.Организация     КАК Организация,
	|	ТаблицаРаспоряжение.СтатусДокумента КАК СтатусДокумента,
	|	ТаблицаРаспоряжение.Договор         КАК Договор,
	|	ТаблицаРаспоряжение.Сделка          КАК Сделка,
	|	ТаблицаРаспоряжение.Валюта          КАК Валюта,
	|	ТаблицаРаспоряжение.ВидЦеныПоставщика  КАК ВидЦеныПоставщика,
	|	ТаблицаРаспоряжение.ЦенаВключаетНДС    КАК ЦенаВключаетНДС,
	|	ТаблицаРаспоряжение.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаРаспоряжение.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ТаблицаРаспоряжение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРаспоряжение.ЕстьОшибкиПроведен КАК ЕстьОшибкиПроведен,
	|	ТаблицаРаспоряжение.ЕстьОшибкиСтатус   КАК ЕстьОшибкиСтатус
	|ИЗ
	|	ВТРаспоряжение КАК ТаблицаРаспоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.ДокументПоступления КАК ДокументПоступления,
	|	ТаблицаТовары.Номенклатура        КАК Номенклатура,
	|	ТаблицаТовары.Характеристика      КАК Характеристика,
	|	ТаблицаТовары.Назначение          КАК Назначение,
	|	ТаблицаТовары.Серия               КАК Серия,
	|	ТаблицаТовары.Количество          КАК Количество,
	|	ТаблицаТовары.КоличествоУпаковок  КАК КоличествоУпаковок
	|ИЗ
	|	ВТТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура   КАК Номенклатура,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Серия          КАК Серия,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Назначение     КАК Назначение,
	|	ТоварыОрганизаций.КоличествоОстаток                         КАК Передано
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			,
	|			(АналитикаУчетаНоменклатуры)
	|				В (ВЫБРАТЬ
	|						ТаблицаОтбор.АналитикаУчетаНоменклатуры
	|					ИЗ
	|						ВТОтборТоварыОрганизацийУПартнеров КАК ТаблицаОтбор
	|				)) КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.КоличествоОстаток > 0";

	Запрос.УстановитьПараметр("ДокументОснование",    ДокументОснование);
	Запрос.УстановитьПараметр("СкладПоступления",     СкладПоступления);
	Запрос.УстановитьПараметр("СкладУказан",          ЗначениеЗаполнено(СкладПоступления));
	Запрос.УстановитьПараметр("ЗаполнятьПоЗаказу",    Не (ЗаполнятьПоНакладной = Истина Или ЗаполнятьПоОрдеру = Истина));
	Запрос.УстановитьПараметр("ЗаполнятьПоНакладной", ЗаполнятьПоНакладной = Истина);
	Запрос.УстановитьПараметр("ЗаполнятьПоОрдеру",    ЗаполнятьПоОрдеру = Истина);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Выборка            = РезультатЗапроса[3].Выбрать();
	ТЗТовары           = РезультатЗапроса[4].Выгрузить();
	ТЗТоварыУПартнеров = РезультатЗапроса[5].Выгрузить();

	Выборка.Следующий();

	МассивДопустимыхСтатусов = Новый Массив;
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);

	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(ДокументОснование,
	Выборка.СтатусДокумента,
	Выборка.ЕстьОшибкиПроведен,
	Выборка.ЕстьОшибкиСтатус,
	МассивДопустимыхСтатусов);

	Распоряжение = ДокументОснование;
	Склад        = СкладПоступления;

	ПарыОперацийРаздельнойЗакупки = ЗакупкиСервер.ПарыОперацийРаздельнойЗакупки(Истина);
	ХозяйственнаяОперацияПриемкиФактическоеПоступление = ПарыОперацийРаздельнойЗакупки.Получить(ХозяйственнаяОперацияПриемки);
	ХозяйственнаяОперацияПриемкиФактическоеПоступление = ?(Не ЗначениеЗаполнено(ХозяйственнаяОперацияПриемкиФактическоеПоступление),
	ХозяйственнаяОперацияПриемки,
	ХозяйственнаяОперацияПриемкиФактическоеПоступление);

	ХозяйственнаяОперация = ХозяйственнаяОперацияПриемкиФактическоеПоступление;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);

	Товары.Загрузить(ТЗТовары);

	СтруктураДействий = Новый Структура("ПересчитатьКоличествоУпаковок",
	ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаКоличестваУпаковок());

	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);

	ЗаполнитьЦеныПоСоглашению();
	
	#Вставка 
	//++ #5384 смарт: Тимофеева 29.01.26 / Доработка документов под схему "товары в пути"
	смарт_ЗаполнитьДокументНаОснованииЗаказаПоставщикуДополнение(ДокументОснование);
	//-- #5384 смарт: Тимофеева 29.01.26
	#КонецВставки
КонецПроцедуры  

//++ #5384 смарт: Тимофеева 29.01.26 / Доработка документов под схему "товары в пути"
Процедура смарт_ЗаполнитьДокументНаОснованииЗаказаПоставщикуДополнение(ДокументОснование)
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументЗаказПоставщику.Груз КАК Груз,
	|	ЕСТЬNULL(ПриобретениеТоваровУслуг.НомерВходящегоДокумента, """") КАК НомерВходящегоДокумента,
	|	ЕСТЬNULL(ПриобретениеТоваровУслуг.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВходящегоДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДокументЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО (ПриобретениеТоваровУслуг.ЗаказПоставщику = ДокументЗаказПоставщику.Ссылка)
	|			И (НЕ ПриобретениеТоваровУслуг.НомерВходящегоДокумента = """")
	|ГДЕ
	|	ДокументЗаказПоставщику.Ссылка = &ДокументОснование";

	Запрос.УстановитьПараметр("ДокументОснование",    ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка            = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
    ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Груз,НомерВходящегоДокумента,ДатаВходящегоДокумента");
КонецПроцедуры
//-- #5384 смарт: Тимофеева 29.01.26

#КонецОбласти