
&НаСервере
//++ #Б-3612 смарт: Фролов 25.06.2025 //Вывести колонку "Контейнер" в список "Грузы(смарт)"
Функция КонтейнерПриИзмененииНаСервере()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Груз КАК Груз
	|ИЗ
	|	РегистрСведений.смартСобытияКонтейнеров
	|ГДЕ
	|	Контейнер = &Контейнер");
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Груз");

КонецФункции //-- #Б-3612 смарт: Фролов 25.06.2025

&НаКлиенте
//++ #Б-3612 смарт: Фролов 25.06.2025 //Вывести колонку "Контейнер" в список "Грузы(смарт)"
Процедура КонтейнерПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Контейнер) Тогда
		
		Грузы = КонтейнерПриИзмененииНаСервере();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Грузы, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	Иначе	
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", , , , Ложь);
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-3612 смарт: Фролов 25.06.2025
