
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуНГГ();
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТаблицуНГГ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""auto""
	|			ТОГДА ""Автодоставка""
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""avia""
	|			ТОГДА ""Авиадоставка""
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""cargo_small""
	|			ТОГДА ""Малогабаритный груз""
	|		КОГДА ДЛ_ПараметрыНГГ.Наименование = ""express""
	|			ТОГДА ""Экспресс-доставка""
	|		ИНАЧЕ ДЛ_ПараметрыНГГ.Наименование
	|	КОНЕЦ КАК ТипПеревозки,
	|	ДЛ_ПараметрыНГГ.Длина КАК Длина,
	|	ДЛ_ПараметрыНГГ.Ширина КАК Ширина,
	|	ДЛ_ПараметрыНГГ.Высота КАК Высота,
	|	ДЛ_ПараметрыНГГ.Вес КАК Вес,
	|	ВЫБОР
	|		КОГДА ДЛ_ПараметрыНГГ.Объем = ""0""
	|			ТОГДА ""-""
	|		ИНАЧЕ ДЛ_ПараметрыНГГ.Объем
	|	КОНЕЦ КАК Объем
	|ИЗ
	|	Справочник.ДЛ_ПараметрыНГГ КАК ДЛ_ПараметрыНГГ
	|ГДЕ
	|	НЕ ДЛ_ПараметрыНГГ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДЛ_ПараметрыНГГ.Наименование"; 
	
	ТаблицаНГГ.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

