

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ТекущееРасписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		ТекущееРасписание = Новый РасписаниеРегламентногоЗадания();
		ТекущееРасписание.ДатаНачала	= ДатаНачала;
		ТекущееРасписание.ДатаКонца		= ДатаКонца;
	КонецЕсли;
	
	Если ТекущееРасписание.ПериодПовтораДней = 0 Тогда
		ТекущееРасписание.ПериодПовтораДней = 1;
	КонецЕсли;
	
	ЗаполнитьРеквизитыФормыПоРасписанию(ЭтотОбъект, ТекущееРасписание);
	
	ПредставлениеРасписания = ПолучитьПредставлениеРасписанияСервер(ТекущееРасписание);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачала			= Параметры.ДатаНачала;
	ДатаКонца			= Параметры.ДатаКонца;
	ТекущееРасписание	= Параметры.ТекущееРасписание;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененияРеквизитовРасписанияОбщий(Элемент)
	ЗаполнитьРасписаниеПоРеквизитамФормы(ЭтотОбъект, ТекущееРасписание);
	ПредставлениеРасписания = ПолучитьПредставлениеРасписанияКлиент(ТекущееРасписание);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(ТекущееРасписание);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура СброситьЗначенияРеквизитов(Форма)
	Форма.Январь	= Ложь;
	Форма.Февраль	= Ложь;
	Форма.Март		= Ложь;
	Форма.Апрель	= Ложь;
	Форма.Май		= Ложь;
	Форма.Июнь		= Ложь;
	Форма.Июль		= Ложь;
	Форма.Август	= Ложь;
	Форма.Сентябрь	= Ложь;
	Форма.Октябрь	= Ложь;
	Форма.Ноябрь	= Ложь;
	Форма.Декабрь	= Ложь;
	
	Форма.Пн	= Ложь;
	Форма.Вт	= Ложь;
	Форма.Ср	= Ложь;
	Форма.Чт	= Ложь;
	Форма.Пт	= Ложь;
	Форма.Сб	= Ложь;
	Форма.Вс	= Ложь;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыФормыПоРасписанию(Форма, Расписание)
	СброситьЗначенияРеквизитов(Форма);
	
	// Перенос совпадающих по именам атрибутов.
	ЗаполнитьЗначенияСвойств(Форма, Расписание);
	
	// Дни недели
	Для Каждого н Из Расписание.ДниНедели Цикл
		Если н = 1 Тогда
			Форма.Пн = Истина;
		ИначеЕсли н = 2 Тогда
			Форма.Вт = Истина;
		ИначеЕсли н = 3 Тогда
			Форма.Ср = Истина;
		ИначеЕсли н = 4 Тогда
			Форма.Чт = Истина;
		ИначеЕсли н = 5 Тогда
			Форма.Пт = Истина;
		ИначеЕсли н = 6 Тогда
			Форма.Сб = Истина;
		ИначеЕсли н = 7 Тогда
			Форма.Вс = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Месяцы
	Для Каждого н Из Расписание.Месяцы Цикл
		Если н = 1 Тогда
			Форма.Январь = Истина;
		ИначеЕсли н = 2 Тогда
			Форма.Февраль = Истина;
		ИначеЕсли н = 3 Тогда
			Форма.Март = Истина;
		ИначеЕсли н = 4 Тогда
			Форма.Апрель = Истина;
		ИначеЕсли н = 5 Тогда
			Форма.Май = Истина;
		ИначеЕсли н = 6 Тогда
			Форма.Июнь = Истина;
		ИначеЕсли н = 7 Тогда
			Форма.Июль = Истина;
		ИначеЕсли н = 8 Тогда
			Форма.Август = Истина;
		ИначеЕсли н = 9 Тогда
			Форма.Сентябрь = Истина;
		ИначеЕсли н = 10 Тогда
			Форма.Октябрь = Истина;
		ИначеЕсли н = 11 Тогда
			Форма.Ноябрь = Истина;
		ИначеЕсли н = 12 Тогда
			Форма.Декабрь = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Расписание.ДеньВМесяце >= 0 Тогда
		Форма.ДеньВМесяцеСНачалаСКонца = 1;
		Форма.ДеньВМесяце = Расписание.ДеньВМесяце;
	Иначе
		Форма.ДеньВМесяцеСНачалаСКонца = -1;
		Форма.ДеньВМесяце = - Расписание.ДеньВМесяце;
	КонецЕсли;
	
	Если Расписание.ДеньНеделиВМесяце >= 0 Тогда
		Форма.ДеньНеделиВМесяцеСНачалаСКонца = 1;
		Форма.ДеньНеделиВМесяце = Расписание.ДеньНеделиВМесяце;
	Иначе
		Форма.ДеньНеделиВМесяцеСНачалаСКонца = -1;
		Форма.ДеньНеделиВМесяце = - Расписание.ДеньНеделиВМесяце;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРасписаниеПоРеквизитамФормы(Форма, Расписание)
	// Перенос совпадающих по именам атрибутов.
	ЗаполнитьЗначенияСвойств(Расписание, Форма);
	Расписание.ДатаНачала	= Форма.ДатаНачала;
	Расписание.ДатаКонца	= Форма.ДатаКонца;
	
	// Дни недели
	Расписание.ДниНедели.Очистить();
	МассивДниНедели = Новый Массив();
	Если Форма.Пн Тогда
		МассивДниНедели.Добавить(1);
	КонецЕсли;
	Если Форма.Вт Тогда
		МассивДниНедели.Добавить(2);
	КонецЕсли;
	Если Форма.Ср Тогда
		МассивДниНедели.Добавить(3);
	КонецЕсли;
	Если Форма.Чт Тогда
		МассивДниНедели.Добавить(4);
	КонецЕсли;
	Если Форма.Пт Тогда
		МассивДниНедели.Добавить(5);
	КонецЕсли;
	Если Форма.Сб Тогда
		МассивДниНедели.Добавить(6);
	КонецЕсли;
	Если Форма.Вс Тогда
		МассивДниНедели.Добавить(7);
	КонецЕсли;
	Расписание.ДниНедели = МассивДниНедели;
	
	// Месяцы
	Расписание.Месяцы.Очистить();
	МассивМесяцы = Новый Массив();
	Если Форма.Январь Тогда
		МассивМесяцы.Добавить(1);
	КонецЕсли;
	Если Форма.Февраль Тогда
		МассивМесяцы.Добавить(2);
	КонецЕсли;
	Если Форма.Март Тогда
		МассивМесяцы.Добавить(3);
	КонецЕсли;
	Если Форма.Апрель Тогда
		МассивМесяцы.Добавить(4);
	КонецЕсли;
	Если Форма.Май Тогда
		МассивМесяцы.Добавить(5);
	КонецЕсли;
	Если Форма.Июнь Тогда
		МассивМесяцы.Добавить(6);
	КонецЕсли;
	Если Форма.Июль Тогда
		МассивМесяцы.Добавить(7);
	КонецЕсли;
	Если Форма.Август Тогда
		МассивМесяцы.Добавить(8);
	КонецЕсли;
	Если Форма.Сентябрь Тогда
		МассивМесяцы.Добавить(9);
	КонецЕсли;
	Если Форма.Октябрь Тогда
		МассивМесяцы.Добавить(10);
	КонецЕсли;
	Если Форма.Ноябрь Тогда
		МассивМесяцы.Добавить(11);
	КонецЕсли;
	Если Форма.Декабрь Тогда
		МассивМесяцы.Добавить(12);
	КонецЕсли;
	Расписание.Месяцы = МассивМесяцы;
	
	Расписание.ДеньВМесяце = Форма.ДеньВМесяце * Форма.ДеньВМесяцеСНачалаСКонца;
	Расписание.ДеньНеделиВМесяце = Форма.ДеньНеделиВМесяце * Форма.ДеньНеделиВМесяцеСНачалаСКонца;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ СЕРВЕР

&НаСервере
Функция ПолучитьПредставлениеРасписанияСервер(Расписание, ОграничитьДлиной = Неопределено)
	Возврат CRM_МетодыМодулейМенеджеровСправочников.ПолучитьПредставлениеРасписания(Расписание);
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ КЛИЕНТ

&НаКлиенте
Функция ПолучитьПредставлениеРасписанияКлиент(Расписание)
	РасписаниеСтрока = Строка(Расписание);
	ПозицияТочкаСЗапятой = Найти(РасписаниеСтрока, ";");
	Если ПозицияТочкаСЗапятой > 0 Тогда
		РасписаниеСтрока = Лев(РасписаниеСтрока, ПозицияТочкаСЗапятой - 1);
	КонецЕсли;
	Возврат РасписаниеСтрока;
КонецФункции

#КонецОбласти 

