
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
	Если Объект.СписокЗначений Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			НоваяСтрока = Объект.Значения.Добавить();
			НоваяСтрока.Значение = Объект.Значение;
			Объект.Значение = Неопределено;
		КонецЕсли;
		
	Иначе
		Если Объект.Значения.Количество() > 0 Тогда
			Объект.Значение = Объект.Значения[0].Значение;
			Объект.Значения.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоступность()
    
    Если Объект.СписокЗначений Тогда
        Элементы.Значение.Видимость=Ложь;
        Элементы.Значения.Видимость=Истина;      
        Элементы.ИспользоватьТЧСписокЗначений.Видимость=Ложь;
        Элементы.ТЧСписокЗначений.Видимость=Ложь; 
    ИначеЕсли Объект.ИспользоватьТЧСписокЗначений Тогда    
        Элементы.Значение.Видимость=Ложь;
        Элементы.Значения.Видимость=Ложь;      
        Элементы.СписокЗначений.Видимость=Ложь;
        Элементы.ТЧСписокЗначений.Видимость=Истина; 
    Иначе
        Элементы.Значение.Видимость = Истина;  
        Элементы.Значения.Видимость=Ложь;
        Элементы.СписокЗначений.Видимость=Истина;
        Элементы.ИспользоватьТЧСписокЗначений.Видимость=Истина;
        Элементы.ТЧСписокЗначений.Видимость=Ложь; 
    КонецЕсли; 
    
    //++ смарт:Подкин #986 19.04.2022 13:39:29
    Элементы.РежимПароля.Доступность=Объект.Значение=Неопределено ИЛИ ТипЗнч(Объект.Значение)=Тип("Строка");
    Если Объект.РежимПароля И ТипЗнч(Объект.Значение)=Тип("Строка") Тогда
    	Элементы.Значение.РежимПароля=Истина;
    КонецЕсли;
    //-- смарт:Подкин #986 19.04.2022 13:39:29
    
    //Элементы.Значение.Видимость = НЕ Объект.СписокЗначений;
    //Элементы.Значения.Видимость = Объект.СписокЗначений;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТЧСписокЗначенийПриИзменении(Элемент)
    ИспользоватьТЧСписокЗначенийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьТЧСписокЗначенийПриИзмененииНаСервере()
      НастроитьВидимостьДоступность();
КонецПроцедуры

//++ смарт:Подкин #986 19.04.2022 13:40:42
&НаКлиенте
Процедура РежимПароляПриИзменении(Элемент)  
    
    Если Не Объект.РежимПароля И ТипЗнч(Объект.Значение)=Тип("Строка") И ЗначениеЗаполнено(Объект.Значение) Тогда
        ОписаниеОповещения = Новый ОписаниеОповещения("ОчисткаПоляЗначение", ЭтотОбъект);
        ПоказатьВопрос(ОписаниеОповещения, "При снятии защиты будет очищено поле Значение!",РежимДиалогаВопрос.ДаНет, 60);  
    Иначе
        Элементы.Значение.РежимПароля=(ТипЗнч(Объект.Значение)=Тип("Строка")) И Объект.РежимПароля;	
    КонецЕсли;
    
 КонецПроцедуры //-- смарт:Подкин #986 19.04.2022 13:40:42

//++ смарт:Подкин #986 19.04.2022 14:53:36
&НаКлиенте
Процедура ОчисткаПоляЗначение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
        Объект.Значение="";
        Элементы.Значение.РежимПароля=Ложь;
    Иначе
        Объект.РежимПароля=Истина; 
    КонецЕсли; 
    
КонецПроцедуры //-- смарт:Подкин #986 19.04.2022 14:53:36

//&НаКлиенте
//Процедура УправлениеВидимостьюТЗ()
//	
//	Если мРежимВыбораКолонок Тогда
//		Элементы.ТаблицаЗначений.Видимость = Ложь;
//		Элементы.СтруктураКолонок.Видимость = Истина;
//	Иначе
//		Элементы.ТаблицаЗначений.Видимость = Истина;
//		Элементы.СтруктураКолонок.Видимость = Ложь;
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура Колонки(Команда)

//	мРежимВыбораКолонок = Истина;
//	УправлениеВидимостьюТЗ();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗакрытьНастройкуКолонок(Команда)

//	мРежимВыбораКолонок = Ложь;
//	УправлениеВидимостьюТЗ();
//	
//КонецПроцедуры
