
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул","СегментАппаратноеОбеспечение"); 
	Если ЗначениеЗаполнено(СегментОборудование) Тогда		
		Для Каждого Оборудование Из ЭтаФорма.Параметры.ОборудованиеДляДоговора Цикл
			Если ЗначениеЗаполнено(Оборудование) И СегментыСервер.ВходитВСегмент(Оборудование, СегментОборудование, , Ложь) Тогда
				НоваяСтрока 			 = ТаблицаОборудования.Добавить(); 
				НоваяСтрока.НомерСтроки	 = ТаблицаОборудования.Количество();
				НоваяСтрока.Оборудование = Оборудование;
				НоваяСтрока.ШаблонБренда = смартШаблоныПечатныхФормСервер.ПолучитьШаблонБрэндаНоменклатуры(Оборудование);
				НоваяСтрока.НетШаблона 	 = НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонБренда);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДоговор(Команда)  
	
	Отказ = Ложь;
	
	Если ТаблицаОборудования.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать договор лизинга: Таблица оборудования не заполнена",,,,Отказ);
	КонецЕсли;  
	
	//++ #5942 смарт: Тимофеева 05.03.26 / Задание на подготовку проекта договора поставки. Договор Лизинга.
	//Для Каждого СтрокаОборудования Из ТаблицаОборудования Цикл
	//	Если СтрокаОборудования.НетШаблона Тогда
	//		ТекстСообщения = СтрШаблон("Не удалось записать договор лизинга: Для оборудования %1 не найден шаблон", СтрокаОборудования.Оборудование);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	//	КонецЕсли;
	//КонецЦикла; 
	//-- #5942 смарт: Тимофеева 05.03.26
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Владелец 	 = ЭтаФорма.ВладелецФормы.Объект;
	ЗаказКлиента = Владелец.Ссылка;
		
	НовыйДоговор = СоздатьДоговорНаСервере(ЗаказКлиента);
	
	Если НЕ НовыйДоговор = Неопределено Тогда
		Владелец.Договор = НовыйДоговор;
		
		МассивСообщений = Новый Массив;
		ОтправитьУведомление(МассивСообщений, ЗаказКлиента, НовыйДоговор);
		
		СтруктураДляВладельца = Новый Структура;
		СтруктураДляВладельца.Вставить("НовыйДоговор",		НовыйДоговор); 
		СтруктураДляВладельца.Вставить("МассивСообщений",	МассивСообщений);
		
		Оповестить("СозданДоговорЛизинга", СтруктураДляВладельца, ЭтаФорма);
		ЭтаФорма.Закрыть(); 	
	КонецЕсли;	            
	
КонецПроцедуры // СоздатьДоговор

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДоговорНаСервере(ЗаказКлиента)
    Результат 	 = Неопределено;
	Запрос 		 = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Ссылка КАК смартЗаказКлиента,
	|	""ЛИЗИНГ"" КАК Номер,
	|	""Договор лизинга"" КАК Наименование,
	|   ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем) КАК ТипДоговора,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СоглашенияСКлиентами.ВалютаВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА СоглашенияСКлиентами.ВалютаВзаиморасчетов
	|		ИНАЧЕ ЕСТЬNULL(СоглашенияСКлиентами.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(СоглашенияСКлиентами.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК ГруппаФинансовогоУчета,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует) КАК Статус,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) КАК НалогообложениеНДС,
	//++ #5468 смарт: Тимофеева 26.01.26 / Задание на подготовку проекта договора поставки. Скорректировать установку ставки НДС.
	//|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20) КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22) КАК СтавкаНДС,
	//-- #5468 смарт: Тимофеева 26.01.26
	|	ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.Оборудование) КАК смартВидДоговора,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента) КАК СтатьяДвиженияДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным) КАК ПорядокРасчетов,
	|	ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО ЗаказКлиента.Соглашение = СоглашенияСКлиентами.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();	
	//++ #5942 смарт: Тимофеева 05.03.26 / Задание на подготовку проекта договора поставки. Договор Лизинга.
	//ДоговорОбъект.смартШаблонБренда = ТаблицаОборудования[0].ШаблонБренда;
	//-- #5942 смарт: Тимофеева 05.03.26
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПараметрыСозданияСтрокой = "ВалютаВзаиморасчетов, ГруппаФинансовогоУчета, ХозяйственнаяОперация, Организация, Контрагент, Партнер, БанковскийСчет, НалогообложениеНДС";
		ПараметрыСоздания		 = Новый Структура(ПараметрыСозданияСтрокой);
		ЗаполнитьЗначенияСвойств(ПараметрыСоздания, ВыборкаДетальныеЗаписи);
		ДоговорОбъект.Заполнить(ПараметрыСоздания);
		ЗаполнитьЗначенияСвойств(ДоговорОбъект, ВыборкаДетальныеЗаписи,, ПараметрыСозданияСтрокой);
		ДоговорОбъект.смартТекстЗаданияНаПодготовку = СформироватьТекстЗаданияНаПодготовку(ВыборкаДетальныеЗаписи, ТаблицаОборудования.Выгрузить());
	КонецЕсли;	
		
	Попытка
		ДоговорОбъект.Записать();
		Результат = ДоговорОбъект.Ссылка;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать договор лизинга по %1", ЗаказКлиента));
	КонецПопытки;
	
	Возврат Результат;
КонецФункции // СоздатьДоговорНаСервере 

&НаСервере
Процедура ОтправитьУведомление(МассивСообщений, ЗаказКлиента, ДоговорСсылка)	
    Справочники.ДоговорыКонтрагентов.ОтправитьПисьма(МассивСообщений, ДоговорСсылка.смартТекстЗаданияНаПодготовку, ЗаказКлиента, ДоговорСсылка.Номер);
КонецПроцедуры // ОтправитьУведомление

&НаСервере
Функция СформироватьТекстЗаданияНаПодготовку(ПараметрыДоговора, ТаблицаОборудованияШаблонов)	
	СтруктураОборудования = ПолучитьТекстНоменклатурыИШаблонов(ТаблицаОборудованияШаблонов);
    //++ #5942 смарт: Тимофеева 05.03.26 / Задание на подготовку проекта договора поставки. Договор Лизинга.
	//Возврат СтрШаблон("Создание договора  лизинга по Заказу клиента №%1 от %2
	//				|
	//				|Организация: %3
	//				|Контрагент: %4
	//				|Номенклатура: %5
	//				|Основной шаблон бренда: %6
	//				|Менеджер: %7
	//				|Ссылка на заказ клиента: %8",
	//				ПараметрыДоговора.смартЗаказКлиента.Номер,
	//				Формат(ПараметрыДоговора.смартЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"),
	//				ПараметрыДоговора.Организация,
	//				ПараметрыДоговора.Контрагент,
	//				СтруктураОборудования.Номенклатура,
	//				СтруктураОборудования.Шаблон,
	//				ПараметрыДоговора.Менеджер,
	//				ПолучитьНавигационнуюСсылку(ПараметрыДоговора.смартЗаказКлиента));
	Возврат СтрШаблон("Создание договора  лизинга по Заказу клиента №%1 от %2
					|
					|Организация: %3
					|Контрагент: %4
					|Номенклатура: %5
					|Менеджер: %6
					|Ссылка на заказ клиента: %7",
					ПараметрыДоговора.смартЗаказКлиента.Номер,
					Формат(ПараметрыДоговора.смартЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"),
					ПараметрыДоговора.Организация,
					ПараметрыДоговора.Контрагент,
					СтруктураОборудования.Номенклатура,
					ПараметрыДоговора.Менеджер,
					ПолучитьНавигационнуюСсылку(ПараметрыДоговора.смартЗаказКлиента)); 
	//-- #5942 смарт: Тимофеева 05.03.26
КонецФункции // СформироватьТекстЗаданияНаПодготовку 

&НаСервере
Функция ПолучитьТекстНоменклатурыИШаблонов(ТаблицаОборудованияШаблонов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОборудования.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОборудования.Оборудование КАК Номенклатура,
	|	ТаблицаОборудования.ШаблонБренда КАК Шаблон
	|ПОМЕСТИТЬ ВТ_Оборудование
	|ИЗ
	|	&ТаблицаОборудования КАК ТаблицаОборудования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Оборудование.Шаблон КАК Шаблон,
	|	МИНИМУМ(ВТ_Оборудование.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оборудование.Шаблон
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Оборудование.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|	МИНИМУМ(ВТ_Оборудование.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оборудование.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("ТаблицаОборудования", ТаблицаОборудованияШаблонов);
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();
	МассивНоменклатуры	= РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	МассивШаблонов		= РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Шаблон"); 	
	Возврат Новый Структура("Номенклатура, Шаблон", СтрСоединить(МассивНоменклатуры, "; "), СтрСоединить(МассивШаблонов, "; "));	
КонецФункции // ПолучитьТекстНоменклатурыИШаблонов

#КонецОбласти

//++ #4044 смарт: Тимофеева 22.08.2025 / Задание на подготовку проекта договора поставки. Создание лизингового договора (смарт). Доработка.
//&НаКлиенте
//Процедура СоздатьДоговор(Команда)
//	Владелец=ЭтаФорма.ВладелецФормы.Объект; 
//	Успех=ПроверитьЗаполнение(); 
//	Если Не Успех Тогда
//		Возврат;
//	КонецЕсли;
//	Если СписокСуфиксов.Количество()=0 Тогда
//		Сообщить("Не заполнены шаблоны бренда!");
//		Возврат;
//	Иначе                                                    
//		Успех=Истина;
//		Для Каждого Стр Из СписокСуфиксов Цикл
//			Если НЕ ЗначениеЗаполнено(ЭтаФорма["Оборудование"+Стр.Значение]) Тогда	
//				Сообщить("Оборудование "+Стр.Значение+" не заполнено");
//				Успех=Ложь;
//			КонецЕсли;	
//			Если НЕ ЗначениеЗаполнено(ЭтаФорма["ШаблонБренда"+Стр.Значение]) Тогда	
//				Сообщить("Шаблон бренда "+Стр.Значение+" не заполнен");	
//				Успех=Ложь;
//			КонецЕсли;	
//		КонецЦикла;	
//		Если Не Успех Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;	
//	МассивСообщений = Новый Массив;
//	НовыйДоговор=СоздатьДоговорНаСервере(Владелец,МассивСообщений);
//	Если НовыйДоговор=неопределено Тогда
//		Возврат;
//	КонецЕсли;	
//	СтруктураДляВладельца = Новый Структура;
//	СтруктураДляВладельца.Вставить("НовыйДоговор",НовыйДоговор); 
//	СтруктураДляВладельца.Вставить("МассивСообщений",МассивСообщений);
//	
//	Оповестить("СозданДоговорЛизинга",СтруктураДляВладельца,ЭтаФорма);
//	ЭтаФорма.Закрыть();
//КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	//++ #1497 смарт: Фролов 12.10.2023 //Рефакторинг получения списка шаблонов бренда
//	СписВыб=смартСервер.ПолучитьСписокШаблоновБренда(ЭтаФорма.Параметры.Организация);
//	//-- #1497 смарт: Фролов 12.10.2023

//	КоличествоОборудования=0;
//	Для Каждого Стр Из ЭтаФорма.Параметры.ОборудованиеДляДоговора Цикл
//		КоличествоОборудования=КоличествоОборудования+1;
//	
//		ДобавитьОборудованиеИШаблоны(Стр,"N"+КоличествоОборудования);
//	   	СписокСуфиксов.Добавить("N"+КоличествоОборудования);
//	КонецЦикла; 
//	КомандаУдалитьОборудование = ЭтаФорма.Команды.Добавить("ДобавитьОборудование");
//	КомандаУдалитьОборудование.Картинка = БиблиотекаКартинок.ДобавитьЭлементСписка;
//	КомандаУдалитьОборудование.Действие = "ДобавитьНовоеОборудование";
//	НовыйЭлемент = Элементы.Добавить("КнопкаДобавитьОборудование", Тип("КнопкаФормы"),Элементы.ГруппаОборудованиеИШаблоны);
//	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	НовыйЭлемент.Заголовок = "Добавить";
//	НовыйЭлемент.ИмяКоманды = "ДобавитьОборудование";
//	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
//	НовыйЭлемент.Видимость = Истина;
//	НовыйЭлемент.Доступность = Истина;
//КонецПроцедуры   

//&НаСервере
//Функция СоздатьДоговорНаСервере(Владелец,МассивСообщений)
//	НовыйДоговор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
//	ДанныеДляЗаполнения=Новый Структура();
//	ДанныеДляЗаполнения.Вставить("ВалютаВзаиморасчетов",?(ЗначениеЗаполнено(Владелец.Соглашение.ВалютаВзаиморасчетов),Владелец.Соглашение.ВалютаВзаиморасчетов,Владелец.Соглашение.Валюта));
//	ДанныеДляЗаполнения.Вставить("ГруппаФинансовогоУчета",Владелец.Соглашение.ГруппаФинансовогоУчета);
//	ДанныеДляЗаполнения.Вставить("Контрагент",Владелец.Контрагент);
//	ДанныеДляЗаполнения.Вставить("Организация",Владелец.Организация);
//	ДанныеДляЗаполнения.Вставить("ПометкаУдаления",Ложь);
//	ДанныеДляЗаполнения.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.РеализацияКлиенту); 
//	ДанныеДляЗаполнения.Вставить("БанковскийСчет",Владелец.БанковскийСчет); 
//	ДанныеДляЗаполнения.Вставить("Партнер",Владелец.Партнер);
//	ДанныеДляЗаполнения.Вставить("НалогообложениеНДС",перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
//	НовыйДоговор.Заполнить(ДанныеДляЗаполнения);
//	НовыйДоговор.СтавкаНДС=Перечисления.СтавкиНДС.НДС20;
//	НовыйДоговор.смартВидДоговора = Перечисления.смартВидыДоговоров.Оборудование;
//	НовыйДоговор.Подразделение=Владелец.Подразделение; 
// 	НовыйДоговор.Статус=Перечисления.СтатусыДоговоровКонтрагентов.Действует;
//	Первый=Истина;  
//	СпсШаблонов=Новый СписокЗначений;
//	Для Каждого Стр Из СписокСуфиксов Цикл
//		СтрокасмартШаблоныБренда=НовыйДоговор.смартШаблоныБренда.Добавить();
//		СтрокасмартШаблоныБренда.ШаблонБренда=ЭтаФорма["ШаблонБренда"+Стр.Значение];
//		СтрокасмартШаблоныБренда.Оборудование=ЭтаФорма["Оборудование"+Стр.Значение];
//		Если Первый Тогда
//			НовыйДоговор.смартШаблонБренда=ЭтаФорма["ШаблонБренда"+Стр.Значение];
//			Первый=Ложь;
//		КонецЕсли;
//		Если СпсШаблонов.НайтиПоЗначению(ЭтаФорма["ШаблонБренда"+Стр.Значение])=Неопределено Тогда
//			СпсШаблонов.Добавить(ЭтаФорма["ШаблонБренда"+Стр.Значение]);	
//		КонецЕсли;
//	КонецЦикла;	
//	НовыйДоговор.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента; 
//	НовыйДоговор.смартЗаказКлиента=Владелец.Ссылка;
//	НовыйДоговор.Номер="ЛИЗИНГ";
//	НовыйДоговор.Наименование="Договор лизинга";
//	НовыйДоговор.ПорядокРасчетов=Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
//	НовыйДоговор.смартТекстЗаданияНаПодготовку=СформироватьТекстЗаданияНаПодготовку(Владелец,СпсШаблонов);
//	НовыйДоговор.Записать();
//	Владелец.Договор=НовыйДоговор.Ссылка; 
//	Успех = Справочники.ДоговорыКонтрагентов.ОтправитьПисьма(МассивСообщений,НовыйДоговор.смартТекстЗаданияНаПодготовку,Владелец.Ссылка,НовыйДоговор.Номер) ;
//	Возврат НовыйДоговор.Ссылка;
//КонецФункции 

//&НаСервере
//Функция СформироватьТекстЗаданияНаПодготовку(Владелец,СпсШаблонов)
//	ТекстЗаданияНаПодготовку="Создание договора  лизинга по Заказу клиента №"+Владелец.Номер+" от "+Формат(Владелец.Дата,"ДФ=dd.MM.yyyy")+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Организация: "+Владелец.Организация+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Контрагент: "+Владелец.Контрагент+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Основной шаблон бренда: "+СпсШаблонов[0].Значение+Символы.ПС;
//	Если СпсШаблонов.Количество()>1 Тогда
//		ТекстБренды="";
//		Для Каждого СтрСпсШаблонов Из СпсШаблонов Цикл
//			Если СпсШаблонов[0].Значение <> СтрСпсШаблонов.Значение Тогда
//				ТекстБренды=ТекстБренды+СтрСпсШаблонов.Значение+";";
//			КонецЕсли;
//		КонецЦикла; 
//		ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Другие шаблоны бренда: "+ТекстБренды+Символы.ПС;
//	КонецЕсли;	
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Менеджер: "+Владелец.Менеджер;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+Символы.ПС; 
//	
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Ссылка на заказ клиента: "+ПолучитьНавигационнуюСсылку(Владелец.Ссылка);;
//	Возврат ТекстЗаданияНаПодготовку;	
//КонецФункции 

//&НаСервере
//Процедура ДобавитьОборудованиеИШаблоны(Стр=Неопределено,Суфикс,ЭлементПривязки=Неопределено)
//	ДобавляемыеРеквизиты = Новый Массив;
//	
//	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
//	РеквизитФормы = Новый РеквизитФормы("Оборудование"+Суфикс,ТипРеквизита,"","Оборудование "+Суфикс);
//	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);     
//	КС = Новый КвалификаторыСтроки(100);
//	Массив = Новый Массив;
//	Массив.Добавить(Тип("Строка"));
//	ТипРеквизита = Новый ОписаниеТипов(Массив, , КС);
//	РеквизитФормы = Новый РеквизитФормы("ШаблонБренда"+Суфикс,ТипРеквизита,"","Шаблон бренда "+Суфикс);
//	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);                                                                                     
//	
//	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
//	ЭтаФорма["Оборудование"+Суфикс] = Стр;
//	
//	НовыйЭлемент = Этаформа.Элементы.Вставить("ГруппаОборудование"+Суфикс, Тип("ГруппаФормы"), Элементы.ГруппаОборудованиеИШаблоны,?(ЭлементПривязки=Неопределено,Неопределено,Элементы["КнопкаДобавитьОборудование"]));
//	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
//	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
//	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
//	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
//	
//	ПолеВвода = Элементы.Добавить("ФормаОборудование"+Суфикс, Тип("ПолеФормы"), Элементы["ГруппаОборудование"+Суфикс]);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
//	ПолеВвода.ПутьКДанным = "Оборудование"+Суфикс;
//	
//	ПолеВвода = Элементы.Добавить("ФормаШаблонБренда"+Суфикс, Тип("ПолеФормы"), Элементы["ГруппаОборудование"+Суфикс]);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.Ширина=15;
//	ПолеВвода.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
//	ПолеВвода.ПутьКДанным = "ШаблонБренда"+Суфикс;
//	Элементы["ФормаШаблонБренда"+Суфикс].КнопкаВыпадающегоСписка = Истина;
//	Для Каждого ЭлементСписка Из СписВыб Цикл
//		Элементы["ФормаШаблонБренда"+Суфикс].СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
//	КонецЦикла; 
//	
//	КомандаУдалитьОборудование = ЭтаФорма.Команды.Добавить("УдалитьОборудование"+Суфикс);
//	КомандаУдалитьОборудование.Картинка = БиблиотекаКартинок.УдалитьЭлементСписка;
//	КомандаУдалитьОборудование.Действие = "УдалитьТекущееОборудование";
//	НовыйЭлемент = Элементы.Добавить("КнопкаУдалитьОборудование"+Суфикс, Тип("КнопкаФормы"),Элементы["ГруппаОборудование"+Суфикс]);
//	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	НовыйЭлемент.Заголовок = "Удалить оборудование";
//	НовыйЭлемент.ИмяКоманды = "УдалитьОборудование"+Суфикс;
//	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
//	НовыйЭлемент.Видимость = Истина;
//	НовыйЭлемент.Доступность = Истина;
//КонецПроцедуры                                       
//												   

//&НаКлиенте
//Процедура УдалитьТекущееОборудование()
//	Суфикс=СтрЗаменить(ЭтаФорма.ТекущийЭлемент.ИмяКоманды,"УдалитьОборудование",""); 
//	УдалитьТекущееОборудованиеНаСервере(Суфикс);
//КонецПроцедуры	

//&НаСервере
//Процедура УдалитьТекущееОборудованиеНаСервере(Суфикс)
//	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты(); 
//	МассивУдаляемых = Новый Массив;                                          
//	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
//	    ИмяРеквизита = РеквизитФормы.Имя; 
//		Если СтрНайти(ИмяРеквизита, "Оборудование"+Суфикс) ИЛИ СтрНайти(ИмяРеквизита, "ШаблонБренда"+Суфикс)
//			ИЛИ СтрНайти(ИмяРеквизита, "КнопкаУдалитьОборудование"+Суфикс) ИЛИ СтрНайти(ИмяРеквизита, "ГруппаОборудование"+Суфикс)  Тогда 
//	        МассивУдаляемых.Добавить(ИмяРеквизита);
//	    КонецЕсли;
//	КонецЦикла; 
//	Элементы["КнопкаУдалитьОборудование"+Суфикс].Видимость=Ложь;
//	ИзменитьРеквизиты( , МассивУдаляемых); 
//	НайденныйЭлемент = СписокСуфиксов.НайтиПоЗначению(Суфикс);
//	Если НайденныйЭлемент <> Неопределено Тогда
//    	СписокСуфиксов.Удалить(НайденныйЭлемент); 
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ДобавитьНовоеОборудование() 
//	КоличествоОборудования=КоличествоОборудования+1;
//	ДобавитьОборудованиеИШаблоны(,"N"+КоличествоОборудования,Истина);
//	СписокСуфиксов.Добавить("N"+КоличествоОборудования);
//КонецПроцедуры

//-- #4044 смарт: Тимофеева 22.08.2025
