
////////////////////////////////////////////////////////////////////////////////
// CRM режим форм закладки клиент сервер
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруБланкОписанияФормы() Экспорт
	СтруктураБланк = Новый Структура("ИмяФормы,Параметры", "", Новый Структура);
	Возврат СтруктураБланк;
КонецФункции

Функция СравнитьСтруктуры(Структура1, Структура2) Экспорт
	Если ТипЗнч(Структура1) <> Тип("Структура") Или ТипЗнч(Структура2) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Структура1.Количество() <> Структура2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Структура1 Цикл
		Попытка
			Если Структура1[КлючЗначение.Ключ] <> Структура2[КлючЗначение.Ключ] Тогда
				Возврат Ложь;
			КонецЕсли;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция НайтиФормуВСоставеФорм(ИмяФормы, Параметры, ТекущийСоставОткрытыхФорм) Экспорт
	Для нИндекс = 0 По ТекущийСоставОткрытыхФорм.ВГраница() Цикл
		ОписаниеФормы = ТекущийСоставОткрытыхФорм[нИндекс];
		Если ТипЗнч(ОписаниеФормы) <> Тип("Структура") Тогда Продолжить; КонецЕсли;
		Если Не ОписаниеФормы.Свойство("ИмяФормы") Тогда Продолжить; КонецЕсли;
		
		Если ИмяФормы = ОписаниеФормы.ИмяФормы Тогда
			Если ТипЗнч(Параметры) = Тип("Структура") И ОписаниеФормы.Свойство("Параметры") И ТипЗнч(ОписаниеФормы.Параметры) = Тип("Структура") Тогда
				Если СравнитьСтруктуры(Параметры, ОписаниеФормы.Параметры) Тогда
					Возврат нИндекс;
				КонецЕсли;
			Иначе
				Возврат нИндекс;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

