
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	Если Параметры.Свойство("ТекстПредупреждения") Тогда
		ТекстПредупреждения = Параметры.ТекстПредупреждения;
	КонецЕсли;
	Если Параметры.Свойство("Таймаут") Тогда
		Таймаут = Параметры.Таймаут;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Таймаут) Тогда
		ПодключитьОбработчикОжидания("ЗакрытьПоТаймауту", Таймаут, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьПоТаймауту()
	Закрыть();
КонецПроцедуры

#КонецОбласти




