
#Область ДоработкиСмарт

// Фролов+
Функция ПолучитьВидыНоменклатурыСЦ()Экспорт 
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.ВидыНоменклатуры) КАК УслугиСЦ
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект Ссылка Справочник.ВидыНоменклатуры
	|	И ДополнительныеСведения.Свойство.Имя = ""ЭтоУслугаСЦ""
	|	И ДополнительныеСведения.Значение = ИСТИНА");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УслугиСЦ");
КонецФункции	
// Фролов-

#КонецОбласти