
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ смарт:ММ #048 234 08.06.2020 - Заявка на пусконаладку  
	смартДобавитьЭлементыПрограммно();
	//-- смарт:ММ 08.06.2020
	
КонецПроцедуры

//++ смарт:ММ #048 234 08.06.2020 - Заявка на пусконаладку  
&НаСервере
Процедура смартДобавитьЭлементыПрограммно()
	
	Если Элементы.Найти("смартРуководительСервисногоЦентра") = Неопределено Тогда
		
		НовыйЭлемент = Элементы.Вставить("смартРуководительСервисногоЦентра", Тип("ПолеФормы"), Элементы.ГруппаРеквизиты, Элементы.ГруппаПараметрыПроизводственногоПодразделения);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартРуководительСервисногоЦентра";
		
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 08.06.2020

