
////////////////////////////////////////////////////////////////////////////////
// Методы модулей менеджеров обработок (CRM)
//  
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область ОпределениеФормОбъектов

// Процедура - Обработка получения форм объектов CRM
//
// Параметры:
//  Источник				 - ЗадачаСсылка	 - Источник. 
//  ВидФормы				 - Строка - Имя стандартной формы. 
//  Параметры				 - Струтура	 - Параметры формы. 
//  ВыбраннаяФорма			 - Строка, ФормаКлиентскогоПриложения - Содержит имя открываемой формы или объект метаданных Форма.
//  ДополнительнаяИнформация - Струтура	 - Дополнительная информация открытия формы.
//  СтандартнаяОбработка	 - Булево - Признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаПолученияФормОбъектовCRM(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
    #Область МобильныйКлиент
	
	#Область МоиПродажи
	Если ТипЗнч(Источник) = Тип("ОбработкаМенеджер.CRM_АРМ_МоиПродажи") И ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Если ВидФормы = "Форма" Тогда
			
			ВыбраннаяФорма = "Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаМобильныйКлиент";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти  
	
	#Область КалендарьМенеджера  
	//Если ТипЗнч(Источник) = Тип("ОбработкаМенеджер.CRM_КалендарьМенеджера") Тогда
	Если ТипЗнч(Источник) = Тип("ОбработкаМенеджер.CRM_КалендарьМенеджера") И ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Если ВидФормы = "Форма" Тогда
			
			ВыбраннаяФорма = "Обработка.CRM_КалендарьМенеджера.Форма.ФормаМобильныйКлиент";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область МоиДела
	Если ТипЗнч(Источник) = Тип("ОбработкаМенеджер.CRM_АРМ_МоиДела") И ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		Если ВидФормы = "Форма" Тогда
			
			ВыбраннаяФорма = "Обработка.CRM_АРМ_МоиДела.Форма.ФормаМобильныйКлиент";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти  
	
	#Область МастерРегистрацииОбращения
	//Если ТипЗнч(Источник) = Тип("ОбработкаМенеджер.CRM_МастерРегистрацииОбращения") И ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
	//	
	//	Если ВидФормы = "Форма" Тогда
	//		
	//		ВыбраннаяФорма = "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаМобильныйКлиент";
	//		СтандартнаяОбработка = Ложь;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	#КонецОбласти  
	
	#КонецОбласти  
	
	#Область ПодключениеОбсуждений
	Если ТипЗнч(Источник) = Тип("ОбработкаМенеджер.ПодключениеОбсуждений") Тогда
		
		Если ВидФормы = "Форма" Тогда
			
			ВыбраннаяФорма = "Обработка.ПодключениеОбсуждений.Форма.CRM_Форма";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	// +СофтФон
	#Область ВводКонтактнойИнформации
	Если ВыбраннаяФорма = "Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона" Тогда
		Если Константы.сфпИспользоватьСофтФон.Получить() И
			 Константы.сфпИспользуемаяВерсияСофтФон.Получить() = Перечисления.сфпВерсииСофтФон.СофтФотПроф Тогда
			ВыбраннаяФорма = "ОбщаяФорма.сфпВводТелефона";
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	// -СофтФон
	
КонецПроцедуры

#КонецОбласти // ОпределениеФормОбъектов

#КонецОбласти

