#Область ПрограммныйИнтерфейс

// Записывает операцию бизнес статистики.
//
// Параметры:
//  ИмяОперации	- Строка	- имя операции статистики, в случае отсутствия создается новое.
//  Значение	- Число		- количественное значение операции статистики.
//  Комментарий	- Строка	- произвольный комментарий.
//  Разделитель	- Строка	- разделитель значений в ИмяОперации, если разделитель не точка.
//
Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий = Неопределено, Разделитель = ".") Экспорт
	
	Если ЦентрМониторинга.ЗаписыватьОперацииБизнесСтатистики() Тогда
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		ИдентификаторПользователяИБ = ТекущийПользователь.ИдентификаторПользователяИБ;
		ЗаписатьОперациюБизнесСтатистикиВРегистр(ИмяОперации, Значение, Комментарий, Разделитель,
			 ИдентификаторПользователяИБ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура дополняет параметры структуры JSON.
//
// Параметры:
//  ИмяСекции				 - Строка		 - Имя секции.
//  ДополнительныеПараметры	 - Структура	 - Дополнительные параметры.
//
Процедура ДополнитьПараметрыСтруктурыJSON(ИмяСекции, ДополнительныеПараметры) Экспорт
	
	Если ИмяСекции = "OperationStatistics" Тогда
		ДополнительныеПараметры["КолонкиИндекса"].Вставить("Рарус_ИдентификаторПользователя", Новый Соответствие);
	КонецЕсли;
	
КонецПроцедуры

// +CRM
//Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий = Неопределено,
	// Разделитель = ".") Экспорт

// Записывает операцию бизнес статистики.
//
// Параметры:
//  ИмяОперации					 - Строка					 - Имя операции статистики, в случае отсутствия создается новое.
//  Значение					 - Число					 - Количественное значение операции статистики.
//  Комментарий					 - Строка					 - Произвольный комментарий.
//  Разделитель					 - Строка					 - Разделитель значений в ИмяОперации, если разделитель не точка.
//  ИдентификаторПользователя	 - УникальныйИдентификатор	 - Идентификатор пользователя информационной базы.
//
Процедура ЗаписатьОперациюБизнесСтатистикиВРегистр(ИмяОперации, Значение,
	 Комментарий = Неопределено, Разделитель = ".",
	 ИдентификаторПользователя = "") Экспорт
// -CRM
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодИдентификатораУдаления = ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторинга("ПериодАгрегацииМалый");

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Если МодульРаботаВМоделиСервиса.ИспользованиеРазделителяСеанса() Тогда
			ОбластьДанных = Формат(МодульРаботаВМоделиСервиса.ЗначениеРазделителяСеанса(), "ЧН=0; ЧГ=0");
		Иначе
			ОбластьДанных = Формат(0, "ЧН=0; ЧГ=0");
		КонецЕсли;
	Иначе
		ОбластьДанных = Формат(0, "ЧН=0; ЧГ=0");
	КонецЕсли;
	
	ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	Если Разделитель <> "." Тогда
		ИмяОперации = СтрЗаменить(ИмяОперации, ".", "☼");
		ИмяОперации = СтрЗаменить(ИмяОперации, Разделитель, ".");
	КонецЕсли;
	
	ОперацияСсылка = ЦентрМониторингаПовтИсп.ПолучитьСсылкуОперацииСтатистики(ИмяОперации);
	КомментарийСсылка = РегистрыСведений.КомментарииСтатистики.ПолучитьСсылку(Комментарий, ОперацияСсылка);
	ОбластьДанныхСсылка = РегистрыСведений.ОбластиСтатистики.ПолучитьСсылку(ОбластьДанных);
	
	// +CRM
	//МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи = РегистрыСведений.БуферОперацийСтатистики.СоздатьМенеджерЗаписи();
	// -CRM
	МенеджерЗаписи.ДатаЗаписи = ТекДата;
	МенеджерЗаписи.ИдентификаторУдаления =
		Цел(Цел(ТекДата / 1000) / ПериодИдентификатораУдаления) * ПериодИдентификатораУдаления;
	МенеджерЗаписи.ИдентификаторЗаписи = Новый УникальныйИдентификатор();
	МенеджерЗаписи.ОперацияСтатистики = ОперацияСсылка;
	МенеджерЗаписи.КомментарийСтатистики = КомментарийСсылка;
	МенеджерЗаписи.ОбластьСтатистики = ОбластьДанныхСсылка;
	МенеджерЗаписи.Значение = Значение;
	
	// +CRM
	МенеджерЗаписи.CRM_ИдентификаторПользователя = ИдентификаторПользователя;
	// -CRM
	
	МенеджерЗаписи.Записать(Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	УстановитьОтключениеБезопасногоРежима(Ложь);
	
КонецПроцедуры

// Процедура выполняет записать результатов запроса в регистр сведений "Замеры операции статистики".
//
// Параметры:
//  Замеры	 - РезультатЗапроса	 - Замеры операции статистики.
//
Процедура ЗамерыОперацииСтатистикиЗаписатьРезультатЗапроса(Замеры) Экспорт
	
	Если НЕ Замеры.Пустой() Тогда
		НаборЗаписей = РегистрыСведений.ЗамерыОперацииСтатистики.СоздатьНаборЗаписей();
		
		Выборка = Замеры.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовЗапись = НаборЗаписей.Добавить();
			НовЗапись.Период = Выборка.Период;
			НовЗапись.ОперацияСтатистики = Выборка.ОперацияСтатистики;
			НовЗапись.ИдентификаторУдаления = Выборка.ИдентификаторУдаления;
			НовЗапись.КоличествоЗначений = Выборка.КоличествоЗначений;
			НовЗапись.СуммаЗначений = Выборка.СуммаЗначений;
			НовЗапись.ПериодОкончание = Выборка.ПериодОкончание;
			
			// +CRM
			НовЗапись.CRM_ИдентификаторПользователя = Выборка.CRM_ИдентификаторПользователя;
			// -CRM
			
		КонецЦикла;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
КонецПроцедуры

// Процедура изменяет свойства "ИдентификаторИнформационнойБазы" и "ИдентификаторИнформационнойБазыПостоянный"
// в константе "ПараметрыЦентраМониторинга".
//
Процедура ПараметрыЦентраМониторингаИзменитьИдентификаторИнформационнойБазы() Экспорт
	
	Если ЦентрМониторингаСлужебный.РазделениеПоОбластямДанныхВключено() Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЦентраМониторинга = ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторинга();
	
	НовыйИдентификаторИБ = Новый УникальныйИдентификатор();
	ПараметрыЦентраМониторинга.ИдентификаторИнформационнойБазы = НовыйИдентификаторИБ;
	ПараметрыЦентраМониторинга.ИдентификаторИнформационнойБазыПостоянный = НовыйИдентификаторИБ;
	
	ЦентрМониторингаСлужебный.УстановитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
	
КонецПроцедуры

// Дополняет параметры подключения к серверу статистики.
//
// Параметры:
//  ПараметрыКонстанты	 - Структура - перечень параметров подключения
// 
// Возвращаемое значение:
//  Структура - дополненный перечень параметров подключения.
//
Функция ДополнитьПараметрыПодключения(ПараметрыКонстанты) Экспорт
	
	ПараметрыКонстанты.Вставить("Сервер", "stat.rarus.ru");
	ПараметрыКонстанты.Вставить("АдресРесурса", "RarusQMC/hs/PultQMC/v1/packet/");
	ПараметрыКонстанты.Вставить("АдресРесурсаДляДампов", "RarusQMC/hs/PultQMC/DumpsInfo/");
	ПараметрыКонстанты.Вставить("Порт", 80);
	ПараметрыКонстанты.Вставить("ЗащищенноеСоединение", Ложь);
	
	Возврат ПараметрыКонстанты;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
