
#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьФункицональныеОпции(Перезапустить) Экспорт

	// ТехнологияСервиса
	
	Если РаботаВМоделиСервиса.РазделениеВключено() И РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных() Тогда
		Если Пользователи.ЭтоПолноправныйПользователь(, Истина) Тогда
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		ИспользоватьПлатныйТариф = Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги("CRM", "ПлатныйТариф");
		Если ИспользоватьПлатныйТариф <> Константы.CRM_ПлатныйТарифДоступен.Получить() Тогда
			Если НЕ ИспользоватьПлатныйТариф Тогда
				Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
					Константы["CRM_ИспользоватьОграниченияДоступа"].Установить(ИспользоватьПлатныйТариф);
				КонецЕсли;
				Константы.CRM_ИспользоватьТипыУслуг.Установить(ИспользоватьПлатныйТариф);
				Константы.CRM_ИспользоватьБазуЗнаний.Установить(ИспользоватьПлатныйТариф);
				Константы.CRM_ИспользоватьМаркетинговыеМероприятия.Установить(ИспользоватьПлатныйТариф);
			КонецЕсли;
			Константы.CRM_ИспользоватьПоказатели.Установить(ИспользоватьПлатныйТариф);
			Константы.CRM_ИспользоватьТелемаркетинг.Установить(ИспользоватьПлатныйТариф);
			Константы.CRM_ИспользоватьРассылкиЭлектронныхПисем.Установить(ИспользоватьПлатныйТариф);
			Константы.CRM_ПлатныйТарифДоступен.Установить(ИспользоватьПлатныйТариф);
			Перезапустить = Истина;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	ИначеЕсли НЕ РаботаВМоделиСервиса.РазделениеВключено() И Константы.CRM_ПлатныйТарифДоступен.Получить() Тогда
		Константы.CRM_ПлатныйТарифДоступен.Установить(Ложь);
	КонецЕсли;
	// Конец ТехнологияСервиса

КонецПроцедуры

#КонецОбласти