
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("СозданыОтборНажатие")
Функция смарт_СозданыОтборНажатие(Форма, ИмяСписка, ВариантПериода, Элемент, ПолеДата, ВключатьПросроченные)
	Если ВариантПериода = "3Дня" Тогда  // Обработка сохраненных значений
		ВариантПериода = "3 дня";
	КонецЕсли;	
	Если ВариантПериода = "ПроизвольныйПериод" Тогда
		НомерПериода = 0;
	ИначеЕсли ВариантПериода = "Сегодня" Тогда
		НомерПериода = 1;
	ИначеЕсли ВариантПериода = "3 дня" Тогда
		НомерПериода = 2;
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		НомерПериода = 3;
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		НомерПериода = 4;
		
	#Вставка 
	//++ #1914 смарт: Фролов 11.07.2024 //Доработка формы Мои задачи для коммерческого отдела.
	ИначеЕсли ВариантПериода = "Завтра" Тогда
		НомерПериода = 5;
	ИначеЕсли ВариантПериода = "ДоКонцаНедели" Тогда
		НомерПериода = 6;
	ИначеЕсли ВариантПериода = "СегодняКрайнийСрок" Тогда
		НомерПериода = 7;
	//-- #1914 смарт: Фролов 11.07.2024
	#КонецВставки
	
	КонецЕсли;

	Период = Форма.ОтборСозданы[НомерПериода];

	Если Элемент<>Неопределено Тогда
		
		#Удаление //++ #1914 смарт: Фролов 11.07.2024 //Доработка формы Мои задачи для коммерческого отдела.
		Если НомерПериода = 0 Тогда
		#КонецУдаления
		
		#Вставка
		//++ #1914 смарт: Фролов 11.07.2024 //Доработка формы Мои задачи для коммерческого отдела.
		Если НомерПериода = 0 ИЛИ НомерПериода = 5 ИЛИ НомерПериода = 6 ИЛИ НомерПериода = 7 Тогда
		//-- #1914 смарт: Фролов 11.07.2024	
		#КонецВставки
		
			Если ЗначениеЗаполнено(Период.Значение.ДатаНачала) Или ЗначениеЗаполнено(Период.Значение.ДатаОкончания) Тогда
				Период.Пометка = Истина;
			Иначе
				Период.Пометка = Ложь;
			КонецЕсли;
		Иначе
			Период.Пометка = Не Период.Пометка;
		КонецЕсли;

		// Вариант периода может быть выбран только один.
		Для Индекс = 0 По Форма.ОтборСозданы.Количество()-1 Цикл

			ЭлементСпискаПериодов = Форма.ОтборСозданы[Индекс];
			Если ЭлементСпискаПериодов <> Период Тогда
				ЭлементСпискаПериодов.Пометка = Ложь;
			КонецЕсли;

			Если Индекс = 0 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.ОтборСозданыПроизвольныйПериод;
				Если НЕ ЭлементСпискаПериодов.Пометка Тогда
					ЭлементСпискаПериодов.Значение = Новый СтандартныйПериод;
				КонецЕсли;
			ИначеЕсли Индекс = 1 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.ОтборСозданыСегодня;
			ИначеЕсли Индекс = 2 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.ОтборСозданыЗа3Дня;
			ИначеЕсли Индекс = 3 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.ОтборСозданыЗаНеделю;
			ИначеЕсли Индекс = 4 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.ОтборСозданыЗаМесяц;
				
			#Вставка
			//++ #1914 смарт: Фролов 11.07.2024 //Доработка формы Мои задачи для коммерческого отдела.
			ИначеЕсли Индекс = 5 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.смартОтборКрайнийСрокЗавтра;
			ИначеЕсли Индекс = 6 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.смартОтборКрайнийСрокНеделя;
			ИначеЕсли Индекс = 7 Тогда
				ЭлементОтображенияПериода = Форма.Элементы.смартОтборКрайнийСрокСегодня;
			#КонецВставки
			
			Иначе
				Продолжить;
			КонецЕсли;

			Если ЭлементСпискаПериодов.Пометка Тогда
				//ЭлементОтображенияПериода.ЦветФона = ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("ФонАктивногоЗначенияОтбора");
				Если ТипЗнч(ЭлементОтображенияПериода) <> Тип("ПолеФормы") Тогда
					ЭлементОтображенияПериода.ЦветФона = Новый Цвет(220, 220, 220); //Новый Цвет(255, 215, 40);
				КонецЕсли;
			Иначе
				ЭлементОтображенияПериода.ЦветФона = Новый Цвет;
			КонецЕсли;

		КонецЦикла;

		СформироватьЗаголовокВариантаОтбора(Форма.Элементы.ОтборПериод, ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(Форма.ОтборСозданы).Количество());

	КонецЕсли;

	ГруппаОтбораПериод = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Форма[ИмяСписка].Отбор.Элементы, "ОтборПериод", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ГруппаОтбораПериод.Использование = Период.Пометка;
	Если ГруппаОтбораПериод.Элементы.Количество() = 0 Тогда
		Если ПолеДата = "" Тогда
			Если Форма[ИмяСписка].Отбор.ДоступныеПоляОтбора.Элементы.Найти("Дата") = Неопределено Тогда
				ЭлементОтбора = ГруппаОтбораПериод.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаНачала");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = Период.Значение.ДатаНачала;
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора = ГруппаОтбораПериод.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = Период.Значение.ДатаОкончания;
				ЭлементОтбора.Использование = Истина;
			Иначе
				ЭлементОтбора = ГруппаОтбораПериод.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = Период.Значение.ДатаНачала;
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора = ГруппаОтбораПериод.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = Период.Значение.ДатаОкончания;
				ЭлементОтбора.Использование = Истина;
			КонецЕсли;
		Иначе
			Если НЕ ВключатьПросроченные Тогда
				ЭлементОтбора = ГруппаОтбораПериод.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеДата);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = Период.Значение.ДатаНачала;
				ЭлементОтбора.Использование = Истина;
			КонецЕсли;
			ЭлементОтбора = ГруппаОтбораПериод.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеДата);
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ЭлементОтбора.ПравоеЗначение = Период.Значение.ДатаОкончания;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
	ИначеЕсли ГруппаОтбораПериод.Элементы.Количество() = 2 Тогда
		ГруппаОтбораПериод.Элементы[0].ПравоеЗначение = Период.Значение.ДатаНачала;
		ГруппаОтбораПериод.Элементы[1].ПравоеЗначение = Период.Значение.ДатаОкончания;
	КонецЕсли;

	Возврат Период.Пометка;

КонецФункции

#КонецОбласти