
//++#1558 смарт: Лопато 14.11.2023 //Доработка фильтров АРМ Мои продажи  
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	#Вставка //++ #1820 смарт: Фролов 20.05.2024 //Доработка обработки "Мои продажи" -
	смартГруппаОтборы = Этаформа.Элементы.Вставить("смартГруппаОтборы", Тип("ГруппаФормы"), Элементы.ГруппаАРМ, Элементы.ГруппаВоронка);
	смартГруппаОтборы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаОтборы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	смартГруппаОтборы.ОтображатьЗаголовок = Ложь;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаПоказателей", Новый ОписаниеТипов("ТаблицаЗначений")));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Показатель", Новый ОписаниеТипов("Строка"), "ТаблицаПоказателей" , "Показатель"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)), "ТаблицаПоказателей" , "Количество"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"), "ТаблицаПоказателей", "Партнер"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТипУслуги", Новый ОписаниеТипов("СправочникСсылка.CRM_ТипУслуги"), "ТаблицаПоказателей", "ТипУслуги"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Квалификация", Новый ОписаниеТипов("СправочникСсылка.смартКвалификацииМенеджеров"), "ТаблицаПоказателей", "Квалификация"));
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	ПолеТаблицаПоказателей = Элементы.Вставить("смартТаблицаПоказателей", Тип("ТаблицаФормы"), Элементы.смартГруппаОтборы, Неопределено);
	ПолеТаблицаПоказателей.ПутьКДанным = "ТаблицаПоказателей";
	ПолеТаблицаПоказателей.Отображение = ОтображениеТаблицы.Список;
	ПолеТаблицаПоказателей.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ПолеТаблицаПоказателей.ТолькоПросмотр = Истина;
	ПолеТаблицаПоказателей.ЦветФона = Новый Цвет(255, 255, 255);
	ПолеТаблицаПоказателей.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеТаблицаПоказателей.Шапка = Ложь;
	ПолеТаблицаПоказателей.ЧередованиеЦветовСтрок = Ложь;
	ПолеТаблицаПоказателей.Ширина = 28;
	ПолеТаблицаПоказателей.АвтоМаксимальнаяШирина = Ложь;
	ПолеТаблицаПоказателей.ГоризонтальныеЛинии = Ложь;
	ПолеТаблицаПоказателей.РастягиватьПоГоризонтали = Ложь;
	ПолеТаблицаПоказателей.ЦветРамки = Новый Цвет(250, 250, 250);
	ПолеТаблицаПоказателей.ЦветФона = Новый Цвет(240, 240, 240);
	ПолеТаблицаПоказателей.УстановитьДействие("Выбор", "смартТаблицаПоказателейВыбор");
	
	НоваяКолонка = Элементы.Добавить("ТаблицаПоказателейПоказатель", Тип("ПолеФормы"), Элементы.смартТаблицаПоказателей);
	НоваяКолонка.Заголовок = "Показатель";
	НоваяКолонка.ПутьКДанным = "ТаблицаПоказателей.Показатель";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Ширина = 25;
	НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 10, Истина, , Истина);
	НоваяКолонка.ЦветТекста = Новый Цвет(28, 85, 174);
	НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НоваяКолонка = Элементы.Добавить("ТаблицаПоказателейКоличество", Тип("ПолеФормы"), Элементы.смартТаблицаПоказателей);
	НоваяКолонка.Заголовок = "Количество";
	НоваяКолонка.ПутьКДанным = "ТаблицаПоказателей.Количество";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Ширина = 3;
	НоваяКолонка.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 10, Истина, , Истина);
	НоваяКолонка.ЦветТекста = Новый Цвет(28, 85, 174);
	НоваяКолонка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартТаблицаПоказателейЗаголовок", Тип("ДекорацияФормы"), смартГруппаОтборы, Элементы.смартТаблицаПоказателей);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "Быстрые отборы";
	НовыйЭлемент.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 12, Истина,,Ложь);
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартТаблицаПоказателейКоличество", Тип("ДекорацияФормы"), смартГруппаОтборы, Элементы.смартТаблицаПоказателей);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Шрифт = Новый Шрифт(НоваяКолонка.Шрифт, "Arial", 12, Истина,,Ложь);
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ГруппаЭлементовОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПоказателей.Показатель"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;  
	ЭлементОтбора.ПравоеЗначение = "Просроченные";  
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПоказателей.Количество"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;  
	ЭлементОтбора.ПравоеЗначение = 0;     
	ЭлементОтбора.Использование = Истина;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();      
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("смартТаблицаПоказателей");
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	ПолеОформления.Использование = Истина; 
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ГруппаЭлементовОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПоказателей.Количество"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;  
	ЭлементОтбора.ПравоеЗначение = 0;     
	ЭлементОтбора.Использование = Истина;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();      
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("смартТаблицаПоказателей");
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
	ПолеОформления.Использование = Истина;
	
	
	#КонецВставки
	
	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		
		// +Рарус alexpr
		//CRM_ЛицензированиеЭкспортныеМетоды.ВывестиУведомлениеОНедоступности(НСтр("ru = 'АРМ ""Мои продажи""'"));
		ТекстСообщения = НСтр("ru = 'Невозможно открыть АРМ ""Мои продажи"".
                               |Подсистема 1С:CRM не используется! (отключено в Персональных настройках)'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		// +Рарус alexpr
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПриСозданииНаСервере(ЭтотОбъект,
		 Отказ,
		 СтандартнаяОбработка);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущаяРоль = Справочники.РолиИсполнителей.ПустаяСсылка();
	ОтборПоРолиУстановлен = Истина;
	ВидАРМ = "Канбан";
	
	ИнициализироватьДанныеВоронкиПродаж();
	
	CRM_Теги.ОбновитьЗначенияОтбораПериодов(ЭтотОбъект, Истина);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодПросроченных", НачалоДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодТекущих", КонецДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодПросроченных", НачалоДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодТекущих", КонецДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ТекстФайл", НСтр("ru = 'Файл...'; en = 'File...'"),
		 Истина);
	CRM_СмещениеДатыТекущегоСеанса = СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "CRM_СмещениеДатыТекущегоСеанса",
		 CRM_СмещениеДатыТекущегоСеанса);
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -Рабочий стол
	
	// +Виджеты
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		ВидимостьВиджетов = ХранилищеОбщихНастроек.Загрузить(ЭтотОбъект.ИмяФормы, "ПоказыватьПанельВиджетов");
		ПоказыватьВиджетыПриОткрытии = ?(ВидимостьВиджетов <> Неопределено, ВидимостьВиджетов, Ложь);
		Элементы.ГруппаВиджеты.Видимость = ПоказыватьВиджетыПриОткрытии;
		Элементы.СкрытьОтобразитьВиджеты.Пометка = ПоказыватьВиджетыПриОткрытии;
		Элементы.СкрытьОтобразитьВиджеты.Видимость = Истина;
	Иначе
		ВидимостьВиджетов = Ложь;
		ПоказыватьВиджетыПриОткрытии = Ложь;
		Элементы.СкрытьОтобразитьВиджеты.Видимость = Ложь;
		Элементы.ГруппаВиджеты.Видимость = Ложь;
	КонецЕсли;
	Если ПоказыватьВиджетыПриОткрытии Тогда
		ОбновитьВиджетыФормы();
	КонецЕсли;
	// -Виджеты
	
	СписокПериодов.Добавить("ПроизвольныйПериод", НСтр("ru='Произвольный период';en='Custom Period'"));
	СписокПериодов.Добавить("Сегодня", НСтр("ru='Сегодня';en='Today'"));
	СписокПериодов.Добавить("3 дня", НСтр("ru='3 дня';en='3 days'"));
	СписокПериодов.Добавить("Неделя", НСтр("ru='Неделя';en='Week'"));
	СписокПериодов.Добавить("Месяц", НСтр("ru='Месяц';en='Month'"));
	
	КлючОбъекта = "Обработка.CRM_АРМ_МоиПродажи.Форма.Форма/ТекущиеДанные";
	Настройки = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта, "", Новый Соответствие);
	НастройкиСтруктура = Новый Структура;
	Для Каждого КлючИЗначение Из Настройки Цикл
		Если ТипЗнч(КлючИЗначение.Ключ) = Тип("Строка") Тогда
			НастройкиСтруктура.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиСтруктура);
	КонецЦикла;
	
	Если Настройки.Количество() > 0 Тогда
		
		ПоискКлиент = Настройки.Получить("ПоискКлиент");
		ПоискИсточникПривлечения = Настройки.Получить("ПоискИсточникПривлечения");
		ПоискЗначениеИсточникаПривлечения = Настройки.Получить("ПоискЗначениеИсточникаПривлечения");
		ПоискТипУслуги = Настройки.Получить("ПоискТипУслуги");
		ВоронкаПродаж = Настройки.Получить("ВоронкаПродаж");
		ВариантПериода = Настройки.Получить("ВариантПериода");
		ПериодОтбора =  Настройки.Получить("ПериодОтбора");
		//ОтборСозданы[0].Значение = ПериодОтбора;
		
		ОтборВключатьПросроченные = Настройки.Получить("ОтборВключатьПросроченные");
		Если Не ЗначениеЗаполнено(ОтборВключатьПросроченные) Тогда
			ОтборВключатьПросроченные = 2;
		КонецЕсли;
	КонецЕсли;
	
	Если ВоронкаПродаж.Пустая() ИЛИ ВоронкаПродаж.ПометкаУдаления Тогда
		ВоронкаПродаж = Справочники.CRM_ВоронкиПродаж.Интересы;
		Настройки.Вставить("ВоронкаПродаж", ВоронкаПродаж);
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, "", Настройки);
	КонецЕсли;
	Элементы.ВыборСценария.Заголовок = ВоронкаПродаж;
	
	Если Не ЗначениеЗаполнено(ВариантПериода) Тогда
		#Удаление
		ВариантПериода = "Неделя";
		ПериодОтбора = Новый СтандартныйПериод(ВариантСтандартногоПериода.Следующие7Дней);
		#КонецУдаления
		#Вставка
		ВариантПериода = "ПроизвольныйПериод";
		ПериодОтбора = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
		#КонецВставки
		//ОтборСозданы[0].Значение = ПериодОтбора;
	КонецЕсли;
	
	Если ВариантПериода = "ПроизвольныйПериод" Тогда
		НомерПериода = 0;
	ИначеЕсли ВариантПериода = "Сегодня" Тогда
		НомерПериода = 1;
	ИначеЕсли ВариантПериода = "3 дня" Тогда
		НомерПериода = 2;
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		НомерПериода = 3;
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		НомерПериода = 4;
	КонецЕсли;
	
	Период = ОтборСозданы[НомерПериода];
	ПериодОтбора = ОтборСозданы[НомерПериода].Значение;
	
	Если НомерПериода = 0 Тогда
		Если ЗначениеЗаполнено(Период.Значение.ДатаНачала) Или ЗначениеЗаполнено(Период.Значение.ДатаОкончания) Тогда
			Период.Пометка = Истина;
		Иначе
			Период.Пометка = Ложь;
		КонецЕсли;
	Иначе
		Период.Пометка = Не Период.Пометка;
	КонецЕсли;
	
	// Вариант периода может быть выбран только один.
	Для Индекс = 0 По ОтборСозданы.Количество()-1 Цикл
		ЭлементСпискаПериодов = ОтборСозданы[Индекс];
		Если ЭлементСпискаПериодов <> Период Тогда
			ЭлементСпискаПериодов.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеПериода = СписокПериодов.НайтиПоЗначению(ВариантПериода);
	Если ЗначениеПериода<>Неопределено Тогда
		ПредставлениеПериода = ЗначениеПериода.Представление;
	КонецЕсли;
	
	Календарь = Константы.ОсновнойКалендарьПредприятия.Получить();
	
	ВоронкаПродажПриИзмененииНаСервере();
	
	Элементы.ГруппаНеРазобрано.Видимость = НЕ СкрытьКолонкуОбращения;
	НеРазобраноСводныеДанные_Видимость();
	Если НеРазобраноСводныеДанные_ПериодОбновления = 0 Тогда
		НеРазобраноСводныеДанные_ПериодОбновления = 1;
	КонецЕсли;
	
	ОбновитьОтборыНаСервере();
	
	СоздатьКнопиОтборПросроченные();
	СоздатьКнопкиВидАРМ();
	ПокраситьКнопкиПросроченныеНаСервере();
	
	УстановитьШиринуЭлементовКоманднойПанели();
	
	// +Рарус alexpr
	//// РаспознаваниеРечи
	//РаспознаваниеРечи_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	//// Конец РаспознаваниеРечи
	// -Рарус alexpr
	
	CRM_ОбщегоНазначенияСервер.ЗакончитьЗамерВремениСозданияФормы(ЭтотОбъект, ВремяНачалаЗамера);
	
	// +Рарус alexpr
	Элементы.ОткрытьПутьКлиента.Видимость = Ложь;
	// -Рарус alexpr
	
КонецПроцедуры //--#1558 смарт: Лопато 14.11.2023

&НаСервере
&После("ДобавитьСвернутыеТаблицы")
Процедура смарт_ДобавитьСвернутыеТаблицы(ГруппаДобавления)
	
	//++ #1498 смарт: Фролов 26.02.2024 //Оптимизациия запроса получения данных
	//++ #1498 смарт: Фролов 18.10.2023 //Разработать план продаж
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//		|	ВыручкаПлан.Период КАК Период,
	//		|	ВыручкаПлан.Менеджер КАК Менеджер,
	//		|	СУММА(ВыручкаПлан.СуммаПлан) КАК СуммаПлан,
	//		|	СУММА(ЕСТЬNULL(ВыручкаФакт.СуммаФакт, 0)) КАК СуммаФакт
	//		|ИЗ
	//		|	(ВЫБРАТЬ
	//		|		смартПланПродажПоМенеджерамОбороты.Период КАК Период,
	//		|		смартПланПродажПоМенеджерамОбороты.Менеджер КАК Менеджер,
	//		|		СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СуммаПлан
	//		|	ИЗ
	//		|		РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Менеджер = &ТекущийПользователь) КАК смартПланПродажПоМенеджерамОбороты
	//		|	
	//		|	СГРУППИРОВАТЬ ПО
	//		|		смартПланПродажПоМенеджерамОбороты.Период,
	//		|		смартПланПродажПоМенеджерамОбороты.Менеджер) КАК ВыручкаПлан
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//		|			НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК Документ.ЗаказКлиента).ДатаЗакрытия, МЕСЯЦ) КАК ДатаЗакрытия,
	//		|			ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК Документ.ЗаказКлиента).Менеджер КАК Менеджер,
	//		|			СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручкиОборот) КАК СуммаФакт
	//		|		ИЗ
	//		|			РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	//		|					,
	//		|					,
	//		|					,
	//		|					ВЫРАЗИТЬ(ЗаказКлиента КАК Документ.ЗаказКлиента) В
	//		|						(ВЫБРАТЬ
	//		|							ЗаказыКлиента.Ссылка
	//		|						ИЗ
	//		|							Документ.заказКлиента КАК ЗаказыКлиента
	//		|						ГДЕ
	//		|							ЗаказыКлиента.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
	//		|							И ЗаказыКлиента.Менеджер = &ТекущийПользователь)) КАК ВыручкаИСебестоимостьПродаж
	//		|		
	//		|		СГРУППИРОВАТЬ ПО
	//		|			НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК Документ.ЗаказКлиента).ДатаЗакрытия, МЕСЯЦ),
	//		|			ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК Документ.ЗаказКлиента).Менеджер) КАК ВыручкаФакт
	//		|		ПО (ВыручкаПлан.Период = ВыручкаФакт.ДатаЗакрытия)
	//		|			И (ВыручкаПлан.Менеджер = ВыручкаФакт.Менеджер)
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ВыручкаПлан.Период,
	//		|	ВыручкаПлан.Менеджер";
	//	
	//Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	//Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ТекущаяДата()));
	//Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(ТекущаяДата()));
	//Результат = Запрос.Выполнить().Выгрузить();
	Результат = смартСервер.ПолучитьДанныеПланФактПоМенеджеру(Новый Структура("ТекущийПользователь,ДатаНачала,ДатаОкончания",
		ПараметрыСеанса.ТекущийПользователь,НачалоГода(ТекущаяДата()),КонецГода(ТекущаяДата())));
	//-- #1498 смарт: Фролов 26.02.2024
	
	Если Результат.Количество()>0 Тогда
		НадписьДляПлана="Годовой план: ";
		ПроцентВыполнения=?(Результат.Итог("СуммаПлан")>0,Формат(Результат.Итог("СуммаФакт")/Результат.Итог("СуммаПлан")*100,"ЧЦ=4; ЧН=0"),0);	
		НадписьДляПлана=НадписьДляПлана+Результат.Итог("СуммаПлан")+" / "+ПроцентВыполнения+"%"+Символы.ПС;	
		
		СтрокиРезультат=Результат.НайтиСтроки(Новый Структура("Период",НачалоМесяца(ТекущаяДата())));
		Если  СтрокиРезультат.Количество()>0 Тогда
			ПроцентВыполнения=?(СтрокиРезультат[0].СуммаПлан>0,Формат(СтрокиРезультат[0].СуммаФакт/СтрокиРезультат[0].СуммаПлан*100,"ЧЦ=4; ЧН=0"),0);
			НадписьДляПлана=НадписьДляПлана+"Текущий план: "+СтрокиРезультат[0].СуммаПлан+" / "+ПроцентВыполнения+"%";
		КонецЕсли;
		
		НовыйЭлемент = Этаформа.Элементы.Добавить("ТекстПланФакт",Тип("ДекорацияФормы"),ГруппаДобавления);
		НовыйЭлемент.Вид  = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок= НадписьДляПлана;
		НовыйЭлемент.ЦветТекста=Новый Цвет(0,150,70); 
	КонецЕсли;
	//-- #1498 смарт: Фролов 18.10.2023
КонецПроцедуры

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаКлиенте
&ИзменениеИКонтроль("ОткрытьФильтр")
Процедура extCRM_ОткрытьФильтр(Команда)

	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("СкрытьПропущенныеТелефонныеЗвонки", СкрытьПропущенныеТелефонныеЗвонки);
	СтруктураФильтра.Вставить("СкрытьОтвеченныеТелефонныеЗвонки", СкрытьОтвеченныеТелефонныеЗвонки);
	СтруктураФильтра.Вставить("СкрытьЗаявки", СкрытьЗаявки);
	СтруктураФильтра.Вставить("СкрытьСообщения", СкрытьСообщения);
	СтруктураФильтра.Вставить("ОтборВключен", ОтборВключен);
	СтруктураФильтра.Вставить("ОтборТеги", ОтборТеги);
	СтруктураФильтра.Вставить("ОтображатьПисьма", ОтображатьПисьма);
	СтруктураФильтра.Вставить("СкрытьКолонкуОбращения", СкрытьКолонкуОбращения);
	СтруктураФильтра.Вставить("СкрытьПовторныеОбращения", СкрытьПовторныеОбращения);
	СтруктураФильтра.Вставить("ПоискПодразделение", ПоискПодразделение);
	СтруктураФильтра.Вставить("ВариантПериода", ВариантПериода);
	СтруктураФильтра.Вставить("ПоискКлиент", ПоискКлиент);
	СтруктураФильтра.Вставить("ПоискТипУслуги", ПоискТипУслуги);
	СтруктураФильтра.Вставить("ПоискПроект", ПоискПроект);
	СтруктураФильтра.Вставить("ТекущийПользователь", ТекущийПользователь);
	СтруктураФильтра.Вставить("ТекущаяРоль", ТекущаяРоль);
	СтруктураФильтра.Вставить("ОтборПоРолиУстановлен", ОтборПоРолиУстановлен);
	СтруктураФильтра.Вставить("ТекущийАвтор", ТекущийАвтор);
	СтруктураФильтра.Вставить("ПоискИсточникПривлечения", ПоискИсточникПривлечения);
	СтруктураФильтра.Вставить("ПоискЗначениеИсточникаПривлечения", ПоискЗначениеИсточникаПривлечения);
	#Вставка
	СтруктураФильтра.Вставить("extCRM_ПоискАвтор", ЭтотОбъект.extCRM_ПоискАвтор);
	#КонецВставки
	
	ПараметрыОткрытия = Новый структура;
	ПараметрыОткрытия.Вставить("СтруктураФильтра", СтруктураФильтра);
	
	ОписаниеОповещенияФильтра = Новый ОписаниеОповещения("ОткрытьФильтрЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаФильтра",
		ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияФильтра, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
&ИзменениеИКонтроль("ОбновитьОтборыНаСервере")
Процедура extCRM_ОбновитьОтборыНаСервере(ВидОтборов, Колонки)

	ОтборыУстановлены = Ложь;
	
	КоличествоФильтров = 0;
	
	МассивТаблиц = Новый СписокЗначений;
	МассивТаблиц.Добавить("НеРазобрано","НеРазобрано");
	МассивТаблиц.Добавить("ТаблицаНеудачно","ТаблицаНеудачно");
	МассивТаблиц.Добавить("ТаблицаУспешно","ТаблицаУспешно");
	МассивТаблиц.Добавить("ТаблицаСписок","ТаблицаСписок");
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		МассивТаблиц.Добавить(Строка.СписокСостояний,ИмяРеквизита);
	КонецЦикла;
	Период = ОтборСозданы.НайтиПоЗначению(ПериодОтбора);
	Если Период = Неопределено Тогда
		Период = ОтборСозданы.Добавить(ПериодОтбора);
	КонецЕсли;

	// Подсчет количества фильтров
	Если ОтборВключен Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПоискКлиент) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискПроект) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискТипУслуги) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискЗначениеИсточникаПривлечения) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискИсточникПривлечения) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если НЕ ОтборПоРолиУстановлен Или ЗначениеЗаполнено(ТекущаяРоль) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийАвтор) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	#Вставка
	Если ЗначениеЗаполнено(ЭтотОбъект.extCRM_ПоискАвтор) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	#КонецВставки
	
	Если ЗначениеЗаполнено(ПоискПодразделение) Тогда
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	ОтборПоОтветственному = ЗначенияОтбораПоОтветственному(ТекущийПользователь, ТекущаяРоль, ОтборПоРолиУстановлен);
	
	#Удаление //++#1558 смарт: Лопато 14.11.2023 //Доработка фильтров АРМ Мои продажи 
	ОтборПоОтветственномуЗаполнен = (ОтборПоОтветственному.Количество() > 1);
	#КонецУдаления //--#1558 смарт: Лопато 14.11.2023
	
	#Вставка
	
	//++#1558 смарт: Лопато 14.11.2023 //Доработка фильтров АРМ Мои продажи  
	ОтборПоОтветственномуЗаполнен = (ОтборПоОтветственному.Количество() > 0);
	//--#1558 смарт: Лопато 14.11.2023
	
	//++ #1808 смарт: Ермаков 06.05.2024 / Доработка обработки Мои продажи - отбор по квалификациям.
	Если ЭтаФорма.смартКвалификация.Количество() Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;		
	КонецЕсли;
	
	Если Не (ЭтаФорма.смартНовые И ЭтаФорма.смартСтарые)
		И (ЭтаФорма.смартНовые Или ЭтаФорма.смартСтарые) Тогда
		
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;		
		
	КонецЕсли;
	//-- #1808 смарт: Ермаков 06.05.2024
	
	#КонецВставки

	ТекущаяДата = ТекущаяДатаСеанса();
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Если ВидОтборов = "СтрокаПоиска" ИЛИ ВидОтборов = "Все" Тогда
			Отбор = ВзаимодействияКлиентСервер.ОтборДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление]);
			ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Отбор.Элементы,
				НСтр("ru='Отбор по строке поиска'"),
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			
			Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "Заголовок",
					 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
					+"%");
			КонецЕсли;	
			
			Если ИмяТаблицы.Представление = "НеРазобрано" Тогда
				Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ТекстОснования",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
				КонецЕсли;
			ИначеЕсли ИмяТаблицы.Представление = "ТаблицаНеудачно"
				 ИЛИ ИмяТаблицы.Представление = "ТаблицаУспешно"
				 Или ИмяТаблицы.Представление = "ТаблицаСписок" Тогда
				Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ПартнерНаименование",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
				КонецЕсли;
			ИначеЕсли ИмяТаблицы.Представление <> "ТаблицаСписок" Тогда	
				Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ОписаниеИнтереса",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ПартнерНаименование",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ВидОтборов = "Период" Или ВидОтборов = "Все" Тогда
			Если ИмяТаблицы.Представление = "ТаблицаНеудачно" Или ИмяТаблицы.Представление = "ТаблицаУспешно" Тогда
				Если ВариантПериода = "Сегодня" Тогда
					ПериодНачалаОтбора = ПериодОтбора.ДатаНачала;
				Иначе
					ДлительностьПериодаОтбора	= ПериодОтбора.ДатаОкончания - ПериодОтбора.ДатаНачала;
					ПериодНачалаОтбора			= НачалоДня(ПериодОтбора.ДатаНачала - ДлительностьПериодаОтбора);
				КонецЕсли;
			Иначе
				ПериодНачалаОтбора = Дата('00010101');
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				 "КрайнийСрокНачало",
				ПериодНачалаОтбора, Период.Пометка);
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				 "КрайнийСрокКонец",
				ПериодОтбора.ДатаОкончания, Период.Пометка);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
			"Пользователь", ОтборПоОтветственному, ОтборПоОтветственномуЗаполнен);
		Если ИмяТаблицы.Представление = "НеРазобрано" Тогда
			
			ВидыКаналов = Новый Массив;
			Если Не СкрытьЗаявки Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.Заявка);
			КонецЕсли;
			Если Не СкрытьСообщения Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.Диалоги);
			КонецЕсли;
			Если НЕ ОтображатьПисьма Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.ЭлектроннаяПочта);
			КонецЕсли;
			Если ПроверитьОтборПоСценариюТелефония(ВоронкаПродаж.СценарийИнтереса) Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.ТелефонныйЗвонок);
			КонецЕсли;
			
			СкрываемыеЗвонки = Новый Массив;
			Если СкрытьПропущенныеТелефонныеЗвонки Тогда
				СкрываемыеЗвонки.Добавить(Перечисления.сфпСостоянияЗвонков.Пропущенный);
			КонецЕсли;
			Если СкрытьОтвеченныеТелефонныеЗвонки Тогда
				СкрываемыеЗвонки.Добавить(Перечисления.сфпСостоянияЗвонков.Отвеченный);
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ВидыКаналов",
				ВидыКаналов, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "БезСценария",
				Не ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ТекущаяДата",
				ТекущаяДата, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ПериодПросроченных",
				НачалоДня(ТекущаяДата), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ПериодТекущих",
				КонецДня(ТекущаяДата), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ИсточникиЛидов",
				ИсточникиЛидовСценария(ВоронкаПродаж.СценарийИнтереса), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "СкрываемыеЗвонки",
				СкрываемыеЗвонки, СкрываемыеЗвонки.Количество()>0);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
				 "СостояниеЛидов", Справочники.CRM_СостоянияЛидов.Новый,
				 СкрытьПовторныеОбращения);

			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
																				"СтрокаТелефонныйЗвонок",
																				НСтр("ru = 'Телефонный звонок'"), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
																				"СтрокаПропущенныйТелефонныйЗвонок",
																				НСтр("ru = 'Пропущенный телефонный звонок'"), Истина);
			
		Иначе
			
			#Удаление
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				"Автор", ТекущийАвтор, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ТекущийАвтор));
			#КонецУдаления
			
			#Вставка
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
				"Автор", ЭтотОбъект.extCRM_ПоискАвтор, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ЭтотОбъект.extCRM_ПоискАвтор), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			#КонецВставки
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				"Подразделение", ПоискПодразделение, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ПоискПодразделение));
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				"Проект", ПоискПроект, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ПоискПроект), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		Если ИмяТаблицы.Представление <> "НеРазобрано" 
			И ИмяТаблицы.Представление <> "ТаблицаУспешно" 
			И ИмяТаблицы.Представление <> "ТаблицаНеудачно" 
			И ИмяТаблицы.Представление <> "ТаблицаСписок" Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
				"СостояниеИнтереса", ИмяТаблицы.Значение, Истина);
		ИначеЕсли ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса) Тогда
			Если ИмяТаблицы.Представление = "ТаблицаНеудачно" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
					"СостояниеИнтереса", НеудачноеЗавершениеСценария(ВоронкаПродаж), Истина);
			ИначеЕсли ИмяТаблицы.Представление = "ТаблицаУспешно" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
					"СостояниеИнтереса", УспешноеЗавершениеСценария(ВоронкаПродаж), Истина);
			ИначеЕсли ИмяТаблицы.Представление = "ТаблицаСписок" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаСписок, "СостояниеИнтереса",
					Справочники.CRM_СостоянияИнтересов.МассивСостоянийПоСценарию(ВоронкаПродаж.СценарийИнтереса), ВидСравненияКомпоновкиДанных.ВСписке,
					, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
			КонецЕсли;
		КонецЕсли;
		Если ИмяТаблицы.Представление <> "НеРазобрано" Тогда
			Если ВидОтборов = "Все" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"Объект",
					СсылкиНаОбъектыСтегами,
					ВидСравненияКомпоновкиДанных.ВСписке, ,
					ОтборВключен,
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"Партнер",
					ПоискКлиент,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискКлиент),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"ТипУслуги",
					ПоискТипУслуги,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискТипУслуги),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"ИсточникПервичногоИнтереса",
					ПоискЗначениеИсточникаПривлечения,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискЗначениеИсточникаПривлечения),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"КаналПервичногоИнтереса",
					ПоискИсточникПривлечения,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискИсточникПривлечения),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				#Вставка
				
				//++ #1808 смарт: Ермаков 06.05.2024 / Доработка обработки Мои продажи - отбор по квалификациям.
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],, "смартКвалификацияГруппаИли");
				
				Если ЭтаФорма.смартКвалификация.Количество() Тогда
					
					смартКвалификацияГруппаИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
													ЭтотОбъект[ИмяТаблицы.Представление].Отбор,
													"смартКвалификацияГруппаИли",
													ТипГруппыЭлементовОтбораКомпоновкиДанных .ГруппаИли);
													
					смартКвалификацияГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
													смартКвалификацияГруппаИли,
													"смартКвалификацияГруппаИ",
													ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
					
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
						смартКвалификацияГруппаИ,
						"Объект.смартИтоговаяКвалификация",
						Неопределено,
						ВидСравненияКомпоновкиДанных.НеЗаполнено, 
						"смартИтоговаяКвалификация_НеЗаполнено",
						Истина,
						РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
						
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
						смартКвалификацияГруппаИ,
						"Объект.смартПредварительнаяКвалификация",
						ЭтаФорма.смартКвалификация,
						ВидСравненияКомпоновкиДанных.ВСписке, 
						,
						Истина,
						РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);						
						
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
						смартКвалификацияГруппаИли,
						"Объект.смартИтоговаяКвалификация",
						ВидСравненияКомпоновкиДанных.ВСписке, 
						ЭтаФорма.смартКвалификация,
						"смартИтоговаяКвалификация_ВСписке",
						Истина,
						РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);								
						
					// Структура группы фильтра
					// Группа ИЛИ
					//  - Группа И
					//  - - смартИтоговаяКвалификация Не Заполнено
					//  - - смартПредварительнаяКвалификация В Списке
					//	- смартИтоговаяКвалификация В Списке
					
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"Объект.смартВоронкаНовые");
					
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"Объект.смартВоронкаСтарые");

				Если Не (ЭтаФорма.смартНовые И ЭтаФорма.смартСтарые)
					И (ЭтаФорма.смартНовые Или ЭтаФорма.смартСтарые) Тогда
					
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						ЭтотОбъект[ИмяТаблицы.Представление],
						"Объект.смартВоронкаНовые",
						ЭтаФорма.смартНовые,
						ВидСравненияКомпоновкиДанных.Равно, 
						,
						ЭтаФорма.смартНовые,
						РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
						
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						ЭтотОбъект[ИмяТаблицы.Представление],
						"Объект.смартВоронкаСтарые",
						ЭтаФорма.смартСтарые,
						ВидСравненияКомпоновкиДанных.Равно, 
						,
						ЭтаФорма.смартСтарые,
						РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

				КонецЕсли;
				//-- #1808 смарт: Ермаков 06.05.2024
				
				#КонецВставки
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущийПользователь <> Пользователи.ТекущийПользователь() Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Элементы.ОткрытьФильтр.Заголовок = ?(ОтборыУстановлены, НСтр("ru='Фильтр: ';en='Filter: '")
		+КоличествоФильтров,
		 НСтр("ru='Фильтр';en='Filter'"));
	Элементы.ОткрытьФильтр.Картинка = ?(ОтборыУстановлены, БиблиотекаКартинок.CRM_ФильтрАктивный,
		 БиблиотекаКартинок.CRM_ФильтрНеАктивный);
	Элементы.ОткрытьФильтр.ЦветТекста = ?(ОтборыУстановлены, ЦветаСтиля.CRM_ОсновнойГолубой, Новый Цвет(77, 77, 77));
	
	СтруктураОбновленияКолонок = ДанныеКолонокКанбан();
	
	#Вставка //++ #1820 смарт: Фролов 20.05.2024 //Доработка обработки "Мои продажи" - 
	смартОбновитьТаблицуПоказателей();
	#КонецВставки
	
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаСервере
&ИзменениеИКонтроль("ДобавитьЭтапыВоронкиНаСервере")
Процедура extCRM_ДобавитьЭтапыВоронкиНаСервере()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	СписокЦветов = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьСписокЦветов();
	
	ДобавитьТаблицуНеРазобрано();
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		
		Если Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита,
				 Новый ОписаниеТипов("ДинамическийСписок"),,
				"Поле таблицы"));
		КонецЕсли;
		
		ИмяРеквизитаСумма = "Декорация_"+ИмяРеквизита+"_Сумма";
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизитаСумма) Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаСумма, Новый ОписаниеТипов("ФорматированнаяСтрока")));
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		
		Если Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			
			ИндексЦвета = Строка.Ссылка.ИндексЦвета;
			
			#Вставка
			//ЭтотОбъект[ИмяРеквизита].ТекстЗапроса = "ВЫБРАТЬ
			//|	ДокументИнтерес.Ссылка КАК Ссылка,
			//|	ДокументИнтерес.Автор КАК Автор,
			//|	ДокументИнтерес.СостояниеИнтереса КАК СостояниеИнтереса
			//|ПОМЕСТИТЬ АктивныеИнтерсы
			//|ИЗ
			//|	Документ.CRM_Интерес КАК ДокументИнтерес
			//|ГДЕ
			//|	НЕ ДокументИнтерес.Завершен
			//|	И НЕ ДокументИнтерес.ПометкаУдаления
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	ДокументИнтерес.Ссылка КАК Ссылка,
			//|	ДокументИнтерес.Автор КАК Автор,
			//|	CRM_СостоянияИнтересов.ОжидаемыйСрокНаЭтапе КАК ОжидаемыйСрокНаЭтапе,
			//|	КОЛИЧЕСТВО(КалендарныеГрафики.ДатаГрафика) КАК СрокНаЭтапе,
			//|	СРЕДНЕЕ(ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0)) КАК ПроцентОплаты,
			//|	СРЕДНЕЕ(ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0)) КАК ПроцентОтгрузки
			//|ПОМЕСТИТЬ ДанныеПоИнтересам
			//|ИЗ
			//|	АктивныеИнтерсы КАК ДокументИнтерес
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
			//|		ПО ДокументИнтерес.СостояниеИнтереса = CRM_СостоянияИнтересов.Ссылка
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних КАК CRM_ИсторияСостоянийОбращенийСрезПоследних
			//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
			//|			ПО CRM_ИсторияСостоянийОбращенийСрезПоследних.Период <= КалендарныеГрафики.ДатаГрафика
			//|				И (КалендарныеГрафики.ДеньВключенВГрафик)
			//|				И (КалендарныеГрафики.ДатаГрафика <= &ПериодПросроченных)
			//|				И (КалендарныеГрафики.Календарь = &Календарь)
			//|		ПО ДокументИнтерес.Ссылка = CRM_ИсторияСостоянийОбращенийСрезПоследних.Обращение
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
			//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			//|			ПО (СостоянияЗаказовКлиентов.Заказ = CRM_ЖурналДокументов.Объект)
			//|		ПО ДокументИнтерес.Ссылка = CRM_ЖурналДокументов.CRM_Интерес
			//|			И (CRM_ЖурналДокументов.ГлавнаяЗапись)
			//|			И (CRM_ЖурналДокументов.Объект ССЫЛКА Документ.ЗаказКлиента)
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ДокументИнтерес.Ссылка,
			//|	ДокументИнтерес.Автор,
			//|	CRM_СостоянияИнтересов.ОжидаемыйСрокНаЭтапе
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	CRM_ОбъектыАРМ.Объект КАК Объект,
			//|	CRM_ОбъектыАРМ.Объект.КонтактноеЛицо КАК КонтактноеЛицо,
			//|	ВЫБОР
			//|		КОГДА CRM_ОбъектыАРМ.Объект.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
			//|			ТОГДА CRM_ОбъектыАРМ.Объект.ПотенциальныйКлиент
			//|		ИНАЧЕ CRM_ОбъектыАРМ.Объект.Партнер
			//|	КОНЕЦ КАК Партнер,
			//|	ВЫБОР
			//|		КОГДА CRM_ОбъектыАРМ.Объект.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
			//|			ТОГДА CRM_ОбъектыАРМ.Объект.ПотенциальныйКлиент.Наименование
			//|		ИНАЧЕ CRM_ОбъектыАРМ.Объект.Партнер.Наименование
			//|	КОНЕЦ КАК ПартнерНаименование,
			//|	CRM_ОбъектыАРМ.НаименованиеАРМ КАК НаименованиеАРМ,
			//|	CRM_ОбъектыАРМ.ИзмерениеАРМ КАК ИзмерениеАРМ,
			//|	CRM_ОбъектыАРМ.СостояниеИнтереса КАК СостояниеИнтереса,
			//|	CRM_ОбъектыАРМ.Пользователь КАК Пользователь,
			//|	CRM_ОбъектыАРМ.Заголовок КАК Заголовок,
			//|	ВЫБОР
			//|		КОГДА CRM_ОбъектыАРМ.КрайнийСрок < &ПериодПросроченных
			//|				И CRM_ОбъектыАРМ.КрайнийСрок > &ПустаяДата
			//|			ТОГДА 1
			//|		КОГДА CRM_ОбъектыАРМ.КрайнийСрок < &ПериодТекущих
			//|				И CRM_ОбъектыАРМ.КрайнийСрок > &ПустаяДата
			//|			ТОГДА 2
			//|		ИНАЧЕ 3
			//|	КОНЕЦ КАК Просрочено,
			//|	ВЫБОР
			//|		КОГДА CRM_ОбъектыАРМ.КрайнийСрок < &ПериодПросроченных
			//|				И CRM_ОбъектыАРМ.КрайнийСрок > &ПустаяДата
			//|			ТОГДА 1
			//|		ИНАЧЕ 2
			//|	КОНЕЦ КАК ПросроченоДляСортировки,
			//|	CRM_ОбъектыАРМ.ДатаДляСортировки КАК ДатаДляСортировки,
			//|	CRM_ОбъектыАРМ.День КАК День,
			//|	CRM_ОбъектыАРМ.Время КАК Время,
			//|	CRM_ОбъектыАРМ.Избранный КАК Избранный,
			//|	CRM_ОбъектыАРМ.ОписаниеИнтереса КАК ОписаниеИнтереса,
			//|	"""""""" КАК ПустаяЯчейка,
			//|	CRM_ОбъектыАРМ.Объект.ТипУслуги КАК ТипУслуги,
			//|	CRM_ОбъектыАРМ.КрайнийСрок КАК КрайнийСрок,
			//|	CRM_ОбъектыАРМ.КрайнийСрок КАК КрайнийСрокОкончание,
			//|	ВЫБОР
			//|		КОГДА CRM_ОбъектыАРМ.Избранный
			//|			ТОГДА 0
			//|		ИНАЧЕ 1
			//|	КОНЕЦ КАК Картинка,
			//|	CRM_ОбъектыАРМ.Объект.Проект КАК Проект,
			//|	CRM_ОбъектыАРМ.СостояниеИнтереса.ИндексЦвета КАК ИндексЦвета,
			//|	ДанныеПоИнтересам.Автор КАК Автор,
			//|	ДанныеПоИнтересам.ПроцентОплаты КАК ПроцентОплаты,
			//|	ДанныеПоИнтересам.ПроцентОтгрузки КАК ПроцентОтгрузки,
			//|	ДанныеПоИнтересам.СрокНаЭтапе КАК СрокНаЭтапе,
			//|	ВЫБОР
			//|		КОГДА ДанныеПоИнтересам.СрокНаЭтапе ЕСТЬ NULL
			//|				ИЛИ ДанныеПоИнтересам.ОжидаемыйСрокНаЭтапе = 0
			//|			ТОГДА -1
			//|		КОГДА ДанныеПоИнтересам.СрокНаЭтапе < ДанныеПоИнтересам.ОжидаемыйСрокНаЭтапе
			//|			ТОГДА 0
			//|		КОГДА ДанныеПоИнтересам.СрокНаЭтапе = ДанныеПоИнтересам.ОжидаемыйСрокНаЭтапе
			//|			ТОГДА 1
			//|		ИНАЧЕ 2
			//|	КОНЕЦ КАК СрокНаЭтапеСветофор
			//|ИЗ
			//|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
			//|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоИнтересам КАК ДанныеПоИнтересам
			//|		ПО CRM_ОбъектыАРМ.Объект = ДанныеПоИнтересам.Ссылка";
			//ЭтотОбъект[ИмяРеквизита].ОсновнаяТаблица = "РегистрСведений.CRM_ОбъектыАРМ";
			//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита], "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
			//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита], "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()), Истина);
			//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита], "ПустаяДата", Дата('00010101'), Истина);
			//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита], "Календарь", Календарь, Истина);
			#КонецВставки
			
			ЭтотОбъект[ИмяРеквизита].ТекстЗапроса = ТекстЗапросаКолонкиАРМ();
			ЭтотОбъект[ИмяРеквизита].ОсновнаяТаблица = "Документ.CRM_Интерес";
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				"ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				"ПериодТекущих", КонецДня(ТекущаяДатаСеанса()), Истина);
			
			ДнейПоКалендарюНаСегодня = CRM_ОбщегоНазначенияСервер.КоличествоДнейСНачалаГодаПоКалендарю(Календарь,
				 ТекущаяДатаСеанса());
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ДнейПоКалендарюНаСегодня", ДнейПоКалендарюНаСегодня,
				 Истина);
			
			ЭтотОбъект[ИмяРеквизита].УстановитьОбязательноеИспользование("Объект", Истина);
			ЭтотОбъект[ИмяРеквизита].УстановитьОбязательноеИспользование("Пользователь", Истина);
			ЭтотОбъект[ИмяРеквизита].УстановитьОбязательноеИспользование("ОжидаемаяВыручка", Истина);
			
			УО = ЭтотОбъект[ИмяРеквизита].УсловноеОформление.Элементы;
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 211, 194));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 1; // красный
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 211, 194));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 1; // красный

			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 2; // желтый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоЗолотистый);
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 2; // желтый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(191, 238, 191));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 3; // зеленый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(191, 238, 191));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 3; // зеленый
			
			// Условное оформление СрокНаЭтапе
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='""Срок на этапе: ""Ч"" дн.""'");
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементУсловия.ПравоеЗначение = 0; 
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(229, 249, 238));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапеСветофор");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 0; // зеленый
	
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 255, 220));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапеСветофор");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 1; // желтый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 238, 233));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапеСветофор");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 2; // красный
			// -

			#Вставка
			//// +extCRM/agashk Данные Заказа Клиента
			//ЭлементУО = УО.Добавить();
			//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='""Оплата: ""Ч""%""'");
			//ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			//ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
			//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
			//ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			//ЭлементУсловия.ПравоеЗначение = 0; 
			//
			//ЭлементУО = УО.Добавить();
			//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
			//ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			//ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
			//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
			//ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			//
			//ЭлементУО = УО.Добавить();
			//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='""Отгрузка: ""Ч""%""'");
			//ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			//ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
			//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
			//ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			//ЭлементУсловия.ПравоеЗначение = 0; 
			//
			//ЭлементУО = УО.Добавить();
			//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
			//ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			//ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
			//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
			//ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			//// -extCRM/agashk Данные Заказа Клиента
			#КонецВставки
			
			ГруппаЭлемент = Элементы.Добавить("Группа_"+ИмяРеквизита, Тип("ГруппаФормы"), Элементы.ГруппаСоставКолонок);
			ГруппаЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаЭлемент.ОтображатьЗаголовок = Ложь;
			ГруппаЭлемент.РастягиватьПоГоризонтали = Ложь;
			ГруппаЭлемент.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
						
			ДекорацияНазвание = Элементы.Добавить("Декорация_"+ИмяРеквизита, Тип("ДекорацияФормы"), ГруппаЭлемент);
			ДекорацияНазвание.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияНазвание.Заголовок = Строка.Ссылка.Наименование;
			ДекорацияНазвание.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияНазвание.Подсказка = Строка.Ссылка.Наименование;
			ДекорацияНазвание.Высота = 1;
			ДекорацияНазвание.РастягиватьПоГоризонтали = Истина;
			ДекорацияНазвание.РастягиватьПоВертикали = Ложь;
			ДекорацияНазвание.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияНазвание.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,13,Ложь);
			
			ГруппаНадписи = Элементы.Добавить("Группа_"+ИмяРеквизита+"_Надписи", Тип("ГруппаФормы"), ГруппаЭлемент);
			ГруппаНадписи.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНадписи.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаНадписи.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаНадписи.ОтображатьЗаголовок = Ложь;
			ГруппаНадписи.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;			
			
			ИмяРеквизитаСумма = "Декорация_"+ИмяРеквизита+"_Сумма";
			ДекорацияСумма = Элементы.Добавить(ИмяРеквизитаСумма, Тип("ПолеФормы"), ГруппаНадписи);
			ДекорацияСумма.Вид = ВидПоляФормы.ПолеНадписи;
			ДекорацияСумма.ПутьКДанным = ИмяРеквизитаСумма;
			ДекорацияСумма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ДекорацияСумма.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияСумма.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияСумма.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,10,Ложь);
			
			ГруппаТаблица = Элементы.Добавить("ГруппаТаблица_"+ИмяРеквизита, Тип("ГруппаФормы"), ГруппаЭлемент);
			ГруппаТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаТаблица.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаТаблица.ОтображатьЗаголовок = Ложь;
			ГруппаТаблица.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
			
			ДекорацияЦвет = Элементы.Добавить("ДекорацияЦвет_"+ИмяРеквизита, Тип("ДекорацияФормы"), ГруппаТаблица);
			ДекорацияЦвет.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияЦвет.Заголовок = "";
			ДекорацияЦвет.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияЦвет.РастягиватьПоГоризонтали = Ложь;
			ДекорацияЦвет.АвтоМаксимальнаяШирина = Ложь;
			ДекорацияЦвет.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Истина);
			ДекорацияЦвет.ЦветФона = СписокЦветов.Получить(ИндексЦвета).Цвет;
			
			Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ТаблицаФормы"), ГруппаТаблица);
			Элемент.РежимВыделенияСтроки =РежимВыделенияСтрокиТаблицы.Строка;
			Элемент.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
			Элемент.РежимВыбора = Истина;
			Элемент.ОтображениеСостоянияПросмотра.Видимость = Истина;
			Элемент.ОтображениеСтрокиПоиска.Видимость = Истина;
			#Вставка
			Элемент.ОтображениеСостоянияПросмотра.Видимость = Ложь;
			Элемент.ОтображениеСтрокиПоиска.Видимость = Ложь;
			#КонецВставки
			Элемент.КоманднаяПанель.Видимость = Ложь;
			Элемент.ПутьКДанным = ИмяРеквизита;
			Элемент.ПутьКДаннымКартинкиСтроки  = ИмяРеквизита+".Картинка";
			Элемент.КартинкаСтрок  = БиблиотекаКартинок.CRM_ЗвездочкаГолубая;
			Элемент.РазрешитьПеретаскивание = Истина;
			Элемент.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
			Элемент.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
			Элемент.ЧередованиеЦветовСтрок = Ложь;
			Элемент.Видимость = Истина;
			Элемент.Шапка = Ложь;
			Элемент.ГоризонтальныеЛинии = Истина;
			Элемент.ВертикальныеЛинии = Ложь;
			Элемент.УстановитьДействие("Выбор", "ТаблицаВыбор");
			Элемент.УстановитьДействие("Перетаскивание", "ТаблицаОбработкаПеретаскивание");
			Элемент.УстановитьДействие("ПередУдалением", "ТаблицаОбработкаПередУдалением");
			Элемент.УстановитьДействие("НачалоПеретаскивания", "ТаблицаОбработкаНачалоПеретаскивания");
			Элемент.УстановитьДействие("ПроверкаПеретаскивания", "ТаблицаОбработкаПроверкаПеретаскивания");
			Элемент.УстановитьДействие("ПередНачаломДобавления", "ТаблицаПередНачаломДобавления");
			Элемент.УстановитьДействие("ПриАктивизацииСтроки", "НеРазобраноПриАктивизацииСтроки");
			Элемент.Заголовок = Строка.Ссылка.Наименование;
			Элемент.КонтекстноеМеню.Видимость = Ложь;
			Для Каждого ЭлементМеню Из Элемент.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
				ЭлементМеню.Видимость = Ложь;
			КонецЦикла;
			СформироватьКонтекстноеМеню(Элемент.Имя);
			Элемент.ТолькоПросмотр = Истина;
			Элемент.Высота = 4;
			Элемент.РастягиватьПоВертикали = Истина;
			Элемент.АвтоМаксимальнаяВысота = Ложь;
			Элемент.АвтоМаксимальнаяШирина = Ложь;
			Элемент.РастягиватьПоГоризонтали = Ложь;
			Элемент.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
			Элемент.ЦветРамки = ЦветаСтиля.ЦветФонаПоля;
			
			ГруппаСтрокаГлавная = Элементы.Добавить("ГруппаСтрокаГлавная_" + ИмяРеквизита,
				 Тип("ГруппаФормы"), Элементы[ИмяРеквизита]);
			ГруппаСтрокаГлавная.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаСтрокаГлавная.Группировка = ГруппировкаКолонок.Вертикальная;
			ГруппаСтрокаГлавная.ОтображатьЗаголовок = Ложь;
			
			ГруппаСтрока = Элементы.Добавить("ГруппаСтрока_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаСтрокаГлавная);
			ГруппаСтрока.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаСтрока.Группировка = ГруппировкаКолонок.Горизонтальная;
			ГруппаСтрока.ОтображатьЗаголовок = Ложь;
			
			ГруппаКолонок = Элементы.Добавить("ГруппаКолонок_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаСтрока);
			ГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
			ГруппаКолонок.ОтображатьЗаголовок = Ложь;
			
			ГруппаЗаголовок = Элементы.Добавить("ГруппаЗаголовок_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаКолонок);
			ГруппаЗаголовок.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаЗаголовок.Группировка = ГруппировкаКолонок.Горизонтальная;
			ГруппаЗаголовок.ОтображатьЗаголовок = Ложь;
 			ГруппаЗаголовок.РастягиватьПоГоризонтали = Ложь;

			КолонкаНаименование = Элементы.Добавить("Заголовок" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаЗаголовок);
			КолонкаНаименование.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаНаименование.ПутьКДанным = ИмяРеквизита + ".Заголовок";
			КолонкаНаименование.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаНаименование.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,10,Истина,Ложь,Ложь);
			КолонкаНаименование.РастягиватьПоГоризонтали = Ложь;
			
			// +Рарус alexpr
			//КолонкаСоисполнение = Элементы.Добавить("Соисполнение" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаЗаголовок);
			//КолонкаСоисполнение.Вид = ВидПоляФормы.ПолеКартинки;
			//КолонкаСоисполнение.ПутьКДанным = ИмяРеквизита + ".Соисполнение";
			//КолонкаСоисполнение.КартинкаЗначений = БиблиотекаКартинок.CRM_СоисполнениеКоллекция;
			//КолонкаСоисполнение.Ширина = 1;
			//КолонкаСоисполнение.ОтображатьВШапке = Ложь;
			//КолонкаСоисполнение.Подсказка = НСтр("ru = 'В соисполнении'");
			// -Рарус alexpr
			
			КолонкаПартнер = Элементы.Добавить("Партнер" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаКолонок);
			КолонкаПартнер.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаПартнер.ПутьКДанным = ИмяРеквизита + ".Партнер";
			КолонкаПартнер.ОтображатьВШапке = Ложь;
			КолонкаПартнер.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаПартнер.РастягиватьПоГоризонтали = Ложь;
			//
			КолонкаОписание = Элементы.Добавить("ОписаниеИнтереса" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаКолонок);
			КолонкаОписание.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаОписание.ПутьКДанным = ИмяРеквизита + ".ОписаниеИнтереса";
			КолонкаОписание.ОтображатьВШапке = Ложь;
			КолонкаОписание.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаОписание.РастягиватьПоГоризонтали = Ложь;
			
			КолонкаОписание = Элементы.Добавить("СрокНаЭтапе" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаКолонок);
			КолонкаОписание.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаОписание.ПутьКДанным = ИмяРеквизита + ".СрокНаЭтапе";
			КолонкаОписание.ОтображатьВШапке = Ложь;
			КолонкаОписание.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаОписание.Ширина = 1;
			КолонкаОписание.РастягиватьПоГоризонтали = Ложь;
			КолонкаОписание.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;

			#Вставка
			//// +extCRM/agashk Данные Заказа Клиента
			//extCRM_ГруппаЗаказ = Элементы.Добавить("extCRM_ГруппаЗаказ_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаКолонок);
			//extCRM_ГруппаЗаказ.Вид = ВидГруппыФормы.ГруппаКолонок;
			//extCRM_ГруппаЗаказ.Группировка = ГруппировкаКолонок.Горизонтальная;
			//extCRM_ГруппаЗаказ.ОтображатьЗаголовок = Ложь;
			//extCRM_ГруппаЗаказ.РастягиватьПоГоризонтали = Ложь;
			//
			//extCRM_Оплата = Элементы.Добавить("extCRM_Оплата" + ИмяРеквизита, Тип("ПолеФормы"), extCRM_ГруппаЗаказ);
			//extCRM_Оплата.Вид = ВидПоляФормы.ПолеВвода;
			//extCRM_Оплата.ПутьКДанным = ИмяРеквизита + ".ПроцентОплаты";
			//extCRM_Оплата.ЦветФона = Новый Цвет(245, 245, 245);
			//extCRM_Оплата.Ширина = 2;
			//extCRM_Оплата.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			//
			//extCRM_Отгрузка = Элементы.Добавить("extCRM_Отгрузка" + ИмяРеквизита, Тип("ПолеФормы"), extCRM_ГруппаЗаказ);
			//extCRM_Отгрузка.Вид = ВидПоляФормы.ПолеВвода;
			//extCRM_Отгрузка.ПутьКДанным = ИмяРеквизита + ".ПроцентОтгрузки";
			//extCRM_Отгрузка.ОтображатьВШапке = Ложь;
			//extCRM_Отгрузка.Ширина = 2;
			//extCRM_ОтгрузкаГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			//// -extCRM/agashk
			#КонецВставки
			
			КолонкаПросрочено = Элементы.Добавить("Просрочено" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
			КолонкаПросрочено.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаПросрочено.ПутьКДанным = ИмяРеквизита + ".Просрочено";
			КолонкаПросрочено.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Ложь,Ложь,Ложь);
			КолонкаПросрочено.ОтображатьВШапке = Ложь;
			КолонкаПросрочено.Ширина = 1;
			КолонкаПросрочено.РастягиватьПоГоризонтали = Ложь;
			
			КолонкаСумма = Элементы.Добавить("ОжидаемаяВыручка" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
			КолонкаСумма.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаСумма.ПутьКДанным = ИмяРеквизита + ".ОжидаемаяВыручка";
			КолонкаСумма.Видимость = Ложь;
			
			КолонкаРазделитель = Элементы.Добавить("Ячейка" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрокаГлавная);
			КолонкаРазделитель.Вид = ВидПоляФормы.ПолеНадписи;
			КолонкаРазделитель.ПутьКДанным = ИмяРеквизита + ".ПустаяЯчейка";
			КолонкаРазделитель.ОтображатьВШапке = Ложь;
			КолонкаРазделитель.ЦветФона = Новый Цвет(255, 255, 255);
			КолонкаРазделитель.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Ложь,Ложь,Истина);
			КолонкаРазделитель.Высота = 1;
			КолонкаРазделитель.РастягиватьПоГоризонтали = Ложь;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "Пользователь", ТекущийПользователь,
				 Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()),
				 Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()),
				 Истина);
			
			ДнейПоКалендарюНаСегодня = CRM_ОбщегоНазначенияСервер.КоличествоДнейСНачалаГодаПоКалендарю(Календарь,
				 ТекущаяДатаСеанса());
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ДнейПоКалендарюНаСегодня", ДнейПоКалендарюНаСегодня,
				 Истина);
			
			Элемент = Элементы.Найти("Группа_"+ИмяРеквизита);
			Элемент.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаЭтапы.Количество() > 0 Тогда
		ПоследняяСтрока = ТаблицаЭтапы[ТаблицаЭтапы.Количество()-1];
		ИдентификаторЭтапа = СтрЗаменить(Строка(ПоследняяСтрока.Ссылка.УникальныйИдентификатор()),"-","_");
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		ДобавитьСвернутыеТаблицы(Элементы["Группа_"+ИмяРеквизита]);
	Иначе
		ДобавитьСвернутыеТаблицы(Элементы.ГруппаСоставКолонок);
	КонецЕсли;
	
	УстановиьОформлениеСписковУспешноНеудачно();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект["НеРазобрано"],
		 "Пользователь", ТекущийПользователь,
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект["ТаблицаНеудачно"],
		 "Пользователь", ТекущийПользователь,
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект["ТаблицаУспешно"],
		 "Пользователь", ТекущийПользователь,
		 Истина);
	
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаКлиенте
&ИзменениеИКонтроль("УстановитьШиринуКолонокКанбан")
Процедура extCRM_УстановитьШиринуКолонокКанбан()

	ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("НеРазобрано");
	МассивТаблиц.Добавить("ТаблицаНеудачно");
	МассивТаблиц.Добавить("ТаблицаУспешно");
	МассивТаблиц.Добавить("ТаблицаСписок");
	МассивТаблиц.Добавить("ТаблицаНеудачноСвернуто");
	МассивТаблиц.Добавить("ТаблицаУспешноСвернуто");

	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		МассивТаблиц.Добавить(ИмяРеквизита);
	КонецЦикла;
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы[ИмяТаблицы].Ширина   = ШиринаКолонокКанбан;
		ЭлементДекорацияЦвет = Элементы.Найти("ДекорацияЦвет_Этап_" + ИмяТаблицы);
		Если ЭлементДекорацияЦвет<>Неопределено Тогда
			ЭлементДекорацияЦвет.Ширина   = ШиринаКолонокКанбан;
		КонецЕсли;
		ЭлементДекорацияЦвет = Элементы.Найти("ДекорацияЦвет_" + ИмяТаблицы);
		Если ЭлементДекорацияЦвет<>Неопределено Тогда
			ЭлементДекорацияЦвет.Ширина   = ШиринаКолонокКанбан;
		КонецЕсли;

		Если Элементы.Найти("ГруппаЗаголовок_" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["ГруппаЗаголовок_" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("Заголовок" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Заголовок" + ИмяТаблицы].Ширина = ШиринаЭлемента-4;
		КонецЕсли;
		Если Элементы.Найти("Партнер" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Партнер" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("ОписаниеИнтереса" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["ОписаниеИнтереса" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("Сумма" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Сумма" + ИмяТаблицы].Ширина = ШиринаЭлемента-1;
		КонецЕсли;
		Если Элементы.Найти("СрокНаЭтапе" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["СрокНаЭтапе" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		#Вставка
		// +extCRM/agashk Данные Заказа Клиента
		Если Элементы.Найти("СрокНаЭтапе" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["extCRM_ГруппаЗаказ_" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		// -extCRM/agashk Данные Заказа Клиента
		#КонецВставки
	КонецЦикла;
	Элементы.ДекорацияЦвет_Этап_Успешно.Ширина   = ШиринаКолонокКанбан;
	Элементы.ДекорацияЦвет_Этап_Неудачно.Ширина   = ШиринаКолонокКанбан;
	Элементы.НеРазобраноЗаголовок.Ширина = ШиринаЭлемента+2;
	
	ТекущийЭлемент = Элементы.ШиринаКолонокКанбан;
	
КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023

//++#1542 смарт: Лопато 09.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
&НаКлиенте
&ИзменениеИКонтроль("НеРазобраноПриАктивизацииСтроки")
Процедура смарт_НеРазобраноПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяТаблица = Элемент.Имя; 
	ПодключитьОбработчикОжидания("АРМПриАктивизацииСтрокиОбработка", 0.1, Истина);
	
	#Вставка
	//++ #1443 смарт: Фролов 07.09.2023 //Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
	Если ЭтаФорма.смартСписокТаблиц.НайтиПоЗначению(ЭтотОбъект.АктивнаяТаблица)=Неопределено Тогда
		ЭтаФорма.смартСписокТаблиц.Добавить(ЭтотОбъект.АктивнаяТаблица);
	Иначе	
		Если Элемент.ТекущиеДанные.Свойство("Партнер") ТОгда
			ЭтаФорма.смартТекущийПартнер=Элемент.ТекущиеДанные.Партнер;	
		Иначе	
			ЭтаФорма.смартТекущийПартнер=Неопределено; 
		КонецЕсли;
		
		//++ #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
		ЭтаФорма.смартТекущийИнтерес = ?(Элемент.ТекущиеДанные.Свойство("Объект"),
											Элемент.ТекущиеДанные.Объект,
											Неопределено);
													
		//CRM_РабочийСтолКлиент.ПослеРедактированияЗаметок(ЭтаФорма,Новый Структура("Форма,Партнер",ЭтаФорма,ЭтаФорма.смартТекущийПартнер));
		CRM_РабочийСтолКлиент.ПослеРедактированияЗаметок(ЭтаФорма, Новый Структура("Форма", ЭтаФорма));
		//-- #1443 смарт: Ермаков 26.09.2023 // Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.
	КонецЕсли;	
	//-- #1443 смарт: Фролов 07.09.2023	
	#КонецВставки

КонецПроцедуры //--#1542 смарт: Лопато 09.11.2023

//++#1558 смарт: Лопато 14.11.2023 //Доработка фильтров АРМ Мои продажи  
&НаСервереБезКонтекста
&ИзменениеИКонтроль("ЗначенияОтбораПоОтветственному")
Функция смарт_ЗначенияОтбораПоОтветственному(ТекущийПользователь, ТекущаяРоль, ОтборПоРолиУстановлен)

	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) И ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		
		// Отбор по "Все роли"
		Если НЕ ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен Тогда
			РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь).ВыгрузитьЗначения();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, РолиПользователя, Истина);
		КонецЕсли;
 		
		// +Рарус alexpr
		//ЗамещаемыеПользователи = РегистрыСведений.CRM_ОтсутствиеСотрудников.ЗамещаемыеПользователи(ТекущийПользователь);
		ЗамещаемыеПользователи = Новый Массив;
		// -Рарус alexpr
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ЗамещаемыеПользователи, Истина);
		
	Иначе
		
		Если ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен Тогда
			ИсполнителиПоРоли = CRM_БизнесПроцессыСервер.ПолучитьВозможныхИсполнителейПоРоли(ТекущаяРоль).ВыгрузитьЗначения();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ИсполнителиПоРоли, Истина);
		Иначе
			// Все доступные пользователи и роли
			Если Константы.CRM_ИспользоватьДоступныхПользователей.Получить() Тогда
				Результат = ПолучитьДоступныхМенеджеровИРоли();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен Тогда
		Результат.Добавить(ТекущаяРоль);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Результат.Добавить(ТекущийПользователь);
	КонецЕсли;
	
	#Удаление
	Результат.Добавить(Неопределено);
	#КонецУдаления
	
	Возврат Результат;
	
КонецФункции //--#1558 смарт: Лопато 14.11.2023

#Область ПеренесеноСДоработкамиСмарт

#Область ОбработчикиСобытийФормы

&НаКлиенте
&ИзменениеИКонтроль("ПередЗакрытием")
Процедура смарт_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) //++ #1761 смарт: Ермаков 17.04.2024 / Оптимизация и доработка CRM Канбан "Мои продажи"

	// +Рарус alexpr
	//// РаспознаваниеРечи
	//CRM_РаботаСРечьюБМОКлиент.ОстановитьПотоковоеРаспознавание(УникальныйИдентификатор);
	//CRM_РаботаСРечьюЖурналированиеКлиент.ОчиститьЖурнал(УникальныйИдентификатор);
	//// Конец РаспознаваниеРечи
	// -Рарус alexpr
	
	#Вставка
	//++ #1761 смарт: Ермаков 17.04.2024 / Оптимизация и доработка CRM Канбан "Мои продажи"
	// Сохраняем настройки масштаба формы перед закрытием
	Если Не ЗавершениеРаботы Тогда
		смартПередЗакрытием();
	КонецЕсли;
	//-- #1761 смарт: Ермаков 17.04.2024
	#КонецВставки
	
КонецПроцедуры //-- #1761 смарт: Ермаков 17.04.2024

&НаСервере
&ИзменениеИКонтроль("СброситьФильтрНаСервере")
Процедура смарт_СброситьФильтрНаСервере()

	ОтборТеги.Очистить();

	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("ОтборВключен", Ложь);
	СтруктураФильтра.Вставить("ОтборТеги", ОтборТеги);
	СтруктураФильтра.Вставить("ПоискПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	СтруктураФильтра.Вставить("ВариантПериода", "");
	СтруктураФильтра.Вставить("ПоискКлиент", Справочники.Партнеры.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискТипУслуги", Справочники.CRM_ТипУслуги.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискПроект", Справочники.Проекты.ПустаяСсылка());
	СтруктураФильтра.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
	СтруктураФильтра.Вставить("ТекущаяРоль", Справочники.РолиИсполнителей.ПустаяСсылка());
	СтруктураФильтра.Вставить("ОтборПоРолиУстановлен", Истина);
	СтруктураФильтра.Вставить("ТекущийАвтор", Справочники.Пользователи.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискИсточникПривлечения",
	ПланыВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискЗначениеИсточникаПривлечения", Неопределено);
	СтруктураФильтра.Вставить("ПоискПроект", Справочники.Проекты.ПустаяСсылка());
	
	#Вставка //++ #1820 смарт: Фролов 24.05.2024 //Доработка обработки "Мои продажи" - 
	ЭтаФорма.смартКвалификация.Очистить();
	ЭтаФорма.смартСтарые = Ложь;
	ЭтаФорма.смартНовые = Ложь;
	#КонецВставки
	
	УстановитьФильтрНаСервере(СтруктураФильтра);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДоработкиСмарт

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смартПередЗакрытием() //++ #1761 смарт: Ермаков 17.04.2024 / Оптимизация и доработка CRM Канбан "Мои продажи"
	
	//++ #1761 смарт: Ермаков 17.04.2024 / Оптимизация и доработка CRM Канбан "Мои продажи"
	// Сохраняем настройки масштаба формы перед закрытием
	ХранилищеНастроекДанныхФорм.Сохранить("Обработка.CRM_АРМ_МоиПродажи.Форма.Форма_смартКомпактно",, ЭтаФорма.смартКомпактно);	
	//-- #1761 смарт: Ермаков 17.04.2024
	
КонецПроцедуры //-- #1761 смарт: Ермаков 17.04.2024

&НаКлиенте
//++ #1820 смарт: Фролов 20.05.2024 //Доработка обработки "Мои продажи" - 
Процедура смартТаблицаПоказателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОтборыУстановлены = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Партнер) Тогда
		
		ЭтаФорма.смартКвалификация.Очистить();
		ПоискКлиент = ТекущиеДанные.Партнер;
		ЭтаФорма.смартСтарые = Ложь;
		ЭтаФорма.смартНовые = Ложь;
		ПоискТипУслуги = Неопределено;
		ОтборыУстановлены = Истина;
		
	ИначеЕсли ТекущиеДанные.Показатель = "ПАРТНЕР НЕ ЗАПОЛНЕН" Тогда
		
		ЭтаФорма.смартКвалификация.Очистить();
		ПоискКлиент = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ЭтаФорма.смартСтарые = Ложь;
		ЭтаФорма.смартНовые = Ложь;
		ПоискТипУслуги = Неопределено;
		ОтборыУстановлены = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ТипУслуги) Тогда
		
		ЭтаФорма.смартКвалификация.Очистить();
		ЭтаФорма.смартСтарые = Ложь;
		ЭтаФорма.смартНовые = Ложь;
		ПоискКлиент = Неопределено;
		ПоискТипУслуги = ТекущиеДанные.ТипУслуги;
		ОтборыУстановлены = Истина;

	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Квалификация) Тогда
		
		ЭтаФорма.смартКвалификация.Добавить(ТекущиеДанные.Квалификация);
		ЭтаФорма.смартСтарые = Ложь;
		ЭтаФорма.смартНовые = Ложь;
		ПоискКлиент = Неопределено;
		ПоискТипУслуги = Неопределено; 
		ОтборыУстановлены = Истина;

	ИначеЕсли ТекущиеДанные.Показатель = "Старые" Тогда
		
		ЭтаФорма.смартКвалификация.Очистить();
		ЭтаФорма.смартСтарые = Истина;
		ЭтаФорма.смартНовые = Ложь;
		ПоискКлиент = Неопределено;
		ПоискТипУслуги = Неопределено;
		ОтборыУстановлены = Истина;
		
	ИначеЕсли ТекущиеДанные.Показатель = "Новые" Тогда		
		
		ЭтаФорма.смартКвалификация.Очистить();
		ЭтаФорма.смартСтарые = Ложь;
		ЭтаФорма.смартНовые = Истина;
		ПоискКлиент = Неопределено;
		ПоискТипУслуги = Неопределено;
		ОтборыУстановлены = Истина;
		
	КонецЕсли;
	
	Если ОтборыУстановлены Тогда
		extCRM_ОбновитьОтборыНаСервере("Все", Неопределено);
	КонецЕсли;	
	
КонецПроцедуры //-- #1820 смарт: Фролов 20.05.2024

#КонецОбласти

//++ #1820 смарт: Фролов 20.05.2024 //Доработка обработки "Мои продажи" - 
Процедура смартОбновитьТаблицуПоказателей()
	
	Схема = Элементы.ТаблицаСписок.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.ТаблицаСписок.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	ПолеКД = Новый ПолеКомпоновкиДанных("ИнтересСсылка");
	ВыбранноеПолеКД = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = ПолеКД;
	
	ПолеКД = Новый ПолеКомпоновкиДанных("Просрочено");
	ВыбранноеПолеКД = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = ПолеКД;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ИтогПросроченные = 0;
	Для Каждого СтрРезультат Из Результат Цикл
		
		Если СтрРезультат.Просрочено = 1 Тогда
			ИтогПросроченные = ИтогПросроченные + 1;
		КонецЕсли;
		
	КонецЦикла;	
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таб.ИнтересСсылка КАК Интерес,
	|	Таб.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	&Данные КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партнер КАК Партнер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Интерес) КАК Количество
	|ИЗ
	|	ВТДанные 
	|
	|СГРУППИРОВАТЬ ПО
	|	Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партнер.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|			КОГДА Интерес.смартВоронкаНовые
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ), 0) КАК Новые,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|			КОГДА Интерес.смартВоронкаСтарые
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ), 0) КАК Старые
	|ИЗ
	|	ВТДанные 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Интерес) КАК Количество
	|ИЗ
	|	ВТДанные
	|ГДЕ
	|	Интерес.Дата < &ДатаПросрочки
	|	И Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.Первое)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Интерес.ТипУслуги КАК ТипУслуги,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Интерес) КАК Количество
	|ИЗ
	|	ВТДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	Интерес.ТипУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Интерес.смартИтоговаяКвалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка) 
	|	ТОГДА Интерес.смартПредварительнаяКвалификация ИНАЧЕ Интерес.смартИтоговаяКвалификация КОНЕЦ КАК Квалификация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Интерес) КАК Количество
	|ИЗ
	|	ВТДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Интерес.смартИтоговаяКвалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка) 
	|	ТОГДА Интерес.смартПредварительнаяКвалификация ИНАЧЕ Интерес.смартИтоговаяКвалификация КОНЕЦ");
	
	Запрос.УстановитьПараметр("ДатаПросрочки", ТекущаяДата() - 3600 * 4);	
	Запрос.УстановитьПараметр("Данные", Результат);
	МасРезультат = Запрос.ВыполнитьПакет();
	
	Попытка
		ЭтаФорма.ТаблицаПоказателей.Очистить();
	Исключение
		Возврат;
	КонецПопытки;	
	
	ТабПросроченные = МасРезультат[3].Выгрузить();
	Для Каждого СтрТабПросроченные Из ТабПросроченные Цикл
		
		Если СтрТабПросроченные.Количество > 0 Тогда
			
			СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
			СтрТабПоказателей.Показатель = "Просроченные";
			СтрТабПоказателей.Количество = СтрТабПросроченные.Количество;
			СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	ТабТипыУслуг = МасРезультат[4].Выгрузить();
	Для Каждого СтрТабТипыУслуг Из ТабТипыУслуг Цикл
		
		СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
		СтрТабПоказателей.Показатель = СтрТабТипыУслуг.ТипУслуги;
		СтрТабПоказателей.Количество = СтрТабТипыУслуг.Количество;
		СтрТабПоказателей.ТипУслуги = СтрТабТипыУслуг.ТипУслуги;
		
	КонецЦикла;
	
	СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
	
	ТабСтарыеНовые = МасРезультат[2].Выгрузить();
	Для Каждого СтрТабСтарыеНовые Из ТабСтарыеНовые Цикл
		
		Если СтрТабСтарыеНовые.Новые > 0 Тогда
			СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
			СтрТабПоказателей.Показатель = "Новые";
			СтрТабПоказателей.Количество = СтрТабСтарыеНовые.Новые;
		КонецЕсли;
		
		Если СтрТабСтарыеНовые.Старые > 0 Тогда
			СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
			СтрТабПоказателей.Показатель = "Старые";
			СтрТабПоказателей.Количество = СтрТабСтарыеНовые.Старые;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
	
	ТабКвалификации = МасРезультат[5].Выгрузить();
	Для Каждого СтрТабКвалификации Из ТабКвалификации Цикл
		
		СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
		СтрТабПоказателей.Показатель = СтрТабКвалификации.Квалификация;
		СтрТабПоказателей.Количество = СтрТабКвалификации.Количество;
		СтрТабПоказателей.Квалификация = СтрТабКвалификации.Квалификация;
		
	КонецЦикла;
	
	СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
	
	ТабПартнеры = МасРезультат[1].Выгрузить();
	Для Каждого СтрТабПартнеры Из ТабПартнеры Цикл
		
		СтрТабПоказателей = ЭтаФорма.ТаблицаПоказателей.Добавить();
		Если ЗначениеЗаполнено(СтрТабПартнеры.Партнер) Тогда
			СтрТабПоказателей.Показатель = СтрТабПартнеры.Партнер;
		Иначе
			СтрТабПоказателей.Показатель = "ПАРТНЕР НЕ ЗАПОЛНЕН";
		КонецЕсли;	
		СтрТабПоказателей.Количество = СтрТабПартнеры.Количество;
		СтрТабПоказателей.Партнер = СтрТабПартнеры.Партнер;
		
	КонецЦикла;
	
	Элементы.смартТаблицаПоказателейКоличество.Заголовок = Результат.Количество();
	
КонецПроцедуры //-- #1820 смарт: Фролов 20.05.2024	

#КонецОбласти