
//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.
&ИзменениеИКонтроль("ИспользованиеЭлементов")
Функция смарт_ИспользованиеЭлементов(ПереданныйОбъект, РеквизитыВидаНоменклатуры)

	ИспользованиеЭлементов = Новый Структура;

	#Область НастройкаПоВидуНоменклатуры

	НастройкиРеквизитовПоВидуНоменклатуры = Справочники.Номенклатура.ТаблицаНастроекРеквизитов(РеквизитыВидаНоменклатуры.Ссылка,
	РеквизитыВидаНоменклатуры.ТипНоменклатуры,
	РеквизитыВидаНоменклатуры.ОсобенностьУчета,
	РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик,
	Ложь,
	"ХарактеристикиНоменклатуры");

	Для Каждого СтрТабл Из НастройкиРеквизитовПоВидуНоменклатуры Цикл

		ИмяРеквизита = СтрТабл.ИмяРеквизита; 
		
		#Вставка
		//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.
		Если ИмяРеквизита = "смартСрокГарантии" Тогда
			Продолжить;
		КонецЕсли;
		//-- #1944 смарт: Мосолов 26.07.2024 
		#КонецВставки

		Если СтрТабл.ЭтоДопРеквизит Тогда
			ИмяЭлементаФормы = "ДополнительныйРеквизитЗначение_"
			+ СтрЗаменить(?(СтрТабл.ЭтоОбщийРеквизит,
			ВРег(Строка(СтрТабл.Набор.УникальныйИдентификатор())),
			ВРег(Строка(СтрТабл.НаборСвойств.УникальныйИдентификатор()))),
			"-",
			"x")
			+ "_"
			+ СтрЗаменить(ВРег(Строка(СтрТабл.Свойство.УникальныйИдентификатор())), "-", "x");

			ИспользованиеЭлементов.Вставить(ИмяЭлементаФормы, СтрТабл.Использование 
			И Справочники.Номенклатура.ВидимостьРеквизита(СтрТабл,
			ИмяРеквизита,
			Ложь,
			СтрТабл));
		Иначе
			ИспользованиеЭлементов.Вставить(ИмяРеквизита, СтрТабл.Использование
			И (Справочники.Номенклатура.ВидимостьРеквизита(ИмяРеквизита,
			ИмяРеквизита,
			Ложь,
			СтрТабл)));
		КонецЕсли;

	КонецЦикла;

	#КонецОбласти

	ИспользованиеЭлементов.Вставить("ГиперссылкаПерейтиСоставНабора",
	ПравоДоступа("Просмотр", Метаданные.Справочники.ВариантыКомплектацииНоменклатуры)
	И РеквизитыВидаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор
	И РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры);

	Возврат ИспользованиеЭлементов;

КонецФункции //-- #1944 смарт: Мосолов 26.07.2024
