
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// Адапатция Малыгина 30.01.2020
	
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Партнер")
		И ЗначениеЗаполнено(Параметры.Отбор.Партнер) Тогда
		
		//Каратеев +
		ПоПартнеру = Истина;
		//Каратеев -
		Если ПоПартнеру Тогда
			УстановитьОтборПартнеровСервер(ПоказыватьГрупповые И Элементы.ПоказыватьГрупповые.Видимость);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПоПартнеруПриИзмененииПосле(Элемент)
	
	//Каратеев + 
	Сообщить("Данная функция предусмотрена исключительно для выбора контрагента лизинговой компании в случае одноименной реализации. Если вы просто не можете найти нужного контрагента у текущего партнера, воспользуйтесь поиском в справочнике ""Партнеры(Клиенты)"". За детальной информацией можно обратиться к Администратору 1С", СтатусСообщения.Важное);
	//Каратеев -

КонецПроцедуры

#КонецОбласти