
#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ДополнитьРезультатВыбора")
Процедура смарт_ДополнитьРезультатВыбора(РезультатВыбора)

	РезультатВыбора.Вставить("СтатьяДвиженияДенежныхСредств",
	ДенежныеСредстваСервер.СтатьяДвиженияДенежныхСредствОбъектаРасчетов(РезультатВыбора.ОснованиеПлатежа, ХозяйственнаяОперация));

	ОбъектыРасчетов = Новый Массив;
	ОбъектыРасчетов.Добавить(РезультатВыбора.ОснованиеПлатежа);
	ОбъектыРасчетов.Добавить(РезультатВыбора.Заказ);

	ТаблицаНДС = ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Неопределено, Неопределено, ОбъектыРасчетов, ЭтоРасчетыСКлиентами);
	Если ТаблицаНДС.Количество() = 1 Тогда
		РезультатВыбора.Вставить("СтавкаНДС", ТаблицаНДС[0].СтавкаНДС);
#Удаление		
		Если СуммаПлатежа = РезультатВыбора.СуммаЗаказа Тогда
#КонецУдаления
#Вставка
        Если СуммаПлатежа = РезультатВыбора.СуммаЗаказа И Валюта = РезультатВыбора.ВалютаВзаиморасчетов Тогда // Фролов- Так стало
#КонецВставки			
			РезультатВыбора.Вставить("СуммаНДС", ТаблицаНДС[0].СуммаНДС);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти