
#Область СлужебныйПрограммныйИнтерфейс

#Область Синхронизация

Функция ОписанияКалендарей(СервисКалендарей, ДанныеАвторизации) Экспорт
	
	ОписанияКалендарей = Новый Соответствие;
	Возврат ОписанияКалендарей;
	
КонецФункции

Процедура ЗагрузитьДанныеКалендаря(СервисКалендарей, Календарь, ДанныеАвторизации) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеКалендаря(СервисКалендарей, Календарь, ДанныеАвторизации) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура УдалитьВзаимодействиеИзКалендаря(СервисКалендарей, Календарь, Взаимодействие) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область Авторизация

Процедура ПрочитатьДанныеАвторизации(СервисКалендарей, ДанныеАвторизации, Пользователь) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОбновитьДанныеАвторизации(СервисКалендарей, ДанныеАвторизации, Пользователь) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ЗаписатьДанныеАвторизации(СервисКалендарей, ДанныеАвторизации, Пользователь) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура УдалитьДанныеАвторизации(СервисКалендарей, Пользователь) Экспорт
	
	Возврат;
	
КонецПроцедуры

Функция ДанныеАвторизацииДействительны(СервисКалендарей, ДанныеАвторизации) Экспорт
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Вспомогательные

Функция КартинкаСервисаКалендарей(СервисКалендарей) Экспорт
	
	Возврат БиблиотекаКартинок.Календарь;
	
КонецФункции

#КонецОбласти

#КонецОбласти
