

#Область ПеренесеноСДоработками

&Перед("ОпределитьОбъектыСКомандамиОтчетов")
Процедура смарт_ОпределитьОбъектыСКомандамиОтчетов(Объекты)
	// Фролов+
	Объекты.Добавить(Метаданные.Документы.смартПредзаказПоставщику);
	// Фролов-
	
	//смартКаратеев ++
	Объекты.Добавить(Метаданные.Документы.МаркетинговыеМероприятияДокумент);
	//Каратеев --
	
	//++ смарт:ММ #092 389 03.02.2021 - Конструктор оборудования
	Объекты.Добавить(Метаданные.Документы.смартIECHOСпецификация);
	//Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаРемонтныеРаботы);
	//Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаПускоНаладку);
	//Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаГарантийныйРемонт);
	//-- смарт:ММ 03.02.2021
	
КонецПроцедуры

&После("НастроитьВариантыОтчетов")
Процедура смарт_НастроитьВариантыОтчетов(Настройки)
	//++ смарт:КМД #3_2 501 14.06.2021
	#Область смартИсторияАвтоматизированногоРасчетаНеликвидов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.смартИсторияАвтоматизированногоРасчетаНеликвидов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "смартИсторияАвтоматизированногоРасчетаНеликвидов");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.CRMИМаркетинг.Подсистемы.Ассортимент);
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru= 'История расчетов автоматизированного расчета неликвидов и актуальные данные по номенклатуре'");	
	#КонецОбласти

	//++#1323 смарт: Лопато 01.06.2024 //Восстановить и переделать механизм индивидуальных скидок  
	#Область смартПрайсЛистИндивидуальныеСкидки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.смартПрайсЛистИндивидуальныеСкидки);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.CRMИМаркетинг.Подсистемы.ЦеныИСкидки);
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru= 'Прайс лист с учетом индивидуальных скидок клиентов'");	
	#КонецОбласти
	//--#1323 смарт: Лопато 01.06.2024
	
	//++ #Б2862 смарт: Шляпников 02.04.2025 / Доработать отчет "Остатки и доступность товаров". Добавить информацию по предзаказам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.смартОстаткиИДоступностьТоваровТранзит);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиИДоступностьТоваровТранзит");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.Склад.Подсистемы.АнализЗапасов);
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru= 'Остатки и доступность товаров(для менеджеров)'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.смартОстаткиИДоступностьТоваровТранзит);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиИДоступностьТоваровТранзитПредзаказы");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.Склад.Подсистемы.АнализЗапасов);
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru= 'Остатки и доступность товаров(для менеджеров) с предзаказами'");
	//-- #Б2862 смарт: Шляпников 02.04.2025

КонецПроцедуры

#КонецОбласти