
#Область ДоработкиСмарт

//++ #1752 смарт: Фролов 24.04.2024 //При срабатывании триггера задачи и оповещения ставятся не тому пользователю
Функция смарт_ПодключитьПроизвольноеНапоминаниеПользователю(Текст, ВремяСобытия, ИнтервалДоСобытия, Предмет, Идентификатор, Пользователь) Экспорт
	ПараметрыНапоминания = Новый Структура;
	ПараметрыНапоминания.Вставить("Описание", Текст);
	Если ТипЗнч(ВремяСобытия) = Тип("РасписаниеРегламентногоЗадания") Тогда
		ПараметрыНапоминания.Вставить("Расписание", ВремяСобытия);
	ИначеЕсли ТипЗнч(ВремяСобытия) = Тип("Строка") Тогда
		ПараметрыНапоминания.Вставить("ИмяРеквизитаИсточника", ВремяСобытия);
	Иначе
		ПараметрыНапоминания.Вставить("ВремяСобытия", ВремяСобытия);
	КонецЕсли;
	ПараметрыНапоминания.Вставить("ИнтервалВремениНапоминания", ИнтервалДоСобытия);
	ПараметрыНапоминания.Вставить("Источник", Предмет);
	ПараметрыНапоминания.Вставить("Идентификатор", Идентификатор);
    ПараметрыНапоминания.Вставить("Пользователь", Пользователь);
	
	Напоминание = СоздатьНапоминание(ПараметрыНапоминания);
	
	//++#1966 смарт: Лопато 05.08.2024 //Ошибка при при постановке задачи другому сотруднику.  
	УстановитьПривилегированныйРежим(Истина);
    //--#1966 смарт: Лопато 05.08.2024
	
	ПодключитьНапоминание(Напоминание);
	
	Возврат Напоминание;
КонецФункции //-- #1752 смарт: Фролов 24.04.2024

#КонецОбласти