#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДоработкиСмарт

//++#1626 смарт: Лопато 06.02.2024 //Справочник Номенклатура. Обнулить связи параметров выбора для Марка.  
// Проверяет уникальность наименования марки (брэнда).
//
// Параметры:
//	Объект - СправочникОбъект.Марки - элемент справочника Марки.
//
// Возвращаемое значение:
//	Булево - признак уникальности наименования данного элемента справочника.
//
Функция НаименованиеУникально(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Марки.Ссылка КАК Марка
	|ИЗ
	|	Справочник.Марки КАК Марки
	|ГДЕ
	|	Марки.Ссылка <> &Ссылка
	|	И НРЕГ(СТРЗАМЕНИТЬ(Марки.Наименование, "" "", """")) = НРЕГ(СТРЗАМЕНИТЬ(&Наименование, "" "", """"))
	|	И НЕ Марки.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Ссылка",       Объект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);

	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции //--#1626 смарт: Лопато 06.02.2024

#КонецОбласти

#КонецОбласти

#КонецЕсли
