
#Область ПеренесеноСДоработкамиСмарт

&Перед("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ)
	
	//++#1626 смарт: Лопато 06.02.2024 //Справочник Номенклатура. Обнулить связи параметров выбора для Марка.  
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
		
		НаименованиеУникально = Справочники.Марки.НаименованиеУникально(ЭтотОбъект);
		
		Если НЕ НаименованиеУникально Тогда
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Значение поля ""Наименование"" не уникально!'"), 
												  ЭтотОбъект, "Наименование", "Объект.Наименование", Отказ); 
			
		КонецЕсли;
		
	КонецЕсли;
	//--#1626 смарт: Лопато 06.02.2024
	
КонецПроцедуры

#КонецОбласти
