#Область ПрограммныйИнтерфейс

// Процедура вызывается при выборе номенклатуры в документе 
// Уведомление об остатках прослеживаемых товаров
// 
// Параметры:
// 
// ДанныеСтрокиТаблицы - Структура - данные которые заполняются с текущей строки таблицы товаров 
//          * Номенклатура - СправочникСсылка.Номенклатура - Номеклатура
//          * ЕдиницаИзмерения - ОпределяемыйТип.ЕдиницаИзмерения -  Единица измерения
//          * Количество - Число - Количество
//          * КодОКПД2 - СправочникСсылка.КлассификаторОКПД2 - ОКПД2
//          * ЕдиницаИзмеренияПрослеживаемости - ОпределяемыйТип.ЕдиницаИзмерения - Единица измерения прослеживаемости
//          * КоличествоПрослеживаемости - Число -Количество по прослеживаемости
//          * Сумма - Число - Сумма
// 
Процедура ДанныеСтрокиТаблицыТоварыУведомленияОбОстатках(ДанныеСтрокиТаблицы) Экспорт
	
	Возврат ;
	
КонецПроцедуры

// Процедура вызывается при выборе номенклатуры в документе 
// Уведомление об остатках прослеживаемых товаров
// 
// Параметры:
// 
// ДанныеОбъекта - Структура - данные, которые заполняются с шапки объекта 
//         * КодТНВЭД - СправочникСсылка.КлассификаторТНВЭД - Код ТНВЭД
// 
Процедура ДанныеОбъектаУведомленияОбОСтатках(ДанныеОбъекта) Экспорт
	
	Возврат ;
	
КонецПроцедуры

// Процедура вызывается при выборе сопроводительного документа в табличной части Товары
// Уведомление о перемещении прослеживаемых товаров
// 
// Параметры:
// 
// Форма - ФормаКлиентскогоПриложения - Форма объекта
// ТекущиеДанные - ДанныеФормыЭлементКоллекции - Текущие данные таблицы Контрагенты 
// 
Процедура ОткрытьФормуПодбораСопроводительногоДокумента(Форма, ТекущиеДанные) Экспорт
	
	Объект = Форма.Объект;
	
	СтруктураОтбора = Новый Структура("Организация, Контрагент", Объект.Организация, ТекущиеДанные.Контрагент);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаВыбора", Новый Структура("Отбор", СтруктураОтбора), Форма);
	
КонецПроцедуры

// Процедура выполняет печать документов: УведомлениеОбОстаткахПрослеживаемыхТоваров,
// УведомлениеОВвозеПрослеживаемыхТоваров, УведомлениеОПеремещенииПрослеживаемыхТоваров 
// из формы 1С-отчетность вкладка отчеты
// 
// Параметры:
// Ссылка - ДокументСсылка - Ссылка на документ уведомления 
// СтандартнаяОбработка - Булево - признак стандартной обработки
// 
Процедура ПечатьРегламентированногоОтчета(Ссылка, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗаголовокПечатнойФормы(ОбъектыПечати) Экспорт
	
	ПараметрыПечати = ОбщегоНазначенияБПКлиент.ПолучитьЗаголовокПечатнойФормы(ОбъектыПечати);
	
	Возврат ПараметрыПечати;
	
КонецФункции


#КонецОбласти
