
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт

    Если ПравоДоступа("Просмотр", Метаданные.Отчеты.смартПрайсЛистИндивидуальныеСкидки) Тогда
        
        КомандаОтчет = КомандыОтчетов.Добавить();
        
        КомандаОтчет.Менеджер 	   = Метаданные.Отчеты.смартПрайсЛистИндивидуальныеСкидки.ПолноеИмя();
        КомандаОтчет.Представление = НСтр("ru = 'Прайс лист с учетом индивидуальных скидок'");
        
        КомандаОтчет.МножественныйВыбор = Ложь;
        КомандаОтчет.Важность 			= "Обычное";
        КомандаОтчет.КлючВарианта 		= "Основной";
		
		Возврат КомандаОтчет;
        
    КонецЕсли;

    Возврат Неопределено;

КонецФункции


#КонецОбласти

#КонецОбласти
        
#КонецЕсли