
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		Если ТипЗнч(Параметры.ПараметрКоманды) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

			ЭтаФорма.ФормаПараметры.Отбор.Вставить("Клиент", Параметры.ПараметрКоманды.Партнер);
			
			ЭтаФорма.ФормаПараметры.Отбор.Вставить("Номенклатура", 
				ОбщегоНазначенияКлиентСервер.СвернутьМассив(Параметры.ПараметрКоманды.Товары.ВыгрузитьКолонку("Номенклатура")));
			
		ИначеЕсли ТипЗнч(Параметры.ПараметрКоманды) = Тип("СправочникСсылка.Партнеры") Тогда
			
			ЭтаФорма.ФормаПараметры.Отбор.Вставить("Клиент", Параметры.ПараметрКоманды);
			
		КонецЕсли;	
		
		ЭтаФорма.ФормаПараметры.КлючНазначенияИспользования = Строка(Параметры.ПараметрКоманды);
		Параметры.КлючНазначенияИспользования = Строка(Параметры.ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	МассивВидовЦен = Новый Массив;
	МассивВидовЦен.Добавить(Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяRUB"));
	МассивВидовЦен.Добавить(Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяEUR"));
	МассивВидовЦен.Добавить(Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяUSD"));
	МассивВидовЦен.Добавить(Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяУЕ"));
	
	Настройки = КомпоновщикНастроек.Настройки;
	
    ПараметрВидЦены = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦены");
	ПараметрВидЦены.Значение = МассивВидовЦен;
    ПараметрВидЦены.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли