#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Заполним переданную таблицу получателей.
	ЗаполнитьТаблицуПолучателей();

	ТекущийКонтакт = Неопределено;
	Попытка
		Если Параметры.Свойство("СписокВыбранных") И ТипЗнч(Параметры.СписокВыбранных) = Тип("СписокЗначений") Тогда
			Для Каждого ЗначениеСписка Из Параметры.СписокВыбранных Цикл
				Если ЗначениеСписка.Представление = "Кому" Или ЗначениеСписка.Представление = "Копии" Тогда
					Если ТипЗнч(ЗначениеСписка.Значение) = Тип("Массив") Тогда
						Для Каждого СтруктураАдрес Из ЗначениеСписка.Значение Цикл
							Если ЗначениеЗаполнено(СтруктураАдрес.Контакт) Тогда
								ТекущийКонтакт = СтруктураАдрес.Контакт;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Исключение КонецПопытки;
	
	#Вставка
	//++ #Б3258 смарт: Шляпников 29.04.2025 / Доработка Конструктора КП - отборы
	Если Параметры.Свойство("Партнер") И ЗначениеЗаполнено(Параметры.Партнер) Тогда
		ТекущийКонтакт = Параметры.Партнер;
	КонецЕсли;
	//-- #Б3258 смарт: Шляпников 29.04.2025
	#КонецВставки
	
	Если ТекущийКонтакт <> Неопределено Тогда
		Если ТипЗнч(ТекущийКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
			Элементы.СписокКлиентов.ТекущаяСтрока = ТекущийКонтакт;
		ИначеЕсли ТипЗнч(ТекущийКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Элементы.СписокКлиентов.ТекущаяСтрока = ТекущийКонтакт.Владелец;
			УстановитьТекущуюСтрокуВКонтактныхЛицах = ТекущийКонтакт;
		ИначеЕсли ТипЗнч(ТекущийКонтакт) = Тип("СправочникСсылка.Пользователи") Тогда
			Элементы.СписокПользователей.ТекущаяСтрока = ТекущийКонтакт;
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПользователей;
		ИначеЕсли ТипЗнч(ТекущийКонтакт) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Элементы.СписокФизЛиц.ТекущаяСтрока = ТекущийКонтакт;
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФизЛица;			
		КонецЕсли;
	КонецЕсли;

	КонтактныеЛицаОтборПоКлиенту = СписокКонтактныхЛиц.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	КонтактныеЛицаОтборПоКлиенту.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	КонтактныеЛицаОтборПоКлиенту.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	КонтактныеЛицаОтборПоКлиенту.Использование  = Истина;
	КонтактныеЛицаОтборПоКлиенту.ПравоеЗначение = Справочники.Партнеры.ПустаяСсылка();

	УстановитьОтборПоУволенным();

	// Настроить видимость элементов.

	ЗначениеРежимаПолнотекстовогоПоиска = ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска();

	Если ЗначениеРежимаПолнотекстовогоПоиска = РежимПолнотекстовогоПоиска.Разрешить Тогда

		ИндексППДАктуален = ПолнотекстовыйПоиск.ИндексАктуален();

	Иначе

		Элементы.СтрокаПоиска.Видимость = Ложь;
		Элементы.Найти.Видимость		= Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти