Процедура ОткрытьСтраницуВБраузере(АдресСтраницы) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаОткрытияБраузера", ДЛ_ДеловыеЛинииКлиент, АдресСтраницы, "ОбработкаОшибокОткрытияБраузера", ДЛ_ДеловыеЛинииКлиент);
	
	Попытка
		
		НачатьЗапускПриложения(ОписаниеОповещения, АдресСтраницы);
		
	Исключение
		
		ОбработкаОшибокОткрытияБраузера(ИнформацияОбОшибке(), Ложь, АдресСтраницы); // Например, отказ пользователя на предупреждение системы безопасности
		
	КонецПопытки;
	
КонецПроцедуры 

Процедура ОбработкаОшибокОткрытияБраузера(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	ТекстСообщения       = "Не удалось открыть страницу """ + ДополнительныеПараметры + """ в браузере по умолчанию";
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	
КонецПроцедуры  

Процедура ОбработкаРезультатаОткрытияБраузера(КодВозврата, ДополнительныеПараметры) Экспорт
	
	// При открытии браузере обрабатывать нечего
	
КонецПроцедуры

Процедура ОткрытьЛоги() Экспорт
	
	ОткрытьФорму("РегистрСведений.ДЛ_ЛогЗапросов.ФормаСписка");
	
КонецПроцедуры

Функция ПроверитьНаличиеНовойВерсии(Форма, ЭтоАвтоматическийЗапрос) Экспорт
	
	ДанныеНовойВерсии = ДЛ_ДеловыеЛинии.ДоступнаНоваяВерсия();
	
	НоваяВерсия = "";
	ДанныеНовойВерсии.Свойство("НоваяВерсия", НоваяВерсия);
	
	Если Не ЭтоАвтоматическийЗапрос Или (НоваяВерсия <> Неопределено И ДанныеНовойВерсии.НеОповещатьОВерсии <> НоваяВерсия) Тогда
		
		Если ЗначениеЗаполнено(НоваяВерсия) Тогда
			
			ОткрытьФорму("ОбщаяФорма.ДЛ_ОповещениеОНовойВерсии", ДанныеНовойВерсии, Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);    
			
		Иначе 
			
			ПоказатьПредупреждение(, "Обновлений нет");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат ДанныеНовойВерсии; 
	
КонецФункции

Процедура АвтоПодборПоПодстроке(Элемент, Текст, ДанныеВыбора) Экспорт
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстПоиска = СокрЛП(ВРег(Текст)); 	
	
	Пока СтрНайти(ТекстПоиска, "  ") > 0 Цикл
		
		ТекстПоиска = СтрЗаменить(ТекстПоиска, "  ", " "); 
		
	КонецЦикла;		
	
	Шрифт = Новый Шрифт(,, Истина);
	Цвет = WebЦвета.Зеленый;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	МассивПодстрок = СтрРазделить(ТекстПоиска, " ");
	
	Для Каждого Стр Из Элемент.СписокВыбора Цикл
		
		Строка = Стр.Значение;
		СтрокаВРег = ВРег(Строка);
		
		ВхожденияНайдены = Истина;
		
		Для Каждого Подстрока Из МассивПодстрок Цикл 
			
			Если Найти(СтрокаВРег, Подстрока) = 0 Тогда 
				
				ВхожденияНайдены = Ложь; 
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВхожденияНайдены Тогда 
			
			ДлинаСтроки = СтрДлина(Строка); 
			
			Массив = Новый Массив(ДлинаСтроки);
			
			Для Каждого Подстрока Из МассивПодстрок Цикл 				
				
				НачалоПоиска = 1; 				
				ДлинаПодстроки = СтрДлина(Подстрока);				
				ПозицияПодстроки = СтрНайти(СтрокаВРег, Подстрока,, НачалоПоиска);
				
				Пока ПозицияПодстроки > 0 Цикл					
					
					НачалоПоиска = ПозицияПодстроки + ДлинаПодстроки;
					
					Для Сч = ПозицияПодстроки По НачалоПоиска - 1 Цикл
						
						Массив[Сч - 1] = Истина;
						
					КонецЦикла;				
					
					Если НачалоПоиска > ДлинаСтроки Тогда
						
						Прервать;
						
					КонецЕсли; 
					
					ПозицияПодстроки = СтрНайти(СтрокаВРег, Подстрока, , НачалоПоиска);
					
				КонецЦикла;	
				
			КонецЦикла;
			
			МассивСтрок = Новый Массив;
			
			Для Сч = 0 По Массив.ВГраница() Цикл
				
				Символ = Сред(Строка, Сч + 1, 1);
				
				Если Массив[Сч] = Неопределено Тогда 
					
					МассивСтрок.Добавить(Символ); 
					
				Иначе   
					
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символ, Шрифт, Цвет)); 
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеВыбора.Добавить(Строка, Новый ФорматированнаяСтрока(МассивСтрок)); 			
			
		КонецЕсли; 		
		
	КонецЦикла;
	
КонецПроцедуры

