
&ИзменениеИКонтроль("НайтиДублиПартнеров")
Функция смарт_НайтиДублиПартнеров(СтруктураОбъекта, СтруктураПоиска)
	УстановитьПривилегированныйРежим(Истина);
	МассивНайденных	= Новый Массив;
	Для Каждого КлючИЗначение Из СтруктураПоиска Цикл
		ИмяРеквизита		= КлючИЗначение.Ключ;
		НайденноеЗначение	= "";
		Если ТипЗнч(СтруктураОбъекта) = Тип("Структура") Тогда
			СтруктураОбъекта.Свойство(ИмяРеквизита, НайденноеЗначение);
		Иначе
			НайденноеЗначение = СтруктураОбъекта[ИмяРеквизита];
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
			Если Найти(ИмяРеквизита, "CRM_") = 1 Тогда
				ИмяРеквизита	= СтрЗаменить(ИмяРеквизита, "CRM_", "");
			ИначеЕсли Найти(ИмяРеквизита, "Контакт_") = 1 Тогда
				ИмяРеквизита	= СтрЗаменить(ИмяРеквизита, "Контакт_", "");
			Иначе
				Продолжить;
			КонецЕсли;	
			Если ТипЗнч(СтруктураОбъекта) = Тип("Структура") Тогда
				СтруктураОбъекта.Свойство(ИмяРеквизита, НайденноеЗначение);
			Иначе
				НайденноеЗначение = СтруктураОбъекта[ИмяРеквизита];
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если ИмяРеквизита = "Наименование" Тогда
			МассивПартнеров = НайтиПартнераПоНаименованию(НайденноеЗначение, 0, Ложь);	
		ИначеЕсли ИмяРеквизита = "НаименованиеПолное" Тогда
			МассивПартнеров = НайтиПартнераПоНаименованию(НайденноеЗначение, 1, Ложь);	
		ИначеЕсли (ИмяРеквизита = "ИНН") ИЛИ (ИмяРеквизита = "CRM_ИНН") Тогда
			МассивПартнеров = НайтиПартнераПоИНН(НайденноеЗначение, Ложь);
		ИначеЕсли (ИмяРеквизита = "Телефон") ИЛИ (ИмяРеквизита = "Контакт_Телефон") Тогда
			МассивПартнеров = НайтиПартнераПоКИ(НайденноеЗначение, 1, Ложь);
		ИначеЕсли (ИмяРеквизита = "АдресЭлектроннойПочты") ИЛИ (ИмяРеквизита = "Контакт_АдресЭлектроннойПочты") Тогда
			МассивПартнеров = НайтиПартнераПоКИ(НайденноеЗначение, 2, Ложь);
		ИначеЕсли (ИмяРеквизита = "Адрес") ИЛИ (ИмяРеквизита = "Контакт_Адрес") Тогда
			МассивПартнеров = НайтиПартнераПоКИ(НайденноеЗначение, 6, Ложь);
		#Удаление
		ИначеЕсли ИмяРеквизита = "Сайт" Тогда
			МассивПартнеров = НайтиПартнераПоКИ(НайденноеЗначение, 4, Ложь);
		#КонецУдаления
		#Вставка
		//++ #1262 смарт: Фролов 09.12.2022 //Перенос адреса веб сайта в карточке клиента  
		//ИначеЕсли ИмяРеквизита = "Сайт" Тогда
		//	МассивПартнеров = НайтиПартнераПоКИ(НайденноеЗначение, 4, Ложь); 
		//-- #Задача смарт: Фролов 09.12.2022
		#КонецВставки
		Иначе
			МассивПартнеров = Новый Массив;
		КонецЕсли;
		Для Каждого СтрокаМассива Из МассивПартнеров Цикл
			МассивНайденных.Добавить(СтрокаМассива);
		КонецЦикла;	
	КонецЦикла;
	Возврат МассивНайденных;
КонецФункции

&ИзменениеИКонтроль("УчетныеЗаписиМессенджеров")
//++ #1813 смарт: Фролов 13.05.2024 //Доработки для удобства использования WhatsApp
Функция смарт_УчетныеЗаписиМессенджеров(ВидКИ, ВладелецКИ, Очистка)

	Если ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.Партнеры") Тогда
		ИмяРеквизитаВидКИ = "ВидКИ_Клиент";
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ИмяРеквизитаВидКИ = "ВидКИ_КЛ";
	ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		ИмяРеквизитаВидКИ = "ВидКИ_ПК";
		// +Рарус alexpr	
		//ИначеЕсли ТипЗнч(ВладелецКИ) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		//	Если ЗначениеЗаполнено(ВладелецКИ.КонтактноеЛицо) Тогда
		//		ИмяРеквизитаВидКИ = "ВидКИ_КЛ";
		//	ИначеЕсли	ЗначениеЗаполнено(ВладелецКИ.Партнер) Тогда
		//		ИмяРеквизитаВидКИ = "ВидКИ_Клиент";
		//	ИначеЕсли ЗначениеЗаполнено(ВладелецКИ.ПотенциальныйКлиент) Тогда
		//		ИмяРеквизитаВидКИ = "ВидКИ_ПК";
		//	Иначе
		//		Возврат Новый Массив;
		//	КонецЕсли;
		//Иначе
		//	Возврат Новый Массив;
		// -Рарус alexpr
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_УчетныеЗаписиМессенджеров.Представление КАК Представление,
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК УчетнаяЗапись,
	|	НЕОПРЕДЕЛЕНО КАК Картинка
	|ИЗ
	|	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВидыКонтактнойИнформацииМессенджеров КАК ВидыКИМессенджеров
	|		ПО ВидыКИМессенджеров.ТипМессенджера = CRM_УчетныеЗаписиМессенджеров.ТипМессенджера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК РегистрCRM_УчетныеЗаписиМессенджеров
	|		ПО (CRM_УчетныеЗаписиМессенджеров.Ссылка = РегистрCRM_УчетныеЗаписиМессенджеров.УчетнаяЗапись
	|		И РегистрCRM_УчетныеЗаписиМессенджеров.Пользователь В (&РолиПользователя))
	|ГДЕ
	// +Рарус alexpr	
	//|	(&ВидКИ = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
	//|			ИЛИ ВидыКИМессенджеров.CRM_ВидКИ__ = &ВидКИ)
	|	(&ВидКИ = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
	|			ИЛИ ВидыКИМессенджеров.ВидКИ_Клиент = &ВидКИ
	|			ИЛИ ВидыКИМессенджеров.ВидКИ_КЛ = &ВидКИ
	|			ИЛИ ВидыКИМессенджеров.ВидКИ_ПК = &ВидКИ)
	// -Рарус alexpr
	|	И НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	|	И CRM_УчетныеЗаписиМессенджеров.Включена
	#Вставка //++ #1813 смарт: Фролов 13.05.2024 //Доработки для удобства использования WhatsApp
	|	И РегистрCRM_УчетныеЗаписиМессенджеров.Запись
	#КонецВставки
	|	И НЕ CRM_УчетныеЗаписиМессенджеров.Ссылка = ЗНАЧЕНИЕ(Справочник.CRM_УчетныеЗаписиМессенджеров.СистемаВзаимодействия)";

	// +Рарус alexpr	
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "CRM_ВидКИ__", ИмяРеквизитаВидКИ);
	// -Рарус alexpr
	Запрос.УстановитьПараметр("ВидКИ", ?(Очистка, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка(), ВидКИ));

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь);
	РолиПользователя.Добавить(ТекущийПользователь);
	Запрос.УстановитьПараметр("РолиПользователя", РолиПользователя);

	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());

	// Вставка картинок
	Для Каждого СтруктураЭлемента Из Результат Цикл
		СтруктураЭлемента.Картинка =
		CRM_РаботаСМессенджерамиСерверПовтИсп.КартинкаМессенджера(СтруктураЭлемента.УчетнаяЗапись);
	КонецЦикла;

	Возврат Результат;

КонецФункции //-- #1813 смарт: Фролов 13.05.2024
