#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = РеквизитФормыВЗначение("ДеревоКатегорий"); 
	Для каждого Категория из Параметры.Категории Цикл
		Родитель = Дерево.Строки.Найти(Категория.section.id, "Идентификатор");
		Если Родитель = Неопределено Тогда
			Родитель = Дерево.Строки.Добавить();
			Родитель.Идентификатор = Категория.section.id;
			Родитель.Категория = Категория.section.name;
			Родитель.Картинка = 0;
		КонецЕсли;
		НоваяКатегория = Родитель.Строки.Добавить();
		НоваяКатегория.Идентификатор = Категория.id;
		НоваяКатегория.Категория = Категория.name;
		НоваяКатегория.Картинка = 3;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоКатегорий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраннаяКатегория = ДеревоКатегорий.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ВыбраннаяКатегория.ПолучитьРодителя()<>Неопределено Тогда
		Закрыть(Новый Структура("Идентификатор, Категория", ВыбраннаяКатегория.Идентификатор, ВыбраннаяКатегория.Категория));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нельзя выбирать группу категорий!'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
