#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками
	
//++#1711 смарт: Лопато 05.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаявкаНаВозвратТоваровОтКлиента  
&ИзменениеИКонтроль("ИменаРеквизитовДляЗаполненияПараметровУказанияСерий")
Функция смарт_ИменаРеквизитовДляЗаполненияПараметровУказанияСерий()
	
	#Удаление //Подкин Алексей Иванович 04.06.2021 13:21:39 задача 520
	ИменаРеквизитов = "Склад,Дата,Статус";
	#КонецУдаления
	
	#Вставка //Подкин Алексей Иванович 04.06.2021 13:21:39 задача 520
	ИменаРеквизитов = "Склад,Дата,Статус,ВозвращаемыеТовары";
	#КонецВставки
	
	Возврат ИменаРеквизитов;
КонецФункции

//++#1711 смарт: Лопато 05.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаявкаНаВозвратТоваровОтКлиента  
&ИзменениеИКонтроль("ПараметрыУказанияСерий")
Функция смарт_ПараметрыУказанияСерий(Объект)

	#Удаление //Подкин Алексей Иванович 17.05.2021 12:46:36 задача 520
	ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.Склад, Ложь);
	#КонецУдаления
	
	#Вставка //Подкин Алексей Иванович 17.05.2021 12:46:36 задача 520
	Если Объект.Склад.ЭтоГруппа Тогда
	   ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.ВозвращаемыеТовары[0].смартСклад, Ложь);
	иначе	
	   ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.Склад, Ложь);
	КонецЕсли; 
	#КонецВставки

	Возвращаемые = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	Возвращаемые.ПолноеИмяОбъекта = ПолноеИмяОбъекта();
	
	Возвращаемые.ИспользоватьСерииНоменклатуры = ПараметрыСерийСклада.ИспользоватьСерииНоменклатуры;
	Возвращаемые.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСклада.УчитыватьСебестоимостьПоСериям;
	
	Возвращаемые.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПриемкаПоВозвратуОтКлиента);
	Возвращаемые.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	
	Возвращаемые.ПоляСвязи.Добавить("НоменклатураОприходование");
	Возвращаемые.ПоляСвязи.Добавить("ХарактеристикаОприходование");
	Возвращаемые.ПоляСвязи.Добавить("Назначение");
	
	Возвращаемые.ИмяТЧТовары = "ВозвращаемыеТовары";
	Возвращаемые.ИмяТЧСерии  = "ВозвращаемыеСерии";
	
	Возвращаемые.ЭтоНакладная = Истина;
	Возвращаемые.Дата = Объект.Дата;
	
	Заменяющие = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	Заменяющие.ПолноеИмяОбъекта = "Документ.ЗаявкаНаВозвратТоваровОтКлиента";
	
	Заменяющие.ИспользоватьСерииНоменклатуры = ПараметрыСерийСклада.ИспользоватьСерииНоменклатуры
					И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	Заменяющие.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСклада.УчитыватьСебестоимостьПоСериям
					И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	
	Заменяющие.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаКлиенту);
	
	Заменяющие.ИмяТЧТовары = "ЗаменяющиеТовары";
	Заменяющие.ИмяТЧСерии  = "ЗаменяющиеТовары";
	
	Заменяющие.ЭтоЗаказ = Истина;
	Заменяющие.ПланированиеОтгрузки = Истина;
	Заменяющие.РегистрироватьСерии = Ложь;
	Заменяющие.Дата = Объект.Дата;
	
	ПараметрыУказанияСерий = Новый Структура;
	ПараметрыУказанияСерий.Вставить("Возвращаемые",Возвращаемые);
	ПараметрыУказанияСерий.Вставить("Заменяющие",Заменяющие);
	
	Возврат ПараметрыУказанияСерий;
	
КонецФункции

//++#1711 смарт: Лопато 05.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаявкаНаВозвратТоваровОтКлиента  
&ИзменениеИКонтроль("ТекстЗапросаТаблицаДвижениеТоваров")
Функция смарт_ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ДвижениеТоваров";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки             КАК НомерСтроки,
		|	ТаблицаТовары.ДатаПоступления         КАК Период,
		|	&ЗаявкаНаВозвратТоваровОтКлиента      КАК Распоряжение,
		
		#Удаление //Подкин Алексей Иванович 17.05.2021 16:48:19 задача 520
		|	&Склад                                КАК Склад,
		#КонецУдаления
		
		#Вставка //Подкин Алексей Иванович 17.05.2021 16:48:19 задача 520
		|ВЫБОР
		|КОГДА ВЫРАЗИТЬ(&Склад КАК Справочник.Склады).ЭтоГруппа
		|	ТОГДА ТаблицаТовары.смартСклад
		|ИНАЧЕ &Склад
		|КОНЕЦ КАК Склад,
		#КонецВставки
		
		|
		|	ВЫБОР КОГДА ТаблицаТовары.Порча
		|		И ТаблицаТовары.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
		|			ТаблицаТовары.НоменклатураОприходование
		|		ИНАЧЕ
		|			ТаблицаТовары.Номенклатура
		|	КОНЕЦ                                 КАК Номенклатура,
		|
		|	ВЫБОР КОГДА ТаблицаТовары.Порча
		|		И ТаблицаТовары.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
		|			ТаблицаТовары.ХарактеристикаОприходование
		|		ИНАЧЕ
		|			ТаблицаТовары.Характеристика
		|	КОНЕЦ                                 КАК Характеристика,
		|
		|	ТаблицаТовары.Назначение              КАК Назначение,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ТОГДА ТаблицаТовары.Количество
		|	КОНЕЦ                                 КАК ПланируемоеПоступление,
		|	
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ТОГДА ТаблицаТовары.Количество
		|	КОНЕЦ                                 КАК ПланируемоеПоступлениеПодЗаказ,
		|	
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ТОГДА ТаблицаТовары.Количество
		|	КОНЕЦ                                 КАК ПланируемоеПоступлениеСНеподтвержденными,
		|	
		|	ВЫБОР 
		|		КОГДА ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ТОГДА ТаблицаТовары.Количество
		|	КОНЕЦ                                 КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТаблицаТовары
		|
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И НЕ ТаблицаТовары.Отменено
		|	И &Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
		
		#Вставка //++ смарт:Подкин #929 11.03.2022 13:31:34
        |   И НЕ ТаблицаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		#КонецВставки

		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

//++#1711 смарт: Лопато 05.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаявкаНаВозвратТоваровОтКлиента  
&ИзменениеИКонтроль("ТекстЗапросаТаблицаОбеспечениеЗаказов")
Функция смарт_ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ОбеспечениеЗаказов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период                                КАК Период,

		#Удаление //Подкин Алексей Иванович 17.05.2021 16:48:19 задача 520
		|	&Склад                                 КАК Склад,
		#КонецУдаления
		
		#Вставка //Подкин Алексей Иванович 17.05.2021 16:48:19 задача 520
		|ВЫБОР
		|КОГДА ВЫРАЗИТЬ(&Склад КАК Справочник.Склады).ЭтоГруппа
		|	ТОГДА ТаблицаТовары.смартСклад
		|ИНАЧЕ &Склад
		|КОНЕЦ КАК Склад,
		#КонецВставки
		
		|	ВЫБОР КОГДА ТаблицаТовары.Порча ТОГДА
		|		ТаблицаТовары.НоменклатураОприходование
		|	ИНАЧЕ 
		|		ТаблицаТовары.Номенклатура
		|	КОНЕЦ                                  КАК Номенклатура,
		|	ВЫБОР КОГДА ТаблицаТовары.Порча ТОГДА
		|		ТаблицаТовары.ХарактеристикаОприходование
		|	ИНАЧЕ 
		|		ТаблицаТовары.Характеристика
		|	КОНЕЦ                                  КАК Характеристика,
		|	ТаблицаТовары.Назначение               КАК Назначение,
		|	0                                      КАК Потребность,
		|	-ТаблицаТовары.Количество              КАК КЗаказу,
		|	0                                      КАК НаличиеПодЗаказ,
		|
		|	ИСТИНА                                 КАК КонтролироватьТолькоНаличиеПодЗаказ
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	И НЕ ТаблицаТовары.Отменено
		|	И &Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Формирование потребности
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	&Склад                                 КАК Склад,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	&Назначение                            КАК Назначение,
		|	ТаблицаТовары.Количество               КАК Потребность,
		|	ТаблицаТовары.Количество               КАК КЗаказу,
		|	0                                      КАК НаличиеПодЗаказ,
		|
		|	ЛОЖЬ                                   КАК КонтролироватьТолькоНаличиеПодЗаказ
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И НЕ ТаблицаТовары.Отменено
		|
		|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры В(
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|	И ТаблицаТовары.ВариантОбеспечения В(
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно),
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))
		|
		|	И &Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Закрытие потребности
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	ТаблицаТовары.Ссылка.Склад             КАК Склад,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	&Назначение                            КАК Назначение,
		|	ТаблицаТовары.Количество               КАК Потребность,
		|	0                                      КАК КЗаказу,
		|	ТаблицаТовары.Количество               КАК НаличиеПодЗаказ,
		|
		|	ЛОЖЬ                                   КАК КонтролироватьТолькоНаличиеПодЗаказ
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И НЕ ТаблицаТовары.Отменено
		|
		|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры В(
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|	И ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)
		|
		|	И &Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

//++#1711 смарт: Лопато 05.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаявкаНаВозвратТоваровОтКлиента  
&ИзменениеИКонтроль("ТекстЗапросаТаблицаТоварыКПоступлению")
Функция смарт_ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ТоварыКПоступлению";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.ДатаПоступления КАК Период,
	
	#Удаление //Подкин Алексей Иванович 17.05.2021 16:48:19 задача 520
	|	&Склад КАК Склад,
	#КонецУдаления
		
	#Вставка //Подкин Алексей Иванович 17.05.2021 16:48:19 задача 520
	|ВЫБОР
	|КОГДА ВЫРАЗИТЬ(&Склад КАК Справочник.Склады).ЭтоГруппа
	|	ТОГДА ТаблицаТовары.смартСклад
	|ИНАЧЕ &Склад
	|КОНЕЦ КАК Склад,
	#КонецВставки
		
	|	&Партнер КАК Отправитель,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Порча
	|				И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ТаблицаТовары.НоменклатураОприходование
	|		ИНАЧЕ ТаблицаТовары.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Порча
	|				И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ТаблицаТовары.ХарактеристикаОприходование
	|		ИНАЧЕ ТаблицаТовары.Характеристика
	|	КОНЕЦ КАК Характеристика,
	|	ТаблицаТовары.Назначение,
	|	ТаблицаТовары.Серия,
	|	ТаблицаТовары.Ссылка КАК ДокументПоступления,

	#Удаление //++ смарт:ПА #882 02.02.2022 12:11:38
	|	ВЫБОР
	|		КОГДА &ОрдернаяСхемаПриПоступлении
	|				И &ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КОформлениюОрдеров,
	#КонецУдаления
	
	#Вставка //++ смарт:ПА #882 02.02.2022 12:11:38
    |ВЫБОР
    | 	КОГДА ВЫБОР
    | 				КОГДА ВЫРАЗИТЬ(&Склад КАК Справочник.Склады).ЭтоГруппа
    | 						И ТаблицаТовары.смартСклад.ИспользоватьОрдернуюСхемуПриОтгрузке
    | 						И ТаблицаТовары.Ссылка.Дата >= ТаблицаТовары.смартСклад.ДатаНачалаОрдернойСхемыПриОтгрузке
    | 					ТОГДА ИСТИНА
    | 				ИНАЧЕ &ОрдернаяСхемаПриПоступлении
    | 			КОНЕЦ
    | 			И &ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным)
    | 		ТОГДА ТаблицаТовары.Количество
    | 	ИНАЧЕ 0
    | КОНЕЦ КАК КОформлениюОрдеров,
	#КонецВставки
	
	|	ТаблицаТовары.Количество КАК КОформлениюНакладныхПоРаспоряжению
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.Отменено
	|	И &Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),

	#Удаление //++ смарт:Подкин #929 11.03.2022 13:36:14
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))";
	#КонецУдаления
	
	#Вставка //++ смарт:Подкин #929 11.03.2022 13:36:14
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
    |   И НЕ ТаблицаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Услуга)";
	#КонецВставки
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
