
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьЗаписи	= Параметры.ЕстьЗаписи;
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица;
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды формы "ОК"
//
Процедура ОК(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Сегмент",						Сегмент);
	СтруктураВозврата.Вставить("ВидКонтактнойИнформации",		ВидКонтактнойИнформации);
	СтруктураВозврата.Вставить("НеЗаполнятьСПустымиТелефонами",	НеЗаполнятьСПустымиТелефонами);
	СтруктураВозврата.Вставить("ТолькоОсновныеКонтактныеЛица",	ТолькоОсновныеКонтактныеЛица);
	СтруктураВозврата.Вставить("ОчищатьТЧ",						Ложь);
	Если ЕстьЗаписи Тогда
		ОписаниеОтвета = Новый ОписаниеОповещения("ОбработкаОтвета", ЭтотОбъект, СтруктураВозврата);
		ШаблонТекстаВопроса = НСтр("ru='Табличная часть уже содержит записи.%1Очистить табличную часть?';en='Table section already contained records.%1Clear table section?'");
		ПоказатьВопрос(ОписаниеОтвета, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаВопроса, Символы.ПС),
						РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	КонецЕсли;
	Закрыть(СтруктураВозврата);
КонецПроцедуры // ОК()

&НаКлиенте
// Процедура - обработчик команды формы "Отмена"
//
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры // Отмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик ответа на вопрос
//
// Параметры:
//	РезультатВопроса		- Произвольный	- Результат ответа на вопрос
// ДополнительныеПараметры	- Структура		- Структура дополнительных параметров
//
Процедура ОбработкаОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.ОчищатьТЧ = Истина;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ДополнительныеПараметры.ОчищатьТЧ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	Закрыть(ДополнительныеПараметры);
КонецПроцедуры // ОбработкаОтвета()

#КонецОбласти
