#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ #1713 смарт: Мосолов 08.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. КорректировкаРеализации
//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.05.2020 12:15:04
Процедура ЗаполнитьПоЗаявкеНаВозвратТоваровОтКлиента(ДанныеЗаполнения)
	ДокументОснованиеЗаказКлиента = Документы.ЗаказКлиента.ПустаяСсылка();
	Если  ЗначениеЗаполнено(ДанныеЗаполнения.ДокументРеализации) и ТипЗнч(ДанныеЗаполнения.ДокументРеализации)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДокументОснование=ДанныеЗаполнения.ДокументРеализации;
		ДокументОснованиеЗаказКлиента = ДокументОснование.ЗаказКлиента;
	КонецЕсли;
	
	//++ смарт:ММ #051 02.06.2020
	смартОснованиеЗаявка = ДанныеЗаполнения.Ссылка;
	//-- смарт:ММ 02.06.2020
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Номер");
	
	//++ смарт:ММ #051 15.07.2020
	Дата = ТекущаяДата();
	//-- смарт:ММ 15.07.2020
	
	ВидКорректировки=Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон;
	
	//Заполнение корректировки на основании Реализации	
	ЗаполнитьПоРеализацииТоваровУслуг(ДокументОснование, Новый Структура);
	ПродажаПоЗаказам = Истина;
	
	//++ #Б-1358 смарт: Фролов 21.11.2024 //Заполнение документа Корректировка реализации при возврате товара
	УжеЕстьКорректировка = смартПроверитьНаличиеКорректировкиПоЗаявке();
	//-- #Б-1358 смарт: Фролов 21.11.2024	
	
	//Заполнение расхождений на основании Заявки
	Для Каждого СтрТЗ из ДанныеЗаполнения.ВозвращаемыеТовары Цикл
		НоваяСтрока=ЭтотОбъект.Расхождения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТЗ);
		НоваяСтрока.Склад=ДанныеЗаполнения.Склад;
		НоваяСтрока.Количество = НоваяСтрока.Количество*-1;
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок*-1;
		НоваяСтрока.Сумма = НоваяСтрока.Сумма*-1;
		НоваяСтрока.СуммаНДС =НоваяСтрока.СуммаНДС*-1;
		НоваяСтрока.СуммаСНДС =НоваяСтрока.СуммаСНДС*-1;
		
		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 17.05.2021 14:26:57 задача 520
		Если ДанныеЗаполнения.Склад.ЭтоГруппа Тогда
			НоваяСтрока.Склад=СтрТЗ.смартСклад;
		КонецЕсли; 
		
		//Смарт }Подкин Алексей Иванович 17.05.2021 14:26:57
		
		//++ смарт:ММ #051 27.05.2020 - УКД из корректировки выводилась неправильно из-за того, 
		// что в реализации есть ТНВЭД, а в корректировке - нет
		НоваяСтрока.КодТНВЭД = НоваяСтрока.Номенклатура.КодТНВЭД;
		//-- смарт:ММ 27.05.2020
		
		НоваяСтрока.ЗаказКлиента = ДокументОснованиеЗаказКлиента;
		
		//Определение типа склада, для выбора варианта отражения
		ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = СкладыСервер.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач(НоваяСтрока.Склад, ЭтотОбъект.Дата);
		
		Если НоваяСтрока.Количество<0 И НЕ ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
			НоваяСтрока.ВариантОтражения=Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки;
		ИначеЕсли НоваяСтрока.Количество<0 И ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
			НоваяСтрока.ВариантОтражения=Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации;
		КонецЕсли;
		
		//04.06.2021
		Если НоваяСтрока.Номенклатура.ТипНоменклатуры=ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") и НоваяСтрока.Количество<0 Тогда
			НоваяСтрока.ВариантОтражения=Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьВыручку;
		иначеЕсли НоваяСтрока.Номенклатура.ТипНоменклатуры=ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") и НоваяСтрока.Количество>0 Тогда
			НоваяСтрока.ВариантОтражения=Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьВыручку;
		КонецЕсли; 
		
		//++ #Б-1358 смарт: Фролов 21.11.2024 //Заполнение документа Корректировка реализации при возврате товара
		Если ЭтотОбъект.Товары.Количество()>0 И НЕ УжеЕстьКорректировка Тогда
			
			//++ #4720 смарт: Тимофеева 12.11.2025 / Корректировка реализации не учитывает серии
			//СтрокиТЧ = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрТЗ.Номенклатура, СтрТЗ.Характеристика));
			СтрокиТЧ = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", СтрТЗ.Номенклатура, СтрТЗ.Характеристика, СтрТЗ.Серия));
			//-- #4720 смарт: Тимофеева 12.11.2025
			
			Если СтрокиТЧ.Количество() > 0 Тогда
				
				РазницаКол= СтрокиТЧ[0].Количество + НоваяСтрока.Количество;
				Если РазницаКол=0 тогда
					ЭтотОбъект.Товары.Удалить(СтрокиТЧ[0]);
				Иначе
					Если СтрокиТЧ[0].КоличествоУпаковок = СтрокиТЧ[0].Количество Тогда
						СтрокиТЧ[0].КоличествоУпаковок = РазницаКол;
					КонецЕсли;
					СтрокиТЧ[0].Количество= РазницаКол;
					
					СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
					
					СтруктураДействий = Новый Структура;
					СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
					
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокиТЧ[0], СтруктураДействий, Неопределено);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//-- #Б-1358 смарт: Фролов 25.11.2024
		
	КонецЦикла;
	
	ЭтотОбъект.Проведен=Ложь;

КонецПроцедуры //-- #1713 смарт: Мосолов 08.07.2024

//++ #1713 смарт: Мосолов 08.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. КорректировкаРеализации
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда

		ЗаполнитьПоРеализацииТоваровУслуг(ДанныеЗаполнения, ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда

		ЗаполнитьПоАктуВыполненныхРабот(ДанныеЗаполнения, ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда

		ЗаполнитьПоРеализацииУслугПрочихАктивов(ДанныеЗаполнения, ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("АктОРасхождениях")
		И ДанныеЗаполнения.Свойство("Реализация")
		И ДанныеЗаполнения.Свойство("Операция") Тогда

		ЗаполнитьПоАктуОРасхожденияхПослеОтгрузки(ДанныеЗаполнения, ДанныеЗаполнения);
		
	#Вставка
	//++ #1713 смарт: Мосолов 08.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. КорректировкаРеализации
		//++ Смарт Подкин Алексей Иванович 08.05.2020	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ЗаполнитьПоЗаявкеНаВозвратТоваровОтКлиента(ДанныеЗаполнения);	
		//-- Смарт Подкин Алексей Иванович 08.05.2020	
	//-- #1713 смарт: Мосолов 08.07.2024 
	#КонецВставки
		
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);

	КорректировкаРеализацииЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

КонецПроцедуры //-- #1713 смарт: Мосолов 08.07.2024

//++ #1713 смарт: Мосолов 08.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. КорректировкаРеализации
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.КорректировкаРеализации.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКОформлениюИзлишковНедостач(ДополнительныеСвойства, Движения, Отказ);
	
	#Вставка
	//++ #1713 смарт: Мосолов 08.07.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. КорректировкаРеализации
	//++ Смарт Подкин Алексей Иванович 25.04.2020 19:45:59  
	//ЗапасыСервер.ОтразитьТоварыКОформлениюИзлишковНедостач(ДополнительныеСвойства, Движения, Отказ);
	Если НЕ ЗначениеЗаполнено(смартОснованиеЗаявка) тогда
		ЗапасыСервер.ОтразитьТоварыКОформлениюИзлишковНедостач(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
		ЗаказыСервер.ОтразитьЗаявкиНаВозвратТоваровОтКлиентов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//-- Смарт Подкин Алексей Иванович 25.04.2020 21:36:31
	//-- #1713 смарт: Мосолов 08.07.2024 
	#КонецВставки
	
	ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыОрганизацийКПередаче(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКОформлениюОтчетовКомитента(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьУслугиКОформлениюОтчетовПринципалу(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьВыручкуИСебестоимостьПродаж(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеДоходы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеРасходы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПартииПрочихРасходов(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеАктивыПассивы(ДополнительныеСвойства, Движения, Отказ);
	УчетНДСУП.СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	ВзаиморасчетыСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);

	ЗатратыСервер.ОтразитьМатериалыИРаботыВПроизводстве(ДополнительныеСвойства, Движения, Отказ);

	ВзаиморасчетыСервер.ОтразитьСуммыДокументаВВалютеРегл(ДополнительныеСвойства, Движения, Отказ);
	МногооборотнаяТараСервер.ОтразитьПереданнуюВозвратнуюТару(ДополнительныеСвойства, Движения, Отказ);

	// Движения по оборотным регистрам управленческого учета
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияКонтрагентДоходыРасходы(ДополнительныеСвойства, Движения, Отказ);

	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	СформироватьСписокРегистровДляКонтроля();

	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.Проведение);	

	КорректировкаРеализацииЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПараметрыЗаполнения = ЗапасыСервер.ПараметрыЗаполненияВидовЗапасов();
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

	ПараметрыРегистрации = Документы.КорректировкаРеализации.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПриПроведении(ПараметрыРегистрации);

	ПараметрыРегистрации = Документы.КорректировкаРеализации.ПараметрыРегистрацииСчетовФактурВыданных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыВыданныеПриПроведении(ПараметрыРегистрации);

КонецПроцедуры //-- #1713 смарт: Мосолов 08.07.2024 

//++ #Б-1358 смарт: Фролов 22.11.2024 //Заполнение документа Корректировка реализации при возврате товара
Функция смартПроверитьНаличиеКорректировкиПоЗаявке()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации
	|ГДЕ
	|	смартОснованиеЗаявка = &смартОснованиеЗаявка
	|	И Проведен");
	Запрос.УстановитьПараметр("смартОснованиеЗаявка", смартОснованиеЗаявка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции //-- #Б-1358 смарт: Фролов 22.11.2024	

#КонецЕсли
