
#Область ПеренесеноСДоработкамиСмарт

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
&После("ПриИзмененииКонтактнойИнформации")
Процедура смарт_ПриИзмененииКонтактнойИнформации(Форма, Элемент, ЭтоТабличнаяЧасть, ОбновитьФорму, АсинхронныйВызов)
	
	CRM_УправлениеКонтактнойИнформациейКлиент.ПриИзменении(Форма, Элемент);
	
КонецПроцедуры

&После("КонтактнаяИнформацияДобавитьПолеВводаЗавершение")
Процедура смарт_КонтактнаяИнформацияДобавитьПолеВводаЗавершение(Знач ВыбранныйЭлемент, Знач ДополнительныеПараметры)
	
	Форма = ДополнительныеПараметры.Форма;
	ТекЭлемент = Форма.ТекущийЭлемент;
	ТекЭлементИмя = ТекЭлемент.Имя;
	
	Отбор = Новый Структура("ИмяРеквизита", ТекЭлементИмя);
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			
			ТекЭлемент.ПодсказкаВвода 		= "+7 ХХХ ХХХ ХХ ХХ или 8 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
			ТекЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
			ТекЭлемент.Подсказка			= "Если номер имеет заграничный формат, нажмите на кнопку выбора или F4 и введите номер";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//--#1012 смарт: Холопов 04.05.2022

&Вместо("ПослеВыбораИзМенюТелефон")
Процедура смарт_ПослеВыбораИзМенюТелефон(ВыбранныйЭлемент, Параметры)

	//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Если ВыбранныйЭлемент.Значение = "ОтправитьSMS" Тогда
			СоздатьSMS("", Параметры.НомерТелефона, Параметры.ТипКонтактнойИнформации, Параметры.ИсточникКонтактнойИнформации);
		Иначе
			сфпСофтФонПроКлиент.сфпПозвонить(Параметры.НомерТелефона, Параметры.ИсточникКонтактнойИнформации);
 		КонецЕсли;
	КонецЕсли;
	//--#1352 смарт: Лопато 04.05.2023

КонецПроцедуры

#КонецОбласти