
&Перед("ПриОпределенииОбъектовСКомандамиСозданияНаОсновании")
Процедура смарт_ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты)
	//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 20.05.2021 15:40:11 убрал для автоматическиго формирования основания
	//Объекты.Добавить(Метаданные.Документы.смартПредзаказПоставщику);
	//Смарт }Подкин Алексей Иванович 20.05.2021 15:40:11
	
		
	//++ смарт:ММ #092 389 03.02.2021 - Конструктор оборудования
	Объекты.Добавить(Метаданные.Документы.смартIECHOСпецификация);
	//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
	Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаРемонтныеРаботы);
	Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаРазборкуОборудования);
	//-- #1989 смарт: Лопато 15.08.2024
	//Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаПускоНаладку);
	//Объекты.Добавить(Метаданные.Документы.смартЗаявкаНаГарантийныйРемонт);
	//-- смарт:ММ 03.02.2021
	
	//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
	Объекты.Добавить(Метаданные.Справочники.ПретензииКлиентов);
	//-- #Б2802 смарт: Шляпников 15.04.2025

КонецПроцедуры
