#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка); 
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаЗаявкиНаРазборкуОборудования(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры);

	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ";
	
	Для Каждого Реквизит Из Метаданные.Документы.смартЗаявкаНаРазборкуОборудования.СтандартныеРеквизиты Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	" + Реквизит.Имя + " КАК " + Реквизит.Имя + ",";
		
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.Документы.смартЗаявкаНаРазборкуОборудования.Реквизиты Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	" + Реквизит.Имя + " КАК " + Реквизит.Имя + ",";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "ИЗ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ",ИЗ", Символы.ПС + "ИЗ" + Символы.ПС);
	
	Запрос.Текст = Запрос.Текст + "
	|	Документ.смартЗаявкаНаРазборкуОборудования
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	Реквизиты = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Колонка Из Реквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[0][Колонка.Имя]); 
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Период", Реквизиты[0].Дата);
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());
	
КонецПроцедуры  

Функция ТекстЗапросаТаблицаЗаявкиНаРазборкуОборудования(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартЗаявкиНаРазборкуОборудования";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК Заявка,
	|	&Номенклатура КАК Номенклатура,
	|	&Серия КАК Серия,
	|	1 КАК КРазборке,
	|	0 КАК КПолучению
	|
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК Заявка,
	|	Номенклатура КАК Номенклатура,
	|	&Серия КАК Серия, 
	|	0 КАК КРазборке,
	|	Количество КАК КПолучению
	|ИЗ
	|	Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И &КВыполнению И НЕ &Отменена	
	|	
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК Заявка,
	|	&Узел КАК Номенклатура,
	|	&Серия КАК Серия,
	|	0 КАК КРазборке,
	|	1 КАК КПолучению
	|
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена	
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартОборудованиеКРазборке";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 				КАК Период,
	|	&Ссылка 				КАК Заявка,
	|	&Номенклатура 			КАК Номенклатура,
	|	&Серия 					КАК Серия,
	|	&ПереместитьСоСклада 	КАК Склад,
	|	&Склад 					КАК СкладПолучатель,
	|	&Назначение 			КАК Назначение,
	|	0 						КАК КРазборке,
	|	0 						КАК КПолучению,
	|	1 						КАК КПеремещению
	|
	|ГДЕ 
	|	&КВыполнению И НЕ &Отменена
	|	И НЕ &ПереместитьСоСклада = &ПустойСклад
	|	И НЕ &ПереместитьСоСклада = &Склад
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 				КАК Период,
	|	&Ссылка 				КАК Заявка,
	|	&Узел 					КАК Номенклатура,
	|	&Серия 					КАК Серия,
	|	&Склад 					КАК Склад,
	|	&УзелПереместитьНаСклад КАК СкладПолучатель,
	|	&Назначение 			КАК Назначение,
	|	0 						КАК КРазборке,
	|	0 						КАК КПолучению,
	|	1 						КАК КПеремещению
	|
	|ГДЕ 
	|	&КВыполнению И НЕ &Отменена
	|	И НЕ &УзелПереместитьНаСклад = &ПустойСклад
	|	И НЕ &УзелПереместитьНаСклад = &Склад
	|	
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 		КАК Период,
	|	&Ссылка 		КАК Заявка,
	|	&Номенклатура 	КАК Номенклатура,
	|	&Серия 			КАК Серия,
	|	&Склад 			КАК Склад,
	|	&ПустойСклад 	КАК СкладПолучатель,
	|	&Назначение 			КАК Назначение,
	|	1 				КАК КРазборке,
	|	0 				КАК КПолучению,
	|	0 				КАК КПеремещению
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 		КАК Период,
	|	&Ссылка 		КАК Заявка,
	|	&Узел 			КАК Номенклатура,
	|	&Серия 			КАК Серия,
	|	&Склад 			КАК Склад,
	|	&ПустойСклад 	КАК СкладПолучатель,
	|	&Назначение 	КАК Назначение,
	|	0 				КАК КРазборке,
	|	1 				КАК КПолучению,
	|	0 				КАК КПеремещению
	|ГДЕ
	|	&КВыполнению И НЕ &Отменена
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 		КАК Период,
	|	&Ссылка 		КАК Заявка,
	|	Номенклатура 	КАК Номенклатура,
	|	&Серия 			КАК Серия,
	|	&Склад 			КАК Склад,
	|	&ПустойСклад 	КАК СкладПолучатель,
	|	&Назначение 	КАК Назначение,
	|	0 				КАК КРазборке,
	|	Количество 		КАК КПолучению,
	|	0 				КАК КПеремещению
	|ИЗ
	|	Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие
	|	
	|ГДЕ 
	|	Ссылка = &Ссылка	
	|	И &КВыполнению 
	|	И НЕ &Отменена	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 			КАК Период,
	|	&Ссылка 			КАК Заявка,
	|	Номенклатура 		КАК Номенклатура,
	|	&Серия 				КАК Серия,
	|	&Склад 				КАК Склад,
	|	ПереместитьНаСклад 	КАК СкладПолучатель,
	|	&Назначение 		КАК Назначение,
	|	0 					КАК КРазборке,
	|	0		 			КАК КПолучению,
	|	Количество			КАК КПеремещению
	|ИЗ
	|	Документ.смартЗаявкаНаРазборкуОборудования.Комплектующие
	|	
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И &КВыполнению 
	|	И НЕ &Отменена
	|	И НЕ ПереместитьНаСклад = &ПустойСклад 
	|	И НЕ ПереместитьНаСклад = &Склад 
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьСсылкуНаЗаявкуПоОснованию(ДокументСсылка, ВсеЗаявки = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение")
			Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
			
		//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
		Заявка = ?(ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования"),
					ДокументСсылка.ДокументОснование,
					Документы.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка());
		
		Если ВсеЗаявки = Неопределено Тогда
			Возврат Заявка;
		Иначе
			Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заявка);
		КонецЕсли;
		//-- #Б2138 смарт: Шляпников 19.02.2025
			
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаРазборку.Ссылка КАК Заявка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Перемещение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказыНаПеремещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРазборкуОборудования КАК ЗаявкиНаРазборку
	|		ПО
	|			ЗаявкиНаРазборку.Ссылка = ЗаказыНаПеремещение.ДокументОснование
	|			И ЗаявкиНаРазборку.Проведен
	|	ПО
	|		ЗаказыНаПеремещение.Ссылка = Перемещение.ЗаказНаПеремещение
	|		И ЗаказыНаПеремещение.Проведен
	|ГДЕ
	|	Перемещение.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ
	|       
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаРазборку.Ссылка КАК Заявка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказыНаСборку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРазборкуОборудования КАК ЗаявкиНаРазборку
	|		ПО
	|			ЗаявкиНаРазборку.Ссылка = ЗаказыНаСборку.ДокументОснование
	|			И ЗаявкиНаРазборку.Проведен
	|	ПО
	|		ЗаказыНаСборку.Ссылка = СборкаТоваров.ЗаказНаСборку
	|		И ЗаказыНаСборку.Проведен
	|ГДЕ
	|	СборкаТоваров.Ссылка = &ДокументСсылка
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	//|	И СборкаТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|
	|ОБЪЕДИНИТЬ
	|       
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Назначения.Заказ КАК Заявка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|	ПО Товары.Назначение = Назначения.Ссылка
	|		И Назначения.Заказ ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|		И НЕ Назначения.Заказ = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка)
	|ГДЕ
	|	Товары.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ
	|       
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Назначения.Заказ КАК Заявка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|	ПО Товары.Назначение = Назначения.Ссылка
	|		И Назначения.Заказ ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|		И НЕ Назначения.Заказ = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка)
	|ГДЕ
	|	Товары.Ссылка = &ДокументСсылка";
	
	МассивЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");
	
	Возврат ?(ВсеЗаявки = Неопределено, 
			  ?(МассивЗаявок.Количество() > 0, МассивЗаявок[0], Документы.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка()),
			  МассивЗаявок);
	//-- #Б2138 смарт: Шляпников 19.02.2025
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Склад)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = ЭтотСписок.Партнер
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|	ПО КонтактныеЛицаПартнеров.Владелец = ЭтотСписок.Партнер
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиКонтактныеЛица
	|	ПО ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации = КонтактныеЛицаПартнеров.Ссылка
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)
	|	ИЛИ ЗначениеРазрешено(ВнешниеПользователиКонтактныеЛица.Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

КонецПроцедуры

#КонецОбласти 

#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ВводНаОсновании

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
// Добавляет команду создания документа "Заявка на разборку оборудования (смарт)".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.смартЗаявкаНаРазборкуОборудования) Тогда

		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.смартЗаявкаНаРазборкуОборудования.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.смартЗаявкаНаРазборкуОборудования);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции //-- #1989 смарт: Лопато 15.08.2024

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Задачи.ЗадачаИсполнителя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЗаказНаПеремещение.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ЗаказНаСборку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры //-- #1989 смарт: Лопато 15.08.2024

#КонецОбласти

#Область Назначения

//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
// Возврашает шаблон для генерации назначения товаров в документе.
//
// Параметры:
// 		Объект - ДокументОбъект.ЗаказКлиента, ДанныеФормыСтруктура - заказ клиента, по которому необходимо получить шаблон назначения.
//
// Возвращаемое значение:
// 		Структура - (см. функцию Справочники.Назначения.ШаблонНового).
//
Функция ШаблонНазначения(Объект, ЧтоПроизошло) Экспорт
	
	ШаблонНазначения = Справочники.Назначения.ШаблонНового();
	ШаблонНазначения.Заказ = Объект.Ссылка;
	ШаблонНазначения.смартРазобранноеОборудованиеТипНазначения = ЧтоПроизошло;
	ШаблонНазначения.смартРазобранноеОборудование = Объект.Номенклатура;
	ШаблонНазначения.смартРазобранноеОборудованиеСерия = Объект.Серия;
	ШаблонНазначения.смартРазобранноеОборудованиеУзел = Объект.Узел;
	
	Возврат ШаблонНазначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
