
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ПодготовитьПоискДублейПоЗначению")
//++ #Б-3500 смарт: Фролов 03.07.2025 //Создание интереса в ручную, дубли контрагентов
Процедура смарт_ПодготовитьПоискДублейПоЗначению(Форма, ЗначениеПоиска, ИмяПоля, ТипКИ)
    
	#Удаление //++ #Б-3500 смарт: Фролов 03.07.2025 //Создание интереса в ручную, дубли контрагентов
	Если НЕ CRM_ПоискКонтактовВызовСервера.РеквизитИспользуетсяПриПоискеДублейПоЗначению(Форма, ИмяПоля, ТипКИ) Тогда
		CRM_ПоискКонтактовВызовСервера.УдалитьРеквизитТаблицыПоискаДублейПоЗначению(Форма, CRM_ПоискКонтактовВызовСервера.ИмяТаблицыПоискДублейПоЗначению(ИмяПоля) );
		CRM_ПоискКонтактовВызовСервера.НастроитьФормуПослеПоискаДублей(Форма, ИмяПоля);
		Возврат;
	КонецЕсли;
	#КонецУдаления
	
	#Вставка
	//++ #Б-3500 смарт: Фролов 03.07.2025 //Создание интереса в ручную, дубли контрагентов
	Если НЕ CRM_ПоискКонтактовВызовСервера.РеквизитИспользуетсяПриПоискеДублейПоЗначению(Форма, ИмяПоля, ТипКИ)
		И НЕ (Форма.ИмяФормы = "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая" И ИмяПоля = "Клиент_ОбъектCRM_ИНН") Тогда
		
		CRM_ПоискКонтактовВызовСервера.УдалитьРеквизитТаблицыПоискаДублейПоЗначению(Форма, CRM_ПоискКонтактовВызовСервера.ИмяТаблицыПоискДублейПоЗначению(ИмяПоля) );
		CRM_ПоискКонтактовВызовСервера.НастроитьФормуПослеПоискаДублей(Форма, ИмяПоля);
		Возврат;
		
	КонецЕсли;
	//-- #Б-3500 смарт: Фролов 03.07.2025
	#КонецВставки

	лСтрокаПоиска = СокрЛП(ЗначениеПоиска);

	Отказ = Ложь;

	Если СтрДлина(лСтрокаПоиска) < 3  И СтрДлина(лСтрокаПоиска) > 0 Тогда // Минимальная длина строки поиска 3 символа
		Отказ = Истина;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	CRM_ПоискКонтактовВызовСервера.ВыполнитьПоискДублейПоЗначениюНаСервере(Форма, лСтрокаПоиска, ИмяПоля, ЗначениеПоиска);

КонецПроцедуры //-- #Б-3500 смарт: Фролов 03.07.2025

#КонецОбласти