
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Фролов+
	Элементы.Дилер.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПризнакаДилер");
	Элементы.смартДилерСервисЦентра.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПризнакаДилерСЦ");
	Элементы.смартПартнерОсобыеУсловияПеревозкиОписание.Видимость=Объект.смартПартнерОсобыеУсловияПеревозки;
	Объект.смартПартнерСпособДоставки=?(ЗначениеЗаполнено(Объект.смартПартнерСпособДоставки),Объект.смартПартнерСпособДоставки,Перечисления.СпособыДоставки.Самовывоз);
	
	ЗаполнитьСпискиАдресовДоставки(Объект.Ссылка,Элементы.смартПартнерАдресДоставки.Имя);
	Если ЗначениеЗаполнено(Объект.смартПартнерАдресДоставкиПеревозчика) Тогда 
		ЗаполнитьСпискиАдресовДоставки(Объект.смартПартнерАдресДоставкиПеревозчика,Элементы.смартПартнерАдресДоставкиПеревозчика.Имя);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.смартПартнерКонтактноеЛицо) Тогда 
		ЗаполнитьСписокТелефоновКонтактногоЛица(Объект.смартПартнерКонтактноеЛицо);
	КонецЕсли;
	ЗаполнитьЗонуДоставки();
	// Фролов-
	
	//++ смарт:ММ #082 397 28.02.2021 Заявка на ремонтные работы
	ДобавитьЭлементыПрограммно();
	//-- смарт:ММ 28.02.2021
	
	// ++ смарт Белоусова #469 11.06.2021 доработка
	Элементы.смартКлючевойКлиентПоРасходнымМатериалам.Доступность = Ложь;
	// -- смарт Белоусова #469 11.06.2021
	
	// ++ смарт Белоусова #469 12.03.2021
	Если РольДоступна("ПолныеПрава") или РольДоступна("смартРедактированиеКлючевыхКлиентов") Тогда
		Элементы.смартКлючевойКлиентПоРасходнымМатериалам.Доступность = Истина;
	КонецЕсли;	
	// -- смарт Белоусова #469 12.03.2021

		
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаметкиПосле(Команда)
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин 27.11.2019 17:55:37
	смартВызовКоманды(Объект.Ссылка);
	//Смарт }Подкин 27.11.2019 17:55:37
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт
//++ #1262 смарт: Фролов 30.11.2022 //Перенос адреса веб сайта в карточке клиента  
// Богус++
//&НаКлиенте
//Процедура смарт_СайтНажатиеПосле(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка=Ложь;
//	ЗапуститьПриложение(Объект.Сайт);
//КонецПроцедуры

//&НаКлиенте
//Процедура смарт_РедактироватьСайтВместо(Команда)
//	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПослеВводаИмениСайта",ЭтаФорма),?(ПустаяСтрока(Объект.Сайт),"",Объект.Сайт),"Введите ссылку на сайт партнера",100);
//КонецПроцедуры

//&НаСервере
//Процедура ПослеВводаИмениСайта(Стр,ДопПараметры)Экспорт 
//	Если Не (Стр=Неопределено Или СтрНачинаетсяС(Стр,"http")) Тогда  
//			Стр="http://"+Стр;
//	КонецЕсли;	
//	Объект.Сайт=Стр;
//	Модифицированность=Истина;
//КонецПроцедуры	
// Богус--
//-- #1262 смарт: Фролов 30.11.2022

//--------------Оборудование клиента------------------------
//Процедуры и функции для реализации функционала управления оборудованием клиента
&НаКлиенте
Процедура РасшСмарт_смартДобавитьОборудованиеКлиента(Команда)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Добавить оборудование");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Вернуться назад");

	ТекстВопроса = НСтр("ru = 'Перед выбором убедитесь что оборудования, которое вы хотите добавить, нет в списке'");

	Оповещение = Новый ОписаниеОповещения("РасшСмарт_ПослеОтветаНаВопросДобавитьОборудование", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 0,, "Добавление оборудования клиента");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ПослеОтветаНаВопросДобавитьОборудование(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		РасшСмарт_ОткрытьФормуВыбораОборудования();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ОткрытьФормуВыбораОборудования()
	
	ПараметрЗаголовок = НСтр("ru = 'Добавление оборудования для %Справочник%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", НСтр("ru='(новый клиент)'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДобавления", 	Дата(ТекущаяДата()));
	ПараметрыФормы.Вставить("Партнер", 			Объект.Ссылка);
	
	//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
	ПараметрыФормы.Вставить("смартТипОборудованияКлиента", ПредопределенноеЗначение("Перечисление.смартТипыОборудованияКлиента.Оборудование"));
	//-- смарт:ММ 23.04.2020
	
	ПараметрыТовара = РасшСмарт_ПараметрыТаблицыОборудование();
	
	ОткрытьФорму("Справочник.Партнеры.Форма.РасшСмарт_ФормаДобавленияОборудования", 
				ПараметрыФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				Новый ОписаниеОповещения("РасшСмарт_ДобавитьОборудованиеКлиентаПослеВыбора", ЭтотОбъект, ПараметрыТовара),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ДобавитьОборудованиеКлиентаПослеВыбора(ПодобранноеОборудование, ДополнительныеПараметры) Экспорт 
	
	Если ПодобранноеОборудование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасшСмарт_ДобавитьОборудованиеКлиентаЗавершение(ДополнительныеПараметры, ПодобранноеОборудование);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ДобавитьОборудованиеКлиентаЗавершение(ПараметрыОборудования, НовыеСтроки)

	//ТекстОповещения = РасшСмарт_ДобавитьОборудованиеВСписокНаКлиенте(ПараметрыОборудования, НовыеСтроки);
	
	Отбор = Новый Структура("смартОборудованиеКлиента");
	
	Для каждого НоваяСтрока Из НовыеСтроки Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
		                  
		РезультатПоиска = Объект.смартОборудованиеКлиентов.НайтиСтроки(Отбор);
		
		Если РезультатПоиска.Количество() = 0 Тогда
			
			ТекущаяСтрока = Объект.смартОборудованиеКлиентов.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Отбор);
			ТекущаяСтрока.смартДатаДобавления = Дата(ТекущаяДата());
			ТекущаяСтрока.смартКомментарий = НоваяСтрока.смартКомментарий; 
			
			Если НовыеСтроки.Количество() > 0 Тогда
				Элементы.смартОборудованиеКлиентов.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		Иначе
			Сообщить("Это оборудование уже добавлено");
		КонецЕсли;
			
		//Если Не РасшСмарт_АдминистраторСервисЦентра() Тогда			
		//	ТекстОповещения = НСтр("ru = 'Добавлено новое оборудование клиенту'");	
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция РасшСмарт_ДобавитьОборудованиеВСписокНаКлиенте(ПараметрыОборудования, НовыеСтроки)

	
	
	//Возврат ТекстОповещения;
	
КонецФункции 

&НаСервере
Функция РасшСмарт_ПараметрыТаблицыОборудование()

	ПараметрыТаблицыОборудование = Новый Структура;
	ПараметрыТаблицыОборудование.Вставить("смартНаименованиеОборудования", "");
	ПараметрыТаблицыОборудование.Вставить("смартОборудованиеКлиента", ПредопределенноеЗначение("Справочник.смартОборудованиеКлиентов.ПустаяСсылка"));
	ПараметрыТаблицыОборудование.Вставить("смартДатаДобавления", '00010101');
	ПараметрыТаблицыОборудование.Вставить("смартКомментарий", "");
	
	Возврат ПараметрыТаблицыОборудование;

КонецФункции // ПараметрыТаблицыОборудование()

&НаСервере
Функция РасшСмарт_АдминистраторСервисЦентра()

	АдминистраторСЦ = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеСоставаОборудованияПартнера");

	Возврат АдминистраторСЦ;
	
КонецФункции // РасшСмарт_АдминистраторСервисЦентра()

&НаКлиенте
Процедура РасшСмарт_смартРазрешитьРедактированиеОборудования(Команда)
	
	РасшСмарт_смартРазрешитьРедактированиеОборудованияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РасшСмарт_смартРазрешитьРедактированиеОборудованияНаСервере()
	
	Если РасшСмарт_АдминистраторСервисЦентра() Тогда
		
		Элементы.смартОборудованиеКлиентовИзменить.Видимость 					= Истина;
		Элементы.смартОборудованиеКлиентовУдалить.Видимость 					= Истина;
		Элементы.смартОборудованиеКлиентовсмартОборудованиеКлиента.Доступность 	= Истина;
		Элементы.смартОборудованиеКлиентовсмартДатаДобавления.Доступность 		= Истина;
		Элементы.смартОборудованиеКлиентов.ЦветФона 							= ЦветаСтиля.ЦветФонаПоля;
		Элементы.смартОборудованиеКлиентов.ИзменятьСоставСтрок 					= Истина;
		
	Иначе
		Сообщить("Изменение доступно не всем, обратитесь к администратору");
	КонецЕсли;
	
КонецПроцедуры
//--------------конец Оборудование клиента------------------------

//--------------Чернила клиента------------------------------
#Область ОборудованиеКлиента

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура смарт_смартРазрешитьРедактированиеЧернилПосле(Команда)
	
	РасшСмарт_смартРазрешитьРедактированиеЧернилНаСервере();
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаСервере
Процедура РасшСмарт_смартРазрешитьРедактированиеЧернилНаСервере()
	
	Если РасшСмарт_АдминистраторСервисЦентра() Тогда
		
		Элементы.смартЧернилаКлиентаИзменить.Видимость 					= Истина;
		Элементы.смартЧернилаКлиентаУдалить.Видимость 					= Истина;
		Элементы.смартЧернилаКлиентасмартЧернилаКлиента.Доступность 	= Истина;
		Элементы.смартЧернилаКлиентасмартДатаДобавления.Доступность 	= Истина;
		Элементы.смартЧернилаКлиента.ЦветФона 							= ЦветаСтиля.ЦветФонаПоля;
		Элементы.смартЧернилаКлиента.ИзменятьСоставСтрок 				= Истина;
		
	Иначе
		Сообщить("Изменение доступно не всем, обратитесь к администратору");
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура смарт_смартДобавитьЧернилаКлиентаПосле(Команда)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Добавить расходный материал");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Вернуться назад");

	ТекстВопроса = НСтр("ru = 'Перед выбором убедитесь, что расходного материала, который вы хотите добавить, нет в списке'");

	Оповещение = Новый ОписаниеОповещения("РасшСмарт_ПослеОтветаНаВопросДобавитьЧернила", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 0,, "Добавление расходного материала клиента");

КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ПослеОтветаНаВопросДобавитьЧернила(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		РасшСмарт_ОткрытьФормуВыбораЧернил();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ОткрытьФормуВыбораЧернил()
	
	ПараметрЗаголовок = НСтр("ru = 'Добавление чернил для %Справочник%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", НСтр("ru='(новый клиент)'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДобавления", 	Дата(ТекущаяДата()));
	ПараметрыФормы.Вставить("Партнер", 			Объект.Ссылка);
	ПараметрыФормы.Вставить("смартТипОборудованияКлиента", ПредопределенноеЗначение("Перечисление.смартТипыОборудованияКлиента.Чернила"));
	
	ПараметрыТовара = РасшСмарт_ПараметрыТаблицыОборудование();
	
	ОткрытьФорму("Справочник.Партнеры.Форма.РасшСмарт_ФормаДобавленияОборудования", 
				ПараметрыФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				Новый ОписаниеОповещения("РасшСмарт_ДобавитьЧернилаКлиентаПослеВыбора", ЭтотОбъект, ПараметрыТовара),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	Возврат;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ДобавитьЧернилаКлиентаПослеВыбора(ПодобранноеОборудование, ДополнительныеПараметры) Экспорт 
	
	Если ПодобранноеОборудование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасшСмарт_ДобавитьЧернилаКлиентаЗавершение(ДополнительныеПараметры, ПодобранноеОборудование);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

//++ смарт:ММ #045 243 23.04.2020 - добавление команд для ТЧ Чернила клиента  
&НаКлиенте
Процедура РасшСмарт_ДобавитьЧернилаКлиентаЗавершение(ПараметрыОборудования, НовыеСтроки)
	
	Отбор = Новый Структура("смартЧернилаКлиента");
	
	Для Каждого НоваяСтрока Из НовыеСтроки Цикл
		
		Отбор.смартЧернилаКлиента = НоваяСтрока.смартОборудованиеКлиента;
		                  
		РезультатПоиска = Объект.смартЧернилаКлиента.НайтиСтроки(Отбор);
		
		Если РезультатПоиска.Количество() = 0 Тогда
			
			ТекущаяСтрока = Объект.смартЧернилаКлиента.Добавить();
			ТекущаяСтрока.смартЧернилаКлиента = НоваяСтрока.смартОборудованиеКлиента;
			ТекущаяСтрока.смартДатаДобавления = Дата(ТекущаяДата());
			ТекущаяСтрока.смартКомментарий = НоваяСтрока.смартКомментарий; 
			
			Если НовыеСтроки.Количество() > 0 Тогда
				Элементы.смартЧернилаКлиента.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		Иначе
			Сообщить("Эти чернила уже добавлены");
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 23.04.2020

#КонецОбласти
//--------------конец Чернила клиента------------------------

// Фролов+
&НаСервере
Процедура ЗаполнитьСпискиАдресовДоставки(Партнер,ИмяРеквизита)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Партнер);
	Запрос.Текст="ВЫБРАТЬ
	             |	ПартнерыКонтактнаяИнформация.Представление КАК Адрес
	             |ИЗ
	             |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	             |ГДЕ
	             |	ПартнерыКонтактнаяИнформация.Ссылка = &Ссылка
	             |	И ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Элементы[ИмяРеквизита].СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адрес"));
	Если Элементы[ИмяРеквизита].СписокВыбора.Количество()=1 И Не ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда 
		Объект[ИмяРеквизита]=Элементы[ИмяРеквизита].СписокВыбора[0].Значение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТелефоновКонтактногоЛица(КонтактноеЛицо)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",КонтактноеЛицо);
	Запрос.Текст="ВЫБРАТЬ
	             |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Телефон
	             |ИЗ
	             |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	             |ГДЕ
	             |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	             |	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	Элементы.смартПартнерТелефонКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Телефон"));
	Если Элементы.смартПартнерТелефонКонтактногоЛица.СписокВыбора.Количество()=1 Тогда 
		Объект.смартПартнерТелефонКонтактногоЛица=Элементы.смартПартнерТелефонКонтактногоЛица.СписокВыбора[0].Значение;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЗонуДоставки()
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2 Ссылка ИЗ Справочник.ЗоныДоставки");
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Количество()=1 Тогда
		рез.Следующий();
		Объект.смартПартнерЗонаДоставки=Рез.Ссылка;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура смартПартнерОсобыеУсловияПеревозкиПриИзменении(Элемент)
	Элементы.смартПартнерОсобыеУсловияПеревозкиОписание.Видимость=Объект.смартПартнерОсобыеУсловияПеревозки;
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыОткрытия=Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПартнера"));
	ПараметрыОткрытия.Вставить("Представление",Объект[Элемент.Имя]);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Объект",Объект);
	ДопПараметры.Вставить("ИмяРеквизитаАдреса",Элемент.Имя);
	ДопПараметры.Вставить("Элемент",Элемент);
	
	Оповещение=Новый ОписаниеОповещения("смартПартнерАдресНачалоВыбораЗавершение",ЭтотОбъект,ДопПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерАдресНачалоВыбораЗавершение(Результат,ДопПараметры)Экспорт 
	Если ТипЗнч(Результат)=Тип("Структура") Тогда 
		ДопПараметры.Объект[Доппараметры.ИмяРеквизитаАдреса]=Результат.Представление;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура смартПартнерПеревозчикПартнерПриИзменении(Элемент)
	ЗаполнитьСпискиАдресовДоставки(Объект[Элемент.Имя],Элементы.смартПартнерАдресДоставкиПеревозчика.Имя);
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерКонтактноеЛицоПриИзменении(Элемент)
	ЗаполнитьСписокТелефоновКонтактногоЛица(Объект[Элемент.Имя])
КонецПроцедуры

&НаКлиенте
Процедура смартПартнерКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Фильтр=Новый Структура("Отбор",Новый Структура("Владелец",Объект.Ссылка));
	ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.Форма.ФормаВыбора",Фильтр,Элемент,,,,
				Новый ОписаниеОповещения("ПослеВыбораКонтактногоЛица",ЭтаФорма),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтактногоЛица(ЗначениеВыбора,ДопПараметры)Экспорт 
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда 
		Объект.смартПартнерКонтактноеЛицо=ЗначениеВыбора;
	КонецЕсли;	
КонецПроцедуры	

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин 27.11.2019 17:55:37
&НаКлиенте
Процедура смартВызовКоманды(СсылкаОбъект)
	ПараметрыФормы = Новый Структура("Предмет",СсылкаОбъект);
	ОткрытьФорму("Справочник.Заметки.Форма.ЗаметкиПоПредмету", ПараметрыФормы, ЭтаФорма, Истина, ЭтаФорма.Окно);
КонецПроцедуры

//Смарт }Подкин 27.11.2019 17:55:37

// Фролов-
#КонецОбласти


//++ смарт:ММ #044 224 28.02.2021 - Заявка на гарантийный ремонт 
&НаСервере
Процедура ДобавитьЭлементыПрограммно()
	
	НоваяСтраница = Элементы.Добавить("смартГруппаСервисноеОбслуживаниеКлиента", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	НоваяСтраница.Заголовок = "Сервисное обслуживание клиента (смарт)";
	
	ТекстЗапроса = ПолучитьТекстЗапросаДинамическогоСписка();
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Заявка");
	МассивКолонок.Добавить("Контрагент");
	МассивКолонок.Добавить("Статус");

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Клиент", Объект.Ссылка);
	
	СписокДействий = Новый Структура("Выбор","смартСервисноеОбслуживаниеКлиентаВыбор");
	
	СозданиеДинамическогоСписка("смартСервисноеОбслуживаниеКлиента", ТекстЗапроса, МассивКолонок, СписокДействий,, "смартГруппаСервисноеОбслуживаниеКлиента",,, ПараметрыЗапроса);
	
КонецПроцедуры //-- смарт:ММ 28.02.2021

//++ смарт:ММ #082 397 28.02.2021 Заявка на ремонтные работы
Функция ПолучитьТекстЗапросаДинамическогоСписка()
	
	// ++ 16.03.2021 - функция переделана полностью
	ТекстЗапроса = "";
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	МассивТекстовЗапроса = Новый Массив;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.смартЗаявкаНаГарантийныйРемонт, ТекПользователь) Тогда  
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК Заявка,
		|	смартЗаявкаНаГарантийныйРемонт.Контрагент КАК Контрагент,
		|	смартЗаявкаНаГарантийныйРемонт.Статус КАК Статус
		|ИЗ
		|	Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
		|ГДЕ
		|	смартЗаявкаНаГарантийныйРемонт.Клиент = &Клиент";
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.смартЗаявкаНаПускоНаладку, ТекПользователь) Тогда  
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЗаявкаНаПускоНаладку.Ссылка КАК Заявка,
		|	смартЗаявкаНаПускоНаладку.Контрагент КАК Контрагент,
		|	смартЗаявкаНаПускоНаладку.Статус КАК Статус
		|ИЗ
		|	Документ.смартЗаявкаНаПускоНаладку КАК смартЗаявкаНаПускоНаладку
		|ГДЕ
		|	смартЗаявкаНаПускоНаладку.Партнер = &Клиент";
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.смартЗаявкаНаРемонтныеРаботы, ТекПользователь) Тогда  
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЗаявкаНаРемонтныеРаботы.Ссылка КАК Заявка,
		|	смартЗаявкаНаРемонтныеРаботы.Контрагент КАК Контрагент,
		|	смартЗаявкаНаРемонтныеРаботы.Статус КАК Статус
		|ИЗ
		|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
		|ГДЕ
		|	смартЗаявкаНаРемонтныеРаботы.Партнер = &Клиент";
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстИтог = "";
	
	Если МассивТекстовЗапроса.Количество() = 0 Тогда
		ТекстИтог = 
		"ВЫБРАТЬ
		|	"""" КАК Заявка,
		|	"""" КАК Контрагент,
		|	"""" КАК Статус
		|ГДЕ
		|	ЛОЖЬ
		|	И &Клиент = ЛОЖЬ";
	Иначе
		Для Каждого ТекстЗапроса Из МассивТекстовЗапроса Цикл
			
			Если ТекстИтог = "" Тогда
				ТекстИтог = ТекстЗапроса;
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
				ТекстИтог = ТекстИтог + "
				|ОБЪЕДИНИТЬ ВСЕ
				|" + ТекстЗапроса;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекстИтог;
	
КонецФункции //-- смарт:ММ 28.02.2021

//++ смарт:ММ #082 397 28.02.2021 Заявка на ремонтные работы
&НаСервере
Процедура СозданиеДинамическогоСписка(
	
	ИмяСписка = "Список", 			//тип строка - имя будущего списка на форме и реквизита
	ТекстЗапроса = "", 				//тип строка - запрос, если он не указан, необходимо указать таблицу
	МассивКолонок,                  //тип массив - массив создаваемых колонок, значения тип строка. Пример: "Д,ДоговораКонтрагента" значит будет создана колонка
									//				с заголовком "Д" и колонкой списка "ДоговораКонтрагента". Если указать просто "ДоговораКонтрагента", 
									//				заголовок будет идентичен заголовку по умолчанию типа "Договор контрагента".
	СписокДействий = Неопределено,  //типа структура - структура содержит действия (свойства) динамического списка, можно указать только те которые необходимы.
									//				пример: СписокДействий = Новый Структура("Выбор,ПриАктивизацииСтроки","СписокВыбор","СписокПриАктивизацииСтроки")
	ТаблицаСписка = "",				//тип строка - содержит имя основной таблицы, пример: "Документ.РеализацияТоваровУслуг"	
	ДобавитьВ = "",                 //тип строка - имя элемента на который будет размещен список, если пустое, тогда добавляется на форму
	ВставитьПеред = "",             //тип строка - имя элемента перед которым будет размещен список, если пустое, будет просто добавлен в конец
	СвояКоманднаяПанель = ЛОЖЬ,     //тип булево - если ИСТИНА, скрывает стандартную панель и создает свою пустую для будушего наполнения ИмяСписка+"КоманднаяПанель2"
	ПараметрыЗапроса = Неопределено)//тип структура - содержит перечень параметров, если они используются в запросе.
	
	// ++ 15.03.2021
	УстановитьПривилегированныйРежим(Истина);
	// --
	
	// Защита от дурака
	Если ТекстЗапроса = "" И ТаблицаСписка = "" Тогда Сообщить("Ошибка формирования динамического списка, укажите запрос или таблицу"); Возврат; КонецЕсли;
																									
	// Создаем свою командную панель, тот случай когда я не нашел способа снять галочку "Автозаполнение"
	Если СвояКоманднаяПанель Тогда
		Если ВставитьПеред = "" Тогда
			ГруппаДинамическогоСписка  = Элементы.Добавить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]));
		Иначе
			ГруппаДинамическогоСписка  = Элементы.Вставить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]),ЭтаФорма.Элементы[ВставитьПеред]);			
		КонецЕсли;
		ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДинамическогоСписка.ОтображатьЗаголовок = Ложь;
		ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КоманднаяПанельСписка  = Элементы.Добавить(ИмяСписка + "КоманднаяПанель2",Тип("ГруппаФормы"),ГруппаДинамическогоСписка);
		КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;			
	КонецЕсли;
									
	// Создаем реквизит формы
	ТипыРеквизита = Новый Массив;                             
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита); 
	ДинамическийСписок = Новый РеквизитФормы(ИмяСписка, ОписаниеТиповДляРеквизита,,"",ЛОЖЬ); //Имя реквизита
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);        
	
	// Задаем свойства реквизиту
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
	РеквизитДинамическийСписок = ЭтаФорма[ИмяСписка]; //Имя реквизита
	
	Если ТекстЗапроса = "" Тогда
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ЛОЖЬ;
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
	Иначе
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ИСТИНА;
		РеквизитДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
		РеквизитДинамическийСписок.ДинамическоеСчитываниеДанных = Ложь;
		Если ТаблицаСписка <> "" Тогда РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка; КонецЕсли;		
	КонецЕсли;
	
	// Заполняем параметры, если они были указаны
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметра из ПараметрыЗапроса Цикл
			РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Параметра.Ключ,Параметра.Значение);	
		КонецЦикла;		 
	КонецЕсли;

	// Размещаем реквизит на форме
	Если ЛОЖЬ
		ИЛИ ВставитьПеред = "" 
		ИЛИ СвояКоманднаяПанель // Если своя командная панель, тогда нет логики уже в параметре ВставитьПеред
		Тогда
		ТаблицаФормы = Элементы.Добавить(ИмяСписка,Тип("ТаблицаФормы"),?(СвояКоманднаяПанель,ГруппаДинамическогоСписка,?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ])));
	Иначе
		ТаблицаФормы = Элементы.Вставить(ИмяСписка,Тип("ТаблицаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]),ЭтаФорма.Элементы[ВставитьПеред]);	
	КонецЕсли;		
	ТаблицаФормы.ПутьКДанным = ИмяСписка; //Имя реквизита 
	
	// Если своя панель, тогда скрываем стандартную
	//Если СвояКоманднаяПанель Тогда
		Элементы[ИмяСписка].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	//КонецЕсли;

	// Создание колонок на основание МассивКолонок
	Для Каждого Элемента Из МассивКолонок Цикл
		ПараметрыКолонки = СтрЗаменить(Элемента,",",Символы.ПС);
		Если СтрЧислоСтрок(ПараметрыКолонки) > 1 Тогда
			Заголовок = СтрПолучитьСтроку(ПараметрыКолонки, 1);
			ИмяКолонки = СтрПолучитьСтроку(ПараметрыКолонки, 2);
		Иначе
			Заголовок = "";
			ИмяКолонки = ПараметрыКолонки; 
		КонецЕсли;	
		НоваяКолонкаТаблицы = Элементы.Добавить(ИмяСписка + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		Если Заголовок <> "" Тогда НоваяКолонкаТаблицы.Заголовок = Заголовок; КонецЕсли;
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСписка + "." + ИмяКолонки; 	
	КонецЦикла;
	
	// Задаем действия (События) на основание СписокДействий, если он определен
	Если СписокДействий <> Неопределено Тогда 	
		ПереченьСвойств = "ПриИзменении
						|Выбор
						|ПриАктивизацииСтроки
						|ВыборЗначения
						|ПриАктивизацииПоля
						|ПриАктивизацииЯчейки
						|ПередНачаломДобавления
						|ПередНачаломИзменения
						|ПередУдалением
						|ПриНачалеРедактирования
						|ПередОкончаниемРедактирования
						|ПриОкончанииРедактирования
						|ОбработкаВыбора
						|ПередРазворачиванием
						|ПередСворачиванием
						|ПослеУдаления
						|ПриСменеТекущегоРодителя
						|ОбработкаЗаписиНового
						|ПриСохраненииПользовательскихНастроекНаСервере
						|ПередЗагрузкойПользовательскихНастроекНаСервере
						|ПриЗагрузкеПользовательскихНастроекНаСервере
						|ПриОбновленииСоставаПользовательскихНастроекНаСервере
						|ОбработкаЗапросаОбновления
						|ПриПолученииДанныхНаСервере
						|НачалоПеретаскивания
						|ПроверкаПеретаскивания
						|ОкончаниеПеретаскивания
						|Перетаскивание";
		Для Счетчик = 1 по 28 Цикл
			ИмяСвойства = СтрПолучитьСтроку(ПереченьСвойств, Счетчик);
			Элементы[ИмяСписка].УстановитьДействие(ИмяСвойства,?(СписокДействий.Свойство(ИмяСвойства),СписокДействий[ИмяСвойства],""));
		КонецЦикла;
	КонецЕсли;	

	// ++ 15.03.2021
	УстановитьПривилегированныйРежим(Ложь);
	// --

КонецПроцедуры //-- смарт:ММ 28.02.2021

//++ смарт:ММ #082 397 01.03.2021 Заявка на ремонтные работы
&НаКлиенте
Процедура смартСервисноеОбслуживаниеКлиентаВыбор(ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.смартСервисноеОбслуживаниеКлиента.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Заявка);
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 01.03.2021


