
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ОборудованиеКлиентов") Тогда
		Запись.ОборудованиеКлиентов= ЭтаФорма.Параметры.ЗначенияЗаполнения.ОборудованиеКлиентов;
		Элементы.ОборудованиеКлиентов.ТолькоПросмотр=Истина;
	ИначеЕсли ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") Тогда	
		Запись.Номенклатура= ЭтаФорма.Параметры.ЗначенияЗаполнения.Номенклатура;		
		Элементы.Номенклатура.ТолькоПросмотр=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСТоваромПриИзменении(Элемент)
	Если Запись.СопоставлениеСТоваром Тогда
		Запись.Количество=0;
		Запись.МотоРесурс=0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМоторесурсПриИзменении(Элемент)
	Если Запись.Количество>0 ИЛИ Запись.МотоРесурс>0 Тогда
		Запись.СопоставлениеСТоваром=Ложь;	
	КонецЕсли;	
КонецПроцедуры
