
#Область ПеренесеноСДоработкамиСмарт
//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С  
&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ)
	Если ЭтаФорма.ВладелецФормы.ИмяФормы="ОбщаяФорма.смартЗаданиеНаПодготовкуПроектаДоговораПоставки" ТОгда
		Элементы.ПорядокРасчетов.ТолькоПросмотр=Истина;
		Элементы.ФормаОплаты.ТолькоПросмотр=Истина;
		Элементы.ПорядокОплаты.ТолькоПросмотр=Истина;
		Элементы.Касса.ТолькоПросмотр=Истина;
		Элементы.БанковскийСчет.ТолькоПросмотр=Истина;
	КонецЕсли;	
КонецПроцедуры//-- #1334 смарт: Фролов 03.04.2023     

//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартИмеетНегативнуюИсторию", Новый ОписаниеТипов("Булево"));
	Если Параметры.Свойство("СостояниеПоТехническойОтсрочке") Тогда
		
		Если Параметры.СостояниеПоТехническойОтсрочке.ПродажаОтгрузкаЗапрещена
		И Параметры.Свойство("Дата") 
		И Параметры.Дата > Параметры.СостояниеПоТехническойОтсрочке.ДатаЗапрета Тогда 
		
			Элементы.ЭтапыОплатыВариантОплаты.РежимВыбораИзСписка = Истина;
			ЗаполнитьСписокВыбораВариантовОплаты(Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки); 
		КонецЕсли; 
		
		
		ЭтаФорма["смартИмеетНегативнуюИсторию"] = Параметры.СостояниеПоТехническойОтсрочке.ИмеетНегативнуюИсторию;
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокВыбораВариантовОплаты(ЗначениеПоУмолчанию)
	
	ОтборПоСсылке = Новый Массив;
	ОтборПоСсылке.Добавить(ЗначениеПоУмолчанию); 
	
	Для Каждого СтрокаЭтапыГрафикаОплаты Из ЭтапыГрафикаОплаты Цикл
		ОтборПоСсылке.Добавить(СтрокаЭтапыГрафикаОплаты.ВариантОплаты);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВариантыОплатыКлиентом.Ссылка
	|ИЗ
	|	Перечисление.ВариантыОплатыКлиентом КАК ВариантыОплатыКлиентом";
	
	Если ОтборПоСсылке <> Неопределено Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("Ссылка В(&ОтборПоСсылке)");
		Запрос.УстановитьПараметр("ОтборПоСсылке", ОтборПоСсылке);
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Иначе
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;
		
	Выборка      = Запрос.Выполнить().Выбрать();
	СписокВыбора = Элементы.ЭтапыОплатыВариантОплаты.СписокВыбора;
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЭтапыОплатыВариантОплатыПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если ЭтаФорма["смартИмеетНегативнуюИсторию"]
			И ТекущиеДанные.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки") Тогда
			ИндексТекущейСтроки = ЭтапыГрафикаОплаты.Индекс(ТекущиеДанные);
			
			ТекстПредупреждения = "Для данного клиента установка вида оплаты ""Кредит (плановый)"" запрещена в связи с негативной кредитной историей. Доступна только предоплата.";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения, , "ЭтапыГрафикаОплаты[" + ИндексТекущейСтроки + "].ВариантОплаты");
			//ТекущиеДанные.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПустаяСсылка");
			
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры

//-- #4792 смарт: Тимофеева 17.03.26

#КонецОбласти
			  
