
/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смарт_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	//++ #5196 смарт: Тимофеева 16.12.2025 / Автозаказ. Дополнительные требования.
	НоваяКолонка = Элементы.Добавить("ЗапасысмартДинамикаПродаж", Тип("ПолеФормы"), Элементы.Запасы);
	НоваяКолонка.Заголовок = "Динамика продаж";
	НоваяКолонка.ПутьКДанным = "Объект.Запасы.смартДинамикаПродаж";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Ширина = 5;   
	
	НоваяГруппаКолонок = Элементы.Добавить("ЗапасыГруппаABCXYZ", Тип("ГруппаФормы"), Элементы.Запасы);
	НоваяГруппаКолонок.ОтображатьВШапке	= Ложь;
	НоваяГруппаКолонок.Группировка	= ГруппировкаКолонок.Горизонтальная; 
		
	НоваяКолонка = Элементы.Добавить("ЗапасысмартABCКласс", Тип("ПолеФормы"), НоваяГруппаКолонок);
	НоваяКолонка.Заголовок = "ABC";
	НоваяКолонка.ПутьКДанным = "Объект.Запасы.смартABCКласс";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Ширина = 1; 
	
	НоваяКолонка = Элементы.Добавить("ЗапасысмартXYZКласс", Тип("ПолеФормы"), НоваяГруппаКолонок);
	НоваяКолонка.Заголовок = "XYZ";
	НоваяКолонка.ПутьКДанным = "Объект.Запасы.смартXYZКласс";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Ширина = 1; 

	//-- #5196 смарт: Тимофеева 16.12.2025
КонецПроцедуры

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

#Область ОбработчикиКомандФормы

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
&ИзменениеИКонтроль("ЗапасыПриАктивизацииСтрокиОбработчикОжидания")
Процедура смарт_ЗапасыПриАктивизацииСтрокиОбработчикОжидания()

	Строка = Элементы.Запасы.ТекущиеДанные;

	Если Строка = Неопределено Тогда

		Элементы.ПанельРекомендаций.ТекущаяСтраница = Элементы.СтраницаНеВыделенаСтрока;

	Иначе

		СтрокаФормата = "ЧДЦ=3; ЧН=0.000";
		ЕдиницаИЗмерения = Строка.ЕдиницаИзмерения;

		#Удаление
		Остаток = НадписьВФормате(Строка.Остаток, ЕдиницаИзмерения, СтрокаФормата);
		#КонецУдаления
		#Вставка
		Если Строка.МетодОбеспечения = ПредопределенноеЗначение("Перечисление.МетодыОбеспеченияПотребностей.смартПоддержаниеЗапасаНаСрокПоСтатистике") Тогда
			Остаток = СтрШаблон("%1 (в т.ч. опл. резерв %2)", 
							НадписьВФормате(Строка.Остаток + Строка.РезервыНаСкладе, ЕдиницаИзмерения, СтрокаФормата), 
							НадписьВФормате(Строка.РезервыНаСкладе, ЕдиницаИзмерения, СтрокаФормата)); 
		Иначе
			Остаток = НадписьВФормате(Строка.Остаток, ЕдиницаИзмерения, СтрокаФормата);
		КонецЕсли;					
		#КонецВставки
		ЗаказыКПоступлению = НадписьВФормате(Строка.ЗаказыКПоступлению,   ЕдиницаИзмерения, СтрокаФормата);
		МинимальныйЗапас   = НадписьВФормате(Строка.МинимальныйЗапас,     ЕдиницаИзмерения, СтрокаФормата);
		МаксимальныйЗапас  = НадписьВФормате(Строка.МаксимальныйЗапас,    ЕдиницаИзмерения, СтрокаФормата);
		СтраховойЗапас     = НадписьВФормате(Строка.СтраховойЗапас,       ЕдиницаИзмерения, СтрокаФормата);
		ДоТочкиЗаказа      = НадписьВФормате(Строка.ДоТочкиЗаказа,        ЕдиницаИзмерения, СтрокаФормата);
		КоличествоКЗаказуНадпись  = НадписьВФормате(Строка.КЗаказуРекомендуется, ЕдиницаИзмерения, СтрокаФормата);
		СреднедневноеПотребление = НадписьВФормате(Строка.СреднедневноеПотребление, ЕдиницаИзмерения, СтрокаФормата);

		СтрокаФормата = "ДЛФ=D";

		ДатаЗаказаСтроки = ?(ЗначениеЗаполнено(Строка.ДатаЗаказа), Строка.ДатаЗаказа, "");

		ДатаЗаказа = НадписьВФормате(ДатаЗаказаСтроки, "", СтрокаФормата);

		Если Не ЗначениеЗаполнено(Строка.ДатаЗаказа) Тогда
			ДатаЗаказаНаступила = НСтр("ru = 'Не заполнена дата поставки'");
		Иначе
			ДатаЗаказаНаступила = НСтр("ru = 'Дата заказа наступила'");
		КонецЕсли;

		КоличествоДней = (Строка.ДатаЗаказа - НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса())) / 86400;
		ДоДатыЗаказаДней = СтрШаблон(НСтр("ru = 'До даты заказа %1 дн.'"), Формат(КоличествоДней, "ЧДЦ="));

		НадписьДн = НСтр("ru = 'дн'");
		Если Строка.ФормироватьПлановыеЗаказы И КоличествоДней <= 0 Тогда

			ДатаБлижайшейПоставкиПоГрафику = НадписьВФормате(Строка.ДатаБлижайшейПоставкиПоГрафику, "", СтрокаФормата);
			ДатаСледующейПоставкиПоГрафику = НадписьВФормате(Строка.ДатаСледующейПоставкиПоГрафику, "", СтрокаФормата);
			ОбеспечиваемыйПериод = СтрШаблон("%1-%2", ДатаБлижайшейПоставкиПоГрафику, ДатаСледующейПоставкиПоГрафику);

			СрокПоставки = НадписьВФормате(Строка.СрокДоПлановойПоставки, НадписьДн, "");

		ИначеЕсли Строка.ФормироватьПлановыеЗаказы Тогда

			СрокПоставки = НадписьВФормате(Строка.СрокПоставки, НадписьДн, "");
			ОбеспечиваемыйПериод = НСтр("ru = 'не известен'");

		Иначе

			СрокПоставки = НадписьВФормате(Строка.СрокПоставки, НадписьДн, "");
			ОбеспечиваемыйПериод = НадписьВФормате(Строка.ОбеспечиваемыйПериод, НадписьДн, "");

		КонецЕсли;

		МетодМинМакс = Строка.МетодОбеспечения
		= ПредопределенноеЗначение("Перечисление.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаМинМакс");

		ЭтоДатаЗаказа = Ложь;
		Если Строка.ФормироватьПлановыеЗаказы И КоличествоДней <= 0 Тогда

			Если Строка.СтраховойЗапас = 0 Или Строка.ДоТочкиЗаказа > 0 Тогда
				ТекстРекомендации = НСтр("ru = 'Заказать количество для пополнения до максимального запаса.'");
			Иначе
				ТекстРекомендации = НСтр("ru = 'Заказать количество для пополнения до максимального запаса, пополнить страховой запас (при необходимости).'");
			КонецЕсли;

			ЭтоТочкаЗаказа = Строка.ДоТочкиЗаказа <= 0;
			ЭтоДатаЗаказа  = Истина;
			Заказать       = Истина;

		ИначеЕсли Строка.ФормироватьПлановыеЗаказы И Строка.ДоТочкиЗаказа > 0 Тогда

			ТекстРекомендации = НСтр("ru = 'Не заказывать товар. Ожидать наступления даты заказа по графику.'");
			ЭтоТочкаЗаказа = Ложь;
			Заказать       = Ложь;

		ИначеЕсли Не Строка.ФормироватьПлановыеЗаказы И Строка.ДоТочкиЗаказа > 0 Тогда

			ТекстРекомендации = НСтр("ru = 'Не заказывать товар. Ожидать наступления точки заказа.'");
			ЭтоТочкаЗаказа = Ложь;
			Заказать       = Ложь;

			// Точка заказа наступила
		ИначеЕсли Строка.ФормироватьПлановыеЗаказы И Не МетодМинМакс Тогда

			Если Строка.СтраховойЗапас = 0 Или Строка.ДоТочкиЗаказа > 0 Тогда
				ТекстРекомендации = НСтр("ru = 'Остаток товара на складе достиг минимального запаса. Необходимо пополнить запас до максимального.'");
			Иначе
				ТекстРекомендации = НСтр("ru = 'Остаток товара на складе достиг минимального запаса. Необходимо пополнить запас до максимального, пополнить страховой запас (при необходимости).'");
			КонецЕсли;


			ЭтоТочкаЗаказа = Истина;
			Заказать       = Ложь;

		ИначеЕсли Строка.ЗаказыКПоступлению = 0 Тогда

			Если МетодМинМакс Тогда
				ТекстРекомендации = НСтр("ru = 'Заказать количество, равное максимальному запасу.'");
			ИначеЕсли Строка.СтраховойЗапас = 0 Тогда
				ТекстРекомендации = НСтр("ru = 'Заказать количество, равное максимальному запасу за вычетом страхового запаса.'");
			Иначе
				ТекстРекомендации = НСтр("ru = 'Заказать количество, равное максимальному запасу за вычетом страхового запаса, пополнить страховой запас (при необходимости).'");
			КонецЕсли;

			ЭтоТочкаЗаказа = Истина;
			Заказать       = Истина;

		ИначеЕсли Строка.ЗаказыКПоступлению < Строка.МаксимальныйЗапас Тогда

			Если МетодМинМакс Тогда
				ТекстРекомендации = НСтр("ru = 'Заказать количество, равное максимальному запасу за вычетом заказанного ранее.'");
			ИначеЕсли Строка.СтраховойЗапас = 0 Тогда
				ТекстРекомендации = НСтр("ru = 'Заказать количество, равное максимальному запасу за вычетом страхового запаса и за вычетом заказанного ранее.'");
			Иначе
				ТекстРекомендации = НСтр("ru = 'Заказать количество, равное максимальному запасу, за вычетом страхового запаса и за вычетом заказанного ранее, пополнить страховой запас (при необходимости).'");
			КонецЕсли;

			ЭтоТочкаЗаказа = Истина;
			Заказать       = Истина;

		Иначе

			ТекстРекомендации = НСтр("ru = 'Не заказывать товар. Необходимые заказы сформированы ранее.'");
			ЭтоТочкаЗаказа = Истина;
			Заказать       = Ложь;

		КонецЕсли;

		ПереключитьСтраницыПанелиРекомендацийЗапасы(
		Строка.МетодОбеспечения, Строка.ФормироватьПлановыеЗаказы, ЭтоТочкаЗаказа, ЭтоДатаЗаказа, Заказать);

	КонецЕсли;

	ОтобразитьРасчитанноеОкругление(Строка, Истина);

КонецПроцедуры 

&НаСервере
&ИзменениеИКонтроль("ФормированиеЗаказовВФоне")
Функция смарт_ФормированиеЗаказовВФоне()

	СекцииДляВыгрузки = "СвойстваПотребности, РеквизитыОбеспечивающегоЗаказа, РеквизитыЗаказаКОбеспечению";
	Поля = Обработки.ОбеспечениеПотребностей.ПоляТаблицыЗаказы(СекцииДляВыгрузки);
	Поля.Вставить("ЧислительУпаковки", Новый ОписаниеТипов("Число"));
	Поля.Вставить("ЗнаменательУпаковки", Новый ОписаниеТипов("Число"));
	Поля.Вставить("ТипЕдиницыИзмерения", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыИзмеряемыхВеличин"));
	Поля.Вставить("Отметка", Новый ОписаниеТипов("Булево"));
	#Вставка     
	Поля.Вставить("ЦенаВВалютеСоглашения", Новый ОписаниеТипов("Число"));
	#КонецВставки

	ТаблицаПотребностей = ОбеспечениеСервер.ТаблицаПоОписаниюПолей(Поля);
	ВыгрузитьОтмеченныеКЗаказу(ТаблицаПотребностей, "ЗаказыКОбеспечению");
	ВыгрузитьОтмеченныеКЗаказу(ТаблицаПотребностей, "Запасы");

	ТаблицаДокументов = ТаблицаДокументы.Выгрузить(Новый Массив);
	АдресРезультатаФормированияЗаказов = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТаблицаПотребностей", ТаблицаПотребностей);
	ПараметрыПроцедуры.Вставить("ИспользоватьУпаковки", ИспользоватьУпаковки);
	ПараметрыПроцедуры.Вставить("АдресРезультатаФормированияЗаказов", АдресРезультатаФормированияЗаказов);
	ПараметрыПроцедуры.Вставить("ТаблицаДокументов", ТаблицаДокументов);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заказов: создание документов'");

	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ОбеспечениеПотребностей.СформироватьЗаказы",
	ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура смарт_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Нет доступа к заказу
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Нет доступа к заказу'");

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Заказ.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.Заказ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<нет доступа к данным заказа>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Гиперссылка метод обеспечения потребностей
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Гиперссылка метод обеспечения'");

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МетодОбеспечения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.МетодОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГиперссылки);

	// Документ имеет высокий приоритет
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Документ имеет высокий приоритет'");

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыКОбеспечению.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.Приоритет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьВысшийПриоритет();

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ВысокийПриоритетДокумента);

	// Документ имеет низкий приоритет
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Документ имеет низкий приоритет'");

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыКОбеспечению.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.Приоритет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьНизшийПриоритет();

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НизкийПриоритетДокумента);

	// Текст поля "Способ обеспечения" для номенклатуры, обеспечиваемой без указания способа.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияСпособОбеспечения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.СпособОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<обеспечение без указания способа>'"));

	// Выделение цветом ошибки в поле "Дней до планового заказа" когда просрочена дата заказа по плану, нет плановой даты
	// поставки либо незаполнен календарь.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияДнейДоЗаказаПоГрафикуПредставление.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.ДнейДоПлановогоЗаказа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.НетПлановойДатыЗаказаПоКалендарю");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.НетГрафикаПоставок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);

	// Недоступность поля "Дней до планового заказа" для способа с заказом по точке заказа.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияДнейДоЗаказаПоГрафикуПредставление.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.ФормироватьПлановыеЗаказы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<только для поставок по графику>'"));

	// Текст ошибки в поле "Дата поставки" при незаполненном календаре

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияДатаПоставки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.НетДатыПоставкиПоКалендарю");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не заполнен график работы предприятия>'"));

	// Отметка незаполненного в поле "Дата следующей поставки" в режиме "Все, плановое формирование заказа".

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияДатаСледующейПоставки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.НаступилаДатаОчередногоЗаказа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.ДатаСледующейПоставки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	// Отмена отметки незаполненного в поле "Дата следующей поставки"

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияДатаСледующейПоставки.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.НаступилаДатаОчередногоЗаказа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.ДатаСледующейПоставки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// Текст поля "Дата следующей поставки" при заказе товаров, достигших точки заказа

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СпособыОбеспеченияДатаСледующейПоставки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СпособыОбеспечения.НаступилаДатаОчередногоЗаказа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<только при плановом формировании заказа>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Не отображать поля соглашений на первом уровне группировки корзины заказов

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоглашениеСПоставщиком.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаПоступленияПоЗаказу.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВалютаСоглашения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СуммаВВалютеСоглашения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыСпособПополненияЗапаса.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

	// Не отображать источник пополнения запасов на первом уровне группировки корзины заказов.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыИсточникПополненияЗапаса.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

	// Первый уровень группировки в корзине заказов жирный

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыКОформлению.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.DefaultGUIFont, , , Истина, Ложь, Ложь, Ложь, ));

	// Текст "не указан поставщик" в поле Источник обеспечения в корзине заказов

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыИсточникПополненияЗапаса.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ИсточникОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТекстНеЗаполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.Покупка;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.SpecialTextColor);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не указан поставщик>'"));

	// Текст "не указан обеспечивающий склад" в поле Источник обеспечения в корзине заказов.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыИсточникПополненияЗапаса.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ИсточникОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТекстНеЗаполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.Перемещение;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.SpecialTextColor);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не указан обеспечивающий склад>'"));

	// Текст "производство" в поле Источник обеспечения в корзине заказов

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыИсточникПополненияЗапаса.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ИсточникОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТекстНеЗаполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.Производство;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<производство>'"));

	// Текст "производство силами переработчика" в поле Источник обеспечения в корзине заказов.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыИсточникПополненияЗапаса.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ИсточникОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТекстНеЗаполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.ПроизводствоНаСтороне;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<производство силами переработчика>'"));

	// Текст "сборка" в поле Источник обеспечения в корзине заказов

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыИсточникПополненияЗапаса.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ИсточникОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТекстНеЗаполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.УровеньВДереве");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.СборкаРазборка;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<сборка>'"));

	// Если статуса созданного заказа нет, то надпись не проведен.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументы.СтандартнаяКартинка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.SpecialTextColor);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не проведен>'"));

	// Оформление цветом отрицательного остатка

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СуммаВВалютеСоглашения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорзинаЗаказов.ВалютаСоглашения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);

	// Выделение цветом отрицательного остатка на складе

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Остаток.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.Остаток");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);

	// Текст <сборка> в источнике обеспечения

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИсточникОбеспеченияЗаказы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.СборкаРазборка;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<сборка>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИсточникОбеспеченияЗапасы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.ТипОбеспечения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбеспечения.СборкаРазборка;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<сборка>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Недоступность источника обеспечения, если он задан в способе обеспечения

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИсточникОбеспеченияЗапасы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.ИсточникОбеспеченияТолькоПросмотр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИсточникОбеспеченияЗаказы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.ИсточникОбеспеченияТолькоПросмотр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Текст "<не используется>" в поле Склад отгрузки заказа

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СкладОтгрузкиЗаказа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));

	// Текст "<не используется>" в поле Статус

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументы.ИспользованиеСтатусов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));

	// Просроченная дата отгрузки потребности по заказу
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаОтгрузки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.ДатаОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказыКОбеспечению.ДатаПоставки");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	#Вставка 
	//++ #5196 смарт: Тимофеева 16.12.2025 / Автозаказ. Дополнительные требования.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартДинамикаПродаж.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартДинамикаПродаж");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартДинамикаПродаж.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартДинамикаПродаж");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоложительногоЗначения);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	
	// Оформление классов ABC,XYZ
	//AКласс
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартABCКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартABCКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ABCКлассификация.AКласс;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоложительногоЗначения);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	
	//BКласс
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартABCКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартABCКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ABCКлассификация.BКласс;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветАктивности);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//CКласс
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартABCКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартABCКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ABCКлассификация.CКласс;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  
	
	//НеКлассифицирован
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартABCКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартABCКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ABCКлассификация.НеКлассифицирован;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//XКласс
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартXYZКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартXYZКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.XYZКлассификация.XКласс;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоложительногоЗначения);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	
	//YКласс
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартXYZКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартXYZКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.XYZКлассификация.YКласс;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветАктивности);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//ZКласс
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартXYZКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартXYZКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.XYZКлассификация.ZКласс;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  
	
	//НеКлассифицирован
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапасысмартXYZКласс.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.смартXYZКласс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.XYZКлассификация.НеКлассифицирован;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//-- #5196 смарт: Тимофеева 16.12.2025
	#КонецВставки
КонецПроцедуры

#КонецОбласти

#Область Удалено

//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета 

//&НаКлиенте
//&Перед("ПолучениеТаблицыЗапасовВФонеЗавершение")
//Процедура смарт_ПолучениеТаблицыЗапасовВФонеЗавершение(Результат, ДополнительныеПараметры)
//	//смарт+ Вахов Владимир /491 / 23.04.2021   
//	
//	Если Результат = Неопределено Тогда
//	ИначеЕсли Результат.Статус = "Ошибка" Тогда
//	Иначе
//		смартДополняемТаблицуЗапасы(Результат);
//		
//	КонецЕсли;	
//	
//КонецПроцедуры

//&НаСервере
//Процедура смартДополняемТаблицуЗапасы(Результат)
//	//смарт+ Вахов Владимир /491 / 23.04.2021  
//	СписокСкладов = ЭтаФорма.СуммирующиесяСклады.ВыгрузитьЗначения();
//	
//	Таблица = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
//	
//	Если СписокСкладов.Количество() > 0 Тогда
//		
//	Обработки.ОбеспечениеПотребностей.смартСуммироватьСкладыПоТаблице(СписокСкладов, Таблица, ОтборПоТипуОбеспечения);	
//		
//		
//	КонецЕсли;
//	
//	//Меняем цены в зависимости от соглашения. Если импорт то проверяем ндс цены и уменьшаем на ставку ндс
//	НаборХозОперацийБезНДС = Новый Массив;
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);  
//	НаборХозОперацийБезНДС.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути);  
//	
//	Для Каждого СтрокаТЗ Из Таблица Цикл
//		
//		Если СтрокаТЗ.Соглашение = NULL Тогда Продолжить; КонецЕсли;
//		
//		Если НаборХозОперацийБезНДС.Найти(СтрокаТЗ.Соглашение.ХозяйственнаяОперация) <> Неопределено Тогда
//			
//			СтрокаНоменклатураНДС = СтрокаТЗ.Номенклатура.СтавкаНДС;
//			
//			Если СтрокаНоменклатураНДС = Перечисления.СтавкиНДС.НДС10 Тогда
//				КоэфициентУменьшения = 1.1;
//			ИначеЕсли СтрокаНоменклатураНДС = Перечисления.СтавкиНДС.НДС18 Тогда
//				КоэфициентУменьшения = 1.18;
//			ИначеЕсли СтрокаНоменклатураНДС = Перечисления.СтавкиНДС.НДС20 Тогда
//				КоэфициентУменьшения = 1.2;
//			Иначе
//				КоэфициентУменьшения = 1;
//			КонецЕсли;	
//			
//			ЦенаВВалютеУправленческогоУчета	= СтрокаТЗ.ЦенаВВалютеУправленческогоУчета;
//			ЦенаВВалютеСоглашения	= СтрокаТЗ.ЦенаВВалютеСоглашения;
//			СтрокаТЗ.ЦенаВВалютеУправленческогоУчета = ?(ЗначениеЗаполнено(ЦенаВВалютеУправленческогоУчета), ЦенаВВалютеУправленческогоУчета / КоэфициентУменьшения, ЦенаВВалютеУправленческогоУчета);
//			СтрокаТЗ.ЦенаВВалютеСоглашения = ?(ЗначениеЗаполнено(ЦенаВВалютеСоглашения), ЦенаВВалютеСоглашения / КоэфициентУменьшения, ЦенаВВалютеСоглашения);
//			
//		КонецЕсли;	
//		
//		
//	КонецЦикла;	  
//	
//	
//	ПоместитьВоВременноеХранилище(Таблица, Результат.АдресРезультата);
//	
//КонецПроцедуры	

//&НаСервере
//&После("ПриСозданииНаСервере")
//Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	//смарт+ Вахов Владимир /491 / 23.04.2021   
//	
//	Если Этаформа.Элементы.Найти("СуммирующиесяСклады") = Неопределено Тогда
//		
//		ДобавляемыеРеквизиты	= Новый Массив;
//		
//		Реквизит_СуммирующиесяСклады = Новый РеквизитФормы("СуммирующиесяСклады", Новый ОписаниеТипов("СписокЗначений"),	, "Суммирующиеся склады");
//		ДобавляемыеРеквизиты.Добавить(Реквизит_СуммирующиесяСклады);
//		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
//		ЭтаФорма.СуммирующиесяСклады.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Склады");
//		
//		НовыйЭлемент = Этаформа.Элементы.Вставить("СуммирующиесяСклады",Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаПараметрыОбеспеченияПотребностей);
//		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//		НовыйЭлемент.ПутьКДанным = "СуммирующиесяСклады";
//		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
//		
//		УстановитьПривилегированныйРежим(Истина);		
//		СписокСкладов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ОбработкаОбеспечениеПотребностей", "СписокСуммирующихсяСкладов",,,"Администратор");
//		УстановитьПривилегированныйРежим(Ложь);		

//		Если  ТипЗнч(СписокСкладов) = Тип("Массив") Тогда
//			ЭтаФорма.СуммирующиесяСклады.ЗагрузитьЗначения(СписокСкладов);
//		КонецЕсли;	
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//&После("ПередЗакрытием")
//Процедура смарт_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
//	//смарт+ Вахов Владимир /491 / 23.04.2021   
//	
//	Если Этаформа.Элементы.Найти("СуммирующиесяСклады") <> Неопределено Тогда
//		смартСохранитьНастройкиСкладов(ЭтаФорма.СуммирующиесяСклады);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура смартСохранитьНастройкиСкладов(СуммирующиесяСклады)
//	//смарт+ Вахов Владимир /491 / 23.04.2021  
//	УстановитьПривилегированныйРежим(Истина);		
//	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ОбработкаОбеспечениеПотребностей", "СписокСуммирующихсяСкладов", СуммирующиесяСклады.ВыгрузитьЗначения(),,"Администратор");
//	УстановитьПривилегированныйРежим(Ложь);		
//	
//КонецПроцедуры	

//-- #4314 смарт: Тимофеева 10.09.2025
#КонецОбласти

