Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат ДЛ_ДеловыеЛинии.МассивДвухЭлементов("uid", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = ДЛ_ДеловыеЛинии.НоваяТаблицаПолейЗначений();
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Наименование", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "title", "ПолноеНаименование", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "countryUID", "СтранаUID", "Реквизит");	
	
	Возврат Результат;
	
КонецФункции