#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;
	КонецЕсли;
	
	Если Параметры.Свойство("Предзаказ") Тогда
		Предзаказ = Параметры.Предзаказ;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеДокумента") Тогда
		
		Для каждого стрДанныеДокумента Из Параметры.ДанныеДокумента Цикл
			
			НоваяСтрока = ПодобраноВПредзаказ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрДанныеДокумента);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьОстаткиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(СформироватьДанныеДляВозврата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	ОбновитьОстаткиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ОбновитьОстаткиСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Предзаказ", Предзаказ);
	Запрос.УстановитьПараметр("ТЗ", ПодобраноВПредзаказ.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Назначение КАК Назначение,
	|	Т.Количество КАК Количество
	|ПОМЕСТИТЬ ВТУжеПодобрано
	|ИЗ
	|	&ТЗ КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.КЗаказуОстаток + Остатки.смартКЗаказуГарантийныеОстаток КАК КЗаказуОстаток
	|ПОМЕСТИТЬ ВТОстаткиДляЗаказа
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов.Остатки КАК Остатки
	|ГДЕ
	|	Остатки.Назначение.Заказ ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|	И НЕ Остатки.Назначение.Заказ = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка)
	|	И Остатки.Назначение.смартРазобранноеОборудованиеТипНазначения = ЗНАЧЕНИЕ(Перечисление.смартТипыНазначенийРазобранногоОборудования.НаЗаменуСнятойЗапаснойЧасти)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартПредзаказыПоставщикамОбороты.Номенклатура КАК Номенклатура,
	|	смартПредзаказыПоставщикамОбороты.Характеристика КАК Характеристика,
	|	смартПредзаказыПоставщикамОбороты.ПредзаказПоставщику КАК ПредзаказПоставщику,
	|	смартПредзаказыПоставщикамОбороты.Назначение КАК Назначение,
	|	смартПредзаказыПоставщикамОбороты.ЗаказаноПриход КАК КоличествоЗаказано
	|ПОМЕСТИТЬ ВТУжеЗаказано
	|ИЗ
	|	РегистрНакопления.смартПредзаказыПоставщикам.Обороты(
	|			,
	|			,
	|			,
	|			(Номенклатура, Характеристика, Назначение) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						Т.Назначение
	|					ИЗ
	|						ВТОстаткиДляЗаказа КАК Т)
	|				И НЕ ПредзаказПоставщику = &Предзаказ) КАК смартПредзаказыПоставщикамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Характеристика КАК Характеристика,
	|	Данные.Назначение КАК Назначение,
	|	СУММА(Данные.Количество) КАК Количество,
	|	Данные.Назначение.Заказ КАК ЗаявкаНаРазборкуОборудования
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТОстаткиДляЗаказа.Номенклатура КАК Номенклатура,
	|		ВТОстаткиДляЗаказа.Характеристика КАК Характеристика,
	|		ВТОстаткиДляЗаказа.Назначение КАК Назначение,
	|		ВТОстаткиДляЗаказа.КЗаказуОстаток КАК Количество
	|	ИЗ
	|		ВТОстаткиДляЗаказа КАК ВТОстаткиДляЗаказа
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТУжеЗаказано.Номенклатура,
	|		ВТУжеЗаказано.Характеристика,
	|		ВТУжеЗаказано.Назначение,
	|		-ВТУжеЗаказано.КоличествоЗаказано
	|	ИЗ
	|		ВТУжеЗаказано КАК ВТУжеЗаказано
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТУжеПодобрано.Номенклатура,
	|		ВТУжеПодобрано.Характеристика,
	|		ВТУжеПодобрано.Назначение,
	|		-ВТУжеПодобрано.Количество
	|	ИЗ
	|		ВТУжеПодобрано КАК ВТУжеПодобрано) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Номенклатура,
	|	Данные.Характеристика,
	|	Данные.Назначение,
	|	Данные.Назначение.Заказ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Данные.Количество) > 0";
	
	ДанныеДляПодбора.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция СформироватьДанныеДляВозврата()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеДляПодбора.Выгрузить(Новый Структура("Заказать", Истина)));
	
КонецФункции

#КонецОбласти