
#Область ПеренесеноСДоработками

// Фролов+
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.смартСоздатьОрдер.Видимость=РольДоступна("СборкаЗаказовНаСкладе") Или РольДоступна("ПолныеПрава");
	
	//++ смарт:ММ #017 173 08.02.2020 Этикетка доставки
	смартДобавитьЭлементыНаФорму();
	//-- смарт:ММ 08.02.2020
	
	//++ смарт:ММ 572 21.07.2021
	смартНастроитьВидимостьРеестрОтгрузок();
	//-- смарт:ММ 21.07.2021
	
КонецПроцедуры

&НаКлиенте
&Вместо("ОбработатьШтрихкоды")
Процедура смарт_ОбработатьШтрихкоды(Данные)
	// Фролов+  // Свой механизм. Было так:
	//СсылкаДокумента = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	//
	//Если СсылкаДокумента <> Неопределено Тогда
	//	ПоказатьЗначение(Неопределено, СсылкаДокумента);
	//Иначе
	//	ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	//КонецЕсли;
	
	// Стало так:
	Если Данные.Штрихкод="CREATE-ORDER-MSK-1" И смартРаспоряжениеНайдено Тогда 
		смарт_смартСоздатьОрдерВместо(Неопределено);
		смартРаспоряжениеНайдено=Ложь;
		Возврат;
	КонецЕсли;	
	смартМассивОрдеров.Очистить();
	СсылкаДокумента=ПолучитьСсылкуЗаказаКлиентаПоШтрихкоду(Данные.Штрихкод);
	
	Если СсылкаДокумента=Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Распоряжение по штрихкоду не найдено");
		смартРаспоряжениеНайдено=Ложь;
	Иначе
		Строки=РаспоряженияНаОтгрузку.НайтиСтроки(Новый Структура("Распоряжение",СсылкаДокумента));
		Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки.Очистить();	
		Если Строки.Количество()=0 Тогда
			МассивСкладов=ПолучитьМассивСкладовПоРаспоряжению(СсылкаДокумента,Склад);
			К=МассивСкладов.Количество();
			Если К Тогда 
				Текст="Распоряжение по штрихкоду на текущем складе не найдено."+
					Символы.ПС+"Есть распоряжение по "+?(К=1,"складу","складам")+": "+СтрСоединить(МассивСкладов,", ");
			Иначе
				Текст="Распоряжение по штрихкоду не найдено ни по одному складу";
			КонецЕсли;	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			смартРаспоряжениеНайдено=Ложь;
		Иначе 	
			Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки.Добавить(Строки[0].ПолучитьИдентификатор());
			Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока=Строки[0].ПолучитьИдентификатор();
			смартРаспоряжениеНайдено=Истина;
		КонецЕсли;				
	КонецЕсли;	
	// Фролов-
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьРаспоряженияНаОтгрузку")
Процедура смарт_ЗаполнитьРаспоряженияНаОтгрузку(ПроверятьИзменениеПараметров)

	Если Не ЗначениеЗаполнено(Склад) Тогда
		РаспоряженияНаОтгрузку.Очистить();
		Возврат;
	КонецЕсли;

	Если Не Пользователи.ЭтоПолноправныйПользователь(Неопределено) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка = &Склад";

		Запрос.УстановитьПараметр("Склад", Склад);

		Если Запрос.Выполнить().Пустой() Тогда
			РаспоряженияНаОтгрузку.Очистить();
			Возврат;
		КонецЕсли;

		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад", 				Склад);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ТекущееЗаданиеНаПеревозкуОтгрузка);
	Запрос.УстановитьПараметр("ДатаОтгрузки", 		?(ЗначениеЗаполнено(ДатаОтгрузки), КонецДня(ДатаОтгрузки) + 1, ДатаОтгрузки));
	ОформлятьСначалаНакладные = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить() = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные;
	Запрос.УстановитьПараметр("ОформлятьСначалаНакладные", ОформлятьСначалаНакладные);
	Запрос.УстановитьПараметр("ОтображениеДеталейОтгрузка", ОтображениеДеталейОтгрузка);

	Состояния = Новый Массив;
	Если СостояниеОтгрузки = "ВсеВРаботе" Тогда 
		Состояния.Добавить(Перечисления.СостоянияОтбораТоваров.ВПроцессеОтбора);
		Состояния.Добавить(Перечисления.СостоянияОтбораТоваров.ОжидаетсяОтбор);
		Состояния.Добавить(Перечисления.СостоянияОтбораТоваров.ОжидаетсяОтгрузка);
	ИначеЕсли СостояниеОтгрузки = "" Тогда
		Для Каждого Значение Из Перечисления.СостоянияОтбораТоваров Цикл 
			Состояния.Добавить(Значение);
		КонецЦикла;
	Иначе
		Состояния.Добавить(Перечисления.СостоянияОтбораТоваров[СостояниеОтгрузки]);
	КонецЕсли;
	Запрос.УстановитьПараметр("Состояния", Состояния);			

	// Если параметры не изменились, то формировать список заново не надо
	Если ПроверятьИзменениеПараметров
		И ТипЗнч(ПараметрыРаспоряженияНаОтгрузку) = Тип("ФиксированнаяСтруктура")
		И ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(ПараметрыРаспоряженияНаОтгрузку, Запрос.Параметры, "") Тогда 
		Возврат;
	КонецЕсли;

	// Кэшируем текущие параметры
	ПараметрыРаспоряженияНаОтгрузку = Новый Структура("Склад, ЗаданиеНаПеревозку, ДатаОтгрузки");
	ЗаполнитьЗначенияСвойств(ПараметрыРаспоряженияНаОтгрузку, Запрос.Параметры);
	ПараметрыРаспоряженияНаОтгрузку.Вставить("ОтображениеДеталейОтгрузка", ОтображениеДеталейОтгрузка);
	ПараметрыРаспоряженияНаОтгрузку = Новый ФиксированнаяСтруктура(ПараметрыРаспоряженияНаОтгрузку);

	ТекстЗапроса = "";

	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
	Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();

	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда

		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ТоварыКОтгрузкеОбороты.Номенклатура     КАК Номенклатура,
		|	ТоварыКОтгрузкеОбороты.Характеристика   КАК Характеристика,
		|	ТоварыКОтгрузкеОбороты.Назначение       КАК Назначение,
		|	ТоварыКОтгрузкеОбороты.Серия            КАК Серия,
		|	ТоварыКОтгрузкеОбороты.Склад            КАК Склад,
		|	ТоварыКОтгрузкеОбороты.КОтгрузкеПриход  КАК Количество
		|
		|ПОМЕСТИТЬ ТоварыКОтгрузкеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
		|			,
		|			,
		|			,
		|			&УсловиеСоединенияОбороты) КАК ТоварыКОтгрузкеОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	КонецЕсли;

	Если НЕ ОтображениеДеталейОтгрузка Тогда

		Если СкладыСервер.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку(Склад) Тогда

			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СостоянияИРеквизитыДоставки.Распоряжение КАК ДокументОтгрузки,
			|	СостоянияИРеквизитыДоставки.ПолучательОтправитель КАК Получатель
			|ПОМЕСТИТЬ ВТРаспоряженияСДоставкойПоЗаданиям
			|ИЗ
			|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ОтказОтПеревозки
			|		ПО (ОтказОтПеревозки.ЗаданиеНаПеревозку = ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка))
			|			И СостоянияИРеквизитыДоставки.Склад = ОтказОтПеревозки.Склад
			|			И (ОтказОтПеревозки.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение)
			|ГДЕ
			|	СостоянияИРеквизитыДоставки.Склад = &Склад
			|	И СостоянияИРеквизитыДоставки.СпособДоставки В(&СпособыДоставки)
			|	И ОтказОтПеревозки.Распоряжение ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВложенныйЗапрос.Получатель КАК Получатель,
			|	МИНИМУМ(ВложенныйЗапрос.Состояние) КАК Состояние
			|ПОМЕСТИТЬ ВТРаспоряженияКОтгрузке
			|ИЗ
			|	(ВЫБРАТЬ
			|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
			|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
			|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
			|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
			|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
			|		РаспоряженияКОтгрузке.Серия КАК Серия,
			#Удаление
			|		ВЫБОР
			|			КОГДА &ОжидаетсяОтбор
			|				ТОГДА 0
			|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
			|				ТОГДА 1
			|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
			|				ТОГДА 2
			|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
			|				ТОГДА 3
			|			ИНАЧЕ 404
			|		КОНЕЦ КАК Состояние
			#КонецУдаления
			#Вставка
			//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
			|		ВЫБОР
			|			КОГДА &ОжидаетсяОтбор
			|				ТОГДА 0
			|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток <> 0
			|				ТОГДА 1
			|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток <> 0
			|				ТОГДА 2
			|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток <> 0
			|				ТОГДА 3
			|			ИНАЧЕ 404
			|		КОНЕЦ КАК Состояние
			//-- #Б1376 смарт: Шляпников 19.11.2024
			#КонецВставки
			|	ИЗ
			|		РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаОтгрузки, Склад = &Склад) КАК РаспоряженияКОтгрузке
			|	ГДЕ &УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ДокументОтгрузки,
			|	ВложенныйЗапрос.Получатель
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументОтгрузки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка,
			|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
			|	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель КАК ПолучательОтправитель
			|ПОМЕСТИТЬ ВТОтборЗаданияНаПеревозку
			|ИЗ
			|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
			|ГДЕ
			|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
			|	И ЗаданиеНаПеревозкуРаспоряжения.Склад = &Склад
			|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.КПогрузке))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Распоряжение
			|;
			|
			#Вставка
			//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
			|ПОМЕСТИТЬ ВТЗаказыСНесколькимиСкладами
			|ИЗ
			|	ВТРаспоряженияКОтгрузке КАК РаспоряженияКОтгрузке
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|       ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ЗаказКлиентаТовары.Ссылка
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка.Склад.ЭтоГруппа = ИСТИНА
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Ссылка
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Склад) > 1
			|ИНДЕКСИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			//-- #Б7870 смарт: Шляпников 17.08.2026
			#КонецВставки
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТИПЗНАЧЕНИЯ(ЗаданияНаПеревозку.Ссылка) КАК ТипДокумента,
			|	ЗаданияНаПеревозку.Ссылка КАК Распоряжение,
			|	ЗаданияНаПеревозку.Ссылка КАК ЗаданиеНаПеревозку,
			|	ЗаданияНаПеревозку.Ссылка.Номер КАК Номер,
			|	ЗаданияНаПеревозку.Ссылка.ДатаВремяРейсаПланС КАК Дата,
			|	НЕОПРЕДЕЛЕНО КАК Получатель,
			|	ВЫБОР
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ КАК Состояние,
			//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
			// Фролов+
			|	ВЫБОР КОГДА ЗаданияНаПеревозку.Ссылка.Склад.ЭтоГруппа ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК смартКартинкаГруппыСкладов,
			// Фролов-
			//-- смарт:ММ 27.03.2020
			//++ смарт:ММ #044 137 10.04.2020
			|	ВЫРАЗИТЬ(ЗаданияНаПеревозку.Ссылка.Комментарий КАК СТРОКА (300)) КАК смартКомментарий,
			//-- смарт:ММ 10.04.2020
			//++ смарт:ММ 607 10.09.2021
			|	ЗаданияНаПеревозку.Ссылка.СпособДоставки КАК смартСпособДоставки,
			|	ЗаданияНаПеревозку.Ссылка.ТранспортноеСредство КАК смартТранспортноеСредство,
			|	ЗаданияНаПеревозку.Ссылка.Номер КАК смартНомер,
			//-- смарт:ММ 10.09.2021
			|	1 КАК ИндексКартинки
			|ИЗ
			|	ВТОтборЗаданияНаПеревозку КАК ЗаданияНаПеревозку
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаспоряженияКОтгрузке КАК ВТРаспоряженияКОтгрузке
			|		ПО (ВТРаспоряженияКОтгрузке.ДокументОтгрузки = ЗаданияНаПеревозку.Распоряжение)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаданияНаПеревозку.Ссылка,
			|	ЗаданияНаПеревозку.Ссылка.Номер,
			|	ЗаданияНаПеревозку.Ссылка.ДатаВремяРейсаПланС,
			|	ЗаданияНаПеревозку.Ссылка
			|
			|ИМЕЮЩИЕ
			|	ВЫБОР
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ В (&Состояния)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки)
			|,
			|	РаспоряженияКОтгрузке.ДокументОтгрузки,
			|	ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка),
			|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
			|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)),
			|	РаспоряженияКОтгрузке.Получатель,
			|	ВЫБОР
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА РаспоряженияКОтгрузке.Состояние = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ,
			//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
			// Фролов+
			#Удаление
			|	ВЫБОР КОГДА РаспоряженияКОтгрузке.ДокументОтгрузки Ссылка Документ.ЗаказКлиента И РаспоряженияКОтгрузке.ДокументОтгрузки.Склад.ЭтоГруппа ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,
			#КонецУдаления
			#Вставка
			//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
			|	ВЫБОР
			|		КОГДА НЕ ВТЗаказыСНесколькимиСкладами.ЗаказКлиента ЕСТЬ NULL
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК смартКартинкаГруппыСкладов,
			//-- #Б7870 смарт: Шляпников 17.08.2026
			#КонецВставки
			// Фролов-
			//-- смарт:ММ 27.03.2020
			//++ смарт:ММ #044 137 10.04.2020
			|	ВЫРАЗИТЬ(РаспоряженияКОтгрузке.ДокументОтгрузки.Комментарий КАК СТРОКА(300)),
			//-- смарт:ММ 10.04.2020
			//++ смарт:ММ 607 10.09.2021
			|	РаспоряженияКОтгрузке.ДокументОтгрузки.СпособДоставки,
			|	"""" КАК смартТранспортноеСредство,
			|	"""" КАК смартНомер,
			//-- смарт:ММ 10.09.2021
			|	0
			|ИЗ
			|	ВТРаспоряженияКОтгрузке КАК РаспоряженияКОтгрузке
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
			|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = РеестрДокументов.Ссылка
			|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспоряженияСДоставкойПоЗаданиям КАК ВТРаспоряженияСДоставкойПоЗаданиям
			|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ВТРаспоряженияСДоставкойПоЗаданиям.ДокументОтгрузки
			#Вставка
			//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСНесколькимиСкладами КАК ВТЗаказыСНесколькимиСкладами
			|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ВТЗаказыСНесколькимиСкладами.ЗаказКлиента
			//-- #Б7870 смарт: Шляпников 17.08.2026
			#КонецВставки
			|ГДЕ
			|	ВТРаспоряженияСДоставкойПоЗаданиям.ДокументОтгрузки ЕСТЬ NULL
			|	И ВЫБОР
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 0
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 1
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 2
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|			КОГДА РаспоряженияКОтгрузке.Состояние = 3
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|		КОНЕЦ В (&Состояния)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";

			СпособыДоставки = ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));

			Запрос.УстановитьПараметр("СпособыДоставки", СпособыДоставки);

		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
			|	ВложенныйЗапрос.Получатель КАК Получатель,
			|	ВЫБОР
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ КАК Состояние
			|ПОМЕСТИТЬ РаспоряженияИСостояния
			|ИЗ
			|	(ВЫБРАТЬ
			|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
			|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
			|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
			|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
			|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
			|		РаспоряженияКОтгрузке.Серия КАК Серия,
			#Удаление
			|		ВЫБОР
			|			КОГДА &ОжидаетсяОтбор
			|				ТОГДА 0
			|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
			|				ТОГДА 1
			|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
			|				ТОГДА 2
			|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
			|				ТОГДА 3
			|			ИНАЧЕ 404
			|		КОНЕЦ КАК Состояние
			#КонецУдаления
			#Вставка
			//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
			|		ВЫБОР
			|			КОГДА &ОжидаетсяОтбор
			|				ТОГДА 0
			|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток <> 0
			|				ТОГДА 1
			|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток <> 0
			|				ТОГДА 2
			|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток <> 0
			|				ТОГДА 3
			|			ИНАЧЕ 404
			|		КОНЕЦ КАК Состояние
			//-- #Б1376 смарт: Шляпников 19.11.2024
			#КонецВставки
			|	ИЗ
			|		РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаОтгрузки, Склад = &Склад) КАК РаспоряженияКОтгрузке
			|	ГДЕ &УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ДокументОтгрузки,
			|	ВложенныйЗапрос.Получатель
			|
			|ИМЕЮЩИЕ
			|	ВЫБОР
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
			|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
			|	КОНЕЦ В (&Состояния)
			|;
			#Вставка
			//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
			|ПОМЕСТИТЬ ВТЗаказыСНесколькимиСкладами
			|ИЗ
			|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|       ПО РаспоряженияИСостояния.Распоряжение = ЗаказКлиентаТовары.Ссылка
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка.Склад.ЭтоГруппа = ИСТИНА
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Ссылка
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Склад) > 1
			|ИНДЕКСИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			//-- #Б7870 смарт: Шляпников 17.08.2026
			#КонецВставки
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ //++ #Б1328 смарт: Шляпников 18.11.2024 / Отгрузка товаров со склада
			|	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
			|	РаспоряженияИСостояния.Получатель КАК Получатель,
			|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
			|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата,
			|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение)
			| 	КАК ТипДокумента,
			|	РаспоряженияИСостояния.Состояние,
			//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
			// Фролов+
			#Удаление
			|	ВЫБОР КОГДА РаспоряженияИСостояния.Распоряжение Ссылка Документ.ЗаказКлиента И РаспоряженияИСостояния.Распоряжение.Склад.ЭтоГруппа ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК смартКартинкаГруппыСкладов,
			#КонецУдаления
			#Вставка
			//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
			|	ВЫБОР
			|		КОГДА НЕ ВТЗаказыСНесколькимиСкладами.ЗаказКлиента ЕСТЬ NULL
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК смартКартинкаГруппыСкладов,
			//-- #Б7870 смарт: Шляпников 17.08.2026
			#КонецВставки
			// Фролов-
			//-- смарт:ММ 27.03.2020
			//++ смарт:ММ #044 137 10.04.2020
			|	ВЫРАЗИТЬ(РаспоряженияИСостояния.Распоряжение.Комментарий КАК СТРОКА(300)) КАК смартКомментарий,
			//-- смарт:ММ 10.04.2020
			//++ смарт:ММ 607 10.09.2021
			|	РаспоряженияИСостояния.Распоряжение.СпособДоставки КАК смартСпособДоставки,
			|ВЫБОР 
			|	КОГДА НЕ РаспоряженияИСостояния.Распоряжение.СпособДоставки В (&СпособСамовывоз)
			|		ТОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ТранспортноеСредство, """") 
			|	ИНАЧЕ """"
			|КОНЕЦ КАК смартТранспортноеСредство,
			|ВЫБОР 
			|	КОГДА НЕ РаспоряженияИСостояния.Распоряжение.СпособДоставки В (&СпособСамовывоз)
			|		ТОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, """") 
			|	ИНАЧЕ """"
			|КОНЕЦ КАК смартНомер,
			//-- смарт:ММ 10.09.2021
			|	0 КАК ИндексКартинки
			|ИЗ
			|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
			|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
			|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
			//++ смарт:ММ 607 10.09.2021
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиенаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
			|		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
			|			И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
			//-- смарт:ММ 10.09.2021
			#Вставка
			//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСНесколькимиСкладами КАК ВТЗаказыСНесколькимиСкладами
			|		ПО РаспоряженияИСостояния.Распоряжение = ВТЗаказыСНесколькимиСкладами.ЗаказКлиента
			//-- #Б7870 смарт: Шляпников 17.08.2026
			#КонецВставки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) //++ #Б1328 смарт: Шляпников 18.11.2024 / Отгрузка товаров со склада";
		КонецЕсли;

	Иначе // ОтображениеДеталейОтгрузка

		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
		|	ВложенныйЗапрос.Получатель КАК Получатель,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ КАК Состояние
		|ПОМЕСТИТЬ РаспоряженияИСостояния
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
		|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
		|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
		|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
		|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
		|		РаспоряженияКОтгрузке.Серия КАК Серия,
		#Удаление
		|		ВЫБОР
		|			КОГДА &ОжидаетсяОтбор
		|				ТОГДА 0
		|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
		|				ТОГДА 1
		|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
		|				ТОГДА 2
		|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
		|				ТОГДА 3
		|			ИНАЧЕ 404
		|		КОНЕЦ КАК Состояние
		#КонецУдаления
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		|		ВЫБОР
		|			КОГДА &ОжидаетсяОтбор
		|				ТОГДА 0
		|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток <> 0
		|				ТОГДА 1
		|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток <> 0
		|				ТОГДА 2
		|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0 ИЛИ РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток <> 0
		|				ТОГДА 3
		|			ИНАЧЕ 404
		|		КОНЕЦ КАК Состояние
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|				&ДатаОтгрузки,
		|				Склад = &Склад
		|					И ДокументОтгрузки В
		|						(ВЫБРАТЬ
		|							ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК ДокументОтгрузки
		|						ИЗ
		|							Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|						ГДЕ
		|							ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку)) КАК РаспоряженияКОтгрузке
		|	ГДЕ &УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ДокументОтгрузки,
		|	ВложенныйЗапрос.Получатель
		|
		|ИМЕЮЩИЕ
		|	ВЫБОР
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ В (&Состояния)
		|;
		|
		#Вставка
		//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
		|ПОМЕСТИТЬ ВТЗаказыСНесколькимиСкладами
		|ИЗ
		|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|       ПО РаспоряженияИСостояния.Распоряжение = ЗаказКлиентаТовары.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка.Склад.ЭтоГруппа = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Склад) > 1
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//-- #Б7870 смарт: Шляпников 17.08.2026
		#КонецВставки
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение)
		| 	КАК ТипДокумента,
		|	3 КАК ИндексКартинки,
		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
		// Фролов+
		#Удаление
		|	ВЫБОР КОГДА РаспоряженияИСостояния.Распоряжение Ссылка Документ.ЗаказКлиента И РаспоряженияИСостояния.Распоряжение.Склад.ЭтоГруппа ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК смартКартинкаГруппыСкладов,
		#КонецУдаления
		#Вставка
		//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
		|	ВЫБОР
		|		КОГДА НЕ ВТЗаказыСНесколькимиСкладами.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК смартКартинкаГруппыСкладов,
		//-- #Б7870 смарт: Шляпников 17.08.2026
		#КонецВставки
		// Фролов-
		//-- смарт:ММ 27.03.2020
		//++ смарт:ММ #044 137 10.04.2020
		|	ВЫРАЗИТЬ(РаспоряженияИСостояния.Распоряжение.Комментарий КАК СТРОКА(300)) КАК смартКомментарий,
		//-- смарт:ММ 10.04.2020
		//++ смарт:ММ 607 10.09.2021
		|	РаспоряженияИСостояния.Распоряжение.СпособДоставки КАК смартСпособДоставки,
		|	ВЫРАЗИТЬ(&ЗаданиеНаПеревозку КАК Документ.ЗаданиеНаПеревозку).ТранспортноеСредство КАК смартТранспортноеСредство,
		|	ВЫРАЗИТЬ(&ЗаданиеНаПеревозку КАК Документ.ЗаданиеНаПеревозку).Номер КАК смартНомер,
		//-- смарт:ММ 10.09.2021
		|	РаспоряженияИСостояния.Распоряжение,
		|	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
		|	РаспоряженияИСостояния.Получатель,
		|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
		|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата,
		|	РаспоряженияИСостояния.Состояние,
		|	1 КАК Порядок
		|ИЗ
		|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
		|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
		#Вставка
		//++ #Б7870 смарт: Шляпников 17.08.2026 / Вывод пиктограммы группы складов в обработке Обработки.УправлениеОтгрузкой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСНесколькимиСкладами КАК ВТЗаказыСНесколькимиСкладами
		|		ПО РаспоряженияИСостояния.Распоряжение = ВТЗаказыСНесколькимиСкладами.ЗаказКлиента
		//-- #Б7870 смарт: Шляпников 17.08.2026
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(ЗаданиеНаПеревозку.Ссылка),
		|	2,
		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
		// Фролов+
		|	ВЫБОР КОГДА ЗаданиеНаПеревозку.Ссылка.Склад.ЭтоГруппа ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,
		// Фролов-
		//-- смарт:ММ 27.03.2020
		//++ смарт:ММ #044 137 10.04.2020
		|	"""" КАК смартКомментарий,
		//-- смарт:ММ 10.04.2020
		//++ смарт:ММ 607 10.09.2021
		|	ЗаданиеНаПеревозку.Ссылка.СпособДоставки КАК смартСпособДоставки,
		|	ЗаданиеНаПеревозку.ТранспортноеСредство КАК смартТранспортноеСредство,
		|	ЗаданиеНаПеревозку.Номер КАК смартНомер,
		//-- смарт:ММ 10.09.2021
		|	ЗаданиеНаПеревозку.Ссылка,
		|	ЗаданиеНаПеревозку.Ссылка,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка),
		|	0
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
		|ГДЕ
		|	ЗаданиеНаПеревозку.Ссылка = &ЗаданиеНаПеревозку
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Дата";

	КонецЕсли;

	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда

		#Удаление
		ОжидаетсяОтбор = 
		"		&ОформлятьСначалаНакладные
		|			И ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток >= 0
		|					ТОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток
		|				ИНАЧЕ -(РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЛИ НЕ &ОформлятьСначалаНакладные
		|			И ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток >= 0
		|					ТОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток
		|				ИНАЧЕ -(РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ";

		УсловиеТоварыКОтбору = "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыКОтгрузкеОбороты КАК ТоварыКОтгрузкеОбороты
		|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ТоварыКОтгрузкеОбороты.ДокументОтгрузки
		|			И РаспоряженияКОтгрузке.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура
		|			И РаспоряженияКОтгрузке.Характеристика = ТоварыКОтгрузкеОбороты.Характеристика
		|			И РаспоряженияКОтгрузке.Назначение = ТоварыКОтгрузкеОбороты.Назначение
		|			И РаспоряженияКОтгрузке.Серия = ТоварыКОтгрузкеОбороты.Серия
		|			И РаспоряженияКОтгрузке.Склад = ТоварыКОтгрузкеОбороты.Склад
		|ГДЕ
		|
		|	РаспоряженияКОтгрузке.КОформлениюОстаток >
		|		ВЫБОР
		|			КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|				ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|					ИНАЧЕ 0
		|		КОНЕЦ
		|
		|	ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
		|	ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0
		|	ИЛИ (&ОжидаетсяОтбор)";
		#КонецУдаления
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		ОжидаетсяОтбор = 
		"		( &ОформлятьСначалаНакладные
		|			И ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток >= 0
		|					ТОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток
		|				ИНАЧЕ -(РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЛИ НЕ &ОформлятьСначалаНакладные
		|			И ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток >= 0
		|					ТОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток
		|				ИНАЧЕ -(РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ )
		|		ИЛИ ( &ОформлятьСначалаНакладные
		|			И ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток >= 0
		|					ТОГДА РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток
		|				ИНАЧЕ -(РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЛИ НЕ &ОформлятьСначалаНакладные
		|			И ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток >= 0
		|					ТОГДА РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток
		|				ИНАЧЕ -(РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ )";

		УсловиеТоварыКОтбору = "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыКОтгрузкеОбороты КАК ТоварыКОтгрузкеОбороты
		|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ТоварыКОтгрузкеОбороты.ДокументОтгрузки
		|			И РаспоряженияКОтгрузке.Номенклатура = ТоварыКОтгрузкеОбороты.Номенклатура
		|			И РаспоряженияКОтгрузке.Характеристика = ТоварыКОтгрузкеОбороты.Характеристика
		|			И РаспоряженияКОтгрузке.Назначение = ТоварыКОтгрузкеОбороты.Назначение
		|			И РаспоряженияКОтгрузке.Серия = ТоварыКОтгрузкеОбороты.Серия
		|			И РаспоряженияКОтгрузке.Склад = ТоварыКОтгрузкеОбороты.Склад
		|ГДЕ
		|
		|	РаспоряженияКОтгрузке.КОформлениюОстаток >
		|		ВЫБОР
		|			КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|				ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|					ИНАЧЕ 0
		|		КОНЕЦ
		| ИЛИ РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток >
		|		ВЫБОР
		|			КОГДА РаспоряженияКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|				ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТоварыКОтгрузкеОбороты.Количество
		|					ИНАЧЕ 0
		|		КОНЕЦ
		|
		|	ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
		|	ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0
		|	ИЛИ РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток <> 0
		|	ИЛИ РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток <> 0
		|	ИЛИ (&ОжидаетсяОтбор)";
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки

		УсловиеТоварыКОтбору = СтрЗаменить(УсловиеТоварыКОтбору,"&ОжидаетсяОтбор", ОжидаетсяОтбор);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ГДЕ &УсловиеТоварыКОтбору", УсловиеТоварыКОтбору);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОжидаетсяОтбор", ОжидаетсяОтбор);
		Запрос.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
		Запрос.УстановитьПараметр("МерныеТипыЕдиницИзмерений", Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
	Иначе

		#Удаление
		ОжидаетсяОтбор = 
		"&ОформлятьСначалаНакладные
		|			И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток > 0
		|		ИЛИ НЕ &ОформлятьСначалаНакладные
		|			И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток > 0";

		УсловиеТоварыКОтбору = 
		"ГДЕ 
		|	(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
		|			ИЛИ (&ОжидаетсяОтбор)
		|			ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
		|			ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)";
		#КонецУдаления
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		ОжидаетсяОтбор = 
		"&ОформлятьСначалаНакладные
		|			И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток > 0
		|		ИЛИ НЕ &ОформлятьСначалаНакладные
		|			И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток > 0
		|		ИЛИ &ОформлятьСначалаНакладные
		|			И РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток > 0
		|		ИЛИ НЕ &ОформлятьСначалаНакладные
		|			И РаспоряженияКОтгрузке.смартКОтгрузкеГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток - РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток > 0";

		УсловиеТоварыКОтбору = 
		"ГДЕ 
		|	(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
		|			ИЛИ (&ОжидаетсяОтбор)
		|			ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
		|			ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)
		|	ИЛИ (РаспоряженияКОтгрузке.смартКОформлениюГарантийныеОстаток <> 0
		|			ИЛИ (&ОжидаетсяОтбор)
		|			ИЛИ РаспоряженияКОтгрузке.смартСобираетсяГарантийныеОстаток <> 0
		|			ИЛИ РаспоряженияКОтгрузке.смартСобраноГарантийныеОстаток <> 0)";
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки

		УсловиеТоварыКОтбору = СтрЗаменить(УсловиеТоварыКОтбору,"&ОжидаетсяОтбор", ОжидаетсяОтбор);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ГДЕ &УсловиеТоварыКОтбору", УсловиеТоварыКОтбору);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОжидаетсяОтбор", ОжидаетсяОтбор);

	КонецЕсли;

	Если ОтображениеДеталейОтгрузка Тогда
		УсловиеСоединенияОбороты = "Склад = &Склад
		|					И ДокументОтгрузки В
		|						(ВЫБРАТЬ
		|							ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК ДокументОтгрузки
		|						ИЗ
		|							Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|						ГДЕ
		|							ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку)";
	Иначе
		УсловиеСоединенияОбороты = "Склад = &Склад";
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеСоединенияОбороты", УсловиеСоединенияОбороты);

	//++ смарт:ММ 607 10.09.2021
	СпособСамовывоз = Новый Массив;
	СпособСамовывоз.Добавить(Перечисления.СпособыДоставки.Самовывоз);
	СпособСамовывоз.Добавить(Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал);

	Запрос.УстановитьПараметр("СпособСамовывоз", СпособСамовывоз);
	//-- смарт:ММ 10.09.2021

	Запрос.Текст = ТекстЗапроса;

	// Запомним текущую строку таблицы распоряжений
	Если ЗначениеЗаполнено(Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока) Тогда
		ТекущаяСтрокаРаспоряженияНаОтгрузку = 
		РаспоряженияНаОтгрузку.НайтиПоИдентификатору(Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока);
		Если ТекущаяСтрокаРаспоряженияНаОтгрузку <> Неопределено Тогда
			ТекущееРаспоряжение = ТекущаяСтрокаРаспоряженияНаОтгрузку.Распоряжение;
		КонецЕсли;		
	Иначе
		ТекущееРаспоряжение = Неопределено;
	КонецЕсли;

	//++ #Б1328 смарт: Шляпников 18.11.2024 / Отгрузка товаров со склада
	ТЗРаспоряженийПредварительно = Запрос.Выполнить().Выгрузить();
	ТЗРаспоряженийПредварительно.Колонки.Добавить("смартДоставка", ОбщегоНазначения.ОписаниеТипаСтрока(1000));

	ТЗДокументов = ТЗРаспоряженийПредварительно.Скопировать(, "Распоряжение");
	ТЗДокументов.Свернуть("Распоряжение");

	ТЗКомментариев = Новый ТаблицаЗначений;
	ТЗКомментариев.Колонки.Добавить("смартКомментарий");

	Для Каждого стрТЗДокументов Из ТЗДокументов Цикл

		НайденныеСтроки = ТЗРаспоряженийПредварительно.НайтиСтроки(Новый Структура("Распоряжение", стрТЗДокументов.Распоряжение));

		Первая = Истина;
		МассивСтрокДоставки = Новый Массив;
		Для Каждого стрНайденныеСтроки Из НайденныеСтроки Цикл

			стрТЗКомментариев = ТЗКомментариев.Добавить();
			стрТЗКомментариев.смартКомментарий = стрНайденныеСтроки.смартКомментарий;

			МассивСтрокДоставки.Добавить(СтрШаблон("%1 %2 %3", стрНайденныеСтроки.смартСпособДоставки
			, стрНайденныеСтроки.смартТранспортноеСредство
			, стрНайденныеСтроки.смартНомер));

			Если НЕ Первая Тогда
				ТЗРаспоряженийПредварительно.Удалить(стрНайденныеСтроки);
			КонецЕсли;

			Первая = Ложь;

		КонецЦикла;

		ТЗКомментариев.Свернуть("смартКомментарий");
		НайденныеСтроки[0].смартКомментарий = СтрСоединить(ТЗКомментариев.ВыгрузитьКолонку("смартКомментарий"), Символы.ПС);
		НайденныеСтроки[0].смартДоставка = СтрСоединить(МассивСтрокДоставки, ", ");

	КонецЦикла;

	РаспоряженияНаОтгрузку.Загрузить(ТЗРаспоряженийПредварительно);
	//-- #Б1328 смарт: Шляпников 18.11.2024

	// Восстановим текущую строку
	Если ЗначениеЗаполнено(ТекущееРаспоряжение) Тогда
		Строки = РаспоряженияНаОтгрузку.НайтиСтроки(Новый Структура("Распоряжение", ТекущееРаспоряжение));
		Если Строки.Количество() > 0 Тогда
			Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	ИначеЕсли РаспоряженияНаОтгрузку.Количество() > 0 Тогда
		Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока = РаспоряженияНаОтгрузку[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СкладПомещениеПриИзмененииСервер")
Процедура смарт_СкладПомещениеПриИзмененииСервер()

	СтруктураУстанавливаемыхПараметров = Новый Структура;

	Если ЗначениеЗаполнено(Склад) Тогда
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Склад);
		СтруктураУстанавливаемыхПараметров.Вставить("Помещение",Помещение);

		ИспользоватьАдресноеХранение = СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение);

		Если ИспользоватьАдресноеХранение Тогда
			ЗонаОтгрузки = Справочники.СкладскиеЯчейки.ЗонаОтгрузкиПоУмолчанию(Склад, Помещение);
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		Иначе
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		КонецЕсли;

		УстановитьПривилегированныйРежим(Истина);
		Элементы.ОрдераВРаботеПорядокДоставки.Видимость = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку");
		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Неопределено);
		СтруктураУстанавливаемыхПараметров.Вставить("Помещение",Неопределено);
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		ИспользоватьАдресноеХранение = Ложь;
	КонецЕсли;	

	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	ИспользоватьСтатусыРасходныхОрдеров = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", 
	Новый Структура("Склад", Склад));

	Элементы.ОрдераВРаботеСтатус.Видимость = ИспользоватьСтатусыРасходныхОрдеров;

	Элементы.Состояние.СписокВыбора.Очистить();

	Если ИспользоватьСтатусыРасходныхОрдеров Тогда
		Элементы.Состояние.СписокВыбора.Добавить("ВсеВРаботе", НСтр("ru = 'Все в работе'"));		
		Элементы.Состояние.СписокВыбора.Добавить("ОжидаетсяОтбор", НСтр("ru = 'Ожидается отбор'"));
		Элементы.Состояние.СписокВыбора.Добавить("ОжидаетсяОтгрузка", НСтр("ru = 'Ожидается отгрузка'"));		
		Элементы.Состояние.СписокВыбора.Добавить("ОжидаетсяОформлениеНакладных", НСтр("ru = 'Ожидается оформление накладных'"));
		Элементы.Состояние.СписокВыбора.Добавить("", НСтр("ru = 'Все'"));
		СостояниеОтгрузки = "ВсеВРаботе";
	Иначе
		Элементы.Состояние.СписокВыбора.Добавить("ОжидаетсяОтбор", НСтр("ru = 'Ожидается отбор'"));
		Элементы.Состояние.СписокВыбора.Добавить("ОжидаетсяОформлениеНакладных", НСтр("ru = 'Ожидается оформление накладных'"));
		Элементы.Состояние.СписокВыбора.Добавить("", НСтр("ru = 'Все'"));		
		СостояниеОтгрузки = "ОжидаетсяОтбор";
	КонецЕсли;

	РабочийУчасток = Справочники.РабочиеУчастки.ПустаяСсылка();
	НазначитьЗонуОтгрузки   = Ложь;

	ПоказыватьГиперссылки = СкладыСервер.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку(Склад);
	Элементы.РаспоряженияНаОтгрузкуРаспоряжениеНомер.ГиперссылкаЯчейки = ПоказыватьГиперссылки;
	Элементы.РаспоряженияНаОтборНомер.ГиперссылкаЯчейки 			   = ПоказыватьГиперссылки;

	УстановитьОтборыВОсновныхСписках();

	ЗаполнитьСписокВыбораФильтраОрдеров();
	УстановитьВидимостьПомещений();
	
	#Вставка
	//++ #1834 смарт: Шляпников 09.01.2025 / Интеграция с WMS. Загрузка приходных ордеров.
	Попытка
		Элементы.смартЗагрузитьОрдераИзАдмирал.Видимость = (Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение);
	Исключение
	КонецПопытки;
	//-- #1834 смарт: Шляпников 09.01.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Фролов+
&НаСервереБезКонтекста
Функция ПолучитьСсылкуЗаказаКлиентаПоШтрихкоду(Штрихкод)
	Менеджеры=Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказНаПеремещение.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ВнутреннееПотреблениеТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.СписаниеНедостачТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказНаСборку.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ВозвратТоваровПоставщику.ПустаяСсылка"));
	
	МассивСсылок=ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	Если МассивСсылок.Количество()>0 Тогда 
		Возврат МассивСсылок[0];
	КонецЕсли;
	Возврат Неопределено;
КонецФункции	

&НаКлиенте
Процедура смарт_смартСоздатьОрдерВместо(Команда)
	ПоВсемРаспоряжениям=1;
	СоздатьОрдераСервер();
	смартРаспоряжениеНайдено=Ложь;
	МассивОрдеров=смартМассивОрдеров.ВыгрузитьЗначения();
	Если МассивОрдеров.Количество()>0 Тогда 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РасходныйОрдерНаТовары","РасходныйОрдерНаТовары",МассивОрдеров,ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСкладовПоРаспоряжению(Расположение,СкладИсключение)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение",Расположение);
	Запрос.УстановитьПараметр("Склад",СкладИсключение);
	Запрос.Текст="ВЫБРАТЬ
	             |	ТоварыКОтгрузкеОбороты.Склад.Наименование КАК Склад
	             |ИЗ
	             |	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	             |			,
	             |			,
	             |			,
	             |			ДокументОтгрузки = &Распоряжение
	             |				И НЕ Склад = &Склад) КАК ТоварыКОтгрузкеОбороты";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
КонецФункции	
// Фролов-

//++ #1834 смарт: Шляпников 09.01.2025 / Интеграция с WMS. Загрузка приходных ордеров.
&НаСервере
Функция ПоместитьТаблицуРаспоряженийВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(РаспоряженияНаОтгрузку.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура смартЗагрузитьОрдераИзАдмирал(Команда)
	
	СтрокаДанных = РаспоряженияНаОтгрузку.НайтиПоИдентификатору(Элементы.РаспоряженияНаОтгрузку.ТекущаяСтрока);
	Если НЕ СтрокаДанных = Неопределено Тогда
		
		//++ #Б2224 смарт: Шляпников 17.02.2025 / Интеграция с WMS. Загрузка расходных ордеров. Дополнение.
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Распоряжения", ПоместитьТаблицуРаспоряженийВоВременноеХранилище());
		
		ОткрытьФорму("Обработка.смартЗагрузкаСкладскихОрдеровИзАдмирал.Форма.ФормаЗагрузкиРасходныхОрдеров", ПараметрыОткрытия, ЭтаФорма, , , , Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузкиОрдеровИзАдмирала", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//-- #Б2224 смарт: Шляпников 17.02.2025
		
	КонецЕсли;
	
КонецПроцедуры

//++ #1834 смарт: Шляпников 09.01.2025 / Интеграция с WMS. Загрузка приходных ордеров.
&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузкиОрдеровИзАдмирала(Значение, ДопПараметры) Экспорт
	
	ОбновитьСписки(Неопределено);
	
КонецПроцедуры

#КонецОбласти

//++ смарт:ММ #017 173 08.02.2020 Этикетка доставки
&НаСервере
Процедура смартДобавитьЭлементыНаФорму()
	
	// Команда печати этикетки
    Команда = ЭтаФорма.Команды.Добавить("смартПечатьЭтикетки");
    Команда.Действие 	= "смартНапечататьЭтикеткуДоставки";
	Команда.Подсказка 	= "Печать этикетки доставки";
	Команда.Картинка 	= БиблиотекаКартинок.Печать;
	Команда.Отображение = ОтображениеКнопки.КартинкаИТекст; 


    // Кнопка печати этикетки
    Кнопка = ЭтаФорма.Элементы.Добавить("смартПечатьЭтикетки", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ОрдераВРаботеГруппаКоманднаяПанель);
    Кнопка.Заголовок	= "Этикетка доставки (смарт)";
    Кнопка.ИмяКоманды	= "смартПечатьЭтикетки";
	
	//++ смарт:ММ 572 21.07.2021
	
	// Команда Реестр отгрузок
	
    Команда = ЭтаФорма.Команды.Добавить("смартРеестрОтгрузок");
    Команда.Действие 	= "смартРеестрОтгрузокНажатие";
	Команда.Подсказка 	= "Реестр отгрузок за день";
	Команда.Картинка 	= БиблиотекаКартинок.Печать;
	Команда.Отображение = ОтображениеКнопки.КартинкаИТекст; 

    // Кнопка Реестр отгрузок
	
    Кнопка = ЭтаФорма.Элементы.Добавить("смартРеестрОтгрузок", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ОрдераВРаботеГруппаКоманднаяПанель);
    Кнопка.Заголовок	= "Реестр отгрузок (смарт)";
    Кнопка.ИмяКоманды	= "смартРеестрОтгрузок";
	//-- смарт:ММ 21.07.2021
	
	//++ смарт:ММ 607 10.09.2021	
	ДобавляемыеРеквизиты = Новый Массив;
	
	//++ #Б1328 смарт: Шляпников 18.11.2024 / Отгрузка товаров со склада
	Реквизит_КолонкаДоставка 		= Новый РеквизитФормы("смартДоставка", Новый ОписаниеТипов("Строка"), "РаспоряженияНаОтгрузку", "Доставка");	
	
	ДобавляемыеРеквизиты.Добавить(Реквизит_КолонкаДоставка);
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭлементКолонка = Элементы.Вставить("смартДоставка", Тип("ПолеФормы"), ЭтаФорма.Элементы.РаспоряженияНаОтгрузку, ЭтаФорма.Элементы.РаспоряженияНаОтгрузкуРаспоряжение);
	ЭлементКолонка.Заголовок = "Доставка";
	ЭлементКолонка.ПутьКДанным = "РаспоряженияНаОтгрузку.смартДоставка";
	//-- #Б1328 смарт: Шляпников 18.11.2024
	//-- смарт:ММ 10.09.2021
	
КонецПроцедуры //-- смарт:ММ 08.02.2020

//++ смарт:ММ #017 173 08.02.2020 Этикетка доставки
&НаКлиенте
Процедура смартНапечататьЭтикеткуДоставки(Команда)
			
	ВыделенныеСтроки = Элементы.ОрдераВРаботе.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыНазначения = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) <> Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектыНазначения.Добавить(ВыделеннаяСтрока);
		
	КонецЦикла;
	
	Если ОбъектыНазначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    ВыполняемаяОбработка = смартНайтиВПФ("смартЭтикеткаДоставки");
	
	Если ВыполняемаяОбработка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В справочнике ""Дополнительные отчеты и обработки"" не найдена печатная форма с именем ""смартЭтикеткаДоставки""");
        Возврат;
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура("ИдентификаторКоманды, ДополнительнаяОбработкаСсылка, ИмяФормы, КлючСессии");
	ПараметрыОбработки.ИдентификаторКоманды          = "смартЭтикеткаДоставки";
	ПараметрыОбработки.ДополнительнаяОбработкаСсылка = ВыполняемаяОбработка;
	ПараметрыОбработки.КлючСессии = ВыполняемаяОбработка.УникальныйИдентификатор();
	ПараметрыОбработки.ИмяФормы = ЭтаФорма.ИмяФормы;
	ПараметрыОбработки.Вставить("ОбъектыНазначения", ОбъектыНазначения);
	
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыОбработки, ЭтаФорма);

КонецПроцедуры //-- смарт:ММ 08.02.2020

//++ смарт:ММ #017 173 08.02.2020 Этикетка доставки
&НаСервереБезКонтекста
Функция смартНайтиВПФ(ИмяОбъекта)
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбъекта);
	
КонецФункции //-- смарт:ММ 08.02.2020

//++ смарт:ММ 572 21.07.2021
&НаКлиенте
Процедура смартРеестрОтгрузокНажатие(Команда)
	
	ТабДок = смартСформироватьРеестрОтгрузок();
	//ТабДок.Показать();
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	
КонецПроцедуры //-- смарт:ММ 21.07.2021

//++ смарт:ММ 572 21.07.2021
&НаСервере
Функция смартСформироватьРеестрОтгрузок()
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("смарт_РеестрОтгрузок");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаОтгрузки = Формат(ДатаОтгрузки, "ДФ='dd.MM.yyyy ""г.""'");
	ОбластьШапка.Параметры.Склад = Склад;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РасходныеОрдера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Склад = &Склад
	|	И РасходныйОрдерНаТовары.Проведен
	|	И НАЧАЛОПЕРИОДА(РасходныйОрдерНаТовары.ДатаОтгрузки, ДЕНЬ) = &ДатаОтгрузки
	|	И РасходныйОрдерНаТовары.Статус = &СтатусОтгружен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_ЗаказыКлиентов
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
	|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = ВТ_РасходныеОрдера.Ссылка
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	ВТ_ЗаказыКлиентов.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_РеализацииПоЗаказам
	|ИЗ
	|	ВТ_ЗаказыКлиентов КАК ВТ_ЗаказыКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ЗаказыКлиентов.Распоряжение = РеализацияТоваровУслуг.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_РеализацииПоЗаказам.Распоряжение КАК ЗаказКлиента,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Номер КАК НомерСчета,
	|	ЗаказКлиента.Дата КАК ДатаСчета,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """") КАК НомерСФ,
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, """") КАК ДатаСФ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	// ++ 10.08.2021
	//|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_РеализацииПоЗаказам КАК ВТ_РеализацииПоЗаказам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеализацииПоЗаказам КАК ВТ_РеализацииПоЗаказам
	// --
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|			ПО (ВТ_РеализацииПоЗаказам.Распоряжение = ЗаказКлиента.Ссылка)
	|		ПО (ВТ_РеализацииПоЗаказам.Ссылка = СчетФактураВыданный.ДокументОснование)
	// ++ 10.08.2021
	|			И СчетФактураВыданный.Проведен
	// --
	|";
	
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СтатусОтгружен", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Строка = "СФ №" + Выборка.НомерСФ + " " + Формат(Выборка.ДатаСФ, "ДФ=dd.MM.yyyy") 
		+ " (Счет №" + Выборка.НомерСчета + " " + Формат(Выборка.ДатаСчета, "ДФ=dd.MM.yyyy") + ") " + СокрЛП(Выборка.Контрагент);
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;	
	
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;
	
КонецФункции //-- смарт:ММ 21.07.2021

//++ смарт:ММ 572 21.07.2021
&НаКлиенте
Процедура смарт_СкладПриИзмененииПосле(Элемент)
	
	смартНастроитьВидимостьРеестрОтгрузок();
	
КонецПроцедуры //-- смарт:ММ 21.07.2021

//++ смарт:ММ 572 21.07.2021
&НаСервере
Процедура смартНастроитьВидимостьРеестрОтгрузок()
	
    ВыбранСкладАдмирал = Ложь;
   //++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь); 
	//
	////++ смарт:Подкин #1121 04.08.2022 11:00:02
	//СкладАдмиралКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь);
	//Если Склад = СкладАдмирал ИЛИ Склад = СкладАдмиралКовчег Тогда        
	////-- смарт:Подкин #1121 04.08.2022 11:00:02
	//    
	//    ВыбранСкладАдмирал = Истина;
	//КонецЕсли;
	Если Склад.смартАвтоматическиФормироватьДокументы ТОгда
		ВыбранСкладАдмирал = Истина;	
	КонецЕсли;
	//-- #1353 смарт: Фролов 17.05.2023
    Элементы.смартРеестрОтгрузок.Видимость = ВыбранСкладАдмирал;
	
КонецПроцедуры //-- смарт:ММ 21.07.2021

//++ смарт:ММ 572 10.08.2021
&НаСервере
Процедура смарт_ПередЗагрузкойДанныхИзНастроекНаСервереПосле(Настройки)
	
	смартНастроитьВидимостьРеестрОтгрузок();
	
КонецПроцедуры //-- смарт:ММ 10.08.2021
