#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Процедура выполняет заполнение реквизитов предопределенных элементов.
//
Процедура ЗаполнитьПредопределенныеКатегорииРешений() Экспорт

СправочникОбъект = Справочники.CRM_КатегорииРешений.ТекущиеПроблемы.ПолучитьОбъект();
СправочникОбъект.ЦветИндекс			= 15;
СправочникОбъект.ЦветПредставление 	= НСтр("ru='Темно-красный';en='Dark red'");
СправочникОбъект.ЦветКрасный  		= 214;
СправочникОбъект.ЦветЗеленый  		= 36;
СправочникОбъект.ЦветСиний  		= 48;
СправочникОбъект.ПредставлениеНаименования = СокрЛП(СправочникОбъект.Наименование);
СправочникОбъект.Наименование = "#" + СправочникОбъект.ПредставлениеНаименования;
СправочникОбъект.Записать();

СправочникОбъект = Справочники.CRM_КатегорииРешений.ДополнительнаяИнформация.ПолучитьОбъект();
СправочникОбъект.ЦветИндекс			= 22;
СправочникОбъект.ЦветПредставление 	= НСтр("ru='Темно-синий';en='Dark Blue'");
СправочникОбъект.ЦветКрасный  		= 52;
СправочникОбъект.ЦветЗеленый  		= 103;
СправочникОбъект.ЦветСиний  		= 184;
СправочникОбъект.ПредставлениеНаименования = СокрЛП(СправочникОбъект.Наименование);
СправочникОбъект.Наименование = "#" + СправочникОбъект.ПредставлениеНаименования;
СправочникОбъект.Записать();

СправочникОбъект = Справочники.CRM_КатегорииРешений.РекомендуемаяИнформация.ПолучитьОбъект();
СправочникОбъект.ЦветИндекс			= 19;
СправочникОбъект.ЦветПредставление 	= НСтр("ru='Темно-зеленый';en='Dark green'");
СправочникОбъект.ЦветКрасный  		= 68;
СправочникОбъект.ЦветЗеленый  		= 166;
СправочникОбъект.ЦветСиний  		= 57;
СправочникОбъект.ПредставлениеНаименования = СокрЛП(СправочникОбъект.Наименование);
СправочникОбъект.Наименование = "#" + СправочникОбъект.ПредставлениеНаименования;
СправочникОбъект.Записать();

КонецПроцедуры // ЗаполнитьПредопределенныеКатегорииРешений()

#КонецОбласти

#КонецЕсли