#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Создает предопределенные действия.
//
// Параметры:
//	Параметры - Структура - параметры выполнения.
//
Процедура СоздатьПредопределенныеДействия(Параметры = Неопределено) Экспорт
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеПочта.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"CRM_","CRM_Модуль_")+"ТриггерПочтовойРассылки"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерПочтовойРассылки";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеСМС.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСМСРассылки"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерСМСРассылки";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 7;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеНапоминание.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерНапоминание"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерНапоминание";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 6;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗапретитьРедактированиеДокументаКоммерческоеПредложение.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ЗапретитьРедактированиеКП"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ЗапретитьРедактированиеКП";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.РассылкаПоСегменту.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерРассылкаПоСегменту"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерРассылкаПоСегменту";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗаявкаССайта.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗаявкаССайта"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерЗаявкаССайта";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СтартПроизвольногоБП.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗапускаБизнесПроцесса"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерЗапускаБизнесПроцесса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СозданиеЗаявкиНаОснованииПисьма.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗаявкаПоПисьму"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерЗаявкаПоПисьму";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОтказЗаписи.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерОтказЗаписи"));
	ОбработкаТриггера.НазваниеОбработки = "ОтказЗаписи";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ИзменениеСостоянияИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерИзменениеСостоянияИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ИзменениеСостоянияИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьЗадачуПоОбъекту.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьЗадачуПоОбъекту"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьЗадачуПоОбъекту";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьВзаимодействие.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьВзаимодействие"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьВзаимодействие";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 18;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ПересчетПотенциалаВИнтересе.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"CRM_ТриггерПересчетПотенциалаВИнтересе"));
	ОбработкаТриггера.НазваниеОбработки = "ПересчетПотенциалаВИнтересе";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ПроверитьНаличиеДокументов.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет("CRM_ТриггерПроверитьНаличиеДокументов"));
	ОбработкаТриггера.НазваниеОбработки = "ПроверитьНаличиеДокументов";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ИзменитьТемуИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет("CRM_ТриггерИзменитьТемуИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ИзменитьТемуИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ГенерацияИнтересаПоИнтересу.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет("CRM_ГенерацияИнтересаПоИнтересу"));
	ОбработкаТриггера.НазваниеОбработки = "ГенерацияИнтересаПоИнтересу";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ОбработкаТриггера = Справочники.CRM_ДействияТриггеров["CRM_Модуль_ПривязкаЗаказовКИнтересам"].ПолучитьОбъект();
		ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники["CRM_ДействияТриггеров"].ПолучитьМакет("CRM_Модуль_ПривязкаЗаказовКИнтересам"));
		ОбработкаТриггера.НазваниеОбработки = "ПривязкаЗаказовКИнтересам";
		ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
		ОбработкаТриггера.ИндексЦвета = 1;
		ОбработкаТриггера.Записать();
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - Переопределяет действия триггеров.
//
Процедура НовыеПредопределенныеДействияТриггеров() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДействияТриггеров.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ДействияТриггеров КАК CRM_ДействияТриггеров
	                      |ГДЕ
	                      |	НЕ CRM_ДействияТриггеров.Предопределенный");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДействиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДействиеОбъект.ИндексЦвета = 10;
			ДействиеОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеПочта.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеСМС.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 7;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеНапоминание.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 6;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗапретитьРедактированиеДокументаКоммерческоеПредложение.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.РассылкаПоСегменту.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗаявкаССайта.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СтартПроизвольногоБП.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СозданиеЗаявкиНаОснованииПисьма.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОтказЗаписи.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерОтказЗаписи"));
	ОбработкаТриггера.НазваниеОбработки = "ОтказЗаписи";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ИзменениеСостоянияИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерИзменениеСостоянияИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ИзменениеСостоянияИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьЗадачуПоОбъекту.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьЗадачуПоОбъекту"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьЗадачуПоОбъекту";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьВзаимодействие.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьВзаимодействие"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьВзаимодействие";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 18;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ПересчетПотенциалаВИнтересе.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"CRM_ТриггерПересчетПотенциалаВИнтересе"));
	ОбработкаТриггера.НазваниеОбработки = "ПересчетПотенциалаВИнтересе";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
КонецПроцедуры

// Функция - Возвращает массив исключаемых по ункциональным опциям предопределенных элементов справочника. 
// 
// Возвращаемое значение:
//  МассивИсключаемых -  Массив элементов справочника
//
Функция МассивИсключаемыхПоФОПредопределенных() Экспорт
	
	МассивИсключаемых = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("CRM_ИспользоватьБизнесПроцессы") ИЛИ CRM_ЛицензированиеЭкспортныеМетоды.ВариантПоставкиСТАРТ() Тогда
		МассивИсключаемых.Добавить(СтартПроизвольногоБП);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("CRM_ИспользоватьЗаявки") Тогда
		МассивИсключаемых.Добавить(СозданиеЗаявкиНаОснованииПисьма);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКоммерческиеПредложенияКлиентам") Тогда
		МассивИсключаемых.Добавить(ЗапретитьРедактированиеДокументаКоммерческоеПредложение);
	КонецЕсли;
	
	Возврат МассивИсключаемых;
	
КонецФункции

#КонецОбласти

#КонецЕсли
