#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
&ИзменениеИКонтроль("ЗаполнитьВариантОбеспечения")
Функция смарт_ЗаполнитьВариантОбеспечения(Объект, Форма, Операция, ДанныеЗаполнения, ПараметрыУказанияСерий)

	#Вставка
	//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
	ЖелаемаяДата = Объект.ЖелаемаяДатаПоступления - Объект.ДлительностьПеремещения * 86400; // 86400 - длительность суток.
	ДатаПоУмолчанию = Макс(НачалоДня(ТекущаяДатаСеанса()), ЖелаемаяДата);
	Добавлено = 0;
	
	ПараметрыОбновленияДатыОтгрузки = ОбеспечениеСервер.ПараметрыОбновленияДатыОтгрузкиВДокументе();
	ПараметрыОбновленияДатыОтгрузки.ОтгружатьОднойДатой    = Ложь;
	ПараметрыОбновленияДатыОтгрузки.ЖелаемаяДатаОтгрузки   = ЖелаемаяДата;
	
	ОбеспечениеСервер.СдвинутьДатыИСвернутьДублиСтрок(ДанныеЗаполнения, Операция, ПараметрыОбновленияДатыОтгрузки);
	
	Для Каждого СтрокаОбеспечения Из ДанныеЗаполнения Цикл

		Идентификатор = СтрокаОбеспечения.Идентификатор;
		Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
			СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
		ИначеЕсли Операция = "ИндексыСтрок" Тогда
			СтрокаТовары = Объект.Товары[Идентификатор + Добавлено];
		КонецЕсли;

		ТекСтрокаТовары = СтрокаТовары;

 		Если СтрокаОбеспечения.Отгружено = 0 Тогда
			ТекСтрокаТовары.НачалоОтгрузки = Макс(СтрокаОбеспечения.ДатаОтгрузки, ДатаПоУмолчанию);
			ТекСтрокаТовары.ОкончаниеПоступления = ТекСтрокаТовары.НачалоОтгрузки + Объект.ДлительностьПеремещения * 86400; //86400 - длительность суток
		КонецЕсли;

	КонецЦикла;
		
	ДанныеЗаполнения = смартОбщегоНазначения.смартЗаполнитьОбеспечениеСериямиПоFEFO(Объект, Форма, Операция, ДанныеЗаполнения, ПараметрыУказанияСерий);
	//--#1547 смарт: Лопато 20.11.2023
	#КонецВставки
	
	ЭтоВыборОбеспеченияСУчетомСерий = Операция = "СтрокаТовары"
		И ПолучитьФункциональнуюОпцию("ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения");
	СтруктураДействий = Новый Структура;
	Если Форма <> Неопределено Тогда
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Ложь, Истина));
	КонецЕсли;
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы("КоличествоУпаковок");

	ЖелаемаяДата = Объект.ЖелаемаяДатаПоступления - Объект.ДлительностьПеремещения * 86400; // 86400 - длительность суток.
	ДатаПоУмолчанию = Макс(НачалоДня(ТекущаяДатаСеанса()), ЖелаемаяДата);

	ДлительностьПеремещенияСекунды = Объект.ДлительностьПеремещения * 86400;
	ТекСтрокаТовары = Неопределено;
	Идентификатор   = Неопределено;
	СтарыеЗначения = ОбеспечениеКлиентСервер.КлючОбеспечения();
	НовыеЗначения  = ОбеспечениеКлиентСервер.КлючОбеспечения();
	Счетчик = 0;
	Добавлено = 0;
	
	ПараметрыОбновленияДатыОтгрузки = ОбеспечениеСервер.ПараметрыОбновленияДатыОтгрузкиВДокументе();
	ПараметрыОбновленияДатыОтгрузки.ОтгружатьОднойДатой    = Ложь;
	ПараметрыОбновленияДатыОтгрузки.ЖелаемаяДатаОтгрузки   = ЖелаемаяДата;
	
	ОбеспечениеСервер.СдвинутьДатыИСвернутьДублиСтрок(ДанныеЗаполнения, Операция, ПараметрыОбновленияДатыОтгрузки);
	
	Для Каждого СтрокаОбеспечения Из ДанныеЗаполнения Цикл

		// Выбор существующей, либо добавление новой строки.
		Если Идентификатор <> СтрокаОбеспечения.Идентификатор Тогда

			Идентификатор = СтрокаОбеспечения.Идентификатор;
			Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
				СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
			ИначеЕсли Операция = "ИндексыСтрок" Тогда
				СтрокаТовары = Объект.Товары[Идентификатор + Добавлено];
			КонецЕсли;
			ТекСтрокаТовары = СтрокаТовары;
			ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммы(СтруктураПересчетаСуммы);
			ОбработкаТабличнойЧастиКлиентСервер.ЗаполнитьСтруктуруПересчетаСуммы(СтруктураПересчетаСуммы, ТекСтрокаТовары);

		Иначе
			ТекСтрокаТовары = Объект.Товары.Вставить(Объект.Товары.Индекс(ТекСтрокаТовары) + 1);
			ЗаполнитьЗначенияСвойств(ТекСтрокаТовары, СтрокаТовары);
			ТекСтрокаТовары.КодСтроки = 0;
			Добавлено = Добавлено + 1;
		КонецЕсли;

		// Заполнение полей обеспечения.
		ЗаполнитьЗначенияСвойств(СтарыеЗначения, ТекСтрокаТовары);
		СтарыеЗначения.ДатаОтгрузки = ТекСтрокаТовары.НачалоОтгрузки;
		
		ЗаполнитьЗначенияСвойств(ТекСтрокаТовары, СтрокаОбеспечения, "Количество, ВариантОбеспечения");
		#Удаление
		Если ЭтоВыборОбеспеченияСУчетомСерий Тогда
	    #КонецУдаления
		#Вставка
		//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
		//++#1815 смарт: Лопато 13.05.2024 //Проблема со сбросом серийных номеров при изменении обеспечения  
		Если ТекСтрокаТовары.СтатусУказанияСерий <> 0
			И НЕ (Форма = Неопределено И Операция = "ИндексыСтрок")
			И смартОбщегоНазначения.смартДействуетОсобыйУчетСерий(ТекСтрокаТовары.Номенклатура) Тогда
		//--#1815 смарт: Лопато 13.05.2024
		//--#1547 смарт: Лопато 20.11.2023
	    #КонецВставки
			ТекСтрокаТовары.Серия = СтрокаОбеспечения.Серия;
		КонецЕсли;

		Если СтрокаОбеспечения.Отгружено = 0 Тогда
			ТекСтрокаТовары.НачалоОтгрузки = Макс(СтрокаОбеспечения.ДатаОтгрузки, ДатаПоУмолчанию);
			ТекСтрокаТовары.ОкончаниеПоступления = ТекСтрокаТовары.НачалоОтгрузки + Объект.ДлительностьПеремещения * 86400; //86400 - длительность суток
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НовыеЗначения, ТекСтрокаТовары);
		НовыеЗначения.ДатаОтгрузки = ТекСтрокаТовары.НачалоОтгрузки;
		ОбеспечениеКлиентСервер.СчетИзменений(Счетчик, СтарыеЗначения, НовыеЗначения);

		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекСтрокаТовары, СтруктураДействий, КэшированныеЗначения);
		ОбработкаТабличнойЧастиКлиентСервер.ДобавитьСтрокуДляПересчетаСуммы(СтруктураПересчетаСуммы, ТекСтрокаТовары);

	КонецЦикла;
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммы(СтруктураПересчетаСуммы);

	Если ПараметрыУказанияСерий = Неопределено Тогда
		ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказНаПеремещение));
	КонецЕсли;
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

	Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;

	Возврат ОбеспечениеКлиентСервер.ТекстОбработаноСтрок(Счетчик);
	
КонецФункции

//++#1547 смарт: Лопато 26.01.2024 //Автоматическое заполнение серий чернил в заказах
&ИзменениеИКонтроль("ПараметрыУказанияСерий")
Функция смарт_ПараметрыУказанияСерий(Объект)

	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();

	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаПеремещение";
	ПараметрыУказанияСерий.ИмяТЧСерии = "Товары";

	ПараметрыСерийСкладаОтправитель = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.СкладОтправитель, Ложь);

	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПараметрыСерийСкладаОтправитель.ИспользоватьСерииНоменклатуры; 
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСкладаОтправитель.УчитыватьСебестоимостьПоСериям;

	ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению);

	ПараметрыУказанияСерий.ИмяПоляСклад = "СкладОтправитель";
	ПараметрыУказанияСерий.ИмяПоляСкладОтправитель = "СкладОтправитель";
	ПараметрыУказанияСерий.ИмяПоляСкладПолучатель  = "СкладПолучатель";
	ПараметрыУказанияСерий.ПланированиеОтгрузки = Истина;
	ПараметрыУказанияСерий.ЭтоЗаказ = Истина;
	ПараметрыУказанияСерий.РегистрироватьСерии = Ложь;

	ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");

	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	#Вставка
	//++#1547 смарт: Лопато 26.01.2024 //Автоматическое заполнение серий чернил в заказах
	ПараметрыУказанияСерий.ИменаПолейДополнительные.Добавить("НачалоОтгрузки");
	//--#1547 смарт: Лопато 26.01.2024
	#КонецВставки
	
	Возврат ПараметрыУказанияСерий;

КонецФункции

//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
&ИзменениеИКонтроль("ДобавитьКомандыСозданияНаОсновании")
Процедура смарт_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	
	Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	
	Документы.КорректировкаНазначенияТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОснованииЗаказа(КомандыСозданияНаОсновании);
	
	Документы.РасходныйОрдерНаТовары.ДобавитьКомандуСоздатьНаОснованииРасходныйОрдерНаТовары(КомандыСозданияНаОсновании);
	
	Документы.ПоручениеЭкспедитору.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.УпаковочныйЛист.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	СервисДоставкиПереопределяемый.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	// Конец ЭлектронноеВзаимодействие.СервисДоставки

	#Вставка
	//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
	Задачи.ЗадачаИсполнителя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//-- #1989 смарт: Лопато 15.08.2024
	
	//++ #6996 смарт: Тимофеева 20.07.2026 / Создавать заказ на внутреннее потребление из заказа на перемещение
	Документы.ЗаказНаВнутреннееПотребление.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//-- #6996 смарт: Тимофеева 20.07.2026
	#КонецВставки
	
КонецПроцедуры

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
&ИзменениеИКонтроль("ИнициализироватьДанныеДокумента")
Процедура смарт_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры)

	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаЗаказыНаПеремещение(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаГрафикОтгрузкиТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	смартТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	// Исполнение запроса и выгрузка полученных таблиц для движений.
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);

КонецПроцедуры

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
&ИзменениеИКонтроль("ЗаполнитьПараметрыИнициализации")
Процедура смарт_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата                    КАК Период,
	|	ДанныеШапки.СкладОтправитель        КАК СкладОтправитель,
	|	ДанныеШапки.СкладПолучатель         КАК СкладПолучатель,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеШапки.СкладОтправитель)    КАК СкладОтправительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеШапки.СкладПолучатель)     КАК СкладПолучательПредставление,
	|	ДанныеШапки.Назначение              КАК Назначение,
	|	ЕСТЬNULL(ДанныеШапки.Назначение.ДвиженияПоСкладскимРегистрам,Ложь) КАК ДвиженияПоСкладскимРегистрам,
	|	ДанныеШапки.Статус                  КАК Статус,
	|	ДанныеШапки.Организация             КАК Организация,
	|	ДанныеШапки.ХозяйственнаяОперация   КАК ХозяйственнаяОперация,
	|	ДанныеШапки.Подразделение           КАК Подразделение,
	|	ДанныеШапки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеШапки.Номер                   КАК Номер,
	|	ДанныеШапки.Ответственный           КАК Ответственный,
	|	ДанныеШапки.Комментарий             КАК Комментарий,
	|	ДанныеШапки.Проведен                КАК Проведен,
	|	ДанныеШапки.ПометкаУдаления         КАК ПометкаУдаления,
	|	ДанныеШапки.ОбосабливатьПоНазначениюЗаказа КАК ОбосабливатьПоНазначениюЗаказа,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами)
	|			ТОГДА ДанныеШапки.ОрганизацияПолучатель
	|		ИНАЧЕ ДанныеШапки.Организация
	|	КОНЕЦ КАК ОрганизацияПолучатель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И ДанныеШапки.Дата >= ДанныеШапки.СкладОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                               КАК ОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
	|				И ДанныеШапки.Дата >= ДанныеШапки.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                               КАК ОрдернаяСхемаПриПоступлении,
	|	ДанныеШапки.ВариантПриемкиТоваров   КАК ВариантПриемкиТоваров
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();

	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(Реквизиты.ВариантПриемкиТоваров);

	Запрос.УстановитьПараметр("НакладнаяЯвляетсяРаспоряжением", НакладнаяЯвляетсяРаспоряжением);
	Запрос.УстановитьПараметр("НомерНаПечать",                  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",        ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокументСсылка)));

	ИнформацияПоСкладуОтправителю = "";
	Если ЗначениеЗаполнено(Реквизиты.СкладОтправитель) Тогда
		ШаблонСтроки = НСтр("ru='Перемещение с ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ИнформацияПоСкладуОтправителю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, Реквизиты.СкладОтправительПредставление);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИнформацияПоСкладуОтправителю", ИнформацияПоСкладуОтправителю);
	ИнформацияПоСкладуПолучателю = "";
	Если ЗначениеЗаполнено(Реквизиты.СкладПолучатель) Тогда
		ШаблонСтроки = НСтр("ru='Перемещение на ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ИнформацияПоСкладуПолучателю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, Реквизиты.СкладПолучательПредставление);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИнформацияПоСкладуПолучателю", ИнформацияПоСкладуПолучателю);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	смартСборкаРазборкаОборудованияСервер.ДополнитьПараметрыИнициализацииПроведения(ДокументСсылка, Запрос);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
КонецПроцедуры

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
&ИзменениеИКонтроль("ТекстЗапросаТаблицаЗаказыНаПеремещение")
Функция смарт_ТекстЗапросаТаблицаЗаказыНаПеремещение(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ЗаказыНаПеремещение";

	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 	КАК ВидДвижения,
	|	НачалоПериода(&Период, День) 			КАК Период,
	|	ТаблицаТовары.Ссылка         			КАК ЗаказНаПеремещение,
	|	ТаблицаТовары.Номенклатура   			КАК Номенклатура,
	|	ТаблицаТовары.Характеристика 			КАК Характеристика,
	|	ТаблицаТовары.Серия          			КАК Серия,
	|	ТаблицаТовары.КодСтроки      			КАК КодСтроки,
	|	0                            			КАК КОформлению,
	|	ТаблицаТовары.Количество     			КАК Заказано
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка 
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
	
	//смарт:rnp 366 14.12.2020
	|	И  (НЕ ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется) И НЕ ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется))
	//--

	//-- #1670 смарт: Мосолов 14.03.2024   
	#КонецВставки
	
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 	КАК ВидДвижения,
	|	ТаблицаТовары.НачалоОтгрузки 			КАК Период,
	|	ТаблицаТовары.Ссылка        			КАК ЗаказНаПеремещение,
	|	ТаблицаТовары.Номенклатура   			КАК Номенклатура,
	|	ТаблицаТовары.Характеристика 			КАК Характеристика,
	|	ТаблицаТовары.Серия          			КАК Серия,
	|	ТаблицаТовары.КодСтроки      			КАК КодСтроки,
	|	ТаблицаТовары.Количество     			КАК КОформлению,
	|	0                            			КАК Заказано
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И (НЕ ТаблицаТовары.Отменено)
	|	И ТаблицаТовары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.Закрыт))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Ссылка                   КАК ЗаказНаПеремещение,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|	ТаблицаТовары.КодСтроки                КАК КодСтроки,
	|	0                                      КАК КОформлению,
	|	-ТаблицаТовары.Количество              КАК Заказано
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Отменено
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 07.10.2021 10:44:34 задача 650
	|   И (НЕ ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется) И НЕ ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется))
	//Смарт }Подкин Алексей Иванович 07.10.2021 10:44:34

	//-- #1670 смарт: Мосолов 14.03.2024   
	#КонецВставки
	
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции //-- #1670 смарт: Мосолов 14.03.2024

//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
&ИзменениеИКонтроль("ТекстЗапросаТаблицаДвижениеТоваров")
Функция смарт_ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ДвижениеТоваров";

	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки            КАК НомерСтроки,
	|	ТаблицаТовары.ОкончаниеПоступления   КАК Период,
	|	ТаблицаТовары.Ссылка                 КАК Распоряжение,
	|	&СкладПолучатель                     КАК Склад,
	|	ТаблицаТовары.Номенклатура           КАК Номенклатура,
	|	ТаблицаТовары.Характеристика         КАК Характеристика,
	|	ТаблицаТовары.Назначение             КАК Назначение,
	|
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|			ТаблицаТовары.Количество
	|		КОНЕЦ                            КАК ПланируемоеПоступление,
	|
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|			ТаблицаТовары.Количество
	|		КОНЕЦ                            КАК ПланируемоеПоступлениеПодЗаказ,
	|
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|			ТаблицаТовары.Количество
	|		КОНЕЦ                            КАК ПланируемоеПоступлениеСНеподтвержденными,
	|
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|			ТаблицаТовары.Количество
	|		КОНЕЦ                            КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными,
	|	ЛОЖЬ                                 КАК Корректировка,
	|	ДАТАВРЕМЯ(1,1,1)                     КАК ДатаРаспоряжения
	|
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.Отменено
	
	#Вставка
	//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение  
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 07.10.2021 10:57:32 задача 650
	|	И (НЕ ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется) И НЕ ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется))
	//Смарт }Подкин Алексей Иванович 07.10.2021 10:57:32
	
	//-- #1670 смарт: Мосолов 14.03.2024
	#КонецВставки
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции //-- #1670 смарт: Мосолов 14.03.2024

#КонецОбласти

#Область ДоработкиСмарт

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
Функция смартТекстЗапросаТаблицаОборудованиеКРазборке(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "смартОборудованиеКРазборке";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период 						КАК Период,
	|	&ЗаявкаНаРазборкуОборудования 	КАК Заявка,
	|	ДокументТовары.Номенклатура 	КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ДокументТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		ТОГДА &Серия
	|		ИНАЧЕ ДокументТовары.Серия
	|	КОНЕЦ 							КАК Серия,
	|	&НазначениеЗаявкаНаРазборку		КАК Назначение,
	|	&СкладОтправитель 				КАК Склад,
	|	&СкладПолучатель 				КАК СкладПолучатель,
	|	ДокументТовары.Количество 		КАК КПеремещениюЗаказано	
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ДокументТовары
	|ГДЕ
	|	&ЭтоРазборкаОборудования
	|	И ДокументТовары.Ссылка = &Ссылка
	|	И ДокументТовары.Ссылка.смартЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)";
			
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

//++ смарт:kornushenko 625 08.09.2021	
//++ #1353 смарт: Фролов 24.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
//Функция смартСформироватьТабличныйДокументЗаявкаНаМашину(МассивЗаказовКлиентов, ИмяФайла = "", РасширениеФайла = "xlsx") Экспорт
Функция смартСформироватьТабличныйДокументЗаявкаНаМашину(МассивЗаказовКлиентов, ИмяФайла = "", РасширениеФайла = "xlsx",СкладАдмирал) Экспорт
//-- #1353 смарт: Фролов 24.05.2023


	РезультатТабДок = Неопределено;
	
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаМашину");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаданиеНаПеревозку.Номер КАК Номер,
	|	ЗаданиеНаПеревозку.СкладПолучатель.Наименование КАК Контрагент,
	|	ЗаданиеНаПеревозку.Организация.Наименование КАК Организация,
	|	ЗаданиеНаПеревозку.ПеревозчикПартнер КАК Перевозчик,
	|	ЗаданиеНаПеревозку.смартВидТранспорта КАК Марка,
	|	ЗаданиеНаПеревозку.СпособДоставки КАК СпособДоставки,
	|	ЗаданиеНаПеревозку.смартВидТранспорта КАК ВидТранспорта,
	|	ЗаданиеНаПеревозку.смартНомерМашины КАК НомерМашины,
	|	ЗаданиеНаПеревозку.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаданиеНаПеревозку.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаданиеНаПеревозку.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаданиеНаПеревозку.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	//++ #1228 смарт: Фролов 25.11.2022 //Заказ клиента Раздел Доставка - доработать 
	|	ЗаданиеНаПеревозку.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаданиеНаПеревозку.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаданиеНаПеревозку.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя,
	//-- #1228 смарт: Фролов 25.11.2022
	|	ЗаданиеНаПеревозку.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	|	ЗаданиеНаПеревозку.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка В(&ЗаказКлиента)";



	Запрос.УстановитьПараметр("ЗаказКлиента", 		МассивЗаказовКлиентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭтоПервый = Истина;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	МаркаАвто = "";
	ДатаОтгрузки = "";
		
	Пока Выборка.Следующий() Цикл
				
		
		смартЖелаемоеВремяОтгрузки = Выборка.смартЖелаемоеВремяОтгрузки;
		ДатаВремя = Формат(Выборка.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		
		Если ЗначениеЗаполнено(смартЖелаемоеВремяОтгрузки) Тогда
			ДатаВремя = ДатаВремя + " " + Формат(смартЖелаемоеВремяОтгрузки, "ДФ=HH:mm");	
		КонецЕсли;
		
		Если ЭтоПервый Тогда

			ОбластьШапка.Параметры.ДатаОтгрузки = Формат(Выборка.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
			ОбластьШапка.Параметры.ДеньНедели 	= ВРег(Сред(формат(Выборка.ЖелаемаяДатаОтгрузки,"ДФ=дддд"),1,1)) + Сред(формат(Выборка.ЖелаемаяДатаОтгрузки,"ДФ=дддд"),2,СтрДлина(формат(Выборка.ЖелаемаяДатаОтгрузки,"ДФ=дддд"))+1);
			//++ #1353 смарт: Фролов 24.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
			ОбластьШапка.Параметры.АдресСклада = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(СкладАдмирал, "", Выборка.ЖелаемаяДатаОтгрузки);
			//-- #1353 смарт: Фролов 24.05.2023
			ТабДок.Вывести(ОбластьШапка);
		
		КонецЕсли;
		
		ЭтоПервый = Ложь;
		МаркаАвто = Выборка.Марка;
		ДатаОтгрузки = Выборка.ЖелаемаяДатаОтгрузки;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.ДатаВремя 	= ДатаВремя;
		Если Выборка.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособДоставкиТовара.смартСамовывозСоСкладаАдмирал") Тогда
			ОбластьСтрока.Параметры.Контрагент 	= Выборка.Контрагент;
			ОбластьСтрока.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
		Иначе
			Если Выборка.Перевозчик = справочники.Партнеры.ПустаяСсылка() Тогда
				ОбластьСтрока.Параметры.Контрагент 	= Выборка.Организация; 
			Иначе //перевозчик
				ОбластьСтрока.Параметры.Контрагент 	= Выборка.Перевозчик;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.ВидТранспорта = Выборка.Марка;
		КонецЕсли;
		ОбластьСтрока.Параметры.НомерЗаказа 	= Выборка.Номер;
		ОбластьСтрока.Параметры.НомерМашины 	= Выборка.НомерМашины;
		ОбластьСтрока.Параметры.ФИОВодителя 	= Выборка.ФИОВодителя;
		
		Если ЗначениеЗаполнено(Выборка.смартДатаВыдачиПаспортаВодителя) Тогда
			ОбластьСтрока.Параметры.Паспорт = Выборка.смартНомерСерияПаспортВодителя + " выдан: " + Формат(Выборка.смартДатаВыдачиПаспортаВодителя, "ДФ=dd.MM.yyyy");
		Иначе
			ОбластьСтрока.Параметры.Паспорт = Выборка.смартНомерСерияПаспортВодителя;
		КонецЕсли; 
		//++ #1228 смарт: Фролов 25.11.2022 //Заказ клиента Раздел Доставка - доработать  
		Если ЗначениеЗаполнено(Выборка.смартФИОВторогоВодителя) Тогда
			ОбластьСтрока.Параметры.ФИОВодителя=ОбластьСтрока.Параметры.ФИОВодителя+Символы.ПС+Выборка.смартФИОВторогоВодителя;	
		КонецЕсли;	                                                                                                         
		Если ЗначениеЗаполнено(Выборка.смартДатаВыдачиПаспортаВторогоВодителя) ТОгда
			ОбластьСтрока.Параметры.Паспорт=ОбластьСтрока.Параметры.Паспорт+Символы.ПС+Выборка.смартНомерСерияПаспортВторогоВодителя + " выдан: " + Формат(Выборка.смартДатаВыдачиПаспортаВторогоВодителя, "ДФ=dd.MM.yyyy");		
		Иначе
			ОбластьСтрока.Параметры.Паспорт=ОбластьСтрока.Параметры.Паспорт+Символы.ПС+Выборка.смартНомерСерияПаспортВторогоВодителя;
		КонецЕсли;	
		//-- #1228 смарт: Фролов 25.11.2022
		
		ОбластьСтрока.Параметры.КолПаллет = 1;
		
		ТабДок.Вывести(ОбластьСтрока);

		ЕстьДанные = Истина;
	КонецЦикла;	
			
	Если ЕстьДанные Тогда
		ИмяФайла = "Заявка на машину_" + МаркаАвто + " " + Формат(ДатаОтгрузки, "ДФ=dd.MM.yyyy") + "." + РасширениеФайла;
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //-- смарт:kornushenko 625 08.09.2021	

//++ смарт:kornushenko 625 08.09.2021
//++ смарт:ММ 698 02.11.2021 
//Функция смартСформироватьXMLПоЗаявкаНаОтгрузкуНаСервере(ЗаказыКлиентов, ИмяФайла) Экспорт
Функция смартСформироватьXMLПоЗаявкаНаОтгрузкуНаСервере(ЗаказыКлиентов, ИмяФайла, ПолучательАдмирал = Ложь, СсылкаНаобъект=Неопределено) Экспорт
//-- смарт:ММ 02.11.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//++ смарт:ММ 634 12.09.2021
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаданиеНаПеревозку.Ссылка.Номер КАК Номер,
	//|	ЗаданиеНаПеревозку.Ссылка.СкладПолучатель.Наименование КАК Контрагент,
	//|	ЗаданиеНаПеревозку.Ссылка.Организация.Наименование КАК Организация,
	//|	ЗаданиеНаПеревозку.Ссылка.ПеревозчикПартнер КАК Перевозчик,
	//|	ЗаданиеНаПеревозку.Ссылка.смартВидТранспорта КАК Марка,
	//|	ЗаданиеНаПеревозку.Ссылка.СпособДоставки КАК СпособДоставки,
	//|	ЗаданиеНаПеревозку.Ссылка.смартНомерМашины КАК ТранспортноеСредство,
	//|	ЗаданиеНаПеревозку.Ссылка.смартВидТранспорта КАК ВидТранспорта,
	//|	ЗаданиеНаПеревозку.Ссылка.смартНомерМашины КАК НомерМашины,
	//|	ЗаданиеНаПеревозку.Ссылка.смартНомерПрицепа КАК смартНомерПрицепа,
	//|	ЗаданиеНаПеревозку.Ссылка.смартФИОВодителя КАК ФИОВодителя,
	//|	ЗаданиеНаПеревозку.Ссылка.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	//|	ЗаданиеНаПеревозку.Ссылка.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	//|	ЗаданиеНаПеревозку.Ссылка.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	//|	ЗаданиеНаПеревозку.Ссылка.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	//|	ЗаданиеНаПеревозку.Номенклатура.Наименование КАК НоменклатураНаименование,
	//|	ЗаданиеНаПеревозку.Номенклатура.Артикул КАК НоменклатураАртикул,
	//|	ЗаданиеНаПеревозку.Номенклатура КАК Номенклатура,
	//|	ЗаданиеНаПеревозку.Ссылка КАК ЗаказКлиента,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.Серия) КАК Серия,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.Характеристика) КАК Характеристика,
	//|	ЗаданиеНаПеревозку.КоличествоУпаковок КАК КоличествоУпаковок,
	//|	ЗаданиеНаПеревозку.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	//|	ЗаданиеНаПеревозку.Ссылка.АдресДоставки КАК АдресДоставки
	//|ИЗ
	//|	Документ.ЗаказНаПеремещение.Товары КАК ЗаданиеНаПеревозку
	//|ГДЕ
	//|	ЗаданиеНаПеревозку.Ссылка В (&ЗаказКлиента)
	//|	И ЗаданиеНаПеревозку.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)";
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Номер КАК Номер,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).СкладПолучатель.Наименование КАК Контрагент,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).Организация.Наименование КАК Организация,
	//++смарт:rnp 691 24.10.2021
	//|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).ПеревозчикПартнер КАК Перевозчик,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).Организация.Наименование КАК Перевозчик,
	//--смарт:rnp 691 24.10.2021
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартВидТранспорта КАК Марка,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).СпособДоставки КАК СпособДоставки,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартНомерМашины КАК ТранспортноеСредство,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартВидТранспорта КАК ВидТранспорта,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартНомерМашины КАК НомерМашины,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартНомерПрицепа КАК смартНомерПрицепа,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартФИОВодителя КАК ФИОВодителя,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	//++ #1228 смарт: Фролов 25.11.2022 //Заказ клиента Раздел Доставка - доработать 
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя,
	//-- #1228 смарт: Фролов 25.11.2022
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Код КАК НоменклатураКод,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ЗаказКлиента,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,	
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.АдресДоставки КАК АдресДоставки	
	|ИЗ
	//++ смарт:ММ 663 02.10.2021 
	//|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, Склад = &СкладАдмирал И ДокументОтгрузки В(&ЗаказКлиента)) КАК ТоварыКОтгрузкеОстатки	
	//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &СкладАдмирал И ДокументОтгрузки В(&ЗаказКлиента)) КАК ТоварыКОтгрузкеОстатки  
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.смартАвтоматическиФормироватьДокументы И ДокументОтгрузки В(&ЗаказКлиента)) КАК ТоварыКОтгрузкеОстатки
    //-- #1353 смарт: Фролов 17.05.2023
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки
	//-- смарт:ММ 02.10.2021
	|";
	//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь);  
	//
	////++ смарт:Подкин #1121 04.08.2022 10:53:03
	//СкладАдмиралКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмиралКовчег", Ложь);  
	//Если СсылкаНаобъект.Организация.ИНН = "7722457913" Тогда
	//   СкладАдмирал = СкладАдмиралКовчег;
	//КонецЕсли;
	////-- смарт:Подкин #1121 04.08.2022 10:53:03
	//
	//Запрос.УстановитьПараметр("СкладАдмирал", СкладАдмирал);
	//-- #1353 смарт: Фролов 17.05.2023

	//++ смарт:ММ 663 02.10.2021 
	//Запрос.УстановитьПараметр("Период", ТекущаяДата());
	//-- смарт:ММ 02.10.2021
	//-- смарт:ММ 12.09.2021
	
	Запрос.УстановитьПараметр("ЗаказКлиента", 		ЗаказыКлиентов);
	
	//++ смарт:ММ 698 03.11.2021 
	Если ПолучательАдмирал Тогда
		//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Склад = &СкладАдмирал", "Получатель = &СкладАдмирал");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Склад.смартАвтоматическиФормироватьДокументы", "Получатель.смартАвтоматическиФормироватьДокументы");
		//-- #1353 смарт: Фролов 17.05.2023
	КонецЕсли;
	//-- смарт:ММ 03.11.2021
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Автомобиль");
	//++ смарт:ММ 706 11.11.2021
	ТЗ.Колонки.Добавить("Trip");
	//-- смарт:ММ 11.11.2021
	ТЗ.Колонки.Добавить("Avto_Num");
	ТЗ.Колонки.Добавить("Avto_Num_Trailer");
	ТЗ.Колонки.Добавить("Avto_Model");
	ТЗ.Колонки.Добавить("Data");
	ТЗ.Колонки.Добавить("Date_Plan");
	ТЗ.Колонки.Добавить("Driver");
	ТЗ.Колонки.Добавить("Driver_Pasport");
	ТЗ.Колонки.Добавить("Driver_Phone");
	
	ТЗ.Колонки.Добавить("Provider");
	ТЗ.Колонки.Добавить("Client");
	ТЗ.Колонки.Добавить("Shipment");
	ТЗ.Колонки.Добавить("Delivery");
	ТЗ.Колонки.Добавить("Adres");
	ТЗ.Колонки.Добавить("Id_Adr");
	ТЗ.Колонки.Добавить("March_num");
	ТЗ.Колонки.Добавить("Delivery_Type");
	//++ смарт:ММ 636 12.09.2021
	ТЗ.Колонки.Добавить("Code_Prod");
	//-- смарт:ММ 12.09.2021
	ТЗ.Колонки.Добавить("Id_Prod");
	ТЗ.Колонки.Добавить("Name");
	ТЗ.Колонки.Добавить("Serial_Number");
	ТЗ.Колонки.Добавить("Quan_Pallet");
	ТЗ.Колонки.Добавить("Date_partii");
	ТЗ.Колонки.Добавить("Lable");
	ТЗ.Колонки.Добавить("Quan");
	ТЗ.Колонки.Добавить("QuanSTUOM");
	//++ смарт:ММ 636 16.09.2021 
	ТЗ.Колонки.Добавить("QuanST");
	//-- смарт:ММ 16.09.2021

	//++ смарт:ММ 698 03.11.2021 - ругалось 
	ТЗ.Колонки.Добавить("Driver2");
	ТЗ.Колонки.Добавить("Driver2_Pasport");
	ТЗ.Колонки.Добавить("Driver2_Phone");
	//-- смарт:ММ 03.11.2021
	
	ВыгрузкаВыборкаАвто = Запрос.Выполнить().Выгрузить();
	СписокАвто = Новый ТаблицаЗначений;
	СписокАвто.Колонки.Добавить("Автомобиль");
	//++ смарт:ММ 706 11.11.2021
	СписокАвто.Колонки.Добавить("Trip");
	//-- смарт:ММ 11.11.2021
	СписокАвто.Колонки.Добавить("Avto_Num");
	СписокАвто.Колонки.Добавить("Avto_Num_Trailer");
	СписокАвто.Колонки.Добавить("Avto_Model");
	СписокАвто.Колонки.Добавить("Data");
	СписокАвто.Колонки.Добавить("Date_Plan");
	СписокАвто.Колонки.Добавить("Driver");
	СписокАвто.Колонки.Добавить("Driver_Pasport");
	СписокАвто.Колонки.Добавить("Driver_Phone");
	//++ смарт:ММ 698 03.11.2021 - ругалось 
	СписокАвто.Колонки.Добавить("Driver2");
	СписокАвто.Колонки.Добавить("Driver2_Pasport");
	СписокАвто.Колонки.Добавить("Driver2_Phone");
	//-- смарт:ММ 03.11.2021

	//++ смарт:ММ 706 11.11.2021 
	Trip = "";
	//-- смарт:ММ 11.11.2021

	Для каждого ВыборкаАвто из ВыгрузкаВыборкаАвто Цикл
		Если Не ЗначениеЗаполнено(ВыборкаАвто.КоличествоУпаковок) Тогда Продолжить КонецЕсли; //++смарт: rnp 11.10.2021
		смартЖелаемоеВремяОтгрузки = ВыборкаАвто.смартЖелаемоеВремяОтгрузки;

		ДатаВремя = Формат(ВыборкаАвто.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		
		Если ЗначениеЗаполнено(смартЖелаемоеВремяОтгрузки) Тогда
			ДатаВремя = ДатаВремя + " " + Формат(смартЖелаемоеВремяОтгрузки, "ДФ=HH:mm");	
		КонецЕсли;
		
		аа = ТЗ.Добавить();
		аа.Автомобиль = СокрЛП(ВыборкаАвто.ТранспортноеСредство);
		//++ смарт:ММ 706 11.11.2021
		Trip = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаАвто.Номер, Истина, Истина);
		аа.Trip = Trip;
		//-- смарт:ММ 11.11.2021
		аа.Avto_Num = СокрЛП(ВыборкаАвто.НомерМашины);
		аа.Avto_Num_Trailer = СокрЛП(ВыборкаАвто.смартНомерПрицепа);
		аа.Avto_Model = СокрЛП(ВыборкаАвто.Марка);
		аа.Data = Формат(ВыборкаАвто.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		аа.Date_Plan = ДатаВремя;
		аа.Driver = СокрЛП(ВыборкаАвто.ФИОВодителя);
		Если ЗначениеЗаполнено(ВыборкаАвто.смартДатаВыдачиПаспортаВодителя) Тогда
			аа.Driver_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВодителя + " выдан: " + Формат(ВыборкаАвто.смартДатаВыдачиПаспортаВодителя, "ДФ=dd.MM.yyyy"));
		Иначе
			аа.Driver_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВодителя);
		КонецЕсли;

		аа.Driver_Phone = "";
		//++ #1228 смарт: Фролов 25.11.2022 //Заказ клиента Раздел Доставка - доработать
		//++ смарт:rnp 674 24.10.2021 
		//аа.Driver2 = "";
		//аа.Driver2_Pasport = "";
		//аа.Driver2_Phone = ""; 
		//-- смарт:rnp 24.10.2021 
		аа.Driver2 = СокрЛП(ВыборкаАвто.смартФИОВторогоВодителя);
		Если ЗначениеЗаполнено(ВыборкаАвто.смартДатаВыдачиПаспортаВторогоВодителя) Тогда
			аа.Driver2_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВторогоВодителя + " выдан: " + Формат(ВыборкаАвто.смартДатаВыдачиПаспортаВторогоВодителя, "ДФ=dd.MM.yyyy"));
		Иначе
			аа.Driver2_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВторогоВодителя);
		КонецЕсли;
		аа.Driver2_Phone = ""; 
		//-- #Задача смарт: Фролов 25.11.2022
		Отбор = Новый Структура();
		Отбор.Вставить("Автомобиль",аа.Автомобиль);
		//++ смарт:ММ 706 11.11.2021
		Отбор.Вставить("Trip", аа.Trip);
		//-- смарт:ММ 11.11.2021
		Отбор.Вставить("Avto_Num",аа.Avto_Num);
		Отбор.Вставить("Avto_Num_Trailer",аа.Avto_Num_Trailer);
		Отбор.Вставить("Avto_Model",аа.Avto_Model);
		Отбор.Вставить("Data",аа.Data);
		Отбор.Вставить("Date_Plan",аа.Date_Plan);
		Отбор.Вставить("Driver",аа.Driver);
		Отбор.Вставить("Driver_Pasport",аа.Driver_Pasport);
		Нашел = СписокАвто.НайтиСтроки(Отбор);
		Если Нашел.Количество() = 0 Тогда
			СтрокаСписокАвто = СписокАвто.Добавить();
			СтрокаСписокАвто.Автомобиль=аа.Автомобиль;
			//++ смарт:ММ 706 11.11.2021
			СтрокаСписокАвто.Trip = аа.Trip;
			//-- смарт:ММ 11.11.2021
			СтрокаСписокАвто.Avto_Num= аа.Avto_Num;
			СтрокаСписокАвто.Avto_Num_Trailer=аа.Avto_Num_Trailer;
			СтрокаСписокАвто.Avto_Model=аа.Avto_Model;
			СтрокаСписокАвто.Data= аа.Data;
			СтрокаСписокАвто.Date_Plan=аа.Date_Plan;
			СтрокаСписокАвто.Driver= аа.Driver;
			СтрокаСписокАвто.Driver_Pasport= аа.Driver_Pasport;
			СтрокаСписокАвто.Driver_Phone ="";
			//++ смарт:rnp 674 24.10.2021 
			СтрокаСписокАвто.Driver2			= аа.Driver2;
			СтрокаСписокАвто.Driver2_Pasport	= аа.Driver2_Pasport;
			СтрокаСписокАвто.Driver2_Phone 		= аа.Driver2_Phone;
			//-- смарт:rnp 24.10.2021
		КонецЕсли;

			Серия = ВыборкаАвто.Серия;
			Если ЗначениеЗаполнено(Серия) Тогда
				Если Найти(Серия, "до") > 0 Тогда
					Серия = Сред(Серия, 1, Найти(Серия, "до") - 1);
				КонецЕсли;	
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаАвто.Характеристика) Тогда
				Серия =  Строка(Серия) + " " + Строка(ВыборкаАвто.Характеристика)
			КонецЕсли;
			Серия=СокрЛП(Серия);
			//++смарт:rnp 691 24.10.2021 закомментировано
			//Если ВыборкаАвто.Перевозчик = справочники.Партнеры.ПустаяСсылка() Тогда
				Перевозчик 	= СокрЛП(ВыборкаАвто.Организация); 
			//Иначе //перевозчик
			//	Перевозчик 	= СокрЛП(ВыборкаАвто.Перевозчик);
			//КонецЕсли;
			//--смарт:rnp 691 24.10.2021
			аа.Provider = Перевозчик;
			аа.Client = СокрЛП(ВыборкаАвто.Контрагент);
			аа.Shipment = СокрЛП(ВыборкаАвто.Номер);
			аа.Delivery = СокрЛП(ВыборкаАвто.ЗаказКлиента);
			аа.Adres = СокрЛП(ВыборкаАвто.АдресДоставки);
			аа.Id_Adr = "";
			аа.March_num = "";
			//++ смарт:ММ 698 02.11.2021 
			Если ПолучательАдмирал Тогда
				аа.Delivery_Type = "Priemka";
			Иначе
			//-- смарт:ММ 02.11.2021
			аа.Delivery_Type = "Otgruzka";
			//++ смарт:ММ 698 02.11.2021 
			КонецЕсли;
			//-- смарт:ММ 02.11.2021
			
			//++ смарт:ММ 636 12.09.2021
			//++ смарт:ММ 667 06.10.2021 
			//аа.Code_Prod = СокрЛП(ВыборкаАвто.НоменклатураКод); //"xxxxxxxx";
			НоменклатураКод = смартОбщегоНазначения.ОбработатьКодНоменклатуры(ВыборкаАвто.НоменклатураКод);
			аа.Code_Prod = НоменклатураКод; 
			//-- смарт:ММ 06.10.2021
			//-- смарт:ММ 12.09.2021		
			//++ смарт:ММ 706 11.11.2021 
			//аа.Id_Prod = СокрЛП(ВыборкаАвто.НоменклатураАртикул);
			//аа.Name = СокрЛП(Лев(ВыборкаАвто.НоменклатураНаименование,255));
			Id_Prod = СтроковыеФункции.СтрокаЛатиницей(СокрЛП(ВыборкаАвто.НоменклатураАртикул));
			аа.Id_Prod = Id_Prod;		

			Name = СтрЗаменить(СокрЛП(Лев(ВыборкаАвто.НоменклатураНаименование,255)), """", "");
			аа.Name = Name;                        
			//-- смарт:ММ 11.11.2021
			аа.Serial_Number = Серия;
			аа.Quan_Pallet = "1";
			аа.Date_partii = "";
			//++ смарт:ММ 636 12.09.2021
			//аа.Lable = СокрЛП(Лев(ВыборкаАвто.Номенклатура.Описание,255));
			аа.Lable = "этикетка";
			//-- смарт:ММ 16.09.2021
			//аа.Quan = "1";//смарт: rnp 11.10.2021 закомментировано
			аа.Quan 	 = Формат(ВыборкаАвто.КоличествоУпаковок,"ЧДЦ=3; ЧГ=0");//++смарт: rnp 11.10.2021
			аа.QuanSTUOM = СокрЛП(ВыборкаАвто.НоменклатураЕдиницаИзмерения);
			//++ смарт:ММ 636 16.09.2021
			аа.QuanST = "";
			//++смарт: rnp 11.10.2021
			ЭтоНоменклатураВПогонныхМетрах = ВыборкаАвто.Номенклатура.ВидНоменклатуры = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ВидНоменклатурыТоварРулоныХарактеристики", Ложь);
			//--смарт: rnp 11.10.2021
			Если ЗначениеЗаполнено(ВыборкаАвто.Характеристика)  
				//++смарт: rnp 11.10.2021
				И ЭтоНоменклатураВПогонныхМетрах  Тогда
				//++смарт:rnp 691 24.10.2021
				//аа.QuanST 			= Формат(ВыборкаАвто.КоличествоУпаковок,"ЧДЦ=3; ЧГ=0");//здесь будут погонные метры
				аа.QuanST = Строка(ВыборкаАвто.Характеристика);
				аа.Serial_Number = "";
				//--смарт:rnp 691 24.10.2021
				аа.QuanSTUOM 		= СокрЛП("рул");
				Намотка = Число(ВыборкаАвто.Характеристика);
				аа.Quan 			= Формат(ВыборкаАвто.КоличествоУпаковок/Намотка,"ЧДЦ=3; ЧГ=0");//здесь будет количество рулонов !!! Деление на ноль не обрабатываем, чтобы если возникнет ошибка, сразу сообщили.
				//--смарт: rnp 11.10.2021
			КонецЕсли;
			//аа.QuanST = СокрЛП(QuanST); //смарт: rnp 11.10.2021 закомментировано
			//-- смарт:ММ 16.09.2021
	КонецЦикла;
		
	ПолныйФайл =КаталогВременныхФайлов()+"\"+ИмяФайла;
	ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.ОткрытьФайл(ПолныйФайл,"windows-1251");
    ЗаписьXML.ЗаписатьОбъявлениеXML();    
    ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery_export");
	
	Для каждого Стр Из СписокАвто Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("Автомобиль",Стр.Автомобиль);
		//++ смарт:ММ 706 11.11.2021
		Отбор.Вставить("Trip", Стр.Trip);
		//-- смарт:ММ 11.11.2021
		Отбор.Вставить("Avto_Num",Стр.Avto_Num);
		Отбор.Вставить("Avto_Num_Trailer",Стр.Avto_Num_Trailer);
		Отбор.Вставить("Avto_Model",Стр.Avto_Model);
		Отбор.Вставить("Data",Стр.Data);
		Отбор.Вставить("Date_Plan",Стр.Date_Plan);
		Отбор.Вставить("Driver",Стр.Driver);
		Отбор.Вставить("Driver_Pasport",Стр.Driver_Pasport);
		//++ смарт:ММ 706 11.11.2021 
		Отбор.Вставить("Driver2",			Стр.Driver2);
		Отбор.Вставить("Driver2_Pasport",	Стр.Driver2_Pasport);
		//-- смарт:ММ 11.11.2021
		
		Нашел2 = ТЗ.НайтиСтроки(Отбор);
		
		Если Нашел2.Количество() > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery");
			//++ смарт:ММ 706 11.11.2021
			ЗаписьXML.ЗаписатьАтрибут("Trip", Стр.Trip);
			//-- смарт:ММ 11.11.2021
			ЗаписьXML.ЗаписатьАтрибут("Avto_Num", Стр.Avto_Num);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Num_Trailer", Стр.Avto_Num_Trailer);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Model", Стр.Avto_Model);
			ЗаписьXML.ЗаписатьАтрибут("Data", Стр.Data);
			ЗаписьXML.ЗаписатьАтрибут("Date_Plan", Стр.Date_Plan);
			ЗаписьXML.ЗаписатьАтрибут("Driver", Стр.Driver);
			ЗаписьXML.ЗаписатьАтрибут("Driver_Pasport", Стр.Driver_Pasport);
			ЗаписьXML.ЗаписатьАтрибут("Driver_Phone", Стр.Driver_Phone);			
			//++ смарт:ММ 706 11.11.2021 
			ЗаписьXML.ЗаписатьАтрибут("Driver2", 			Стр.Driver2);
			ЗаписьXML.ЗаписатьАтрибут("Driver2_Pasport", 	Стр.Driver2_Pasport);
			ЗаписьXML.ЗаписатьАтрибут("Driver2_Phone", 		Стр.Driver2_Phone);
			//-- смарт:ММ 11.11.2021
			
			Для каждого Стр2 Из Нашел2 Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery_detail");
				ЗаписьXML.ЗаписатьАтрибут("Provider", Стр2.Provider);
				ЗаписьXML.ЗаписатьАтрибут("Client", Стр2.Client);
				ЗаписьXML.ЗаписатьАтрибут("Shipment", Стр2.Shipment);
				ЗаписьXML.ЗаписатьАтрибут("Delivery", Стр2.Delivery);
				ЗаписьXML.ЗаписатьАтрибут("Adres", Стр2.Adres);
				ЗаписьXML.ЗаписатьАтрибут("Id_Adr", Стр2.Id_Adr);
				ЗаписьXML.ЗаписатьАтрибут("March_num", Стр2.March_num);
				ЗаписьXML.ЗаписатьАтрибут("Delivery_Type", Стр2.Delivery_Type);
				//++ смарт:ММ 636 12.09.2021
				ЗаписьXML.ЗаписатьАтрибут("Code_Prod", Стр2.Code_Prod);
				//-- смарт:ММ 12.09.2021
				ЗаписьXML.ЗаписатьАтрибут("Id_Prod", Стр2.Id_Prod);
				ЗаписьXML.ЗаписатьАтрибут("Name", Стр2.Name);
				ЗаписьXML.ЗаписатьАтрибут("Serial_Number", Стр2.Serial_Number);
				ЗаписьXML.ЗаписатьАтрибут("Quan_Pallet", Стр2.Quan_Pallet);
				ЗаписьXML.ЗаписатьАтрибут("Date_partii", Стр2.Date_partii);
				ЗаписьXML.ЗаписатьАтрибут("Lable", Стр2.Lable);
				ЗаписьXML.ЗаписатьАтрибут("Quan", Стр2.Quan);
				ЗаписьXML.ЗаписатьАтрибут("QuanSTUOM", Стр2.QuanSTUOM);
				//++ смарт:ММ 636 16.09.2021 
				ЗаписьXML.ЗаписатьАтрибут("QuanST", Стр2.QuanST);
				//-- смарт:ММ 16.09.2021
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery_detail
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery_export
    ЗаписьXML.Закрыть();

	Двоичное=Новый ДвоичныеДанные(ПолныйФайл);
	Адрес=ПоместитьВоВременноеХранилище(Двоичное,Новый УникальныйИдентификатор);
	Возврат Адрес
КонецФункции //-- смарт:kornushenko 625 08.09.2021

//++ смарт:kornushenko 625 08.09.2021
//++ смарт:ММ 698 02.11.2021 
//Функция смартСформироватьТабличныйДокументТранспортнаяНакладная(ЗаказКлиента, Реализация) Экспорт
Функция смартСформироватьТабличныйДокументТранспортнаяНакладная(ЗаказКлиента, Реализация, ПолучательАдмирал = Ложь) Экспорт
//-- смарт:ММ 02.11.2021
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
	
	//++ смарт:ММ 698 02.11.2021 
	//ДанныеДляПечати = смартПолучитьДанныеДляПечатнойФормыТранспортнаяНакладнаяПоЗаказуНаПеремещение(ЗаказКлиента, Реализация);
	ДанныеДляПечати = смартПолучитьДанныеДляПечатнойФормыТранспортнаяНакладнаяПоЗаказуНаПеремещение(ЗаказКлиента, Реализация, ПолучательАдмирал);
	//-- смарт:ММ 02.11.2021
	ОбъектыПечати = Новый СписокЗначений;
	КомплектыПечати = Неопределено;
	
	Обработки.ПечатьТранспортнойНакладной.ЗаполнитьТабличныйДокументТН(
			ТабДок,
			ДанныеДляПечати,
			ОбъектыПечати,
			КомплектыПечати, Истина);
	
	Возврат ТабДок;
	
КонецФункции //-- смарт:kornushenko 625 08.09.2021

//++ смарт:kornushenko 625 08.09.2021
//++ смарт:ММ 698 02.11.2021 
//Функция смартПолучитьДанныеДляПечатнойФормыТранспортнаяНакладнаяПоЗаказуНаПеремещение(ЗаказКлиента, Реализация)
Функция смартПолучитьДанныеДляПечатнойФормыТранспортнаяНакладнаяПоЗаказуНаПеремещение(ЗаказКлиента, Реализация, ПолучательАдмирал = Ложь)
//-- смарт:ММ 02.11.2021
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаСсылка.Ссылка КАК Ссылка,
	|	ЗаказКлиентаСсылка.Номер КАК ЗаказКлиентаНомер,
	|	ЗаказКлиентаСсылка.Дата КАК ЗаказКлиентаДата,
	|	Реализация.Номер КАК Номер,
	|	ЗаказКлиентаСсылка.Дата КАК Дата,
	|	ЗаказКлиентаСсылка.Организация КАК Организация,
	|	ЗаказКлиентаСсылка.Организация КАК Грузополучатель,
	|	ЗаказКлиентаСсылка.Организация КАК Грузоотправитель,
	|	ЗаказКлиентаСсылка.Организация КАК ЗаказчикПеревозки,
	|	"""" КАК БанковскийСчетЗаказчикаПеревозки,
	|	"""" КАК Кладовщик,
	|	"""" КАК ДолжностьКладовщика,
	|	"""" КАК Плательщик,
	|	"""" КАК БанковскийСчетПлательщика,
	|	"""" КАК Перевозчик,
	|	ЗаказКлиентаСсылка.смартФИОВодителя КАК Водитель,
	|	ЗаказКлиентаСсылка.смартВидТранспорта КАК МаркаАвтомобиля,
	|	ЗаказКлиентаСсылка.смартНомерМашины КАК ГосНомерАвтомобиля,
	|	ЕСТЬNULL(СкладыКонтактнаяОтправитель.Представление, """") КАК ПунктПогрузки,
	|	ЕСТЬNULL(СкладыКонтактнаяПолучатель.Представление, """") КАК ПунктРазгрузки,
	|	НЕОПРЕДЕЛЕНО КАК СрокДоставки,
	|	0 КАК ГрузоподъемностьВТоннахАвтомобиля,
	|	0 КАК ВместимостьВКубическихМетрахАвтомобиля,
	|	ЗаказКлиентаСсылка.смартВидТранспорта КАК ТипАвтомобиля,
	|	0 КАК МассаБрутто,
	|	1 КАК ПорядковыйНомер,
	|	ЛОЖЬ КАК ЕстьНепроведенныеДокументыОснования
	//++ смарт:ММ 698 03.11.2021
	|	, ЗаказКлиентаСсылка.СкладПолучатель КАК СкладПолучатель,
	|	ЗаказКлиентаСсылка.СкладОтправитель КАК СкладОтправитель
	//-- смарт:ММ 03.11.2021
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ЗаказКлиентаСсылка
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК Реализация
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяПолучатель
	|		ПО ЗаказКлиентаСсылка.СкладПолучатель = СкладыКонтактнаяПолучатель.Ссылка
	//++ смарт:ММ 698 03.11.2021 
	|			И (СкладыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	//-- смарт:ММ 03.11.2021
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель	
	//++ смарт:ММ 698 03.11.2021 
	//|		ПО ЗаказКлиентаСсылка.СкладОтправитель = СкладыКонтактнаяПолучатель.Ссылка
	//|		И (СкладыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ПО ЗаказКлиентаСсылка.СкладОтправитель = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	//-- смарт:ММ 03.11.2021
	|ГДЕ
	|	ЗаказКлиентаСсылка.Ссылка В (&ЗаказКлиента)
	|	И Реализация.Ссылка = &Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ЗаказКлиента КАК Ссылка,
	|	1 КАК ПорядковыйНомер,
	|	&НаименованиеДляПечатиВидовНоменклатуры КАК НаименованиеВидаНоменклатуры";

	
	Запрос.УстановитьПараметр("Реализация", 	Реализация);
	Запрос.УстановитьПараметр("ЗаказКлиента", 	ЗаказКлиента);
	Запрос.УстановитьПараметр("НаименованиеДляПечатиВидовНоменклатуры", Константы.НаименованиеДляПечатиВидовНоменклатуры.Получить());

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТаблицаРезультата", РезультатЗапроса[0].Выгрузить());
	СтруктураРезультата.Вставить("РезультатИменаТоваров", РезультатЗапроса[1]);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураРезультата

КонецФункции //-- смарт:kornushenko 625 08.09.2021

//++ смарт:kornushenko 625 08.09.2021
//++ смарт:ММ 698 03.11.2021 
//Функция смартСформироватьТабличныйДокументЗаявкаНаОтгрузку(ДокСсылка, ИмяФайла) Экспорт
Функция смартСформироватьТабличныйДокументЗаявкаНаОтгрузку(ДокСсылка, ИмяФайла, ПолучательАдмирал = Ложь) Экспорт
//-- смарт:ММ 03.11.2021
	
	Если Не ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		возврат "Заявка на отгрузку формируется из Бух базы";
	КонецЕсли;
	РасширениеФайла = "xlsx";
	РезультатТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаПеревозку.смартЗаявкаНаОтгрузку");
	
	//++ смарт:ММ 698 03.11.2021
	Если ПолучательАдмирал Тогда
		НазваниеДокумента = НСтр("ru = 'Заявка на приемку'");
	Иначе
	//-- смарт:ММ 03.11.2021
	НазваниеДокумента = НСтр("ru = 'Заявка на отгрузку'");
	//++ смарт:ММ 698 03.11.2021 
	КонецЕсли;
	//-- смарт:ММ 03.11.2021

	ОбластьЗаголовка = Макет.ПолучитьОбласть("ЗаголовокПеремещение");	
	ОбластьЗаголовка.Параметры.ТекстЗаголовка = НазваниеДокумента; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПеремещение.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Организации.НаименованиеСокращенное <> """"
	|			ТОГДА Организации.НаименованиеСокращенное
	|		ИНАЧЕ Организации.Наименование
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказНаПеремещение.СкладОтправитель) КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказНаПеремещение.СкладПолучатель) КАК Контрагент
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗаказНаПеремещение.Организация = Организации.Ссылка
	|ГДЕ
	|	ЗаказНаПеремещение.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();

	ВыборкаШапка.Следующий();
	
	ОрганизацияНаименование = ВыборкаШапка.ОрганизацияНаименование;
	СкладОтправитель = ВыборкаШапка.Склад;
	СкладПолучатель = ВыборкаШапка.Контрагент;
	
	ОбластьЗаголовка.Параметры.ОрганизацияПредставление = СокрЛП(ОрганизацияНаименование);
	ОбластьЗаголовка.Параметры.ОтправительПредставление = СокрЛП(СкладОтправитель);
	ОбластьЗаголовка.Параметры.ПолучательПредставление = СокрЛП(СкладПолучатель);
	
	РезультатТабДок.Вывести(ОбластьЗаголовка);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//++ смарт:ММ 634 14.09.2021
	//"ВЫБРАТЬ
	//|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель.Наименование КАК Контрагент,
	//|	ЗаказНаПеремещениеТовары.Ссылка.Организация.Наименование КАК Организация,
	//|   ЗаказНаПеремещениеТовары.Номенклатура.Наименование КАК Наименование,
	//|   ЗаказНаПеремещениеТовары.Номенклатура.Артикул КАК Артикул,
	//|   ПРЕДСТАВЛЕНИЕ(ЗаказНаПеремещениеТовары.Серия) КАК Серия,
	//|   ПРЕДСТАВЛЕНИЕ(ЗаказНаПеремещениеТовары.Характеристика) КАК Характеристика,
	//|   ЗаказНаПеремещениеТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	//|   ПРЕДСТАВЛЕНИЕ(ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	//|ИЗ
	//|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	//|ГДЕ
	//| 	ЗаказНаПеремещениеТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)  И  ЗаказНаПеремещениеТовары.Ссылка = &Ссылка
	//|";
	"ВЫБРАТЬ
	//|	ТоварыКОтгрузкеОстатки.Склад.Наименование КАК Контрагент,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).СкладПолучатель.Наименование КАК Контрагент,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).Организация КАК Организация,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Наименование КАК Наименование,
	//++ смарт:ММ 706 09.11.2021
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Код КАК Код,
	//-- смарт:ММ 09.11.2021
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Характеристика) КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			&Период,
	//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
	//|			Склад = &СкладАдмирал
	|			Склад.смартАвтоматическиФормироватьДокументы 
	//-- #1353 смарт: Фролов 17.05.2023
	|				И ДокументОтгрузки = &Ссылка) КАК ТоварыКОтгрузкеОстатки";
	
	//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
	//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь); 
	//
	////++ смарт:Подкин # 05.08.2022 9:20:31  
	//СкладАдмиралКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмиралКовчег", Ложь); 
	//Если ДокСсылка.Организация.ИНН="7722457913" Тогда
	//    СкладАдмирал = СкладАдмиралКовчег;	
	//КонецЕсли;
	////-- смарт:Подкин # 05.08.2022 9:20:31   
	//
	//Запрос.УстановитьПараметр("СкладАдмирал", СкладАдмирал);
	//-- #1353 смарт: Фролов 17.05.2023
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	//-- смарт:ММ 14.09.2021 
	
	//++ смарт:ММ 698 03.11.2021 
	Если ПолучательАдмирал Тогда
		//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Склад = &СкладАдмирал", "Получатель = &СкладАдмирал");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Склад.смартАвтоматическиФормироватьДокументы", "Получатель.смартАвтоматическиФормироватьДокументы");
		//-- #1353 смарт: Фролов 17.05.2023
	КонецЕсли;
	//-- смарт:ММ 03.11.2021
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);		     	
	ТЗ_УТ = Запрос.Выполнить().Выгрузить();
		
	ЕстьДанные = Ложь;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатТабДок.Вывести(ОбластьШапкаТаблицы);
	
    НомерЗаказа = "";
    ДатаЗаказа = "";
    НомерСтроки = 0;
    ИтогКоличествоУп=0;

	Для Каждого ВыборкаТЧ Из ТЗ_УТ Цикл
								
		Серия = ВыборкаТЧ.Серия;
		Если ЗначениеЗаполнено(Серия) Тогда
			Если Найти(Серия, "до") > 0 Тогда
				Серия = Сред(Серия, 1, Найти(Серия, "до") - 1);
			КонецЕсли;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаТЧ.Характеристика) Тогда
			Серия =  Строка(Серия) + " " + Строка(ВыборкаТЧ.Характеристика)
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Товар 		= ВыборкаТЧ.Наименование;
		//++ смарт:ММ 706 09.11.2021
		ОбластьСтрока.Параметры.Код 		= ВыборкаТЧ.Код;
		//-- смарт:ММ 09.11.2021
		//++ смарт:ММ 706 10.11.2021 
		//ОбластьСтрока.Параметры.Артикул 	= ВыборкаТЧ.Артикул;
		Артикул = СтрЗаменить(ВыборкаТЧ.Артикул, " ", "");
		ОбластьСтрока.Параметры.Артикул 	= Артикул;
		//-- смарт:ММ 10.11.2021
        
        //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 19.11.2021 20:29:16 задача 715
        ОбластьСтрока.Параметры.АртикулEN 	= СтроковыеФункции.СтрокаЛатиницей(Артикул);
        //Смарт }Подкин Алексей Иванович 19.11.2021 20:29:16
        
		ОбластьСтрока.Параметры.Серия 		= Серия;
		
		ОбластьСтрока.Параметры.КоличествоУпаковок = ВыборкаТЧ.КоличествоУпаковок;
        
        //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2021 9:06:08 задача 715
        ИтогКоличествоУп=ИтогКоличествоУп+ВыборкаТЧ.КоличествоУпаковок;
        //Смарт }Подкин Алексей Иванович 01.12.2021 9:06:08

		ОбластьСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаТЧ.ЕдиницаИзмерения;
		
		ОбластьСтрока.Параметры.ПредставлениеБазовойЕдиницыИзмерения = "паллет";
		
		РезультатТабДок.Вывести(ОбластьСтрока);

		ЕстьДанные = Истина;

	КонецЦикла;
	
	//++ смарт:ММ 698 03.11.2021 
	Если ПолучательАдмирал Тогда
		ИмяФайла = "Заявка на приемку по заказу на перемещение №" + ДокСсылка.Номер + ".xlsx";
	Иначе
	//-- смарт:ММ 03.11.2021
	ИмяФайла = "Заявка на отгрузку по заказу на перемещение №" + ДокСсылка.Номер + ".xlsx";
	//++ смарт:ММ 698 03.11.2021 
	КонецЕсли;
	//-- смарт:ММ 03.11.2021
	
	ПредставлениеЗаказа = "Заказ на перемещение " + ДокСсылка.Номер + " от " + Формат(ДокСсылка.Дата, "ДФ='dd MMMM yyyy ""г""'");
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2021 9:06:43 задача 715
    Если ИтогКоличествоУп>0 Тогда
        ОбластьПодвал.Параметры.ИтогКоличествоУП = ИтогКоличествоУп;    
    КонецЕсли; 
    //Смарт }Подкин Алексей Иванович 01.12.2021 9:06:43

	РезультатТабДок.Вывести(ОбластьПодвал);

	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьПодписи.Параметры.ФИОМенеджер = "Нечипоренко В.В.";
	РезультатТабДок.Вывести(ОбластьПодписи);
	
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	ОбластьКомментарий.Параметры.Документы = ПредставлениеЗаказа;
	РезультатТабДок.Вывести(ОбластьКомментарий);
	
	РезультатТабДок.ОтображатьСетку = Ложь;
	РезультатТабДок.АвтоМасштаб = Истина;
	
	Если ЕстьДанные Тогда		
		Возврат РезультатТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции //-- смарт:kornushenko 625 08.09.2021

#КонецОбласти

#КонецЕсли 
