
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыбранныеПользователи = ?(Параметры.Свойство("ВыбранныеПользователи"),
		 Параметры.ВыбранныеПользователи,
		 Новый СписокЗначений);
	УстановитьПривилегированныйРежим(Истина);
	ТекущийПользовательСВ = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	ПользователиСВ = СистемаВзаимодействия.ПолучитьПользователей();
	Для каждого Пользователь из ПользователиСВ Цикл
		Если Пользователь.Идентификатор = ТекущийПользовательСВ ИЛИ Пользователь.Имя = "httpService" Тогда
			Продолжить;
		КонецЕсли;
		НайденныйПользователь = ВыбранныеПользователи.НайтиПоЗначению(Пользователь.Идентификатор);
		Пометка = ?(НайденныйПользователь = Неопределено, Ложь, Истина);
		
		СписокПользователейСВ.Добавить(Пользователь.Идентификатор, Пользователь.Имя, Пометка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	ВыбранныеПользователи = Новый СписокЗначений;
	Для каждого ПользовательСВ из СписокПользователейСВ Цикл
		Если ПользовательСВ.Пометка Тогда
			ВыбранныеПользователи.Добавить(ПользовательСВ.Значение, ПользовательСВ.Представление);
		КонецЕсли;
	КонецЦикла;
	Закрыть(ВыбранныеПользователи);
КонецПроцедуры

#КонецОбласти
