//#4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
//#4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2

#Область ПрограммныйИнтерфейс

Процедура КонтрольДебиторскойЗадолженности() Экспорт 
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.смартСозданиеПоступленийТоваровНаСклад);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         НСтр("ru = 'Начат контроль дебиторской задолженности (смарт).'"));
							 
	Если НЕ ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаНачалаКонтроляДебиторскойЗадолженности.Значение)
		ИЛИ ТекущаяДатаСеанса() < Справочники.смартПредопределенныеЗначения.ДатаНачалаКонтроляДебиторскойЗадолженности.Значение Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         НСтр("ru = 'Контроль дебиторской задолженности не включен.'"));
		Возврат;
	КонецЕсли;
						 
	МассивОшибок = Новый Массив;						 
	ОбработатьЗакрытиеЗадолженности(МассивОшибок);
	Если МассивОшибок.Количество() > 0 Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Ошибка, , ,
	                         СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
						 
	//++ #7590 смарт: Тимофеева 30.07.2026 / Отмененные заказы попадают в стоп-лист по просроченной дебиторке
	МассивОшибок = Новый Массив;						 
	ОбработатьОтмененныеОтгрузки(МассивОшибок);
	Если МассивОшибок.Количество() > 0 Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Ошибка, , ,
	                         СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
	//-- #7590 смарт: Тимофеева 30.07.2026
	
	МассивОшибок.Очистить();
	ОбработатьПросроченныеЗадолженности(МассивОшибок);
	Если МассивОшибок.Количество() > 0 Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Ошибка, , ,
	                         СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
						 
	МассивОшибок.Очистить();
	ОбработатьОтгрузкиСОтсрочкойПлатежа(МассивОшибок);
	Если МассивОшибок.Количество() > 0 Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Ошибка, , ,
	                         СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         НСтр("ru = 'Закончен контроль дебиторской задолженности (смарт).'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьЗапретОтгрузки(Партнер, ДатаДокумента, Отказ) Экспорт
	
	Если НЕ ВедетсяКонтрольДебиторскойЗадолженности(ДатаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru='Клиенту ""%Партнер%"" запрещены запись и проведение документа ""Реализация товаров и услуг"".'");
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Партнер%", Партнер);
	
	Если Партнер.Клиент Тогда
		СостояниеПоТехническойОтсрочке = РегистрыСведений.смартСтопЛистТехническойОтсрочки.СостояниеПоТехническойОтсрочке(Партнер); 
		
		Если СостояниеПоТехническойОтсрочке.ПродажаОтгрузкаЗапрещена
			И СостояниеПоТехническойОтсрочке.ДатаЗапрета <= ДатаДокумента Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				,
				"Объект.Партнер",
				,
				Отказ);
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверитьСуммуКредитаПоСроку(Договор, КоличествоДнейОтсрочки, ДатаАктуальности, Отказ) Экспорт
	ПограничныйСрокКредита 		= Справочники.смартПредопределенныеЗначения.ГраницаПоСрокуКредита.Значение;
	ПограничнаяСуммаДоговора 	= Справочники.смартПредопределенныеЗначения.ГраницаПоСуммеКредита.Значение;
	
	ПограничныйСрокКредита 		= ?(ЗначениеЗаполнено(ПограничныйСрокКредита), ПограничныйСрокКредита, 15);
	ПограничнаяСуммаДоговора 	= ?(ЗначениеЗаполнено(ПограничнаяСуммаДоговора), ПограничнаяСуммаДоговора, 300000);
	
	РеквизитыДоговора 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ДопустимаяСуммаЗадолженности, ВалютаВзаиморасчетов");
	ВалютаРеглУчета 			= Константы.ВалютаРегламентированногоУчета.Получить();
	Если РеквизитыДоговора.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
		СуммаКредитаДоговора = РеквизитыДоговора.ДопустимаяСуммаЗадолженности;
	Иначе
		СуммаКредитаДоговора = РаботаСКурсамиВалют.ПересчитатьВВалюту(РеквизитыДоговора.ДопустимаяСуммаЗадолженности, 
																		РеквизитыДоговора.ВалютаВзаиморасчетов, 
																		ВалютаРеглУчета, 
																		ДатаАктуальности);  
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru='Сумма кредита в договоре %СуммаКредитаДоговора% %ВалютаВзаиморасчетов% не соответствует сроку кредита.'");
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаКредитаДоговора%", РеквизитыДоговора.ДопустимаяСуммаЗадолженности);
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВалютаВзаиморасчетов%", РеквизитыДоговора.ВалютаВзаиморасчетов);
    
	Если КоличествоДнейОтсрочки < ПограничныйСрокКредита 
		И СуммаКредитаДоговора > ПограничнаяСуммаДоговора
		Тогда
		
		ТекстОшибкиУточнение = НСтр("ru='Установлена отсрочка менее %ПограничныйСрокКредита% дней.'");
		ТекстОшибкиУточнение = СтрЗаменить(ТекстОшибкиУточнение, "%ПограничныйСрокКредита%", ПограничныйСрокКредита);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + " " + ТекстОшибкиУточнение,
				,
				"Объект.ЭтапыГрафикаОплаты",
				,
				Отказ);        
				
	ИначеЕсли КоличествоДнейОтсрочки >= ПограничныйСрокКредита 
		И СуммаКредитаДоговора <= ПограничнаяСуммаДоговора
		Тогда
		
		ТекстОшибкиУточнение = НСтр("ru='Установлена отсрочка более %ПограничныйСрокКредита% дней.'");
		ТекстОшибкиУточнение = СтрЗаменить(ТекстОшибкиУточнение, "%ПограничныйСрокКредита%", ПограничныйСрокКредита - 1);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + " " + ТекстОшибкиУточнение,
				,
				"Объект.ЭтапыГрафикаОплаты",
				,
				Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЛимитКредита(СтруктураЗаказа, Отказ) Экспорт
	
	РеквизитыДоговора 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураЗаказа.Договор, "Номер, Дата, ДопустимаяСуммаЗадолженности");
	СуммаКредитаДоговора = РеквизитыДоговора.ДопустимаяСуммаЗадолженности;	

	ТекстОшибки = НСтр("ru='По договору %НомерДоговора% от %ДатаДоговора% превышена допустимая сумма кредита на %СуммаПревышения% руб. Запись не выполнена. Заказ клиента %НомерЗаказа% от %ДатаЗаказа%'");
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерДоговора%", РеквизитыДоговора.Номер);
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаДоговора%", Формат(РеквизитыДоговора.Дата, "ДФ=dd.MM.yyyy"));
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерЗаказа%", СтруктураЗаказа.Номер);
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаЗаказа%", Формат(СтруктураЗаказа.Дата, "ДФ=dd.MM.yyyy"));
	
	//++ #7696 смарт: Тимофеева 31.07.2026 / Контроль дебиторской задолженности. Корректировка алгоритма учета кредитного лимита.
	//Если СтруктураЗаказа.СуммаДокумента + СуммаПоЗаказамПоДоговору(СтруктураЗаказа.Договор, СтруктураЗаказа.Ссылка) > СуммаКредитаДоговора Тогда
	//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаПревышения%", Формат(СтруктураЗаказа.СуммаДокумента + СуммаПоЗаказамПоДоговору(СтруктураЗаказа.Договор, СтруктураЗаказа.Ссылка) - СуммаКредитаДоговора, "ЧДЦ=2"));
	Если СтруктураЗаказа.СуммаДокумента + СуммаПоЗаказамПоДоговору(СтруктураЗаказа.Договор, СтруктураЗаказа.Ссылка) - СуммаОплатПоЗаказу(СтруктураЗаказа.Ссылка) > СуммаКредитаДоговора Тогда
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаПревышения%", Формат(СтруктураЗаказа.СуммаДокумента + СуммаПоЗаказамПоДоговору(СтруктураЗаказа.Договор, СтруктураЗаказа.Ссылка) - СуммаОплатПоЗаказу(СтруктураЗаказа.Ссылка) - СуммаКредитаДоговора, "ЧДЦ=2"));
	    //-- #7696 смарт: Тимофеева 31.07.2026
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				,
				,
				,
				Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПросроченныеПлатежиПоДоговору(СтруктураЗаказа, Отказ) Экспорт
	
	РеквизитыДоговора 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураЗаказа.Договор, "Номер, Дата");
	ТекстОшибки = НСтр("ru='По договору %НомерДоговора% от %ДатаДоговора% есть реализация с просроченной датой планового платежа %РеализацияСсылка% (%КоличествоДнейПросрочки% дней просрочки)'");
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерДоговора%", РеквизитыДоговора.Номер);
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаДоговора%", Формат(РеквизитыДоговора.Дата, "ДФ=dd.MM.yyyy"));
	
	МассивПросрочек = ПолучитьМассивНакладныхСПросроченнойОплатой(СтруктураЗаказа.Договор, СтруктураЗаказа.Дата);
	Для Каждого СтруктураРеализации Из МассивПросрочек Цикл
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%РеализацияСсылка%", СтруктураРеализации.Ссылка);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%КоличествоДнейПросрочки%", СтруктураРеализации.КоличествоДнейПросрочки);
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				,
				,
				,
				Отказ);
	
	КонецЦикла;
	
КонецПроцедуры 

Функция ВедетсяКонтрольДебиторскойЗадолженности(Дата = Неопределено) Экспорт
	ДатаНачалаКонтроляДебиторскойЗадолженности = Справочники.смартПредопределенныеЗначения.ДатаНачалаКонтроляДебиторскойЗадолженности.Значение;
	Если НЕ ЗначениеЗаполнено(ДатаНачалаКонтроляДебиторскойЗадолженности) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		Возврат ТекущаяДатаСеанса() >= ДатаНачалаКонтроляДебиторскойЗадолженности;
	Иначе
		Возврат Дата >= ДатаНачалаКонтроляДебиторскойЗадолженности;
	КонецЕсли;
КонецФункции 

Функция ЕстьАктивныеБлокировкиПоДоговорамПартнера(Партнер) Экспорт
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер = &Партнер
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И ДоговорыКонтрагентов.ОграничиватьСуммуЗадолженности
	|	И ДоговорыКонтрагентов.смартВидДоговора = ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.РасходныеМатериалыОтсрочка)";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СуммаПоЗаказамПоДоговору(Выборка.Договор, Неопределено) >= Выборка.ДопустимаяСуммаЗадолженности Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;		
		
		МассивНакладныхСПросроченнойОплатой = ПолучитьМассивНакладныхСПросроченнойОплатой(Выборка.Договор, ТекущаяДатаСеанса());
		Если МассивНакладныхСПросроченнойОплатой.Количество() > 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтрольДебиторскойЗадолженности 

Процедура ОбработатьЗакрытиеЗадолженности(МассивОшибок)  

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних КАК смартСтопЛистТехническойОтсрочкиСрезПоследних
	|ГДЕ
	|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОбороты.Период КАК Период,
	|	РасчетыСКлиентамиОбороты.КОплатеПриход КАК КОплатеПриход,
	|	РасчетыСКлиентамиОбороты.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ЭтапыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(
	|			,
	|			,
	|			День,
	|			ЗаказКлиента В
	|				(ВЫБРАТЬ
	|					ВТ_Заказы.ЗаказКлиента
	|				ИЗ
	|					ВТ_Заказы)) КАК РасчетыСКлиентамиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	РасчетыСКлиентамиОстатки.КОплатеРасход КАК КОплатеРасход
	|ПОМЕСТИТЬ ОплаченоПоЗаказам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказКлиента В
	|				(ВЫБРАТЬ
	|					ВТ_Заказы.ЗаказКлиента
	|				ИЗ
	|					ВТ_Заказы)) КАК РасчетыСКлиентамиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыРасчетов.Период КАК Период,
	|	ЭтапыРасчетов.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ РезультатРасчетов
	|ИЗ
	|	ЭтапыРасчетов КАК ЭтапыРасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыРасчетов КАК РасчетыСКлиентами
	|		ПО (РасчетыСКлиентами.Период <= ЭтапыРасчетов.Период)
	|			И (РасчетыСКлиентами.ЗаказКлиента = ЭтапыРасчетов.ЗаказКлиента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплаченоПоЗаказам КАК Оплачено
	|		ПО ЭтапыРасчетов.ЗаказКлиента = Оплачено.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыРасчетов.Период,
	|	ЭтапыРасчетов.ЗаказКлиента,
	|	Оплачено.КОплатеРасход
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЭтапыРасчетов.КОплатеПриход) - ЕСТЬNULL(Оплачено.КОплатеРасход, 0) <= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_Заказы.ЗаказКлиента.Партнер КАК Партнер,
	|	ВТ_Заказы.ЗаказКлиента.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РезультатРасчетов КАК РезультатРасчетов
	|		ПО ВТ_Заказы.ЗаказКлиента = РезультатРасчетов.ЗаказКлиента";	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			РегистрыСведений.смартСтопЛистТехническойОтсрочки.РазрешитьТехническуюОтсрочку(ВыборкаДетальныеЗаписи);
		Исключение  
			ТекстОшибки = СтрШаблон("Не удалось удалить из стоп-листа %1 (%2 - %3) по причине: %4", 
											ВыборкаДетальныеЗаписи.ЗаказКлиента,
											ВыборкаДетальныеЗаписи.Партнер,
											ВыборкаДетальныеЗаписи.Контрагент,
											ОписаниеОшибки());
			МассивОшибок.Добавить(ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;	
		
КонецПроцедуры

//++ #7590 смарт: Тимофеева 30.07.2026 / Отмененные заказы попадают в стоп-лист по просроченной дебиторке
Процедура ОбработатьОтмененныеОтгрузки(МассивОшибок);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних КАК смартСтопЛистТехническойОтсрочкиСрезПоследних
	|ГДЕ
	|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.ЗаказКлиента = РеализацияТоваровУслуг.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.ЗаказКлиента
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(РеализацияТоваровУслуг.ПометкаУдаления) = ИСТИНА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.ЗаказКлиента
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.ЗаказКлиента = РеализацияТоваровУслуг.ЗаказКлиента
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.смартСтопЛистТехническойОтсрочки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаказКлиента.Установить(ВыборкаДетальныеЗаписи.ЗаказКлиента);
			НаборЗаписей.Прочитать();
			Для Каждого Запись Из НаборЗаписей Цикл
				НаборЗаписей.Удалить(Запись);
			КонецЦикла;			
			НаборЗаписей.Записать();
			
			Комментарий = СтрШаблон("Внимание! Удалена запись в стоп-листе по заказу %1 по причине отмены отгрузки", 
											ВыборкаДетальныеЗаписи.ЗаказКлиента);

			ЗаписьЖурналаРегистрации(НСтр("ru = 'Контроль дебиторской задолженности (смарт)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         Комментарий);
							 
		Исключение  
			ТекстОшибки = СтрШаблон("Не удалось удалить запись в стоп-листе %1 (%2 - %3) по причине: %4", 
											ВыборкаДетальныеЗаписи.ЗаказКлиента,
											ВыборкаДетальныеЗаписи.Партнер,
											ВыборкаДетальныеЗаписи.Контрагент,
											ОписаниеОшибки());
			МассивОшибок.Добавить(ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;	
		
КонецПроцедуры
//-- #7590 смарт: Тимофеева 30.07.2026

Процедура ОбработатьПросроченныеЗадолженности(МассивОшибок) Экспорт 
	
	КоличествоДнейДляОтсчета = Справочники.смартПредопределенныеЗначения.КоличествоДнейПросрочки.Значение;
	
	Запрос = Новый Запрос;
	//++ #7274 смарт: Тимофеева 01.07.2026 / Контроль дебиторской задолженности. Контроль дат просрочки. 
	#Область СтарыйЗапрос
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ЗаказКлиента КАК ЗаказКлиента
	//|ПОМЕСТИТЬ ВТ_ЗаказыВСтопЛисте
	//|ИЗ
	//|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних КАК смартСтопЛистТехническойОтсрочкиСрезПоследних
	//|ГДЕ
	//|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПартнерыСегмента.Партнер КАК Партнер
	//|ПОМЕСТИТЬ ВТ_КлиентыИсключенияДляСтопЛиста
	//|ИЗ
	//|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	//|ГДЕ
	//|	ПартнерыСегмента.Сегмент = &Сегмент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СоглашенияСКлиентами.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_ТиповыеСоглашения
	//|ИЗ
	//|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	//|ГДЕ
	//|	СоглашенияСКлиентами.Типовое
	//|   И СоглашенияСКлиентами.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АналитикаУчета.Партнер КАК Партнер,
	//|	АналитикаУчета.Контрагент КАК Контрагент,
	//|	РасчетыПоСрокам.ОбъектРасчетов КАК ЗаказКлиента,
	//|	РасчетыПоСрокам.Валюта КАК Валюта,
	//|	ВЫБОР
	//|		КОГДА РасчетыПоСрокам.РасчетныйДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	//|			ТОГДА РасчетыПоСрокам.РасчетныйДокумент
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	//|	КОНЕЦ КАК РасчетныйДокумент,
	//|	ВЫБОР
	//|		КОГДА РасчетыПоСрокам.РасчетныйДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
	//|			ТОГДА РасчетыПоСрокам.ДатаВозникновения
	//|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|	КОНЕЦ КАК ДатаВозникновения,
	//|	РасчетыПоСрокам.ПредоплатаОстаток КАК Предоплата,
	//|	РасчетыПоСрокам.ДолгОстаток КАК Долг
	//|ПОМЕСТИТЬ ВТ_ПросроченнаяЗадолженность
	//|ИЗ
	//|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	//|			,
	//|			ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	//|				И ОбъектРасчетов.Соглашение В
	//|						(ВЫБРАТЬ
	//|							ВТ_ТиповыеСоглашения.Ссылка
	//|						ИЗ
	//|							ВТ_ТиповыеСоглашения)
	//|				И НЕ ОбъектРасчетов В
	//|						(ВЫБРАТЬ
	//|							ВТ_ЗаказыВСтопЛисте.ЗаказКлиента
	//|						ИЗ
	//|							ВТ_ЗаказыВСтопЛисте)
	//|				И НЕ АналитикаУчетаПоПартнерам.Партнер В
	//|						(ВЫБРАТЬ
	//|							ВТ_КлиентыИсключенияДляСтопЛиста.Партнер
	//|						ИЗ
	//|							ВТ_КлиентыИсключенияДляСтопЛиста)
	//|				И ОбъектРасчетов.Дата > &ДатаНачалаКонтроля) КАК РасчетыПоСрокам
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	//|		ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	//|ГДЕ
	//|	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	//|	И (РасчетыПоСрокам.ДолгОстаток > 0
	//|			ИЛИ РасчетыПоСрокам.ПредоплатаОстаток > 0)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ПросроченнаяЗадолженность.Партнер КАК Партнер,
	//|	ВТ_ПросроченнаяЗадолженность.Контрагент КАК Контрагент,
	//|	ВТ_ПросроченнаяЗадолженность.ЗаказКлиента КАК ЗаказКлиента,
	//|	ВТ_ПросроченнаяЗадолженность.Валюта КАК Валюта,
	//|	МАКСИМУМ(ВТ_ПросроченнаяЗадолженность.РасчетныйДокумент) КАК РасчетныйДокумент,
	//|	МИНИМУМ(ВТ_ПросроченнаяЗадолженность.ДатаВозникновения) КАК ДатаВозникновения,
	//|	СУММА(ВТ_ПросроченнаяЗадолженность.Долг - ВТ_ПросроченнаяЗадолженность.Предоплата) КАК СуммаЗадолженности
	//|ПОМЕСТИТЬ ВТ_ПросроченнаяЗадолженностьИтог
	//|ИЗ
	//|	ВТ_ПросроченнаяЗадолженность КАК ВТ_ПросроченнаяЗадолженность
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ПросроченнаяЗадолженность.Партнер,
	//|	ВТ_ПросроченнаяЗадолженность.Контрагент,
	//|	ВТ_ПросроченнаяЗадолженность.ЗаказКлиента,
	//|	ВТ_ПросроченнаяЗадолженность.Валюта
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ВТ_ПросроченнаяЗадолженность.Долг - ВТ_ПросроченнаяЗадолженность.Предоплата) > 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ПросроченнаяЗадолженностьИтог.Партнер КАК Партнер,
	//|	ВТ_ПросроченнаяЗадолженностьИтог.Контрагент КАК Контрагент,
	//|	ВТ_ПросроченнаяЗадолженностьИтог.ЗаказКлиента КАК ЗаказКлиента,
	//|	ВТ_ПросроченнаяЗадолженностьИтог.Валюта КАК Валюта,
	//|	ВТ_ПросроченнаяЗадолженностьИтог.СуммаЗадолженности КАК СуммаЗадолженности,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ПросроченнаяЗадолженностьИтог.Партнер) КАК НаименованиеКлиента,
	//|	ЕСТЬNULL(Партнеры.смартОсновнойМенеджерСервисЦентра, НЕОПРЕДЕЛЕНО) КАК Получатель1,
	//|	ЕСТЬNULL(Партнеры.смартМенеджерПоРасходнымМатериалам, НЕОПРЕДЕЛЕНО) КАК Получатель2,
	//|	ЕСТЬNULL(Контрагенты.НаименованиеПолное, ПРЕДСТАВЛЕНИЕ(ВТ_ПросроченнаяЗадолженностьИтог.Контрагент)) КАК НаименованиеКонтрагента,
	//|	ЕСТЬNULL(Контрагенты.ИНН, """""""") КАК ИННКонтрагента,
	//|	ДокументЗаказКлиента.Номер КАК НомерЗаказа,
	//|	ДокументЗаказКлиента.Дата КАК ДатаЗаказа,
	//|	ВТ_ПросроченнаяЗадолженностьИтог.ДатаВозникновения КАК ДатаВозникновения,
	//|	&ТекущаяДата КАК ДатаПопаданияВСтопЛист,
	//|	ВЫБОР
	//|		КОГДА ВТ_ПросроченнаяЗадолженностьИтог.ДатаВозникновения >= ДАТАВРЕМЯ(2026, 1, 1, 0, 0, 0)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	//|	КОНЕЦ КАК СтавкаНДС,
	//|	ВТ_ПросроченнаяЗадолженностьИтог.РасчетныйДокумент КАК РасчетныйДокумент
	//|ИЗ
	//|	ВТ_ПросроченнаяЗадолженностьИтог КАК ВТ_ПросроченнаяЗадолженностьИтог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	//|		ПО ВТ_ПросроченнаяЗадолженностьИтог.Партнер = Партнеры.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	//|		ПО ВТ_ПросроченнаяЗадолженностьИтог.Контрагент = Контрагенты.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	//|		ПО ВТ_ПросроченнаяЗадолженностьИтог.ЗаказКлиента = ДокументЗаказКлиента.Ссылка";
	//Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	//Запрос.УстановитьПараметр("ДатаНачалаКонтроля", Справочники.смартПредопределенныеЗначения.ДатаНачалаКонтроляДебиторскойЗадолженности.Значение);
	//Запрос.УстановитьПараметр("Сегмент", Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение);
	//
	//РезультатЗапроса = Запрос.Выполнить();	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
	//	
	//	Если ПолучитьКоличествоРабочихДней(ВыборкаДетальныеЗаписи.ДатаВозникновения, ВыборкаДетальныеЗаписи.ДатаПопаданияВСтопЛист) < КоличествоДнейДляОтсчета Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НачатьТранзакцию();
	//	Попытка   
	//		
	//		СтруктураЗаписи = Новый Структура("Партнер, Контрагент, ЗаказКлиента, СуммаЗадолженности, Валюта, РасчетныйДокумент");
	//		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ВыборкаДетальныеЗаписи); 
	//		РегистрыСведений.смартСтопЛистТехническойОтсрочки.ЗапретитьТехническуюОтсрочку(ВыборкаДетальныеЗаписи);	
	//		
	//		СтруктураДанных = Новый Структура("НаименованиеКлиента, НаименованиеКонтрагента, ИННКонтрагента, НомерЗаказа, ДатаЗаказа, Валюта, СуммаЗадолженности, СтавкаНДС, ДатаПопаданияВСтопЛист");
	//		ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаДетальныеЗаписи);
	//		Получатели = Новый Массив;
	//		Получатели.Добавить(ВыборкаДетальныеЗаписи.Получатель1);
	//		Получатели.Добавить(ВыборкаДетальныеЗаписи.Получатель2);
	//		СтруктураДанных.Вставить("Получатели", Получатели);
	//		СтруктураДанных.Вставить("ПолучателиКопии", Справочники.смартПредопределенныеЗначения.ПолучателиУведомленийОКонтрагентахВСтопЛисте.Значения.Выгрузить().ВыгрузитьКолонку("Значение"));
	//					
	//		ОтправитьПочтовоеУведомлениеОбИстеченииСрокаОплаты(ВыборкаДетальныеЗаписи.ЗаказКлиента, СтруктураДанных);
	//		
	//		ЗафиксироватьТранзакцию();
	//	Исключение  
	//		ОтменитьТранзакцию();
	//		ТекстОшибки = СтрШаблон("Не удалось добавить в стоп-лист %1 (%2 - %3) по причине: %4", 
	//										ВыборкаДетальныеЗаписи.ЗаказКлиента,
	//										ВыборкаДетальныеЗаписи.Партнер,
	//										ВыборкаДетальныеЗаписи.Контрагент,
	//										ОписаниеОшибки());
	//		МассивОшибок.Добавить(ТекстОшибки);
	//	КонецПопытки;	
	//КонецЦикла;
	#КонецОбласти
	
	//Убираем учет предоплаты / вводим ДатаПлановогоПогашения 
	// + <>  	10000
	// - РТУ1 	 8000
	// - РТУ2 	12000
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_ЗаказыВСтопЛисте
	|ИЗ
	|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних КАК смартСтопЛистТехническойОтсрочкиСрезПоследних
	|ГДЕ
	|	смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыСегмента.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_КлиентыИсключенияДляСтопЛиста
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|ГДЕ
	|	ПартнерыСегмента.Сегмент = &Сегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияСКлиентами.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТиповыеСоглашения
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.Типовое
	|	И СоглашенияСКлиентами.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчета.Партнер КАК Партнер,
	|	АналитикаУчета.Контрагент КАК Контрагент,
	|	РасчетыПоСрокам.ОбъектРасчетов КАК ЗаказКлиента,
	|	РасчетыПоСрокам.Валюта КАК Валюта,
	|	РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыПоСрокам.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокам.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокам.ДолгОстаток КАК СуммаЗадолженности
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			,
	|			ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента
	|				И ОбъектРасчетов.Соглашение В
	|					(ВЫБРАТЬ
	|						ВТ_ТиповыеСоглашения.Ссылка
	|					ИЗ
	|						ВТ_ТиповыеСоглашения)
	|				И НЕ ОбъектРасчетов В
	|						(ВЫБРАТЬ
	|							ВТ_ЗаказыВСтопЛисте.ЗаказКлиента
	|						ИЗ
	|							ВТ_ЗаказыВСтопЛисте)
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер В
	|						(ВЫБРАТЬ
	|							ВТ_КлиентыИсключенияДляСтопЛиста.Партнер
	|						ИЗ
	|							ВТ_КлиентыИсключенияДляСтопЛиста)
	|				И ОбъектРасчетов.Дата > &ДатаНачалаКонтроля) КАК РасчетыПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|		ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
	|		ПО (РасчетыПоСрокам.ОбъектРасчетов = ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка
	|		И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты В (ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитСдвиг)))
	|ГДЕ
	|	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И РасчетыПоСрокам.ДолгОстаток > 0";

	Запрос.УстановитьПараметр("ДатаНачалаКонтроля", Справочники.смартПредопределенныеЗначения.ДатаНачалаКонтроляДебиторскойЗадолженности.Значение);
	Запрос.УстановитьПараметр("Сегмент", Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение);
	
	ТаблицаЗадолженности 				= Запрос.Выполнить().Выгрузить();
	ТаблицаПросроченныеЗадолженности 	= ТаблицаЗадолженности.СкопироватьКолонки(); 
	ТаблицаЗадолженностиСвернутая       = ТаблицаЗадолженности.Скопировать();
	ТаблицаЗадолженностиСвернутая.Свернуть("Партнер, Контрагент, ЗаказКлиента");
	
	Календарь 	= Константы.ОсновнойКалендарьПредприятия.Получить();
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого СтрокаЗаказа Из ТаблицаЗадолженностиСвернутая Цикл
		
		Отбор = Новый Структура("Партнер, Контрагент, ЗаказКлиента");
		ЗаполнитьЗначениясвойств(Отбор, СтрокаЗаказа); 
		
		НайденныеСтроки = ТаблицаЗадолженности.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			
			НайденнаяСтрока = НайденныеСтроки[0]; 
			
			Если НЕ ТипЗнч(НайденнаяСтрока.РасчетныйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Продолжить;
			КонецЕсли;
						
			ДатаОбязательногоПогашенияОтДатыВозникновения = CRM_КалендарныеГрафики.ПолучитьДатуПоКалендарю(Календарь, НайденнаяСтрока.ДатаВозникновения, КоличествоДнейДляОтсчета, Ложь, Истина);
			ДатаПлановогоПогашения = Макс(ДатаОбязательногоПогашенияОтДатыВозникновения, НайденнаяСтрока.ДатаПлановогоПогашения); 
			Если ТекущаяДата > ДатаПлановогоПогашения Тогда
				НоваяСтрока = ТаблицаПросроченныеЗадолженности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока); 
			КонецЕсли;
			
		Иначе // больше одного расчетного документа
			
			СуммаЗадолженностиВИтог 		= 0;
			ДатаВозникновенияВИтог  		= НайденныеСтроки[0].ДатаВозникновения;
			ДатаПлановогоПогашенияВИтог		= НайденныеСтроки[0].ДатаПлановогоПогашения;
			РасчетныйДокументВИтог 			= НайденныеСтроки[0].РасчетныйДокумент;  
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если НЕ ТипЗнч(НайденнаяСтрока.РасчетныйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаОбязательногоПогашенияОтДатыВозникновения = CRM_КалендарныеГрафики.ПолучитьДатуПоКалендарю(Календарь, НайденнаяСтрока.ДатаВозникновения, КоличествоДнейДляОтсчета, Ложь, Истина);
				ДатаПлановогоПогашения = Макс(ДатаОбязательногоПогашенияОтДатыВозникновения, НайденнаяСтрока.ДатаПлановогоПогашения); 
				Если ТекущаяДата > ДатаПлановогоПогашения Тогда
					
					СуммаЗадолженностиВИтог = СуммаЗадолженностиВИтог + НайденнаяСтрока.СуммаЗадолженности;
					Если НайденнаяСтрока.ДатаВозникновения < ДатаВозникновенияВИтог Тогда
						
						ДатаВозникновенияВИтог  		= НайденнаяСтрока.ДатаВозникновения;
						ДатаПлановогоПогашенияВИтог		= НайденнаяСтрока.ДатаПлановогоПогашения;
						РасчетныйДокументВИтог 			= НайденнаяСтрока.РасчетныйДокумент;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СуммаЗадолженностиВИтог > 0 Тогда
				
				НоваяСтрока = ТаблицаПросроченныеЗадолженности.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
				НоваяСтрока.СуммаЗадолженности 		= СуммаЗадолженностиВИтог;
				НоваяСтрока.ДатаВозникновения		= ДатаВозникновенияВИтог;
				НоваяСтрока.ДатаПлановогоПогашения	= ДатаПлановогоПогашенияВИтог;
				НоваяСтрока.РасчетныйДокумент		= РасчетныйДокументВИтог;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработатьИтоговуюТаблицуПоПросроченнымЗадолженностям(ТаблицаПросроченныеЗадолженности, МассивОшибок);
	
КонецПроцедуры

Процедура ОбработатьИтоговуюТаблицуПоПросроченнымЗадолженностям(ТаблицаПросроченныеЗадолженности, МассивОшибок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаПросроченныеЗадолженности.Партнер КАК Партнер,
	|	ТаблицаПросроченныеЗадолженности.Контрагент КАК Контрагент,
	|	ТаблицаПросроченныеЗадолженности.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаПросроченныеЗадолженности.Валюта КАК Валюта,
	|	ТаблицаПросроченныеЗадолженности.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТаблицаПросроченныеЗадолженности.ДатаВозникновения КАК ДатаВозникновения,
	|	ТаблицаПросроченныеЗадолженности.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ТаблицаПросроченныеЗадолженности.СуммаЗадолженности КАК СуммаЗадолженности
	|ПОМЕСТИТЬ ВТ_ПросроченнаяЗадолженностьИтог
	|ИЗ
	|	&ТаблицаПросроченныеЗадолженности КАК ТаблицаПросроченныеЗадолженности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПросроченнаяЗадолженностьИтог.Партнер КАК Партнер,
	|	ВТ_ПросроченнаяЗадолженностьИтог.Контрагент КАК Контрагент,
	|	ВТ_ПросроченнаяЗадолженностьИтог.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ПросроченнаяЗадолженностьИтог.Валюта КАК Валюта,
	|	ВТ_ПросроченнаяЗадолженностьИтог.СуммаЗадолженности КАК СуммаЗадолженности,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ПросроченнаяЗадолженностьИтог.Партнер) КАК НаименованиеКлиента,
	|	ЕСТЬNULL(Партнеры.смартОсновнойМенеджерСервисЦентра, НЕОПРЕДЕЛЕНО) КАК Получатель1,
	|	ЕСТЬNULL(Партнеры.смартМенеджерПоРасходнымМатериалам, НЕОПРЕДЕЛЕНО) КАК Получатель2,
	|	ЕСТЬNULL(Контрагенты.НаименованиеПолное, ПРЕДСТАВЛЕНИЕ(ВТ_ПросроченнаяЗадолженностьИтог.Контрагент)) КАК НаименованиеКонтрагента,
	|	ЕСТЬNULL(Контрагенты.ИНН, """""""") КАК ИННКонтрагента,
	|	ДокументЗаказКлиента.Номер КАК НомерЗаказа,
	|	ДокументЗаказКлиента.Дата КАК ДатаЗаказа,
	|	ВТ_ПросроченнаяЗадолженностьИтог.ДатаВозникновения КАК ДатаВозникновения,
	|	ВТ_ПросроченнаяЗадолженностьИтог.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	&ТекущаяДата КАК ДатаПопаданияВСтопЛист,
	|	ВЫБОР
	|		КОГДА ВТ_ПросроченнаяЗадолженностьИтог.ДатаВозникновения >= ДАТАВРЕМЯ(2026, 1, 1, 0, 0, 0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВТ_ПросроченнаяЗадолженностьИтог.РасчетныйДокумент КАК РасчетныйДокумент
	|ИЗ
	|	ВТ_ПросроченнаяЗадолженностьИтог КАК ВТ_ПросроченнаяЗадолженностьИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО ВТ_ПросроченнаяЗадолженностьИтог.Партнер = Партнеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_ПросроченнаяЗадолженностьИтог.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	|		ПО ВТ_ПросроченнаяЗадолженностьИтог.ЗаказКлиента = ДокументЗаказКлиента.Ссылка";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТаблицаПросроченныеЗадолженности", ТаблицаПросроченныеЗадолженности);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
		НачатьТранзакцию();
		Попытка   
			
			СтруктураЗаписи = Новый Структура("Партнер, Контрагент, ЗаказКлиента, СуммаЗадолженности, Валюта, РасчетныйДокумент");
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ВыборкаДетальныеЗаписи); 
			РегистрыСведений.смартСтопЛистТехническойОтсрочки.ЗапретитьТехническуюОтсрочку(ВыборкаДетальныеЗаписи);	
			
			СтруктураДанных = Новый Структура("НаименованиеКлиента, НаименованиеКонтрагента, ИННКонтрагента, НомерЗаказа, ДатаЗаказа, Валюта, СуммаЗадолженности, СтавкаНДС, ДатаПопаданияВСтопЛист");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаДетальныеЗаписи);
			Получатели = Новый Массив;
			Получатели.Добавить(ВыборкаДетальныеЗаписи.Получатель1);
			Получатели.Добавить(ВыборкаДетальныеЗаписи.Получатель2);
			СтруктураДанных.Вставить("Получатели", Получатели);
			СтруктураДанных.Вставить("ПолучателиКопии", Справочники.смартПредопределенныеЗначения.ПолучателиУведомленийОКонтрагентахВСтопЛисте.Значения.Выгрузить().ВыгрузитьКолонку("Значение"));
						
			ОтправитьПочтовоеУведомлениеОбИстеченииСрокаОплаты(ВыборкаДетальныеЗаписи.ЗаказКлиента, СтруктураДанных);
			
			ЗафиксироватьТранзакцию();
		Исключение  
			ОтменитьТранзакцию();
			ТекстОшибки = СтрШаблон("Не удалось добавить в стоп-лист %1 (%2 - %3) по причине: %4", 
											ВыборкаДетальныеЗаписи.ЗаказКлиента,
											ВыборкаДетальныеЗаписи.Партнер,
											ВыборкаДетальныеЗаписи.Контрагент,
											ОписаниеОшибки());
			МассивОшибок.Добавить(ТекстОшибки);
		КонецПопытки;	
	КонецЦикла;	

КонецПроцедуры 

Процедура ОбработатьОтгрузкиСОтсрочкойПлатежа(МассивОшибок)
	
	КоличествоДнейДляКонтроля = Справочники.смартПредопределенныеЗначения.КоличествоДнейДляКонтроляПриближенияСрокаПлатежа.Значение;
	КоличествоДнейДляКонтроля = ?(ЗначениеЗаполнено(КоличествоДнейДляКонтроля), КоличествоДнейДляКонтроля, 3);
	
    ТекущаяДата = ТекущаяДатаСеанса();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ОбъектРасчетов КАК ЗаказКлиента,
	|	ЗаказКлиента.Номер КАК НомерЗаказа,
	|	ЗаказКлиента.Дата КАК ДатаЗаказа,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ДолгОстаток КАК СуммаЗадолженности,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.Валюта КАК Валюта,
	|	ПРЕДСТАВЛЕНИЕ(Партнеры.Ссылка) КАК НаименованиеКлиента,
	|	ЕСТЬNULL(Партнеры.смартОсновнойМенеджерСервисЦентра, НЕОПРЕДЕЛЕНО) КАК Получатель1,
	|	ЕСТЬNULL(Партнеры.смартМенеджерПоРасходнымМатериалам, НЕОПРЕДЕЛЕНО) КАК Получатель2,
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ПРЕДСТАВЛЕНИЕ(АналитикаУчета.Контрагент) КАК НаименованиеКонтрагента,
	|	АналитикаУчета.Контрагент.ИНН КАК ИННКонтрагента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, ОбъектРасчетов ССЫЛКА Документ.ЗаказКлиента) КАК РасчетыСКлиентамиПоСрокамОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|		ПО РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ОбъектРасчетов = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО (АналитикаУчета.Партнер = Партнеры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (АналитикаУчета.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И АналитикаУчета.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И АналитикаУчета.Договор.ОграничиватьСуммуЗадолженности
	|	И АналитикаУчета.Договор.смартВидДоговора = ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.РасходныеМатериалыОтсрочка)";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
		Если ВыборкаДетальныеЗаписи.ДатаПлановогоПогашения > ТекущаяДата 
			И ПолучитьКоличествоРабочихДней(ТекущаяДата, ВыборкаДетальныеЗаписи.ДатаПлановогоПогашения) <= КоличествоДнейДляКонтроля Тогда
		
			ОтправитьПочтовоеУведомлениеОПриближенииСрокаПлатежей(ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи);
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаПлановогоПогашения <= ТекущаяДата  Тогда
			
			ОтправитьПочтовоеУведомлениеОПросрочкеПлатежей(ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	РасчетыСКлиентамиОстатки.Валюта КАК Валюта,
	|	ПРЕДСТАВЛЕНИЕ(Партнеры.Ссылка) КАК НаименованиеКлиента,
	|	ЕСТЬNULL(Партнеры.смартОсновнойМенеджерСервисЦентра, НЕОПРЕДЕЛЕНО) КАК Получатель1,
	|	ЕСТЬNULL(Партнеры.смартМенеджерПоРасходнымМатериалам, НЕОПРЕДЕЛЕНО) КАК Получатель2,
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ПРЕДСТАВЛЕНИЕ(АналитикаУчета.Контрагент) КАК НаименованиеКонтрагента,
	|	АналитикаУчета.Контрагент.ИНН КАК ИННКонтрагента,
	|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности - (РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) КАК ТекущийЛимит
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ) КАК РасчетыСКлиентамиОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|		ПО РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО (АналитикаУчета.Партнер = Партнеры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (АналитикаУчета.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И АналитикаУчета.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И АналитикаУчета.Договор.ОграничиватьСуммуЗадолженности
	|	И АналитикаУчета.Договор.смартВидДоговора = ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.РасходныеМатериалыОтсрочка)
	|	И ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности - (РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) <= 0";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
		ОтправитьПочтовоеУведомлениеОбИсчерпанииЛимита(ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи);
			
	КонецЦикла;	
		
КонецПроцедуры

Функция ПолучитьКоличествоРабочихДней(ДатаНачала, ДатаОкончания) Экспорт	
	Возврат CRM_КалендарныеГрафики.ПолучитьРабочиеДниПериода(ДатаНачала, ДатаОкончания).Количество() - 1;		
КонецФункции

#КонецОбласти 

#Область Уведомления

Процедура ОтправитьПочтовоеУведомлениеОбИстеченииСрокаОплаты(ЗаказКлиента, СтруктураДанных)
	
	ВидСобытия = "ПомещениеКонтрагентаВСтопЛист";
	
	Если смартУведомления.ПолучитьИнформациюОПоследнемУведомлении(ЗаказКлиента, ВидСобытия).Объект = Неопределено Тогда
		СтруктураУведомления = ПолучитьСтруктуруУведомленияОбИстеченииСрокаОплаты(СтруктураДанных); 
		смартУведомления.ОтправитьПочтовоеУведомление(ЗаказКлиента, ВидСобытия, СтруктураУведомления.Тема, СтруктураУведомления.Тело, СтруктураУведомления.Адреса, СтруктураУведомления.АдресаКопии, , СтруктураУведомления.Вложения);
	КонецЕсли;    
	
КонецПроцедуры  

Функция ПолучитьСтруктуруУведомленияОбИстеченииСрокаОплаты(СтруктураДанных)	
	Результат 				= Новый Структура("Тема,Тело,Адреса,АдресаКопии,Вложения");
	
	Результат.Тема 			= СтрШаблон("Клиент %1 помещен в Стоп-лист по технической отсрочке!", СтруктураДанных.НаименованиеКлиента);
	Тело 					= ПолучитьТекстаПисьмаУведомленияОбИстеченииСрокаОплаты();
	Тело 					= СтрЗаменить(Тело, "%НаименованиеКлиента%",		СтруктураДанных.НаименованиеКлиента);
	Тело 					= СтрЗаменить(Тело, "%НаименованиеКонтрагента%", 	СтруктураДанных.НаименованиеКонтрагента);
	Тело 					= СтрЗаменить(Тело, "%ИННКонтрагента%", 			СтруктураДанных.ИННКонтрагента);
	Тело 					= СтрЗаменить(Тело, "%НомерЗаказа%", 				СтруктураДанных.НомерЗаказа);
	Тело 					= СтрЗаменить(Тело, "%ДатаЗаказа%", 				Формат(СтруктураДанных.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
	Тело 					= СтрЗаменить(Тело, "%СуммаЗадолженности%", 		СтруктураДанных.СуммаЗадолженности);
	Тело 					= СтрЗаменить(Тело, "%Валюта%",	 					СтруктураДанных.Валюта);
	Тело 					= СтрЗаменить(Тело, "%ДатаПопадания%", 				СтруктураДанных.ДатаПопаданияВСтопЛист);
	
	Результат.Тело 			= Тело;
	Результат.Адреса 		= смартУведомления.СформироватьАдресаПолучателейДляОтправки(СтруктураДанных.Получатели);
	Результат.АдресаКопии 	= смартУведомления.СформироватьАдресаПолучателейДляОтправки(СтруктураДанных.ПолучателиКопии);
	
	Вложение 				= Новый Структура("ИмяФайла, РасширениеФайла, Адрес");
	Вложение.Адрес 			= ПолучитьФайлУведомлениеОбИстеченииСрокаОплаты(СтруктураДанных);
	Вложение.ИмяФайла 		= СтрШаблон("Уведомление о нарушении сроков оплаты по счету %1 от %2.pdf", СтруктураДанных.НомерЗаказа, Формат(СтруктураДанных.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
	Результат.Вставить("Вложения", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение));
	
	Возврат Результат;   						
КонецФункции

Функция ПолучитьТекстаПисьмаУведомленияОбИстеченииСрокаОплаты()	
	Возврат 
	"В связи с нарушением условий технической отсрочки, клиент был автоматически помещен в стоп-лист по технической отсрочке.
	|
	|У клиента %НаименованиеКлиента% (%НаименованиеКонтрагента% %ИННКонтрагента%) возникла задолженность по Заказу клиента %НомерЗаказа% %ДатаЗаказа% в размере %СуммаЗадолженности% %Валюта%.
	|Дата попадания в стоп лист %ДатаПопадания%
	|
	|С момента попадания в стоп-лист для клиента автоматически запрещено проведение любых документов ""Реализация товаров и услуг"".
	|
	|Для снятия ограничений необходимо обеспечить полное погашение задолженности по указанному документу. 
	|После поступления оплаты клиент будет автоматически выведен из стоп-листа, и ограничения снимутся.
	|
	|Необходимо принять меры для взаимодействия с клиентом.
	|
	|Это письмо сформировано автоматически системой 1С. Пожалуйста, не отвечайте на него.
	|-----";	
КонецФункции  

Функция ПолучитьФайлУведомлениеОбИстеченииСрокаОплаты(ПараметрыВложения)	
	ТабДок 	= Новый ТабличныйДокумент;
	Макет 	= РегистрыСведений.смартСтопЛистТехническойОтсрочки.ПолучитьМакет("смартУведомлениеОбИстеченииСрокаОплаты");
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.ДатаФормирования 				= Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	Область.Параметры.НомерЗаказа	 				= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыВложения.НомерЗаказа, Истина, Истина);
	Область.Параметры.ДатаЗаказа 					= Формат(ПараметрыВложения.ДатаЗаказа, "ДФ=dd.MM.yyyy");
	Область.Параметры.НаименованиеКонтрагента		= ПараметрыВложения.НаименованиеКонтрагента;
	Область.Параметры.СуммаЗадолженности    		= Формат(ПараметрыВложения.СуммаЗадолженности, "ЧДЦ=2");
	Область.Параметры.СуммаЗадолженностиПрописью    = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ПараметрыВложения.СуммаЗадолженности, ПараметрыВложения.Валюта);
    Область.Параметры.Валюта                        = ПараметрыВложения.Валюта;
	Область.Параметры.СтавкаНДС                     = ПараметрыВложения.СтавкаНДС;
	
	ТабДок.Вывести(Область);
	
	ИмяВременногоФайла 		= ПолучитьИмяВременногоФайла("pdf");
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныеДанные 			= Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресДвоичныхДанных		= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат АдресДвоичныхДанных;	
КонецФункции  

Процедура ОтправитьПочтовоеУведомлениеОПриближенииСрокаПлатежей(ЗаказКлиента, СтруктураДанных)
		
	ВидСобытия = "ПриближениеСрокаПлатежаПоЗаказу";
	
	Если смартУведомления.ПолучитьИнформациюОПоследнемУведомлении(ЗаказКлиента, ВидСобытия).Объект = Неопределено Тогда
		
		СтруктураУведомления = ПолучитьСтруктуруУведомленияОПриближенииСрокаПлатежей(СтруктураДанных); 
	    смартУведомления.ОтправитьПочтовоеУведомление(ЗаказКлиента, ВидСобытия, СтруктураУведомления.Тема, СтруктураУведомления.Тело, СтруктураУведомления.Адреса, СтруктураУведомления.АдресаКопии, , СтруктураУведомления.Вложения);
		
	КонецЕсли;    
	
КонецПроцедуры

Функция ПолучитьСтруктуруУведомленияОПриближенииСрокаПлатежей(СтруктураДанных)	
	Результат 				= Новый Структура("Тема,Тело,Адреса,АдресаКопии,Вложения");
	
	Результат.Тема 			= СтрШаблон("По договору %1 с клиентом %2 приближается срок платежа", СтруктураДанных.НомерДоговора, СтруктураДанных.НаименованиеКлиента);
	Тело 					= ПолучитьТекстаПисьмаУведомленияОПриближенииСрокаПлатежей();
	Тело 					= СтрЗаменить(Тело, "%НаименованиеКлиента%",		СтруктураДанных.НаименованиеКлиента);
	Тело 					= СтрЗаменить(Тело, "%НаименованиеКонтрагента%", 	СтруктураДанных.НаименованиеКонтрагента);
	Тело 					= СтрЗаменить(Тело, "%ИННКонтрагента%", 			СтруктураДанных.ИННКонтрагента);
	Тело 					= СтрЗаменить(Тело, "%НомерДоговора%", 				СтруктураДанных.НомерДоговора);
	Тело 					= СтрЗаменить(Тело, "%ДатаДоговора%", 				Формат(СтруктураДанных.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	Тело 					= СтрЗаменить(Тело, "%НомерЗаказа%", 				СтруктураДанных.НомерЗаказа);
	Тело 					= СтрЗаменить(Тело, "%ДатаЗаказа%", 				Формат(СтруктураДанных.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
	Тело 					= СтрЗаменить(Тело, "%СуммаЗадолженности%", 		СтруктураДанных.СуммаЗадолженности);
	Тело 					= СтрЗаменить(Тело, "%Валюта%",	 					СтруктураДанных.Валюта);
	
	Результат.Тело 			= Тело; 
	Получатели 				= Новый Массив;
	Получатели.Добавить(СтруктураДанных.Получатель1);
	Получатели.Добавить(СтруктураДанных.Получатель2);
	Результат.Адреса 		= смартУведомления.СформироватьАдресаПолучателейДляОтправки(Получатели);
	
	Вложение 				= Новый Структура("ИмяФайла, РасширениеФайла, Адрес");
	Вложение.Адрес 			= ПолучитьФайлУведомлениеОПриближенииСрокаОплаты(СтруктураДанных);
	Вложение.ИмяФайла 		= СтрШаблон("Уведомление о приближении срока оплаты по договору %1 от %2.pdf", СтруктураДанных.НомерДоговора, Формат(СтруктураДанных.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	Результат.Вставить("Вложения", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение));
	
	Возврат Результат;   						
КонецФункции

Функция ПолучитьТекстаПисьмаУведомленияОПриближенииСрокаПлатежей()	
	Возврат 
	"В системе 1С зафиксировано критическое событие по договору с отсрочкой платежа. 
	|
	|Через 3 рабочих дня у клиента %НаименованиеКлиента% (%НаименованиеКонтрагента% %ИННКонтрагента%) возникнет задолженность по Договору %НомерДоговора% от %ДатаДоговора% и Заказу клиента %НомерЗаказа% от %ДатаЗаказа% в размере %СуммаЗадолженности% %Валюта%.
	|
	|Необходимо принять меры для взаимодействия с клиентом.
	|
	|Это письмо сформировано автоматически системой 1С. Пожалуйста, не отвечайте на него.
	|-----";	
КонецФункции  

Функция ПолучитьФайлУведомлениеОПриближенииСрокаОплаты(ПараметрыВложения)	
	ТабДок 	= Новый ТабличныйДокумент;
	Макет 	= РегистрыСведений.смартСтопЛистТехническойОтсрочки.ПолучитьМакет("смартУведомлениеОбИстеченииСрокаОплатыПриОтсрочках");
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.ДатаФормирования 				= Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	Область.Параметры.НомерДоговора	 				= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыВложения.НомерДоговора, Истина, Истина);
	Область.Параметры.ДатаДоговора					= Формат(ПараметрыВложения.ДатаДоговора, "ДФ=dd.MM.yyyy");
	Область.Параметры.НаименованиеКонтрагента		= ПараметрыВложения.НаименованиеКонтрагента;
	Область.Параметры.СуммаЗадолженности    		= Формат(ПараметрыВложения.СуммаЗадолженности, "ЧДЦ=2");
	Область.Параметры.СуммаЗадолженностиПрописью    = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ПараметрыВложения.СуммаЗадолженности, ПараметрыВложения.Валюта);
    Область.Параметры.Валюта                        = ПараметрыВложения.Валюта;
	Область.Параметры.СтавкаНДС                     = Перечисления.СтавкиНДС.НДС22;
	
	ТабДок.Вывести(Область);
	
	ИмяВременногоФайла 		= ПолучитьИмяВременногоФайла("pdf");
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныеДанные 			= Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресДвоичныхДанных		= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат АдресДвоичныхДанных;	
КонецФункции  

Процедура ОтправитьПочтовоеУведомлениеОПросрочкеПлатежей(ЗаказКлиента, СтруктураДанных)
		
	ВидСобытия = "ПросрочкаПлатежаПоЗаказу";
	
	Если смартУведомления.ПолучитьИнформациюОПоследнемУведомлении(ЗаказКлиента, ВидСобытия).Объект = Неопределено Тогда
		
		Событие              = СтрШаблон("Наступила просрочка по договору %1 от %2", СтруктураДанных.НомерДоговора, Формат(СтруктураДанных.ДатаДоговора, "ДФ=dd.MM.yyyy"));
		СтруктураУведомления = ПолучитьСтруктуруУведомленияОКритическомСобытииПоДоговоруСОтсрочкойПлатежа(СтруктураДанных, Событие); 
	    смартУведомления.ОтправитьПочтовоеУведомление(ЗаказКлиента, ВидСобытия, СтруктураУведомления.Тема, СтруктураУведомления.Тело, СтруктураУведомления.Адреса, СтруктураУведомления.АдресаКопии, , СтруктураУведомления.Вложения);
		
	КонецЕсли;    
	
КонецПроцедуры 

Процедура ОтправитьПочтовоеУведомлениеОбИсчерпанииЛимита(ЗаказКлиента, СтруктураДанных)
		
	ВидСобытия = "ИсчерпанЛимитПоДоговору";
	
	Если смартУведомления.ПолучитьИнформациюОПоследнемУведомлении(ЗаказКлиента, ВидСобытия).Объект = Неопределено Тогда
		
		Событие              = СтрШаблон("Исчерпан лимит по договору %1 от %2", СтруктураДанных.НомерДоговора, Формат(СтруктураДанных.ДатаДоговора, "ДФ=dd.MM.yyyy"));
		СтруктураУведомления = ПолучитьСтруктуруУведомленияОКритическомСобытииПоДоговоруСОтсрочкойПлатежа(СтруктураДанных, Событие); 
	    смартУведомления.ОтправитьПочтовоеУведомление(ЗаказКлиента, ВидСобытия, СтруктураУведомления.Тема, СтруктураУведомления.Тело, СтруктураУведомления.Адреса, СтруктураУведомления.АдресаКопии, , СтруктураУведомления.Вложения);
		
	КонецЕсли;    
	
КонецПроцедуры

Функция ПолучитьСтруктуруУведомленияОКритическомСобытииПоДоговоруСОтсрочкойПлатежа(СтруктураДанных, Событие)	
	Результат 				= Новый Структура("Тема,Тело,Адреса,АдресаКопии,Вложения");
	
	Результат.Тема 			= СтрШаблон("По договору %1 с клиентом %2 действуют ограничения", СтруктураДанных.НомерДоговора, СтруктураДанных.НаименованиеКлиента);
	Тело 					= ПолучитьТекстаПисьмаУведомленияОКритическомСобытииПоДоговоруСОтсрочкойПлатежа();
	Тело 					= СтрЗаменить(Тело, "%Событие%",		Событие);

	Результат.Тело 			= Тело; 
	Получатели 				= Новый Массив;
	Получатели.Добавить(СтруктураДанных.Получатель1);
	Получатели.Добавить(СтруктураДанных.Получатель2);
	Результат.Адреса 		= смартУведомления.СформироватьАдресаПолучателейДляОтправки(Получатели);
	
	ПолучателиКопии			= ПолучитьАдресаРуководителейПодразделений(Получатели);
	Для Каждого Строка Из Справочники.смартПредопределенныеЗначения.ПолучателиУведомленийОКритическихСобытияхКонтроляОтсрочекПлатежей.Значения Цикл
		ПолучателиКопии.Добавить(Строка.Значение);
	КонецЦикла;
	Результат.АдресаКопии	= смартУведомления.СформироватьАдресаПолучателейДляОтправки(ПолучателиКопии);
	                          
	Возврат Результат;   						
КонецФункции

Функция ПолучитьТекстаПисьмаУведомленияОКритическомСобытииПоДоговоруСОтсрочкойПлатежа()	
	Возврат 
	"В системе 1С зафиксировано критическое событие по договору с отсрочкой платежа. 
	|%Событие%
	|Для клиента автоматически установлены ограничения на создание новых заказов.
	|Для снятия ограничений необходимо обеспечить полное погашение задолженности по указанному документу.
	|
	|Необходимо принять меры для взаимодействия с клиентом.
	|
	|Это письмо сформировано автоматически системой 1С. Пожалуйста, не отвечайте на него.
	|------";	
КонецФункции 

Функция ПолучитьАдресаРуководителейПодразделений(Получатели)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураПредприятия.ТекущийРуководитель КАК Руководитель
	|ПОМЕСТИТЬ ВТ_ФизЛица
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО Пользователи.Подразделение = СтруктураПредприятия.Ссылка
	|ГДЕ
	|	Пользователи.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ФизЛица КАК ВТ_ФизЛица
	|		ПО Пользователи.ФизическоеЛицо = ВТ_ФизЛица.Руководитель"; 
	Запрос.УстановитьПараметр("Ссылка", Получатели);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

#КонецОбласти 

Функция СуммаПоЗаказамПоДоговору(Договор, ЗаказКлиента)	
	Результат = 0; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) КАК СуммаПоДоговору
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам.Договор = &Договор
	|				И НЕ ЗаказКлиента = &ЗаказКлиента) КАК РасчетыСКлиентамиОстатки";
	Запрос.УстановитьПараметр("Договор", Договор); 
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.СуммаПоДоговору;
	КонецЕсли;
	Возврат Результат;	
КонецФункции 

//++ #7696 смарт: Тимофеева 31.07.2026 / Контроль дебиторской задолженности. Корректировка алгоритма учета кредитного лимита.
Функция СуммаОплатПоЗаказу(ЗаказКлиента)	
	Результат = 0; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РасчетыСКлиентами.КОплатеРасход), 0) КАК ОплаченоПоЗаказу
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(, , Регистратор, ЗаказКлиента = &ЗаказКлиента) КАК РасчетыСКлиентами
	|ГДЕ
	|	(РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ОперацияПоПлатежнойКарте
	|			ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности)";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента); 
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.ОплаченоПоЗаказу;
	КонецЕсли;
	Возврат Результат;	
КонецФункции
//-- #7696 смарт: Тимофеева 31.07.2026

Функция СуммаВсехЗаказовПоДоговору(Договор, ЗаказКлиента)	
	Результат = 0; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РасчетыСКлиентамиОбороты.КОплатеПриход), 0) КАК СуммаПоДоговору
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(
	|			,
	|			,
	|			День,
	|			АналитикаУчетаПоПартнерам.Договор = &Договор
	|				И НЕ ЗаказКлиента = &ЗаказКлиента) КАК РасчетыСКлиентамиОбороты";
	Запрос.УстановитьПараметр("Договор", Договор); 
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.СуммаПоДоговору;
	КонецЕсли;
	Возврат Результат;	
КонецФункции 

Функция ПолучитьМассивНакладныхСПросроченнойОплатой(Договор, ДатаЗаказа)	
	Результат = Новый Массив; 
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаУчета.Партнер КАК Партнер,
	|	АналитикаУчета.Контрагент КАК Контрагент,
	|	РасчетыПоСрокам.ОбъектРасчетов КАК ЗаказКлиента,
	|	РасчетыПоСрокам.Валюта КАК Валюта,
	|	РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыПоСрокам.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокам.ПредоплатаОстаток КАК Предоплата,
	|	РасчетыПоСрокам.ДолгОстаток КАК Долг
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, АналитикаУчетаПоПартнерам.Договор = &Договор) КАК РасчетыПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|		ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|ГДЕ
	|	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И РасчетыПоСрокам.ДолгОстаток > 0";
	Запрос.УстановитьПараметр("Договор", Договор); 
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТекущаяДата > НачалоДня(ВыборкаДетальныеЗаписи.ДатаПлановогоПогашения)  
			И НачалоДня(ДатаЗаказа) > НачалоДня(ВыборкаДетальныеЗаписи.ДатаПлановогоПогашения) Тогда			
			ДанныеНакладной  = Новый Структура;
			ДанныеНакладной.Вставить("Ссылка", ВыборкаДетальныеЗаписи.РасчетныйДокумент);
			ДанныеНакладной.Вставить("КоличествоДнейПросрочки", ПолучитьКоличествоРабочихДней(ВыборкаДетальныеЗаписи.ДатаПлановогоПогашения, ТекущаяДата));
			
			Результат.Добавить(ДанныеНакладной); 		
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;	
КонецФункции

#КонецОбласти  

