
&НаСервере
Функция ЗаполнитьПериодыВзаиморасчетов() 
	
	ТекущаяДата = ТекущаяДата();   
	
	Элементы.ПериодГод.СписокВыбора.Очистить();
	
	ПериодГод = Формат(ТекущаяДата, "ДФ=yyyy");
	ПериодМесяц = Формат(ТекущаяДата, "ДФ=MM");   	 
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("appKey");
	СтруктураЗапроса.Вставить("sessionID");
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		СтруктураЗапроса.Вставить("cauid", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "UID"));
		
	КонецЕсли;
	
	ДанныеПериоды = ДЛ_ДеловыеЛинии.ПолучитьПериодыВзаиморасчетов(СтруктураЗапроса);  
	
	Если ДанныеПериоды["data"] <> Неопределено Тогда
		
		Для Каждого ДанныеГод Из ДанныеПериоды["data"]["years"] Цикл  
			
			Элементы.ПериодГод.СписокВыбора.Добавить(ДанныеГод.Ключ);			
			
		КонецЦикла; 
		
		Элементы.ПериодГод.СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		
	КонецЕсли; 
	
	Если Элементы.ПериодГод.СписокВыбора.Количество() = 0 Тогда
			
		Элементы.ПериодГод.СписокВыбора.Добавить(ПериодГод);
		
	КонецЕсли;
	
КонецФункции  

&НаКлиенте
Процедура ОбновитьСписокКонтрагентов(Команда)

	ДЛ_ДеловыеЛинии.ОбновитьСправочникДЛ_Контрагенты();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПериодыВзаиморасчетов();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказчикКонтрагентСсылкаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаполнитьПериодыВзаиморасчетов();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказчикКонтрагентСсылкаПриИзменении(Элемент)
	
	ЗаполнитьПериодыВзаиморасчетов();
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьВзаиморасчеты(Команда)
	
	Если ЗначениеЗаполнено(ПериодГод) И ЗначениеЗаполнено(ПериодМесяц) Тогда
		
		СформироватьВзаиморасчетыНаСервере();	
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите период взаиморасчетов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьВзаиморасчетыНаСервере()
	
	Взаиморасчеты.Очистить();
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("appKey");
	СтруктураЗапроса.Вставить("sessionID");  
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		СтруктураЗапроса.Вставить("cauid", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "UID"));
		
	КонецЕсли; 
	
	СтруктураЗапроса.Вставить("month", ПериодМесяц);
	СтруктураЗапроса.Вставить("year", ПериодГод);  
	
	ДанныеВзаиморасчеты = ДЛ_ДеловыеЛинии.ПолучитьВзаиморасчеты(СтруктураЗапроса);  
	
	Если ДанныеВзаиморасчеты["data"] <> Неопределено Тогда 		
		
		СтрокаВзаиморасчеты = Взаиморасчеты.Добавить();
		СтрокаВзаиморасчеты.Дата = ПолучитьДатуПрописью(ДанныеВзаиморасчеты["data"]["balance"]["opening"]["date"]); 
		СтрокаВзаиморасчеты.ВидДокумента = "Начальный остаток";
		СтрокаВзаиморасчеты.Сумма = ДанныеВзаиморасчеты["data"]["balance"]["opening"]["sum"]; 
		
		Для Каждого ДокументВзаиморасчеты Из ДанныеВзаиморасчеты["data"]["documents"] Цикл
			
			СтрокаВзаиморасчеты = Взаиморасчеты.Добавить();
			СтрокаВзаиморасчеты.Дата = ПолучитьДатуПрописью(ДокументВзаиморасчеты["date"]); 
			СтрокаВзаиморасчеты.ВидДокумента = ДокументВзаиморасчеты["docType"];
			СтрокаВзаиморасчеты.НомерДокумента = ДокументВзаиморасчеты["docID"];
			СтрокаВзаиморасчеты.Сумма = ДокументВзаиморасчеты["sum"];			
			
		КонецЦикла;
		
		СтрокаВзаиморасчеты = Взаиморасчеты.Добавить();
		СтрокаВзаиморасчеты.Дата = ПолучитьДатуПрописью(ДанныеВзаиморасчеты["data"]["balance"]["closing"]["date"]); 
		СтрокаВзаиморасчеты.ВидДокумента = "Конечный остаток";
		СтрокаВзаиморасчеты.Сумма = ДанныеВзаиморасчеты["data"]["balance"]["closing"]["sum"];
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка получения данных взаиморасчетов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуПрописью(ДатаСтрокой)	
	
	Возврат Формат(ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ДатаСтрокой), "ДЛФ=DD");
	
КонецФункции


