#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если НЕ Параметры.Свойство("Ключ") Тогда
			СтандартнаяОбработка = Ложь;
			Основание = Неопределено;
			Если Параметры.Свойство("Основание", Основание)  Тогда
				Если ТипЗнч(Основание) = Тип("СправочникСсылка.Партнеры") Тогда
					Параметры.Вставить("Партнер", Основание);
				КонецЕсли;
			ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда	
				Если Параметры.ЗначенияЗаполнения.Свойство("Партнер") Тогда
					Параметры.Вставить("Партнер", Параметры.ЗначенияЗаполнения.Партнер);
				КонецЕсли;
			КонецЕсли;
			ВыбраннаяФорма = "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтоПоддержка = (Данные.ТипОбращения <> Справочники.CRM_ТипыОбращений.Интерес);
	Если Не ЭтоПоддержка Тогда
		Представление = НСтр("ru='Интерес ""';en='Lead ""'") + Данные.Тема + НСтр("ru='"" от '") + Формат(Данные.Дата, "ДФ=dd.MM.yyyy")
		+ ?(Данные.ОжидаемаяВыручка <> 0, ", " + Формат(Данные.ОжидаемаяВыручка, "ЧГ=3,0") +" "+ CRM_ОбщегоНазначенияПовтИсп.ПолучитьНаименованиеВалютыУправленческогоУчета(), "");
	Иначе
		Представление = СокрЛП(Данные.ТипОбращения)+" """+ Данные.Тема+"""" + " №"+ Данные.Номер +НСтр("ru=' от '")+Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	
КонецПроцедуры
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Тема");
	Поля.Добавить("ОжидаемаяВыручка");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ТипОбращения");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Результат = Новый Массив;
	Если ЗначениеЗаполнено(Ссылка.КонтактноеЛицо) Тогда
		Результат.Добавить(Ссылка.КонтактноеЛицо);
	ИначеЕсли ЗначениеЗаполнено(Ссылка.Партнер) Тогда
		Результат.Добавить(Ссылка.Партнер);
	ИначеЕсли ЗначениеЗаполнено(Ссылка.ПотенциальныйКлиент) Тогда
		Результат.Добавить(Ссылка.ПотенциальныйКлиент);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура Модуль_СоздатьЭлементыФормы(Форма) Экспорт
	
	ЭлементРодитель = Форма.Элементы.Найти("ГруппаРеквизитыЛево");
	ЭлементДокументОснование = Форма.Элементы.Найти("ДокументОснование");
	
	НовыйЭлемент = Форма.Элементы.Вставить("Соглашение", Тип("ПолеФормы"), ЭлементРодитель, ЭлементДокументОснование);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Соглашение";
	НовыйЭлемент.Ширина = 36;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_СоглашениеНачалоВыбора");
	
	НовыйЭлемент = Форма.Элементы.Вставить("СделкаСКлиентом", Тип("ПолеФормы"), ЭлементРодитель, ЭлементДокументОснование);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СделкаСКлиентом";
	НовыйЭлемент.Ширина = 36;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
КонецПроцедуры

// Функция формирует печатную форму документа.
//
Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати, НомерВарианта = Неопределено)
	
	Возврат Новый ТабличныйДокумент;	
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Сформировать печатные формы объектов.
//
// Параметры:
//  МассивОбъектов			 - Массив	 - Массив ссылок на объекты которые нужно распечатать.
//  ПараметрыПечати			 - Структура - Структура дополнительных параметров печати.
//  КоллекцияПечатныхФорм	 - ТаблицаЗначений - Сформированные табличные документы.
//  ОбъектыПечати			 - Массив - Объекты печати. 
//  ПараметрыВывода			 - Структура - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КоммерческоеПредложениеКлиенту") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КоммерческоеПредложениеКлиенту", НСтр("ru='Коммерческое предложение';en='Quote'"), СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати, Неопределено));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Процедура добавляет дополнительные команды печати. 
//
// Параметры:
//  КомандыПечати	 - ТаблицаЗначений - Таблица с описанием команд печати 
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
