
&НаКлиенте
&ИзменениеИКонтроль("ДиаграммаОбработкаРасшифровки")
Процедура смарт_ДиаграммаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ТипЗНч(Расшифровка) = Тип("Структура") Тогда
		ЗначениеТочки = Неопределено;
		ЗначениеСерии = Неопределено;
		Расшифровка.Свойство("Точка", ЗначениеТочки);
		Расшифровка.Свойство("Серия", ЗначениеСерии);

		СтруктураПараметрыФормы = ПолучитьСтруктуруПараметровОткрытияФормыРасшифровки(ЗначениеСерии, ЗначениеТочки, Расшифровка.Свойство("ЭтоПлан"));
		Если Расшифровка.Свойство("ЭтоПлан") Тогда
			ЗначениеПользователь = Неопределено;
			ЗначениеПодразделение = Неопределено;
			СтруктураПараметрыФормы.Свойство("Пользователь", ЗначениеПользователь);
			СтруктураПараметрыФормы.Свойство("Подразделение", ЗначениеПодразделение);
			Если ЗначениеЗаполнено(ЗначениеПользователь) Тогда
				ОбъектПланирования = ПредопределенноеЗначение("Перечисление.CRM_ОбъектыПланированияВоронкиПродаж.Менеджер");
				ЗначениеОбъектаПланирования = ЗначениеПользователь;
			ИначеЕсли ЗначениеЗаполнено(ЗначениеПодразделение) Тогда
				ОбъектПланирования = ПредопределенноеЗначение("Перечисление.CRM_ОбъектыПланированияВоронкиПродаж.Подразделение");
				ЗначениеОбъектаПланирования = ЗначениеПодразделение;
			Иначе
				ОбъектПланирования = ПредопределенноеЗначение("Перечисление.CRM_ОбъектыПланированияВоронкиПродаж.Предприятие");
			КонецЕсли;
			МассивДокументов = ПолучитьМассивДокументовПланированиеВоронкиПродаж(Воронка, ОбъектПланирования, СтруктураПараметрыФормы.Этап, ЗначениеОбъектаПланирования);
			Если МассивДокументов.Количество() = 1 Тогда
				Форма = ПолучитьФорму("Документ.CRM_ПланированиеВоронкиПродаж.ФормаОбъекта", Новый Структура("Ключ", МассивДокументов[0]), ЭтотОбъект);
				Если Форма <> Неопределено Тогда
					Форма.Открыть();
				КонецЕсли;
			ИначеЕсли МассивДокументов.Количество() > 1 Тогда
				СписокОтбор = Новый СписокЗначений();
				СписокОтбор.ЗагрузитьЗначения(МассивДокументов);
				СтруктураОтбор = Новый Структура("Ссылка", СписокОтбор);
				СтруктураПараметры = Новый Структура("Отбор", СтруктураОтбор);
				//Форма = ПолучитьФорму("ЖурналДокументов.CRM_Планирование.ФормаСписка", СтруктураПараметры, ЭтотОбъект);
				//Если Форма <> Неопределено Тогда
				//	Форма.Открыть();
				//КонецЕсли;
			КонецЕсли;
		Иначе
			//Если СтруктураПараметрыФормы.ВидЭтапа =
			//ПредопределенноеЗначение("Перечисление.CRM_ВидыЭтаповВоронкиПродаж.ПоСостояниямИнтересов") Тогда

			Если Расшифровка.Свойство("АктивныеУспешноНеудачно") Тогда
				СтруктураПараметрыФормы.Вставить("ПараметрУспешно", Расшифровка.АктивныеУспешноНеудачно);
			КонецЕсли;

			ПараметрыФормы = ПолучитьПараметрыДляОтчета(СтруктураПараметрыФормы);

			ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_РасшифровкаВоронкиПродаж.Форма", ПараметрыФормы, ЭтотОбъект, Истина);

			НастройкиСКД = ФормаРасшифровки.Отчет.КомпоновщикНастроек.Настройки;

			ДатаНачалаПериода = ?(ЗначениеЗаполнено(ОтборПериод.ДатаНачала), НачалоДня(ОтборПериод.ДатаНачала), '00010101');
			
			#Удаление //++ #2030 смарт: Фролов 02.09.2024 //Внести изменения по в воронку продаж, по доработкам Раруса.
			ДатаКонецПериода = ?(ЗначениеЗаполнено(ОтборПериод.ДатаОкончания), КонецДня(ОтборПериод.ДатаОкончания), КонецДня(ТекущаяДата()));
			#КонецУдаления
			
			#Вставка
			//++ #2030 смарт: Фролов 02.09.2024 //Внести изменения по в воронку продаж, по доработкам Раруса.
			ДатаКонецПериода = ?(ЗначениеЗаполнено(ОтборПериод.ДатаОкончания), КонецДня(ОтборПериод.ДатаОкончания), '30000101');
			//-- #2030 смарт: Фролов 02.09.2024
			#КонецВставки
			
			НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТекущаяДата"), ТекущаяДата());
			НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Воронка"), Воронка);
			НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"), ДатаНачалаПериода);
			НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"), ДатаКонецПериода);
			НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Календарь"), СписокПараметровРасшифровки[5].Значение);
			НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПервыйЭтапВоронки"), СписокПараметровРасшифровки[6].Значение);

			Если ЗначениеЗаполнено(ОтборОфис) Тогда
				ИмяПоляОтбора = "Офис";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ОтборОфис, Истина);
			КонецЕсли;

			Если СтруктураПараметрыФормы.Свойство("Пользователь") Тогда
				ИмяПоляОтбора = "Пользователь"; 
				#Вставка
				//++ #1469 смарт: Фролов 02.10.2023 //Изменить форму выбора ответственного в Воронке продаж
				СпсОтветственные=Новый СписокЗначений;
				Для Каждого СтрОтборОтветственные Из СтруктураПараметрыФормы.Пользователь Цикл
					Если СтрОтборОтветственные.Пометка Тогда
						СпсОтветственные.Добавить(СтрОтборОтветственные.Значение);		
					КонецЕсли;	
				КонецЦикла;
				Если СпсОтветственные.Количество()>0 ТОгда
					УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, СпсОтветственные, Истина);
				КонецЕсли;	
				//-- #1469 смарт: Фролов 02.10.2023
				#КонецВставки
				
				#Удаление //++ #1469 смарт: Фролов 02.10.2023 //Изменить форму выбора ответственного в Воронке продаж
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, СтруктураПараметрыФормы.Пользователь, Истина);
				#КонецУдаления
				
			КонецЕсли;

			Если СтруктураПараметрыФормы.Свойство("Подразделение") Тогда
				ИмяПоляОтбора = "Подразделение";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, СтруктураПараметрыФормы.Подразделение, Истина);
			КонецЕсли;

			Если ЗначениеЗаполнено(ОтборРегион) Тогда
				ИмяПоляОтбора = "БизнесРегион";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ОтборРегион, Истина);
			КонецЕсли;

			Если ЗначениеЗаполнено(ОтборСегментКлиентов) Тогда
				ИмяПоляОтбора = "Сегмент";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ОтборСегментКлиентов, Истина);
			КонецЕсли;

			Если ЗначениеЗаполнено(ПоискИсточникПривлечения) Тогда
				ИмяПоляОтбора = "ИсточникПривлечения";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ПоискИсточникПривлечения, Истина);
			КонецЕсли;

			Если ЗначениеЗаполнено(ПоискЗначениеИсточникаПривлечения) Тогда
				ИмяПоляОтбора = "ЗначениеИсточникаПривлечения";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ПоискЗначениеИсточникаПривлечения, Истина);
			КонецЕсли;

			Если ОтборТолькоНовые Тогда
			КонецЕсли;

			Если ОтборТипыУслуг.Количество() > 0 Тогда
				ИмяПоляОтбора = "ТипУслуги";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, ОтборТипыУслуг, Истина);
			КонецЕсли;

			СписокСостояний = Новый СписокЗначений();
			Если РежимВоронки = "Активные" Тогда
				СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.Активный"));
				ИмяПоляОтбора = "СостояниеЭтапа";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, СписокСостояний, Истина);
			ИначеЕсли РежимВоронки = "Закрытые" Тогда
				ИмяПоляОтбора = "Завершено";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, Истина, Истина);

				СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.Активный"));
				#Вставка
				//++ #1453 смарт: Фролов 19.09.2023 //Доработка воронки продаж
				Если НЕ ЗначениеЗаполнено(Расшифровка.Точка) ТОгда
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно"));
				КонецЕсли;
				//-- #1453 смарт: Фролов 19.09.2023
				#КонецВставки
				
				ИмяПоляОтбора = "СостояниеЭтапа";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.НеВСписке, СписокСостояний, Истина);
			КонецЕсли;

			ИмяПоляОтбора = "ЭтапОтбор";
			Если ТипЗнч(ЗначениеТочки) = Тип("СписокЗначений") Тогда
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ЗначениеТочки[0].Значение, Истина);
			Иначе
				
				#Вставка
				//++ #1453 смарт: Фролов 19.09.2023 //Доработка воронки продаж
				Если ЗначениеЗаполнено(Расшифровка.Точка) ТОгда
					УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, Расшифровка.Точка, Истина);
				КонецЕсли;	
				//-- #1453 смарт: Фролов 19.09.2023
				#КонецВставки
				
			КонецЕсли; 
			
			#Вставка
			//++ #1453 смарт: Фролов 19.09.2023 //Доработка воронки продаж
			Если НЕ ЗначениеЗаполнено(Расшифровка.Точка) ТОгда
				ИмяПоляОтбора = "СостояниеЭтапаОтбор";
				СписокСостояний = Новый СписокЗначений;
				СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно"));
				СписокСостояний.Добавить(НСтр("en = 'Stage Skipped'; ru = 'Этап пропущен'"));
			КонецЕсли;
			//-- #1453 смарт: Фролов 19.09.2023
			#КонецВставки

			УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, СписокСостояний, Истина);

			Если ОтбиратьПоТегам Тогда
				ИмяПоляОтбора = "Объект";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, СписокОбъектовСТегами, Истина);
			КонецЕсли;

			Если Расшифровка.Свойство("Серия") Тогда
				ИмяПоляОтбора = "СостояниеЭтапаОтбор";
				СписокСостояний = Новый СписокЗначений;
				Если Расшифровка.Серия = "Активные" Тогда
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.Активный"));
				ИначеЕсли Расшифровка.Серия = "Закрытые" Тогда
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно"));
					СписокСостояний.Добавить(НСтр("ru='Этап пропущен';en='Stage Skipped'"));
				ИначеЕсли Расшифровка.Серия = "Все" Тогда
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.Активный"));
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно"));
					СписокСостояний.Добавить(НСтр("ru='Этап пропущен';en='Stage Skipped'"));
				ИначеЕсли Расшифровка.Серия = "Достроенные" Тогда
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно"));
					СписокСостояний.Добавить(НСтр("ru='Этап пропущен';en='Stage Skipped'"));
				ИначеЕсли Расшифровка.Серия = "Неудачно" Тогда
					СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно"));
				КонецЕсли;
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, СписокСостояний, Истина);
			КонецЕсли;
			
			#Вставка
			//++ #1759 смарт: Ермаков 24.04.2024 / Добавить в CRM обработку "Воронка продаж" отборы. 
			Если ЭтаФорма.смартВоронкаНовые И Не ЭтаФорма.смартВоронкаСтарые Тогда
				ИмяПоляОтбора = "Объект.смартВоронкаНовые";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ЭтаФорма.смартВоронкаНовые, Истина);	
			КонецЕсли;

			Если ЭтаФорма.смартВоронкаСтарые И Не ЭтаФорма.смартВоронкаНовые Тогда
				ИмяПоляОтбора = "Объект.смартВоронкаСтарые";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.Равно, ЭтаФорма.смартВоронкаСтарые, Истина);	
			КонецЕсли;
			//-- #1759 смарт: Ермаков 24.04.2024								
			#КонецВставки

			#Вставка
			//++ #1806 смарт: Ермаков 03.05.2024 / Доработка отчета Воронка продаж CRM - отбор по квалификациям.	
			Если ЭтаФорма.смартКвалификация.Количество() > 0 Тогда

				ГруппаОтбораИли					= НастройкиСКД.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбораИли.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				ГруппаОтбораИли.Использование	= Истина;

				ГруппаОтбораИ = ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбораИ.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				ГруппаОтбораИ.Использование	= Истина;

				УстановитьЗначениеВОтборе(ГруппаОтбораИ, "Объект.смартИтоговаяКвалификация", ВидСравненияКомпоновкиДанных.НеЗаполнено, ЭтаФорма.смартКвалификация, Истина);	
				УстановитьЗначениеВОтборе(ГруппаОтбораИ, "Объект.смартПредварительнаяКвалификация", ВидСравненияКомпоновкиДанных.ВСписке, ЭтаФорма.смартКвалификация, Истина);	

				ЭлементОтбора = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.смартИтоговаяКвалификация");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлементОтбора.ПравоеЗначение = ЭтаФорма.смартКвалификация;
				ЭлементОтбора.Использование = Истина;

				// Итоговая структура группировки
				// Группа ИЛИ
				//  - Группа И
				//  - - смартИтоговаяКвалификация НЕ Заполнена
				//  - - смартПредварительнаяКвалификация ВСписке
				//  - смартИтоговаяКвалификация ВСписке
				//

			КонецЕсли;
			//-- #1806 смарт: Ермаков 03.05.2024
			#КонецВставки
			
			#Вставка
			//++ #1799 смарт: Ермаков 26.04.2024 / Доработка отчета Воронка продаж CRM
			Если ЭтаФорма.смартПодразделения.Количество() > 0 Тогда
				ИмяПоляОтбора = "Объект.Подразделение";
				УстановитьЗначениеВОтборе(НастройкиСКД.Отбор, ИмяПоляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, ЭтаФорма.смартПодразделения, Истина);			
			КонецЕсли;
			//-- #1799 смарт: Ермаков 26.04.2024
			#КонецВставки
			
			ФормаРасшифровки.Модифицированность = Ложь;
			ФормаРасшифровки.Открыть();
			ФормаРасшифровки.ВариантМодифицирован = Ложь;

			//Иначе
			//	Если Расшифровка.Свойство("АктивныеУспешноНеудачно") Тогда
			//		СтруктураПараметрыФормы.Вставить("ПараметрУспешно", Расшифровка.АктивныеУспешноНеудачно);
			//	КонецЕсли;
			//	ОткрытьФормуРасшифровки(СтруктураПараметрыФормы);
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
