#Область ПрограммныйИнтерфейс

// Вызывается из обработчика ПриСозданииНаСервере формы печати документов (ОбщаяФорма.ПечатьДокументов).
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма ОбщаяФорма.ПечатьДокументов.
//
Процедура ПечатьДокументовПриСозданииНаСервере(Форма) Экспорт
	
	Если Форма.Команды.Найти("CRM_ОтправитьВДиалогах") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить("CRM_ОтправитьВДиалогах");
	Команда.Действие = "Подключаемый_ОтправитьВДиалогах";
	Команда.Картинка = БиблиотекаКартинок.CRM_ОтправкаЧерезМессенджер;
	Команда.Подсказка = НСтр("ru = 'Отправить в диалогах'");
	
	Кнопка = Форма.Элементы.Добавить("CRM_ОтправитьВДиалогах", Тип("КнопкаФормы"), Форма.Элементы.Найти("ГруппаСохранитьОтправить"));
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = "CRM_ОтправитьВДиалогах";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("CRM_Служебный", Новый ОписаниеТипов("Строка")));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Элемент = Форма.Элементы.Добавить("CRM_Служебный", Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Видимость = Ложь;
	Элемент.ПутьКДанным = "CRM_Служебный";
	
КонецПроцедуры

// Возвращает параметры открытия для мессенджера.
//
// Параметры:
//	ОбъектСсылка - Ссылка - ссылка на объект.
//
// Возвращаемое значение:
//	Структура - параметры открытия для мессенджера.
Функция ПолучитьПараметрыОткрытияДляМессенджера(ОбъектСсылка) Экспорт
	ПараметрыДиалога = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "КонтактноеЛицо")
			И ЗначениеЗаполнено(ОбъектСсылка["КонтактноеЛицо"]) Тогда
		ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка["КонтактноеЛицо"]);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "Партнер")
			И ЗначениеЗаполнено(ОбъектСсылка["Партнер"]) Тогда
		ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка["Партнер"]);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "Клиент")
			И ЗначениеЗаполнено(ОбъектСсылка["Клиент"]) Тогда
		ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка["Клиент"]);
	КонецЕсли;
    Возврат ПараметрыДиалога;
КонецФункции

#КонецОбласти