&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)
	
	Если Расшифровка = Неопределено тогда
        Возврат Неопределено;
    КонецЕсли;
 
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
    КоллекцияПолей = ДанныеРасшифровкиОбъект.Элементы[Расшифровка].ПолучитьПоля();
 
    Если КоллекцияПолей.Количество() = 0 тогда
        Возврат Неопределено
    Иначе
        СтруктураВозврата = Новый Структура;
        СтруктураВозврата.Вставить("Значение", КоллекцияПолей[0].Значение);
        СтруктураВозврата.Вставить("ИмяПоля", КоллекцияПолей[0].Поле); 
        Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка);
	
	Если ТипЗнч(ЗначениеРасшифровки) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеРасшифровки.Свойство("ИмяПоля") 
			И ЗначениеРасшифровки.ИмяПоля = "ЗаявкаРасшифровка" Тогда			
			
			Значение = ЗначениеРасшифровки.Значение;
			
			Если ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Если Значение.Количество() = 1 Тогда
					ПоказатьЗначение(, Значение[0]);
				Иначе
					СписокДокументов = Новый СписокЗначений;
					СписокДокументов.ЗагрузитьЗначения(Значение);
					
					Оповещение = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтотОбъект);				
					СписокДокументов.ПоказатьВыборЭлемента(Оповещение, "Выберите документ");
				КонецЕсли;
				
			Иначе
				ПоказатьЗначение(, Значение);
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДокумента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не выбран");
    Иначе
        ВыбранноеЗначение = ВыбранныйЭлемент.Значение;
		ПоказатьЗначение(, ВыбранноеЗначение);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИнженера(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Действие", "Добавить");
	Оповещение = Новый ОписаниеОповещения("ОкончаниеДобавленияУдаленияПользователя", ЭтотОбъект, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", "Пользователи");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	СкрываемыеПользователи = ПолучитьИнженеровИзНастройки();
	ПараметрыФормы.Вставить("СкрываемыеПользователи", СкрываемыеПользователи);
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьИнженера(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Действие", "Удалить");
	Оповещение = Новый ОписаниеОповещения("ОкончаниеДобавленияУдаленияПользователя", ЭтотОбъект, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", "Пользователи");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	смартОтображаемыеПользователи = ПолучитьИнженеровИзНастройки();
	ПараметрыФормы.Вставить("смартОтображаемыеПользователи", смартОтображаемыеПользователи);

	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнженеровИзНастройки()
	
	РезультатСписокЗначений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенныйЭлемент";
	
	ПредопределенныйЭлемент = Справочники.смартПредопределенныеЗначения.СписокИнженеров;
	
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент", ПредопределенныйЭлемент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатСписокЗначений;
	КонецЕсли;
	
	РезультатСписокЗначений.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение"));
	
	Возврат РезультатСписокЗначений;
	
КонецФункции

&НаКлиенте
Процедура ОкончаниеДобавленияУдаленияПользователя(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.Пользователи") Тогда		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(РезультатЗакрытия);
	ИначеЕсли ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		МассивПользователей = РезультатЗакрытия;
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеПараметры.Действие = "Добавить" Тогда
		ДобавитьИнженераНаСервере(МассивПользователей);
	Иначе
		УдалитьИнженераНаСервере(МассивПользователей);
	КонецЕсли;
	
	СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИнженераНаСервере(МассивПользователей)
	
	Если НЕ ЗначениеЗаполнено(МассивПользователей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенныйЭлемент
	|	И смартПредопределенныеЗначенияЗначения.Значение В (&МассивПользователей)";
	
	ПредопределенныйЭлемент = Справочники.смартПредопределенныеЗначения.СписокИнженеров;
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент", ПредопределенныйЭлемент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	
	Об = ПредопределенныйЭлемент.ПолучитьОбъект();
	
	Для Каждого ТекПользователь Из МассивПользователей Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Значение", ТекПользователь);
		НайденныеСтроки = Об.Значения.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Об.Значения.Добавить();
		НоваяСтрока.Значение = ТекПользователь;
	КонецЦикла;

	Об.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИнженераНаСервере(МассивПользователей)
	
	Если НЕ ЗначениеЗаполнено(МассивПользователей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенныйЭлемент
	|	И смартПредопределенныеЗначенияЗначения.Значение В (&МассивПользователей)";
	
	ПредопределенныйЭлемент = Справочники.смартПредопределенныеЗначения.СписокИнженеров;
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент", ПредопределенныйЭлемент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	
	Об = ПредопределенныйЭлемент.ПолучитьОбъект();
	
	Сч = Об.Значения.Количество() - 1;
	
	Пока Сч >= 0 Цикл
		
		ТекСтрока = Об.Значения[Сч];
		Если МассивПользователей.Найти(ТекСтрока.Значение) <> Неопределено Тогда
			Об.Значения.Удалить(Сч);
		КонецЕсли;
		
		Сч = Сч - 1;

	КонецЦикла;
	
	Об.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Смарт:  Демичев №861 09.02.2022((Перенесено в расширения
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Элементы.ФормаДобавитьИнженера.Доступность = (РольДоступна("смартДобавлениеИзменениеЗаявкиНаРемонт") или РольДоступна("ПолныеПрава")) и Пользователи.ТекущийПользователь().Подразделение = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква, Ложь);
	//Элементы.ФормаУдалитьИнженера.Доступность = (РольДоступна("смартДобавлениеИзменениеЗаявкиНаРемонт") или РольДоступна("ПолныеПрава")) и Пользователи.ТекущийПользователь().Подразделение = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква, Ложь);
	//
	//УстановитьПривилегированныйРежим(Ложь);
	//-- Смарт:  Демичев №861 09.02.2022
	
КонецПроцедуры

