
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшСвойстваДинамическогоСписка;

&НаКлиенте
Перем КэшОграничениеТипов;

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПолучитьСписокСобытийПоИсточникуПИ(ИсточникСсылка)

	   Запрос = Новый Запрос;
	   
	Запрос.Текст = "ВЫБРАТЬ 
	               |	ДокументCRM_Событие.Ссылка,
	               |	ДокументCRM_Событие.КонтактноеЛицо,
	               |	ДокументCRM_Событие.Партнер,
				   |	ДокументCRM_Событие.СторонниеЛица
				   |ИЗ
	               |	РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УдалитьCRM_Событие КАК ДокументCRM_Событие
	               |		ПО ИсточникиПервичногоИнтересаСрезПоследних.Сделка = ДокументCRM_Событие.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗадачаИсполнителя.Предмет КАК Предмет,
	               |			СУММА(1) КАК Количество
	               |		ИЗ
	               |			Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ГДЕ
	               |			НЕ ЗадачаИсполнителя.ПометкаУдаления
	               |			И НЕ ЗадачаИсполнителя.Выполнена
	               |			И ЗадачаИсполнителя.CRM_Личная
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗадачаИсполнителя.Предмет) КАК ЛичныеЗадачи
	               |		ПО (ДокументCRM_Событие.Ссылка = ЛичныеЗадачи.Предмет)
	               |ГДЕ
	               |	ИсточникиПервичногоИнтересаСрезПоследних.ИсточникПервичногоИнтереса = &ИсточникПервичногоИнтереса";
	Запрос.УстановитьПараметр("ИсточникПервичногоИнтереса",ИсточникСсылка);
	 
	 Возврат Запрос.Выполнить(); 
КонецФункции // ()

&НаСервере
Функция ПолучитьУникальные(спсЗнч)

	  выхСписок = Новый СписокЗначений;
	  мДобавленные = Новый Массив;
	  Для каждого элСп Из спсЗнч Цикл
		  
		элСп = элСп.Значение;
		уникИд = "" + элСп.Партнер + элСп.КонтактноеЛицо;
		Найдено = мДобавленные.Найти(уникИд);
	    Если Найдено = Неопределено Тогда
		
			выхСписок.Добавить(элСп);
			мДобавленные.Добавить(уникИд);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат выхСписок;
КонецФункции 

&НаСервере
Функция ПолучитьСписокВсехПартнеров(ИсточникСсылка)

	РезультатЗапроса = ПолучитьСписокСобытийПоИсточникуПИ(ИсточникСсылка);
	РезультатЗапроса = РезультатЗапроса.Выбрать();
	
	спПартнеров = Новый СписокЗначений;
	
	тзПартнеры = Новый ТаблицаЗначений;
	
	Пока РезультатЗапроса.Следующий() Цикл
	
		Если ЗначениеЗаполнено(РезультатЗапроса.Партнер) Тогда
			
			стрМаркетинг = Новый Структура("Партнер,КонтактноеЛицо,Событие",
				РезультатЗапроса.Партнер,РезультатЗапроса.КонтактноеЛицо,РезультатЗапроса.Ссылка);
				спПартнеров.Добавить(стрМаркетинг);
		
		КонецЕсли; 
        тчРезЗап = РезультатЗапроса.СторонниеЛица.Выбрать();
		
		Пока тчРезЗап.Следующий() Цикл
		
			Если ЗначениеЗаполнено(тчРезЗап.Партнер) Тогда
		
				стрМаркетинг = Новый Структура("Партнер,КонтактноеЛицо,Событие",
					тчРезЗап.Партнер,тчРезЗап.КонтактноеЛицо,РезультатЗапроса.Ссылка);
					спПартнеров.Добавить(стрМаркетинг);
		
			КонецЕсли; 

		КонецЦикла; 
			
	КонецЦикла;
	
	Партнеры = ПолучитьУникальные(спПартнеров);
	
	Возврат Партнеры;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура КомандаТелемаркетинг(Команда)
	
	спПартнеров = ПолучитьСписокВсехПартнеров(ИсточникПервичногоИнтереса);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
				Новый Структура("СписокПартнеров, МаркетинговаяКампания",спПартнеров, ИсточникПервичногоИнтереса));
	ОткрытьФорму("Документ.CRM_Телемаркетинг.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассылкаЭлектронныхПисем(Команда)
	
	спПартнеров = ПолучитьСписокВсехПартнеров(ИсточникПервичногоИнтереса);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
		Новый Структура("СписокПартнеров, МаркетинговаяКампания",спПартнеров, ИсточникПервичногоИнтереса));
	ОткрытьФорму("Документ.CRM_РассылкаЭлектронныхПисем.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассылкаSMS(Команда)
	Если CRM_ОбщегоНазначенияКлиент.смсПроверитьДоступностьSMS4B() Тогда
		спПартнеров = ПолучитьСписокВсехПартнеров(ИсточникПервичногоИнтереса);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
					Новый Структура("СписокПартнеров",спПартнеров));
		ОткрытьФорму("Документ.СообщениеSMS.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,);
	КонецЕсли;	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МаркетинговаяКампания") И ЗначениеЗаполнено(Параметры.МаркетинговаяКампания) Тогда
		ИсточникПервичногоИнтереса = Параметры.МаркетинговаяКампания;
		Список.Параметры.УстановитьЗначениеПараметра("ИсточникПервичногоИнтереса", ИсточникПервичногоИнтереса);
	Иначе	
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
