#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ДоработкиСмарт

// Смарт Фролов+
// Функция проверяет есть ли движения по Договору
// Входной парареметр Договор Тип("СсылкаСпраовочник.ДоговорыКонтрагентов")
// Возвращаемое заначение Тип("Булево")
Функция ПоДоговоруЕстьДвижения(Договор) Экспорт 
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Договор",Договор);
	//++ смарт:Каратеев 1496 11.10.2023 //Исправить определения движений по договору (блокировка)
	//Условия отбора соответствуют бизнес - процессам:
	// - можно править договор, когда по договору есть только Заказ клиента
	// - договор должен разблокироваться, если все документы помечены на удаление/распроведены
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеестрДокументов.Договор КАК Договор,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|ГДЕ
	|	РеестрДокументов.Договор = &Договор
	|	И НЕ ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.ЗаказКлиента)
	|	И РеестрДокументов.Проведен";
	//-- смарт:Каратеев 1496 11.10.2023 //
	УстановитьПривилегированныйРежим(Истина);
	Рез=Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не Рез.Пустой() Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
КонецФункции
// Фролов-

//++#1329 смарт: Лопато 23.03.2023 //Признак подписания договора  
Функция смартУстановитьПризнакДоговорПодписан(Договоры, Признак) Экспорт
	
	НовыйПризнак = Признак = "Подписан";
	
	МассивСсылок = Новый Массив();
	КоличествоОбработанных = 0;
	
	Для Каждого Договор Из Договоры Цикл
		
		Если ТипЗнч(Договор) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСсылок.Добавить(Договор);
		
	КонецЦикла;
	
	Если МассивСсылок = 0 Тогда
		Возврат КоличествоОбработанных;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.смартДоговорПодписан = &Признак
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакСовпадает
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка В(&МассивСсылок)");
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("Признак", НовыйПризнак);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПризнакСовпадает Тогда
			
			ТекстОшибки = НСтр("ru='Договору %Договор% уже присвоен признак ""%Признак%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Выборка.Ссылка);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Признак%", Признак);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Выборка.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось заблокировать %Договор%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Выборка.Ссылка);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Выборка.Ссылка);
			
		КонецПопытки;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.смартДоговорПодписан = НовыйПризнак;
		
		Попытка
			
			Объект.Записать();
			КоличествоОбработанных = КоличествоОбработанных + 1;
			
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось записать %Договор%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Выборка.Ссылка);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Выборка.Ссылка);
			
		КонецПопытки
		
	КонецЦикла;
	
	Возврат КоличествоОбработанных;
	
КонецФункции //--#1329 смарт: Лопато 23.03.2023

//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С  
Функция ОтправитьПисьма(МассивСообщений = Неопределено,ТекстПисьма,ДокументСсылка,НомерДоговора) Экспорт
	
	Успех = Ложь;
	
	Если МассивСообщений = Неопределено Тогда
		МассивСообщений = Новый Массив;
	КонецЕсли;     
	
    НомерДокумента=ДокументСсылка.Номер;

	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой);
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	ТемаПисьма="Новая заявка на договор № "+НомерДоговора+" по заказу №"+НомерДокумента+"";
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо по Заказу клиента " + НомерДокумента + " НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
			Иначе
				
			ТекстСообщения = "Отправлено письмо по Заказу клиента " + НомерДокумента + " на почту " +  АдресаДляОтправкиСтрокой;
			
			КонецЕсли;
				
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
			Успех = Истина;
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокументСсылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ТекстСообщения = "Не удалось отправить письмо по заявке на пусконаладку "  + НомерДокумента + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			МассивСообщений.Добавить(ТекстСообщения);
		КонецПопытки;
	КонецЕсли; 
	
	Возврат Успех;
	
КонецФункции //-- #1334 смарт: Фролов 03.04.2023

//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С
Функция ПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой = "") 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	|	И НЕ смартПредопределенныеЗначения.СписокЗначений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенноеЗначение
	|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений";
	
	Запрос.УстановитьПараметр("ПредопределенноеЗначение", Справочники.смартПредопределенныеЗначения.ПользователиДляОповещенияОЗаявкахНаНовыйДоговор);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
	
КонецФункции  //-- #1334 смарт: Фролов 03.04.2023

//++ #1436 смарт: Лопато 25.09.2023 //Проверка валюты в Заказе и Договоре при проведении 
Процедура смартПроставитьГруппуФинансовогоУчета(ДоговорОбъект) Экспорт
	
	Если ДоговорОбъект.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГруппыФинансовогоУчетаРасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
		|ГДЕ
		|	НЕ ГруппыФинансовогоУчетаРасчетов.ПометкаУдаления
		|	И ГруппыФинансовогоУчетаРасчетов.ПорядокОплаты = &ПорядокОплаты
		|	И ГруппыФинансовогоУчетаРасчетов.РасчетыСКлиентами";
		
		Запрос.Параметры.Вставить("ПорядокОплаты", ДоговорОбъект.ПорядокОплаты);	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДоговорОбъект.ГруппаФинансовогоУчета = ВыборкаДетальныеЗаписи.Ссылка;
		Иначе
			ДоговорОбъект.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка();
		КонецЕсли;	
		
		ДоговорОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #1436 смарт: Лопато 25.09.2023

//++ #Б2762 смарт: Шляпников 08.04.2025 / Автоматические уведомления для Партнёров
Функция ПолучитьФайлУведомленияОГотовностиКПередаче(Договор) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("смартУведомлениеОГотовностиКПередаче");
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Номер,Дата,Контрагент.НаименованиеПолное,смартУполномоченноеЛицоЗаПодписаниеДоговораФИО,смартУполномоченноеЛицоЗаПодписаниеДоговораДолжность");
	
	Область.Параметры.ДатаФормирования = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	Область.Параметры.НомерДоговора = Реквизиты.Номер;
	Область.Параметры.ДатаДоговора = Формат(Реквизиты.Дата, "ДФ=dd.MM.yyyy");
	Область.Параметры.Контрагент = Реквизиты.КонтрагентНаименованиеПолное;
	Область.Параметры.Должность = Реквизиты.смартУполномоченноеЛицоЗаПодписаниеДоговораДолжность;
	Область.Параметры.ФИО = Реквизиты.смартУполномоченноеЛицоЗаПодписаниеДоговораФИО;
	
	Таб.Вывести(Область);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
	Таб.АвтоМасштаб = Истина;
	Таб.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти

#КонецЕсли