
#Область ПеренесеноСДоработками

&После("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//смартКаратеев ++
	ПроверяемыеРеквизиты.Добавить("ГруппаФинансовогоУчета");	
	ПроверяемыеРеквизиты.Добавить("СтатьяДвиженияДенежныхСредств");
	//Каратеев --
	
	// Смарт Фролов+
	// Добавим проверку на заполненость Статьи ДДС
	//Если Не ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда 
	//	ТекстОшибки = НСтр("ru='Не указана Статья ДДС.'");
	//	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		ТекстОшибки,
	//		ЭтотОбъект,
	//		"СтатьяДвиженияДенежныхСредств",
	//		,
	//		Отказ);
	//КонецЕсли;
	// Фролов-
КонецПроцедуры

&После("ПриКопировании")
Процедура смарт_ПриКопированииПосле(ОбъектКопирования)

	//++#1138 смарт: Лопато 17.10.2022 //Добавление поля Грузополучатель в договоре для подстановки в Реализацию товаров и услуг.	
	смартГрузополучатель = Неопределено;
	//--#1138 смарт: Лопато 17.10.2022	

	//++#1329 смарт: Лопато 21.03.2023 //Признак подписания договора
	смартДоговорПодписан = Ложь;
	//--#1329 смарт: Лопато 21.03.2023
	
	//++ #1334 смарт: Фролов 17.04.2023 //Заявка на формирование и подписание договора из 1С  
	смартЗаказКлиента=Неопределено; 
	//-- #1334 смарт: Фролов 17.04.2023
КонецПроцедуры

#КонецОбласти