
////////////////////////////////////////////////////////////////////////////////
// CRM MS Exchange сервер экспортные методы
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Методы, вызывающие защищенный модуль

#Область ПрочиеМетоды

// Получить смещение времени строкой для MSExchange.
//
// Параметры:
//  СмещениеВремениВМинутах	 - Число - Смещение времени в минутах. 
// 
// Возвращаемое значение:
//  Строка - Смещение времени строкой.  
//
Функция ПолучитьСмещениеВремениСтрокойДляMSExchange(СмещениеВремениВМинутах) Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьСмещениеВремениСтрокойДляMSExchange(СмещениеВремениВМинутах);
КонецФункции

// Проверить подключение.
//
// Параметры:
//  Подключение	 - Структура - Структура подключения.
// 
// Возвращаемое значение:
//  Структура - Результат проверки подключения.
//                                            
Функция ПроверитьПодключение(Подключение) Экспорт
	Возврат CRM_MSExchangeСервер.ПроверитьПодключение(Подключение);
КонецФункции

#КонецОбласти // ПрочиеМетоды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВидыТелефоновMSExchange() Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьВидыТелефоновMSExchange();
КонецФункции

Функция ПолучитьВидыАдресовMSExchange() Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьВидыАдресовMSExchange();
КонецФункции

#Область Контакты

Функция СоздатьКонтакт(Подключение, FolderId = Неопределено, DistinguishedFolderId = Неопределено, Данные, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.СоздатьКонтакт(Подключение, FolderId, DistinguishedFolderId, Данные, СтрокаОшибки);
КонецФункции

Функция ПолучитьКонтакт(Подключение, ID, ChangeKey = Неопределено, BaseShape = Неопределено, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьКонтакт(Подключение, ID, ChangeKey, BaseShape, СтрокаОшибки);
КонецФункции

Функция ОбновитьКонтакт(Подключение, Данные, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ОбновитьКонтакт(Подключение, Данные, СтрокаОшибки);
КонецФункции

Функция НайтиКонтакты(Подключение, СтрокаЗапроса = "", Ограничение = "", FolderId = Неопределено, DistinguishedFolderId = Неопределено, BaseShape = "IdOnly", СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.НайтиКонтакты(Подключение, СтрокаЗапроса, Ограничение, FolderId, DistinguishedFolderId, BaseShape, СтрокаОшибки);
КонецФункции

Функция ПолучитьСоставГруппыКонтактов(Подключение, ID, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьСоставГруппыКонтактов(Подключение, ID, СтрокаОшибки);
КонецФункции

#КонецОбласти // Контакты

#Область События

Функция СоздатьСобытие(Подключение, FolderId = Неопределено, DistinguishedFolderId = Неопределено, Данные, СтрокаОшибки = "", ДополнительныеДанные = Неопределено) Экспорт
	Возврат CRM_MSExchangeСервер.СоздатьСобытие(Подключение, FolderId, DistinguishedFolderId, Данные, СтрокаОшибки, ДополнительныеДанные);
КонецФункции

Функция НайтиСобытия(Подключение, СтрокаЗапроса = "", Ограничение = "", FolderId = Неопределено, DistinguishedFolderId = Неопределено, BaseShape = "IdOnly", СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.НайтиСобытия(Подключение, СтрокаЗапроса, Ограничение, FolderId, DistinguishedFolderId, BaseShape, СтрокаОшибки);
КонецФункции

Функция ПолучитьСобытие(Подключение, ID, ChangeKey = Неопределено, BaseShape = Неопределено, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьСобытие(Подключение, ID, ChangeKey, BaseShape, СтрокаОшибки);
КонецФункции

Функция ОбновитьСобытие(Подключение, Данные, СтрокаОшибки = "", ДополнительныеДанные = Неопределено) Экспорт
	Возврат CRM_MSExchangeСервер.ОбновитьСобытие(Подключение, Данные, СтрокаОшибки, ДополнительныеДанные);
КонецФункции

#КонецОбласти // События

#Область Почта

Функция СоздатьПочтовоеСообщение(Подключение, FolderId = Неопределено, DistinguishedFolderId = Неопределено, Данные, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.СоздатьПочтовоеСообщение(Подключение, FolderId, DistinguishedFolderId, Данные, СтрокаОшибки);
КонецФункции

Функция ПолучитьПочтовоеСообщение(Подключение, ID, ChangeKey = Неопределено, BaseShape = Неопределено, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьПочтовоеСообщение(Подключение, ID, ChangeKey, BaseShape, СтрокаОшибки);
КонецФункции

Функция НайтиПочтовыеСообщения(Подключение, СтрокаЗапроса = "", Ограничение = "", FolderId = Неопределено, DistinguishedFolderId = Неопределено, BaseShape = "IdOnly", СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.НайтиПочтовыеСообщения(Подключение, СтрокаЗапроса, Ограничение, FolderId, DistinguishedFolderId, BaseShape, СтрокаОшибки);
КонецФункции

#КонецОбласти // Почта

#Область Задачи

Функция НайтиЗадачи(Подключение, СтрокаЗапроса = "", Ограничение = "", FolderId = Неопределено, DistinguishedFolderId = Неопределено, BaseShape = "IdOnly", СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.НайтиЗадачи(Подключение, СтрокаЗапроса, Ограничение, FolderId, DistinguishedFolderId , BaseShape, СтрокаОшибки);
КонецФункции

Функция ПолучитьЗадачу(Подключение, ID, ChangeKey = Неопределено, BaseShape = Неопределено, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьЗадачу(Подключение, ID, ChangeKey, BaseShape, СтрокаОшибки);
КонецФункции

Функция СоздатьЗадачу(Подключение, FolderId = Неопределено, DistinguishedFolderId = Неопределено, Данные, СтрокаОшибки = "", ДополнительныеДанные = Неопределено) Экспорт
	Возврат CRM_MSExchangeСервер.СоздатьЗадачу(Подключение, FolderId, DistinguishedFolderId, Данные, СтрокаОшибки, ДополнительныеДанные);
КонецФункции

Функция ОбновитьЗадачу(Подключение, Данные, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ОбновитьЗадачу(Подключение, Данные, СтрокаОшибки);
КонецФункции

#КонецОбласти // Задачи

#Область ПрочиеМетоды

Функция ДобавитьСтрокуДереваСозданияДанных(Строки, ИмяТега, ЗначениеТега) Экспорт
	Возврат CRM_MSExchangeСервер.ДобавитьСтрокуДереваСозданияДанных(Строки, ИмяТега, ЗначениеТега);
КонецФункции

Процедура ЗаписатьДатыПоследнегоОбмена(	Настройка,
										ДатаПоследнегоОбменаКонтактов1СMSExchange = Неопределено,
										ДатаПоследнегоОбменаКонтактовMSExchange1С = Неопределено,
										ДатаПоследнегоОбменаСобытий1СMSExchange = Неопределено,
										ДатаПоследнегоОбменаСобытийMSExchange1С = Неопределено,
										ДатаПоследнегоОбменаПочтовыхСообщенийВходящие1СMSExchange = Неопределено,
										ДатаПоследнегоОбменаПочтовыхСообщенийВходящиеMSExchange1С = Неопределено,
										ДатаПоследнегоОбменаПочтовыхСообщенийОтправленные1СMSExchange = Неопределено,
										ДатаПоследнегоОбменаПочтовыхСообщенийОтправленныеMSExchange1С = Неопределено,
										ДатаПоследнегоОбменаСпискиРассылокMSExchange1С = Неопределено,
										ДатаПоследнегоОбменаЗадач1СMSExchange = Неопределено,
										ДатаПоследнегоОбменаЗадачMSExchange1С = Неопределено) Экспорт

	CRM_MSExchangeСервер.ЗаписатьДатыПоследнегоОбмена(	Настройка,
														ДатаПоследнегоОбменаКонтактов1СMSExchange,
														ДатаПоследнегоОбменаКонтактовMSExchange1С,
														ДатаПоследнегоОбменаСобытий1СMSExchange,
														ДатаПоследнегоОбменаСобытийMSExchange1С,
														ДатаПоследнегоОбменаПочтовыхСообщенийВходящие1СMSExchange,
														ДатаПоследнегоОбменаПочтовыхСообщенийВходящиеMSExchange1С,
														ДатаПоследнегоОбменаПочтовыхСообщенийОтправленные1СMSExchange,
														ДатаПоследнегоОбменаПочтовыхСообщенийОтправленныеMSExchange1С,
														ДатаПоследнегоОбменаСпискиРассылокMSExchange1С,
														ДатаПоследнегоОбменаЗадач1СMSExchange,
														ДатаПоследнегоОбменаЗадачMSExchange1С);
														
КонецПроцедуры

Функция Дата1СВДатуMsExchange(Знач Дата, Знач СмещениеВремениВМинутах = Неопределено) Экспорт
	Возврат CRM_MSExchangeСервер.Дата1СВДатуMsExchange(Дата, СмещениеВремениВМинутах);
КонецФункции

Функция ДатаMSExchangeВДату1С(Знач ДатаСтрока, Знач СмещениеВремениВМинутах = Неопределено) Экспорт
	Возврат CRM_MSExchangeСервер.ДатаMSExchangeВДату1С(ДатаСтрока, СмещениеВремениВМинутах);
КонецФункции

Функция ПолучитьBaseOffsetdurationСтрокой(СмещениеВремениВМинутах) Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьBaseOffsetdurationСтрокой(СмещениеВремениВМинутах);
КонецФункции

Функция UpdateItemЭтоПолеДляУдаления() Экспорт
	Возврат CRM_MSExchangeСервер.UpdateItemЭтоПолеДляУдаления();
КонецФункции

Функция ПолучитьБланкДеревоСозданияДанных() Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьБланкДеревоСозданияДанных();
КонецФункции

Функция УдалитьЭлемент(Подключение, ID, DeleteType = "SoftDelete", SendMeetingCancellations = Неопределено, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.УдалитьЭлемент(Подключение, ID, DeleteType, SendMeetingCancellations, СтрокаОшибки);
КонецФункции

Процедура ЗаписатьСоответствиеОбъектовMSExchange(УчетнаяЗапись, Объект1С, ID, ChangeKey = Неопределено, ДатаПоследнейМодификации = Неопределено) Экспорт
	CRM_MSExchangeСервер.ЗаписатьСоответствиеОбъектовMSExchange(УчетнаяЗапись, Объект1С, ID, ChangeKey, ДатаПоследнейМодификации);
КонецПроцедуры

Процедура УдалитьСоответствиеОбъектовMSExchange(УчетнаяЗапись, Объект1СИлиID) Экспорт
	CRM_MSExchangeСервер.УдалитьСоответствиеОбъектовMSExchange(УчетнаяЗапись, Объект1СИлиID);
КонецПроцедуры

Функция ПолучитьОбъект1СПоID(УчетнаяЗапись, ID, ChangeKey = Неопределено, ТаблицаКэш = Неопределено) Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьОбъект1СПоID(УчетнаяЗапись, ID, ChangeKey, ТаблицаКэш);
КонецФункции

Процедура ОбновитьChangeKeyВСоответствииОбъектовMSExchange(УчетнаяЗапись, Объект1С, ChangeKey) Экспорт
	CRM_MSExchangeСервер.ОбновитьChangeKeyВСоответствииОбъектовMSExchange(УчетнаяЗапись, Объект1С, ChangeKey);
КонецПроцедуры

Функция СформироватьСтруктуруПодключения(Настройка) Экспорт
	Возврат CRM_MSExchangeСервер.СформироватьСтруктуруПодключения(Настройка);
КонецФункции

Функция ПолучитьПапку(Подключение, FolderId = Неопределено, DistinguishedFolderId = Неопределено, BaseShape = "AllProperties", СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьПапку(Подключение, FolderId, DistinguishedFolderId, BaseShape, СтрокаОшибки);
КонецФункции

Функция ПолучитьДеревоПапок(Подключение, FolderId = Неопределено, DistinguishedFolderId = Неопределено, СтрокаОшибки = "") Экспорт
	Возврат CRM_MSExchangeСервер.ПолучитьДеревоПапок(Подключение, FolderId, DistinguishedFolderId, СтрокаОшибки);
КонецФункции

#КонецОбласти // ПрочиеМетоды

#КонецОбласти

