//из-за ошибки платформы не удаляются (и не переименовываются) реквизиты на форме смартЦенаМин и смартЦенаМакс (колонки в табличнйо части), 
//поэтому реквизиты табличной части названы  смартЦенаМинНовая и смартЦенаМаксНовая; 

 
#Область ПеренесеноСДоработками

#Область СобытияФормы

//Каратеев+
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//++ смарт:ММ #063 305 17.08.2020 - Заказ клиента - поле Особые условия отгрузки 
	НовыйЭлемент = Элементы.Вставить("смартОсобыеУсловияОтгрузки", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.ГруппаПодпискаНаОповещения);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартОсобыеУсловияОтгрузки";
	//НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	//-- смарт:ММ 17.08.2020
	
	//++ смарт:ММ #086 362 16.12.2020
	НоваяГруппа = Элементы.Вставить("смартГруппа", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.ГруппаПодпискаНаОповещения);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	//++ смарт:ММ #093 450 04.02.2021 - Доработка Заказа клиента
	смартГруппаКолонкаЛевая = Элементы.Добавить("смартГруппаКолонкаЛевая", Тип("ГруппаФормы"), Элементы.смартГруппа);
	смартГруппаКолонкаЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаКолонкаЛевая.ОтображатьЗаголовок = Ложь;
	смартГруппаКолонкаЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	Элементы.Переместить(Элементы.смартОсобыеУсловияОтгрузки, смартГруппаКолонкаЛевая);
	
	смартГруппаКолонкаПравая = Элементы.Добавить("смартГруппаКолонкаПравая", Тип("ГруппаФормы"), Элементы.смартГруппа);
	смартГруппаКолонкаПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаКолонкаПравая.ОтображатьЗаголовок = Ложь;
	смартГруппаКолонкаПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("смартДатаОплаты", Тип("ПолеФормы"), смартГруппаКолонкаПравая);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартДатаОплаты";
		
	НовыйЭлемент = Элементы.Добавить("смартПродажаЧерезДилера", Тип("ПолеФормы"), смартГруппаКолонкаПравая);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартПродажаЧерезДилера";
	НовыйЭлемент.ЦветТекстаЗаголовка = WebЦвета.Синий;
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(НовыйЭлемент.ШрифтЗаголовка, , 11, Истина);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартПродажаЧерезДилераПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("смартКонечныйПокупатель", Тип("ПолеФормы"), смартГруппаКолонкаПравая);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартКонечныйПокупатель";
	//-- смарт:ММ 04.02.2021

	//++ смарт:ММ #097 460 01.03.2021 Безвозмездная передача
	Если РольДоступна("смартИспользованиеБезвозмезднойПередачиТоваров") ИЛИ РольДоступна("ПолныеПрава") Тогда
	НовыйЭлемент = Элементы.Добавить("смартБезвозмезднаяПередача", Тип("ПолеФормы"), смартГруппаКолонкаПравая);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "Объект.смартБезвозмезднаяПередача";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смарт_СмартБезвозмезднаяПередачаПриИзменении"); //++ смарт:КМД #3_3 461 11.03.2021
	Иначе
		////++ смарт:КМД #3_3 461 11.03.2021 вывод информационной надписи для пользователя без роли
		Если Объект.смартБезвозмезднаяПередача = Истина Тогда
			НовыйЭлемент = Элементы.Добавить("смартБезвозмезднаяПередачаДекорация", Тип("ДекорацияФормы"), смартГруппаКолонкаПравая);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = "Это документ безвозмездной передачи товаров";
			НовыйЭлемент.ЦветТекста = WebЦвета.ОранжевоКрасный;
			НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт,,,Истина);
		КонецЕсли;
	КонецЕсли;
	//-- смарт:ММ 01.03.2021
	
	НастроитьВидимостьДоступность();
	//-- смарт:ММ 16.12.2020	
	
	//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
	НовыеРеквизиты = Новый Массив;
	смартСчетФактураСсылка = Новый РеквизитФормы("смартСчетФактураСсылка", Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданный"), "");
	НовыеРеквизиты.Добавить(смартСчетФактураСсылка);
	
	//++ #1436 смарт: Фролов 25.08.2023 //Проверка валюты в Заказе и Договоре при проведении 	
	смартВопросПроВалютуЗадан = Новый РеквизитФормы("смартВопросПроВалютуЗадан", Новый ОписаниеТипов("Булево"), "");
	НовыеРеквизиты.Добавить(смартВопросПроВалютуЗадан); 
	смартЖдемответаНаВопрос = Новый РеквизитФормы("смартЖдемответаНаВопрос", Новый ОписаниеТипов("Булево"), "");
	НовыеРеквизиты.Добавить(смартЖдемответаНаВопрос); 
	//-- #1436 смарт: Фролов 25.08.2023
	
	//++ смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 	
	КвалификаторСтр = Новый КвалификаторыСтроки(4);
	Реквизит = Новый РеквизитФормы("ОсновнойЭДО", Новый ОписаниеТипов("Строка",,,,КвалификаторСтр));
	НовыеРеквизиты.Добавить(Реквизит); 	
	//-- смарт: #1438 Корбутов 04.09.2023
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	//-- смарт:ММ 13.02.2020
	Для Каждого Строка Из Объект.Товары Цикл
	  
		Если НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура)  Тогда			
			Если Параметры.Ключ.Пустая() Тогда
				Строка.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				Строка.Количество = 0;
				Строка.КоличествоУпаковок = 0;
			Иначе
				//Строка.Количество = СтрокуВЧисло(Строка.Характеристика);
				//Строка.КоличествоУпаковок = Строка.Количество;
				//
				//РасшСмарт_УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Строка.Номенклатура);
			КонецЕсли;
		КонецЕсли;

		//Проверяет и устанавливает оформление для Рекламного воздействия
		РекламноеВоздействиеНеЗаполнено = Строка.РекламноеВоздействие = Справочники.смартИсточникиРекламногоВоздействия.ПустаяСсылка();
		//++ #1338 смарт: Фролов 10.04.2023 //Мелкие доработки  
		//РасшСмарт_УсловноеОформлениеРекламныеВоздействия(Строка.Номенклатура, РекламноеВоздействиеНеЗаполнено)
		РасшСмарт_УсловноеОформлениеРекламныеВоздействия(Строка.Номенклатура, РекламноеВоздействиеНеЗаполнено);
		КтоПередалНеЗаполнено = Строка.смартКтоПередал = Справочники.Пользователи.ПустаяСсылка();			
		смартУсловноеОформлениеКтоПередал(Строка.Номенклатура, КтоПередалНеЗаполнено);
		//-- #1338 смарт: Фролов 10.04.2023
		
		//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
		КтоКонсультировалНеЗаполнено = Строка.смартКтоКонсультировал = Справочники.Пользователи.ПустаяСсылка();
		смартУсловноеОформлениеКтоПередал(Строка.Номенклатура, КтоКонсультировалНеЗаполнено, "смартКтоКонсультировал");
		//-- #1936 смарт: Шляпников 20.01.2025
		
	КонецЦикла;
	
	//++ смарт:Каратеев #1504 17.10.2023 //Убрать права бухгалтерам, кто может менять согласовано фин, злоупотребляют
	//удалил автора Богус
	Элементы.ДатаЗакрытия.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт") И Объект.ДатаЗакрытия < ТекущаяДата()Тогда
		Элементы.Статус.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	КонецЕсли;										
	//-- смарт:Каратеев #1504 17.10.2023 //Убрать права бухгалтерам, кто может менять согласовано фин, злоупотребляют
	
	//Богус++
	Если  НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда 
	Объект.ДатаОтгрузки = ТекущаяДата()+172800;
	КонецЕсли;
	Объект.ДатаСогласования = ТекущаяДата();
	//Богус--
	
	//++ смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 
	КонтрМасс = Новый Массив;
	КонтрМасс.Добавить(Объект.Контрагент);
	КонтрагентИЭДО = смартОбщегоНазначения.ПолучитьОсновнойЭДОКонтрагентов(КонтрМасс);
	ЭтаФорма.ОсновнойЭДО = КонтрагентИЭДО[Объект.Контрагент];
    
	НовыйЭлемент = Элементы.Добавить("смартВыборОсновногоЭДО", Тип("ПолеФормы"), Элементы.смартГруппаСогласованоБУХ);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаСпискаВыбора = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.ПутьКДанным = "ОсновнойЭДО";
	НовыйЭлемент.МаксимальнаяШирина = 23; 
	НовыйЭлемент.Ширина = 23;  
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	смартОбщегоНазначения.ЗаполнитьСписокВыбораЭДОНаСервере(НовыйЭлемент);
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора","смартОбработкаВыбораОсновногоЭДО");
	НовыйЭлемент.Подсказка = "Оператор ЭДО, предпочитаемый контрагентом";  
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартВыборОсновногоЭДО", "поле ""ВыборОсновного ЭДО Контрагента""", 
													 Элементы.смартГруппаСогласованоБУХ, ЭтаФорма);
//-- смарт: #1438 Корбутов 04.09.2023 

	УстановитьЦветИСтатусСогласования();
	УстановитьВидимостьПредупреждений();
	УстановитьЗначенияДляНовогоДокумента();
	ИзменитьДоступностьПоКомиссии();
	УстановитьВидимостьДоработанныхЭлементов();
	// Фролов+
	Если ПравоДоступа("Добавление",Метаданные.Документы.смартПредзаказПоставщику) Тогда 
		ЭтаФорма.Элементы.Переместить(Элементы.Найти("ФормаДокументсмартПредзаказПоставщикуСоздатьНаОсновании"),Элементы.Найти("ПодменюСоздатьНаОснованииОбычное"));
	КонецЕсли; 
	//Каратеев //Элементы.смартПроводитьДокументПриВысокомСПАРКРиске.Доступность=РольДоступна("ПолныеПрава") Или РольДоступна("смартНеПроверятьСПАРКРиски");
	ЗакрытьРеквизитыДляРедактирования();
	Если Объект.Ссылка.Пустая() Тогда 
		//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
		Объект.смартКонечнаяДатаРезерва = КонецДня(смартСервер.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ТекущаяДата(),7));
		//--#1205 смарт: Лопато 05.10.2022
	Иначе
		//++ смарт:ММ #024 201 25.02.2020 - оптимизация открытия Заказа клиента
		// Вариант с реквизитами объекта. Заполнение оставлено только для старых документов, у которых Табличная часть не пустая и не заполнены колонки смартЦенаМин (смартЦенаМакс, ЦенаСоСкидкой)
        //Если Объект.Товары.Итог("смартЦенаМинНовая") = 0 Тогда
        //	//Смарт {[+](фрагмент Удален), Подкин Алексей Иванович 26.05.2021 12:52:13 задача 539 перенос расчета в процедуру ОбработатьСтрокуТЧ
        //	//смартЗаполнитьМинМаксЦенуДляВсейТаблицы();//++ смарт:ММ #024 201 24.02.2020 - оптимизация открытия Заказа клиента
        //	//Если Объект.Товары.Итог("смартЦенаМинНовая") <> 0 Тогда
        //	//	Модифицированность = Истина;
        //	//КонецЕсли;
        //	//Смарт }Подкин Алексей Иванович 26.05.2021 12:52:13

        //Иначе
        //	// Установить условное оформление
        //	Для Каждого Стр Из Объект.Товары Цикл
        //		Если Стр.ЦенаСоСкидкой <> 0 ИЛИ Стр.ЦенаСоСкидкой = Неопределено 
        //			И Стр.смартЦенаМинНовая <> 0 И Стр.смартЦенаМаксНовая <> 0 Тогда
        //			
        //			СтруктураЦен = Новый Структура;
        //			СтруктураЦен.Вставить("НомерСтроки", 	Стр.НомерСтроки);
        //			//СтруктураЦен.Вставить("ВидЦены", 		ВидМаксимальнойЦены);
        //			СтруктураЦен.Вставить("смартЦенаМин",	Стр.смартЦенаМинНовая);
        //			СтруктураЦен.Вставить("смартЦенаМакс", 	Стр.смартЦенаМаксНовая);
        //			
        //			ТекущаяСтрокаСтруктура = Новый Структура;
        //			ТекущаяСтрокаСтруктура.Вставить("Валюта", Объект.Валюта);
        //			ТекущаяСтрокаСтруктура.Вставить("Дата", 	Объект.Дата);
        //			ТекущаяСтрокаСтруктура.Вставить("Цена");
        //			ТекущаяСтрокаСтруктура.Вставить("ЦенаСоСкидкой");
        //			ТекущаяСтрокаСтруктура.Вставить("Номенклатура");
        //			ТекущаяСтрокаСтруктура.Вставить("Характеристика");
        //			ТекущаяСтрокаСтруктура.Вставить("Упаковка");
        //			ТекущаяСтрокаСтруктура.Вставить("ИсходныйНомерСтроки"); 
        //			ТекущаяСтрокаСтруктура.Вставить("НомерСтроки", Стр.НомерСтроки);
        //			ЗаполнитьЗначенияСвойств(ТекущаяСтрокаСтруктура, Стр); 
        //			
        //			смартРассчитатьОтклонениеЦеныОтРекомендованного(ТекущаяСтрокаСтруктура, СтруктураЦен);
        //		КонецЕсли;
        //		
        //	КонецЦикла;
        //КонецЕсли;
		//-- смарт:ММ 25.02.2020
	КонецЕсли;
	
	Элементы.смартДатаПродленияРезервов.Доступность = (ПроцентОплаты = 0) И (Пользователи.РолиДоступны("ПолныеПрава,смартПродлениеРезервовТоваров"));
	Элементы.смартПродлитьРезерв.Доступность=ПравоДоступа("Изменение",Метаданные.Документы.ЗаказКлиента) 
	//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
											//И Объект.смартКонечнаяДатаРезерва-ТекущаяДата()<=86400 И ПроцентОплаты=0;
											И ПроцентОплаты=0
											И смартОбщегоНазначения.смартЦелыхДнейМеждуДатами(ТекущаяДата(), Объект.смартКонечнаяДатаРезерва) < 1;
	//--#1205 смарт: Лопато 05.10.2022
	
	Если ПроцентОплаты=0 И ЗначениеЗаполнено(Объект.смартКонечнаяДатаРезерва) Тогда
        ТекстРезерв=?(ЗначениеЗаполнено(Объект.смартДатаПродленияРезервов),"Резерв продлен до: ","Резерв до: ");
		Элементы.смартРезервДо.Заголовок=ТекстРезерв+Формат(Объект.смартКонечнаяДатаРезерва,"ДЛФ=D");
	ИначеЕсли ЗначениеЗаполнено(Объект.смартКонечнаяДатаРезерва) Тогда
		Элементы.смартРезервДо.Заголовок="Оплачено. Резерв не ограничен";
	КонецЕсли;
	Элементы.смартГруппаРезервы.Видимость=ЗначениеЗаполнено(Объект.смартКонечнаяДатаРезерва) И ПроцентОтгрузки<100 И Объект.Проведен
											И Не Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт");
	//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
	НовыеРеквизиты = Новый Массив;
	Реквизит_смартРезервЗаканчивается = Новый РеквизитФормы("смартРезервЗаканчивается", Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(Реквизит_смартРезервЗаканчивается);
	ИзменитьРеквизиты(НовыеРеквизиты);
	//Объект.смартРезервЗаканчивается=ПроцентОплаты=0 И Объект.смартКонечнаяДатаРезерва-ТекущаяДата()<=86400;
	ЭтаФорма.смартРезервЗаканчивается=ПроцентОплаты=0 И смартОбщегоНазначения.смартЦелыхДнейМеждуДатами(ТекущаяДата(), Объект.смартКонечнаяДатаРезерва) < 1;
	//--#1205 смарт: Лопато 05.10.2022
	
	Элементы.смартЗаявкаВыполненаПоАкту.Видимость = Пользователи.РолиДоступны("ПолныеПрава,смартСервисныйЦентрАдминистрирование");
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница=?(Объект.Ссылка.Пустая(),Элементы.ГруппаОсновное,Элементы.ГруппаТовары);
	
	ДобавитьУсловноеОформление();
	// Фролов-
		
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 05.03.2021 14:58:08
    
    Запрос = Новый Запрос;
    Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
    |	ДополнительныеСведения.Значение КАК ЗначениеСв
    |ИЗ
    |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
    |ГДЕ
    |	ДополнительныеСведения.Свойство.Наименование Подобно &ИмяСвойства
    |   И ДополнительныеСведения.Объект=&ОбъектОффлайн";

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Запрос.УстановитьПараметр("ОбъектОффлайн", Объект.Ссылка);
		Запрос.УстановитьПараметр("ИмяСвойства", "%Оффлайн%заказ%");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартОффлайн", Тип("ДекорацияФормы"),Элементы.ГруппаСтатусПриоритет);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			Если ВыборкаДетальныеЗаписи.ЗначениеСв="Y" Тогда
				НовыйЭлемент.ЦветТекста=Новый Цвет(255,0,0); 
				НовыйЭлемент.Заголовок = "Оффлайн";
				
			иначеЕсли ВыборкаДетальныеЗаписи.ЗначениеСв="N" Тогда
				НовыйЭлемент.ЦветТекста=Новый Цвет(0,194,0);
				НовыйЭлемент.Заголовок = "Онлайн";
			КонецЕсли; 
		Иначе
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартОффлайн", Тип("ДекорацияФормы"),Элементы.ГруппаСтатусПриоритет);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.ЦветТекста=Новый Цвет(128,128,128);
			НовыйЭлемент.Заголовок = "Не выгружался";
		КонецЕсли;
		
	КонецЕсли; 
	//Смарт }Подкин Алексей Иванович 05.03.2021 14:58:08
	
	//++ Смарт: Белоусова 566 27.06.2021
	элементы.СпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал,"Самовывоз со склада Адмирал/Атлант");
	
	
	//++ #1228 смарт: Фролов 24.11.2022 //Заказ клиента Раздел Доставка - доработать //Добавил второго водителя, причесал форму 
	
	смартГруппаДоставка = Элементы.Добавить("смартГруппаДоставкаДоп", Тип("ГруппаФормы"), Элементы.СтраницаСамовывоз);//Элементы.ГруппаСпособДоставкиПеревозчик);//Элементы.ГруппаДополнительно);
	смартГруппаДоставка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаДоставка.Заголовок = "Транспортное средство и доставка";
	смартГруппаДоставка.ОтображатьЗаголовок = Истина;
	смартГруппаДоставка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("смартВидТранспорта", Тип("ПолеФормы"),смартГруппаДоставка);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартВидТранспорта";

	НовыйЭлемент = Элементы.Добавить("смартНомерМашины", Тип("ПолеФормы"),смартГруппаДоставка);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартНомерМашины";
	
	НовыйЭлемент = Элементы.Добавить("смартНомерПрицепа", Тип("ПолеФормы"),смартГруппаДоставка);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартНомерПрицепа";
	
	смартГруппаДоставка2 = Элементы.Добавить("смартГруппаДоставкаДоп2", Тип("ГруппаФормы"), смартГруппаДоставка);
	смартГруппаДоставка2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаДоставка2.ОтображатьЗаголовок = Ложь;
	смартГруппаДоставка2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	НовыйЭлемент = Элементы.Добавить("смартЖелаемаяДатаОтгрузкиАдмирал", Тип("ПолеФормы"),смартГруппаДоставка2);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартЖелаемаяДатаОтгрузкиАдмирал";

	НовыйЭлемент = Элементы.Добавить("смартЖелаемоеВремяОтгрузки", Тип("ПолеФормы"),смартГруппаДоставка2);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартЖелаемоеВремяОтгрузки";
	
	
	смартГруппаВодители = Элементы.Добавить("смартГруппаВодители", Тип("ГруппаФормы"), смартГруппаДоставка);
	смартГруппаВодители.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВодители.Заголовок = "Данные водителей";
	смартГруппаВодители.ОтображатьЗаголовок = Истина;
	смартГруппаВодители.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
	смартГруппаПервыйВодитель = Элементы.Добавить("смартГруппаПервыйВодитель", Тип("ГруппаФормы"), смартГруппаВодители);
	смартГруппаПервыйВодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаПервыйВодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("смартФИОВодителя", Тип("ПолеФормы"),смартГруппаПервыйВодитель);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартФИОВодителя";

	НовыйЭлемент = Элементы.Добавить("смартНомерСерияПаспортВодителя", Тип("ПолеФормы"),смартГруппаПервыйВодитель);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартНомерСерияПаспортВодителя";

	НовыйЭлемент = Элементы.Добавить("смартДатаВыдачиПаспортаВодителя", Тип("ПолеФормы"),смартГруппаПервыйВодитель);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартДатаВыдачиПаспортаВодителя"; 
	
	смартГруппаВторойВодитель = Элементы.Добавить("смартГруппаВторойВодитель", Тип("ГруппаФормы"), смартГруппаВодители);
	смартГруппаВторойВодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаВторойВодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("смартФИОВторогоВодителя", Тип("ПолеФормы"),смартГруппаВторойВодитель);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартФИОВторогоВодителя";

	НовыйЭлемент = Элементы.Добавить("смартНомерСерияПаспортВторогоВодителя", Тип("ПолеФормы"),смартГруппаВторойВодитель);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартНомерСерияПаспортВторогоВодителя";

	НовыйЭлемент = Элементы.Добавить("смартДатаВыдачиПаспортаВторогоВодителя", Тип("ПолеФормы"),смартГруппаВторойВодитель);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.ПутьКДанным = "Объект.смартДатаВыдачиПаспортаВторогоВодителя";
    //-- #1228 смарт: Фролов 24.11.2022
	
	//++ #1328 смарт: Фролов 22.03.2023 //Добавить спецификацию оборудования iECHO в Заявку на пусконаладку  
	смартГруппаДокументОснование = Элементы.Вставить("смартГруппаДокументОснование", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.ГруппаШапка);
	смартГруппаДокументОснование.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	смартГруппаДокументОснование.ОтображатьЗаголовок = Ложь;
	смартГруппаДокументОснование.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НоваяКоманда		= ЭтаФорма.Команды.Добавить("ВыборДокументаОснования");
	НоваяКоманда.Действие	= "ВыбратьДокументОснования";
	
	НовыйЭлемент = Элементы.Добавить("смартВыбратьДокументОснование", Тип("КнопкаФормы"),смартГруппаДокументОснование);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "ВыборДокументаОснования";
	НовыйЭлемент.Заголовок="Выбрать спецификацию IECHO";
	
	Элементы.ДокументОснование.Видимость=Истина;
	Элементы.Переместить(Элементы.ДокументОснование,смартГруппаДокументОснование); 
	//-- #1328 смарт: Фролов 22.03.2023
	//++ #1334 смарт: Фролов 30.03.2023 //Заявка на формирование и подписание договора из 1С  
	ЭлементсмартЗаполнитьЗаявкуНаДоговор=Элементы.Найти("смартЗаполнитьЗаявкуНаДоговор"); 
	Если ЭлементсмартЗаполнитьЗаявкуНаДоговор = Неопределено Тогда
		НоваяКоманда		= ЭтаФорма.Команды.Добавить("СформироватьЗаявкуНаПодготовкуДоговора");
		НоваяКоманда.Действие	= "смартЗаполнитьЗаявкуНаДоговорКоманда";
		
		НовыйЭлемент = Элементы.Вставить("смартЗаполнитьЗаявкуНаДоговор", Тип("КнопкаФормы"),Элементы.ГруппаНадписьДоговор);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "СформироватьЗаявкуНаПодготовкуДоговора";
		НовыйЭлемент.Заголовок="Заявка на договор"; 
		
		смартСервер.смартДобавитьКнопкуИнформацииНаФорму("СформироватьЗаявкуНаПодготовкуДоговора", "поле ""Заполнение заявки на договор""", 
													 Элементы.ГруппаНадписьДоговор, ЭтаФорма);
    КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Договор) И Элементы.Договор.Видимость И НЕ Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт") ТОгда 
	    Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Истина;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=Истина;
	Иначе
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Ложь;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=ложь;
	КонецЕсли;
	//-- #1334 смарт: Фролов 30.03.2023
	
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда
		Элементы.смартГруппаДоставкаДоп.Видимость = Истина;
		Элементы.смартЗаполнитьДоставкуПоКлиенту.Видимость = Ложь;
		Элементы.СтраницаДополнительныеРеквизитыДоставки.Видимость = Ложь;
	Иначе
		Элементы.смартГруппаДоставкаДоп.Видимость = Ложь;  
	КонецЕсли;
	  
	//-- Смарт: Белоусова 566 27.06.2021
	
     //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 16.11.2021 11:03:33 задача 552  Вывод трекномера из доп свойств заказа
    //Изменим способ переноса заголовков
    Элементы.АдресДоставкиПеревозчика.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.АдресДоставкиПеревозчика.Заголовок=СтрЗаменить(Элементы.АдресДоставкиПеревозчика.Заголовок,Символы.ПС," ");
    
    Элементы.ЗонаДоставкиПеревозчика.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.ЗонаДоставкиПеревозчика.Заголовок=СтрЗаменить(Элементы.ЗонаДоставкиПеревозчика.Заголовок,Символы.ПС," ");
    
    Элементы.ДополнительнаяИнформацияПоДоставке1.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.ДополнительнаяИнформацияПоДоставке1.Заголовок=СтрЗаменить(Элементы.ДополнительнаяИнформацияПоДоставке1.Заголовок,Символы.ПС," ");
    
    Элементы.АдресДоставкиПолучателя1.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.АдресДоставкиПолучателя1.Заголовок=СтрЗаменить(Элементы.АдресДоставкиПолучателя1.Заголовок,Символы.ПС," ");
    
    Элементы.АдресДоставкиСамовывоз.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.АдресДоставкиСамовывоз.Заголовок=СтрЗаменить(Элементы.АдресДоставкиСамовывоз.Заголовок,Символы.ПС," ");
    
    Элементы.ДополнительнаяИнформацияПоДоставке.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.ДополнительнаяИнформацияПоДоставке.Заголовок=СтрЗаменить(Элементы.ДополнительнаяИнформацияПоДоставке.Заголовок,Символы.ПС," ");
    
    Элементы.АдресДоставкиПолучателя2.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.АдресДоставкиПолучателя2.Заголовок=СтрЗаменить(Элементы.АдресДоставкиПолучателя2.Заголовок,Символы.ПС," ");
    
    Элементы.ДополнительнаяИнформацияПоДоставке2.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
    Элементы.ДополнительнаяИнформацияПоДоставке2.Заголовок=СтрЗаменить(Элементы.ДополнительнаяИнформацияПоДоставке2.Заголовок,Символы.ПС," ");

    //-------------------------------------------------------------------------------------------------------------------------------
    
    Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
        
        Запрос.УстановитьПараметр("ОбъектОффлайн", Объект.Ссылка);
        Запрос.УстановитьПараметр("ИмяСвойства", "Идентификатор отправления заказ");
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Если ВыборкаДетальныеЗаписи.Следующий() Тогда                                      
            НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартТрек", Тип("ДекорацияФормы"),Элементы.СтраницаДоставкаДоПолучателя);
            НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
            НовыйЭлемент.ЦветТекста = Новый Цвет(0,0,0); 
            НовыйЭлемент.Заголовок = "Номер отслеживания: "+ВыборкаДетальныеЗаписи.ЗначениеСв;
            
            НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартТрек2", Тип("ДекорацияФормы"),Элементы.СтраницаДоставкаПеревозчикомПоАдресу);
            НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
            НовыйЭлемент.ЦветТекста = Новый Цвет(0,0,0); 
            НовыйЭлемент.Заголовок = "Номер отслеживания: "+ВыборкаДетальныеЗаписи.ЗначениеСв;
            
            НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартТрек3", Тип("ДекорацияФормы"),Элементы.СтраницаДоставкаПеревозчиком);
            НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
            НовыйЭлемент.ЦветТекста = Новый Цвет(0,0,0); 
            НовыйЭлемент.Заголовок = "Номер отслеживания: "+ВыборкаДетальныеЗаписи.ЗначениеСв;
            
        КонецЕсли;
        
    КонецЕсли;
    
    //Смарт }Подкин Алексей Иванович 16.11.2021 11:03:33
	
	//смарт 914 Каратеев ++: Блокировка ЭтапыГрафикаОплаты по распоряжению Макачева А.Н. от 28.02.2022
	смартУстановитьДоступностьЭтаповОплаты();	
	//смарт 914 Каратеев --: Блокировка ЭтапыГрафикаОплаты
    
    //++ смарт:Подкин #1025 п2 20.05.2022 16:28:05 
    ПродажаВРублях=НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
	
	Если ПродажаВРублях и (НЕ ПользовательПолный() И НЕ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
        Элементы.ТоварыСмартКонвертацияЦены.Видимость=Ложь;
		
		//++ #4590 смарт: Тимофеева 08.10.2025 / Цена в долларах, информационно, в заказах клиента
		Элементы.ТоварыЦенаВВалюте.Видимость = Ложь;
		//-- #4590 смарт: Тимофеева 08.10.2025
    КонецЕсли; 
	
	Если НЕ ПродажаВРублях ИЛИ ПользовательПолный() ИЛИ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте") Тогда
		
        //++ смарт 914 02.03.2022: Каратеев //Выводим на форму курсы валюты 
        //Курс на дату документа 
		//++ #4252 смарт: Ермаков 02.09.20925 / Заменить курс, выводимый информационно, в заказах клиента с EUR на USD
		// Отключил код
		//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартКурсНаДатуДокумента", Тип("ДекорацияФормы"),Элементы.ГруппаСтатусПриоритет);
		//НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		//НовыйЭлемент.ЦветТекста= WebЦвета.Синий;
		//НовыйЭлемент.Заголовок = "Курс на " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy")+": "+ Символы.ПС
		//+"у.е.: "+РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("000"),Объект.Дата).Курс+ "/ "
		//+"EUR: "+РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(),Объект.Дата).Курс;
		////Курс на текущую дату	
		//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартКурсНаТекущуюДату", Тип("ДекорацияФормы"),Элементы.ГруппаСтатусПриоритет);
		//НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		//НовыйЭлемент.ЦветТекста= WebЦвета.Зеленый;
		//НовыйЭлемент.Заголовок = "Курс на " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")+": "+ Символы.ПС
		//+"у.е.: "+РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("000"),ТекущаяДата()).Курс+ "/ "
		//+"EUR: "+РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(),ТекущаяДата()).Курс; 
		
		// Добавил код
		ДатаДокумента = Объект.Дата; 
		ТекущаяДата = ТекущаяДатаСеанса();
		
		ВалютаУЕ = Справочники.Валюты.НайтиПоКоду("000");
		ВалютаUSD = Справочники.Валюты.НайтиПоКоду("840");
		
		КурсВалютыУЕНаДатуДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУЕ, ДатаДокумента).Курс;
		КурсВалютыUSDНаДатуДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаUSD, ДатаДокумента).Курс;
		
		КурсВалютыУЕНаТекущуюДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУЕ, ТекущаяДата).Курс;
		КурсВалютыUSDНаТекущуюДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаUSD, ТекущаяДата).Курс;		
		
		//Курс на дату документа
		НовыйЭлемент = смартФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, "смартКурсНаДатуДокумента", Элементы.ГруппаСтатусПриоритет, "", Ложь); 
        НовыйЭлемент.ЦветТекста = WebЦвета.Синий;
        НовыйЭлемент.Заголовок = 
			"Курс на " 
			+ Формат(ДатаДокумента, "ДФ=dd.MM.yyyy")
			+ ": "
			+ Символы.ПС			
	        + ВалютаУЕ.Наименование
			+ ": "
			+ КурсВалютыУЕНаДатуДокумента
			+ " / "
        	+ ВалютаUSD.Наименование
			+ ": "
			+ КурсВалютыUSDНаДатуДокумента;
			
        //Курс на текущую дату	
		НовыйЭлемент = смартФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, "смартКурсНаТекущуюДату", Элементы.ГруппаСтатусПриоритет, "", Ложь); 
        НовыйЭлемент.ЦветТекста = WebЦвета.Зеленый;
        НовыйЭлемент.Заголовок = 
			"Курс на " 
			+ Формат(ТекущаяДата, "ДФ=dd.MM.yyyy")
			+ ": " 
			+ Символы.ПС
	        + ВалютаУЕ.Наименование
			+ ": "
			+ КурсВалютыУЕНаТекущуюДату
			+ " / "
	        + ВалютаUSD.Наименование
			+ ": "
			+ КурсВалютыUSDНаТекущуюДату;
			
		//-- #4252 смарт: Ермаков 02.09.20925
        //-- смарт 914 02.03.2022: Каратеев //Выводим на форму курсы валюты     
        Элементы.ТоварыСмартКонвертацияЦены.Видимость=Истина;
		
		//++ #4590 смарт: Тимофеева 08.10.2025 / Цена в долларах, информационно, в заказах клиента
		Элементы.ТоварыСмартКонвертацияЦены.Видимость = Объект.Валюта = ВалютаUSD;
		Элементы.ТоварыЦенаВВалюте.Видимость = НЕ Объект.Валюта = ВалютаUSD;
		//-- #4590 смарт: Тимофеева 08.10.2025
		
    КонецЕсли; 
    //-- смарт:Подкин #1025 п2 20.05.2022 16:28:05

    //++ смарт:Подкин #946 24.03.2022 9:20:30
    Если НЕ Справочники.смартПредопределенныеЗначения.ОграничиватьВалютуЦены.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ОграничиватьВалютуЦены.Значение Тогда
        Элементы.Валюта.Доступность=Ложь; 
    КонецЕсли;  
    
    НовыйЭлемент = ЭтаФорма.Элементы.Вставить("смартВозможноВЕвро", Тип("ДекорацияФормы"),Элементы.ГруппаТовары,Элементы.Товары);
    НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
    НовыйЭлемент.ЦветТекста=Новый Цвет(255,0,0);
    НовыйЭлемент.Заголовок = "Доступно формирование заказа в ЕВРО!";
    НовыйЭлемент.Видимость=Ложь;
    //-- смарт:Подкин #946 24.03.2022 9:20:30
	
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("смартТаблицаСвобОстатков", ОписаниеТипаВыбора, "", "ТЗН")); 
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Организация");
	ТЗ.Колонки.Добавить("Склад");
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("ВлияниеНаОстатки");
	Для Каждого Колонка Из ТЗ.Колонки Цикл
	    МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"смартТаблицаСвобОстатков"));
	КонецЦикла;	
	
	Реквизит_смартГруппаОстаткиРазвернута = Новый РеквизитФормы("смартГруппаОстаткиРазвернута", Новый ОписаниеТипов("Булево"));
	МассивРеквизитов.Добавить(Реквизит_смартГруппаОстаткиРазвернута);   
	
	Реквизит_смартНадписьОстаткиПоОрганизациямПредыдущий = Новый РеквизитФормы("смартНадписьОстаткиПоОрганизациямПредыдущий", Новый ОписаниеТипов("Строка"));
	МассивРеквизитов.Добавить(Реквизит_смартНадписьОстаткиПоОрганизациямПредыдущий);
	
	Реквизит_смартСписокСкладов = Новый РеквизитФормы("смартСписокСкладов", Новый ОписаниеТипов("СписокЗначений"));
	МассивРеквизитов.Добавить(Реквизит_смартСписокСкладов);
	
	ИзменитьРеквизиты(МассивРеквизитов); 
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Склады.Ссылка КАК Склад
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	Склады.смартНазначениеСклада В(&Назначения)
			|	И НЕ Склады.ПометкаУдаления");
	МасНазначений=Новый Массив;
	МасНазначений.Добавить(Перечисления.смартНазначенияСкладов.ТорговыйСклад);
	МасНазначений.Добавить(Перечисления.смартНазначенияСкладов.ДемоЗал);
	МасНазначений.Добавить(Перечисления.смартНазначенияСкладов.ПустаяСсылка());
	Запрос.УстановитьПараметр("Назначения",МасНазначений); 
	ЭтаФорма.смартСписокСкладов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад"));

	смартЗаполнитьТаблицуСвобождныхОстатковДляДокумента(); 
	
    ГруппаОстатки = Элементы.Вставить("смартГруппаОстаткиПоОрганизациям", Тип("ГруппаФормы"), Элементы.ГруппаТовары,Элементы.Товары);
    ГруппаОстатки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаОстатки.ОтображатьЗаголовок = Ложь; 
    ГруппаОстатки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
    НовыйЭлемент = Элементы.Добавить("смартСтрелкаВниз", Тип("ДекорацияФормы"),Элементы.смартГруппаОстаткиПоОрганизациям);
    НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
    НовыйЭлемент.Картинка=БиблиотекаКартинок.СтрелкаВнизЗеленая; 
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие","смартСвернутьРазвернутьОстаткиПоОрганизациям");
	
    НовыйЭлемент = Элементы.Добавить("смартНадписьОстаткиПоОрганизациям", Тип("ДекорацияФормы"),Элементы.смартГруппаОстаткиПоОрганизациям);
    НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
    НовыйЭлемент.ЦветТекста=Новый Цвет(255,0,0); 
	НовыйЭлемент.Ширина=150;
	НовыйЭлемент.Шрифт=Новый Шрифт(НовыйЭлемент.Шрифт,,,Истина);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("смартОстаткиПоОрганизациям", Тип("ДекорацияФормы"),Элементы.ГруппаТовары,Элементы.Товары);
    НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
    НовыйЭлемент.ЦветТекста=Новый Цвет(255,0,0);
	НовыйЭлемент.Шрифт=Новый Шрифт(НовыйЭлемент.Шрифт,,,Истина);
	НовыйЭлемент.Ширина=150;
    НовыйЭлемент.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям(Истина);
    НовыйЭлемент.Видимость=НЕ НовыйЭлемент.Заголовок="";
	
	ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
		Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
	Иначе
	    Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Развернуть предупреждение. ВНИМАНИЕ! Есть ограничения по товарам организации";
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023
	
	//++ смарт:Демичев #895 14.11.2022((   
	//Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022
	
	//++#895 смарт: Холопов П. 19.05.2022 // Доработано Демичевым 09122022 вывод надписи для менеджера, о том, что в 
	//заказе есть прослеживаемые товары
	//смартГруппаПредупреждение = Элементы.Вставить("смартГруппаПредупреждение", Тип("ГруппаФормы"), Элементы.ГруппаДанныеДокумента,Элементы.ГруппаСтраницы);
	//смартГруппаПредупреждение = Элементы.Вставить("смартГруппаПредупреждение", Тип("ГруппаФормы"), Элементы.ГруппаСтатусПриоритет);//Элементы.ГруппаДополнительно);
	//смартГруппаПредупреждение.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//смартГруппаПредупреждение.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	//смартГруппаПредупреждение.Видимость = Ложь;
	//
	////Декорация картинка
	//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ДекорацияКартинкаПредупреждающая", Тип("ДекорацияФормы"),Элементы.смартГруппаПредупреждение);
	//НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	//НовыйЭлемент.Картинка = БиблиотекаКартинок.Предупреждение;
	//
	//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартНадписьЕстьПрослеживаемыеТовары", Тип("ДекорацияФормы"),Элементы.смартГруппаПредупреждение);
	//НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	//НовыйЭлемент.Заголовок = "В заказе есть прослеживаемая номенклатура! Проверьте использует ли клиент ЭДО (электронный документооборот).";
	//НовыйЭлемент.ЦветФона = WebЦвета.Золотой;
	//
	//НовыеРеквизиты = Новый Массив;
	//смартЕстьПрослеживаемыеТовары = Новый РеквизитФормы("смартЕстьПрослеживаемыеТовары", Новый ОписаниеТипов("Булево"));
	//НовыеРеквизиты.Добавить(смартЕстьПрослеживаемыеТовары);	
	//ИзменитьРеквизиты(НовыеРеквизиты);
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда  		
		//смартПроверитьНаличиеПрослеживаемыхТоваровНаСервере();	
	//КонецЕсли;
	//-- #895 смарт: Холопов П. 19.05.2022  Доработано Демичевым 09122022
    //--#895 смарт: Демичев 28.12.2022))

    //++ смарт:Подкин #1047 06.06.2022 13:49:21  
	//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
	ДанныеРуководителяСтруктура = смартДанныеРуководителяСПравомПовышеннойСкидкой();
	//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
    
    ПовышеннаяСкидка = Элементы.Вставить("смартГруппаПовышеннаяСкидка", Тип("ГруппаФормы"), Элементы.ГруппаОсновное,Элементы.ГруппаИндексыСПАРКРиски);
    ПовышеннаяСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ПовышеннаяСкидка.ОтображатьЗаголовок = Ложь;
    ПовышеннаяСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
    
    НовыйЭлемент = Элементы.Добавить("смартРазрешитьПовышеннуюСкидку", Тип("ПолеФормы"),Элементы.смартГруппаПовышеннаяСкидка);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
    НовыйЭлемент.ПутьКДанным = "Объект.смартРазрешитьПовышеннуюСкидку";
    НовыйЭлемент.Заголовок = "Разрешить повышенную скидку";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартРазрешитьПовышеннуюСкидкуКоманда");  
	
	//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
	НовыйЭлемент.Доступность = ДанныеРуководителяСтруктура.ПравоПредоставлено; 
	//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
    
    НовыйЭлемент = Элементы.Добавить("смартПроцентРазрешеннойМаксимальнойСкидки", Тип("ПолеФормы"),Элементы.смартГруппаПовышеннаяСкидка);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
    НовыйЭлемент.ПутьКДанным = "Объект.смартПроцентРазрешеннойМаксимальнойСкидки";   
    НовыйЭлемент.Заголовок="Процент скидки";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартПроцентРазрешеннойМаксимальнойСкидкиКоманда");
	
	//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
	НовыйЭлемент.Доступность = ДанныеРуководителяСтруктура.ПравоПредоставлено;
	//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
    
    НовыйЭлемент = Элементы.Добавить("смартПользовательРазрешилПовышеннуюСкидку", Тип("ПолеФормы"),Элементы.смартГруппаПовышеннаяСкидка);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи; 
    НовыйЭлемент.ПутьКДанным = "Объект.смартПользовательРазрешилПовышеннуюСкидку"; 
    НовыйЭлемент.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
    //-- смарт:Подкин #1047 06.06.2022 13:49:21  
    
    //++ смарт:Подкин #974 23.06.2022 17:28:32
    //ГруппаДЛ = ЭтаФорма.Элементы.Добавить("ГруппаДеловыеЛинии", Тип("ГруппаФормы"),ЭтаФорма.Элементы.ГруппаСпособДоставкиПеревозчик);
    //ГруппаДЛ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    //ГруппаДЛ.Заголовок = "Параметры отправки в Деловые Линии";
    //ГруппаДЛ.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение; 
    //ГруппаДЛ.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
    //ГруппаДЛ.Свернутая = ИСТИНА;
    //ГруппаДЛ.ОтображатьЗаголовок = ИСТИНА;  
    //ГруппаДЛ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
    //ГруппаДЛ.РастягиватьПоГоризонтали = ИСТИНА; 
    //ГруппаДЛ.Видимость = ЛОЖЬ;
    //-- смарт:Подкин #974 23.06.2022 17:28:32
	
	//++ смарт:Демичев #895 14.11.2022((Доработка задачи Холопова по прослеживаемому товару
	//Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022
	//Если Не Объект.Ссылка.Пустая() Тогда		
	//		//смартПроверитьНаличиеПрослеживаемыхТоваровНаСервере();				
	//КонецЕсли;
	//-- смарт:Демичев #895 14.11.2022))
	
	//++ #1230 смарт: Фролов 22.11.2022 //Заказ клиента (ТЧ Товары) доработать вывод отчетов   
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ВывестиОстаткиИДоступность");
	НоваяКоманда.Заголовок = "Остатки и доступность (смарт)";
	НоваяКоманда.Действие = "смартСформироватьОстаткиИДоступностьПоТовару";
	КнопкаОИД = ЭтаФорма.Элементы.Добавить("КнопкаОИД", Тип("КнопкаФормы"),Элементы.Товары.КонтекстноеМеню);
	КнопкаОИД.Заголовок = "Остатки и доступность (смарт)";
	КнопкаОИД.ИмяКоманды = "ВывестиОстаткиИДоступность"; 
	
	НоваяКоманда2 = ЭтаФорма.Команды.Добавить("ВывестиОстаткиПоСрокамГодности");
	НоваяКоманда2.Заголовок = "Остатки по срокам годности (смарт)";
	НоваяКоманда2.Действие = "смартСформироватьОстаткиПоСрокамГодности";
	КнопкаПоСГ = ЭтаФорма.Элементы.Добавить("КнопкаПоСГ", Тип("КнопкаФормы"),Элементы.Товары.КонтекстноеМеню);
	КнопкаПоСГ.Заголовок = "Остатки по срокам годности (смарт)";
	КнопкаПоСГ.ИмяКоманды = "ВывестиОстаткиПоСрокамГодности";
	//-- #1230 смарт: Фролов 22.11.2022

	//++#1323 смарт: Лопато 29.09.2023 //Восстановить и переделать механизм индивидуальных скидок
	НоваяГруппа = ЭтаФорма.Элементы.Вставить("смартГруппаСохранитьРучныеСкидкиКлиента", Тип("ГруппаФормы"), Элементы.ГруппаТоварыСкидкиНаценки, Элементы.ГруппаТоварыИнформацияОСкидках);
    НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("смартКомандаСохранитьРучныеСкидкиКлиентаВсе");
	НоваяКоманда.Заголовок = "Сохранить ручные скидки клиента (смарт)";
	НоваяКоманда.Действие = "смартСохранитьРучныеСкидкиКлиента";
	
	НоваяКнопка = ЭтаФорма.Элементы.Вставить("смартКнопкаСохранитьРучныеСкидкиКлиента", Тип("КнопкаФормы"), Элементы.смартГруппаСохранитьРучныеСкидкиКлиента);
	НоваяКнопка.Заголовок = "Сохранить все ручные скидки клиента (смарт)";
	НоваяКнопка.ИмяКоманды = "смартКомандаСохранитьРучныеСкидкиКлиентаВсе"; 

	НоваяКоманда = ЭтаФорма.Команды.Добавить("смартКомандаСохранитьРучныеСкидкиКлиентаИзВыделенныхСтрок");
	НоваяКоманда.Заголовок = "Сохранить ручные скидки клиента из выделенных строк (смарт)";
	НоваяКоманда.Действие = "смартСохранитьРучныеСкидкиКлиента";

	НоваяКнопка = ЭтаФорма.Элементы.Вставить("смартКнопкаСохранитьРучныеСкидкиКлиентаИзВыделенныхСтрок", Тип("КнопкаФормы"), Элементы.смартГруппаСохранитьРучныеСкидкиКлиента);
	НоваяКнопка.Заголовок = "Сохранить ручные скидки клиента из выделенных строк (смарт)";
	НоваяКнопка.ИмяКоманды = "смартКомандаСохранитьРучныеСкидкиКлиентаИзВыделенныхСтрок"; 
	//--#1323 смарт: Лопато 29.09.2023

	////++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
	//смартОбновитьАдресДоставкиСамовывоз();
	////--#1382 смарт: Лопато 21.06.2023
	
	//++#1261 смарт: Лопато 15.01.2024 //Доработка изменения Заказа клиента для ИМ  
	Элементы.Контрагент.УстановитьДействие("ОбработкаВыбора", "смарт_КонтрагентОбработкаВыбора");
	//--#1261 смарт: Лопато 15.01.2024
	
	//++ #1690 смарт: Фролов 21.03.2024 //Небольшие доработки CRM по результатам эксплуатации.
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	CRM_ЖурналДокументов.CRM_Интерес КАК Интерес
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
		|		ПО ЗаказКлиента.Ссылка = CRM_ЖурналДокументов.Объект
		|			И (CRM_ЖурналДокументов.ГлавнаяЗапись)
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &ЗаказКлиента");
		Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			СрокНаТекущемЭтапе = CRM_ИнтересыСервер.СрокНаТекущемЭтапе(Выборка.Интерес);
			
			НовыйЭлемент = Элементы.Добавить("смартЭтапИнтереса", Тип("ДекорацияФормы"), Элементы.ГруппаСтрокаИнтереса);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.ЦветТекста = Новый Цвет(255,0,0); 
			НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
			НовыйЭлемент.Заголовок = "  Этап: " + Выборка.Интерес.СостояниеИнтереса + ", срок на этапе: " + СрокНаТекущемЭтапе + "";
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1690 смарт: Фролов 21.03.2024
	
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024
	
	//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
	Элементы.смартДокументыПодписаны.ТолькоПросмотр = Истина;
	//-- #1650 смарт: Шляпников 17.09.2024
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	ПараметрыЭлемента = Новый Структура("ОтображениеПодсказки,Подсказка", ОтображениеПодсказки.ОтображатьСправа, ПолучитьТекстИнформацииОСогласованииБесплатнойДоставки());
	ПараметрыЭлемента.Вставить("Доступность", Пользователи.РолиДоступны("смартПравоНаРазрешениеБесплатнойДоставки"));
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартРазрешенаБесплатнаяДоставка", "СтраницаДоставкаДоПолучателя",, 2, "Объект.смартРазрешенаБесплатнаяДоставка", ПараметрыЭлемента);
	
	Элементы.АдресДоставкиПолучателя.УстановитьДействие("Автоподбор", "смартАвтоподборАдресаДоставки");
	Элементы.АдресДоставкиПолучателя.РедактированиеТекста = Истина;
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
	ПараметрыЭлемента = Новый Структура("ОтображениеПодсказки,Подсказка", ОтображениеПодсказки.ОтображатьСправа, ПолучитьТекстИнформацииОСогласованииДоставкиВнеЗоны());
	ПараметрыЭлемента.Вставить("Доступность", Пользователи.РолиДоступны("смартПравоНаРазрешениеБесплатнойДоставки"));
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартРазрешенаДоставкаЗаПределыУстановленнойЗоны", "СтраницаДоставкаДоПолучателя",, 2, "Объект.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны", ПараметрыЭлемента);
	//-- #Б4868 смарт: Шляпников 12.11.2025

	//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
	Элементы.Товары.УстановитьДействие("ПриИзменении", "смартПриИзмененииТовары");
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартРегион", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(30));
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартГород", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(30));
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартВесЗаказа", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(15, 3));
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартРасстояние", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(10, 2));
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартБылаОшибкаРасчетаДоставки", смартФормированиеИнтерфейса.ОписаниеТипаБулево());
	
	смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаАдресДоставки", "СтраницаДоставкаДоПолучателя", 3,,,, "АдресДоставкиПолучателя");
	Элементы.Переместить(Элементы.АдресДоставкиПолучателя, Элементы.смартГруппаАдресДоставки);
	
	СвойстваКнопки = Новый Структура;
	СвойстваКнопки.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	СвойстваКнопки.Вставить("Картинка", БиблиотекаКартинок.Обновить);
	
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартОбновитьПараметрыДляРасчетаДоставки", "Рассчитать параметры доставки", "смартОбновитьПараметрыДляРасчетаДоставки");
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартОбновитьПараметрыДляРасчетаДоставки", "смартГруппаАдресДоставки",, "смартОбновитьПараметрыДляРасчетаДоставки", 1, СвойстваКнопки);
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		РассчитатьПараметрыДоставки();
	КонецЕсли;
	//-- #Б4316 смарт: Шляпников 14.10.2025
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	НовыеРеквизиты = Новый Структура;
	НовыеРеквизиты.Вставить("смартМаксимальнаяСкидка", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(10,2));
	НовыеРеквизиты.Вставить("смартТекстМаксимальнаяСкидка", смартФормированиеИнтерфейса.ОписаниеТипаСтрока("50"));
	НовыеРеквизиты.Вставить("смартМаксимальнаяСкидкаПревышена", смартФормированиеИнтерфейса.ОписаниеТипаБулево());
	смартФормированиеИнтерфейса.СоздатьРеквизитыТаблицы(ЭтаФорма, "Объект.Товары", НовыеРеквизиты);
	
	Свойства = Новый Структура;
	Свойства.Вставить("АвтомаксимальнаяШирина", Ложь);
	Свойства.Вставить("РастягиватьПоГоризонтали", Ложь);
	Свойства.Вставить("МаксимальнаяШирина", 20);
	Свойства.Вставить("Ширина", 20);
	Свойства.Вставить("ТолькоПросмотр", Истина);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "ТоварысмартТекстМаксимальнаяСкидка", "Товары", "Макс.скидка", 1, "Объект.Товары.смартТекстМаксимальнаяСкидка", Свойства,, "ТоварыПроцентАвтоматическойСкидки");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварысмартТекстМаксимальнаяСкидка");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.смартМаксимальнаяСкидкаПревышена");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WEBцвета.Красный);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварысмартТекстМаксимальнаяСкидка");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.смартМаксимальнаяСкидкаПревышена");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.смартТекстМаксимальнаяСкидка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "";
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WEBцвета.Зеленый);
	
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("смартДействующаяАкцияСтроки", смартФормированиеИнтерфейса.ОписаниеТипаСтрока(20));
	смартФормированиеИнтерфейса.СоздатьРеквизитыТаблицы(ЭтаФорма, "Объект.Товары", Реквизиты);
	
	Свойства = Новый Структура;
	Свойства.Вставить("ЦветФона", Новый Цвет(255, 215, 0));
	Свойства.Вставить("Шрифт", Новый Шрифт(,, Истина));
	
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартОткрытьПодборАкций", "Текущие акции", "смартОткрытьПодборАкций");
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартОткрытьПодборАкций", "ГруппаТоварыПодобратьТовары",, "смартОткрытьПодборАкций", 1, Свойства, "ТоварыГруппаЗаполнить");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартДействующаяАкцияСтроки", "Товары", "Акция", 1, "Объект.Товары.смартДействующаяАкцияСтроки", Новый Структура("ТолькоПросмотр", Истина),, "ТоварыСерия");
	
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартНазначитьАкциюНаНоменклатуру", "Выбрать акцию", "смартНазначитьАкциюНаНоменклатуру");
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартНазначитьАкциюНаНоменклатуру", "ТоварыКонтекстноеМеню",, "смартНазначитьАкциюНаНоменклатуру", 1, Свойства);
	
	ОбновитьЗаголовокИВидимостьКнопкиПодбораАкций();
	ЗаполнитьДействующиеАкцииПоСтрокамТоваров();
	//-- #Б4818 смарт: Шляпников 17.11.2025
	
	//++ #5082 смарт: Тимофеева 01.12.2025 / Настройка правил продаж (Ковчег). Дополнительная проверка. 
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
		Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
			УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
		КонецЕсли;
	КонецЕсли;
	//-- #5082 смарт: Тимофеева 01.12.2025
			
	//++ #5014 смарт: Тимофеева 01.12.2025 / Документ Заказ клиента. Способ доставки. Блокировка изменения.
	Если ТребуетсяКонтрольСпособаДоставки()
		И Документы.ЗаказКлиента.ЕстьЗаданиеНаПеревозку(Объект.Ссылка) 
		И Документы.ЗаказКлиента.ВсеТоварыЗаказаСВариантомОбеспеченияОтгрузить(Объект.Товары)
		И Документы.ЗаказКлиента.ЕстьНоменклатураСТипомТовар(Объект.Товары) Тогда		
		Элементы.СпособДоставки.ТолькоПросмотр = Истина;
		Элементы.смартЗаполнитьДоставкуПоКлиенту.Доступность = Ложь;
	КонецЕсли;
	//-- #5014 смарт: Тимофеева 01.12.2025 
	
	//++ #5268 смарт: Тимофеева 25.12.2025 / Отменять закрытие заказа через роль 
	Если Объект.Статус = перечисления.СтатусыЗаказовКлиентов.Закрыт
		И Пользователи.РолиДоступны("смартРазрешитьОткрыватьЗакрытыеЗаказыКлиентов") Тогда
		КомандаОткрытьЗакрытыйЗаказ = ЭтаФорма.Команды.Добавить("ОткрытьЗакрытыйЗаказ");
    	КомандаОткрытьЗакрытыйЗаказ.Заголовок = "Открыть заказ";
    	КомандаОткрытьЗакрытыйЗаказ.Действие = "ОткрытьЗакрытыйЗаказ";		
		КомандаОткрытьЗакрытыйЗаказ.ИзменяетСохраняемыеДанные = Истина;
		
		ЭлементКоманда	= Элементы.Добавить("ОткрытьЗакрытыйЗаказ", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
    	ЭлементКоманда.Заголовок	= "Открыть заказ";
    	ЭлементКоманда.ИмяКоманды	= "ОткрытьЗакрытыйЗаказ";
		ЭлементКоманда.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
    КонецЕсли;
	//-- #5268 смарт: Тимофеева 25.12.2025 
	
	//++ #Б5736 смарт: Шляпников 06.03.2026 / Разрешить редактировать заказы клиента не смотря на установленную Финальную скидку
	ЗаблокироватьИзменениеДокументаПриПревышенииМаксимальнойСкидки();
	//-- #Б5736 смарт: Шляпников 06.03.2026
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартОткрытьСтопЛистТехническойОтсрочки", "Стоп-лист технической отсрочки", "смартОткрытьСтопЛистТехническойОтсрочки");

	ГруппаСтопЛистТехническойОтсрочки = смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "ГруппаСтопЛистТехническойОтсрочки", Элементы.ГруппаШапкаЛево, 3,,,, Элементы.Контрагент);
	 
	СвойстваКнопки = Новый Структура;
	СвойстваКнопки.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	СвойстваКнопки.Вставить("Картинка", БиблиотекаКартинок.ОтгрузкаЗапрещена);
	СвойстваКнопки.Вставить("ЦветТекста", WebЦвета.Кирпичный);
	смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартОткрытьСтопЛистТехническойОтсрочки", "ГруппаСтопЛистТехническойОтсрочки", "Клиенту запрещена техническая отсрочка", "смартОткрытьСтопЛистТехническойОтсрочки", 2, СвойстваКнопки);
	
	смартОбновитьСостояниеСтопЛистаТехническойОтсрочки();
	//-- #4792 смарт: Тимофеева 17.03.26  
	
	//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
	смартУстановитьПараметрыВыбораДоговора();
	//-- #4822 смарт: Тимофеева 02.04.2026
	
КонецПроцедуры

//++ смарт:Подкин #1047 06.06.2022 14:25:01
&НаКлиенте
Процедура смартРазрешитьПовышеннуюСкидкуКоманда()  
    
    Если Объект.смартРазрешитьПовышеннуюСкидку И НЕ Объект.смартПроцентРазрешеннойМаксимальнойСкидки=0 Тогда
        Объект.смартПользовательРазрешилПовышеннуюСкидку=ПользователиКлиентСервер.ТекущийПользователь(); 
    ИначеЕсли Объект.смартРазрешитьПовышеннуюСкидку Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Внимание! Заполните предварительно процент скидки!"; 
        Сообщение.ПутьКДанным="Объект.смартПроцентРазрешеннойМаксимальнойСкидки";
        Сообщение.Сообщить(); 
        Объект.смартРазрешитьПовышеннуюСкидку=Ложь;
        Объект.смартПользовательРазрешилПовышеннуюСкидку=ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"); 
    Иначе
       Объект.смартПроцентРазрешеннойМаксимальнойСкидки=0; 
    КонецЕсли; 
    
КонецПроцедуры//-- смарт:Подкин #1047 06.06.2022 14:25:01

//++ смарт:Подкин #1047 06.06.2022 14:25:01
&НаКлиенте
Процедура смартПроцентРазрешеннойМаксимальнойСкидкиКоманда()   
	
	//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
	ДанныеРуководителяСтруктура = смартДанныеРуководителяСПравомПовышеннойСкидкой(); 
	
	Если ДанныеРуководителяСтруктура.ПравоПредоставлено Тогда
	//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
	
		//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
		Если Объект.смартПроцентРазрешеннойМаксимальнойСкидки > ДанныеРуководителяСтруктура.К2 Тогда
		//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
			
			Сообщение = Новый СообщениеПользователю;
			
			//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
			Сообщение.Текст = "Внимание! Скидка не может превышать: " + ДанныеРуководителяСтруктура.К2 + "%"; 
			//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
			
            Сообщение.ПутьКДанным = "Объект.смартПроцентРазрешеннойМаксимальнойСкидки";
            Сообщение.Сообщить(); 
			
			Объект.смартПроцентРазрешеннойМаксимальнойСкидки = 0;
            
            Объект.смартРазрешитьПовышеннуюСкидку=Истина; 
            смартРазрешитьПовышеннуюСкидкуКоманда();
			
		КонецЕсли;
		
    КонецЕсли; 
    
	Если НЕ Объект.смартПроцентРазрешеннойМаксимальнойСкидки = 0 Тогда
		
        Объект.смартРазрешитьПовышеннуюСкидку = Истина; 
        смартРазрешитьПовышеннуюСкидкуКоманда(); 
		
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #1047 06.06.2022 14:25:01

//++ смарт:Подкин #1047 06.06.2022 14:25:01
&НаСервере
Функция смартДанныеРуководителяСПравомПовышеннойСкидкой() 
	
	//++ #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
	// Провел полный рефакторинг функции
	// Поля структуры:
	//  * Значение - СправочникСсылка.Пользователи
	// 	* К2 - Число, процент скидки
	// 	* К3 - Булево, Вкл/Выкл
	// 	* К4 - СправочникСсылка.СтруктураПредприятия (Подразделение)
	// 	* ПравоПредоставлено - Булево, назначается в функции
	
	СтруктураВозврата = Новый Структура("Значение, К2, К3, К4, ПравоПредоставлено",
											Справочники.Пользователи.ПустаяСсылка(),
											0,
											Ложь,
											Справочники.СтруктураПредприятия.ПустаяСсылка(),
											Ложь
										);
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		СтруктураВозврата.Значение = Пользователи.ТекущийПользователь();
		СтруктураВозврата.К2 = 99;
		СтруктураВозврата.К3 = Истина;
		СтруктураВозврата.К4 = Объект.Подразделение;
		СтруктураВозврата.ПравоПредоставлено = Истина;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
    МассивСтруктурРуководителейРегионов = 
		смартОбщегоНазначенияСКэш.смартПредопределенныеЗначенияКэш(
			Справочники.смартПредопределенныеЗначения.смартПользователиПредоставленияПовышеннойСкидки); 
		
	Для каждого СтруктураМассива Из МассивСтруктурРуководителейРегионов Цикл
				
		Если СтруктураМассива.Значение = Пользователи.ТекущийПользователь() 
			 И СтруктураМассива.К2 > 0
			 И СтруктураМассива.К3 = Истина
			 И СтруктураМассива.К4 = Объект.Подразделение
			Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураМассива);
			СтруктураВозврата.ПравоПредоставлено = Истина;
			
			Возврат СтруктураВозврата;
		   
	   КонецЕсли;	
	                                             
    КонецЦикла;      
    
    Возврат СтруктураВозврата;
	//-- #1477 смарт: Ермаков 06.02.2024 / Скидка до 10% для руководителей подразделений
       
КонецФункции //-- смарт:Подкин #1047 06.06.2022 14:25:01

&НаСервере
&Перед("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	                                             
    //++ смарт:Подкин #946 23.03.2022 12:37:44
    Если Справочники.смартПредопределенныеЗначения.ОграничиватьВалютуЦены.Значение=Неопределено ИЛИ НЕ Справочники.смартПредопределенныеЗначения.ОграничиватьВалютуЦены.Значение Тогда
       ПроверитьВалютуВДокументеИВСоглашении(Отказ);
    КонецЕсли;
    //-- смарт:Подкин #946 23.03.2022 12:37:44
	
	//++ #1436 смарт: Фролов 25.08.2023 //Проверка валюты в Заказе и Договоре при проведении
	Если ЭтаФорма.смартЖдемответаНаВопрос Тогда
		Отказ=Истина;
		Возврат;
	КонецЕсли;	
	//-- #1436 смарт: Фролов 25.08.2023
	
    ПроверитьСтавкуНДСВЗаказе(Отказ);
    
    //++ смарт:ММ #086 362 16.12.2020 
    Если Объект.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
        ТекущийОбъект.смартДатаОплаты = Неопределено;
    КонецЕсли;
    //-- смарт:ММ 16.12.2020
    
    //++ смарт:Подкин #914 15.03.2022 19:38:56
    ЗаказСОграничением=Ложь;
    Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
        ЗаказСОграничением = смартОбщегоНазначения.смартПроверкаОтгруженногоОплаченного(Объект.Ссылка); 
    Иначе
        ЗаказСОграничением=Истина; 
    КонецЕсли;
    //-- смарт:Подкин #914 15.03.2022 19:38:56
    
    //++ смарт:Подкин #1009 05.05.2022 12:20:09 
    ДокументОбъект = РеквизитФормыВЗначение("Объект");
    Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ТзРазницы=ДокументОбъект.ОпределитьИзмененияВерсийОбъекта(Объект, "Номенклатура,Количество,ВидЦены");
        // ТзРазницы = ОпределитьИзмененияВерсийОбъекта(Объект, "Номенклатура,Количество,ВидЦены");
        Если ТекущийОбъект.Проведен И ТзРазницы.Количество()=0 Тогда  
            ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешатьПроведение",);	
        КонецЕсли;    
    КонецЕсли;
    //-- смарт:Подкин #1009 05.05.2022 12:20:09
    
    Если ЗаказСОграничением Тогда      
        //++ смарт:Подкин #945 18.03.2022 18:45:43 
        ПропуститьПроверку = Ложь;
        Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
            
            //ТзРазницы = ОпределитьИзмененияВерсийОбъекта(Объект, "Номенклатура,Количество,ВидЦены");       
            
			Если ТзРазницы.Количество() = 0 Тогда
				//++ #1009 смарт: Фролов 29.11.2022 //Ограничения продаж по группе номенклатуры. (Дефицит) 
				//ПропуститьПроверку = Истина;                                                              
				Если (ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение И Объект.Проведен) ТОгда
                	ПропуститьПроверку = Истина;                                                              
				КонецЕсли;
				//-- #1009 смарт: Фролов 29.11.2022
            Иначе  
                //Отказ = Истина;
                ПропуститьПроверку = Ложь; 
                
                //Не входит в лимиты, массив   
                //ТзИзменения=ТзРазницы.Скопировать(Новый Структура("Знак",1),"Номенклатура,Количество,ВидЦены"); 
                //ТзДоИзменения=ТзРазницы.Скопировать(Новый Структура("Знак",0),"Номенклатура,Количество,ВидЦены");
                //СтруктураПроверкиОграниченийПерезапись = смартПроверкаОграниченияПродажНоменклатуры(ТзИзменения);   
                //Если СтруктураПроверкиОграниченийПерезапись = Неопределено Тогда 
                //    ПропуститьПроверку = Истина;
                //    ////Проверям изменение ВидаЦены   
                //    //Если НЕ (ТзИзменения.Количество() И ТзДоИзменения.Количество()) И (ТзИзменения.Количество() ИЛИ ТзДоИзменения.Количество()) Тогда
                //    //    //    Для каждого СтрИ Из ТзИзменения Цикл
                //    //    //        СтрНашлиДБ=ТзДоИзменения.Найти(СтрИ.Номенклатура,"Номенклатура");
                //    //    //        Если НЕ СтрНашлиДБ=Неопределено И СтрИ.Количество=СтрНашлиДБ.Количество Тогда
                //    //    //            
                //    //    //            ОбщегоНазначения.СообщитьПользователю("Была изменена строка товара "+СтрНашлиДБ.Номенклатура+", которая попадает под ограничение. Для редактирования обратитесь к сотруднику с правами на изменение.");//,,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина
                //    //    //            Отказ = Истина;
                //    //    //            ПропуститьПроверку = Истина;
                //    //    //            
                //    //    //        КонецЕсли;
                //    //    //    КонецЦикла; 
                //    //    //Иначе
                //    //    ПропуститьПроверку = Ложь; 
                //    //Иначе
                //    //    
                //    //КонецЕсли;
                //    //
                //Иначе            	
                //    Для каждого Стр Из СтруктураПроверкиОграниченийПерезапись Цикл  
                //        ОтличияЗаписаныНашли=ТзДоИзменения.Найти(Стр.Номенклатура,"Номенклатура");
                //        Если ОтличияЗаписаныНашли = Неопределено Тогда
                //            Продолжить;
                //        ИначеЕсли Стр.Количество < ОтличияЗаписаныНашли.Количество Тогда    
                //            
                //            ОбщегоНазначения.СообщитьПользователю("Была изменена строка товара "+ОтличияЗаписаныНашли.Номенклатура+", которая попадает под ограничение. Для редактирования обратитесь к сотруднику с правами на изменение.");//,,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина
                //            Отказ = Истина;
                //            ПропуститьПроверку = Истина; 
                //            
                //        ИначеЕсли Стр.Количество >= ОтличияЗаписаныНашли.Количество И НЕ Стр.ВидЦены=ОтличияЗаписаныНашли.ВидЦены Тогда
                //            
                //            ОбщегоНазначения.СообщитьПользователю("Была изменена строка товара "+ОтличияЗаписаныНашли.Номенклатура+", которая попадает под ограничение. Для редактирования обратитесь к сотруднику с правами на изменение.");//,,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина
                //            Отказ = Истина;
                //            ПропуститьПроверку = Истина; 
                //            
                //        КонецЕсли;
                //    КонецЦикла; 
            КонецЕсли;
        КонецЕсли; 
        //-- смарт:Подкин #945 18.03.2022 18:45:43  
        
        //++ смарт:Подкин #925 10.03.2022 16:01:04
        Если НЕ ПропуститьПроверку Тогда
            
            //++ смарт:Подкин #914 03.03.2022 12:37:06 проверка вида цены по сегменту
			Если НЕ РольДоступна("ПолныеПрава") И (НЕ Пользователи.РолиДоступны("смартИзменениеПодтвержденияЗаказаФинОтдел") ИЛИ
												   НЕ Пользователи.РолиДоступны("смартУстановкаПодтвержденияЗаказаФинОтдел")) Тогда
												   
                //ОбщегоНазначения.СообщитьПользователю("Была изменена строка товара, которая попадает под ограничение. Для редактирования обратитесь к сотруднику с правами на изменение.");//,,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина
                
                Для каждого Стр Из Объект.Товары Цикл
                    СтруктураПроверки=смартПроверкаКурсаРасчета(Стр.Номенклатура, Стр.ВидЦены); 
                    
                    Если НЕ СтруктураПроверки=Неопределено И СтруктураПроверки.РезультатПроверки И ТИПЗНЧ(СтруктураПроверки.ВалютаСегмент)=Тип("СправочникСсылка.Валюты") Тогда 
                        Стр.ВидЦены=Справочники.ВидыЦен.ПустаяСсылка();
                        Стр.Цена=0;
                        ОбщегоНазначения.СообщитьПользователю("В строке "+Стр.НомерСтроки +" "+ Стр.Номенклатура+" вид цены не соответствует требованиям продажи. Выберите действующий вид цены в валюте "+?(СтруктураПроверки.ВалютаСегмент=Неопределено,". Вид цены Не входит в валютный сегмент или не действует",СтруктураПроверки.ВалютаСегмент)+".",,"Объект.Товары["+(Стр.НомерСтроки-1)+"].ВидЦены",,Истина);
                        Отказ=Истина; 
                    ИначеЕсли НЕ СтруктураПроверки=Неопределено И СтруктураПроверки.РезультатПроверки И СтруктураПроверки.ВалютаСегмент=Истина Тогда
                        Стр.ВидЦены=Справочники.ВидыЦен.ПустаяСсылка();
                        Стр.Цена=0;
                        ОбщегоНазначения.СообщитьПользователю("В строке "+Стр.НомерСтроки +" "+ Стр.Номенклатура+" вид цены не соответствует требованиям продажи. Валюта Вида цены не может быть ЕВРО.",,"Объект.Товары["+(Стр.НомерСтроки-1)+"].ВидЦены",,Истина);
                        Отказ=Истина;
                    ИначеЕсли НЕ СтруктураПроверки=Неопределено И СтруктураПроверки.РезультатПроверки И СтруктураПроверки.ВалютаСегмент=Ложь Тогда
                        Стр.ВидЦены=Справочники.ВидыЦен.ПустаяСсылка();
                        Стр.Цена=0;
                        ОбщегоНазначения.СообщитьПользователю("В строке "+Стр.НомерСтроки +" "+ Стр.Номенклатура+" вид цены не соответствует требованиям продажи. Выберите действующий вид цены.",,"Объект.Товары["+(Стр.НомерСтроки-1)+"].ВидЦены",,Истина);
                        Отказ=Истина;
                    КонецЕсли;   
                КонецЦикла;  
            КонецЕсли;
            //-- смарт:Подкин #914 03.03.2022 12:37:06
            
            //++ смарт:Подкин #925 18.03.2022 18:45:43 
			Если НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРазрешитьПродажуНоменклатурыБольшеОграничения") Тогда //15.03.22 в 19.30 убрал, т.к. добавил проверку Оплачен/Отгружен  ИЛИ РольДоступна("ДобавлениеИзменениеРеализацийТоваровУслуг")
				
                //ОбщегоНазначения.СообщитьПользователю("Была изменена строка товара, которая попадает под ограничение. Для редактирования обратитесь к сотруднику с правами на изменение.");//,,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина
                //++ смарт:Подкин #1009 28.04.2022 13:07:50
                СтруктураПроверкиОграничений=ДокументОбъект.смартПроведениеОбходОграниченияНоменклатуры(,Истина); 
                // СтруктураПроверкиОграничений=смартПроверкаОграниченияПродажНоменклатуры(); 
                //-- смарт:Подкин #1009 28.04.2022 13:07:50
				//++ #1009 смарт: Фролов 29.11.2022 //Ограничения продаж по группе номенклатуры. (Дефицит)
				Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
					Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                    |	ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура КАК Номенклатура,
	                                    |	СУММА(ТоварыКОтгрузкеОстаткиИОбороты.КОформлениюПриход) КАК КОформлениюПриход,
	                                    |	СУММА(ТоварыКОтгрузкеОстаткиИОбороты.КОформлениюРасход) КАК КОформлениюРасход,
	                                    |	СУММА(ТоварыКОтгрузкеОстаткиИОбороты.КОформлениюПриход - ТоварыКОтгрузкеОстаткиИОбороты.КОформлениюРасход) КАК ОсталосьОтгрузить
	                                    |ПОМЕСТИТЬ ДанныеПоОтгрузке
	                                    |ИЗ
	                                    |	РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(, , , , ДокументОтгрузки = &ЗаказКлиента) КАК ТоварыКОтгрузкеОстаткиИОбороты
	                                    |
	                                    |СГРУППИРОВАТЬ ПО
	                                    |	ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура
	                                    |;
	                                    |
	                                    |////////////////////////////////////////////////////////////////////////////////
	                                    |ВЫБРАТЬ
	                                    |	КОформлению.Номенклатура КАК Номенклатура,
	                                    |	КОформлению.КОформлениюПриход КАК КОформлениюПриход,
	                                    |	КОформлению.КОформлениюРасход КАК КОформлениюРасход,
	                                    |	КОформлению.ОсталосьОтгрузить КАК ОсталосьОтгрузить
	                                    |ИЗ
	                                    |	ДанныеПоОтгрузке КАК КОформлению
	                                    |ГДЕ
	                                    |	КОформлению.КОформлениюПриход > 0");
					Запрос.УстановитьПараметр("ЗаказКлиента",Объект.Ссылка);
				    РезОтгрузки=Запрос.Выполнить().Выгрузить();
				Иначе	
					РезОтгрузки=Новый ТаблицаЗначений;
					РезОтгрузки.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
					РезОтгрузки.Колонки.Добавить("КОформлениюПриход",Новый ОписаниеТипов("Число"));	
					РезОтгрузки.Колонки.Добавить("КОформлениюРасход",Новый ОписаниеТипов("Число"));	
					РезОтгрузки.Колонки.Добавить("ОсталосьОтгрузить",Новый ОписаниеТипов("Число"));	
				КонецЕсли;
				//-- #1009 смарт: Фролов 29.11.2022
				Если НЕ СтруктураПроверкиОграничений=Неопределено Тогда
					//++ #1009 смарт: Фролов 28.11.2022 //Ограничения продаж по группе номенклатуры. (Дефицит)  
					//Для каждого Стр Из Объект.Товары Цикл   
					//    Для каждого СтрМассив Из СтруктураПроверкиОграничений Цикл
					//        Если СтрМассив.Номенклатура=Стр.Номенклатура Тогда
					//            ОбщегоНазначения.СообщитьПользователю("В строке "+Стр.НомерСтроки +" "+ Стр.Номенклатура+" для данного товара действуют ограничения по количеству продаж, не более "+СтрМассив.Количество+" штук. Распоряжение Ларькова А.С.",,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина);
					//            Отказ=Истина;
					//        КонецЕсли;	
					//	КонецЦикла;
					//КонецЦикла;
                    Для каждого Стр Из Объект.Товары Цикл   
                        Для каждого СтрМассив Из СтруктураПроверкиОграничений Цикл
							Если СтрМассив.Номенклатура=Стр.Номенклатура Тогда
								СтрокиРезОтгрузки=РезОтгрузки.НайтиСтроки(Новый Структура("Номенклатура",Стр.Номенклатура)); 
								Если СтрокиРезОтгрузки.Количество()>0 ТОгда
									Если СтрокиРезОтгрузки[0].ОсталосьОтгрузить>СтрМассив.Количество Тогда
		                                ОбщегоНазначения.СообщитьПользователю("В строке "+Стр.НомерСтроки +" "+ Стр.Номенклатура+" для данного товара действуют ограничения по количеству продаж, не более "+СтрМассив.Количество+" штук. Распоряжение Ларькова А.С.",,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина);
		                                Отказ=Истина;
									КонецЕсли;	
								Иначе	
	                                ОбщегоНазначения.СообщитьПользователю("В строке "+Стр.НомерСтроки +" "+ Стр.Номенклатура+" для данного товара действуют ограничения по количеству продаж, не более "+СтрМассив.Количество+" штук. Распоряжение Ларькова А.С.",,"Объект.Товары["+(Стр.НомерСтроки-1)+"].КоличествоУпаковок",,Истина);
	                                Отказ=Истина;
								КонецЕсли;
                            КонецЕсли;	
						КонецЦикла;
					КонецЦикла;
					Если (ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение ИЛИ Объект.Проведен) И Отказ ТОгда
						Возврат;	
					КонецЕсли;	
                	//-- #1009 смарт: Фролов 28.11.2022
				КонецЕсли;
            КонецЕсли;
            //-- смарт:Подкин #925 10.03.2022 16:01:04   
        КонецЕсли;
    КонецЕсли;
    ////КонецЕсли;    
    
    //++ смарт:Подкин #1186 20.09.2022 10:32:14 ограничение изменения валюты заказа Интернет магазин  
	//++#1186 смарт: Лопато 19.09.2023 //Запрет изменять валюту в выгруженных на сайт заказах.
	//++ #Б-3062 смарт: Лопато 14.04.2025 //Ошибка в заказе клиента в валюте, при внесении изменений  
	//Закомментировал код
	//смартПроверитьИзменениеВалютыВЗаказеСайта(Отказ);
	//-- #Б-3062 смарт: Лопато 14.04.2025
	//--#1186 смарт: Лопато 19.09.2023
    //-- смарт:Подкин #1186 20.09.2022 10:32:14

	//++#1307 смарт: Лопато 07.02.2023 //Запретить контактных лиц на "неопределенном партнере"
	Если Объект.Партнер = Справочники.Партнеры.НеизвестныйПартнер Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Запрещено оформлять документы по неопределенным партнерам!'"), 
														  Объект.Партнер, "Партнер", "Объект.Партнер", Отказ);
	КонецЕсли;	

	Если Объект.Контрагент.Партнер = Справочники.Партнеры.НеизвестныйПартнер Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Запрещено оформлять документы по контрагентам с неопределенным партнером!'"), 
														  Объект.Контрагент, "Контрагент", "Объект.Контрагент", Отказ);
	КонецЕсли;	
	//--#1307 смарт: Лопато 07.02.2023

	//++ #Б-2554 смарт: Лопато 04.03.2025 //Исправить алгоритм создания Интереса по онлайн заказам  
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ Объект.Проведен Тогда
		
		Если ЭтоОнлайнЗаказБезИнтереса(ТекущийОбъект) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Этот онлайн-заказ может быть изменен только после создания интереса!'"),,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;	
	//-- #Б-2554 смарт: Лопато 04.03.2025
	
	//++ #Б4302 смарт: Шляпников 09.09.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки. Дополнение. 
	Если НЕ Отказ Тогда
		
		Если ТекущийОбъект.СогласованоБух <> ТекущийОбъект.Ссылка.СогласованоБух Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НеКонтроллироватьПлатнуюДоставку", Истина);
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4302 смарт: Шляпников 09.09.2025
	
	//++ #Б-3766 смарт: Фролов 19.09.2025 //Реализовать автоматическое заполнение рекомендовавших инженеров оборудование.
	ДокументИнтерес = Неопределено;
	ТоварПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) И ТипЗнч(ТекущийОбъект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		ДокументИнтерес = ТекущийОбъект.ДокументОснование;
		
	ИначеЕсли ЭтаФорма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
		
		ДокументИнтерес = ЭтаФорма.CRM_ТаблицаИнтересов[0].Ссылка;	
		
	КонецЕсли;
	
	Если НЕ ДокументИнтерес = Неопределено Тогда
		
		Если ДокументИнтерес.смартИнтересКанал = Справочники.смартПредопределенныеЗначения.Настройки.КаналРекомендацияИнженера Тогда
			
			КтоПередал = ДокументИнтерес.смартИнтересИсточник;
			
			Если ЗначениеЗаполнено(КтоПередал) Тогда
				
				НомПП = 1;
				
				Для Каждого СтрТовары Из ТекущийОбъект.Товары Цикл
					
					Если СтрТовары.Номенклатура.ВидНоменклатуры = ТоварПлоттерыСерии Тогда
						
						Если СтрТовары.смартКтоПередал <> КтоПередал Тогда
							
							СтрТовары.смартКтоПередал = КтоПередал;
							Общегоназначения.СообщитьПользователю("В строке " + НомПП + " изменено значение Кто передал!");
							НомПП = НомПП + 1;
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-3766 смарт: Фролов 19.09.2025
	
	//++ #Б3034 смарт: Шляпников 29.09.2025 / Изменение алгоритма заполнения менеджера в Онлайн Заказе клиента 
	Если НЕ Отказ И НЕ ТекущийОбъект.Ссылка.Пустая() 
		И ТекущийОбъект.Менеджер = Справочники.смартПредопределенныеЗначения.ПользовательИнтернетМагазина.Значение Тогда
		
		Если СокрЛП(УправлениеСвойствами.ЗначениеСвойства(ТекущийОбъект.Ссылка, "ОффлайнЗаказ")) = "N" Тогда
			
			ТаблицаИнтересов = смартОбщегоНазначения.ПолучитьТаблицуИнтересовПоЗаказуКлиента(ТекущийОбъект.Ссылка);
			
			Если ТаблицаИнтересов.Количество() > 0 Тогда
				
				Если смартОбменССайтомБитриксСервер.ПолучитьТекущийСтатусЗаказаКлиентаНаСайте(ТекущийОбъект.Ссылка) = Перечисления.смартСтатусыЗаказовБитриксЗначения.ВОбработке Тогда
					
					ВсеТоварыЗарезервированы = (ТекущийОбъект.Товары.Количество() > 0);
					
					Для каждого стрТовары Из ТекущийОбъект.Товары Цикл
						
						Если стрТовары.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.Отгрузить
							И стрТовары.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно
							И стрТовары.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.СоСклада
							И стрТовары.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.ИзЗаказов Тогда
							
							ВсеТоварыЗарезервированы = Ложь;
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если ВсеТоварыЗарезервированы Тогда
						ТекущийОбъект.Менеджер = Пользователи.АвторизованныйПользователь();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б3034 смарт: Шляпников 29.09.2025
	
	//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
	Если ЭтаФорма.смартБылаОшибкаРасчетаДоставки Тогда
		ОбщегоНазначения.СообщитьПользователю("Была ошибка получения информации для расчета доставки от сервиса DaData. Обновите принудительно информацию для расчета доставки",, "смартОбновитьПараметрыДляРасчетаДоставки",, Отказ);
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Регион", ЭтаФорма.смартРегион);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВесЗаказа", ЭтаФорма.смартВесЗаказа);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Город", ЭтаФорма.смартГород);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Расстояние", ЭтаФорма.смартРасстояние);
	//-- #Б4316 смарт: Шляпников 14.10.2025
	
	//++ #Б4856 смарт: Шляпников 13.11.2025 / Заказ клиента. Наличие подписанного договора. 
	Если НЕ Отказ Тогда
		
		Если Объект.Договор.смартВидДоговора = Перечисления.смартВидыДоговоров.Оборудование И НЕ Объект.Договор.смартДоговорПодписан Тогда
			
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.Отгрузить));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Сообщение = СтрШаблон("По Заказу клиента в Договоре %1 отсутствует отметка о подписании, отгрузка запрещена.", Объект.Договор.Номер);
				ОбщегоНазначения.СообщитьПользователю(Сообщение,,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4856 смарт: Шляпников 13.11.2025
	
КонецПроцедуры

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура смарт_ПриЧтенииСозданииНаСервере()
	ПересчитатьТЧ_ТоварыВ_ВалютуУУ(Неопределено);
	
    //Богус++
    // Доступность поля менеджер                                       
    //++ смарт:Подкин #932 24.03.2022 16:49:39 добавил  ИЛИ ПользователиКлиентСервер.ТекущийПользователь()=Объект.Автор
    Элементы.Менеджер.Доступность = Не ЗначениеЗаполнено(Объект.Ссылка)	
    ИЛИ УправлениеДоступом.ЕстьРоль("ПолныеПрава")
	//++ #Б-3832 смарт: Фролов 16.07.2025 //Возможность смены менеджера в Заказе клиента в рамках регионального представительства. 
	ИЛИ Объект.Менеджер.Подразделение.ТекущийРуководитель = Пользователи.ТекущийПользователь().ФизическоеЛицо
	//-- #Б-3832 смарт: Фролов 16.07.2025
    ИЛИ ПользователиКлиентСервер.ТекущийПользователь()=Объект.Автор;
    //-- смарт:Подкин #932 24.03.2022 16:49:39
    //Богус--
    // Фролов+ //Пересчет поля табличной части Сумма, чаще нужно при создании заказа копированием.
    Для Каждого Стр Из Объект.Товары Цикл 
        Если НЕ Стр.КоличествоУпаковок = 0 Тогда
            Стр.ЦенаСоСкидкой=Стр.СуммаСНДС/Стр.КоличествоУпаковок;
        КонецЕсли;
    КонецЦикла;	
    // Фролов-
	
	//смартКаратеев ++
	//Для сделок по управленческой организации значение заполняется автоматически, так как подписание документов не требуется.
	Если Объект.Организация.Предопределенный Тогда
		Объект.смартДокументыПодписаны = Истина;
	КонецЕсли;
	//Каратеев --
	
	УстановитьВидимостьДоработанныхЭлементов();
	
	//++ #4426 смарт: Тимофеева 24.09.2025 / Заказ клиента. Обработка Заполнить доставку по клиенту. Доработка. Этап 2.
	ЗаполнитьСпискиВыбораАдресовДоставки();
	//-- #4426 смарт: Тимофеева 24.09.2025	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ)
	
	//УстановитьВидимостьДоработанныхЭлементов();
	
	//++ смарт:ММ #024 201 24.02.2020 - оптимизация открытия Заказа клиента
	////смартКаратеев ++
	//Для каждого Строка Из Объект.Товары Цикл	
	//	смартЗаполнитьМинимальнуюЦенуПродажи(Строка);	
	//КонецЦикла;
	////Каратеев --
	
	//смартЗаполнитьМинМаксЦенуДляВсейТаблицы();	
	//-- смарт:ММ 24.02.2020
	
	//смартКаратеев ++
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	//Каратеев --
    
    //++ смарт:Подкин #946 23.03.2022 10:00:05
    //смартПроизвестиПроверкиВалюты();
    //-- смарт:Подкин #946 23.03.2022 10:00:05 
	
	//++#1261 смарт: Лопато 10.10.2023 //Доработка изменения Заказа клиента для ИМ
	Если ЗначениеЗаполнено(Объект.Б_Идентификатор) Тогда
	   	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ выгружен на сайт, изменение организации и клиента запрещено!");
	КонецЕсли;
    //--#1261 смарт: Лопато 10.10.2023
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПослеЗаписиПосле(ПараметрыЗаписи)
	// Фролов+
	Для Каждого Стр Из Объект.Товары Цикл 
		ПересчитатьЦенуСоСкидкой(Стр);
	КонецЦикла;
	// Фролов-
	//++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	смартЗаполнитьТаблицуСвобождныхОстатковДляДокумента(); 
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023
	
	//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
	смартМаркировкаКлиент.ВывестиПредупреждениеОНаличииТоваровСМаркировкой(Объект);
	//-- #Б3790 смарт: Шляпников 12.08.2025
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	ЗаполнитьДействующиеАкцииПоСтрокамТоваров();
	//-- #Б4818 смарт: Шляпников 17.11.2025
	
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(Объект);
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПередЗакрытиемПеред(Отказ, СтандартнаяОбработка)
	
	// Фролов+ //Каратеев закомментировал и удалил вызов функции и саму функцию "ЕстьСервисныеУслуги(Объект.Ссылка)", 
	//так как функция вызывалась на сервере, а серверные вызовы при закрытии программы запрещены. 
	//Нужно либо убирать отсюда этот код, либо реализовать проверку на ЗавершениеПрограммы!
	//Если Не ЗначениеЗаполнено(Объект.смартИсполнительРаботПоЗаказу) Тогда 
	//	СтандартнаяОбработка=Ложь;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле 'Инженер'",,"Объект.смартИсполнительРаботПоЗаказу",,Отказ);
	//КонецЕсли;
	// Фролов-
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&После("РассчитатьИтоговыеПоказателиЗаказа")
Процедура смарт_РассчитатьИтоговыеПоказателиЗаказа(Форма)
	//смартКаратеев ++
	Для каждого ТекСтрока Из Форма.Объект.Товары Цикл
		Если НЕ ТекСтрока.Сумма = 0 ИЛИ НЕ ТекСтрока.Количество = 0 Тогда
			ТекСтрока.ЦенаСоСкидкой = ?(ТекСтрока.Сумма = 0 ИЛИ ТекСтрока.Количество = 0,0,ТекСтрока.Сумма / ТекСтрока.Количество);
		КонецЕсли;
	КонецЦикла;
	//Каратеев --
КонецПроцедуры

&НаКлиенте
&После("РассчитатьСкидкиНаценкиКлиент")
Процедура смарт_РассчитатьСкидкиНаценкиКлиент()
	Для каждого Строка Из Объект.Товары Цикл	
		//++ смарт:КМД 717 01.12.2021
		смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(Строка, Истина);
		//-- смарт:КМД 717 01.12.2021
		
		//смартЗаполнитьМинимальнуюЦенуПродажи(Строка); 
	КонецЦикла;
	//Каратеев --
КонецПроцедуры

&НаКлиенте
&После("НазначитьРучнуюСкидкуЗавершение")
Процедура смарт_НазначитьРучнуюСкидкуЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры)
	
	//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
	смартПроверитьОтменитьСкидкуНаТоварКлиент(Объект);
		
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	//--#1868 смарт: Лопато 19.06.2024
	
	//смартКаратеев ++
	Для каждого Строка Из Объект.Товары Цикл
		//++ смарт:КМД 717 01.12.2021
		//++#1381 смарт: Лопато 10.07.2023 //Ошибка при назначении ручной скидки в Заказе клиента.  
		смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(Строка, Истина, Ложь);
		//--#1381 смарт: Лопато 10.07.2023
		//-- смарт:КМД 717 01.12.2021
		
		//смартЗаполнитьМинимальнуюЦенуПродажи(Строка);	
	КонецЦикла;
	//Каратеев --
	
	//++ #Б6458 смарт: Шляпников 15.04.2026 / Проверить механизм назначения скидок
	ЗаполнитьДанныеОМаксимальнойСкидке();
	
	Для каждого Строка Из Объект.Товары Цикл
		ПроверитьВозможностьНазначенияРучнойСкидки(Строка.ПолучитьИдентификатор());
	КонецЦикла;
	//-- #Б6458 смарт: Шляпников 15.04.2026

КонецПроцедуры

&НаКлиенте
&После("НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение")
Процедура смарт_НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры)	
	
	//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
	смартПроверитьОтменитьСкидкуНаТоварКлиент(Объект);
		
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	//--#1868 смарт: Лопато 19.06.2024
	
	//смартКаратеев ++
	Для каждого СтрокаИД Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		Строка = Объект.Товары.НайтиПоИдентификатору(СтрокаИД);
		
		//++ смарт:КМД 717 01.12.2021
		//++#1381 смарт: Лопато 10.07.2023 //Ошибка при назначении ручной скидки в Заказе клиента.  
		смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(Строка, Истина, Ложь);
		//--#1381 смарт: Лопато 10.07.2023
		//-- смарт:КМД 717 01.12.2021

		//смартЗаполнитьМинимальнуюЦенуПродажи(Строка);	
	КонецЦикла;
	//Каратеев --
	
	//++ #Б6458 смарт: Шляпников 15.04.2026 / Проверить механизм назначения скидок
	ЗаполнитьДанныеОМаксимальнойСкидке();
	
	Для каждого Строка Из Объект.Товары Цикл
		ПроверитьВозможностьНазначенияРучнойСкидки(Строка.ПолучитьИдентификатор());
	КонецЦикла;
	//-- #Б6458 смарт: Шляпников 15.04.2026

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОтменитьРучныеСкидки")
Процедура смарт_ОтменитьРучныеСкидки(Команда)

	Если Не СкидкиНаценкиКлиент.ВозможнаОтменаРучныхСкидокНаценок(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;

	ОтменитьРучныеСкидкиНаСервере();
	СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок();

	#Вставка
	//++ #Б6458 смарт: Шляпников 15.04.2026 / Проверить механизм назначения скидок
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б6458 смарт: Шляпников 15.04.2026
	#КонецВставки
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура смарт_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	//смартКаратеев ++
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	//Каратеев -- 
	//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С  
	Если ИмяСобытия = "СозданНовыйДоговор" Тогда
		СтруктураРеквизитов=ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Параметр.НовыйДоговор,"смартЗаказКлиента");
		Если НЕ СтруктураРеквизитов.смартЗаказКлиента=Объект.Ссылка Тогда
			Возврат;
		КонецЕсли;	
		ЭтаФорма.Модифицированность=Истина;
		АдресВХ = Параметр.АдресВХ;
		Объект.ЭтапыГрафикаОплаты.Очистить();
		//++ #Б-3346 смарт: Лопато 17.06.2025 //Печать договора из Заказа клиента и Договор контрагента. Доработка Условий оплаты. Этап 2.  
		ЗаполнитьЭтапыОплатыИзВременногоХранилищаСервер(АдресВХ);
		//смартЗаполнитьЭтапыОплаты(Параметр.НовыйДоговор);
		//-- #Б-3346 смарт: Лопато 17.06.2025
		УстановитьСвойстваЭлементовПоПорядкуРасчетов();
		УстановитьДоступностьЭлементовПоСтатусуСервер();
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		Объект.смартСрокПоставки=Параметр.СрокПоставки;
		Объект.Договор=Параметр.НовыйДоговор;
		Объект.АдресДоставки=Параметр.АдресДоставки;  
		Объект.СпособДоставки=Параметр.СпособДоставки;
		Объект.АдресДоставкиЗначение=Параметр.АдресДоставкиЗначение; 
		Объект.АдресДоставкиЗначенияПолей=Параметр.АдресДоставкиЗначенияПолей;  
		ДоговорПриИзмененииСервер();
		ДокументыEDIИнтеграцияКлиент.ПриИзмененииКлючевыхРеквизитовДокумента(ЭтотОбъект);
		смартВидимостьСрокаПоставки();
		смартСпособМестоДоставкиПеревозчикПриИзменении();
		Для Каждого Сообщение Из Параметр.МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла; 
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Ложь;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=ложь; 
		Попытка
			Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
			ЭтаФорма.Модифицированность=Ложь;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если ИмяСобытия = "СозданДоговорЛизинга" Тогда
		СтруктураРеквизитов=ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Параметр.НовыйДоговор,"смартЗаказКлиента");
		Если НЕ СтруктураРеквизитов.смартЗаказКлиента=Объект.Ссылка Тогда
			Возврат;
		КонецЕсли;	
		ЭтаФорма.Модифицированность=Истина;
		УстановитьСвойстваЭлементовПоПорядкуРасчетов();
		УстановитьДоступностьЭлементовПоСтатусуСервер();
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		Объект.Договор=Параметр.НовыйДоговор;
		ДоговорПриИзмененииСервер();
		ДокументыEDIИнтеграцияКлиент.ПриИзмененииКлючевыхРеквизитовДокумента(ЭтотОбъект);
		смартВидимостьСрокаПоставки();
		Для Каждого Сообщение Из Параметр.МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла; 
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Ложь;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=ложь; 
		Попытка
			Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
			ЭтаФорма.Модифицированность=Ложь;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	//-- #1334 смарт: Фролов 03.04.2023
	
КонецПроцедуры 

//++ #1334 смарт: Фролов 07.04.2023 //Заявка на формирование и подписание договора из 1С 
&НаКлиенте
Процедура смартСпособМестоДоставкиПеревозчикПриИзменении()
	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элементы.СпособДоставки.Имя);
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	Если НЕ Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
        Объект.ЗонаДоставки = смартПолучитьЗонуДоставкиМосква();
	КонецЕсли;
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал") Тогда
		Элементы.смартГруппаДоставкаДоп.видимость = истина;
		Элементы.смартЗаполнитьДоставкуПоКлиенту.Видимость = Ложь;
		Элементы.СтраницаДополнительныеРеквизитыДоставки.Видимость = Ложь;
	Иначе
		Элементы.смартГруппаДоставкаДоп.видимость = Ложь;
		Элементы.смартЗаполнитьДоставкуПоКлиенту.Видимость = Истина;
		Элементы.СтраницаДополнительныеРеквизитыДоставки.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры//-- #1334 смарт: Фролов 07.04.2023

&НаСервере
&После("ОбработкаВыбораПодборНаСервере")
Процедура смарт_ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	//++#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);	
	ЕстьПрослеживаемыеТовары = 0;
	
	Для каждого Строка Из ТаблицаТоваров Цикл
		
		ПараметрыОтбора = Новый Структура("Номенклатура",Строка.Номенклатура);
		МассивПТ = Объект.Товары.НайтиСтроки(ПараметрыОтбора);

		Для каждого НайденнаяСтрока Из МассивПТ Цикл		
			
			ПризнакПрослеживаемости = Строка.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар;		
			
			Если ПризнакПрослеживаемости = Истина Тогда			
				ЕстьПрослеживаемыеТовары = ЕстьПрослеживаемыеТовары + 1;				
			КонецЕсли;
			
			НайденнаяСтрока.смартПрослеживаемыйТовар = ПризнакПрослеживаемости;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//++#895 смарт: Демичев 28.12.2022(( Консервация
	//Если ЕстьПрослеживаемыеТовары > 0 Тогда
	//	СмартПоменятьВидимостьГруппаПредупреждение(ЭтотОбъект,Истина)	
	//КонецЕсли;
	
	//--#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
КонецПроцедуры

//++ смарт:Подкин #1143 17.08.2022 15:47:05
&НаСервере
Процедура смартИзменитьОбеспечение(ИндексСтроки)
    
    МассивСтрокИндексы = Новый Массив;  
    МассивСтрокИндексы.Добавить(ИндексСтроки);
    ВО=Новый Массив;
    //++ #1351 смарт: Фролов 25.05.2023 //Разделение остатков по организациям в заказах  
	//ВО.Добавить(Перечисления.ВариантыОбеспечения.Требуется);  //К обеспечению  
	ВО.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется);  //Не обеспечивать
	//-- #1351 смарт: Фролов 25.05.2023
	ВыбранноеЗначение=Новый Структура("ЗаполнятьЦелымиУпаковками,ПереченьВариантов",Ложь,ВО);
    
    ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
    ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
    ПутиКДанным = Новый Соответствие; //Описание особенностей формы
    ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки"); // дату отгрузки работ необходимо брать из поля "Дата отгрузки".
    ПараметрыДокумента = Новый Структура;
    ПараметрыДокумента.Вставить("СтатусКВыполнению", Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
    ПараметрыДокумента.Вставить("ГруппаСкладов", Объект.Склад);
    ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыКлиентов);
    ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
    ПараметрыДокумента.Вставить("ИмяТабличнойЧасти","Товары");
    
    Таблица = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспеченияДокумента(Объект,ВО,ПараметрыДокумента,МассивСтрокИндексы);
    
    Текст=Документы.ЗаказКлиента.ЗаполнитьВариантОбеспечения(Объект,Неопределено,"ИндексыСтрок",Таблица);  
    
КонецПроцедуры //-- смарт:Подкин #1143 17.08.2022 15:47:05

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
&НаСервере
Процедура смарт_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Основание) И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.смартIECHOСпецификация") Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.Основание.Номенклатура) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Не заполнена номенклатура, заказ клиента не создан");
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 17.01.2021
// --смарт {задача 317} (24.09.2020)

//++ смарт:ММ #093 450 04.02.2021 - Доработка Заказа клиента
&НаКлиенте
Процедура смартПродажаЧерезДилераПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
	Если НЕ Объект.смартПродажаЧерезДилера Тогда
		Объект.смартКонечныйПокупатель = Неопределено;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 04.02.2021

&НаКлиенте
Процедура смарт_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом   
	смартНеВыполнятьПроверкуПередЗаписью = НеВыполнятьПроверкуПередЗаписью;
	//-- #2552 смарт: Тимофеева 20.10.2025
КонецПроцедуры

//++ #1436 смарт: Фролов 25.08.2023 //Проверка валюты в Заказе и Договоре при проведении  
&НаКлиенте 
&После("ПередЗаписью")
Процедура смарт_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	//++ #1807 смарт: Мосолов 05.07.2024 //Расчет автоматических скидок при записи
	МожноПрименитьСкидки = смартПроверитьВозможностьАвтоматическихСкидок();  
	
	Если МожноПрименитьСкидки Тогда   
		
		//++ #Б-1234 смарт: Мосолов 29.10.2024 //Уведомление об автоматических скидках выводить только один раз
		Если ЗначениеЗаполнено(Объект.Ссылка) 
			И ЭтаФорма.смартСуммаДокументаИзменилась
			И Не ЭтаФорма.смартЖдемОтветаНаВопросПроСкидки Тогда
			
			ЭтаФорма.смартВопросПроСкидкиЗадан = Ложь; 
			
		КонецЕсли;
		//-- #Б-1234 смарт: Мосолов 29.10.2024  
		
		Если ЭтаФорма.смартВопросПроСкидкиЗадан И ЭтаФорма.смартЖдемОтветаНаВопросПроСкидки Тогда
			
			Отказ = Истина;
			
		КонецЕсли;
		
		Если НЕ ЭтаФорма.смартВопросПроСкидкиЗадан Тогда
			
			Отказ = Истина;
			ЭтаФорма.смартВопросПроСкидкиЗадан = Истина;
			ЭтаФорма.смартЖдемОтветаНаВопросПроСкидки = Истина; 
			
			//++ #Б-1234 смарт: Мосолов 29.10.2024 //Уведомление об автоматических скидках выводить только один раз
			ЭтаФорма.смартСуммаДокументаИзменилась = Ложь;
			//-- #Б-1234 смарт: Мосолов 29.10.2024  
			
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Заполнить автоматические скидки");
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Продолжить без скидок");
			
			Оповещение = Новый ОписаниеОповещения("смартЗавершениеВопросаОПримененииСкидок", ЭтотОбъект, Параметры);
			ПоказатьВопрос(Оповещение, 
				"В Заказе клиента есть товары, которые соответствуют условию предоставления автоматической скидки.
					|Заполнить скидки по товарам?",
			    СписокКнопок);  
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1807 смарт: Мосолов 05.07.2024 

	Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(Объект.Договор)
		И НЕ Объект.Валюта=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Объект.Договор,"ВалютаВзаиморасчетов")
		И НЕ ЭтаФорма.смартВопросПроВалютуЗадан ТОгда
		Отказ=Истина;
		СписокЗначенийОтветов = Новый СписокЗначений;
		//++ #1436 смарт: Лопато 11.10.2023 //Проверка валюты в Заказе и Договоре при проведении 
		Если НЕ Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Объект.Договор, "смартДоговорПодписан") = Истина Тогда
			СписокЗначенийОтветов.Добавить("Установить в договоре валюту "+Объект.Валюта+"");
		КонецЕсли;	
		//-- #1436 смарт: Лопато 11.10.2023
		СписокЗначенийОтветов.Добавить("Установить в заказе валюту "+Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Объект.Договор,"ВалютаВзаиморасчетов")+""); 
		СписокЗначенийОтветов.Добавить("Вернуться к редактированию заказа");
				
		Оповещение = Новый ОписаниеОповещения("смартВыборВариантаИзменениеВалют", ЭтотОбъект,);
		ТекстВопроса = НСтр("ru = 'Валюта заказе клиента отличается от договора'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокЗначенийОтветов, , "Вернуться к редактированию заказа");
		ЭтаФорма.смартВопросПроВалютуЗадан=Истина; 
		ЭтаФорма.смартЖдемответаНаВопрос=Истина;
		Возврат;
	КонецЕсли;
	
	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом   
	Если НЕ смартНеВыполнятьПроверкуПередЗаписью И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И Объект.Дата >= Дата("20251106") Тогда
		
		РезультатПроверки = ПроверитьТребованияДополнительнойКомплектацииСублимационногоОборудования();
		
		Если РезультатПроверки.ТребуетсяВывестиУведомлениеМенеджеру Тогда			
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.ТекстУведомления,,,, Отказ);
		КонецЕсли;

	КонецЕсли;
	//-- #2552 смарт: Тимофеева 20.10.2025
	
	//++ #5082 смарт: Тимофеева 01.12.2025 / Настройка правил продаж (Ковчег). Дополнительная проверка.
	//Если НЕ смартНеВыполнятьПроверкуПередЗаписью Тогда
	//	ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
	//	Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
	//		УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
	//		ОбщегоНазначенияКлиент.СообщитьПользователю("Повторите запись документа",,,, Отказ);
	//	КонецЕсли; 
	//КонецЕсли;
	//-- #5082 смарт: Тимофеева 01.12.2025
	
	//++ #5358 смарт: Тимофеева 12.01.26 / Заказ клиента. Запретить отгрузку от ООО Ковчег   
	Если НЕ смартНеВыполнятьПроверкуПередЗаписью И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		РезультатПроверки = ПроверитьВозможностьЗаписиПоОрганизации();
		
		Если РезультатПроверки.ТребуетсяВывестиУведомлениеМенеджеру Тогда			
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.ТекстУведомления,,,, Отказ);
		КонецЕсли;

	КонецЕсли;
	//-- #5358 смарт: Тимофеева 12.01.26

КонецПроцедуры //-- #1436 смарт: Фролов 25.08.2023

//++ #1807 смарт: Мосолов 05.07.2024 //Расчет автоматических скидок при записи
&НаСервере 
Функция смартПроверитьВозможностьАвтоматическихСкидок()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Истина);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	РезультатПредварительногоРасчета = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	
	СтрокиСкидок = РезультатПредварительногоРасчета.ДеревоСкидок.Строки.НайтиСтроки(Новый Структура("Управляемая", Ложь), Истина); 
	
	Для Каждого СтрокаСкидок Из СтрокиСкидок Цикл
		
		Если СтрокаСкидок.ПараметрыУсловий.УсловияВыполнены Тогда
			
			//++ #Б-1234 смарт: Мосолов 29.10.2024 //Уведомление об автоматических скидках выводить только один раз 
			Если СтрокаСкидок.ПараметрыУсловий.КодыСтрок.Количество() Тогда 
				
				Для Каждого КодСтроки Из СтрокаСкидок.ПараметрыУсловий.КодыСтрок Цикл
					
					Отбор = Новый Структура;
					Отбор.Вставить("КлючСвязи", КодСтроки);
					СтрокиТоваров  = Объект.Товары.НайтиСтроки(Отбор);
					
					Если НЕ СтрокиТоваров.Количество() = 0
						И СтрокиТоваров[0].СуммаАвтоматическойСкидки = 0 Тогда
						
						Возврат Истина;
						
					КонецЕсли;   
					
				КонецЦикла;
				
			Иначе
				
				Для Каждого СтрокаТовара Из Объект.Товары Цикл
					
					Если СтрокаТовара.СуммаАвтоматическойСкидки = 0 Тогда
						
						Возврат Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			//-- #Б-1234 смарт: Мосолов 29.10.2024 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции //-- #1807 смарт: Мосолов 05.07.2024 

//++ #1807 смарт: Мосолов 05.07.2024 //Расчет автоматических скидок при записи
&НаКлиенте
Процедура смартЗавершениеВопросаОПримененииСкидок(Результат, Параметры) Экспорт 
	
	смартЖдемОтветаНаВопросПроСкидки = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		АдресВХранилище = ВыполнитьПредварительныйРасчетСкидокНаСервере();
		Оповещение = Новый ОписаниеОповещения("НазначитьАвтоматическиеСкидкиЗавершение", ЭтотОбъект);
		СкидкиНаценкиКлиент.ОткрытьФормуНазначенияУправляемыхСкидокНаценок(АдресВХранилище, Оповещение);

	КонецЕсли;
	
КонецПроцедуры //-- #1807 смарт: Мосолов 05.07.2024

&НаКлиенте
&После("ОбработкаВыбораПодборНаКлиенте")
Процедура смарт_ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)	
	//++#895 смарт: Демичев 28.12.2022((
	смартОбщегоНазначенияКлиент.смартОбработкаВыбораТоваров(ВыбранноеЗначение);
	//--#895 смарт: Демичев 28.12.2022))	
КонецПроцедуры

//++ смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 
&НаКлиенте
Процедура смартОбработкаВыбораОсновногоЭДО(ЭлементФ, ВыбЗнач)
	
	смартОбщегоНазначения.ЗаписатьВыборОсновногоЭДО(Объект.Контрагент,ВыбЗнач);
	
КонецПроцедуры //-- смарт: #1438 Корбутов 04.09.2023

//++#1921 смарт: Лопато 15.07.2024 //Помощник Продаж исправление логики отображения наличия товара  
&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодбор")
Процедура смарт_ОткрытьПодбор(Команда)

	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ЗаказКлиента.ФормаДокумента.Команда.ОткрытьПодбор");
	
	Отказ = Ложь;
	Если (ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Объект.Соглашение))
		Или Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОчиститьСообщения();
		СообщитьОбОшибкахОткрытияПодбора(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru='заказ клиента'"));
	КонецЕсли;
	
	ОперацииПередачи = ОперацииПередачиТоваров();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Соглашение",               Объект.Соглашение);
	ПараметрыФормы.Вставить("Организация",              Объект.Организация);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС",          Объект.ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("НалогообложениеНДС",       Объект.НалогообложениеНДС);
	ПараметрыФормы.Вставить("ВозвращатьМногооборотнуюТару", Объект.ВернутьМногооборотнуюТару);
	Если ОперацииПередачи.Найти(Объект.ХозяйственнаяОперация) <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре()));
		ПараметрыФормы.Вставить("СкрыватьРучныеСкидки", Истина);
	КонецЕсли;
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                      Истина);
	ПараметрыФормы.Вставить("Склад",                                   Объект.Склад);
	ПараметрыФормы.Вставить("Валюта",                                  Объект.Валюта);
	ПараметрыФормы.Вставить("Заголовок",                               ПараметрЗаголовок);
	
	#Удаление //++#1921 смарт: Лопато 15.07.2024 //Помощник Продаж исправление логики отображения наличия товара
	ПараметрыФормы.Вставить("Дата",                                    Объект.Дата);
	#КонецУдаления
	
	#Вставка
	//++#1921 смарт: Лопато 15.07.2024 //Помощник Продаж исправление логики отображения наличия товара  
	ПараметрыФормы.Вставить("Дата",                                    ТекущаяДата());
	//--#1921 смарт: Лопато 15.07.2024
	#КонецВставки
	
	ПараметрыФормы.Вставить("Документ",                                Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",                  ПараметрыУказанияСерий);
	ПараметрыФормы.Вставить("Назначение",                              Объект.Назначение);
    ПараметрыФормы.Вставить("Подразделение",                           Объект.Подразделение);
    ПараметрыФормы.Вставить("ПодборВариантовОбеспечения",              Истина);
    
    ПараметрыФормы.Вставить("ВариантыОбеспечения",    ВариантыОбеспечения);
    
	#Вставка
    //++ смарт:Подкин #1047 07.06.2022 10:09:11
    ПараметрыФормы.Вставить("смартРазрешитьПовышеннуюСкидку",    Объект.смартРазрешитьПовышеннуюСкидку);
    ПараметрыФормы.Вставить("смартПроцентРазрешеннойМаксимальнойСкидки",    Объект.смартПроцентРазрешеннойМаксимальнойСкидки);
    //-- смарт:Подкин #1047 07.06.2022 10:09:11

	//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
	ПараметрыФормы.Вставить("Партнер", 								   Объект.Партнер);
	//--#1868 смарт: Лопато 19.06.2024
	#КонецВставки
	
    ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура смарт_СкладПриИзмененииПеред(Элемент)
	
	Если Не ПользовательПолный() И Не ПравильныйСклад() Тогда
		Возврат;
	КонецЕсли;
	
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость = (НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок = "");
	
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
		
    	Элементы.смартОстаткиПоОрганизациям.Видимость = (ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий <> Элементы.смартОстаткиПоОрганизациям.Заголовок);
		ЭтаФорма.смартГруппаОстаткиРазвернута = (ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий <> Элементы.смартОстаткиПоОрганизациям.Заголовок);
		
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок = "Свернуть предупреждение";
		Конецесли;
		
	КонецЕсли;
	
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий = Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023

	//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
	смартОбновитьАдресДоставкиСамовывоз();
	//--#1382 смарт: Лопато 21.06.2023
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	
	//++ #3946 смарт: Шляпников 31.07.2025 / Настройка правил продаж чернил МАРАБУ (Ковчег)
	ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
	Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
		УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
	КонецЕсли;
	//-- #3946 смарт: Шляпников 31.07.2025
	
	// Добавлено поле РекламноеВоздействие. Устанавливаем оформление поля ввода
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Товар = ТекущаяСтрока.Номенклатура;
	
	РасшСмарт_УсловноеОформлениеРекламныеВоздействия(Товар, Истина); 
	
	//++ #1338 смарт: Фролов 12.04.2023 //Мелкие доработки
	смартУсловноеОформлениеКтоПередал(Товар,Истина);
	//-- #1338 смарт: Фролов 12.04.2023
	
    ////смартКаратеев ++
    //Если НЕ ТекущаяСтрока.ХарактеристикиИспользуются Тогда
    //	смартЗаполнитьМинимальнуюЦенуПродажи(ТекущаяСтрока);
    //КонецЕсли;
    ////Каратеев --
	
	//++ смарт:ММ #055 315 14.07.2020 - Текущая дата отгрузки (игнорирование настроек)  
	Если ТекущаяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Требуется") Тогда
		ТекущаяСтрока.ДатаОтгрузки = ТекущаяДата();	
	КонецЕсли;
	//-- смарт:ММ 14.07.2020
	
    //смарт 914 Каратеев ++ 01.03.2022: Блокировка ЭтапыГрафикаОплаты по распоряжению Макачева А.Н. от 28.02.2022
    смартУстановитьДоступностьЭтаповОплаты();
    //смарт 914 Каратеев --: Блокировка ЭтапыГрафикаОплаты   
    
    //++ смарт:Подкин #946 24.03.2022 14:27:44 
    Если РазницаТаблиц() Тогда  
        смартПроизвестиПроверкиВалюты();
    КонецЕсли;
    //-- смарт:Подкин #946 24.03.2022 14:27:44
	
	//++#895 смарт: Холопов П. 19.05.2022 // Доработано Демичевым 09122022
	Результат = смартОбщегоНазначения.смартПроверитьНаПрослеживаемостьНаСервере(Товар);
	
	ТекущаяСтрока.смартПрослеживаемыйТовар = Результат;
	
	//Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022
	//Если Результат = Истина И ЭтотОбъект.смартЕстьПрослеживаемыеТовары = Ложь Тогда 
	//	
	//	СмартПоменятьВидимостьГруппаПредупреждение(ЭтотОбъект,Истина);
	//	
	//ИначеЕсли Результат = Ложь И ЭтотОбъект.смартЕстьПрослеживаемыеТовары = Истина Тогда 
	//	
	//	смартПроверитьНаличиеПрослеживаемыхТоваровНаСервере(); 
	//	
	//КонецЕсли;
	//Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022
	
	Если Результат Тогда 
		
		смартОбщегоНазначенияКлиент.смартВывестиПредупреждениеПользователюОПрослеживаемомТоваре(); 
		
	КонецЕсли;
	//--#895 смарт: Холопов П. 19.05.2022 Доработано Демичевым 09122022
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023

	//++#1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
	смартУстановитьВСтрокеПроцентИндивидуальнойСкидкиПоНоменклатуре(ТекущаяСтрока);
	//--#1356 смарт: Лопато 14.06.2024
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	Массив = Новый Массив;
	Массив.Добавить(Элементы.Товары.ТекущаяСтрока);
	ЗаполнитьДанныеОМаксимальнойСкидке(Массив);
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
	//++ #Б-6672 смарт: Фролов 18.05.2026 //При создании заказа клиента подставлять Рекламное воздействие из посещенных мероприятий.
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РекламноеВоздействие) Тогда
		
		ТекущаяСтрока.РекламноеВоздействие = смартПолучитьИсточникРекламногоВоздействия(Товар);
		
	КонецЕсли;
	//-- #Б-6672 смарт: Фролов 18.05.2026
	
КонецПроцедуры 

//++#1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
&НаКлиенте
Процедура смартУстановитьВСтрокеПроцентИндивидуальнойСкидкиПоНоменклатуре(СтрокаТовары)

	ПроцентИндивидуальнойСкидки = смартПолучитьИндивидуальнуюСкидкуКлиентаПоНоменклатуреСервер(Объект.Дата, Объект.Партнер, СтрокаТовары.Номенклатура);
	
	СтрокаТовары.ПроцентРучнойСкидки = ПроцентИндивидуальнойСкидки;
	
	ТоварыПроцентРучнойСкидкиПриИзменении(Элементы.ТоварыПроцентРучнойСкидки);
	
КонецПроцедуры //--#1356 смарт: Лопато 14.06.2024

//++#1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
&НаСервереБезКонтекста
Функция смартПолучитьИндивидуальнуюСкидкуКлиентаПоНоменклатуреСервер(Дата, Партнер, Номенклатура)

	Возврат смартОбщегоНазначения.смартПолучитьИндивидуальнуюСкидкуКлиентаПоНоменклатуре(Дата, Партнер, Номенклатура);
	
КонецФункции //--#1356 смарт: Лопато 14.06.2024

&НаКлиенте
Процедура смарт_ТоварыСкладПриИзмененииПосле(Элемент)
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023

	//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
	смартОбновитьАдресДоставкиСамовывоз();
	//--#1382 смарт: Лопато 21.06.2023
	
	//++ #7106 смарт: Тимофеева 29.06.2026 / Списание каталогов. Оповещение пользователей при смене склада отгрузки.
	ПроверитьИОповеститьОКомлектацииЗаказаСублимационнымОборудованием(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор());
	//-- #7106 смарт: Тимофеева 29.06.2026
	
КонецПроцедуры

//++ смарт:Подкин #946 24.03.2022 14:51:08
&НаСервере
Функция РазницаТаблиц()  
    
    ДокументОбъект = РеквизитФормыВЗначение("Объект");
    ТзРазницы=ДокументОбъект.ОпределитьИзмененияВерсийОбъекта(Объект, "Номенклатура,Количество,ВидЦены");
    
    Если ТзРазницы.Количество() = 0 Тогда 
        Возврат Ложь;
    Иначе  
        Возврат Истина; 
    КонецЕсли;
    
КонецФункции
//-- смарт:Подкин #946 24.03.2022 14:51:08

&НаСервере
Функция смартПроверкаКурсаРасчета(Номенклатура, ВидЦены) 
    //++ смарт:Подкин #914 02.03.2022 17:12:54 проверка вида цены по сегменту
    ДокументОбъект = РеквизитФормыВЗначение("Объект");
    СтруктураПроверки = ДокументОбъект.смартПроверкаКурсаРасчета(Номенклатура,ВидЦены); 
    //СтруктураПроверки=Новый Структура("РезультатПроверки,ВалютаСегмент");
    
    //++ смарт:Подкин #1025 п3 22.05.2022 14:12:42
    ПродажаВРублях=НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
    ПараметрыВыбораВидаЦены = Новый Массив; 
    СписокЦен=Новый СписокЗначений; 
    СписокЦен.Добавить(Константы.ВалютаУправленческогоУчета.Получить()); 
    
    ЦеныСтруктура=Новый Структура;
    ЦеныСтруктура.Вставить("Ключ","Статус");
    ЦеныСтруктура.Вставить("Значение",Перечисления.СтатусыДействияВидовЦен.Действует);
    ПараметрыВыбораВидаЦены.Добавить(ЦеныСтруктура);  
    
    ЦеныСтруктура=Новый Структура;
    ЦеныСтруктура.Вставить("Ключ","ИспользоватьПриПродаже");
    ЦеныСтруктура.Вставить("Значение",Истина);
    ПараметрыВыбораВидаЦены.Добавить(ЦеныСтруктура);
    
    ЦеныСтруктура=Новый Структура;
    ЦеныСтруктура.Вставить("Ключ","ЦенаВключаетНДС");
    ЦеныСтруктура.Вставить("Значение",Объект.ЦенаВключаетНДС);
    ПараметрыВыбораВидаЦены.Добавить(ЦеныСтруктура);

    //-- смарт:Подкин #1025 п3 22.05.2022 14:12:42
    
    Если НЕ СтруктураПроверки = Неопределено И СтруктураПроверки.РезультатПроверки 
        И (ТИПЗНЧ(СтруктураПроверки.ВалютаСегмент)=Тип("СправочникСсылка.Валюты") ИЛИ СтруктураПроверки.ВалютаСегмент) Тогда
        
               
        //++ смарт:Подкин #1025 п3 22.05.2022 14:04:08   
        Если ПродажаВРублях Тогда
            СписокЦен.Добавить(Константы.ВалютаРегламентированногоУчета.Получить()); 
            ЦеныСтруктура=Новый Структура;
            ЦеныСтруктура.Вставить("Ключ","ВалютаЦены");
            ЦеныСтруктура.Вставить("Значение",СписокЦен);
            
            ПараметрыВыбораВидаЦены.Добавить(ЦеныСтруктура);
            Элементы.ТоварыВидЦены.ПараметрыВыбора= Новый ФиксированныйМассив(Новый Массив);
            СписокВидовЦен=смартДоступныеВидыЦен(ПараметрыВыбораВидаЦены);
            Элементы.ТоварыВидЦены.РежимВыбораИзСписка=Истина;
            Элементы.ТоварыВидЦены.СписокВыбора.ЗагрузитьЗначения(СписокВидовЦен);
        Иначе
            СписокЦен.Добавить(Справочники.Валюты.НайтиПоКоду("000")); 
            ЦеныСтруктура=Новый Структура;
            ЦеныСтруктура.Вставить("Ключ","ВалютаЦены");
            ЦеныСтруктура.Вставить("Значение",СписокЦен);
            
            ПараметрыВыбораВидаЦены.Добавить(ЦеныСтруктура);
            Элементы.ТоварыВидЦены.ПараметрыВыбора= Новый ФиксированныйМассив(Новый Массив);
            СписокВидовЦен=смартДоступныеВидыЦен(ПараметрыВыбораВидаЦены);
            Элементы.ТоварыВидЦены.РежимВыбораИзСписка=Истина;
            Элементы.ТоварыВидЦены.СписокВыбора.ЗагрузитьЗначения(СписокВидовЦен);
        КонецЕсли;    
        //-- смарт:Подкин #1025 п3 22.05.2022 14:04:08
        
    КонецЕсли; 
    
    Возврат СтруктураПроверки;  
    //-- смарт:Подкин #914 02.03.2022 17:12:54
КонецФункции  

//++ смарт:Подкин #1025 п3 22.05.2022 20:26:36
&НаСервере
Функция смартДоступныеВидыЦен(Отборы = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦены
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ИСТИНА
	|");
	
	Если Отборы <> Неопределено Тогда
		Для каждого Отбор Из Отборы Цикл
			Запрос.Текст = Запрос.Текст + Символы.ПС + "	И ВидыЦен." + Отбор.Ключ + " в (&" + Отбор.Ключ+")";
			Запрос.УстановитьПараметр(Отбор.Ключ, Отбор.Значение);
		КонецЦикла;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВидЦены");
	
КонецФункции //-- смарт:Подкин #1025 п3 22.05.2022 20:26:36

&НаКлиенте
Процедура смарт_ТоварыХарактеристикаПриИзмененииПосле(Элемент)
	// Функционал блокировки ячейки количество, если тип номенклатуры ТоварРулоныХарактеристики.
	// Эта номенклатура хранится в погонных метрах, а характеристика соответствует длине рулона.
	// Блокировка была сделана, чтобы мененджеры не отгружали рулон 100 метров в количестве 1. 
	// Количество подставляется автоматически при выборе характеристики.
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Товар = ТекущаяСтрока.Номенклатура;  
	Если НоменклатураВРулонахПоХарактеристикам(Товар)  Тогда
		
		ТекущаяСтрока.КоличествоУпаковок = 0;
		ТекущаяСтрока.Количество = 0;
		//ТекущаяСтрока.Количество = СтрокуВЧисло(ТекущаяСтрока.Характеристика);
		//ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество;
		
		//РасшСмарт_УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Товар);
	КонецЕсли;
	
    ////смартКаратеев ++
    //Если ТекущаяСтрока.ХарактеристикиИспользуются Тогда
    //	смартЗаполнитьМинимальнуюЦенуПродажи(ТекущаяСтрока);
    //КонецЕсли;
    ////Каратеев --
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023
КонецПроцедуры
//Каратеев-

// ЯшниковДА 20180423 +++
&НаКлиенте
Процедура смарт_ТоварыКоличествоУпаковокПриИзмененииПеред(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	
	Если НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура) Тогда		
		Если Не ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка) Тогда 			
			ВывестиСообщениеОбОшибкеПользователю(Строка.НомерСтроки);
			Строка.КоличествоУпаковок = 0;
		КонецЕсли;			
	КонецЕсли;
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	Если Строка.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить")
		ИЛИ Строка.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада") 
		ИЛИ Строка.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов") Тогда
		РезультатПроверки=смартПроверитьОстаткиПоСтрокеПоОрганизации(Строка.Номенклатура,Строка.Характеристика);
		Если Строка.КоличествоУпаковок>РезультатПроверки Тогда
			Сообщить("Не достаточно товара "+Строка.Номенклатура+" в организации "+Объект.Организация+" доступно "+РезультатПроверки+"");
			смартИзменитьОбеспечение(Строка.НомерСтроки-1);
		КонецЕсли;	
	КонецЕсли;
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023
КонецПроцедуры
// ЯшниковДА 20180423 ---

// Фролов+
&НаКлиенте
Процедура смарт_ОрганизацияПриИзмененииПосле(Элемент)
	
	//++ #3946 смарт: Шляпников 31.07.2025 / Настройка правил продаж чернил МАРАБУ (Ковчег)
	ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
	Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
		УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
	КонецЕсли;
	//-- #3946 смарт: Шляпников 31.07.2025
	
	УстановитьВидимостьПредупреждений();
	УстановитьЗначенияПоУмолчанию();
	УстановитьДокументПодписанДляУУ();
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах 
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023 
	//++ #1272 смарт: Фролов 10.05.2023 //Функционал печати договора из Заказа клиента -изменить шаблон 
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураРеквизитов=ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Соглашение,"Организация");
		Если СтруктураРеквизитов.Организация<>Объект.Организация Тогда
			Объект.Соглашение=Неопределено;
			Объект.Договор=Неопределено;
		КонецЕсли;	
	КонецЕсли;
	//-- #1272 смарт: Фролов 10.05.2023
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	ОбновитьЗаголовокИВидимостьКнопкиПодбораАкций();
	//-- #Б4818 смарт: Шляпников 17.11.2025
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_КонтактноеЛицоПриИзмененииПосле(Элемент)
	ОбновитьТелефоныКонтактногоЛица();
КонецПроцедуры

&НаКлиенте
Процедура смарт_КонтрагентПриИзмененииПосле(Элемент)
	ДанныеКонтранента=ПолучитьДанныеКонтрагента(Объект.Контрагент);
	Если ДанныеКонтранента.НеПровенятьРиски Тогда Возврат КонецЕсли;
		
	Если Не ИндексыСПАРКРиски=Неопределено И (ИндексыСПАРКРиски.СводныйИндикаторГрадация=ПредопределенноеЗначение("Перечисление.ГрадацияИндексовСПАРКРиски.Высокий") 
		 Или ИндексыСПАРКРиски.СводныйИндикатор<=0) И ДанныеКонтранента.ЮрЛицо Тогда 
		Текст="У выбранного контрагента высокая степень риска!
					|Документ не будет проведен.";
		ПоказатьПредупреждение(,Текст);
		СброситьПроведениеПриВысокомСПАРКРиске();
	КонецЕсли;	
	
	//++ смарт:ММ #086 362 16.12.2020 
	НастроитьВидимостьДоступность();
	//-- смарт:ММ 16.12.2020
	
	//++ #1652 смарт: Ермаков 26.06.2024 / Доработка карточки Контрагента
	смартОпределитьВидимостьОтправлятьВсеДокументыЧерезЭДО();
	//-- #1652 смарт: Ермаков 26.06.2024 
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	смартОбновитьСостояниеСтопЛистаТехническойОтсрочки();
	//-- #4792 смарт: Тимофеева 17.03.26

КонецПроцедуры

&НаКлиенте
Процедура смартДатаПродленияРезервовПриИзменении(Элемент)
	Если ПроцентОплаты>0 Тогда Возврат КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.смартДатаПродленияРезервов) Тогда 
		//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
		Если НачалоДня(Объект.смартДатаПродленияРезервов) < НачалоДня(ТекущаяДата()) Тогда
			Объект.смартДатаПродленияРезервов = КонецДня(ТекущаяДата());
		КонецЕсли;
		Объект.смартКонечнаяДатаРезерва = КонецДня(Объект.смартДатаПродленияРезервов);
		//--#1205 смарт: Лопато 05.10.2022
	Иначе
		ДатаДок=?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
		//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
		Объект.смартКонечнаяДатаРезерва = КонецДня(смартСервер.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ДатаДок, 7));
		//--#1205 смарт: Лопато 05.10.2022
	КонецЕсли;	
	Элементы.смартРезервДо.Заголовок="Резерв продлен до: "+Формат(Объект.смартКонечнаяДатаРезерва,"ДЛФ=D");
	//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
	//Объект.смартРезервЗаканчивается=Объект.смартКонечнаяДатаРезерва-ТекущаяДата()<=86400;
	ЭтаФорма.смартРезервЗаканчивается = смартОбщегоНазначения.смартЦелыхДнейМеждуДатами(ТекущаяДата(), Объект.смартКонечнаяДатаРезерва) < 1;
	//--#1205 смарт: Лопато 05.10.2022
КонецПроцедуры
// Фролов-

&НаКлиенте
&После("СпособМестоДоставкиПеревозчикПриИзменении")
Процедура смарт_СпособМестоДоставкиПеревозчикПриИзменении(Элемент)
	//смартКаратеев ++
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	//Каратеев --
	
	//++ смарт:Подкин #896 11.02.2022 10:20:57 
	Если НЕ Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
        Объект.ЗонаДоставки = смартПолучитьЗонуДоставкиМосква();
	КонецЕсли;
	//-- смарт:Подкин #896 11.02.2022 10:20:57  

	
	//++ Смарт: Белоусова 566 27.06.2021
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал") Тогда
	//если объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз тогда
		Элементы.смартГруппаДоставкаДоп.видимость = истина;
		Элементы.смартЗаполнитьДоставкуПоКлиенту.Видимость = Ложь;
		Элементы.СтраницаДополнительныеРеквизитыДоставки.Видимость = Ложь;
	Иначе
		Элементы.смартГруппаДоставкаДоп.видимость = Ложь;
		Элементы.смартЗаполнитьДоставкуПоКлиенту.Видимость = Истина;
		Элементы.СтраницаДополнительныеРеквизитыДоставки.Видимость = Истина;
	КонецЕсли;
	  
	//-- Смарт: Белоусова 566 27.06.2021
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	Объект.смартРазрешенаБесплатнаяДоставка = Ложь;
	Объект.смартИДРазрешенияНаБесплатнуюДоставку = "";
	
	Если НЕ Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента") И ДоставкаРассчитана() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо пересчитать стоимость платной доставки !");
	КонецЕсли;
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
	Объект.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны = Ложь;
	Объект.смартИДРазрешенияНаДоставкуВнеЗоны = "";
	//-- #Б4868 смарт: Шляпников 12.11.2025
	
	//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
	РассчитатьПараметрыДоставки();
	//-- #Б4316 смарт: Шляпников 14.10.2025

КонецПроцедуры

//++ смарт:ММ #035 174 13.03.2020 
Функция смартПолучитьЗонуДоставкиМосква()
	
	Настройка = Справочники.смартПредопределенныеЗначения.ЗонаДоставкиМоскваМО;
	
	Если Настройка <> Неопределено Тогда
		Возврат Настройка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции //-- смарт:ММ 13.03.2020

&НаКлиенте
&После("АдресДоставкиПриИзменении")
Процедура смарт_АдресДоставкиПриИзменении(Элемент) Экспорт
	
	//смартКаратеев ++
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	//Каратеев --
	
	//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
	РассчитатьПараметрыДоставки();
	//-- #Б4316 смарт: Шляпников 14.10.2025
	
КонецПроцедуры

&НаКлиенте
&После("АдресДоставкиОбработкаВыбора")
Процедура смарт_АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//смартКаратеев ++
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	//Каратеев --
	
	//++ #Б4274 смарт: Шляпников 04.09.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки. Дополнения.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Представление") И ВыбранноеЗначение.Свойство("Адрес") Тогда
		
		СтандартнаяОбработка = Ложь;
		Объект.АдресДоставки = ВыбранноеЗначение.Представление;
		Объект.АдресДоставкиЗначение = ВыбранноеЗначение.Адрес;
		Объект.АдресДоставкиЗначенияПолей = КонтактнаяИнформацияВXML(ВыбранноеЗначение.Адрес);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("АдресДоставкиЗначенияПолей")Тогда
		
		Объект.АдресДоставкиЗначение = ВыбранноеЗначение.АдресДоставкиЗначенияПолей;
		
	КонецЕсли;
	//-- #Б4274 смарт: Шляпников 04.09.2025
	
	//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
	РассчитатьПараметрыДоставки();
	//-- #Б4316 смарт: Шляпников 14.10.2025
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерНачалоВыбораПеред(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Партнер");	
	//--#1261 смарт: Лопато 01.12.2022
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерОчисткаПеред(Элемент, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Партнер");	
	//--#1261 смарт: Лопато 01.12.2022
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Партнер");	
	//--#1261 смарт: Лопато 01.12.2022
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерБезКЛНачалоВыбораПеред(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Партнер");	
	//--#1261 смарт: Лопато 01.12.2022
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерБезКЛОчисткаПеред(Элемент, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Партнер");	
	//--#1261 смарт: Лопато 01.12.2022
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПартнерБезКЛОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 01.12.2022 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Партнер");	
	//--#1261 смарт: Лопато 01.12.2022
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ОрганизацияНачалоВыбораПеред(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 22.03.2023 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Организация");	
	//--#1261 смарт: Лопато 22.03.2023
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ОрганизацияОчисткаПеред(Элемент, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 22.03.2023 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Организация");	
	//--#1261 смарт: Лопато 22.03.2023

КонецПроцедуры

&НаКлиенте
Процедура смарт_ОрганизацияОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	//++#1261 смарт: Лопато 22.03.2023 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = НЕ смартЗаказВыгруженНаСайт("Объект.Организация");	
	//--#1261 смарт: Лопато 22.03.2023

КонецПроцедуры

&НаСервере
&После("НеОтгружатьЧастямиПриИзмененииСервер")
Процедура смарт_НеОтгружатьЧастямиПриИзмененииСервер()
	
	//++ смарт:Демичев №1277 27.02.2023 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ЖелаемаяДатаОтгрузки = ДокументОбъект.смартУстановитьЗначениеЖелаемойДатеОтгрузки(ДокументОбъект);
	//-- смарт:Демичев №1277 27.02.2023
	
	//++#1547 смарт: Лопато 25.01.2024 //Автоматическое заполнение серий чернил в заказах
	ЗаполнитьСтатусыУказанияСерий();
	//--#1547 смарт: Лопато 25.01.202
	
КонецПроцедуры

&НаСервере
&После("ЗаполнитьДатуОтгрузкиСервер")
Процедура смарт_ЗаполнитьДатуОтгрузкиСервер(ДатаОтгрузки, МассивВыделенныхСтрок)
	
	//++ смарт:Демичев №1277 27.02.2023
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ЖелаемаяДатаОтгрузки = ДокументОбъект.смартУстановитьЗначениеЖелаемойДатеОтгрузки(ДокументОбъект);
	//-- смарт:Демичев №1277 27.02.2023  
	
КонецПроцедуры

&НаКлиенте
&После("ТоварыКоличествоУпаковокПриИзменении")
Процедура смарт_ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	//++#1547 смарт: Лопато 27.05.2024 //Автоматическое заполнение серий чернил в заказах
	смартЗаполнитьСтрокиОбеспечениеОтгрузитьСериямиПоFEFOКлиент(Элемент.Родитель.ТекущаяСтрока);
	//--#1547 смарт: Лопато 27.05.2024
	
КонецПроцедуры

&НаСервере
&После("ПриИзмененииДатыОтгрузкиВТабЧасти")
Процедура смарт_ПриИзмененииДатыОтгрузкиВТабЧасти()
	
	//++ смарт:Демичев №1277 27.02.2023
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ЖелаемаяДатаОтгрузки = ДокументОбъект.смартУстановитьЗначениеЖелаемойДатеОтгрузки(ДокументОбъект);
	//-- смарт:Демичев №1277 27.02.2023 
		
КонецПроцедуры

&НаКлиенте
Процедура смарт_ТоварыСуммаПриИзмененииПосле(Элемент)

	//++#1356 смарт: Лопато 18.05.2023 //Исправление автоматического расчета скидок в заказах клиентов  
 	ПересчитатьЦенуСоСкидкой(Элементы.Товары.ТекущиеДанные);
	ПересчитатьСтрокуТЧ_ТоварыВ_ВалютуУУ(Элемент.Родитель.ТекущаяСтрока);
	
    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(ТекущаяСтрока, Истина, Ложь);
	//--#1356 смарт: Лопато 18.05.2023

КонецПроцедуры

&НаКлиенте
&Перед("ТоварыВыбор")
Процедура смарт_ТоварыВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//++#1547 смарт: Лопато 23.11.2023 //Автоматическое заполнение серий чернил в заказах
	смартОбщегоНазначенияКлиент.смартПроверитьУстановитьДоступностьТоварыСерия(Элемент, Элементы.ТоварыСерия, Элементы.Товары.ТекущиеДанные);
	//--#1547 смарт: Лопато 23.11.2023
	
	//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
	Если Поле.Имя = "ТоварыНоменклатура" И (Элементы.ТоварыНоменклатура.ТолькоПросмотр ИЛИ ТолькоПросмотр) Тогда
		ПоказатьЗначение(Неопределено, Элементы.Товары.ТекущиеДанные.Номенклатура);
	КонецЕсли;
	//-- #Б4398 смарт: Шляпников 02.10.2025
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//++#1261 смарт: Лопато 15.01.2024 //Доработка изменения Заказа клиента для ИМ  
	СтандартнаяОбработка = смартПроверитьКонтрагентаЗаказВыгруженНаСайт(ВыбранноеЗначение);
	//--#1261 смарт: Лопато 15.01.2024
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыДатаОтгрузкиПриИзменении")
Процедура смарт_ТоварыДатаОтгрузкиПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	#Вставка
	//++#1547 смарт: Лопато 25.01.2024 //Автоматическое заполнение серий чернил в заказах
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	//--#1547 смарт: Лопато 25.01.2024
	#КонецВставки
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата, ПоДатеОтгрузки", Объект.НалогообложениеНДС, Объект.Дата, Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	#Вставка
	//++ смарт:Демичев №1277 27.02.2023
	смартТоварыДатаОтгрузкиПриИзмененииПослеНаСервере();
	//-- смарт:Демичев №1277 27.02.2023 
	
	//++#1547 смарт: Лопато 02.04.2024 //Автоматическое заполнение серий чернил в заказах
	смартЗаполнитьСтрокиОбеспечениеОтгрузитьСериямиПоFEFOКлиент(Элементы.Товары.ТекущаяСтрока);
	//--#1547 смарт: Лопато 02.04.2024
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДатаПриИзменении")
Процедура смарт_ДатаПриИзменении(Элемент)

	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	Оповещение = Новый ОписаниеОповещения("ДатаПриИзмененииЗавершение", ЭтотОбъект);
	ЦенообразованиеКлиент.ЗадатьВопросПересчетаЦеныПриИзмененииДаты(Объект, Оповещение);
	
	#Вставка
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б5008 смарт: Шляпников 20.11.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПроцентРучнойСкидкиПриИзменении")
Процедура смарт_ТоварыПроцентРучнойСкидкиПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	#Вставка
	//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
	смартПроверитьОтменитьСкидкуНаТоварКлиент(Объект, ТекущаяСтрока);
	//--#1868 смарт: Лопато 19.06.2024

	//++ смарт:Подкин #914 01.03.2022 15:51:40 ограничения применения скидки больше максимальной, указанной в соглашении
	Если НЕ смартДоступностьРоли("смартРазрешитьСкидкуБольшеМаксимальной,ПолныеПрава") Тогда

		//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
		СтруктураПараметровДопустимаяСкидка = Новый Структура;
		СтруктураПараметровДопустимаяСкидка.Вставить("Номенклатура", 			  ТекущаяСтрока.Номенклатура);
		СтруктураПараметровДопустимаяСкидка.Вставить("Цена",  					  ТекущаяСтрока.Цена);
		СтруктураПараметровДопустимаяСкидка.Вставить("Количество", 				  ТекущаяСтрока.КоличествоУпаковок);
		СтруктураПараметровДопустимаяСкидка.Вставить("ПовышеннаяСкидкаРазрешена", Объект.смартРазрешитьПовышеннуюСкидку);
		СтруктураПараметровДопустимаяСкидка.Вставить("ПроцентПовышеннойСкидки",   Объект.смартПроцентРазрешеннойМаксимальнойСкидки);
		СтруктураПараметровДопустимаяСкидка.Вставить("Дата",					  Объект.Дата);
		СтруктураПараметровДопустимаяСкидка.Вставить("Партнер", 				  Объект.Партнер);

		СтруктураКонтроля = смартОбщегоНазначения.смартПолучитьДопустимуюСуммуСкидки(СтруктураПараметровДопустимаяСкидка); 
		//--#1868 смарт: Лопато 19.06.2024

		Если НЕ СтруктураКонтроля=Неопределено И СтруктураКонтроля.ПроцентРучнойСкидки<ТекущаяСтрока.ПроцентРучнойСкидки Тогда
			ТекстСообщения = НСтр("ru = 'Процент скидки превышает максимальное возможное значение:'") + " " + СтруктураКонтроля.ПроцентРучнойСкидки;
			СтруктураКонтроля.Вставить("ПолеВызова","Процент");
			ПоказатьВопрос(Новый ОписаниеОповещения("смартОКЗавершениеПревышение", ЭтотОбъект, СтруктураКонтроля), ТекстСообщения + ". ", РежимДиалогаВопрос.ОК); 

			Возврат;	

		КонецЕсли; 

	КонецЕсли;
	//-- смарт:Подкин #914 01.03.2022 15:51:40  
	
	//++ #Б6458 смарт: Шляпников 15.04.2026 / Проверить механизм назначения скидок
	ЗаполнитьДанныеОМаксимальнойСкидке(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.ПолучитьИдентификатор()));
	ПроверитьВозможностьНазначенияРучнойСкидки(ТекущаяСтрока.ПолучитьИдентификатор(), Истина);
	//-- #Б6458 смарт: Шляпников 15.04.2026
	#КонецВставки

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

#Область СобытияКоммандыФормы
//++ #1230 смарт: Фролов 22.11.2022 //Заказ клиента (ТЧ Товары) доработать вывод отчетов
&НаКлиенте
Процедура смартСформироватьОстаткиИДоступностьПоТовару()
	УсловияОтбора = Новый Структура("Номенклатура",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии,КлючВарианта", УсловияОтбора, Истина,"ПоНоменклатуреКонтекст");
	ОткрытьФорму("Отчет.ОстаткиИДоступностьТоваров.Форма", ПараметрыФормы);	
КонецПроцедуры //-- #1230 смарт: Фролов 22.11.2022

//++ #1230 смарт: Фролов 22.11.2022 //Заказ клиента (ТЧ Товары) доработать вывод отчетов
&НаКлиенте
Процедура смартСформироватьОстаткиПоСрокамГодности()
	УсловияОтбора = Новый Структура("Номенклатура",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии,КлючВарианта", УсловияОтбора, Истина,"ПоНоменклатуреКонтекст");
	ОткрытьФорму("Отчет.ТоварыНаСкладахПоСрокамГодности.Форма", ПараметрыФормы);	
КонецПроцедуры //-- #1230 смарт: Фролов 22.11.2022

//++ #1328 смарт: Фролов 22.03.2023 //Добавить спецификацию оборудования iECHO в Заявку на пусконаладку  
&НаКлиенте
Процедура ВыбратьДокументОснования()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не записан. Действие не может быть выполнено.");		
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыбратьДокументОснованияЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.смартIECHOСпецификация.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //-- #1328 смарт: Фролов 22.03.2023

//++ #1328 смарт: Фролов 22.03.2023 //Добавить спецификацию оборудования iECHO в Заявку на пусконаладку 
&НаКлиенте
Процедура ВыбратьДокументОснованияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.смартIECHOСпецификация") Тогда
		Объект.ДокументОснование = РезультатЗакрытия;
		ЭтаФорма.Модифицированность=Истина;
	КонецЕсли;
КонецПроцедуры //-- #1328 смарт: Фролов 22.03.2023

//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С  
&НаКлиенте
Процедура смартЗаполнитьЗаявкуНаДоговорКоманда() 
	//++ #4044 смарт: Тимофеева 22.08.2025 / Задание на подготовку проекта договора поставки. Создание лизингового договора (смарт). Доработка.
	//Если Объект.Ссылка.Пустая() Тогда 
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда 	
	//-- #4044 смарт: Тимофеева 22.08.2025 	 
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("смартОтветЗаписатьДокументДляДоговора", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Для продолжения операции наобходимо записать документ. Продолжить?", Режим,, КодВозвратаДиалога.Нет, "Заказ клиента не записан"); 
		
	Иначе 
		
		СтруктураПроверки=смартПроверитьВозможностьФормированияДоговора(); 
		смартПроверитьВозможностьФормированияДоговораДалее(СтруктураПроверки); //++ #1434 смарт: Фролов 25.08.2023 //код вынесен в отдельную процедуру  
		
	Конецесли;
КонецПроцедуры//-- #1334 смарт: Фролов 03.04.2023

//++ #1334 смарт: Фролов 12.04.2023 //Заявка на формирование и подписание договора из 1С
&НаКлиенте
Процедура смартОтветЗаписатьДокументДляДоговора(Результат,ДопПараметры)Экспорт
	Если Результат=КодВозвратаДиалога.Да Тогда 
		Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
		Если НЕ Объект.Ссылка.Пустая() Тогда
			СтруктураПроверки=смартПроверитьВозможностьФормированияДоговора();
			смартПроверитьВозможностьФормированияДоговораДалее(СтруктураПроверки); //++ #1434 смарт: Фролов 25.08.2023 //код вынесен в отдельную процедуру  
		Конецесли;
	КонецЕсли;	
КонецПроцедуры//-- #1334 смарт: Фролов 12.04.2023 

//++ #1434 смарт: Фролов 25.08.2023 //Исправить ошибку "Не заполнены цены в документе!"  
&НаКлиенте
Процедура  смартПроверитьВозможностьФормированияДоговораДалее(СтруктураПроверки) 
	
	Если СтруктураПроверки.ДоговорКонтрагента = Неопределено Тогда 
		
		Если СтруктураПроверки.ОборудованиеДляДоговора.Количество() И СтруктураПроверки.ПроверкаСуммы Тогда 
			
			ПараметрыДляДоговора = Новый Структура("ОборудованиеДляДоговора, Организация", СтруктураПроверки.ОборудованиеДляДоговора, Объект.Организация);  
			
			Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "смартЛизинговаяКомпания") Тогда 
				
				ОткрытьФорму("ОбщаяФорма.смартСозданиеДоговораЛизинга", ПараметрыДляДоговора, ЭтаФорма);  
				
			Иначе	                                                                                       
				
				ОткрытьФорму("ОбщаяФорма.смартЗаданиеНаПодготовкуПроектаДоговораПоставки", ПараметрыДляДоговора, ЭтаФорма);  
				
			КонецЕсли;  
			
		Иначе 
			
			Если СтруктураПроверки.ОборудованиеДляДоговора.Количество() = 0 ТОгда 
				
				Сообщить("Данная функция применяется только для договоров на оборудование!");
				
			Иначе  
				
				Сообщить("Не заполнены цены в документе!");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе   
		
		Сообщить("Для данного документа уже есть договор " + СтруктураПроверки.ДоговорКонтрагента + ""); 
		
		Объект.Договор = СтруктураПроверки.ДоговорКонтрагента;
		
	КонецЕсли;  
	
КонецПроцедуры  //-- #1434 смарт: Фролов 25.08.2023

//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С 
&НаСервере
Функция смартПроверитьВозможностьФормированияДоговора()
	
	ПроверкаСуммы = Истина;
	ОборудованиеДляДоговора = Новый Массив;
	//++ #Б-2074 смарт: Лопато 21.02.2025 //Создать сегмент "Обязательное заключение договора"  
	СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментПродажиПоДоговору"); 
	//-- #Б-2074 смарт: Лопато 21.02.2025
	ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментОборудование);
	МасОборудование = ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка");
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Если НЕ МасОборудование.Найти(СтрокаТовары.Номенклатура) = Неопределено Тогда 
			
			ОборудованиеДляДоговора.Добавить(СтрокаТовары.Номенклатура); 
			
		КонецЕсли;
		
		Если СтрокаТовары.Сумма = 0 Тогда 
			
			ОбщегоНазначения.СообщитьПользователю("В строке " + СтрокаТовары.НомерСтроки + " " + СтрокаТовары.Номенклатура +"  не заполнена сумма.",,,, Истина);
			
			ПроверкаСуммы = Ложь;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления 
	//++ #1744 смарт: Мосолов 04.04.2024 //Добавить проверку в Заказ клиента при изменении Контрагента  
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент 
	//-- #1744 смарт: Мосолов 04.04.2024 
	|	И ДоговорыКонтрагентов.смартЗаказКлиента = &ЗаказКлиента");  
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка); 
	
	//++ #1744 смарт: Мосолов 04.04.2024 //Добавить проверку в Заказ клиента при изменении Контрагента  
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент); 
	//-- #1744 смарт: Мосолов 04.04.2024 
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда  
		
		ДоговорКонтрагента = Выборка.Ссылка; 
		
	Иначе  
		
		ДоговорКонтрагента = Неопределено; 
		
	КонецЕсли;	
	
	Возврат Новый Структура("ОборудованиеДляДоговора, ПроверкаСуммы, ДоговорКонтрагента", ОборудованиеДляДоговора, ПроверкаСуммы, ДоговорКонтрагента);  
	
КонецФункции //-- #1334 смарт: Фролов 03.04.2023	

//++ #1334 смарт: Фролов 12.04.2023 //Заявка на формирование и подписание договора из 1С 
&НаКлиенте
Процедура смартДействиеПоказатьИнформацию(Команда)
	
	Если СтрНайти(Команда.Имя, "СформироватьЗаявкуНаПодготовкуДоговора") <> 0 Тогда
		ИнформацияЗаголовок = "Заполнение заявки на договор";
		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'Все заявки на договоры в юр. отдел, <b>с 13 апреля 2023г.</b> оформляются только из 1С.'")
			+ Символы.ПС 
			+ НСтр("ru = 'Так же теперь все сканы подписанных договоров прикрепляются к договору, а не к заказу клиента.'")
			+ Символы.ПС 
			+ НСтр("ru = 'Если у вас сделка с участием лизинговой компании, необходимо в карточке контрагента установить признак Лизинговая компания (смарт). В этом случае форма заявки будет другой.'")
			+ Символы.ПС 
			+ Символы.ПС
			+ НСтр("ru = 'При оформлении заявки будет автоматически создан договор и прикреплен к заказу клиента.'")
			+ Символы.ПС
			+ НСтр("ru = 'Пожалуйста не изменяйте договор в заказе, так как после заполнения заявки, юристы начинают работать над подготовкой договора.'") 
			+ Символы.ПС
			+ НСтр("ru = 'В договоре, созданном при помощи кнопки <b>""Заявка на договор""</b>, на вкладке <b>""Печать договоров""</b> можно посмотреть текст с параметрами заявки на договор.'") 
			);
	//++ смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 
	ИначеЕсли СтрНайти(Команда.Имя, "смартИнформация_смартВыборОсновногоЭДО") <> 0 Тогда
		ИнформацияЗаголовок = "Выбор предпочтительного оператора ЭДО контрагента";
		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = '  Выберите пожалуйста оператора ЭДО, которым предпочитает пользоваться клиент.'")
			+ Символы.ПС
			+НСтр("ru = '  Указание предпочитаемого оператора ЭДО поможет не тратить время на выяснение, каким оператором пользуется клиент'")
			+ Символы.ПС
			+НСтр("ru = '  Эта информация будет полезна как менеджерам, так и бухгалтерам, юристам и т.д.'")
			);
	//-- смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 
	Иначе
		ИнформацияЗаголовок = "";
		ИнформацияТекст = "";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры //-- #1334 смарт: Фролов 03.04.2023

//++ #1334 смарт: Фролов 12.04.2023 //Заявка на формирование и подписание договора из 1С
&НаСервере
Процедура ПроверитьВозможностьВыбораДоговора()
	Если ЗначениеЗаполнено(Объект.Договор.смартЗаказКлиента) И 	НЕ Объект.Договор.смартЗаказКлиента=Объект.Ссылка ТОгда
		Объект.Договор=Неопределено;
		Сообщить("Данный договор привязан к другому Заказу клиента!"); 
	КонецЕсли;	
	Если Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт") Тогда
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Ложь;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=ложь;
	Иначе
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость= Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.Договор);
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость= Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.Договор);
	КонецЕсли;	
КонецПроцедуры //-- #1334 смарт: Фролов 03.04.2023

//++ #1334 смарт: Фролов 19.04.2023 //Заявка на формирование и подписание договора из 1С
&НаСервере
Процедура смартЗаполнитьЭтапыОплаты(ТекДоговор)
	Объект.ЭтапыГрафикаОплаты.Очистить();
	Если ТекДоговор.смартПредоплата100Процентов Тогда
		Если ЗначениеЗаполнено(ТекДоговор.смартДатаПредоплата100) Тогда
			СтрГрафика=Объект.ЭтапыГрафикаОплаты.Добавить();
			СтрГрафика.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
			СтрГрафика.ПроцентПлатежа=100;
			СтрГрафика.СуммаПлатежа=Объект.СуммаДокумента;
			СтрГрафика.ДатаПлатежа=ТекДоговор.смартДатаПредоплата100;
		КонецЕсли;
	ИначеЕсли ТекДоговор.смартЧастичнаяОплатаВариант1 Тогда
		Если ТекДоговор.смартПроцентОкончательныйПлатежВариант1+ТекДоговор.смартПроцентПредоплатыВариант1=100 Тогда
			Если ТекДоговор.смартПроцентОкончательныйПлатежВариант1>0 Тогда 
				Если ТекДоговор.смартПроцентПредоплатыВариант1>0 И ТекДоговор.смартПроцентОкончательныйПлатежВариант1>0 
					И ЗначениеЗаполнено(ТекДоговор.смартДнейНаДоплатуВариант1) И ЗначениеЗаполнено(ТекДоговор.смартДатаПредоплатаВариант1) Тогда
					СтрГрафика=Объект.ЭтапыГрафикаОплаты.Добавить();
					СтрГрафика.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
					СтрГрафика.ПроцентПлатежа=ТекДоговор.смартПроцентПредоплатыВариант1;
					СтрГрафика.СуммаПлатежа=Окр(Объект.СуммаДокумента*ТекДоговор.смартПроцентПредоплатыВариант1/100,2);
					СуммаОстаток=Объект.СуммаДокумента-СтрГрафика.СуммаПлатежа;
					СтрГрафика.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант1;
					СтрГрафика2=Объект.ЭтапыГрафикаОплаты.Добавить();
					СтрГрафика2.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
					СтрГрафика2.ПроцентПлатежа=ТекДоговор.смартПроцентОкончательныйПлатежВариант1;
					СтрГрафика2.СуммаПлатежа=СуммаОстаток;
					СтрГрафика2.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант1; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			
	ИначеЕсли ТекДоговор.смартЧастичнаяОплатаВариант2 Тогда
		Если ТекДоговор.смартПроцентПредоплатыВариант2+ТекДоговор.смартПроцентДоплатыВариант2+ТекДоговор.смартПроцентОкончательныйПлатежВариант2 = 100 Тогда
			Если ТекДоговор.смартПроцентПредоплатыВариант2>0 И ТекДоговор.смартПроцентДоплатыВариант2>0 И ТекДоговор.смартПроцентОкончательныйПлатежВариант2>0 
				И ЗначениеЗаполнено(ТекДоговор.смартДнейНаДоплатуВариант2) И ЗначениеЗаполнено(ТекДоговор.смартДатаПредоплатаВариант2) Тогда
				СтрГрафика=Объект.ЭтапыГрафикаОплаты.Добавить();
				СтрГрафика.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
				СтрГрафика.ПроцентПлатежа=ТекДоговор.смартПроцентПредоплатыВариант2;
				СтрГрафика.СуммаПлатежа=Окр(Объект.СуммаДокумента*ТекДоговор.смартПроцентПредоплатыВариант2/100,2);
				СтрГрафика.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант2;
				СтрГрафика2=Объект.ЭтапыГрафикаОплаты.Добавить();
				СтрГрафика2.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
				СтрГрафика2.ПроцентПлатежа=ТекДоговор.смартПроцентДоплатыВариант2;
				СтрГрафика2.СуммаПлатежа=Окр(Объект.СуммаДокумента*ТекДоговор.смартПроцентДоплатыВариант2/100,2);
				СтрГрафика2.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант2;  
				СтрГрафика3=Объект.ЭтапыГрафикаОплаты.Добавить();
				СтрГрафика3.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.КредитСдвиг");
				СтрГрафика3.ПроцентПлатежа=ТекДоговор.смартПроцентОкончательныйПлатежВариант2;
				СтрГрафика3.СуммаПлатежа=Объект.СуммаДокумента-СтрГрафика.СуммаПлатежа-СтрГрафика2.СуммаПлатежа;
				СтрГрафика3.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант2+86400*ТекДоговор.смартСрокПоставки; 
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ТекДоговор.смартЧастичнаяОплатаВариант3 Тогда
		Если ТекДоговор.смартПроцентОкончательныйПлатежВариант3+ТекДоговор.смартПроцентПредоплатыВариант3=100 Тогда
			Если ТекДоговор.смартПроцентОкончательныйПлатежВариант3>0 Тогда 
				Если ТекДоговор.смартПроцентПредоплатыВариант3>0 И ТекДоговор.смартПроцентОкончательныйПлатежВариант3>0 
					И ЗначениеЗаполнено(ТекДоговор.смартДнейНаДоплатуВариант3) И ЗначениеЗаполнено(ТекДоговор.смартДатаПредоплатаВариант3) Тогда
					СтрГрафика=Объект.ЭтапыГрафикаОплаты.Добавить();
					СтрГрафика.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
					СтрГрафика.ПроцентПлатежа=ТекДоговор.смартПроцентПредоплатыВариант3;
					СтрГрафика.СуммаПлатежа=Окр(Объект.СуммаДокумента*ТекДоговор.смартПроцентПредоплатыВариант3/100,2);
					СуммаОстаток=Объект.СуммаДокумента-СтрГрафика.СуммаПлатежа;
					СтрГрафика.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант3;
					СтрГрафика2=Объект.ЭтапыГрафикаОплаты.Добавить();
					СтрГрафика2.ВариантОплаты=ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки");
					СтрГрафика2.ПроцентПлатежа=ТекДоговор.смартПроцентОкончательныйПлатежВариант3;
					СтрГрафика2.СуммаПлатежа=СуммаОстаток;
					СтрГрафика2.ДатаПлатежа=ТекДоговор.смартДатаПредоплатаВариант3; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина, Объект.СуммаДокумента);	
КонецПроцедуры //-- #1334 смарт: Фролов 19.04.2023	

//++#1323 смарт: Лопато 29.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаКлиенте
Процедура смартСохранитьРучныеСкидкиКлиента(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен клиент!'"));
		Возврат;	
	КонецЕсли;
	
	Если НЕ смартОбщегоНазначения.смартПравоРедактированияИндивидуальныхСкидокПартнера(Объект.Партнер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Недостаточно прав для редактирования индивидуальных скидок клиента!'"));
		Возврат;	
	КонецЕсли;
	
	Если Команда.Имя = "смартКомандаСохранитьРучныеСкидкиКлиентаИзВыделенныхСтрок" Тогда
		СписокСкидокДляСохранения = смартПолучитьСписокРучныхСкидокКлиентаДляСохранения(Элементы.Товары.ВыделенныеСтроки);
	Иначе
		СписокСкидокДляСохранения = смартПолучитьСписокРучныхСкидокКлиентаДляСохранения();
	КонецЕсли;
	
	Если СписокСкидокДляСохранения.Количество() > 0 Тогда
	
		ПараметрыСохраненияСкидок = Новый Структура;
		ПараметрыСохраненияСкидок.Вставить("Клиент", 					Объект.Партнер);
		ПараметрыСохраненияСкидок.Вставить("СписокСкидокДляСохранения", СписокСкидокДляСохранения);
		
		ОткрытьФорму("Документ.смартУстановкаИндивидуальныхСкидокКлиентов.ФормаОбъекта", ПараметрыСохраненияСкидок, ЭтаФорма);

	КонецЕсли;	
		
КонецПроцедуры //--#1323 смарт: Лопато 29.09.2023

//++#1323 смарт: Лопато 25.09.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаСервере
Функция смартПолучитьСписокРучныхСкидокКлиентаДляСохранения(Знач ВыделенныеСтроки = Неопределено)
	
	СкидкиДляСохранения = Новый Массив;
	
	ДатаСкидки = ТекущаяДата();
	
	МассивНоменклатура = Объект.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	
	ТаблицаИндивидуальныеСкидкиКлиентов = смартОбщегоНазначения.смартПолучитьИндивидуальныеСкидкиКлиентов(ДатаСкидки, Объект.Партнер, МассивНоменклатура);
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл

		Если СтрокаТЧ.ПроцентРучнойСкидки <> 0 
			И (ВыделенныеСтроки = Неопределено ИЛИ (ВыделенныеСтроки <> Неопределено И ВыделенныеСтроки.Найти(СтрокаТЧ.НомерСтроки-1) <> Неопределено)) Тогда
			
			ТекущаяСкидка = 0;
			
			Если ТаблицаИндивидуальныеСкидкиКлиентов.Количество() > 0 Тогда
				
				ОтборИндивидуальныеСкидкиКлиентов = Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура);
				СтрокиИндивидуальныеСкидкиКлиентов = ТаблицаИндивидуальныеСкидкиКлиентов.НайтиСтроки(ОтборИндивидуальныеСкидкиКлиентов);
				
				Если СтрокиИндивидуальныеСкидкиКлиентов.Количество() > 0 Тогда 
					ТекущаяСкидка = СтрокиИндивидуальныеСкидкиКлиентов[0].ПроцентСкидки;
				КонецЕсли;
				
			КонецЕсли;	
				
			Если СтрокаТЧ.ПроцентРучнойСкидки <> ТекущаяСкидка Тогда
				СкидкиДляСохранения.Добавить(Новый Структура("Номенклатура, ПроцентСкидки, НачалоДействия", 
															 СтрокаТЧ.Номенклатура, СтрокаТЧ.ПроцентРучнойСкидки, ДатаСкидки));
			ИначеЕсли ТекущаяСкидка <> 0 Тогда	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По строке " + СокрЛП(СтрокаТЧ.НомерСтроки) + " для номенклатуры " + СокрЛП(СтрокаТЧ.Номенклатура) 
																  + " скидка " + СокрЛП(СтрокаТЧ.ПроцентРучнойСкидки) + "% уже действует с " + Формат(СтрокиИндивидуальныеСкидкиКлиентов[0].НачалоДействия, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат СкидкиДляСохранения;
	
КонецФункции //--#1323 смарт: Лопато 25.09.2023 

//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерий()

	ЗаполнитьСтатусыУказанияСерий();

КонецПроцедуры //--#1517 смарт: Лопато 20.12.2023	

//++#1547 смарт: Лопато 02.04.2024 //Автоматическое заполнение серий чернил в заказах
&НаКлиенте
&После("ДатаОтгрузкиПриИзменении")
Процедура смарт_ДатаОтгрузкиПриИзмененииПосле(Элемент)

	ЗаполнитьСтатусыУказанияСерий();

	смартЗаполнитьСтрокиОбеспечениеОтгрузитьСериямиПоFEFOКлиент();
	
КонецПроцедуры //--#1547 смарт: Лопато 02.04.2024

//++#1547 смарт: Лопато 02.04.2024 //Автоматическое заполнение серий чернил в заказах
&НаКлиенте
Процедура смартЗаполнитьСтрокиОбеспечениеОтгрузитьСериямиПоFEFOКлиент(ТекущаяСтрока = Неопределено)

	ВыделенныеСтрокиДляЗаполнения = Новый Массив;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если смартСтрокаТовараПодходитДляПерезаполненияСерийПоFEFO(Элементы.Товары.ТекущиеДанные) Тогда
			
			ВыделенныеСтрокиДляЗаполнения.Добавить(ТекущаяСтрока);
			
		КонецЕсли;	
		
	Иначе
		
		Для Каждого СтрокаТовары Из Объект.Товары Цикл
			
			Если смартСтрокаТовараПодходитДляПерезаполненияСерийПоFEFO(СтрокаТовары) Тогда
				
				ВыделенныеСтрокиДляЗаполнения.Добавить(Объект.Товары.Индекс(СтрокаТовары));
				
			КонецЕсли;
			
		КонецЦикла;	

	КонецЕсли;		
		
	Если ВыделенныеСтрокиДляЗаполнения.Количество() Тогда
		
		Детали = смартЗаполнитьСтрокиОбеспечениеОтгрузитьСериямиПоFEFOСервер(ВыделенныеСтрокиДляЗаполнения);

		Если Детали.Ошибки <> Неопределено Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Детали.Ошибки);
		Иначе
			ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Детали.Оповещение);
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры //--#1547 смарт: Лопато 02.04.2024

//++#1547 смарт: Лопато 27.05.2024 //Автоматическое заполнение серий чернил в заказах
&НаКлиенте
Функция смартСтрокаТовараПодходитДляПерезаполненияСерийПоFEFO(СтрокаТовара)

	Возврат СтрокаТовара.СтатусУказанияСерий <> 0
			И смартДействуетОсобыйУчетСерий(СтрокаТовара.Номенклатура)
			И (СтрокаТовара.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить") 
			   ИЛИ СтрокаТовара.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно"));

КонецФункции //--#1547 смарт: Лопато 27.05.2024

//++#1547 смарт: Лопато 02.04.2024 //Автоматическое заполнение серий чернил в заказах
&НаСервереБезКонтекста
Функция смартДействуетОсобыйУчетСерий(НоменклатураСсылка)

	Возврат смартОбщегоНазначения.смартДействуетОсобыйУчетСерий(НоменклатураСсылка);
	
КонецФункции //--#1547 смарт: Лопато 02.04.2024
	
//++#1547 смарт: Лопато 02.04.2024 //Автоматическое заполнение серий чернил в заказах
&НаСервере
Функция смартЗаполнитьСтрокиОбеспечениеОтгрузитьСериямиПоFEFOСервер(ВыделенныеСтрокиДляЗаполнения)
	
	ПереченьВариантов = Новый Массив();
	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));
	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно"));
	
	ВыбранноеЗначение = Новый Структура("ПереченьВариантов, ЗаполнятьЦелымиУпаковками");
	ВыбранноеЗначение.ПереченьВариантов = ПереченьВариантов;
	ВыбранноеЗначение.ЗаполнятьЦелымиУпаковками = Ложь;
	
	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	ПутиКДанным = Новый Соответствие; //Описание особенностей формы
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки"); // дату отгрузки работ необходимо брать из поля "Дата отгрузки".
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("СтатусКВыполнению", Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	ПараметрыДокумента.Вставить("ГруппаСкладов", Объект.Склад);
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыКлиентов);
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);

	Таблица = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(
		ВыделенныеСтрокиДляЗаполнения,
		Объект,
		Объект.Товары,
		ПараметрыЗаполнения,
		ПараметрыДокумента);
	

	Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда

		Возврат Новый Структура(
			"Ошибки",
			ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(
				Таблица, "Товары", НСтр("ru = 'Товары'")));
				
	КонецЕсли;
	
	// Перенос результатов в документ.
	ТекстОповещения = Документы.ЗаказКлиента.ЗаполнитьВариантОбеспечения(
		Объект, ЭтаФорма, "СтрокиТовары", Таблица, ПараметрыУказанияСерий, ЗависимыеРеквизиты());
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	Возврат Новый Структура("Ошибки, Оповещение", Неопределено, ТекстОповещения);
	
КонецФункции //--#1547 смарт: Лопато 02.04.2024

&НаКлиенте
//++ #Б-3276 смарт: Фролов 12.05.2025 //Создание Интереса после создания Заказа клиента.
Процедура смартСоздатьИнтерес()
	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен Партнер!", , "Партнер");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать документ!");
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Партнер", Объект.Партнер);
	ПараметрыОткрытия.Вставить("ЗаказКлиента", Объект.Ссылка);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("смартСозданиеИнтересаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.смарт_ФормаСозданияИнтереса", ПараметрыОткрытия, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытии, РежимоткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- #Б-3276 смарт: Фролов 12.05.2025

&НаКлиенте
//++ #Б-3276 смарт: Фролов 12.05.2025 //Создание Интереса после создания Заказа клиента.
Процедура смартСозданиеИнтересаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
	
		смартПоказатьПривязанныйИнтерес(РезультатЗакрытия.Интерес);	
	
	КонецЕсли;
	
КонецПроцедуры //-- #Б-3276 смарт: Фролов 12.05.2025

&НаСервере
//++ #Б-3276 смарт: Фролов 12.05.2025 //Создание Интереса после создания Заказа клиента.
Процедура смартПоказатьПривязанныйИнтерес(Интерес)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_Интерес.Дата КАК Дата,
	|	CRM_Интерес.Номер КАК Номер,
	|	CRM_Интерес.Тема КАК Тема,
	|	CRM_Интерес.Партнер КАК Партнер,
	|	CRM_Интерес.Ответственный КАК Ответственный,
	|	CRM_Интерес.Подразделение КАК Подразделение,
	|	CRM_Интерес.Организация КАК Организация,
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ИСТИНА КАК ВведенНаОсновании,
	|	ЛОЖЬ КАК ОсновнойИнтерес
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Ссылка = &Интерес");
	Запрос.УстановитьПараметр("Интерес", Интерес);
	
	ЭтаФорма.CRM_ТаблицаИнтересов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЭтаФорма.CRM_ИнтересСтрокой = CRM_МетодыФормДокументовСервер.СформироватьПредставлениеИнтересаСтрокой(Интерес);
	
КонецПроцедуры //-- #Б-3276 смарт: Фролов 12.05.2025

&НаКлиенте
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартСогласоватьСНПЧ()

	Объект.смартСогласованиеПродажиСНПЧ = ПредопределенноеЗначение("Перечисление.РезультатыСогласования.Согласовано");
	Элементы.смартДекорацияСогласованиеСНПЧ.Заголовок = "Согласовано СНПЧ";
	Элементы.смартДекорацияСогласованиеСНПЧ.ЦветТекста = Новый Цвет(0, 150, 70);
	Элементы.смартДекорацияСогласованиеСНПЧ.Видимость = Истина;
	Элементы.смартСогласоватьСНПЧ.Видимость = Ложь;
	Элементы.смартНеСогласоватьСНПЧ.Видимость = Ложь;
	ЭтаФорма.Модифицированность = Истина;
	смартСогласоватьИлиНетНаСервере("Согласовано СНПЧ");
	
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025

&НаКлиенте
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартНЕСогласоватьСНПЧ()
	
	Объект.смартСогласованиеПродажиСНПЧ = ПредопределенноеЗначение("Перечисление.РезультатыСогласования.НеСогласовано");
	Элементы.смартДекорацияСогласованиеСНПЧ.Заголовок = "Не согласовано СНПЧ";
	Элементы.смартДекорацияСогласованиеСНПЧ.ЦветТекста = Новый Цвет(255, 0, 0);
	Элементы.смартДекорацияСогласованиеСНПЧ.Видимость = Истина;
	Элементы.смартСогласоватьСНПЧ.Видимость = Ложь;
	Элементы.смартНеСогласоватьСНПЧ.Видимость = Ложь;
	ЭтаФорма.Модифицированность = Истина;
	смартСогласоватьИлиНетНаСервере("Не согласовано СНПЧ");
	
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025

&НаКлиенте
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартОтправитьНаСогласованиеСНПЧ()

	Объект.смартСогласованиеПродажиСНПЧ = ПредопределенноеЗначение("Перечисление.РезультатыСогласования.НаСогласовании");
	Элементы.смартДекорацияСогласованиеСНПЧ.Заголовок = "На согласовании СНПЧ";
	Элементы.смартДекорацияСогласованиеСНПЧ.ЦветТекста = Новый Цвет(28, 85, 174);
	Элементы.смартДекорацияСогласованиеСНПЧ.Видимость = Истина;
	Элементы.смартОтправитьНаСогласованиеСНПЧ.Видимость = Ложь;
	ЭтаФорма.Модифицированность = Истина;
	смартОтправитьНаСогласованиеСНПЧНаСервере();
	
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025

&НаСервере
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартСогласоватьИлиНетНаСервере(Описание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	смартСоздатьнапоминаниеПоСНПЧ(Описание);
	
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025		

&НаСервере
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартСоздатьнапоминаниеПоСНПЧ(Описание)
	
	НапоминанияПользователяСлужебный.смарт_ПодключитьПроизвольноеНапоминаниеПользователю(Описание, 
			ТекущаяДатаСеанса(), 300, Объект.Ссылка, Описание, Объект.Менеджер);
			
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025	

&НаСервере
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартОтправитьНаСогласованиеСНПЧНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	СписокИсполнителей = CRM_БизнесПроцессыСервер.ПолучитьВозможныхИсполнителейПоРоли(
							Справочники.РолиИсполнителей.смартСогласователиПродажСНПЧ);
							
	Для Каждого Пользователь Из СписокИсполнителей Цикл						
		
		смартПоставитьЗадачуСогласованияСНПЧ(Пользователь.Значение);
		
	КонецЦикла;
	
	
	МассивАдресовДляОтправки = Новый Массив;
	АдресаДляОтправкиСтрокой = "";
	
	Для Каждого Пользователь Из СписокИсполнителей Цикл
		
		МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", Пользователь.Значение.смартРабочаяПочта, 
			Пользователь.Значение.смартРабочаяПочта));
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") 
			+ Пользователь.Значение.смартРабочаяПочта;
		
	КонецЦикла;
		
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
				
		ОбъектЗаказ = Объект.Ссылка.ПолучитьОбъект();
		НавСсылка = ПолучитьНавигационнуюСсылку(ОбъектЗаказ);
				
		ТемаПисьма = "Согласование продажи СНПЧ по заказу №" + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		
		ТекстПисьма = "В заказе: " + Объект.Номер + Символы.ПС +
		"Ссылка на заказ: " + НавСсылка + Символы.ПС +
		"Присутствует СНПЧ продаваемая отдельно от плоттера MIMAKI. требуется ваше согласование!";
		 		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, 
			, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		
		Попытка
			
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо о согласовании СНПЧ по заказу " + Объект.Номер + " НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + 
					" (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено письмо о согласовании СНПЧ по заказу " + Объект.Номер + " на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации("ОтправкаСогласованияПоСНПЧ", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		Исключение 
			
			ТекстСообщения = "Не удалось отправить письмо о согласовании СНПЧ по заказу " + Объект.Номе + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОтправкаСогласованияПоСНПЧ", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025	

&НаСервере
//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
Процедура смартПоставитьЗадачуСогласованияСНПЧ(Исполнитель)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
	ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	ЗадачаОбъект.Исполнитель = Исполнитель;
	ЗадачаОбъект.Предмет = Объект.Ссылка;
	ЗадачаОбъект.ПредметСтрокой = Строка(Объект.Ссылка);
	ЗадачаОбъект.CRM_Личная = Истина;
	ЗадачаОбъект.CRM_Партнер = Объект.Партнер.Ссылка;
	ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
	ЗадачаОбъект.ДатаНачала = ТекущаяДата() + 300;
	ЗадачаОбъект.ПринятаКИсполнению = Истина;
	ЗадачаОбъект.СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
	ЗадачаОбъект.СрокИсполнения = ТекущаяДата() + 600;
	ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.СогласоватьСНПЧ;
	
	
	Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Необходимо согласовать наличие СНПЧ в Заказе клиента:
		|%1'"), Строка(Объект.Номер));
	
	ЗадачаОбъект.Описание = Описание;
	ЗадачаОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Согласовать наличие СНПЧ в Заказе клиента %1'"), 
		Строка(Объект.Номер));
	ЗадачаОбъект.Записать();
		
КонецПроцедуры //-- #Б-3430 смарт: Фролов 01.06.2025	

#КонецОбласти

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 14.05.2021 17:16:42 задача 524
&НаКлиенте
&Перед("ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение")
Процедура смарт_ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение(Результат, ДополнительныеПараметры)
	Объект.СкидкиРассчитаны=Истина;
КонецПроцедуры

Процедура смартУстановитьДоступностьЭтаповОплаты()
	
	Элементы.НадписьЭтапыОплаты.Доступность = Пользователи.ЭтоПолноправныйПользователь(Неопределено) 
		//ИЛИ НЕ смартЕстьТоварыВТЧТовары()
		ИЛИ Пользователи.РолиДоступны("смартРазрешитьРедактироватьЭтапыОплатыВЗаказе", Неопределено);
		
КонецПроцедуры

#Область СобытияФормы

// Каратеев +
&НаКлиенте
Процедура смарт_СогласованоБухПриИзмененииПосле(Элемент)
	Если Не Объект.СогласованоБух И
	  Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт") Тогда
		Режим = РежимДиалогаВопрос.ОКОтмена;
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросСнятьСогласованиеФин",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"При отмене согласования, будет так же изменен признак ЗАКРЫТ у документа. Продолжить?", Режим,,КодВозвратаДиалога.Отмена,"Есть ошибки в цепочке");
	Иначе
		СогласованоБухПриИзмененииСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросСнятьСогласованиеФин(Результат,ДопПараметры)Экспорт
	Если Результат=КодВозвратаДиалога.ОК Тогда 
		Объект.СогласованоБух=Ложь;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению");
	КонецЕсли;	
КонецПроцедуры	
// Каратеев -

//Заполнение телефона контактного лица
&НаКлиенте
Процедура смартТелефонКонтактногоЛицаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура смартТелефонКонтактногоЛицаОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьТелефоныКонтактногоЛица();
КонецПроцедуры

&НаКлиенте
&После("АдресДоставкиОчистка")
Процедура смарт_АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	ЗаполнитьАдресаДоставки();
	Элемент.ВыделенныйТекст="";
КонецПроцедуры

&НаКлиенте
Процедура смартПроводитьДокументПриВысокомСПАРКРискеПриИзменении(Элемент)
	Объект.смартОтветственныйЗаСПАРКРиски=?(Объект.смартПроводитьДокументПриВысокомСПАРКРиске,ПользователиКлиентСервер.ТекущийПользователь(),Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПодписаныПриИзменении(Элемент)
	Если (Не Объект.СогласованоБух ИЛИ Не Объект.смартДокументыПодписаны) И
	  Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт") Тогда
		Режим = РежимДиалогаВопрос.ОКОтмена;
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросСнятьДокументПодписан",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"При отмене согласования, будет так же изменен признак ЗАКРЫТ у документа. Продолжить?", Режим,,КодВозвратаДиалога.Отмена,"Есть ошибки в цепочке");
	Иначе
		СогласованоБухПриИзмененииСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросСнятьДокументПодписан(Результат,ДопПараметры)Экспорт
	Если Результат=КодВозвратаДиалога.ОК Тогда 
		Объект.СогласованоБух=Ложь;
		Объект.смартДокументыПодписаны = Ложь;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПартнерПриИзменении")
Процедура смарт_ПартнерПриИзменении(Элемент)

	#Вставка
	//++#1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
	Для Каждого СтрТовары Из Объект.Товары Цикл
		
		//Обнуляем скидки при изменении партнера
		//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
		СтруктураДействий = смартСтруктураДействийПересчетаСуммПослеИзмененияСкидок(Объект, Истина, Истина);
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрТовары, СтруктураДействий, КэшированныеЗначения);
		//--#1868 смарт: Лопато 19.06.2024
		
	КонецЦикла;	

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	//--#1356 смарт: Лопато 14.06.2024
	#КонецВставки
	
	Если Не ЗначениеЗаполнено (Объект.Партнер) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
		УстановитьВидимостьЗапретаОтгрузкиПартнеру();
		Возврат;
	КонецЕсли;

	ПартнерПриИзмененииСервер();
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	// Отображать не по ссылке, а по ИНН, НЕ сохраняя в кэше.
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено; // Сбросить полученные значения.
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.СервисEDI
	ДокументыEDIИнтеграцияКлиент.ПриИзмененииКлючевыхРеквизитовДокумента(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.СервисEDI
	
	// ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов
	СопоставлениеНоменклатурыКонтрагентовКлиент.ПриИзмененииКлючевыхРеквизитовДокумента(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов
	
	#Вставка
	//++#1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
	РассчитатьСкидкиНаценкиКлиент();
	//--#1356 смарт: Лопато 14.06.2024
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки
	
КонецПроцедуры

//++ #5014 смарт: Тимофеева 01.12.2025 / Документ Заказ клиента. Способ доставки. Блокировка изменения.
&НаКлиенте
Процедура смарт_СпособДоставкиПриИзмененииПосле(Элемент)
	Если ТребуетсяКонтрольСпособаДоставки()
        И Объект.Товары.НайтиСтроки(Новый Структура("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"))).Количество() > 0
		И ЕстьЗаданиеНаПеревозку(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Внимание! Изменен способ доставки.
								|Уведомьте отдел логистики!");
	КонецЕсли;
КонецПроцедуры 
//-- #5014 смарт: Тимофеева 01.12.2025 

#КонецОбласти


#Область ПрочиеПроцедурыФункции

#Область НаСервере

//++ смарт:Демичев №1277 27.02.2023
&НаСервере
Процедура смартТоварыДатаОтгрузкиПриИзмененииПослеНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ЖелаемаяДатаОтгрузки = ДокументОбъект.смартУстановитьЗначениеЖелаемойДатеОтгрузки(ДокументОбъект);

КонецПроцедуры //-- смарт:Демичев №1277 27.02.2023

//Каратеев +
&НаСервере
Функция ПользовательПолный()	
	Возврат Пользователи.ЭтоПолноправныйПользователь();
КонецФункции

&НаСервере
Процедура СогласованоБухПриИзмененииСервер()
	УстановитьЦветИСтатусСогласования();
КонецПроцедуры	

&НаСервере
Процедура УстановитьЦветИСтатусСогласования()

	Если Объект.СогласованоБух = Истина Тогда
		ЭтотОбъект.Элементы.НадписьСогласованоФинОтделом.Заголовок = "Согласовано Фин.Отделом";
		ЭтотОбъект.Элементы.НадписьСогласованоФинОтделом.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли Объект.СогласованоБух = Ложь Тогда		
		ЭтотОбъект.Элементы.НадписьСогласованоФинОтделом.Заголовок = "Не согласовано Фин.Отделом";
		ЭтотОбъект.Элементы.НадписьСогласованоФинОтделом.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Если Объект.смартДокументыПодписаны И Не Объект.Организация.Предопределенный Тогда
		ЭтотОбъект.Элементы.смартНадписьДокументПодписан.Заголовок = "Документы подписаны";
		ЭтотОбъект.Элементы.смартНадписьДокументПодписан.ЦветТекста =  WebЦвета.Зеленый;
	ИначеЕсли Объект.Организация.Предопределенный Тогда
		ЭтотОбъект.Элементы.смартНадписьДокументПодписан.Заголовок = "Документы не требуются";
		ЭтотОбъект.Элементы.смартНадписьДокументПодписан.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		ЭтотОбъект.Элементы.смартНадписьДокументПодписан.Заголовок = "Документы не подписаны";
		ЭтотОбъект.Элементы.смартНадписьДокументПодписан.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВызватьСоздатьНаОсновании(РеализацияСсылка)
	
	РеализацияОбъект = РеализацияСсылка.ПолучитьОбъект();
	РеализацияОбъект.Дата=ТекущаяДатаСеанса();  // Фролов+ Реализация всегла создается с текущей датой.
	РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПечати()

	ИмяФормыФормаСписка = Строка("Документ.РеализацияТоваровУслуг.Форма.ФормаСписка");	
	
	КомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
	КомандыПечати.Колонки.Добавить("СкрытаФункциональнымиОпциями", Новый ОписаниеТипов("Булево"));
	КомандыПечати.Колонки.Добавить("ИмяКомандыНаФорме", Новый ОписаниеТипов("Строка"));
	ДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, ИмяФормыФормаСписка); 
	
	ТаблицаЗначенийКомандыПечати = КомандыПечати;
	КомандаПечати = КомандуПечатиВСтруктуру(ТаблицаЗначенийКомандыПечати);
		
	Возврат КомандаПечати;
	
КонецФункции

&НаСервере
Функция КомандуПечатиВСтруктуру(ТаблицаЗначенийКомандыПечати) Экспорт
	
	ИмяКоманды = "";
	
	Для Каждого КомандаПечати Из ТаблицаЗначенийКомандыПечати.НайтиСтроки(Новый Структура("ИмяКомандыНаФорме", ИмяКоманды)) Цикл
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(КомандаПечати);
	КонецЦикла;
	
КонецФункции

// <Проверяет, что номенклатура относится к рулонам, и имеет тип номенклатуры "ТоварРулоныХарактеристики".
// Если все верно, но количество в табличной части должно подставляться автоматически равное карактеристике>
//
// Переменные:
// Номенклатура - Номенклатура текущей строки
//
// Возвращаемое значение:
// <Булево> 
//
&НаСервере
Функция НоменклатураВРулонахПоХарактеристикам(Номенклатура)

	//++ смарт:ММ #040 217 30.03.2020 - проверка рулонов 
	//Возврат Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварРулоныХарактеристики", Истина)
	Возврат смартОбщегоНазначения.НоменклатураВРулонахПоХарактеристикам(Номенклатура);
	//-- смарт:ММ 30.03.2020

КонецФункции

&НаСервере
Процедура РасшСмарт_УсловноеОформлениеРекламныеВоздействия(Товар, РекламноеВоздействиеНеЗаполнено)
	
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыРекламноеВоздействие.Имя);
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Номенклатура");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Товар; 
	//++ смарт:ММ #042 222 26.03.2020 Рефакторинг 	
	//Если НЕ Товар.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварПлоттерыСерии", Истина) Тогда
	ТоварПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	Если НЕ Товар.ВидНоменклатуры = ТоварПлоттерыСерии Тогда
	//-- смарт:ММ 26.03.2020
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(ПолеЭлемента, Элементы.ТоварыРекламноеВоздействие.Имя, "ОтметкаНезаполненного", Ложь);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<реклама не используется>'"));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ИначеЕсли РекламноеВоздействиеНеЗаполнено Тогда
		//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр(""));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	КонецЕсли;
	
КонецПроцедуры  

//++ #1338 смарт: Фролов 10.04.2023 //Мелкие доработки
//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
&НаСервере
Процедура смартУсловноеОформлениеКтоПередал(Товар, КтоПередалНеЗаполнено, ИмяРеквизита = "смартКтоПередал")
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(СтрШаблон("Товары%1", ИмяРеквизита));
	//-- #1936 смарт: Шляпников 20.01.2025
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Номенклатура");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Товар; 
	ТоварПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	Если НЕ Товар.ВидНоменклатуры = ТоварПлоттерыСерии Тогда
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<заполнение не требуется>'"));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ИначеЕсли КтоПередалНеЗаполнено Тогда
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	КонецЕсли;
КонецПроцедуры//-- #1338 смарт: Фролов 10.04.2023

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию() //Подставляет правильные значения при изменении реквизитов (для ленивых и не внимательных)
	
	Если Объект.Организация.ИНН = "9701053617" ИЛИ Объект.Организация.ИНН = "772736906578" Тогда //Если "Смарт-Т Текстиль" или "ИП Макачев"
		Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Объект.ЦенаВключаетНДС = Ложь;
		НалогообложениеНДСПриИзмененииСервер(Неопределено);
	Иначе
		Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Объект.ЦенаВключаетНДС = Истина;
		//++ смарт:ММ #032 177 05.03.2020 - при изменении организации флажок ЦенаВключаетНДС ставится, но ТЧ не пересчитывается
		ЦенаВключаетНДСПриИзмененииСервер(Неопределено);
		//-- смарт:ММ 05.03.2020
	КонецЕсли;
		
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьДокументПодписанДляУУ()

	Объект.смартДокументыПодписаны = Объект.Организация.Предопределенный;

КонецПроцедуры // УстановитьДокументПодписанДляУУ()
 
&НаСервере
Процедура УстановитьЗначенияДляНовогоДокумента() //Подставляет правильные значения при создании и копировании (для ленивых и не внимательных)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.Организация.ИНН = "9701053617" ИЛИ Объект.Организация.ИНН = "772736906578" Тогда //Если "Смарт-Т Текстиль" или "ИП Макачев"
			Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Иначе
			Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВалютуВДокументеИВСоглашении(Отказ)	
	Если Не Объект.Валюта = Объект.Соглашение.Валюта 
		И ТекущаяДата() > Дата('2019.01.09 00:00:00') 
		И НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта в соглашении с клиентом и на вкладке ""Дополнительно"" должна быть одинакова.
														  |ДОКУМЕНТ НЕ ПРОВЕДЕН!",
		                                                  ,"Объект.Валюта",,Отказ);
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ПроверитьСтавкуНДСВЗаказе(Отказ)	
	//смарт Каратеев ++ 13.07.2021. Добавил условие по просьбе Владимировой. Удалить после выполнения доработки
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
	Если Объект.Организация.ИНН = "9701053617" И (Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС ИЛИ Объект.ЦенаВключаетНДС = Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для Организации Смарт-Т Текстить Налогообложение должно быть выбрано ""Не облагается НДС""
												          |и Цена не должна включать НДС, просьба изменить на вкладке Дополнительно",
							                              ,"Объект.НалогообложениеНДС",,Отказ);
	КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПравильныйСклад()
    //++ #1515 смарт:Корбутов 26.10.2023 Разрешить заказы со склада СТ групп
	//Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Групп-СТ", Истина) Тогда
	//	Объект.Склад = Справочники.Склады.ПустаяСсылка();
	//	
	//	//Сообщение = Новый СообщениеПользователю;
	//	//Сообщение.Текст = "Отгрузка со склада Групп СТ запрещена";
	//	//Сообщение.Сообщить();
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отгрузка со склада Групп СТ запрещена",,"Объект.Склад");
	//	Возврат Ложь;
	//Иначе
	//	Возврат Истина; 
	//КонецЕсли;
	Возврат Истина;
	//-- #1515 смарт:Корбутов 26.10.2023 Разрешить заказы со склада СТ групп

КонецФункции
//Каратеев -

//Богус+
&НаСервере
Процедура ИзменитьДоступностьПоКомиссии()
	Если Не Объект.ЕстьКомиссия Тогда
		Объект.СуммаКомиссии = 0;
		Объект.АгентКомиссии = "";
	КонецЕсли;
	
	Элементы.СуммаКомиссии.Доступность = Объект.ЕстьКомиссия;
	Элементы.АгентКомиссии.Доступность = Объект.ЕстьКомиссия;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииШаблонаРекламыНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ШаблоныРекламыДляСчетов.Текст КАК Текст
	                    |ИЗ
	                    |	Справочник.ШаблоныРекламыДляСчетов КАК ШаблоныРекламыДляСчетов
	                    |ГДЕ
	                    |	ШаблоныРекламыДляСчетов.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",Объект.ШаблонРекламы);
	Рез=Запрос.Выполнить().Выбрать();
	
	Объект.ДополнительнаяИнформация=?(Рез.Следующий(),Рез.Текст,"");	
КонецПроцедуры	

&НаСервере
Функция ПроверитьВозможностьЗакрытияЗаказа()
	
	Отказ = Ложь;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период",       КонецДня(ТекущаяДата()));
	
	Запрос.Текст =
	//Богус++
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|	ТоварыКОтгрузкеОстатки.Получатель КАК Получатель,
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, ДокументОтгрузки = &ЗаказКлиента) КАК ТоварыКОтгрузкеОстатки
	|ГДЕ
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
	|	И ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке";
	
	//Запрос.Текст = Запрос.Текст +  Модуль_Б1Сервер.ТекстЗапросаПроверитьДолгКлиента();
	//Запрос.УстановитьПараметр("Документы", Объект.Ссылка);
	//Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДата());
	//Богус--
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Отказ = Истина;
		Объект.Статус = Выборка.ДокументОтгрузки.Статус;
	КонецЕсли;
	Возврат Отказ;
	
КонецФункции
//Богус-

&НаСервере
Процедура УстановитьВидимостьПредупреждений()
	Элементы.ДекорацияПредупреждение.Видимость=Объект.Организация.ИНН="772736906578"; //ИП Макачев
	Элементы.ДекорацияПредупреждениеСервис.Видимость=Объект.Организация.ИНН="7714358034"; //Смарт-Т Сервис
	//++смарт:rnp 682 15.10.2021
    Если Объект.Организация.ИНН="9701053617" 
        И Объект.Дата>Дата("16.10.2021 00:00:00") И Объект.Дата<Дата("16.10.2021 23:59:59") Тогда //Смарт-Т Текстиль
		Элементы.ДекорацияПредупреждение.Заголовок = "С 16.10.2021-31.12.2021 г. организация Смарт-Т Текстиль приостанавливает свою деятельность.";
		Элементы.ДекорацияПредупреждение.Видимость=Истина;
	КонецЕсли;
	//--смарт:rnp 682 15.10.2021
КонецПроцедуры

// Фролов+
&НаСервере
Процедура ПересчитатьТЧ_ТоварыВ_ВалютуУУ(ВалютаУУ=Неопределено)
	
	//смартКаратеев +- // Изменил процедуру под новые требования
	ВалютаУУ = ?(ВалютаУУ=Неопределено,Константы.ВалютаУправленческогоУчета.Получить(),ВалютаУУ); 
	
    //++ смарт:Минаева #1003 18.04.2022 15:19:16 внесено изменение в Заголовок "Цена в EUR"
  	Элементы.ТоварыСмартКонвертацияЦены.Заголовок = ?(Объект.Валюта = ВалютаУУ, "Цена РУБ", "Цена в EUR");
	
	ДанныеВалютыДок=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта,Объект.Дата);
	ДанныеВалютыУУ=РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУУ,Объект.Дата);
	
	Для Каждого Стр Из Объект.Товары Цикл 
		ПересчитатьСтрокуТЧ_ТоварыВ_ВалютуУУ(Стр,ДанныеВалютыДок,ДанныеВалютыУУ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуТЧ_ТоварыВ_ВалютуУУ(Знач Стр,ДанныеВалютыДок=Неопределено,ДанныеВалютыУУ=Неопределено)
	
	//смартКаратеев +- // Изменил процедуру под новые требования
	Если ДанныеВалютыДок=Неопределено ИЛИ ДанныеВалютыУУ=Неопределено Тогда
		ДанныеВалютыДок=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта,Объект.Дата);
		ДанныеВалютыУУ=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(),Объект.Дата);
	КонецЕсли;
	
	ДанныеВалютыНов = Новый Структура;
	
	Если ДанныеВалютыДок.Валюта = ДанныеВалютыУУ.Валюта Тогда
		ДанныеВалютыНов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Объект.Дата);
	ИначеЕсли ТипЗнч(ДанныеВалютыУУ) = Тип("Структура") Тогда
		ДанныеВалютыНов = ДанныеВалютыУУ;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Стр)=Тип("Число") Тогда 
		Стр=Объект.Товары.НайтиПоИдентификатору(Стр);
	КонецЕсли;	

	Стр.смартКонвертацияЦены=РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена,ДанныеВалютыДок,ДанныеВалютыНов);
	
	//++ #4590 смарт: Тимофеева 08.10.2025 / Цена в долларах, информационно, в заказах клиента
	ВалютаUSD		= Справочники.Валюты.НайтиПоКоду("840");
	ДанныеВалютыUSD	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаUSD, Объект.Дата);
	Стр.ЦенаВВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена, ДанныеВалютыДок, ДанныеВалютыUSD);
	//-- #4590 смарт: Тимофеева 08.10.2025
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьТелефоныКонтактногоЛица()
	//Фролов ++
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	                    |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Представление
	                    |ИЗ
	                    |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	                    |ГДЕ
	                    |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	                    |	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)");
	Запрос.УстановитьПараметр("Ссылка",Объект.КонтактноеЛицо);
	Элементы.смартТелефонКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Представление"));
	Объект.смартТелефонКонтактногоЛица="";
	//Фролов --
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРеквизитыДляРедактирования()
	
	//Каратеев +- // Отключили, блокировку изменения контрагента, если был распечатан счет клиенту
	
	//Если смартСчетНаОплатуВыставлен И Не РольДоступна("ПолныеПрава") Тогда 
	//	Элементы.Контрагент.ТолькоПросмотр=Истина;
	//	Элементы.Контрагент.Подсказка="Изменение контрагента запрещено! Ему уже был выставлен счет на оплату.";
	//КонецЕсли;
	
	Если (ПроцентОплаты>0 Или ПроцентОтгрузки>0) И 
		 Не (Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПодтвержденияЗаказаФинОтдел")) Тогда
		 
		МассивРеквизитов=Новый Массив;
		МассивРеквизитов.Добавить("Организация");
		МассивРеквизитов.Добавить("Партнер");
		МассивРеквизитов.Добавить("ПартнерБезКЛ");
		МассивРеквизитов.Добавить("Контрагент");
		МассивРеквизитов.Добавить("Валюта");
		МассивРеквизитов.Добавить("Соглашение");
		МассивРеквизитов.Добавить("Договор");
		Если ПроцентОтгрузки>0 Тогда 
			МассивРеквизитов.Добавить("Склад");
		КонецЕсли;	
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивРеквизитов, "ТолькоПросмотр", Истина);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
&После("ОбновитьСостояниеСервер")
Процедура смарт_ОбновитьСостояниеСервер()
	ЗакрытьРеквизитыДляРедактирования();
КонецПроцедуры

&НаСервере
Процедура СброситьПроведениеПриВысокомСПАРКРиске()
	УстановитьПривилегированныйРежим(Истина);
	Объект.смартПроводитьДокументПриВысокомСПАРКРиске=Ложь;
	Объект.смартОтветственныйЗаСПАРКРиски=Неопределено;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	

&НаСервереБезКонтекста
Функция  ПолучитьДанныеКонтрагента(Контрагент)
	Возврат Новый Структура("ЮрЛицо,НеПровенятьРиски",Контрагент.ЮрФизЛицо=ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо"),Контрагент.смартНеПроверятьРиски);		
КонецФункции	

&НаСервере
Процедура ЗаполнитьАдресаДоставки()
	ДоставкаТоваров.ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(Элементы,Объект);
КонецПроцедуры	

&НаСервере
Процедура ДобавитьУсловноеОформление()
	МаксимальнаяДатаРезерва=Макс(Объект.смартКонечнаяДатаРезерва,Объект.смартДатаПродленияРезервов);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.смартРезервДо.Имя);
	
	Отбор=Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Объект.смартРезервЗаканчивается");
	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("смартРезервЗаканчивается");
	//--#1205 смарт: Лопато 05.10.2022
	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение=Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",ЦветаСтиля.ЦветОсобогоТекста);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСмартКонвертацияЦены.Имя);
	//
	//Отбор=Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Объект.Валюта");
	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно;
	//Отбор.ПравоеЗначение=Константы.ВалютаРегламентированногоУчета.Получить();
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
	
	//++ #1250 смарт: Фролов 17.11.2022 //Проверенное оборудование. "Запрет на отгрузку без проверки оборудования  #1143 " 
	
	Запрос=Новый Запрос( "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДвиженияСерийТоваровОбороты.Номенклатура КАК Номенклатура,
			|	ДвиженияСерийТоваровОбороты.Серия КАК Серия
			|ПОМЕСТИТЬ НомСегмента
			|ИЗ
			|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(, , , ) КАК ДвиженияСерийТоваровОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
			|		ПО ДвиженияСерийТоваровОбороты.Номенклатура = НоменклатураСегмента.Номенклатура
			|ГДЕ
			|	НоменклатураСегмента.Сегмент = &Сегмент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СерииНоменклатуры.Ссылка КАК Серия
			|ИЗ
			|	НомСегмента КАК НомСегмента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|		ПО НомСегмента.Серия = СерииНоменклатуры.Ссылка
			|ГДЕ
			|	СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.ПровереноИсправно)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СерииНоменклатуры.Ссылка КАК Серия
			|ИЗ
			|	НомСегмента КАК НомСегмента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|		ПО НомСегмента.Серия = СерииНоменклатуры.Ссылка
			|ГДЕ
			|	НЕ СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.Пустаяссылка)
			|	И НЕ СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.ПровереноИсправно)"); 
	Запрос.УстановитьПараметр("Сегмент",Справочники.смартПредопределенныеЗначения.СегментПроверкаОборудования.Значение);
	МасРезультатов=Запрос.ВыполнитьПакет();
	СпсИсправно=Новый СписокЗначений;
	СпсИсправно.ЗагрузитьЗначения(МасРезультатов[1].Выгрузить().ВыгрузитьКолонку("Серия"));
	СпсНеИсправно=Новый СписокЗначений;
	СпсНеИсправно.ЗагрузитьЗначения(МасРезультатов[2].Выгрузить().ВыгрузитьКолонку("Серия"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСерия.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Серия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СпсИсправно;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBцвета.БледноЗеленый);
	
	Элемент2 = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента2 = Элемент2.Поля.Элементы.Добавить();
	ПолеЭлемента2.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСерия.Имя);
	
	ОтборЭлемента2 = Элемент2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Серия");
	ОтборЭлемента2.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента2.ПравоеЗначение = СпсНеИсправно;

	Элемент2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBцвета.Лосось);  
	
	//-- #1250 смарт: Фролов 17.11.2022
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДоставкуПоКлиентуСервер()
	
	Партнер = Объект.Партнер;
	
	Если Партнер.смартПартнерСпособДоставки = Перечисления.СпособыДоставки.ПустаяСсылка() Тогда
		
		Сообщить("Для работы функции автоматического заполнения всех полей доставки, необходимо предварительно заполнить требуемые поля в карточке клиента.");
		
	Иначе
		
		Объект.СпособДоставки = Партнер.смартПартнерСпособДоставки;
		Объект.АдресДоставки = Партнер.смартПартнерАдресДоставки;
		Объект.ПеревозчикПартнер = Партнер.смартПартнерПеревозчикПартнер;
		Объект.АдресДоставкиПеревозчика = Партнер.смартПартнерАдресДоставкиПеревозчика;
		Объект.ЗонаДоставки = Партнер.смартПартнерЗонаДоставки;
		Объект.ВремяДоставкиС = Партнер.смартПартнерВремяДоставкиС;
		Объект.ВремяДоставкиПо = Партнер.смартПартнерВремяДоставкиПо;
		Объект.ДополнительнаяИнформацияПоДоставке = Партнер.смартПартнерДополнительнаяИнформацияПоДоставке;
		Объект.ОсобыеУсловияПеревозки = Партнер.смартПартнерОсобыеУсловияПеревозки;
		Объект.ОсобыеУсловияПеревозкиОписание = Партнер.смартПартнерОсобыеУсловияПеревозкиОписание;
		//++ #4426 смарт: Тимофеева 24.09.2025 / Заказ клиента. Обработка Заполнить доставку по клиенту. Доработка. Этап 2.
		//Объект.КонтактноеЛицо=Партнер.смартПартнерКонтактноеЛицо;
		//Объект.смартТелефонКонтактногоЛица=Партнер.смартПартнерТелефонКонтактногоЛица;
		Если НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
			Объект.КонтактноеЛицо = Партнер.смартПартнерКонтактноеЛицо;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.смартТелефонКонтактногоЛица) Тогда
			Объект.смартТелефонКонтактногоЛица = Партнер.смартПартнерТелефонКонтактногоЛица;
		КонецЕсли;
		//-- #4426 смарт: Тимофеева 24.09.2025
		Объект.ПропускнаяСистема = Партнер.смартПартнерПропускнаяСистема;
		Объект.ДополнительнаяОбработкаГрузаТранспортнойКомпанией = Партнер.смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией;
		Объект.СпособДоставкиТовара = Партнер.смартПартнерСпособДоставкиТовара;
		Объект.ПлатильщикЗаДоставкуГруза = Партнер.смартПартнерПлатильщикЗаДоставкуГруза;
		
		//++ #Б-3552 смарт: Фролов 26.06.2025 //Заполнение раздела Доставка в заказе клиента на регулярной основе.
		Объект.смартВидТранспорта = Партнер.смартВидТранспорта;
		Объект.смартНомерМашины = Партнер.смартНомерМашины;
		Объект.смартНомерПрицепа = Партнер.смартНомерПрицепа;
		Объект.смартФИОВодителя = Партнер.смартФИОВодителя;
		Объект.смартНомерСерияПаспортВодителя = Партнер.смартНомерСерияПаспортВодителя;
		Объект.смартДатаВыдачиПаспортаВодителя = Партнер.смартДатаВыдачиПаспортаВодителя;
		Объект.смартФИОВторогоВодителя = Партнер.смартФИОВторогоВодителя;
		Объект.смартНомерСерияПаспортВторогоВодителя = Партнер.смартНомерСерияПаспортВторогоВодителя;
		Объект.смартДатаВыдачиПаспортаВторогоВодителя = Партнер.смартДатаВыдачиПаспортаВторогоВодителя;
		//-- #Б-3552 смарт: Фролов 26.06.2025
		
		//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
		смартОбновитьАдресДоставкиСамовывоз();
		//--#1382 смарт: Лопато 21.06.2023 
		
		//++ #4690 смарт: Тимофеева 14.10.2025 / Ошибки в заказах: приоритет и доставка 
		смартОбновитьАдресДоставкиПоКлиенту();
		//-- #4690 смарт: Тимофеева 14.10.2025
		
		ДоставкаТоваровКлиентСервер.УстановитьСтраницуДоставки(Элементы,Объект.СпособДоставки);
		
		//++ #Б4746 смарт: Шляпников 27.10.2025 / Документ Заказ клиента. Способ доставки. Ошибка в алгоритме заполнения. 
		Объект.АдресДоставкиЗначение = Партнер.смартПартнерАдресДоставкиЗначение;
		Объект.АдресДоставкиЗначенияПолей = Партнер.смартПартнерАдресДоставкиЗначенияПолей;
		
		Если НЕ ЗначениеЗаполнено(Объект.АдресДоставкиЗначение) И ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
			
			Объект.АдресДоставкиЗначение = Партнер.смартПартнерАдресДоставкиЗначение;
			АдресПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(Объект.АдресДоставки, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
			Объект.АдресДоставкиЗначение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(АдресПоПолям);
			
			Если НЕ ЗначениеЗаполнено(Объект.АдресДоставкиЗначение) Тогда
				Объект.АдресДоставкиЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзJSONВXML(Объект.АдресДоставкиЗначение, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
			КонецЕсли;
																
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.АдресДоставкиЗначенияПолей) И ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
			
			Объект.АдресДоставкиЗначение = Партнер.смартПартнерАдресДоставкиЗначение;
			АдресПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(Объект.АдресДоставки, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
			АдресДоставкиЗначение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(АдресПоПолям);
			Объект.АдресДоставкиЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзJSONВXML(АдресДоставкиЗначение, 
																Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонецЕсли;
		
		РассчитатьПараметрыДоставки();
		//-- #Б4746 смарт: Шляпников 27.10.2025

		//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
		Модифицированность = Истина;
		//-- #Б4248 смарт: Шляпников 16.09.2025
		
	КонецЕсли;
		
КонецПроцедуры	
// Фролов-

//++ смарт:КМД #3_3 461 11.03.2021
&НаСервере
Функция смарт_ЕстьОтгрузкиПоЗаказу()
	ЕстьОтгрузка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыКлиентовОбороты.ЗаказаноРасход КАК ЗаказаноРасход
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(, , Регистратор, ЗаказКлиента = &Заказ) КАК ЗаказыКлиентовОбороты
	|ГДЕ
	|	ЗаказыКлиентовОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ЗаказаноРасход > 0 тогда
			//были реализации по заказу клиента
			ЕстьОтгрузка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОтгрузка;
КонецФункции
// Фролов-

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 05.07.2021 17:03:08
&НаСервере
Функция смарт_ПроверкаВалютыСоглашения()
	ВалРуб=Константы.ВалютаРегламентированногоУчета.Получить();
	Если Объект.Валюта<>ВалРуб Тогда
		Возврат Ложь;
	КонецЕсли; 
	Возврат Истина;
КонецФункции

//++#1186 смарт: Лопато 19.09.2023 //Запрет изменять валюту в выгруженных на сайт заказах.
Функция смартПроверитьИзменениеВалютыВЗаказеСайта(Отказ = Ложь)

	ВалютаЗаказаСайтаИзменена = ЗначениеЗаполнено(Объект.Б_Идентификатор) И НЕ Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ВалютаЗаказаСайтаИзменена Тогда
		Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			ОбщегоНазначения.СообщитьПользователю("Нельзя изменять валюту в заказе с сайта. Отмените текущий заказ и создайте новый в другой валюте!", , "Валюта", "Объект.Валюта", Отказ);
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Нельзя изменять валюту в заказе с сайта. Изменение валюты вызовет последствия!", , "Валюта", "Объект.Валюта");
		КонецЕсли;
    КонецЕсли;
	
КонецФункции //--#1186 смарт: Лопато 19.09.2023

//++ #Б-2500 смарт: Лопато 25.02.2025 //Заказ клиента установка ограничений. Дополнение.  
&НаСервере
Процедура УстановитьДоступностьКонтрагентаПоДоговоруНаСервере()

	Элементы.Контрагент.ТолькоПросмотр =
		НЕ Пользователи.РолиДоступны("ПолныеПрава")
		И Объект.Проведен
		И НЕ Объект.ПометкаУдаления
		И ЗначениеЗаполнено(Объект.Договор);

КонецПроцедуры //-- #Б-2500 смарт: Лопато 25.02.2025

#КонецОбласти

#Область НаКлиенте

//Каратеев +
&НаСервере
Процедура УстановитьВидимостьДоработанныхЭлементов()

	Элементы.СогласованоБух.Видимость 			= Ложь;
	Элементы.смартДокументыПодписаны.Видимость	= Ложь;
	Элементы.СоздатьРеализацию.Видимость		= Ложь;
	
	Если Пользователи.РолиДоступны("смартУстановкаПодтвержденияЗаказаФинОтдел,смартИзменениеПодтвержденияЗаказаФинОтдел,ПолныеПрава") Тогда
		
		Элементы.СогласованоБух.Видимость = Истина;
		Элементы.смартДокументыПодписаны.Видимость = Истина;
		Элементы.смартДокументыПодписаны.Доступность = ?(Объект.Организация.Предопределенный, Ложь, Истина);
		
	КонецЕсли;
	
	Если РольДоступна("БыстраяРеализацияИзЗаказа")
		ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.СоздатьРеализацию.Видимость = Истина;
	КонецЕсли;
	
	//++ #Б-1044 смарт: Мосолов 25.10.2024 //Закрыть бухгалтерии корректировку заказа клиента (ИТСМ 1270)
	Если Объект.СогласованоБух И Не РольДоступна("ПолныеПрава") Тогда  
		
		Элементы.Товары.ИзменятьСоставСтрок = Ложь;
	//-- #Б-1044 смарт: Мосолов 25.10.2024 
		
		Элементы.Товары.КоманднаяПанель.Доступность				= Ложь;
		Элементы.ТоварыНоменклатураКод.Доступность				= Ложь;
		Элементы.ТоварыНоменклатураАртикул.Доступность			= Ложь;
		Элементы.ТоварыГруппаНаборы.Доступность					= Ложь;
		//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
		Элементы.ТоварыНоменклатура.ТолькоПросмотр				= Истина;
		//-- #Б4398 смарт: Шляпников 02.10.2025
		Элементы.ТоварыХарактеристика.Доступность				= Ложь;
		Элементы.ТоварыКоличествоУпаковок.Доступность			= Ложь;
		Элементы.ТоварыУпаковка.Доступность						= Ложь;
		Элементы.ТоварыВидЦены.Доступность						= Ложь;
		Элементы.ТоварыЦена.Доступность							= Ложь;
		Элементы.ТоварыСмартКонвертацияЦены.Доступность			= Ложь;
		//++ #4590 смарт: Тимофеева 08.10.2025 / Цена в долларах, информационно, в заказах клиента
		Элементы.ТоварыЦенаВВалюте.Доступность					= Ложь;
		//-- #4590 смарт: Тимофеева 08.10.2025
		Элементы.ТоварыПроцентАвтоматическойСкидки.Доступность	= Ложь;
		Элементы.ТоварыСуммаАвтоматическойСкидки.Доступность	= Ложь;
		Элементы.ТоварыПроцентРучнойСкидки.Доступность			= Ложь;
		Элементы.ТоварыСуммаРучнойСкидки.Доступность			= Ложь;
		Элементы.ТоварыСумма.Доступность						= Ложь;
		Элементы.ТоварыСтавкаНДС.Доступность					= Ложь;
		Элементы.ТоварыСуммаНДС.Доступность						= Ложь;
		Элементы.ТоварыСуммаСНДС.Доступность					= Ложь;
		Элементы.ТоварыСклад.Доступность						= Ложь;
		
		//++ #Б-1044 смарт: Мосолов 25.10.2024 //Закрыть бухгалтерии корректировку заказа клиента (ИТСМ 1270)
		Если НЕ Пользователи.РолиДоступны("смартИзменениеПодтвержденияЗаказаФинОтдел") Тогда
		//-- #Б-1044 смарт: Мосолов 25.10.2024 

			Элементы.СогласованоБух.Доступность						= Ложь;
			
			Элементы.Партнер.ТолькоПросмотр							= Истина;
			Элементы.Контрагент.ТолькоПросмотр						= Истина;
			Элементы.Соглашение.Доступность							= Ложь;
			Элементы.Организация.ТолькоПросмотр						= Истина;
			Элементы.Договор.ТолькоПросмотр							= Истина;
			Элементы.Склад.ТолькоПросмотр							= Истина;
			
			Элементы.ГруппаВалюта.ТолькоПросмотр                    = Истина;
			Элементы.НалогообложениеНДС.ТолькоПросмотр              = Истина;  
		
		//++ #Б-1044 смарт: Мосолов 25.10.2024 //Закрыть бухгалтерии корректировку заказа клиента (ИТСМ 1270)
		КонецЕсли;
		//-- #Б-1044 смарт: Мосолов 25.10.2024 
		
	КонецЕсли;
	
	//++ #Б4292 смарт: Шляпников 17.09.2025 / Заказа клиента. Права доступа к реквизиту Разрешаю проведение. 
	Элементы.смартПроводитьДокументПриВысокомСПАРКРиске.Доступность = Ложь;
	//-- #Б4292 смарт: Шляпников 17.09.2025

	//Каратеев ++
	Если Пользователи.РолиДоступны("ПолныеПрава,смартНеПроверятьСПАРКРиски") Тогда
		
		Элементы.смартПроводитьДокументПриВысокомСПАРКРиске.Доступность 	= Истина;
		Элементы.ГруппаРазрешениеСПАРКРисков.Доступность 					= Истина;
		Элементы.ГруппаИндексыСПАРКРиски.Доступность 						= Истина;
		
		Элементы.смартПроводитьДокументПриВысокомСПАРКРиске.ТолькоПросмотр 	= Ложь;
		Элементы.ГруппаРазрешениеСПАРКРисков.ТолькоПросмотр 				= Ложь;
		Элементы.ГруппаИндексыСПАРКРиски.ТолькоПросмотр 					= Ложь;
		
		ПравоНаРедактированиеРисков = 
		ПравоДоступа("Редактирование", Метаданные.Документы.ЗаказКлиента.Реквизиты.смартПроводитьДокументПриВысокомСПАРКРиске);
		
	КонецЕсли;
	//Каратеев --
    
    //++ смарт:Подкин #1035 25.05.2022 15:34:45
	//смартКаратеев ++
	//Элементы.ТоварыСмартЦенаМин.Видимость = НЕ (Константы.ВидМинимальноДопустимыхЦенПродажи.Получить() = Справочники.ВидыЦен.ПустаяСсылка());
//    Элементы.ТоварыСмартЦенаМин.Видимость = Ложь;
	//Каратеев --
    //-- смарт:Подкин #1035 25.05.2022 15:34:45

	//Добавлено исключение запрещающее менять Соглашение после записи Заказа клиента
	//Если НЕ Объект.Ссылка = Документы.ЗаказКлиента.ПустаяСсылка()
	//	И Не (РольДоступна("ПолныеПрава")
	//	ИЛИ РольДоступна("смартИзменениеПодтвержденияЗаказаФинОтдел")) Тогда
	//
	//	Элементы.Соглашение.ТолькоПросмотр						= Истина;
	//
	//КонецЕсли; 
	
	//++ смарт:ММ #049 248 12.05.2020 - Доработка Желаемой даты отгрузки  
	Элементы.ЖелаемаяДатаОтгрузки.ТолькоПросмотр = Истина;
	//++ смарт:Демичев №1277 27.02.2023
	//Элементы.ЖелаемаяДатаОтгрузки.Подсказка = "Заполняется автоматически наименьшей датой к отгрузке"; 
	Элементы.ЖелаемаяДатаОтгрузки.Подсказка = "Заполняется автоматически наименьшей датой к отгрузке или датой отгрузки";
	//-- смарт:Демичев №1277 27.02.2023
	//-- смарт:ММ 12.05.2020
	
	//++ #Б-2500 смарт: Лопато 25.02.2025 //Заказ клиента установка ограничений. Дополнение.  
	УстановитьДоступностьКонтрагентаПоДоговоруНаСервере();
	//-- #Б-2500 смарт: Лопато 25.02.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗакрытие(Результат, Параметры) Экспорт

	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Объект.СогласованоБух = Ложь;
		УстановитьЦветИСтатусСогласования();
		ЭтотОбъект.Элементы.НадписьСогласованоФинОтделом.Заголовок = "Снято! Отличаются ЮрЛица";
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Установлен статус Закрыт, но остались документы с ошибочными заначениями",
		,"Объект.Статус");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура смарт_СоздатьРеализациюПосле(Команда)
	
	//++ смарт:ММ #020 183 11.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
	// 0. Проверки
	// 1. Печать Счета на оплату
	// 2. Создание Реализации ТиУ
	// 3. Создание Счет-фактуры
	// 4. Печать УПД
	// 5. Печать этикетки доставки
	
	Если НЕ ЕстьПравоСозданияРеализаций() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для создания документа реализации");
		Возврат;
	КонецЕсли;
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Экспортная отгрузка, необходимо оформить документ самостоятельно");
		Возврат;
	КонецЕсли;
		
	ЗаполнитьОбеспечениеАвтоматически();
	// Фролов+
	НеВыполнятьПроверкуПередЗаписью=Истина;
	ЭтотОбъект.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение)); // Фролов добавил режим записи Проведение
	// Фролов-
	
	//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
	// В регистре накопления с отбором ТоварыКОтгрузке.ДокументОтгрузки = Объект.Ссылка 
	// по ресурсу "КОформлению" должен быть положительный остаток.

	ОстатокКОформлению = ПолучитьОстатокКОформлению(Объект.Ссылка);	
	Если ОстатокКОформлению <= 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет товаров к отгрузке");
		Возврат;
	КонецЕсли;
	
	// 1. Печать Счета на оплату
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	Идентификатор = "СчетнаОплату";
	Если Объект.СпособДоставки <> ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
		Идентификатор = "СчетнаОплату,СчетнаОплату";
	КонецЕсли;	
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ЗаголовокФормы", "Счет на оплату");
	ПараметрыПечати.Вставить("Представление", "Счет на оплату");
	//ПараметрыПечати.Вставить("КоличествоЭкземпляров", 2); // - не работает!
	//ПараметрыПечати.Вставить("Экземпляров", 2); // - не работает
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСчетовНаОплату", Идентификатор, МассивОбъектов, ЭтаФорма, ПараметрыПечати); 


	//-- смарт:ММ 13.02.2020
	
	Если ЭтотОбъект.ПроцентОтгрузки < 100 Тогда
		ДокументОбъект = Объект.Ссылка;

		ФормаРеализации = ПолучитьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", Новый Структура("Основание", ДокументОбъект));
		Если ФормаРеализации.Объект.Товары.Количество() Тогда 
			
			//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
			//ФормаРеализации.Записать();
			
			// 2. Создание Реализации ТиУ
			
			СтруктураОтветственныеЛица = ПолучитьОтветственныеЛица();
			ФормаРеализации.Объект.Руководитель 	= СтруктураОтветственныеЛица.Руководитель;
			ФормаРеализации.Объект.ГлавныйБухгалтер = СтруктураОтветственныеЛица.ГлавныйБухгалтер;
			ФормаРеализации.Объект.Отпустил 		= ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Склад, "ТекущийОтветственный");
			
			Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов") = Истина Тогда
				// Основанием Реализации должен подставиться договор, а не Заказ клиента
				ФормаРеализации.Объект.ОснованиеДата = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Договор, "Дата");
				ФормаРеализации.Объект.ОснованиеНомер = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Договор, "Номер");
				ФормаРеализации.Объект.Основание = Строка(Объект.Договор) + " №" + ФормаРеализации.Объект.ОснованиеНомер + " от " + Формат(ФормаРеализации.Объект.ОснованиеДата, "ДФ='dd.MM.yyyy ""г.""'");
			КонецЕсли;			
			
			Попытка
				ФормаРеализации.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));				
			Исключение 
				ФормаРеализации.Открыть();
				
			КонецПопытки;
			//-- смарт:ММ 13.02.2020
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет доступных товаров для создания реализации");
			Возврат;
		КонецЕсли;
		РеализацияСсылка = ФормаРеализации.Объект.Ссылка;
		
				
		//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
		
		//ВызватьСоздатьНаОсновании(РеализацияСсылка);

		Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РеализацияСсылка, "Проведен") Тогда 
			
			// 3. Создание Счет-фактуры
			
			ПараметрыРегистрации = ПараметрыРегистрацииСчетовФактурВыданныхСервер(ФормаРеализации.Объект);
			ВвестиСчетФактуруВыданный(ФормаРеализации, ПараметрыРегистрации);
			
			ФормаРеализации.ФискальнаяОперацияЗавершение(Неопределено, Неопределено);			
			ФормаРеализации.Открыть();
			
			ОбъектыНазначения = Новый Массив;
			ОбъектыНазначения.Добавить(РеализацияСсылка);

			// 4. Печать УПД
			
			Идентификатор = "УПД,УПД";
			Если Объект.СпособДоставки <> ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
				Идентификатор = "УПД,УПД,УПД,УПД";
			КонецЕсли;	
			
			ПараметрыПечати = Новый Структура;
			ПараметрыПечати.Вставить("ЗаголовокФормы", "УПД");
			ПараметрыПечати.Вставить("Представление", "УПД");
			//ПараметрыПечати.Вставить("КоличествоЭкземпляров", 4);  // - не работает!
			//ПараметрыПечати.Вставить("Экземпляров", 4);  // - не работает!
	
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьОбщихФорм", Идентификатор, ОбъектыНазначения, ЭтаФорма, ПараметрыПечати);
			
			// 5. Печать этикетки доставки
			Идентификатор = "ЭтикеткаДоставки";
			Если Объект.СпособДоставки <> ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда 
				ОписаниеКоманды = Новый Структура;
				ОписаниеКоманды.Вставить("ОбъектыПечати", ОбъектыНазначения);
				ОписаниеКоманды.Вставить("Идентификатор", Идентификатор);
				
				УправлениеПечатьюУТКлиент.ПечатьЭтикетокДоставки(ОписаниеКоманды);
			КонецЕсли;
			
		КонецЕсли;
		//-- смарт:ММ 13.02.2020
		
		ОбновитьСостояниеСервер();
		
		//КомандаПечати = ПолучитьДанныеДляПечати();
		
		//УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(КомандаПечати, ФормаРеализации, ФормаРеализации.Объект);
	Иначе
		Сообщить("Документ полностью отгружен");
		Возврат;
	КонецЕсли;

КонецПроцедуры

//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
&НаСервереБезКонтекста
Функция ПараметрыРегистрацииСчетовФактурВыданныхСервер(Знач Объект)
	
	Возврат Документы.РеализацияТоваровУслуг.ПараметрыРегистрацииСчетовФактурВыданных(Объект);
	
КонецФункции //-- смарт:ММ 13.02.2020

//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
// Процедура скопирована из общего модуля УчетНДСУПСлужебныйКлиент  - модуль удален в релизе 11.4.13
&НаКлиенте
Процедура ВвестиСчетФактуруВыданный(Форма, ПараметрыРегистрации)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыРегистрации",  ПараметрыРегистрации);
	ДополнительныеПараметры.Вставить("ОткрыватьСуществующую", Ложь);
	ДополнительныеПараметры.Вставить("Форма",                 Форма);
	
	Оповещение = Новый ОписаниеОповещения("ВвестиСчетФактуруВыданныйЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
	ПроверитьВозможностьСозданияДокументаНаОсновании(Форма, Оповещение);
	//УчетНДСУПСлужебныйКлиент.ПроверитьВозможностьСозданияДокументаНаОсновании(Форма, Оповещение);
	//-- смарт:ММ 13.02.2020
	
КонецПроцедуры //-- смарт:ММ 13.02.2020

//++ смарт:rnp 183 09.05.2020 - Кнопка "Быстрая реализация" в Заказе клиента
// Процедура скопирована из общего модуля УчетНДСУПСлужебныйКлиент - модуль удален в релизе 11.4.13
&НаКлиенте
Процедура ПроверитьВозможностьСозданияДокументаНаОсновании(Форма, Оповещение) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка)
		Или Не Форма.Объект.Проведен
		Или Форма.Модифицированность Тогда
		
		ДополнительныеПараметры = Новый Структура("Оповещение, Форма", Оповещение, Форма);
		ОповещениеВопроса = Новый ОписаниеОповещения(
			"ПроверитьВозможностьСозданияДокументаНаОснованииЗавершение",
			ЭтотОбъект, ДополнительныеПараметры);
		
		ТекстВопроса = НСтр("ru = 'Для продолжения необходимо провести документ. Провести?'");
		ПоказатьВопрос(ОповещениеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение, Истина);
	
КонецПроцедуры


//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
// Процедура скопирована из общего модуля УчетНДСУПСлужебныйКлиент
&НаКлиенте
Процедура ВвестиСчетФактуруВыданныйЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да 
		И Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРегистрации = ДополнительныеПараметры.ПараметрыРегистрации;
		
	Если ЗначениеЗаполнено(ПараметрыРегистрации.Ссылка) Тогда
		ДокументОснование = ПараметрыРегистрации.Ссылка;
	Иначе
		ДокументОснование = ДополнительныеПараметры.Форма.Объект.Ссылка;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыОткрытия.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ПараметрыОткрытия.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	ПараметрыОткрытия.Вставить("Исправление",       ПараметрыРегистрации.ИсправлениеОшибок);
	ПараметрыОткрытия.Вставить("Корректировочный",  ПараметрыРегистрации.КорректировкаПоСогласованиюСторон);
	
	ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
	
	//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
	//ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
	
	ЭтаФорма.смартСчетФактураСсылка = Неопределено;
	
	ФормаСФ = ПолучитьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы);
	ФормаСФ.Объект.Руководитель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ДокументОснование, "Руководитель");
	ФормаСФ.Объект.ГлавныйБухгалтер = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ДокументОснование, "ГлавныйБухгалтер");
	
	Попытка
		ФормаСФ.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записан и проведен документ " + ФормаСФ.Объект.Ссылка, ФормаСФ.Объект.Ссылка);
	Исключение
		ФормаСФ.Записать();
		ТекстСообщения = "Записан, но не проведен документ " + ФормаСФ.Объект.Ссылка + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ФормаСФ.Объект.Ссылка);
	КонецПопытки;
	
	ЭтаФорма.смартСчетФактураСсылка = ФормаСФ.Объект.Ссылка;	
	//-- смарт:ММ 13.02.2020
	
КонецПроцедуры //-- смарт:ММ 13.02.2020

//++ смарт:ММ #020 183 11.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
&НаСервереБезКонтекста
Функция ЕстьПравоСозданияРеализаций()
	
	Возврат УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеРеализацийТоваровУслуг") ИЛИ УправлениеДоступом.ЕстьРоль("ПолныеПрава") 
		
КонецФункции //-- смарт:ММ 11.02.2020

//++ смарт:ММ #020 183 11.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
&НаСервереБезКонтекста
Функция ПолучитьОстатокКОформлению(ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток КАК КОформлениюОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, ДокументОтгрузки = &ЗаказКлиента) КАК ТоварыКОтгрузкеОстатки";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("Период", ЗаказКлиента.ДатаОтгрузки + 1);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.КОформлениюОстаток) = Тип("Число") Тогда
			Возврат Выборка.КОформлениюОстаток;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //-- смарт:ММ 11.02.2020

//++ смарт:ММ #020 183 13.02.2020 - Кнопка "Быстрая реализация" в Заказе клиента
&НаСервере
Функция ПолучитьОтветственныеЛица()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Руководитель", 		Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка());
	СтруктураВозврата.Вставить("ГлавныйБухгалтер", 	Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка());
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка,
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВсеОтветственные
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
	|	И ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И ОтветственныеЛицаОрганизаций.ДатаНачала <= &Период
	|	И ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &Период <= ОтветственныеЛицаОрганизаций.ДатаОкончания
	|		КОНЕЦ
	|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Ссылка,
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
	|	2
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И ОтветственныеЛицаОрганизаций.ДатаНачала <= &Период
	|	И ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &Период <= ОтветственныеЛицаОрганизаций.ДатаОкончания
	|		КОНЕЦ
	|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|	И НЕ ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Ссылка,
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
	|	1
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
	|	И ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И ОтветственныеЛицаОрганизаций.ДатаНачала <= &Период
	|	И ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &Период <= ОтветственныеЛицаОрганизаций.ДатаОкончания
	|		КОНЕЦ
	|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Ссылка,
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо,
	|	2
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И ОтветственныеЛицаОрганизаций.ДатаНачала <= &Период
	|	И ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &Период <= ОтветственныеЛицаОрганизаций.ДатаОкончания
	|		КОНЕЦ
	|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|	И НЕ ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеОтветственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МИНИМУМ(ВТ_ВсеОтветственные.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Приоритеты
	|ИЗ
	|	ВТ_ВсеОтветственные КАК ВТ_ВсеОтветственные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеОтветственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеОтветственные.Ссылка КАК Ссылка,
	|	ВТ_ВсеОтветственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТ_ВсеОтветственные.Приоритет КАК Приоритет
	|ИЗ
	|	ВТ_ВсеОтветственные КАК ВТ_ВсеОтветственные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Приоритеты КАК ВТ_Приоритеты
	|		ПО ВТ_ВсеОтветственные.ОтветственноеЛицо = ВТ_Приоритеты.ОтветственноеЛицо
	|			И ВТ_ВсеОтветственные.Приоритет = ВТ_Приоритеты.Приоритет";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
	Запрос.УстановитьПараметр("Период", 		ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Руководитель = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	ГлавныйБухгалтер = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОтветственноеЛицо = Руководитель Тогда
			СтруктураВозврата.Вставить("Руководитель", Выборка.Ссылка);
		ИначеЕсли Выборка.ОтветственноеЛицо = ГлавныйБухгалтер Тогда
			СтруктураВозврата.Вставить("ГлавныйБухгалтер", Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции //-- смарт:ММ 13.02.2020

&НаКлиенте
Процедура ЗаполнитьОбеспечениеАвтоматически() Экспорт
	
	ПереченьВариантов = Новый Массив();	
	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));
	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Требуется"));
	ЗаполнитьОбеспечениеВУстановленномПорядке(Новый Структура("ПереченьВариантов",ПереченьВариантов));

КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОбОшибкеПользователю(НомерСтроки);	
	ТекстСообщения = "Строка №" + НомерСтроки + Символы.ПС
								+ "Количество погонных метров должно быть кратно намотке рулона!" + Символы.ПС
								+ "Укажите другое количество погонных метров.";
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Товары["+(НомерСтроки-1)+"].КоличествоУпаковок"); 	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка)
	
	Намотка = СтрокуВЧисло(Строка(Строка.Характеристика));
	
	Если Не Намотка = 1 Тогда
		КоличествоКОтгрузке = Строка.КоличествоУпаковок;
	Иначе
		КоличествоКОтгрузке = Истина;
	КонецЕсли;
		
	Возврат ОтгрузкаВРулонахКратнаНамотке(Намотка, КоличествоКОтгрузке);
	
КонецФункции

&НаКлиенте
Функция СтрокуВЧисло(ИсходнаяСтрока, ЗначениеПоУмолчанию = 0)
	//СтрокаВЧисло = Новый Соответствие;
	//Для Значение = 0 По 9 Цикл
	//	СтрокаВЧисло.Вставить(Строка(Значение), Значение);
	//КонецЦикла;
	//
	//Результат = 0;
	//Для Индекс = 1 По СтрДлина(ИсходнаяСтрока) Цикл
	//	ПоследнийРазряд = СтрокаВЧисло.Получить(Сред(ИсходнаяСтрока, Индекс, 1));
	//	Если ПоследнийРазряд <> Неопределено Тогда
	//		Результат = Результат * 10 + ПоследнийРазряд;
	//	КонецЕсли;
	//КонецЦикла;
	
	Возврат Число(ИсходнаяСтрока);	
КонецФункции

&НаКлиенте
Функция ОтгрузкаВРулонахКратнаНамотке(Намотка, КоличествоКОтгрузке)
	
	Возврат (КоличествоКОтгрузке%Намотка) = 0;
	
КонецФункции
//Каратеев -

//Богус+
&НаКлиенте
Процедура смарт_ЕстьКомиссияПриИзмененииПосле(Элемент)
	ИзменитьДоступностьПоКомиссии();
КонецПроцедуры

&НаКлиенте
Процедура смарт_ШаблонРекламыПриИзмененииПосле(Элемент)
	ПриИзмененииШаблонаРекламыНаСервере();
КонецПроцедуры
//Богус-

// Фролов +
&НаКлиенте
Процедура смарт_ТоварыЦенаПриИзмененииПосле(Элемент)
	
	ПересчитатьСтрокуТЧ_ТоварыВ_ВалютуУУ(Элемент.Родитель.ТекущаяСтрока);
	ПересчитатьЦенуСоСкидкой(Элементы.Товары.ТекущиеДанные);
	
	//смартКаратеев ++
	//ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	//смартЗаполнитьМинимальнуюЦенуПродажи(ТекущаяСтрока)
	//Каратеев --
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ВалютаПриИзмененииПосле(Элемент)
	
	смарт_ПриЧтенииСозданииНаСервере();
	
	//смартКаратеев ++
    //Для каждого Строка Из Объект.Товары Цикл	
    //	смартЗаполнитьМинимальнуюЦенуПродажи(Строка);	
    //КонецЦикла;
	//Каратеев --
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 05.07.2021 17:02:00 задача 461
	ТолькоВалютаРеглУчета= смарт_ПроверкаВалютыСоглашения();
	Если НЕ ТолькоВалютаРеглУчета И Объект.смартБезвозмезднаяПередача Тогда
		ПредупреждениеБезвозНаКлиенте();
	КонецЕсли; 
	//Смарт }Подкин Алексей Иванович 05.07.2021 17:02:00
	
	//++#1186 смарт: Лопато 14.11.2022 //Запрет изменять валюту в выгруженных на сайт заказах.
	смартПроверитьИзменениеВалютыВЗаказеСайта();
	//--#1186 смарт: Лопато 14.11.2022
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуСоСкидкой(Стр)
	Стр.ЦенаСоСкидкой=?(Стр.КоличествоУпаковок,?(Объект.ЦенаВключаетНДС,Стр.СуммаСНДС,Стр.Сумма)/Стр.КоличествоУпаковок,0);
КонецПроцедуры	

&НаКлиенте
Процедура смарт_ТоварыПересчитатьЦенуСоСкидкойПосле(Элемент)
	
	ПересчитатьЦенуСоСкидкой(Элементы.Товары.ТекущиеДанные);
	ПересчитатьСтрокуТЧ_ТоварыВ_ВалютуУУ(Элемент.Родитель.ТекущаяСтрока);
	
	//смартКаратеев ++
    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
    //смартЗаполнитьМинимальнуюЦенуПродажи(ТекущаяСтрока);
	//Каратеев --
	
	//++ смарт:КМД 717 01.12.2021
	смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(ТекущаяСтрока, Истина);
	//-- смарт:КМД 717 01.12.2021
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	Массив = Новый Массив;
	Массив.Добавить(Элементы.Товары.ТекущаяСтрока);
	РассчитатьПревышенияМаксимальнойСкидки(Массив);
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЦенаВключаетНДСПриИзмененииПосле(Элемент)
	Для Каждого Стр Из Объект.Товары Цикл 
		ПересчитатьЦенуСоСкидкой(Стр);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура смарт_смартПродлитьРезервВместо(Команда)
	Если ПроцентОплаты>0 Тогда Возврат КонецЕсли;
	//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
	Объект.смартКонечнаяДатаРезерва = КонецДня(смартСервер.ПолучитьПрибавитьКДатеКоличествоРабочихДней(Объект.смартКонечнаяДатаРезерва,7));
	//--#1205 смарт: Лопато 05.10.2022
	Объект.смартДатаПродленияРезервов=Объект.смартКонечнаяДатаРезерва;
	Элементы.смартРезервДо.Заголовок="Резерв продлен до: "+Формат(Объект.смартКонечнаяДатаРезерва,"ДЛФ=D");
	//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
	//Объект.смартРезервЗаканчивается=Объект.смартКонечнаяДатаРезерва-ТекущаяДата()<=86400;
	ЭтаФорма.смартРезервЗаканчивается = смартОбщегоНазначения.смартЦелыхДнейМеждуДатами(ТекущаяДата(), Объект.смартКонечнаяДатаРезерва) < 1;
	//--#1205 смарт: Лопато 05.10.2022
	Элементы.смартПродлитьРезерв.Доступность=Ложь;
	ЭтотОбъект.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура смартЗаполнитьДоставкуПоКлиенту(Команда)
	
	ЗаполнитьДоставкуПоКлиентуСервер();
	
	//смартКаратеев ++
	смартПереименоватьКнопкуБыстраяРеализацияПоДоставке();
	//Каратеев --
	
	//++ #Б-3552 смарт: Фролов 26.06.2025 //Заполнение раздела Доставка в заказе клиента на регулярной основе.
	СпособМестоДоставкиПеревозчикПриИзменении(Элементы.СпособДоставки);
	//-- #Б-3552 смарт: Фролов 26.06.2025

	
КонецПроцедуры

&НаСервере
&После("ЗаполнитьУстановитьРеквизитыДоставкиСервер")
Процедура смарт_ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы)

	//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
	////смартФролов ++
	//Если Объект.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз Тогда
	//	Запрос=Новый Запрос;
	//	Запрос.УстановитьПараметр("Ссылка",Объект.Контрагент);
	//	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	Представление КАК Адрес
	//	|ИЗ
	//	|	Справочник.Контрагенты.КонтактнаяИнформация
	//	|ГДЕ
	//	|	Ссылка = &Ссылка
	//	|	И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)";
	//	
	//	Рез=Запрос.Выполнить().Выбрать();
	//	ЮрАдрес="";
	//	
	//	Если Рез.Следующий() Тогда 
	//		ЮрАдрес=Рез.Адрес;
	//	КонецЕсли;
	//	
	//	Объект.АдресДоставки=ЮрАдрес;
	//КонецЕсли;
	
	смартОбновитьАдресДоставкиСамовывоз();
	//--#1382 смарт: Лопато 21.06.2023
	
	// Фролов -
	
	//++ #4690 смарт: Тимофеева 14.10.2025 / Ошибки в заказах: приоритет и доставка 
	смартОбновитьАдресДоставкиПоКлиенту();
	//-- #4690 смарт: Тимофеева 14.10.2025
	
КонецПроцедуры


&НаСервере
Функция смартУстановитьЦенуПоВидуЦены(ТекущаяСтрока)

	ПараметрыОтбора = Новый Структура("Валюта, Дата, ВидЦены, Номенклатура, Характеристика, Упаковка");
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ТекущаяСтрока);
	
	//СтруктураЗаполненияЦены = Новый Структура;
	//СтруктураЗаполненияЦены.Вставить("Дата",   Объект.Дата);
	//СтруктураЗаполненияЦены.Вставить("Валюта", Объект.Валюта);
	//ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтруктураЗаполненияЦены);
	
	//Если НЕ Константы.ВидМинимальноДопустимыхЦенПродажи.Получить() = Справочники.ВидыЦен.ПустаяСсылка()
	//	И (ПараметрыОтбора.ВидМинимальнойЦены = Неопределено 
	//	ИЛИ ПараметрыОтбора.ВидМинимальнойЦены = Справочники.ВидыЦен.ПустаяСсылка()) Тогда
	//	
	//	ПараметрыОтбора.Вставить("ВидМинимальнойЦены", Константы.ВидМинимальноДопустимыхЦенПродажи.Получить());
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Для Каждого Параметр Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
	|	* ЕстьNULL(ЦеныНоменклатурыСрезПоследних.Цена,0)/ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки2,1)
	|	* ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	|					ТОГДА 
	|						(КурсыВалютыЦены.Курс * КурсыВалюты.Кратность)
	|						/ (КурсыВалюты.Курс * КурсыВалютыЦены.Кратность)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), 
	|				ВидЦены = ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен)
	|				И Номенклатура = ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура)
	|				И Характеристика = ВЫРАЗИТЬ(&Характеристика КАК Справочник.ХарактеристикиНоменклатуры)
	|) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютыЦены
	|ПО 
	|	ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалюты
	|	ПО ИСТИНА
	|";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(&Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура)"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатурыСрезПоследних.Упаковка",
		"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
		
	Запрос.Текст = ТекстЗапроса;	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Окр(Выборка.Цена, 2);
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции // смартУстановитьЦенуПоВидуЦены()

//смартКаратеев ++
//Переименование кнопки Быстрая реализация в зависимости от способа доставки
&НаКлиенте
Процедура смартПереименоватьКнопкуБыстраяРеализацияПоДоставке()

	Элементы.СоздатьРеализацию.Заголовок = Строка("Быстрая реализация: " 
											+ "Способ доставки """+Объект.СпособДоставки + """: "
											+ ?(Объект.АдресДоставкиПеревозчика = "","", "Перевозчик """+Объект.ПеревозчикПартнер + """: ")
											+ "Адрес доставки """+Объект.АдресДоставки + """."
											);

КонецПроцедуры // смартПереименоватьКнопкуБыстраяРеализацияПоДоставке()
//Каратеев --

////Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 29.09.2020 13:09:28   задача 357  
&НаКлиенте
&После("РасчетСоглашения")
Процедура смарт_РасчетСоглашения()
	//смартКаратеев ++
	ПересчитатьТЧ_ТоварыВ_ВалютуУУ();
	
    //Для каждого Строка Из Объект.Товары Цикл	
    //	смартЗаполнитьМинимальнуюЦенуПродажи(Строка);	
    //КонецЦикла;
	//Каратеев --    
	
	//++ #4590 смарт: Тимофеева 08.10.2025 / Цена в долларах, информационно, в заказах клиента
	УстановитьВидимостьКолонокЦенВВалютеНаСервере();
	//-- #4590 смарт: Тимофеева 08.10.2025
	
КонецПроцедуры

//++ смарт:ММ #086 362 16.12.2020 
&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	ВидимостьДатаОплаты = Ложь;
	
	ЮрЛицоНеРезидент = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
	
	Если РольДоступна("ПолныеПрава") 
		Или Объект.Контрагент.ЮрФизЛицо = ЮрЛицоНеРезидент Тогда
		ВидимостьДатаОплаты = Истина;
	КонецЕсли;
	
	Если Объект.Контрагент.ЮрФизЛицо <> ЮрЛицоНеРезидент Тогда
		Если ЗначениеЗаполнено(Объект.смартДатаОплаты) Тогда
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
		Объект.смартДатаОплаты = Неопределено;
	КонецЕсли;
	
	Элементы.смартДатаОплаты.Видимость = ВидимостьДатаОплаты;
	
	//++ смарт:ММ #093 450 04.02.2021 - Доработка Заказа клиента
	Элементы.смартКонечныйПокупатель.ТолькоПросмотр = НЕ Объект.смартПродажаЧерезДилера;
	//-- смарт:ММ 04.02.2021
	
КонецПроцедуры //-- смарт:ММ 16.12.2020


//++ смарт:КМД #3_3 461 11.03.2021
&НаКлиенте
Процедура смарт_СмартБезвозмезднаяПередачаПриИзменении(Элемент)
	//если изменяем признак безвозмездной передачи, то надо проверить, чтобы по заказу не было отгрузок
	ЕстьОтгрузкиПоЗаказу = смарт_ЕстьОтгрузкиПоЗаказу();
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 05.07.2021 17:02:00 задача 461
	ТолькоВалютаРеглУчета= смарт_ПроверкаВалютыСоглашения();
	Если НЕ ТолькоВалютаРеглУчета И Объект.смартБезвозмезднаяПередача Тогда
		ПредупреждениеБезвозНаКлиенте();
	КонецЕсли; 
	//Смарт }Подкин Алексей Иванович 05.07.2021 17:02:00
	
	Если ЕстьОтгрузкиПоЗаказу = Истина И Объект.смартБезвозмезднаяПередача тогда
		Объект.смартБезвозмезднаяПередача = НЕ Объект.смартБезвозмезднаяПередача;
		ПоказатьПредупреждение(, "По данному заказу уже есть отгрузки (документы реализации), изменение признака безвозмездной передачи невозможно!");
	КонецЕсли;
КонецПроцедуры


&НаСервере
&После("ЗаполнитьУсловияПродаж")
Процедура смарт_ЗаполнитьУсловияПродаж()
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	
	смартВидимостьСрокаПоставки();
	
КонецПроцедуры

&НаСервере
&После("ПартнерПриИзмененииСервер")
Процедура смарт_ПартнерПриИзмененииСервер()
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	
	смартВидимостьСрокаПоставки();
	
	//++ #3946 смарт: Шляпников 31.07.2025 / Настройка правил продаж чернил МАРАБУ (Ковчег)
	ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
	Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
		УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
	КонецЕсли;
	//-- #3946 смарт: Шляпников 31.07.2025
	
	//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
	ЗаполнитьДанныеОМаксимальнойСкидке();
	//-- #Б5008 смарт: Шляпников 20.11.2025
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	смартОбновитьСостояниеСтопЛистаТехническойОтсрочки();
	//-- #4792 смарт: Тимофеева 17.03.26

КонецПроцедуры

&НаСервере
&После("КонтрагентПриИзмененииСервер")
Процедура смарт_КонтрагентПриИзмененииСервер()
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	
	смартВидимостьСрокаПоставки();
	
КонецПроцедуры

&НаСервере
&После("ОрганизацияПриИзмененииСервер")
Процедура смарт_ОрганизацияПриИзмененииСервер()
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	
	смартВидимостьСрокаПоставки();

КонецПроцедуры

&НаСервере
&После("УстановитьВидимостьЭлементовПоОперацииСервер")
Процедура смарт_УстановитьВидимостьЭлементовПоОперацииСервер()
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	
	смартВидимостьСрокаПоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ДоговорПриИзмененииПосле(Элемент)

	//++ #Б-2500 смарт: Лопато 25.02.2025 //Заказ клиента установка ограничений. Дополнение.  
	УстановитьДоступностьКонтрагентаПоДоговоруНаСервере();
	//-- #Б-2500 смарт: Лопато 25.02.2025
	
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	//++ #1334 смарт: Фролов 12.04.2023 //Заявка на формирование и подписание договора из 1С
	ПроверитьВозможностьВыбораДоговора();
	Если Объект.Договор.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	//-- #1334 смарт: Фролов 12.04.2023
	смартВидимостьСрокаПоставки();           
	
КонецПроцедуры

Процедура смартВидимостьСрокаПоставки()
	//смарт+ Вахов Владимир /568 / 28.06.2021 
	
	ЭлементСрокПоставки = Элементы.Найти("смартСрокПоставки");
	
	Если ЭлементСрокПоставки = Неопределено И Элементы.Договор.Видимость Тогда
		
		//++ #1334 смарт: Фролов 03.04.2023 //Заявка на формирование и подписание договора из 1С 
		//НовыйЭлемент = Элементы.Добавить("смартСрокПоставки", Тип("ПолеФормы"), Элементы.ГруппаНадписьДоговор);  
		НовыйЭлемент = Элементы.Добавить("смартСрокПоставки", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартСрокПоставки";
		НовыйЭлемент.КнопкаРегулирования = Истина; 
		НовыйЭлемент.Видимость = Ложь;
		//НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		//-- #1334 смарт: Фролов 03.04.2023

		
	КонецЕсли;	
	
	Если ЭлементСрокПоставки <> Неопределено Тогда
			
		//++ #1334 смарт: Фролов 18.04.2023 //Заявка на формирование и подписание договора из 1С 
		//ЭлементСрокПоставки.Видимость = Элементы.Договор.Видимость; 
		ЭлементСрокПоставки.Видимость = Ложь;
		
		 
		//Если Объект.Ссылка.Договор <> Объект.Договор Тогда
		//	Объект.смартСрокПоставки = 0;
		//КонецЕсли;
		//-- #1334 смарт: Фролов 03.04.2023
		
	КонецЕсли;	
	//++ #1334 смарт: Фролов 04.04.2023 //Заявка на формирование и подписание договора из 1С 
	ЭлементсмартЗаполнитьЗаявкуНаДоговор=Элементы.Найти("смартЗаполнитьЗаявкуНаДоговор"); 
	Если ЭлементсмартЗаполнитьЗаявкуНаДоговор = Неопределено Тогда
		НоваяКоманда		= ЭтаФорма.Команды.Добавить("СформироватьЗаявкуНаПодготовкуДоговора");
		НоваяКоманда.Действие	= "смартЗаполнитьЗаявкуНаДоговорКоманда";
		
		НовыйЭлемент = Элементы.Вставить("смартЗаполнитьЗаявкуНаДоговор", Тип("КнопкаФормы"),Элементы.ГруппаНадписьДоговор);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "СформироватьЗаявкуНаПодготовкуДоговора";
		НовыйЭлемент.Заголовок="Заявка на договор"; 
		
		смартСервер.смартДобавитьКнопкуИнформацииНаФорму("СформироватьЗаявкуНаПодготовкуДоговора", "поле ""Заполнение заявки на договор""", 
													 Элементы.ГруппаНадписьДоговор, ЭтаФорма);
	КонецЕсли; 
	Если Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт") Тогда
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Ложь;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=ложь;
	Иначе
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость= Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.Договор);
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость= Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.Договор);
	КонецЕсли;	
	//-- #1334 смарт: Фролов 04.04.2023
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 05.07.2021 17:02:00 задача 461
&НаКлиенте
Процедура смарт_СоглашениеПриИзмененииПосле(Элемент)
	ТолькоВалютаРеглУчета= смарт_ПроверкаВалютыСоглашения();
	Если НЕ ТолькоВалютаРеглУчета и Объект.смартБезвозмезднаяПередача Тогда
		ПредупреждениеБезвозНаКлиенте();
	КонецЕсли;

	//++#1186 смарт: Лопато 14.11.2022 //Запрет изменять валюту в выгруженных на сайт заказах.
	смартПроверитьИзменениеВалютыВЗаказеСайта();
	//--#1186 смарт: Лопато 14.11.2022
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	смартОбновитьСостояниеСтопЛистаТехническойОтсрочки();
	//-- #4792 смарт: Тимофеева 17.03.26 
	
	//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
	смартУстановитьПараметрыВыбораДоговора();
	Если НЕ ЭтаФорма["смартСоглашениеПередИзменением"] = Объект.Соглашение Тогда
		Объект.Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");	
	КонецЕсли;
	//-- #4822 смарт: Тимофеева 02.04.2026
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 05.07.2021 17:02:00 задача 461
&НаКлиенте
Процедура ПредупреждениеБезвозНаКлиенте()
	Объект.смартБезвозмезднаяПередача = НЕ Объект.смартБезвозмезднаяПередача;
	ПоказатьПредупреждение(, "Валюта заказа, должна быть равна, валюте регламентированного учета(RUB), изменение признака безвозмездной передачи невозможно!");
КонецПроцедуры
//-- Смарт: Белоусова 582 29.07.2021

//++ смарт:КМД 717 01.12.2021
&НаКлиенте
//++#1356 смарт: Лопато 18.05.2023 //Исправление автоматического расчета скидок в заказах клиентов  
Процедура смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(ТекСтрока, ВыводитьСообщение = Ложь, ПересчитыватьСумму = Истина)
//--#1356 смарт: Лопато 18.05.2023
 	//ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено тогда
		
		Если (ТекСтрока.ПроцентАвтоматическойСкидки <> 0 ИЛИ ТекСтрока.ПроцентРучнойСкидки <> 0) И ТекСтрока.КоличествоУпаковок <> 0 тогда
			
			//++#1356 смарт: Лопато 18.05.2023 //Исправление автоматического расчета скидок в заказах клиентов  
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);

			СтруктураДействий = Новый Структура;
			Если ПересчитыватьСумму Тогда
				СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
				СтруктураДействий.Вставить("ПересчитатьСуммуАвтоматическойСкидки");
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
			КонецЕсли;	
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрока, СтруктураДействий, КэшированныеЗначения);
			//--#1356 смарт: Лопато 18.05.2023
			
			//анализируем сумму, которая получилась в итоге, если после деления суммы на количество в цене получаются тысячные доли, то приводим сумму
			//по следующей формуле, СамаяБлизкаяЦенаБезТысячных * КоличествоУпаковок
			СуммаДляПроверки = ТекСтрока.Сумма;
			ЦенаДляПроверки = ТекСтрока.Сумма / ТекСтрока.КоличествоУпаковок;
			ЦенаДляПроверкиОкр = Окр(ЦенаДляПроверки, 2, РежимОкругления.Окр15как10);
			
			Если ЦенаДляПроверки <> ЦенаДляПроверкиОкр тогда
				//для расчета суммы используем цену, округленную по правилам математики
				ЦенаДляРасчетаСуммы = Окр(ЦенаДляПроверки, 2); //если использовать цену из документа будет "большой разбег" с первоначальной суммой
				СуммаПослеРасчета = Окр(ЦенаДляРасчетаСуммы * ТекСтрока.КоличествоУпаковок, 2);
				
				Если ТекСтрока.Сумма <> СуммаПослеРасчета тогда
					Если ВыводитьСообщение = Истина тогда
						Сообщить("Для номенклатуры """ + Строка(ТекСтрока.Номенклатура) + """ сумма по строке изменена с " + Строка(ТекСтрока.Сумма) + " на " + Строка(СуммаПослеРасчета) + "!");
					КонецЕсли;

					//++#1356 смарт: Лопато 18.05.2023 //Исправление автоматического расчета скидок в заказах клиентов  
					СуммаБезСкидки = Окр(ТекСтрока.КоличествоУпаковок * ТекСтрока.Цена, 2);
					
					ТекСтрока.ЦенаСоСкидкой = Окр(СуммаПослеРасчета / ТекСтрока.КоличествоУпаковок, 2);
					
					Если ТекСтрока.ПроцентРучнойСкидки <> 0 Тогда
						Если ТекСтрока.ПроцентАвтоматическойСкидки = 0 Тогда
							ТекСтрока.СуммаРучнойСкидки = СуммаБезСкидки - СуммаПослеРасчета;
						КонецЕсли;	
					Иначе
						ТекСтрока.СуммаРучнойСкидки = 0;
					КонецЕсли;
					
					Если ТекСтрока.ПроцентАвтоматическойСкидки <> 0 Тогда
						ТекСтрока.СуммаАвтоматическойСкидки = СуммаБезСкидки - СуммаПослеРасчета - ТекСтрока.СуммаРучнойСкидки;
					Иначе
						ТекСтрока.СуммаАвтоматическойСкидки = 0;
					КонецЕсли;
					//--#1356 смарт: Лопато 18.05.2023
					
					ТекСтрока.Сумма = СуммаПослеРасчета;

					//стандартные операции при изменении суммы
					//ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
					
					//++#1356 смарт: Лопато 18.05.2023 //Исправление автоматического расчета скидок в заказах клиентов  
					//ОперацииПередачи = ОперацииПередачиТоваров();
					//ПередачаТоваров = ОперацииПередачи.Найти(Объект.ХозяйственнаяОперация) <> Неопределено;
					//
					//СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект,
					//ПередачаТоваров);
					//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
					
					СтруктураДействий = Новый Структура;
					//СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
					//--#1356 смарт: Лопато 18.05.2023
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
					
					ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрока, СтруктураДействий, КэшированныеЗначения);
					
					//СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		смартРассчитатьРучнуюСкидкуСУчетомАкции(ТекСтрока.ПолучитьИдентификатор());
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		 
	КонецЕсли;
	
	//++ #Б5016 смарт: Шляпников 02.12.2025 / Снова не обновляется график платежей при добавлении наценки по доставке
	ПересчитатьСуммуГрафикаОплаты();
	//-- #Б5016 смарт: Шляпников 02.12.2025
	
КонецПроцедуры
//-- смарт:КМД 717 01.12.2021

//++ смарт:КМД 717 01.12.2021
&НаКлиенте
&После("НазначитьАвтоматическиеСкидкиЗавершение")
Процедура смарт_НазначитьАвтоматическиеСкидкиЗавершение(ВозвращенноеЗначение, ДополнительныеПараметры)
	Если ВозвращенноеЗначение <> Неопределено Тогда
		Для каждого Строка Из Объект.Товары Цикл	
			смартПриведениеСуммыДляПересчетаБезОкругленияКлиент(Строка, Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
//-- смарт:КМД 717 01.12.2021

//++ смарт:Подкин #896 11.02.2022 10:20:57 
&НаКлиенте
&Перед("АдресДоставкиОбработкаВыбора")
Процедура смарт_АдресДоставкиОбработкаВыбора1(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыбранноеЗначение,"ЗонаДоставки") Тогда
        ВыбранноеЗначение.ЗонаДоставки=Объект.ЗонаДоставки;
    КонецЕсли;
КонецПроцедуры
//-- смарт:Подкин #896 11.02.2022 10:20:57 

////++ смарт:Подкин #946 23.03.2022 9:26:29
//&НаКлиенте
//Процедура смарт_ТоварыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)   
//    смартПроизвестиПроверкиВалюты();   
//КонецПроцедуры //-- смарт:Подкин #946 23.03.2022 9:26:29

//++ смарт:Подкин #946 23.03.2022 13:16:04
&НаКлиенте
Процедура смартПроизвестиПроверкиВалюты()
    
    Если смартПроверять() Тогда 
        ВходитВСегмент=смартПроверитьВхождениеНоменклатурыВсегмент();
        Если НЕ ВходитВСегмент = Неопределено И ВходитВСегмент.Количество() Тогда
            Если ВходитВСегмент.Количество()=Объект.Товары.Количество() Тогда 
                //все товары ТЧ в сегменте 
                МассивСписок = СмартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ВалютыСоглашенийБитрикс",Истина); 
                СписокЗн=Новый СписокЗначений;
                Если НЕ Элементы.Валюта.СписокВыбора.Количество()=2 Тогда
                    Для каждого Стр  Из МассивСписок Цикл
                        Элементы.Валюта.СписокВыбора.Добавить(Стр,Строка(Стр));
                    КонецЦикла;   
                КонецЕсли;
                Элементы.Валюта.РежимВыбораИзСписка=Истина;  
                //Элементы.ТоварыВидЦены.Доступность=Истина;  
                Элементы.Валюта.Доступность=Истина; 
                Элементы.смартВозможноВЕвро.Видимость=Истина; 
            Иначе	
                //не все товары ТЧ в сегменте 
                СмартЗаменитьВалюту();         
                ВалютаПриИзменении(1);
                //Элементы.ТоварыВидЦены.Доступность=Ложь;                   
                Элементы.Валюта.Доступность=Ложь; 
                Элементы.смартВозможноВЕвро.Видимость=Ложь;
            КонецЕсли;
        Иначе 
            СмартЗаменитьВалюту();         
            ВалютаПриИзменении(1);
            //Элементы.ТоварыВидЦены.Доступность=Ложь;                   
            Элементы.Валюта.Доступность=Ложь;
            Элементы.смартВозможноВЕвро.Видимость=Ложь;
        КонецЕсли; 
    Иначе 
        //Элементы.ТоварыВидЦены.Доступность=Истина;                   
        Элементы.Валюта.Доступность=Истина;
        Элементы.смартВозможноВЕвро.Видимость=Ложь;
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #946 23.03.2022 13:16:04

//++ смарт:Подкин #946 23.03.2022 9:26:50
&НаСервере
Процедура смартЗаменитьВалюту()                  
    
    Объект.Валюта=Константы.ВалютаРегламентированногоУчета.Получить();   
    Если ЗначениеЗаполнено(Объект.Ссылка) И НЕ Объект.Ссылка.Валюта=Объект.Валюта Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание!!! Документ пересчитан в валюту "+Объект.Валюта);	
    КонецЕсли; 
    
КонецПроцедуры //-- смарт:Подкин #946 23.03.2022 9:26:50

//++ смарт:Подкин #946 23.03.2022 10:41:55
&НаСервере
Функция смартПроверять() 
    
    Если (ЗначениеЗаполнено(Объект.Соглашение) И НЕ Объект.Соглашение.Типовое И НЕ Объект.Соглашение.Валюта=Константы.ВалютаРегламентированногоУчета.Получить()) 
        
        ИЛИ (НЕ Справочники.смартПредопределенныеЗначения.ОграничиватьВалютуЦены.Значение=Неопределено И НЕ Справочники.смартПредопределенныеЗначения.ОграничиватьВалютуЦены.Значение)
        
        ИЛИ РольДоступна("ПолныеПрава")   
        
        Тогда
        
        Возврат Ложь;	
        
    КонецЕсли;         
    
    Возврат Истина;  
    
КонецФункции //-- смарт:Подкин #946 23.03.2022 10:41:55

//++ смарт:Подкин #946 23.03.2022 9:27:05
&НаСервере
Функция смартПроверитьВхождениеНоменклатурыВсегмент() 
    
    МассивНоменклатуры=Объект.Товары.Выгрузить(,"Номенклатура");  
    Если МассивНоменклатуры.Количество() Тогда
        Запрос = Новый Запрос;
        
        Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	НоменклатураСегмента.Номенклатура
        |ИЗ
        |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
        |ГДЕ
        |	НоменклатураСегмента.Сегмент = &СегментСсылка
        |	И НоменклатураСегмента.Номенклатура В (&ОбъектСсылка)";
        
        Запрос.УстановитьПараметр("ОбъектСсылка",МассивНоменклатуры);
        Запрос.УстановитьПараметр("СегментСсылка",Справочники.СегментыНоменклатуры.НайтиПоНаименованию("ТоварыДляЗаказаВВалюте"));
        Если НЕ Запрос.Выполнить().Пустой() Тогда
        
        	 ТЗ= Запрос.Выполнить().Выгрузить();
             МассивНом=ТЗ.ВыгрузитьКолонку("Номенклатура"); 
             
             Возврат МассивНом; 
             
         Иначе            
             
            Возврат Неопределено;   
            
        КонецЕсли;
                 
    КонецЕсли;
    
    Возврат Неопределено;
        
КонецФункции //-- смарт:Подкин #946 23.03.2022 9:27:05

//++ смарт:Подкин #946 23.03.2022 13:14:59
&НаКлиенте
Процедура смарт_ТоварыПослеУдаленияПосле(Элемент)
	смартПроизвестиПроверкиВалюты();
	
	//Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022
	//++#895 смарт: Холопов П. 19.05.2022 //вывод надписи для менеджера, о том, что в 
	//заказе есть прослеживаемые товары 
	
	//Если ЭтотОбъект.смартЕстьПрослеживаемыеТовары = Истина Тогда
	//	смартПроверитьНаличиеПрослеживаемыхТоваровНаСервере();
	//КонецЕсли;
	//-- #895 смарт: Холопов П. 19.05.2022
	
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023
	
	//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
	смартОбновитьАдресДоставкиСамовывоз();
	//--#1382 смарт: Лопато 21.06.2023
	
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024 
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	УдалитьАкцииБезТоваровИзДокумента();
	//-- #Б4818 смарт: Шляпников 17.11.2025
	
	//++ #5082 смарт: Тимофеева 01.12.2025 / Настройка правил продаж (Ковчег). Дополнительная проверка. 
	ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
	Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
		УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
	КонецЕсли;
	//-- #5082 смарт: Тимофеева 01.12.2025

КонецПроцедуры //-- смарт:Подкин #946 23.03.2022 13:14:59

//&НаКлиенте
//&Вместо("Подключаемый_ВыполнитьКоманду")
//Процедура смарт_Подключаемый_ВыполнитьКоманду(Команда)
//	
//	ИмяКоманды = Команда.Имя;
//	АдресНастроек = ЭтотОбъект.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;
//	ОписаниеКоманды = ПодключаемыеКомандыКлиентПовтИсп.ОписаниеКоманды(ИмяКоманды, АдресНастроек);
//	
//	Если ОписаниеКоманды.Идентификатор = "УПД" И ЭтотОбъект.смартЕстьПрослеживаемыеТовары = Истина Тогда
//	
//		ПоказатьПредупреждение(,"В заказе есть прослеживаемые товары! Нужно использовать ЭДО (электронный документооборот).",,"Есть прослеживаемые товары!");		
//		
//	Иначе
//		
//		ПродолжитьВызов(Команда);
//		
//	КонецЕсли;
//	
//КонецПроцедуры


//++#1261 смарт: Лопато 10.10.2023 //Доработка изменения Заказа клиента для ИМ  
&НаКлиенте
Функция смартЗаказВыгруженНаСайт(ПутьКДанным)

	ЗаказВыгруженНаСайт = ЗначениеЗаполнено(Объект.Б_Идентификатор);

	Если ЗаказВыгруженНаСайт Тогда
	   	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ выгружен на сайт, изменение запрещено!", , ПутьКДанным);
	КонецЕсли;

	Возврат ЗаказВыгруженНаСайт;

КонецФункции //--#1261 смарт: Лопато 10.10.2023

#КонецОбласти

#КонецОбласти

//++#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022 //Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022
&НаКлиентеНаСервереБезКонтекста
Процедура смартПоменятьВидимостьГруппаПредупреждение(Форма,Значение)
	
	Форма.Элементы.смартГруппаПредупреждение.Видимость = Значение;
	Форма.смартЕстьПрослеживаемыеТовары = Значение;
	
КонецПроцедуры 
	
//--#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022

//++#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022
&НаСервере
Процедура смартПроверитьНаличиеПрослеживаемыхТоваровНаСервере() //Консервация на случай если надо выводить сообщение на форму Демичев 28.12.2022

	ПараметрыОтбора = Новый Структура("смартПрослеживаемыйТовар",Истина );
	
	МассивПТ = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивПТ.Количество() = 0 Тогда 
		смартПоменятьВидимостьГруппаПредупреждение(ЭтотОбъект,Ложь);
	Иначе
		смартПоменятьВидимостьГруппаПредупреждение(ЭтотОбъект,Истина);
	КонецЕсли;
	
КонецПроцедуры //--#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022

//++ #1334 смарт: Фролов 17.04.2023 //Заявка на формирование и подписание договора из 1С  
&НаКлиенте
Процедура смарт_НалогообложениеНДСПриИзмененииПосле(Элемент)
	Объект.Договор=Неопределено;
	Если Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт") Тогда
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость=Ложь;
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость=ложь;
	Иначе
		Элементы.смартЗаполнитьЗаявкуНаДоговор.Видимость= Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.Договор);
		Элементы.КнопкасмартИнформация_СформироватьЗаявкуНаПодготовкуДоговора.Видимость= Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.Договор);
	КонецЕсли;	
КонецПроцедуры //-- #1334 смарт: Фролов 17.04.2023

//++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах  
&НаСервере
Функция смартУстановитьЗаголовокОстаткиПоОрганизациям(ПоРегистру=Ложь)
	ТекстОтвета="";
	Если Объект.Статус=Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		Возврат ТекстОтвета;
	КонецЕсли;	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
         |	ВложенныйЗапрос.Организация КАК Организация,
         |	ВложенныйЗапрос.Склад КАК Склад,
         |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
         |	ВложенныйЗапрос.Характеристика КАК Характеристика,
         |	СУММА(ВЫБОР
         |			КОГДА ВложенныйЗапрос.Своб >= ВложенныйЗапрос.Орг - ВложенныйЗапрос.Резерв
         |				ТОГДА ВложенныйЗапрос.Орг - ВложенныйЗапрос.Резерв
         |			ИНАЧЕ ВложенныйЗапрос.Своб
         |		КОНЕЦ) КАК Остаток,
         |	СУММА(ВложенныйЗапрос.Своб) КАК СвобОстаток,
         |	СУММА(ВложенныйЗапрос.Орг) КАК ОргОстаток,
         |	СУММА(ВложенныйЗапрос.ОжидаемыйПриход) КАК ОжидаемыйПриход,
         |	СУММА(ВложенныйЗапрос.ОжидаемыйРасход) КАК ОжидаемыйРасход,
         |	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв
         |ИЗ
         |	(ВЫБРАТЬ
         |		ОстаткиОрганизаций.Организация КАК Организация,
         |		ОстаткиОрганизаций.МестоХранения КАК Склад,
         |		ОстаткиОрганизаций.Номенклатура КАК Номенклатура,
         |		ОстаткиОрганизаций.Характеристика КАК Характеристика,
         |		СУММА(0) КАК Остаток,
         |		СУММА(ЕСТЬNULL(СвободныеОстатки.Остаток, 0)) КАК Своб,
         |		СУММА(ЕСТЬNULL(ОстаткиОрганизаций.КоличествоОстаток, 0)) КАК Орг,
         |		СУММА(0) КАК ОжидаемыйПриход,
         |		СУММА(0) КАК ОжидаемыйРасход,
         |		СУММА(0) КАК Резерв
         |	ИЗ
         |		(ВЫБРАТЬ
         |			ТоварыОрганизацийОстатки.Организация КАК Организация,
         |			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
         |			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
         |			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
         |			СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстаток
         |		ИЗ
         |			РегистрНакопления.ТоварыОрганизаций.Остатки(
         |					,
         |					АналитикаУчетаНоменклатуры.Номенклатура В (&СпсНоменклатуры)
         |						И АналитикаУчетаНоменклатуры.МестоХранения В (&СпсСкладов)) КАК ТоварыОрганизацийОстатки
         |		
         |		СГРУППИРОВАТЬ ПО
         |			ТоварыОрганизацийОстатки.Организация,
         |			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика,
         |			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
         |			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения) КАК ОстаткиОрганизаций
         |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
         |				СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
         |				СвободныеОстаткиОстатки.Характеристика КАК Характеристика,
         |				СвободныеОстаткиОстатки.Склад КАК Склад,
         |				СУММА(СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток) КАК Остаток
         |			ИЗ
         |				РегистрНакопления.СвободныеОстатки.Остатки(
         |						,
         |						Номенклатура В (&СпсНоменклатуры)
         |							И Склад В (&СпсСкладов)) КАК СвободныеОстаткиОстатки
         |			
         |			СГРУППИРОВАТЬ ПО
         |				СвободныеОстаткиОстатки.Номенклатура,
         |				СвободныеОстаткиОстатки.Характеристика,
         |				СвободныеОстаткиОстатки.Склад) КАК СвободныеОстатки
         |			ПО ОстаткиОрганизаций.Номенклатура = СвободныеОстатки.Номенклатура
         |				И ОстаткиОрганизаций.Характеристика = СвободныеОстатки.Характеристика
         |				И ОстаткиОрганизаций.МестоХранения = СвободныеОстатки.Склад
         |	
         |	СГРУППИРОВАТЬ ПО
         |		ОстаткиОрганизаций.Организация,
         |		ОстаткиОрганизаций.МестоХранения,
         |		ОстаткиОрганизаций.Номенклатура,
         |		ОстаткиОрганизаций.Характеристика
         |	
         |	ОБЪЕДИНИТЬ ВСЕ
         |	
         |	ВЫБРАТЬ
         |		ТоварыКПоступлениюОстатки.ДокументПоступления.Организация,
         |		ТоварыКПоступлениюОстатки.Склад,
         |		ТоварыКПоступлениюОстатки.Номенклатура,
         |		ТоварыКПоступлениюОстатки.Характеристика,
         |		СУММА(0),
         |		СУММА(0),
         |		СУММА(0),
         |		СУММА(ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток),
         |		СУММА(0),
         |		СУММА(0)
         |	ИЗ
         |		РегистрНакопления.ТоварыКПоступлению.Остатки(
         |				,
         |				Номенклатура В (&СпсНоменклатуры)
         |					И Склад В (&СпсСкладов)) КАК ТоварыКПоступлениюОстатки
         |	
         |	СГРУППИРОВАТЬ ПО
         |		ТоварыКПоступлениюОстатки.ДокументПоступления.Организация,
         |		ТоварыКПоступлениюОстатки.Склад,
         |		ТоварыКПоступлениюОстатки.Номенклатура,
         |		ТоварыКПоступлениюОстатки.Характеристика
         |	
         |	ОБЪЕДИНИТЬ ВСЕ
         |	
         |	ВЫБРАТЬ
         |		ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Организация,
         |		ТоварыКОтгрузкеОстатки.Склад,
         |		ТоварыКОтгрузкеОстатки.Номенклатура,
         |		ТоварыКОтгрузкеОстатки.Характеристика,
         |		СУММА(0),
         |		СУММА(0),
         |		СУММА(0),
         |		СУММА(0),
         |		СУММА(ТоварыКОтгрузкеОстатки.КОформлениюОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток),
         |		СУММА(ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
         |	ИЗ
         |		РегистрНакопления.ТоварыКОтгрузке.Остатки(
         |				,
         |				Номенклатура В (&СпсНоменклатуры)
         |					И НЕ ДокументОтгрузки.Ссылка = &ЗаказКлиента
         |					И Склад В (&СпсСкладов)) КАК ТоварыКОтгрузкеОстатки
         |	
         |	СГРУППИРОВАТЬ ПО
         |		ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Организация,
         |		ТоварыКОтгрузкеОстатки.Склад,
         |		ТоварыКОтгрузкеОстатки.Номенклатура,
         |		ТоварыКОтгрузкеОстатки.Характеристика) КАК ВложенныйЗапрос
         |
         |СГРУППИРОВАТЬ ПО
         |	ВложенныйЗапрос.Организация,
         |	ВложенныйЗапрос.Склад,
         |	ВложенныйЗапрос.Номенклатура,
         |	ВложенныйЗапрос.Характеристика
         |
         |УПОРЯДОЧИТЬ ПО
         |	Номенклатура,
         |	Склад,
         |	Организация"); 
	Запрос.УстановитьПараметр("СпсНоменклатуры",Объект.Товары.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("ЗаказКлиента",Объект.Ссылка); 
	Запрос.УстановитьПараметр("СпсСкладов",ЭтаФорма.смартСписокСкладов); 
	Рез=Запрос.Выполнить().Выгрузить();
	Если ПоРегистру Тогда
		ЗапросЗаказ=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаказыКлиентовОстатки.Номенклатура КАК Номенклатура,
			|	ЗаказыКлиентовОстатки.Характеристика КАК Характеристика,
			|	ЗаказыКлиентовОстатки.Склад КАК Склад,
			|	СУММА(ЗаказыКлиентовОстатки.ЗаказаноОстаток) КАК КоличествоУпаковок
			|ИЗ
			|	РегистрНакопления.ЗаказыКлиентов.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК ЗаказыКлиентовОстатки
			|СГРУППИРОВАТЬ ПО
			|	ЗаказыКлиентовОстатки.Номенклатура,
			|	ЗаказыКлиентовОстатки.Характеристика,
			|	ЗаказыКлиентовОстатки.Склад");
		ЗапросЗаказ.УстановитьПараметр("ЗаказКлиента",Объект.Ссылка);
		ТабТовары=ЗапросЗаказ.Выполнить().Выгрузить();
	Иначе
		//Для Каждого СтрОстДок Из ЭтаФорма.смартТаблицаСвобОстатков Цикл
		//	СтрРез=Рез.Добавить();
		//	СтрРез.Организация=СтрОстДок.Организация;
		//	СтрРез.Склад=СтрОстДок.Склад;
		//	СтрРез.Номенклатура=СтрОстДок.Номенклатура;
		//	СтрРез.Характеристика=СтрОстДок.Характеристика;
		//	СтрРез.Остаток=СтрОстДок.ВлияниеНаОстатки;
		//КонецЦикла;	
		Рез.Свернуть("Организация,Склад,Номенклатура,Характеристика","Остаток,СвобОстаток,ОргОстаток,ОжидаемыйПриход,ОжидаемыйРасход");
		ТабТовары=Объект.Товары.Выгрузить();
		ТабТовары.Свернуть("Склад,Номенклатура,Характеристика","КоличествоУпаковок");
	Конецесли;
	НомСтр=1;
	Для Каждого Стр Из ТабТовары Цикл
		Если НЕ (ЗначениеЗаполнено(Стр.Склад) И ЗначениеЗаполнено(Стр.Номенклатура)) Тогда
			Продолжить;	
		КонецЕсли;	
		СтрокиРез=Рез.НайтиСтроки(Новый Структура("Организация,Номенклатура,Характеристика",Объект.Организация,Стр.Номенклатура,Стр.Характеристика));		
		Если СтрокиРез.Количество()=0 Тогда
			СтрокиРезСклад=Рез.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));		
			Если СтрокиРезСклад.Количество()>0 Тогда 
				Нашли=Ложь;
				Для Каждого СтрРезСклад Из СтрокиРезСклад Цикл 
					Если (СтрРезСклад.Остаток+СтрРезСклад.ОжидаемыйПриход)>0 И СтрРезСклад.Организация<>Объект.Организация Тогда
						ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Номенклатура "+Стр.Номенклатура+" есть на складе "+СтрРезСклад.Склад+", организации "+СтрРезСклад.Организация+" в количестве "+СтрРезСклад.Остаток+" ожидается "+СтрРезСклад.ОжидаемыйПриход+"";
						Нашли=Истина;
					КонецЕсли;
				КонецЦикла;
				Если НЕ Нашли Тогда
					//ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Для номенклатуры "+Стр.Номенклатура+" отсутствуют остатки на складе "+Стр.Склад+"";	
				КонецЕсли;	
			Иначе	
				//ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Для номенклатуры "+Стр.Номенклатура+" отсутствуют остатки на складе "+Стр.Склад+"";
			КонецЕсли;	
		Иначе
			Если СтрокиРез[0].Остаток=0 Тогда
				СтрокиРезСклад=Рез.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));		
				Если СтрокиРезСклад.Количество()>0 Тогда
					Нашли=Ложь;
					Для Каждого СтрРезСклад Из СтрокиРезСклад Цикл 
						Если (СтрРезСклад.Остаток+СтрРезСклад.ОжидаемыйПриход)>0 И СтрРезСклад.Организация<>Объект.Организация Тогда
							ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Номенклатура "+Стр.Номенклатура+" есть на складе "+СтрРезСклад.Склад+", организации "+СтрРезСклад.Организация+" в количестве "+СтрРезСклад.Остаток+" ожидается "+СтрРезСклад.ОжидаемыйПриход+"";
							Нашли=Истина;
						КонецЕсли;
					КонецЦикла;
					Если НЕ Нашли Тогда
						//ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Для номенклатуры "+Стр.Номенклатура+" отсутствуют остатки на складе "+Стр.Склад+"";	
					КонецЕсли;	
				Иначе	
					//ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Для номенклатуры "+Стр.Номенклатура+" отсутствуют остатки на складе "+Стр.Склад+"";
				КонецЕсли;	
			Иначе
				СтрокиРезОрг=Рез.НайтиСтроки(Новый Структура("Организация,Номенклатура,Характеристика",Объект.Организация,Стр.Номенклатура,Стр.Характеристика));
				Если СтрокиРезОрг.Количество()>0 ТОгда 
					НашлиОстатки=0;
					Для Каждого СтрРезОрг Из СтрокиРезОрг Цикл
						НашлиОстатки=НашлиОстатки+СтрРезОрг.Остаток;	
					КонецЦикла;                                     
					Если НашлиОстатки<Стр.КоличествоУпаковок Тогда
						СтрокиРезСклад=Рез.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));		
						Для Каждого СтрРезСклад Из СтрокиРезСклад Цикл 
							Если (СтрРезСклад.Остаток+СтрРезСклад.ОжидаемыйПриход)>0 И СтрРезСклад.Организация<>Объект.Организация Тогда
								ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Номенклатура "+Стр.Номенклатура+" есть на складе "+СтрРезСклад.Склад+", организации "+СтрРезСклад.Организация+" в количестве "+СтрРезСклад.Остаток+" ожидается "+СтрРезСклад.ОжидаемыйПриход+"";
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;	
				Иначе
					СтрокиРез=Рез.НайтиСтроки(Новый Структура("Организация,Номенклатура,Характеристика",Объект.Организация,Стр.Номенклатура,Стр.Характеристика));
					Для Каждого СтрРезСклад Из СтрокиРез Цикл 
						Если (СтрРезСклад.Остаток+СтрРезСклад.ОжидаемыйПриход)>0 И СтрРезСклад.Склад<>Стр.Склад Тогда
							ТекстОтвета=ТекстОтвета+?(ТекстОтвета="","",Символы.ПС)+"Номенклатура "+Стр.Номенклатура+" есть на складе "+СтрРезСклад.Склад+", организации "+СтрРезСклад.Организация+" в количестве "+СтрРезСклад.Остаток+" ожидается "+СтрРезСклад.ОжидаемыйПриход+"";
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НомСтр=НомСтр+1;
	КонецЦикла;	
	
	Возврат ТекстОтвета;	
КонецФункции //-- #1351 смарт: Фролов 05.05.2023  

//++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах
&НаСервере
Процедура смартЗаполнитьТаблицуСвобождныхОстатковДляДокумента()
	Если НЕ Объект.Ссылка.Пустая() ТОгда
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|	СвободныеОстаткиОбороты.Регистратор.Организация КАК Организация,
			|	СвободныеОстаткиОбороты.Номенклатура КАК Номенклатура,
			|	СвободныеОстаткиОбороты.Характеристика КАК Характеристика,
			|	СвободныеОстаткиОбороты.Склад КАК Склад,
			|	СУММА(СвободныеОстаткиОбороты.ВРезервеПодЗаказОборот + СвободныеОстаткиОбороты.ВРезервеСоСкладаОборот - СвободныеОстаткиОбороты.ВНаличииРасход) КАК ВлияниеНаОстатки
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Обороты(, , Регистратор, ) КАК СвободныеОстаткиОбороты
			|ГДЕ
			|	СвободныеОстаткиОбороты.Регистратор = &ЗаказКлиента
			|
			|СГРУППИРОВАТЬ ПО
			|	СвободныеОстаткиОбороты.Регистратор.Организация,
			|	СвободныеОстаткиОбороты.Номенклатура,
			|	СвободныеОстаткиОбороты.Характеристика,
			|	СвободныеОстаткиОбороты.Склад"); 
		Запрос.УстановитьПараметр("ЗаказКлиента",Объект.Ссылка);
		ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "смартТаблицаСвобОстатков");
	КонецЕсли;
КонецПроцедуры //-- #1351 смарт: Фролов 05.05.2023 	

//++ #1351 смарт: Фролов 12.05.2023 //Разделение остатков по организациям в заказах 
&НаКлиенте
Процедура смартСвернутьРазвернутьОстаткиПоОрганизациям() Экспорт
	Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
	    Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Развернуть предупреждение. ВНИМАНИЕ! Есть ограничения по товарам организации";
		ЭтаФорма.смартГруппаОстаткиРазвернута=Ложь;
	Иначе
		Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение"; 
		ЭтаФорма.смартГруппаОстаткиРазвернута=Истина;
	КонецЕсли;
	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартГруппаОстаткиРазвернута;
КонецПроцедуры //-- #1351 смарт: Фролов 12.05.2023	

//++ #1351 смарт: Фролов 15.05.2023 //Разделение остатков по организациям в заказах  
&НаСервере
Функция смартПроверитьСериюПоОрганизации(Серия)
	Запрос=Новый Запрос("  ВЫБРАТЬ
			|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия КАК Серия,
			|	ТоварыОрганизацийОбороты.Организация КАК Организация,
			|	СУММА(ТоварыОрганизацийОбороты.КоличествоПриход) КАК Количество
			|ИЗ
			|	РегистрНакопления.ТоварыОрганизаций.Обороты КАК ТоварыОрганизацийОбороты
			|ГДЕ
			|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия = &Серия
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия,
			|	ТоварыОрганизацийОбороты.Организация");
	Запрос.УстановитьПараметр("Серия",Серия);
	Рез=Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество()>0 Тогда
		Нашли=Ложь;
		Для Каждого Стр Из Рез Цикл
			Если Стр.Организация=Объект.Организация ТОгда
				Нашли=Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Нашли ТОгда
			Возврат Ложь; 
		Иначе	
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Истина;	
КонецФункции //-- #1351 смарт: Фролов 15.05.2023

//++ #1351 смарт: Фролов 25.05.2023 //Разделение остатков по организациям в заказах 
&НаСервере
Функция смартПроверитьОстаткиПоСтрокеПоОрганизации(Номенклатура,Характеристика)
	Если Номенклатура.ТипНоменклатуры=Перечисления.ТипыНоменклатуры.Услуга 
		ИЛИ Номенклатура.ТипНоменклатуры=Перечисления.ТипыНоменклатуры.Работа ТОгда
		Возврат 10000000;
	КонецЕсли;	
		
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
			|	ВложенныйЗапрос.Характеристика КАК Характеристика,
			|	СУММА(ВЫБОР
			|			КОГДА ВложенныйЗапрос.Своб >= ВложенныйЗапрос.Орг
			|				ТОГДА ВложенныйЗапрос.Орг
			|			ИНАЧЕ ВложенныйЗапрос.Своб
			|		КОНЕЦ) КАК Остаток,
			|	СУММА(ВложенныйЗапрос.Своб) КАК СвобОстаток,
			|	СУММА(ВложенныйЗапрос.Орг) КАК ОргОстаток,
			|	СУММА(ВложенныйЗапрос.ОжидаемыйПриход) КАК ОжидаемыйПриход,
			|	СУММА(ВложенныйЗапрос.ОжидаемыйРасход) КАК ОжидаемыйРасход,
			|	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОстаткиОрганизаций.Организация КАК Организация,
			|		ОстаткиОрганизаций.Номенклатура КАК Номенклатура,
			|		ОстаткиОрганизаций.Характеристика КАК Характеристика,
			|		СУММА(0) КАК Остаток,
			|		СУММА(ЕСТЬNULL(СвободныеОстатки.Остаток, 0)) КАК Своб,
			|		СУММА(ЕСТЬNULL(ОстаткиОрганизаций.КоличествоОстаток, 0)) КАК Орг,
			|		СУММА(0) КАК ОжидаемыйПриход,
			|		СУММА(0) КАК ОжидаемыйРасход,
			|		СУММА(0) КАК Резерв
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ТоварыОрганизацийОстатки.Организация КАК Организация,
			|			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК МестоХранения,
			|			СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстаток
			|		ИЗ
			|			РегистрНакопления.ТоварыОрганизаций.Остатки(
			|					,
			|					АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
			|						И АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
			|						И АналитикаУчетаНоменклатуры.МестоХранения В (&СпсСкладов)
			|						И Организация = &Организация) КАК ТоварыОрганизацийОстатки
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ТоварыОрганизацийОстатки.Организация,
			|			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика,
			|			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
			|			ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения) КАК ОстаткиОрганизаций
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
			|				ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
			|				ТоварыНаСкладахОстатки.Склад КАК Склад,
			|				СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Остаток
			|			ИЗ
			|				РегистрНакопления.ТоварыНаСкладах.Остатки(
			|						,
			|						Номенклатура = &Номенклатура
			|							И Характеристика = &Характеристика
			|							И Склад В (&СпсСкладов)) КАК ТоварыНаСкладахОстатки
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ТоварыНаСкладахОстатки.Номенклатура,
			|				ТоварыНаСкладахОстатки.Характеристика,
			|				ТоварыНаСкладахОстатки.Склад) КАК СвободныеОстатки
			|			ПО ОстаткиОрганизаций.Номенклатура = СвободныеОстатки.Номенклатура
			|				И ОстаткиОрганизаций.Характеристика = СвободныеОстатки.Характеристика
			|				И ОстаткиОрганизаций.МестоХранения = СвободныеОстатки.Склад
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОстаткиОрганизаций.Организация,
			|		ОстаткиОрганизаций.Номенклатура,
			|		ОстаткиОрганизаций.Характеристика
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТоварыКПоступлениюОстатки.ДокументПоступления.Организация,
			|		ТоварыКПоступлениюОстатки.Номенклатура,
			|		ТоварыКПоступлениюОстатки.Характеристика,
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток),
			|		СУММА(0),
			|		СУММА(0)
			|	ИЗ
			|		РегистрНакопления.ТоварыКПоступлению.Остатки(
			|				,
			|				ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
			|					И Номенклатура = &Номенклатура
			|					И Характеристика = &Характеристика
			|					И Склад В (&СпсСкладов)
			|					И ДокументПоступления.Организация = &Организация) КАК ТоварыКПоступлениюОстатки
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТоварыКПоступлениюОстатки.ДокументПоступления.Организация,
			|		ТоварыКПоступлениюОстатки.Номенклатура,
			|		ТоварыКПоступлениюОстатки.Характеристика
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Организация,
			|		ТоварыКОтгрузкеОстатки.Номенклатура,
			|		ТоварыКОтгрузкеОстатки.Характеристика,
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(ТоварыКОтгрузкеОстатки.ВРезервеОстаток),
			|		СУММА(0)
			|	ИЗ
			|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
			|				,
			|				Номенклатура = &Номенклатура
			|					И Характеристика = &Характеристика
			|					И НЕ ДокументОтгрузки.Ссылка = &ЗаказКлиента
			|					И Склад В (&СпсСкладов)
			|					И ДокументОтгрузки.Организация = &Организация) КАК ТоварыКОтгрузкеОстатки
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Организация,
			|		ТоварыКОтгрузкеОстатки.Номенклатура,
			|		ТоварыКОтгрузкеОстатки.Характеристика
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗаказыНаСборкуОстатки.ЗаказНаСборку.Организация,
			|		ЗаказыНаСборкуОстатки.Номенклатура,
			|		ЗаказыНаСборкуОстатки.Характеристика,
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(ЗаказыНаСборкуОстатки.ЗаказаноОстаток),
			|		СУММА(0),
			|		СУММА(0)
			|	ИЗ
			|		РегистрНакопления.ЗаказыНаСборку.Остатки(
			|				,
			|				Номенклатура = &Номенклатура
			|					И Характеристика = &Характеристика
			|					И ЗаказНаСборку.Склад В (&СпсСкладов)
			|					И ЗаказНаСборку.Организация = &Организация) КАК ЗаказыНаСборкуОстатки
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ЗаказыНаСборкуОстатки.ЗаказНаСборку.Организация,
			|		ЗаказыНаСборкуОстатки.Номенклатура,
			|		ЗаказыНаСборкуОстатки.Характеристика
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ОстаткиПоЗаказам.ЗаказКлиента.Организация,
			|		ОстаткиПоЗаказам.Номенклатура,
			|		ОстаткиПоЗаказам.Характеристика,
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(0),
			|		СУММА(ВЫБОР
			|				КОГДА ОстаткиПоЗаказам.ЗаказаноОстаток > Заказы.КоличествоУпаковок
			|					ТОГДА Заказы.КоличествоУпаковок
			|				ИНАЧЕ ОстаткиПоЗаказам.ЗаказаноОстаток
			|			КОНЕЦ)
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЗаказыКлиентовОстатки.ЗаказКлиента КАК ЗаказКлиента,
			|			ЗаказыКлиентовОстатки.Номенклатура КАК Номенклатура,
			|			ЗаказыКлиентовОстатки.Характеристика КАК Характеристика,
			|			ЗаказыКлиентовОстатки.ЗаказКлиента.Организация КАК ЗаказКлиентаОрганизация,
			|			СУММА(ЗаказыКлиентовОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток,
			|			ЗаказыКлиентовОстатки.Склад КАК Склад
			|		ИЗ
			|			РегистрНакопления.ЗаказыКлиентов.Остатки(
			|					,
			|					Номенклатура = &Номенклатура
			|						И Характеристика = &Характеристика
			|						И НЕ ЗаказКлиента.Ссылка = &ЗаказКлиента
			|						И Склад В (&СпсСкладов)
			|						И ЗаказКлиента.Организация = &Организация) КАК ЗаказыКлиентовОстатки
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗаказыКлиентовОстатки.ЗаказКлиента,
			|			ЗаказыКлиентовОстатки.Номенклатура,
			|			ЗаказыКлиентовОстатки.Характеристика,
			|			ЗаказыКлиентовОстатки.ЗаказКлиента.Организация,
			|			ЗаказыКлиентовОстатки.Склад) КАК ОстаткиПоЗаказам
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|				ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|				ЗаказКлиентаТовары.Ссылка КАК Ссылка,
			|				СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
			|				ЗаказКлиентаТовары.Склад КАК Склад
			|			ИЗ
			|				Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|			ГДЕ
			|				ЗаказКлиентаТовары.ВариантОбеспечения В(&ВариантыОбеспечения)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ЗаказКлиентаТовары.Номенклатура,
			|				ЗаказКлиентаТовары.Характеристика,
			|				ЗаказКлиентаТовары.Ссылка,
			|				ЗаказКлиентаТовары.Склад) КАК Заказы
			|			ПО ОстаткиПоЗаказам.Номенклатура = Заказы.Номенклатура
			|				И ОстаткиПоЗаказам.Характеристика = Заказы.Характеристика
			|				И ОстаткиПоЗаказам.ЗаказКлиента = Заказы.Ссылка
			|				И ОстаткиПоЗаказам.Склад = Заказы.Склад
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОстаткиПоЗаказам.ЗаказКлиента.Организация,
			|		ОстаткиПоЗаказам.Номенклатура,
			|		ОстаткиПоЗаказам.Характеристика) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация,
			|	ВложенныйЗапрос.Номенклатура,
			|	ВложенныйЗапрос.Характеристика
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура,
			|	Организация
			|");
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ЗаказКлиента",Объект.Ссылка); 
	Запрос.УстановитьПараметр("СпсСкладов",ЭтаФорма.смартСписокСкладов);
	МасВаиантовОбеспечения=Новый Массив;
	МасВаиантовОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.СоСклада);
	МасВаиантовОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);
	Запрос.УстановитьПараметр("ВариантыОбеспечения",МасВаиантовОбеспечения);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		Возврат Выборка.Остаток+Выборка.ОжидаемыйПриход-Выборка.Резерв;
	Иначе	
		Возврат 0;
	КонецЕсли;	
КонецФункции	//-- #1351 смарт: Фролов 25.05.2023

//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
&НаСервере
Процедура смартОбновитьАдресДоставкиСамовывоз()

	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз 
	 ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда

		СтруктураНовыйАдресДоставки = смартОбщегоНазначения.смартПолучитьАдресСклада(Объект.Склад, Объект.Товары, Объект.АдресДоставки, Объект.СпособДоставки);
		
		//++#1578 смарт: Лопато 15.12.2023 //Ошибка в заказе клиента при изменении адреса доставки  
		СписокВыбора = Новый СписокЗначений;
		
		Для Каждого Стр Из СтруктураНовыйАдресДоставки.СкладыАдреса Цикл
			
			НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора, "АдресДоставки", Стр.АдресДоставки);
			
			Если НайденныйЭлементСЗ = Неопределено Тогда
				СтруктураВыбора = смартОбщегоНазначения.смартСтруктураВыбораАдресДоставки();
				ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
				СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
			Иначе
				смартОбщегоНазначения.смартДозаполнитьПустыеСвойстваАдресДоставки(НайденныйЭлементСЗ.Значение, Стр);
			КонецЕсли;
			
		КонецЦикла;
		
		СписокВыбораАдресДоставки = ЭтаФорма.Элементы.АдресДоставкиСамовывоз.СписокВыбора;
		
		СписокВыбораАдресДоставки.Очистить();
		Для Каждого Элемент Из СписокВыбора Цикл
			СписокВыбораАдресДоставки.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
		
		ТекущегоАдресаДоставкиНетВСписке = Истина;
		Для Каждого ЭлементСписка Из СписокВыбораАдресДоставки Цикл
			Если Объект.АдресДоставки = ЭлементСписка.Значение.АдресДоставки Тогда
           		ТекущегоАдресаДоставкиНетВСписке = Ложь;
			КонецЕсли;
		КонецЦикла;	
			
		Если СписокВыбораАдресДоставки.Количество() > 0 
			И ЗначениеЗаполнено(СтруктураНовыйАдресДоставки.АдресДоставки) 
			 И Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.Закрыт
			 И (НЕ ЗначениеЗаполнено(Объект.АдресДоставки) ИЛИ ТекущегоАдресаДоставкиНетВСписке) Тогда
			
			Объект.АдресДоставки 			  = СтруктураНовыйАдресДоставки.АдресДоставки;
			Объект.АдресДоставкиЗначение 	  = СтруктураНовыйАдресДоставки.АдресДоставкиЗначение; 
			Объект.АдресДоставкиЗначенияПолей = СтруктураНовыйАдресДоставки.АдресДоставкиЗначенияПолей;
			
			Сообщить("Адрес самовывоза (адрес доставки для печати) изменен на: " + СтруктураНовыйАдресДоставки.АдресДоставки);
			
		КонецЕсли;
		//--#1578 смарт: Лопато 15.12.2023
		
	//++#4426 смарт: Тимофеева 24.09.2025 / Заказ клиента. Обработка Заполнить доставку по клиенту. Доработка. Этап 2.
	////++ #Б-4024 смарт: Фролов 14.08.2025 //Адрес доставки до клиента в заказе клиента	
	//Иначе
	//	
	// 	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	ПартнерыКонтактнаяИнформация.Представление КАК АдресДоставки,
	//	|	ПартнерыКонтактнаяИнформация.Значение КАК АдресДоставкиЗначение,
	//	|	ПартнерыКонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
	//	|ИЗ
	//	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	//	|ГДЕ
	//	|	ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
	//	|	И ПартнерыКонтактнаяИнформация.Вид = &Вид");
	//	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	//	
	//	ВидАдресДоставки = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресДоставки", 
	//		Справочники.ВидыКонтактнойИнформации.СправочникПартнеры); 
	//	Запрос.УстановитьПараметр("Вид", ВидАдресДоставки);
	//	Результат = Запрос.Выполнить();
	//	Если Результат.Пустой() Тогда
	//	
	//		ВидАдресДоставкиАльтернативный = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресДоставкиАльтернативный", 
	//			Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
	//		Запрос.УстановитьПараметр("Вид", ВидАдресДоставкиАльтернативный);
	//		Результат = Запрос.Выполнить();
	//		Если Результат.Пустой() Тогда
	//		
	//			ВидАдрес = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
	//			Запрос.УстановитьПараметр("Вид", ВидАдрес);
	//			Результат = Запрос.Выполнить();
	//			Если Результат.Пустой() Тогда
	//				
	//				Объект.АдресДоставки 			  = Неопределено;
	//				Объект.АдресДоставкиЗначение 	  = Неопределено; 
	//				Объект.АдресДоставкиЗначенияПолей = Неопределено;
	//				ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента не найден!!!");
	//				
	//			Иначе
	//				
	//				Выборка = Результат.Выбрать();
	//				Если Выборка.Следующий() Тогда
	//			
	//					Если Объект.АдресДоставки <> Выборка.АдресДоставки Тогда
	//						ЗаполнитьЗначенияСвойств(Объект, Выборка);
	//						ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента изменен на : " + Объект.АдресДоставки);
	//					КонецЕсли;	
	//			
	//				КонецЕсли;	
	//				
	//			КонецЕсли;
	//		
	//		Иначе
	//		
	//			Выборка = Результат.Выбрать();
	//			Если Выборка.Следующий() Тогда
	//			
	//				Если Объект.АдресДоставки <> Выборка.АдресДоставки Тогда
	//					ЗаполнитьЗначенияСвойств(Объект, Выборка);
	//					ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента изменен на : " + Объект.АдресДоставки);
	//				КонецЕсли;	
	//			
	//			КонецЕсли;
	//		
	//		КонецЕсли;
	//		
	//	Иначе
	//		
	//		Выборка = Результат.Выбрать();
	//		Если Выборка.Следующий() Тогда
	//			
	//			Если Объект.АдресДоставки <> Выборка.АдресДоставки Тогда
	//				ЗаполнитьЗначенияСвойств(Объект, Выборка);
	//				ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента изменен на : " + Объект.АдресДоставки);
	//			КонецЕсли;	
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////-- #Б-4024 смарт: Фролов 14.08.2025 
	
	//++ #4690 смарт: Тимофеева 14.10.2025 / Ошибки в заказах: приоритет и доставка
	//Иначе
	//	ТаблицаАдресовДоставки = ПолучитьТаблицуАдресовДоставки();
	//	Если ТаблицаАдресовДоставки.Количество() > 0 Тогда
	//		Если НЕ Объект.АдресДоставки = ТаблицаАдресовДоставки[0].АдресДоставки Тогда
	//			//++ #4528 смарт: Тимофеева 14.10.2025 / Слетает заполненное поле Приоритет в заказе клиента 
	//			//ЗаполнитьЗначенияСвойств(Объект, ТаблицаАдресовДоставки[0]);
	//			ЗаполнитьЗначенияСвойств(Объект, ТаблицаАдресовДоставки[0], "АдресДоставки, АдресДоставкиЗначение, АдресДоставкиЗначенияПолей");
	//			//-- #4528 смарт: Тимофеева 14.10.2025
	//			ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента изменен на : " + Объект.АдресДоставки);
	//		КонецЕсли; 
	//	Иначе
	//		Объект.АдресДоставки 			  = "";
	//		Объект.АдресДоставкиЗначение 	  = ""; 
	//		Объект.АдресДоставкиЗначенияПолей = "";	
	//		ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента не найден!!!");
	//	КонецЕсли; 
	КонецЕсли; 
	//-- #4690 смарт: Тимофеева 14.10.2025
    //--#4426 смарт: Тимофеева 24.09.2025
	
КонецПроцедуры //--#1382 смарт: Лопато 21.06.2023

//++#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022
&НаСервереБезКонтекста
Функция смартПроверитьНаПрослеживаемостьНаСервере(ТоварСсылка)

	Возврат ТоварСсылка.КодТНВЭД.ПрослеживаемыйТовар;	

КонецФункции //--#895 смарт: Холопов П. 19.05.2022 //Доработано Демичевым 09122022

//++ #1436 смарт: Фролов 25.08.2023 //Проверка валюты в Заказе и Договоре при проведении 
&НаКлиенте
Процедура смартВыборВариантаИзменениеВалют(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = "Установить в договоре валюту "+Объект.Валюта+"" Тогда	
		смартИзменитьВалютуВДоговоре(Объект.Валюта);	
	ИначеЕсли Ответ = "Установить в заказе валюту "+Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Объект.Договор,"ВалютаВзаиморасчетов")+"" Тогда
		Объект.Валюта=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Объект.Договор,"ВалютаВзаиморасчетов");
		Если ЗначениеЗаполнено(Объект.Валюта) Тогда
			ВалютаПриИзмененииСервер(
				Объект.Валюта,
				ЦенообразованиеКлиент.НеобходимПересчетВВалюту(Объект,ВалютаДокумента));
			ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
		КонецЕсли;
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		ВалютаДокумента = Объект.Валюта;
		ЗаполнитьПорядокОплатыПоУмолчанию(); 
		смарт_ПриЧтенииСозданииНаСервере();
		ТолькоВалютаРеглУчета= смарт_ПроверкаВалютыСоглашения();
		Если НЕ ТолькоВалютаРеглУчета И Объект.смартБезвозмезднаяПередача Тогда
			ПредупреждениеБезвозНаКлиенте();
		КонецЕсли; 
		смартПроверитьИзменениеВалютыВЗаказеСайта();
		//++ #1436 смарт: Лопато 25.09.2023 //Проверка валюты в Заказе и Договоре при проведении 
		ЗаполнитьГруппуФинУчета();
		ОбщегоНазначенияКлиент.СообщитьПользователю("В заказ установлена валюта """ + СокрЛП(ВалютаДокумента) + """ из договора """ + СокрЛП(Объект.Договор));
		//-- #1436 смарт: Лопато 25.09.2023
	ИначеЕсли Ответ="Вернуться к редактированию заказа"	Тогда
		
	КонецЕсли;
	ЭтаФорма.смартВопросПроВалютуЗадан=Ложь; 
	ЭтаФорма.смартЖдемответаНаВопрос=Ложь;
КонецПроцедуры //-- #1436 смарт: Фролов 25.08.2023

//++ #1436 смарт: Фролов 25.08.2023 //Проверка валюты в Заказе и Договоре при проведении 
&НаСервере
Процедура смартИзменитьВалютуВДоговоре(Валюта)
	Об=Объект.Договор.ПолучитьОбъект();
	Об.ВалютаВзаиморасчетов=Валюта;
	//++ #1436 смарт: Лопато 25.09.2023 //Проверка валюты в Заказе и Договоре при проведении 
	ВалютаОплатыРегл = ?(Об.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте ИЛИ 
						 Об.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВВалюте, Ложь ,Неопределено);
	Об.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(Об.ВалютаВзаиморасчетов,,ВалютаОплатыРегл);
	Справочники.ДоговорыКонтрагентов.смартПроставитьГруппуФинансовогоУчета(Об);
	Попытка
		Об.Записать();
		ОбщегоНазначения.СообщитьПользователю("В договор """ + СокрЛП(Об.Ссылка) + """ установлена валюта """ + СокрЛП(Валюта) + """");
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать договор """ + СокрЛП(Об.Ссылка) + """!");
	КонецПопытки	
	//-- #1436 смарт: Лопато 25.09.2023
КонецПроцедуры  //-- #1436 смарт: Фролов 25.08.2023

//++#1261 смарт: Лопато 15.01.2024 //Доработка изменения Заказа клиента для ИМ  
&НаСервере
Функция смартПроверитьКонтрагентаЗаказВыгруженНаСайт(Контрагент);
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(Объект.Б_Идентификатор) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка = &Ссылка
			|	И Контрагенты.Партнер = &Партнер";
		
		Запрос.УстановитьПараметр("Ссылка",  Контрагент);
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
	   		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ выгружен на сайт, контрагента можно менять только на принадлежащего этому же партнеру """ 
															  + СокрЛП(Объект.Партнер) + """!", , "Объект.Контрагент");
			
			Результат = Ложь;
			
		КонецЕсли;	

	КонецЕсли;	
		
	Возврат Результат;	
	
КонецФункции //--#1261 смарт: Лопато 15.01.2024

//++ #1652 смарт: Ермаков 26.06.2024 / Доработка карточки Контрагента
&НаСервере
Процедура смартОпределитьВидимостьОтправлятьВсеДокументыЧерезЭДО() Экспорт
	
	//++ #1652 смарт: Ермаков 26.06.2024 / Доработка карточки Контрагента
	Если Не Элементы.Найти("смартОтправлятьВсеДокументыЧерезЭДО") = Неопределено Тогда
		
		Элементы.смартОтправлятьВсеДокументыЧерезЭДО.Видимость = 
			Объект.Ссылка.Контрагент.смартОтправлятьВсеДокументыЧерезЭДО;
		
	КонецЕсли;
	//-- #1652 смарт: Ермаков 26.06.2024
	
КонецПроцедуры

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Процедура смартСформироватьЗаголовокДополнительнойГарантии()

	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение)
		И ТипЗнч(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение) = Тип("Дата")
		И Объект.Дата >= Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение Тогда
		
		смартОбщегоНазначения.ИзменитьВидимостьЗаголовокДополнительнойГарантии(ЭтаФорма, 
			Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, СуммаСНДС"),
			Объект.Ссылка,
			Объект.Валюта);   
		
	КонецЕсли;
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024 

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
Процедура смартТекстДопУсловийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//++ #2059 смарт: Мосолов 19.09.2024 // Подсказка для документов Интерес и Заказ клиента при первоначальной продажи Доп. гарантии 
	Если СокрЛП(НавигационнаяСсылкаФорматированнойСтроки) = "?" Тогда  
		Элементы.смартГруппаПодсказкаДопГарантии.Показать();
		Возврат;
	КонецЕсли;
	//-- #2059 смарт: Мосолов 19.09.2024  
	
	МассивСтрок = СтрРазделить(НавигационнаяСсылкаФорматированнойСтроки, ";");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НомерСтроки", Число(МассивСтрок[0]));
	СтруктураПараметров.Вставить("МесяцевГарантии", МассивСтрок[1]);
	СтруктураПараметров.Вставить("Цена", МассивСтрок[2]);
	
	Оповещение = Новый ОписаниеОповещения("смартЗавершениеВопросаДобавлениеГарантии", 
		ЭтотОбъект,
		СтруктураПараметров);
		
	Товар = смартПолучитьНоменклатуруИзСтроки(Число(МассивСтрок[0]));
	
	ТекстВопроса = "Вы хотите добавить дополнительную гарантию для номенклатуры "
		+ Товар
		+ " сроком на "
		+ МассивСтрок[1] 
		+ " месяцев?";
		
	ПоказатьВопрос(Оповещение,
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
Процедура смартЗавершениеВопросаДобавлениеГарантии(Результат, ПараметрыВопроса) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

   смартДобавитьСтрокуГарантии(ПараметрыВопроса.НомерСтроки, ПараметрыВопроса.МесяцевГарантии, ПараметрыВопроса.Цена);
   
   смартСформироватьЗаголовокДополнительнойГарантии();   
   
   РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
   
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Функция смартПолучитьНоменклатуруИзСтроки(НомерСтроки) 
	
	Отбор = Новый Структура("НомерСтроки", НомерСтроки);
	
	СтрокиТоваров = Объект.Товары.НайтиСтроки(Отбор);
	
	Возврат СтрокиТоваров[0].Номенклатура;
	
КонецФункции //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Процедура смартДобавитьСтрокуГарантии(НомерСтроки, МесяцевГарантии, Цена) 
	
	СтрокаГарантии = Объект.Товары.Добавить();
	СтрокаГарантии.Номенклатура = Справочники.смартПредопределенныеЗначения.НоменклатураДополнительнойГарантии.Значение;
	
	Товар = смартПолучитьНоменклатуруИзСтроки(НомерСтроки);
	
	Цена = СтрЗаменить(Цена, " ", "");
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(
		Товар.Наименование + " - " + МесяцевГарантии + " мес. " + "(" + Товар.Код + ")"
		,
		,
		,
		СтрокаГарантии.Номенклатура.ВидНоменклатуры);
		
	Если Характеристика.Пустая() Тогда   
			
		Характеристика = смартСоздатьХарактеристикуДопГарантии(СтрокаГарантии.Номенклатура, 
			Товар.Наименование + " - " + МесяцевГарантии + " мес. " + "(" + Товар.Код + ")",
			МесяцевГарантии,
			Товар.Наименование + " - " + МесяцевГарантии + " мес."); 
			
		смартОбщегоНазначения.СоздатьУстановкуЦенДляДопГарантии(СтрокаГарантии.Номенклатура, Характеристика, Число(Цена), Объект.Дата);
			
	КонецЕсли;
		
	СтрокаГарантии.Характеристика = Характеристика;
	СтрокаГарантии.ВидЦены = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяRUB");
	СтрокаГарантии.КоличествоУпаковок = 1;
	СтрокаГарантии.Количество = 1;

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект); 
	
	КэшированныеЗначения = Новый Структура;
    КэшированныеЗначения.Вставить("ИспользоватьРучныеСкидкиВПродажах", Истина);
    КэшированныеЗначения.Вставить("ИспользоватьАвтоматическиеСкидкиВПродажах", Неопределено);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаГарантии.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаГарантии.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата, ПоДатеОтгрузки", Объект.НалогообложениеНДС, Объект.Дата, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", СтрокаГарантии.Склад, ПараметрыУказанияСерий));
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаГарантии, СтруктураДействий, КэшированныеЗначения);   
	
	СтрокаГарантии.Сумма = Число(Цена);
	
	ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();
	ПередачаТоваров = ОперацииПередачи.Найти(Объект.ХозяйственнаяОперация) <> Неопределено;

	СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект,
		ПередачаТоваров);
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаГарантии, СтруктураДействий, КэшированныеЗначения);   
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаСервере
Функция смартСоздатьХарактеристикуДопГарантии(Товар, НаименованиеХарактеристики, МесяцевГарантии, НаименованиеДляПечати)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	Характеристика.Владелец = Товар.ВидНоменклатуры;
	Характеристика.Наименование = НаименованиеХарактеристики;
	Характеристика.НаименованиеПолное = НаименованиеДляПечати;
	Характеристика.смартСрокГарантии = Число(МесяцевГарантии);
	Характеристика.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Характеристика.Ссылка;
	
КонецФункции //-- #1944 смарт: Мосолов 26.07.2024

//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьДоступностьЭлементовПоСтатусуСервер();

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();

	ОбновитьДубликатыЗависимыхРеквизитов();
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

	ОбновитьСостояниеСервер();
	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	ОбновитьОграничениеЗадолженности();

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	#Вставка 
	//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений&НаСервере
	Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение)
		И ТипЗнч(Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение) = Тип("Дата")
		И Объект.Дата >= Справочники.смартПредопределенныеЗначения.ДатаСтартаПредложенийДополнительнойГарантии.Значение Тогда
		
		РегистрыСведений.смартУчетСпециальныхПредложенийКлиентам.ЗаписатьНаборЗаписейПоГарантии(
			Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Характеристика, СуммаСНДС"),
			Объект.Ссылка,
			Объект.Валюта);   
		
	КонецЕсли;
	//-- #1960 смарт: Мосолов 08.08.2024   
	
	//++ #Б-1044 смарт: Мосолов 25.10.2024 //Закрыть бухгалтерии корректировку заказа клиента (ИТСМ 1270) 
	УстановитьВидимостьДоработанныхЭлементов();
	//-- #Б-1044 смарт: Мосолов 25.10.2024 
	#КонецВставки
	
	#Вставка
	//++ #2005 смарт: Фролов 26.08.2024 //Оповещение о необходимости привязать Интерес к Заказу срабатывает после привязки Интереса.
	Если Справочники.смартПредопределенныеЗначения.КонтролироватьНаличиеИнтересаВЗаказеКлиента.Значение = Истина
		И Объект.Дата > Дата("20240501") Тогда
		
		Если НЕ смартОбщегоНазначения.ПроверитьНаличиеИнтересаПоЗаказу(Объект.Ссылка) Тогда
			
			ЕстьОборудование = Ложь;
			
			СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментАппаратноеОбеспечение"); 
			ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментОборудование);
			МасОборудование = ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка");
			
			Для Каждого Стр Из Объект.Товары Цикл
				
				Если НЕ МасОборудование.Найти(Стр.Номенклатура) = Неопределено Тогда
					ЕстьОборудование = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			
			Если ЕстьОборудование Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Внимание! В данном заказе есть оборудование! Заказ должен быть создан на основании Интереса! 
				|Если вы не привяжете Интерес к заказу то не сможете напечатать счет!");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #2005 смарт: Фролов 26.08.2024
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	Элементы.смартРазрешенаБесплатнаяДоставка.Подсказка = ПолучитьТекстИнформацииОСогласованииБесплатнойДоставки();
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
	Элементы.смартРазрешенаДоставкаЗаПределыУстановленнойЗоны.Подсказка = ПолучитьТекстИнформацииОСогласованииДоставкиВнеЗоны();
	//-- #Б4868 смарт: Шляпников 12.11.2025
	
	//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	//-- #Б4002 смарт: Шляпников 26.08.2025
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры //-- #1960 смарт: Мосолов 08.08.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриОкончанииРедактирования")
Процедура смарт_ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если Не ОтменаРедактирования Тогда
		КешСтроки = ?(НоваяСтрока, Неопределено, ТоварыКешТекущейСтроки);
		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДатаОтгрузки) И Объект.НеОтгружатьЧастями
			И (КешСтроки = Неопределено Или КешСтроки.ДатаОтгрузки <> ТекущиеДанные.ДатаОтгрузки) Тогда
			ПриИзмененииДатыОтгрузкиВТабЧасти(); // вызов сервера.
		КонецЕсли;
		СкладыКлиент.ОбновитьТаблицуСкладов(ТаблицаСкладов, ТекущиеДанные, КешСтроки, СкладГруппа);
		ВсегоСкладов = ТаблицаСкладов.Количество();
		СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
		#Вставка
		//++#5006 смарт: Тимофеева 24.11.2025 / Отчет "Кто передал"
		Если Элемент.ТекущийЭлемент.Имя = "ТоварысмартКтоПередал" Тогда 
			Если НЕ ТекущиеДанные = Неопределено 
				И ЗначениеЗаполнено(Объект.Менеджер) 
				И ЗначениеЗаполнено(ТекущиеДанные.смартКтоПередал) 
				И Объект.Менеджер = ТекущиеДанные.смартКтоПередал Тогда
				
				ТекущиеДанные.смартКтоПередал = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
				ОбщегоНазначенияКлиент.СообщитьПользователю("В колонку ""Кто передал"" нельзя установить менеджера заказа", , "ТоварысмартКтоПередал", ТекущиеДанные);
				
			КонецЕсли;
		КонецЕсли;
        //--#5006 смарт: Тимофеева 24.11.2025 
		
		//++ #1319 смарт: Фролов 01.03.2023 //Ограничение количества продаж и отмена скидок
		Если НЕ (Элемент.ТекущийЭлемент.Имя="ТоварыХарактеристика" ИЛИ Элемент.ТекущийЭлемент.Имя="ТоварыСерия" ИЛИ Элемент.ТекущийЭлемент.Имя="ТоварыВариантОбеспечения" ИЛИ Элемент.ТекущийЭлемент.Имя="ТоварысмартКтоПередал" ИЛИ Элемент.ТекущийЭлемент.Имя="ТоварысмартКтоКонсультировал" //++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
			ИЛИ Элемент.ТекущийЭлемент.Имя="ТоварыСклад" ИЛИ Элемент.ТекущийЭлемент.Имя="ТоварыРекламноеВоздействие" ИЛИ Элемент.ТекущийЭлемент.Имя="ДатаОтгрузки" ИЛИ Элемент.ТекущийЭлемент.Имя="ЖелаемаяДатаОтгрузки") Тогда 
			//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
			смартПроверитьОтменитьСкидкуНаТоварКлиент(Объект, ТекущиеДанные);
		КонецЕсли;
		//-- #1319 смарт: Фролов 01.03.2023
		//--#1868 смарт: Лопато 19.06.2024 
		#КонецВставки
	КонецЕсли;

	Если ТекущиеДанные <> Неопределено И Объект.НеОтгружатьЧастями Тогда
		ТекущиеДанные.ДатаОтгрузки = Объект.ДатаОтгрузки;
	КонецЕсли;

	МногооборотнаяТараКлиент.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	#Вставка
	//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
	смартСформироватьЗаголовокДополнительнойГарантии();
	//-- #1944 смарт: Мосолов 26.07.2024 
    #КонецВставки   
	
	#Вставка
	//++ #1807 смарт: Мосолов 05.07.2024 //Расчет автоматических скидок при записи
	смартВопросПроСкидкиЗадан = Ложь;
	смартЖдемОтветаНаВопросПроСкидки = Ложь;
	//-- #1807 смарт: Мосолов 05.07.2024 
    #КонецВставки
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
	Истина, "Документ.ЗаказКлиента.Форма.ФормаДокумента.Событие.ОбработкаВыбора");

	Если ИсточникВыбора.ИмяФормы = "Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа" Тогда

		Детали = ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение);
		Если Детали.Ошибки <> Неопределено Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Детали.Ошибки);
		Иначе
			ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Детали.Оповещение);
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Перечисление.ВариантыОбеспечения.Форма.ВыборВариантаОбеспечения" Тогда

		Оповещение = ЗаполнитьВариантОбеспечения(ВыбранноеЗначение);
		ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);

		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.СостояниеОбеспечения.Форма.Форма" Тогда

		Оповещение = ЗаполнитьОбеспечениеЗаказа(ВыбранноеЗначение);
		ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);

		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ЗаказКлиента.Форма.РеквизитыПечати" Тогда

		Если ВыбранноеЗначение <> Неопределено Тогда
			Модифицированность = Истина;
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
		#Вставка
		//++ #3946 смарт: Шляпников 31.07.2025 / Настройка правил продаж чернил МАРАБУ (Ковчег)
		ПравильныеДанныеПоОрганизации = смартСервер.ПолучитьПравильнуюОрганизациюИСоглашениеПоЗаказу(Объект);
		Если ПравильныеДанныеПоОрганизации.Организация <> Объект.Организация Тогда
			УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации);
		КонецЕсли;
		//-- #3946 смарт: Шляпников 31.07.2025
		#КонецВставки

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда

		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда

		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда

		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия" Тогда

		СкорректироватьСтрокиЗаказа(ВыбранноеЗначение);

	КонецЕсли;
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	#Вставка
	
	//++ #2023 смарт: Ермаков 02.09.2024 / Ошибки в форме заказа клиента
	// Рефакторинг. Перенес код из перехвата события "смарт_ОбработкаВыбораПосле". Метод закомментировал.
	
	//смартКаратеев ++
    //Для каждого Строка Из Объект.Товары Цикл	
    //	смартЗаполнитьМинимальнуюЦенуПродажи(Строка);	
    //КонецЦикла;
	
	ПересчитатьТЧ_ТоварыВ_ВалютуУУ(Неопределено);
	//Каратеев --     
    
    //++ смарт:Подкин #946 23.03.2022 12:35:30
    Если РазницаТаблиц() Тогда  
        смартПроизвестиПроверкиВалюты();
    КонецЕсли;
    //-- смарт:Подкин #946 23.03.2022 12:35:30      
    
    //++ смарт:Подкин #1143 17.08.2022 11:00:01    
    Если НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда 
        Если ВыбранноеЗначение.Значение=ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка") Тогда 
            ТекСтрока=Элементы.Товары.ТекущиеДанные;
            Если ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить") Тогда
                //++ #1351 смарт: Фролов 25.05.2023 //Исправление обнаруженной ошибки  
				//смартИзменитьОбеспечение(ТекСтрока.КодСтроки);
				смартИзменитьОбеспечение(ТекСтрока.КодСтроки-1);
				//-- #1351 смарт: Фролов 25.05.2023
            КонецЕсли;
        КонецЕсли;
    КонецЕсли; 
    //-- смарт:Подкин #1143 17.08.2022 11:00:01  
    //++ #1351 смарт: Фролов 05.05.2023 //Разделение остатков по организациям в заказах 
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") И ВыбранноеЗначение.Свойство("Значение") И ТипЗнч(ВыбранноеЗначение.Значение)=Тип("СправочникСсылка.СерииНоменклатуры") ТОгда
		РезультатПроверки=смартПроверитьСериюПоОрганизации(ВыбранноеЗначение.Значение); 
		Если Не РезультатПроверки Тогда
			Сообщить("Серия "+ВыбранноеЗначение.Значение+" не принадлежит организации "+Объект.Организация+"");
			ТекСтрока=Элементы.Товары.ТекущиеДанные;
			ТекСтрока.Серия=Неопределено;	
		КонецЕсли;	
	КонецЕсли;
	//++ смарт:Каратеев 13.07.2023 //Закомментировал, так как не дает поставить резерв при очевидном наличии товара
	//Если ИсточникВыбора.ИмяФормы="Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа" ТОгда
	//	Если ТипЗнч(Элементы.Товары.Выделенныестроки) = Тип("Массив") И Элементы.Товары.Выделенныестроки.Количество()>0 ТОгда
	//		Для Каждого Стр Из Элементы.Товары.Выделенныестроки Цикл
	//			ТекСтрока=Объект.Товары[Стр];
	//			Если ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить")
	//				ИЛИ ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада") 
	//				ИЛИ ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов") Тогда
	//				РезультатПроверки=смартПроверитьОстаткиПоСтрокеПоОрганизации(ТекСтрока.Номенклатура,ТекСтрока.Характеристика);
	//				Если ТекСтрока.КоличествоУпаковок>РезультатПроверки Тогда
	//					Сообщить("Не достаточно товара "+ТекСтрока.Номенклатура+" в организации "+Объект.Организация+" доступно "+РезультатПроверки+"");
	//					смартИзменитьОбеспечение(ТекСтрока.НомерСтроки-1);
	//				КонецЕсли;	
	//			КонецЕсли;                                                     
	//		КонецЦикла;	
	//	КонецЕсли;
	//ИначеЕсли ИсточникВыбора.ИмяФормы="Перечисление.ВариантыОбеспечения.Форма.ВыборВариантаОбеспечения" ТОгда
	//	ТекСтрока=Элементы.Товары.ТекущиеДанные;
	//	Если ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить")
	//		ИЛИ ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада") 
	//		ИЛИ ТекСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ИзЗаказов") Тогда
	//		РезультатПроверки=смартПроверитьОстаткиПоСтрокеПоОрганизации(ТекСтрока.Номенклатура,ТекСтрока.Характеристика);
	//		Если ТекСтрока.КоличествоУпаковок>РезультатПроверки Тогда
	//			Сообщить("Не достаточно товара "+ТекСтрока.Номенклатура+" в организации "+Объект.Организация+" доступно "+РезультатПроверки+"");
	//			смартИзменитьОбеспечение(ТекСтрока.НомерСтроки-1);
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;
	//-- смарт:Каратеев 13.07.2023 //Закомментировал, так как не дает поставить резерв при очевидном наличии товара
	Элементы.смартОстаткиПоОрганизациям.Заголовок = смартУстановитьЗаголовокОстаткиПоОрганизациям();
	Элементы.смартГруппаОстаткиПоОрганизациям.Видимость=НЕ Элементы.смартОстаткиПоОрганизациям.Заголовок="";
	Если НЕ ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
    	Элементы.смартОстаткиПоОрганизациям.Видимость=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		ЭтаФорма.смартГруппаОстаткиРазвернута=ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий<>Элементы.смартОстаткиПоОрганизациям.Заголовок;
		Если ЭтаФорма.смартГруппаОстаткиРазвернута Тогда
			Элементы.смартНадписьОстаткиПоОрганизациям.Заголовок="Свернуть предупреждение";
		Конецесли;
	КонецЕсли;
	ЭтаФорма.смартНадписьОстаткиПоОрганизациямПредыдущий=Элементы.смартОстаткиПоОрганизациям.Заголовок;
	//-- #1351 смарт: Фролов 05.05.2023
	
	//++#1547 смарт: Лопато 12.12.2023 //Автоматическое заполнение серий чернил в заказах
	смартОбщегоНазначенияКлиент.смартПроверитьПоказатьПредупреждениеПоСериям(ВыбранноеЗначение, ИсточникВыбора);
	//--#1547 смарт: Лопато 12.12.2023
	
	//-- #2023 смарт: Ермаков 02.09.2024
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры

//++ #Б-2554 смарт: Лопато 04.03.2025 //Исправить алгоритм создания Интереса по онлайн заказам  
Функция ЭтоОнлайнЗаказБезИнтереса(ЗаказОбъект)
	
	Результат = Ложь;

	//Проверка активности функционала распределения и оповещения
	ФункционалВключен = Справочники.смартПредопределенныеЗначения.Настройки.РаспределениеЗаказовСайтаВключено;
	
	Если НЕ ФункционалВключен Тогда
		Возврат Результат;
	КонецЕсли;	
	
	//Проверка, что заказ не помечен на удаление и не отменен
	Если ЗаказОбъект.ПометкаУдаления
		 ИЛИ (ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт
			 	И ЗаказОбъект.СуммаДокумента = 0) Тогда
				
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента) КАК Заказ
	|ПОМЕСТИТЬ ОнлайнЗаказы
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения
	|ГДЕ
	|   ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента) = &Заказ
	|	И Свойство = &Свойство
	|	И Значение = &Значение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ДокументОснование КАК Документ.ЗаказКлиента) КАК Заказ
	|ПОМЕСТИТЬ Обработанные
	|ИЗ
	|	Документ.смартЛид
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОнлайнЗаказы 
	|		ПО ((ВЫРАЗИТЬ(ДокументОснование КАК Документ.ЗаказКлиента)) = ОнлайнЗаказы.Заказ)
	|			И (НЕ ПометкаУдаления)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОнлайнЗаказы.Заказ КАК Заказ
	|ИЗ
	|	ОнлайнЗаказы КАК ОнлайнЗаказы	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обработанные КАК Обработанные
	|		ПО (ОнлайнЗаказы.Заказ = Обработанные.Заказ)
	|ГДЕ		
	|	Обработанные.Заказ ЕСТЬ NULL";
	
	СвойствоОффлайнЗаказ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ОффлайнЗаказ");
    ЗначениеОффлайнЗаказ = "N";
	
	Запрос.УстановитьПараметр("Свойство", СвойствоОффлайнЗаказ);
	Запрос.УстановитьПараметр("Значение", ЗначениеОффлайнЗаказ);
	Запрос.УстановитьПараметр("Заказ", 	  ЗаказОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЦФО 	 = Справочники.смартПредопределенныеЗначения.Настройки.РаспределениеЗаказовСайтаБизнесРегионЦФО;
		СуммаЦФО = Справочники.смартПредопределенныеЗначения.Настройки.РаспределениеЗаказовСайтаСуммаЦФО;

		ЗаказБизнесРегион = ЗаказОбъект.Партнер.БизнесРегион;
		
		Если НЕ (ЗаказОбъект.СуммаДокумента <= СуммаЦФО
				 И (ЗаказБизнесРегион = ЦФО ИЛИ ЗаказБизнесРегион.ПринадлежитЭлементу(ЦФО))) Тогда
				 
			Результат = Истина;
			
		КонецЕсли;	
				 
	КонецЕсли;	

	Возврат Результат;
				
КонецФункции //-- #Б-2554 смарт: Лопато 04.03.2025

//++ #3946 смарт: Шляпников 31.07.2025 / Настройка правил продаж чернил МАРАБУ (Ковчег)
&НаСервере
Процедура УстановитьПравильнуюОрганизациюИСоглашение(ПравильныеДанныеПоОрганизации)
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Произведена замена организации С %1 на %2 и замена соглашения с %3 на %4", 
													 Объект.Организация, 
													 ПравильныеДанныеПоОрганизации.Организация, 
													 Объект.Соглашение, 
													 ПравильныеДанныеПоОрганизации.Соглашение));
													 
	Объект.Организация = ПравильныеДанныеПоОрганизации.Организация;
	Объект.Соглашение = ПравильныеДанныеПоОрганизации.Соглашение;
	
	ОрганизацияПриИзмененииСервер();
	
	Если Не ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ПоСоглашениюИспользуютсяДоговорыКонтрагентов = Ложь;
		Возврат;
	КонецЕсли;
	
	СоглашениеПриИзмененииСервер();
	
КонецПроцедуры
//-- #3946 смарт: Шляпников 31.07.2025

//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
&НаСервере
Функция ПолучитьТекстИнформацииОСогласованииБесплатнойДоставки()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.смартИДРазрешенияНаБесплатнуюДоставку) Тогда
		Возврат "Нет информации о разрешении";
	Иначе
		
		ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Объект.Ссылка, Объект.смартИДРазрешенияНаБесплатнуюДоставку, "БесплатнаяДоставка");
		
		Если ДанныеОРазрешении <> Неопределено Тогда
			Возврат СтрШаблон("Разрешение %1 пользователем %2 %3", ?(ДанныеОРазрешении.Разрешено, "установлено", "снято"), ДанныеОРазрешении.Ответственный, ДанныеОРазрешении.ДатаИзменения);
		КонецЕсли;
		
		Возврат "Нет информации о разрешении";
		
	КонецЕсли;
	
КонецФункции

//++ #Б4868 смарт: Шляпников 12.11.2025 / Документ заказ клиента. Разделение контроля доставки. 
&НаСервере
Функция ПолучитьТекстИнформацииОСогласованииДоставкиВнеЗоны()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.смартИДРазрешенияНаДоставкуВнеЗоны) Тогда
		Возврат "Нет информации о разрешении";
	Иначе
		
		ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Объект.Ссылка, Объект.смартИДРазрешенияНаДоставкуВнеЗоны, "ДоставкаВнеЗоны");
		
		Если ДанныеОРазрешении <> Неопределено Тогда
			Возврат СтрШаблон("Разрешение %1 пользователем %2 %3", ?(ДанныеОРазрешении.Разрешено, "установлено", "снято"), ДанныеОРазрешении.Ответственный, ДанныеОРазрешении.ДатаИзменения);
		КонецЕсли;
		
		Возврат "Нет информации о разрешении";
		
	КонецЕсли;
	
КонецФункции

//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
&НаСервере
Функция ДоставкаРассчитана()
	
	Возврат Документы.ЗаказКлиента.ДоставкаРассчитана(Объект) 
			И смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("КонтроллироватьСтоимостьДоставкиРасходки")
			И Объект.Дата >= смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаПроверкиСтоимостиДоставкиРасходки");
			
КонецФункции

//++ #Б4274 смарт: Шляпников 04.09.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки. Дополнения.
&НаКлиенте
Процедура смартАвтоподборАдресаДоставки(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

//++ #Б4274 смарт: Шляпников 04.09.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки. Дополнения.
&НаСервере
Функция КонтактнаяИнформацияВXML(ЗначенияПолей)
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(ЗначенияПолей);
	
КонецФункции

//++ #4426 смарт: Тимофеева 24.09.2025 / Заказ клиента. Обработка Заполнить доставку по клиенту. Доработка. Этап 2.
&НаСервере
Процедура ЗаполнитьСпискиВыбораАдресовДоставки()
	Элементы.АдресДоставкиПолучателя.СписокВыбора.Очистить();
	Элементы.АдресДоставкиПолучателя1.СписокВыбора.Очистить();
	Элементы.АдресДоставкиПолучателя2.СписокВыбора.Очистить();
	
	Для Каждого СтрокаАдреса Из ПолучитьТаблицуАдресовДоставки() Цикл		
		СтруктураВыбора = Новый Структура;
		СтруктураВыбора.Вставить("АдресДоставки", "");
		СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
		СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
		СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
		СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
		СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
		
		ЗаполнитьЗначенияСвойств(СтруктураВыбора, СтрокаАдреса);
		ПредставлениеАдресаДоставки = СтрШаблон("%1: %2", СтрокаАдреса.Вид, СтрокаАдреса.АдресДоставки);
		Элементы.АдресДоставкиПолучателя.СписокВыбора.Добавить(СтруктураВыбора, ПредставлениеАдресаДоставки);
		Элементы.АдресДоставкиПолучателя1.СписокВыбора.Добавить(СтруктураВыбора, ПредставлениеАдресаДоставки);
		Элементы.АдресДоставкиПолучателя2.СписокВыбора.Добавить(СтруктураВыбора, ПредставлениеАдресаДоставки);
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция ПолучитьТаблицуАдресовДоставки()	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Партнер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партнеры.смартПартнерАдресДоставки КАК АдресДоставки,
	//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
	|	Партнеры.смартПартнерАдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	Партнеры.смартПартнерАдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	//-- #Б4248 смарт: Шляпников 16.09.2025
	|	0 КАК Приоритет,
	|	""Адрес доставки (по умолчанию)"" КАК Вид,
	|   ИСТИНА КАК ПоУмолчанию
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	НЕ Партнеры.смартПартнерАдресДоставки = """"
	|	И Партнеры.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Представление,
	|	ПартнерыКонтактнаяИнформация.Значение,
	|	ПартнерыКонтактнаяИнформация.ЗначенияПолей,
	|	ВЫБОР
	|		КОГДА ПартнерыКонтактнаяИнформация.Вид = &АдресДоставки
	|			ТОГДА 1
	|		КОГДА ПартнерыКонтактнаяИнформация.Вид = &АдресДоставкиАльтернативный
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	ПартнерыКонтактнаяИнформация.Вид,
	|   ЛОЖЬ КАК ПоУмолчанию
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Ссылка = &Ссылка
	|	И ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("АдресДоставки", Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресДоставки", 
													Справочники.ВидыКонтактнойИнформации.СправочникПартнеры));
	Запрос.УстановитьПараметр("АдресДоставкиАльтернативный", Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресДоставкиАльтернативный", 
													Справочники.ВидыКонтактнойИнформации.СправочникПартнеры));
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаАдресов = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаАдреса Из ТаблицаАдресов Цикл
		
		//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки
		Если СтрокаАдреса.Приоритет = 0 И НЕ ЗначениеЗаполнено(СтрокаАдреса.АдресДоставкиЗначение) Тогда
		//-- #Б4248 смарт: Шляпников 16.09.2025
			
			НайденныеСтроки = ТаблицаАдресов.НайтиСтроки(Новый Структура("АдресДоставки, ПоУмолчанию", СтрокаАдреса.АдресДоставки, Ложь));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаАдреса.АдресДоставкиЗначение 		= НайденныеСтроки[0].АдресДоставкиЗначение;
				СтрокаАдреса.АдресДоставкиЗначенияПолей = НайденныеСтроки[0].АдресДоставкиЗначенияПолей;
				
			Иначе
				
				АдресПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияПоПредставлению(СтрокаАдреса.АдресДоставки, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
				СтрокаАдреса.АдресДоставкиЗначение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(АдресПоПолям);
				СтрокаАдреса.АдресДоставкиЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзJSONВXML(СтрокаАдреса.АдресДоставкиЗначение, 
																	Перечисления.ТипыКонтактнойИнформации.Адрес);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаАдресов;
	
КонецФункции //-- #4426 смарт: Тимофеева 24.09.2025

//++ #4590 смарт: Тимофеева 08.10.2025 / Цена в долларах, информационно, в заказах клиента
&НаСервере
Процедура УстановитьВидимостьКолонокЦенВВалютеНаСервере()
	
	ПродажаВРублях = НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение = Неопределено 
							И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
	
	Если ПродажаВРублях И (НЕ ПользовательПолный() И НЕ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
		Элементы.ТоварыСмартКонвертацияЦены.Видимость = Ложь;		
		Элементы.ТоварыЦенаВВалюте.Видимость = Ложь; 
	КонецЕсли; 
	
	Если НЕ ПродажаВРублях ИЛИ ПользовательПолный() ИЛИ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте") Тогда
		ВалютаUSD = Справочники.Валюты.НайтиПоКоду("840"); 	
		Элементы.ТоварыСмартКонвертацияЦены.Видимость = Объект.Валюта = ВалютаUSD;
		Элементы.ТоварыЦенаВВалюте.Видимость = НЕ Объект.Валюта = ВалютаUSD;				
    КонецЕсли; 

КонецПроцедуры
//-- #4590 смарт: Тимофеева 08.10.2025

//++ #4690 смарт: Тимофеева 14.10.2025 / Ошибки в заказах: приоритет и доставка 
&НаСервере
Процедура смартОбновитьАдресДоставкиПоКлиенту()

	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз 
	 	ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда
		Возврат;
	КонецЕсли;

	ТаблицаАдресовДоставки = ПолучитьТаблицуАдресовДоставки();
	Если ТаблицаАдресовДоставки.Количество() > 0 Тогда
		Если НЕ Объект.АдресДоставки = ТаблицаАдресовДоставки[0].АдресДоставки Тогда
			ЗаполнитьЗначенияСвойств(Объект, ТаблицаАдресовДоставки[0], "АдресДоставки, АдресДоставкиЗначение, АдресДоставкиЗначенияПолей");
			ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента изменен на : " + Объект.АдресДоставки);
		КонецЕсли; 
	Иначе
		Объект.АдресДоставки 			  = "";
		Объект.АдресДоставкиЗначение 	  = ""; 
		Объект.АдресДоставкиЗначенияПолей = "";	
		ОбщегоНазначения.СообщитьПользователю("Адрес доставки до клиента не найден!!!");
	КонецЕсли; 
	
КонецПроцедуры 
//-- #4690 смарт: Тимофеева 14.10.2025

//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
&НаКлиенте
Процедура смартПриИзмененииТовары(Элемент)
	
	РассчитатьПараметрыДоставки();
	смартПриИзмененииТоварыСервер();
	РассчитатьАкции();
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	
	Объект.СкидкиРассчитаны = Истина;
	
	//++ #Б5016 смарт: Шляпников 02.12.2025 / Снова не обновляется график платежей при добавлении наценки по доставке
	ПересчитатьСуммуГрафикаОплаты();
	//-- #Б5016 смарт: Шляпников 02.12.2025
	
КонецПроцедуры

//++ #Б4762 смарт: Шляпников 24.10.2025 / Документ Заказ клиента. Доставка. Корректировка алгоритма контроля платной доставки.
&НаСервере
Процедура смартПриИзмененииТоварыСервер()
	
	РассчитатьПараметрыДоставки();
	СкидкиНаценкиСервер.ОтменитьСкидки(Объект, "Товары", Истина,, Истина);
	
	ОбщегоНазначения.СообщитьПользователю("Автоматически рассчитанные скидки/наценки отменены. Необходимо применить нужные скидки заново !");
	
	//СтруктураПараметры = Новый Структура;
	//СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	//СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	//СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	//СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	//
	//СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	
КонецПроцедуры

//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
&НаКлиенте
Процедура смартОбновитьПараметрыДляРасчетаДоставки(Команда)
	
	РассчитатьПараметрыДоставки();
	
КонецПроцедуры

//++ #Б4316 смарт: Шляпников 14.10.2025 / Доставка в 1С. Расчет тарифа. Корректировка алгоритма в 1С.
&НаСервере
Процедура РассчитатьПараметрыДоставки()
	
	ВесЗаказа = смартОбщегоНазначения.ПолучитьВесЗаказа(Объект);
	ЭтаФорма.смартВесЗаказа = Макс(ВесЗаказа.ВесНетто, ВесЗаказа.ВесБрутто);
	ПараметрыАдресаЗаполнены = Ложь;
	ЭтаФорма.смартБылаОшибкаРасчетаДоставки = Ложь;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
	
		Если ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
			
			ДанныеАдреса = смартИнтеграцияDaData.ВыполнитьЗапросПолучитьИнформациюПоАдресу(Объект.АдресДоставки);
			Если ТипЗнч(ДанныеАдреса) = Тип("Массив") И ДанныеАдреса.Количество() > 0 Тогда
				
				Если ТипЗнч(ДанныеАдреса[0]) = Тип("Структура") Тогда
					
					Если ДанныеАдреса[0].Свойство("beltway_hit") И ЗначениеЗаполнено(ДанныеАдреса[0].beltway_hit) Тогда
						ЭтаФорма.смартРегион = ДанныеАдреса[0].beltway_hit;
						ПараметрыАдресаЗаполнены = Истина;
					ИначеЕсли ДанныеАдреса[0].Свойство("region") И ЗначениеЗаполнено(ДанныеАдреса[0].region) Тогда
						ЭтаФорма.смартРегион = ДанныеАдреса[0].region;
						ПараметрыАдресаЗаполнены = Истина;
					Иначе
						ЭтаФорма.смартРегион = "";
					КонецЕсли;
					
					Если ДанныеАдреса[0].Свойство("city") Тогда
						ЭтаФорма.смартГород = ДанныеАдреса[0].city;
						ПараметрыАдресаЗаполнены = Истина;
					Иначе
						ЭтаФорма.смартГород = "";
					КонецЕсли;
					
					Если ДанныеАдреса[0].Свойство("beltway_distance") Тогда
						ЭтаФорма.смартРасстояние = ДанныеАдреса[0].beltway_distance;
						ПараметрыАдресаЗаполнены = Истина;
					Иначе
						ЭтаФорма.смартРасстояние = 0;
					КонецЕсли;
					
				Иначе
					ЭтаФорма.смартБылаОшибкаРасчетаДоставки = Истина;
				КонецЕсли;
				
			Иначе
				ЭтаФорма.смартБылаОшибкаРасчетаДоставки = Истина;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ПараметрыАдресаЗаполнены Тогда
		
		ЭтаФорма.смартРегион = "";
		ЭтаФорма.смартГород = "";
		ЭтаФорма.смартРасстояние = 0;
		
	КонецЕсли;
	
	Если ЭтаФорма.смартБылаОшибкаРасчетаДоставки Тогда
		ОбщегоНазначения.СообщитьПользователю("Была ошибка получения информации для расчета доставки от сервиса DaData. Обновите принудительно информацию для расчета доставки",, "смартОбновитьПараметрыДляРасчетаДоставки");
	КонецЕсли;
	
КонецПроцедуры

//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом
&НаСервере
Функция ПроверитьТребованияДополнительнойКомплектацииСублимационногоОборудования()
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяВывестиУведомлениеМенеджеру", Ложь);
	Результат.Вставить("ТекстУведомления", "");
	
	ТаблицаОборудования = смартСервер.ПолучитьТаблицуСублимационногоОборудования(Объект.Товары.Выгрузить(, "Номенклатура, Склад"), Объект.Склад);
	Если ТаблицаОборудования.Количество() > 0 Тогда
		КаталогСсылка = смартСервер.ПолучитьКаталогДляКомплектацииОборудования();
		Если ЗначениеЗаполнено(КаталогСсылка) Тогда 		
			МассивСкладов = ТаблицаОборудования.ВыгрузитьКолонку("Склад");
					
			ЗаказНаВнутреннееПотребление = Неопределено;
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				ЗаказНаВнутреннееПотребление = смартСервер.ПолучитьЗаказНаВнутренееПотребление(Объект.Ссылка, КаталогСсылка);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЗаказНаВнутреннееПотребление) Тогда 			
				ОстаткиКаталогаНаСкладах = смартСервер.ПолучитьОстаткиНоменклатурыНаСкладах(КаталогСсылка, МассивСкладов, 
																?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса())); 
				Если ОстаткиКаталогаНаСкладах.Количество() = 0 Тогда 
					Результат.ТребуетсяВывестиУведомлениеМенеджеру = Истина;
					Результат.ТекстУведомления = СтрШаблон("Оформите передачу каталога ""%1"" на склад %2", КаталогСсылка, МассивСкладов[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

//-- #2552 смарт: Тимофеева 20.10.2025

//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
&НаСервере
Процедура ЗаполнитьДанныеОМаксимальнойСкидке(МассивСтрок = Неопределено)
	
	Если МассивСтрок = Неопределено Тогда
		Строки = Объект.Товары;
	Иначе
		
		Строки = Новый Массив;
		Для каждого стрМассивСтрок Из МассивСтрок Цикл
			Строки.Добавить(Объект.Товары.НайтиПоИдентификатору(стрМассивСтрок));
		КонецЦикла;
		
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для каждого стр Из Строки Цикл
		МассивНоменклатуры.Добавить(стр.Номенклатура);
	КонецЦикла;
	
	ДанныеОСкидках = смартАкцииИСкидки.ПолучитьМаксимальныеСкидкиДляМассиваНоменклатуры(Объект.Дата, МассивНоменклатуры, Объект.Организация, Объект.Партнер);
	
	Для каждого стр Из Строки Цикл
		
		НайденныеСтроки = ДанныеОСкидках.НайтиСтроки(Новый Структура("Номенклатура", стр.Номенклатура));
		
		Если НайденныеСтроки.Количество() > 0 И НЕ НайденныеСтроки[0].Отменена Тогда
			
			Если НЕ НайденныеСтроки[0].СкидкаЗапрещена Тогда
				
				стр.смартТекстМаксимальнаяСкидка = СтрШаблон("Мак. скидка %1%%", НайденныеСтроки[0].МаксимальнаяСкидка);
				стр.смартМаксимальнаяСкидка = НайденныеСтроки[0].МаксимальнаяСкидка;
				
			Иначе
				
				стр.смартТекстМаксимальнаяСкидка = "Финальная цена";
				стр.смартМаксимальнаяСкидка = 0;
				
			КонецЕсли;
			
		Иначе
			
			стр.смартТекстМаксимальнаяСкидка = "";
			стр.смартМаксимальнаяСкидка = 10000;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РассчитатьПревышенияМаксимальнойСкидки(МассивСтрок);
	
КонецПроцедуры

//++ #Б5008 смарт: Шляпников 20.11.2025 / Создание механизма контроля максимальных скидок.
&НаСервере
Процедура РассчитатьПревышенияМаксимальнойСкидки(МассивСтрок = Неопределено)
	
	Если МассивСтрок = Неопределено Тогда
		Строки = Объект.Товары;
	Иначе
		
		Строки = Новый Массив;
		Для каждого стрМассивСтрок Из МассивСтрок Цикл
			Строки.Добавить(Объект.Товары.НайтиПоИдентификатору(стрМассивСтрок));
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого стр Из Строки Цикл
		
		стр.смартМаксимальнаяСкидкаПревышена = (стр.ПроцентРучнойСкидки > стр.смартМаксимальнаяСкидка);
		
	КонецЦикла;
	
КонецПроцедуры

//++ #Б6458 смарт: Шляпников 15.04.2026 / Проверить механизм назначения скидок
&НаСервере
Процедура ПроверитьВозможностьНазначенияРучнойСкидки(ИДСтроки, НеПересчитыватьСкидку = Ложь)
	
	Если Объект.смартРазрешитьПовышеннуюСкидку ИЛИ Пользователи.РолиДоступны("смартРазрешитьСкидкуБольшеМаксимальной") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ИДСтроки);
	Если ТекущаяСтрока.ПроцентРучнойСкидки > ТекущаяСтрока.смартМаксимальнаяСкидка Тогда
		
		ТекущаяСтрока.ПроцентРучнойСкидки = ТекущаяСтрока.смартМаксимальнаяСкидка;
		ТекущаяСтрока.смартМаксимальнаяСкидкаПревышена = Ложь; 
		
		Если НЕ НеПересчитыватьСкидку Тогда
			
			КэшированныеЗначения = Неопределено;
			
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			
			РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #5006 смарт: Тимофеева 24.11.2025 / Отчет "Кто передал"
&НаКлиенте
Процедура смарт_МенеджерПриИзмененииПосле(Элемент)
	Для Каждого СтрокаТовары Из Объект.Товары Цикл     	
		Если ЗначениеЗаполнено(Объект.Менеджер)
			И ЗначениеЗаполнено(СтрокаТовары.смартКтоПередал) 
			И Объект.Менеджер = СтрокаТовары.смартКтоПередал Тогда 
			СтрокаТовары.смартКтоПередал = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
			ОбщегоНазначенияКлиент.СообщитьПользователю("В колонке ""Кто передал"" очищено значение, совпадающее с менеджером заказа");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Процедура ОбновитьЗаголовокИВидимостьКнопкиПодбораАкций()
	
	ПараметрыАкции = Новый Структура;
	ПараметрыАкции.Вставить("Организация", Объект.Организация);
	
	ТЗАкций = смартАкцииИСкидки.ПолучитьДействующиеАкции(ТекущаяДата(), ПараметрыАкции);
	
	Элементы.смартОткрытьПодборАкций.Заголовок = СтрШаблон("Текущие акции - %1", Формат(ТЗАкций.Количество(), "ЧГ="));
	Элементы.смартОткрытьПодборАкций.Видимость = (ТЗАкций.Количество() > 0);
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Функция ПоместитьТаблицуАкцийДокументаВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.смартАкции.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаКлиенте
Процедура смартОткрытьПодборАкций(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("АдресТаблицыАкций", ПоместитьТаблицуАкцийДокументаВоВременноеХранилище());
	
	ОткрытьФорму("Документ.смартУправлениеАкциями.Форма.ТекущиеАкции", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("смартПодборАкцийЗавершение", ЭтаФорма));
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаКлиенте
Процедура смартПодборАкцийЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		Если ЭтоАдресВременногоХранилища(Значение) Тогда
			
			МасивНовыхСтрок = смартПодборАкцийЗавершениеСервер(Значение);
			
			Для каждого НоваяСтрока Из МасивНовыхСтрок Цикл 
				
				Элементы.Товары.ТекущаяСтрока = НоваяСтрока;
				
				ТоварыНоменклатураПриИзменении(Элементы.ТоварыНоменклатура);
				смарт_ТоварыНоменклатураПриИзмененииПосле(Элементы.ТоварыНоменклатура);
				
				ТоварыСерияПриИзменении(Элементы.ТоварыСерия);
				
				смарт_ТоварыКоличествоУпаковокПриИзмененииПеред(Элементы.ТоварыКоличествоУпаковок);
				ТоварыКоличествоУпаковокПриИзменении(Элементы.ТоварыКоличествоУпаковок);
				
			КонецЦикла;
			
			РассчитатьАкции();
			ПересчитатьСуммуГрафикаОплаты();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Функция смартПодборАкцийЗавершениеСервер(Адрес) Экспорт
	
	ТЗ = ПолучитьИзВременногоХранилища(Адрес);
	Объект.смартАкции.Загрузить(ТЗ);
	
	МасивНовыхСтрок = Новый Массив;
	
	Количество = Объект.смартАкции.Количество();
	Для н = 1 По Количество Цикл
		
		стрАкция = Объект.смартАкции[Количество - н];
		
		Если НЕ ЗначениеЗаполнено(стрАкция.КодСтроки) Тогда
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = стрАкция.Номенклатура;
			НоваяСтрока.КодСтроки = ПолучитьНовыйКодСтроки();
			НоваяСтрока.смартДействующаяАкцияСтроки = стрАкция.ВидАкции;
			НоваяСтрока.Количество = стрАкция.Количество;
			НоваяСтрока.КоличествоУпаковок = стрАкция.Количество;
			
			Объект.МаксимальныйКодСтроки = НоваяСтрока.КодСтроки;
			
			стрАкция.КодСтроки = НоваяСтрока.КодСтроки;
			
			МасивНовыхСтрок.Добавить(НоваяСтрока.ПолучитьИдентификатор());
			
		Иначе
			
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КодСтроки", стрАкция.КодСтроки));
			Если НайденныеСтроки.Количество() = 0 Тогда
				Объект.смартАкции.Удалить(стрАкция);
			Иначе
				
				Если стрАкция.Количество <> НайденныеСтроки[0].Количество Тогда
					
					НайденныеСтроки[0].Количество = стрАкция.Количество;
					НайденныеСтроки[0].КоличествоУпаковок = стрАкция.Количество;
					
					МасивНовыхСтрок.Добавить(НайденныеСтроки[0].ПолучитьИдентификатор());
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МасивНовыхСтрок;
	
КонецФункции

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Процедура РассчитатьАкции()

	смартАкцииИСкидки.РассчитатьАкцииВФормеЗаказеКлиента(ЭтаФорма);
	ОбновитьДубликатыЗависимыхРеквизитов();
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Процедура ЗаполнитьДействующиеАкцииПоСтрокамТоваров()
	
	Для каждого стрТовары Из Объект.Товары Цикл
		
		НайденныеСтроки = Объект.смартАкции.НайтиСтроки(Новый Структура("КодСтроки", стрТовары.КодСтроки));
		Если НайденныеСтроки.Количество() > 0 Тогда
			стрТовары.смартДействующаяАкцияСтроки = НайденныеСтроки[0].ВидАкции;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Функция ПолучитьНовыйКодСтроки()
	
	МаксКодСтроки = 0;
	Для каждого стрТовары Из Объект.Товары Цикл
		МаксКодСтроки = Макс(МаксКодСтроки, стрТовары.КодСтроки);
	КонецЦикла;
	
	Возврат МаксКодСтроки + 1;
	
КонецФункции

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Процедура УдалитьАкцииБезТоваровИзДокумента()
	
	Количество = Объект.смартАкции.Количество();
	Для н = 1 По Количество Цикл
		
		стрАкция = Объект.смартАкции[Количество - н];
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КодСтроки", стрАкция.КодСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Объект.смартАкции.Удалить(стрАкция);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаКлиенте
Процедура смартНазначитьАкциюНаНоменклатуру(Команда)
	
	Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Если ТекущаяСтрока.КодСтроки = 0 Тогда
		
		ТекущаяСтрока.КодСтроки = ПолучитьНовыйКодСтроки();
		Объект.МаксимальныйКодСтроки = ТекущаяСтрока.КодСтроки;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	ПараметрыФормы.Вставить("КодСтроки", ТекущаяСтрока.КодСтроки);
	
	ОткрытьФорму("Документ.смартУправлениеАкциями.Форма.ДействующиеАкцииПоНоменклатуре", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("смартНазначитьАкциюНаНоменклатуруЗавершение", ЭтаФорма));
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаКлиенте
Процедура смартНазначитьАкциюНаНоменклатуруЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		Если ЭтоАдресВременногоХранилища(Значение) Тогда
			
			МасивНовыхСтрок = смартНазначитьАкциюНаНоменклатуруЗавершениеСервер(Значение);
			
			Для каждого НоваяСтрока Из МасивНовыхСтрок Цикл 
				
				Элементы.Товары.ТекущаяСтрока = НоваяСтрока;
				
				ТоварыНоменклатураПриИзменении(Элементы.ТоварыНоменклатура);
				смарт_ТоварыНоменклатураПриИзмененииПосле(Элементы.ТоварыНоменклатура);
				
				ТоварыСерияПриИзменении(Элементы.ТоварыСерия);
				
				смарт_ТоварыКоличествоУпаковокПриИзмененииПеред(Элементы.ТоварыКоличествоУпаковок);
				ТоварыКоличествоУпаковокПриИзменении(Элементы.ТоварыКоличествоУпаковок);
				
			КонецЦикла;
			
			РассчитатьАкции();
			ПересчитатьСуммуГрафикаОплаты();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию.
&НаСервере
Функция смартНазначитьАкциюНаНоменклатуруЗавершениеСервер(Адрес) Экспорт
	
	ТЗ = ПолучитьИзВременногоХранилища(Адрес);
	МасивНовыхСтрок = Новый Массив;
	
	Для каждого стрТЗ Из ТЗ Цикл
		
		НайденныеАкции = Объект.смартАкции.НайтиСтроки(Новый Структура("КодСтроки", стрТЗ.КодСтроки));
		Если НайденныеАкции.Количество() > 0 Тогда
			стрАкция = НайденныеАкции[0];
		Иначе
			стрАкция = Объект.смартАкции.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(стрАкция, стрТЗ);
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КодСтроки", стрАкция.КодСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Объект.смартАкции.Удалить(стрАкция);
		Иначе
			МасивНовыхСтрок.Добавить(НайденныеСтроки[0].ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МасивНовыхСтрок;
	
КонецФункции


//++ #Б5016 смарт: Шляпников 02.12.2025 / Снова не обновляется график платежей при добавлении наценки по доставке
&НаКлиенте
Процедура ПересчитатьСуммуГрафикаОплаты()
	
	ЭтапыОплатыКлиентСервер.РаспределитьСуммуПоЭтапамГрафикаОплаты(
					Объект.ЭтапыГрафикаОплаты,
					СуммаЗаказано,
					СуммаЗалогаЗаТару);
	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина, СуммаЗаказаноСЗалоговойТарой);

КонецПроцедуры

//++ #5014 смарт: Тимофеева 01.12.2025 / Документ Заказ клиента. Способ доставки. Блокировка изменения.
&НаСервереБезКонтекста
Функция ЕстьЗаданиеНаПеревозку(Заказ)
	Возврат Документы.ЗаказКлиента.ЕстьЗаданиеНаПеревозку(Заказ);	
КонецФункции

&НаСервереБезКонтекста
Функция ТребуетсяКонтрольСпособаДоставки()
	Возврат НЕ Пользователи.РолиДоступны("ПолныеПрава,ИспользованиеРабочегоМестаДоставки");
КонецФункции
//-- #5014 смарт: Тимофеева 01.12.2025 

//++ #5268 смарт: Тимофеева 25.12.2025 / Отменять закрытие заказа через роль
&НаКлиенте
Процедура ОткрытьЗакрытыйЗаказ(Команда)	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьЗакрытыйЗаказЗавершение", ЭтотОбъект),
					НСтр("ru='Изменить статус заказа на ""К выполнению / В резерве""?'"),
					РежимДиалогаВопрос.ДаНет,
					,
					КодВозвратаДиалога.Да);
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьЗакрытыйЗаказЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению");
	Объект.ДатаЗакрытия = Дата(1,1,1);
	СтатусПриИзмененииСервер();	
КонецПроцедуры
//-- #5268 смарт: Тимофеева 25.12.2025

//++ #5358 смарт: Тимофеева 12.01.26 / Заказ клиента. Запретить отгрузку от ООО Ковчег
&НаСервере
Функция ПроверитьВозможностьЗаписиПоОрганизации()
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяВывестиУведомлениеМенеджеру", Ложь);
	Результат.Вставить("ТекстУведомления", "");
	
	Если НЕ Пользователи.РолиДоступны("смартМенеджерБэкОфис") И 
		Объект.Организация = Справочники.смартПредопределенныеЗначения.Настройки.ОрганизацияКовчег Тогда
		Результат.ТребуетсяВывестиУведомлениеМенеджеру = Истина;
		Результат.ТекстУведомления = СтрШаблон("Запрещена отгрузка от организации %1", Объект.Организация);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции
//-- #5358 смарт: Тимофеева 12.01.26

//++ #Б5736 смарт: Шляпников 06.03.2026 / Разрешить редактировать заказы клиента не смотря на установленную Финальную скидку
&НаСервере
Процедура ЗаблокироватьИзменениеДокументаПриПревышенииМаксимальнойСкидки()
	
	Если НЕ Пользователи.РолиДоступны("смартРазрешитьСкидкуБольшеМаксимальной") Тогда
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		МассивПолей = Новый Массив;
		МассивПолей.Добавить("ТоварыНоменклатура");
		МассивПолей.Добавить("ТоварыХарактеристика");
		МассивПолей.Добавить("ТоварыСерия");
		МассивПолей.Добавить("ТоварыКоличествоУпаковок");
		МассивПолей.Добавить("ТоварыУпаковка");
		МассивПолей.Добавить("ТоварыНоменклатураЕдиницаИзмерения");
		МассивПолей.Добавить("ТоварыВидЦены");
		МассивПолей.Добавить("ТоварыЦена");
		МассивПолей.Добавить("ТоварыЦенаВВалюте");
		МассивПолей.Добавить("ТоварыСмартКонвертацияЦены");
		МассивПолей.Добавить("ТоварыПроцентАвтоматическойСкидки");
		МассивПолей.Добавить("ТоварыСуммаАвтоматическойСкидки");
		МассивПолей.Добавить("ТоварыПроцентРучнойСкидки");
		МассивПолей.Добавить("ТоварыСуммаРучнойСкидки");
		МассивПолей.Добавить("ТоварыЦенаСоСкидкой");
		МассивПолей.Добавить("ТоварыСумма");
		МассивПолей.Добавить("ТоварыСуммаНДС");
		МассивПолей.Добавить("ТоварыСуммаСНДС");
		МассивПолей.Добавить("ТоварыСтавкаНДС");
		
		Для каждого стрПоле Из МассивПолей Цикл
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(стрПоле);
		КонецЦикла;
			
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.смартМаксимальнаяСкидкаПревышена");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
		ЕстьПревышение = Ложь;
		
		МассивНоменклатуры = Объект.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
		
		ДанныеОСкидках = смартАкцииИСкидки.ПолучитьМаксимальныеСкидкиДляМассиваНоменклатуры(Объект.Дата, МассивНоменклатуры, Объект.Организация, Объект.Партнер);
		
		Для каждого стр Из Объект.Товары Цикл
			
			НайденныеСтроки = ДанныеОСкидках.НайтиСтроки(Новый Структура("Номенклатура", стр.Номенклатура));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если (НайденныеСтроки[0].МаксимальнаяСкидка < стр.ПроцентРучнойСкидки ИЛИ (НайденныеСтроки[0].СкидкаЗапрещена И стр.ПроцентРучнойСкидки > 0)) И НЕ НайденныеСтроки[0].Отменена Тогда
					ЕстьПревышение = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПревышение Тогда
			
			Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
&НаКлиенте
&ИзменениеИКонтроль("НадписьЭтапыОплатыНажатие")
Процедура смарт_НадписьЭтапыОплатыНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Попытка
		ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",             ТолькоПросмотр 
	Или Не РедактированиеРеквизитовEDIКлиентСервер.РеквизитДоступенДляРедактирования(ЭтотОбъект, "ЭтапыГрафикаОплаты"));
	ПараметрыФормы.Вставить("СуммаОплатыПоДокументу",     СуммаЗаказано);
	ПараметрыФормы.Вставить("СуммаЗалогаПоДокументу",     СуммаЗалогаЗаТару);
	ПараметрыФормы.Вставить("СуммаОтклоненияПоДокументу", Объект.ЭтапыГрафикаОплаты.Итог("СуммаОтклоненияМерныхТоваров"));
	ПараметрыФормы.Вставить("СуммаДопустимогоОтклоненияПоДокументу",
	ПолучитьСуммуДопустимогоОтклоненияПредоплатыПоДокументу());
	ПараметрыФормы.Вставить("ТребуетсяЗалогЗаТару",       Объект.ВернутьМногооборотнуюТару И Объект.ТребуетсяЗалогЗаТару);
	ПараметрыФормы.Вставить("ГрафикОплаты",               Объект.ГрафикОплаты);
	Если ПроверитьПравоНаЧтениеСоглашения() Тогда
		ПараметрыФормы.Вставить("Соглашение",             Объект.Соглашение);
	КонецЕсли;

	ПараметрыФормы.Вставить("ЖелаемаяДатаОтгрузки",       ?(ЗначениеЗаполнено(Объект.ЖелаемаяДатаОтгрузки), Объект.ЖелаемаяДатаОтгрузки, Объект.ДатаОтгрузки));
	ПараметрыФормы.Вставить("Дата",                       Объект.Дата);
	ПараметрыФормы.Вставить("Валюта",                     Объект.Валюта);
	ПараметрыФормы.Вставить("УникальныйИдентификатор",    УникальныйИдентификатор);
	ПараметрыФормы.Вставить("АдресВоВременномХранилище",  ПоместитьВоВременноеХранилищеНаСервере("ЭтапыГрафикаОплаты"));
	ПараметрыФормы.Вставить("ФормаОплаты",                Объект.ФормаОплаты);
	ПараметрыФормы.Вставить("Касса",                      Объект.Касса);
	ПараметрыФормы.Вставить("БанковскийСчет",             Объект.БанковскийСчет);
	ПараметрыФормы.Вставить("Организация",                Объект.Организация);
	ПараметрыФормы.Вставить("ПараметрыВыбораРеквизитов",  ПараметрыВыбораРеквизитов);
	ПараметрыФормы.Вставить("ИдентификаторПлатежа",       Объект.ИдентификаторПлатежа);
	ПараметрыФормы.Вставить("ПорядокРасчетов",            Объект.ПорядокРасчетов);
	ПараметрыФормы.Вставить("ДоступныеПорядкиРасчетов",   ДоступныеПорядкиРасчетов);
	ПараметрыФормы.Вставить("ЭтоЗаказ",                   Истина);
	ПараметрыФормы.Вставить("Ключ",                       Объект.Ссылка);
	ПараметрыФормы.Вставить("НаправлениеДеятельности",    Объект.НаправлениеДеятельности);
	ПараметрыФормы.Вставить("Договор",                    Объект.Договор);
	ПараметрыФормы.Вставить("ПорядокОплаты",              Объект.ПорядокОплаты);
	ПараметрыФормы.Вставить("ВалютаВзаиморасчетов",       Объект.Валюта);
	ПараметрыФормы.Вставить("УпрощенныйРежим",            ИспользоватьУпрощеннуюСхемуОплатыВПродажах); 
	#Вставка
	ПараметрыФормы.Вставить("СостояниеПоТехническойОтсрочке", СостояниеПоТехническойОтсрочке(Объект.Партнер, Объект.Дата));
	#КонецВставки

	Оповещение = Новый ОписаниеОповещения("НадписьЭтапыОплатыНажатиеЗавершение", ЭтотОбъект);

	ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыКлиентом", 
	ПараметрыФормы, 
	ЭтаФорма,,,, 
	Оповещение, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаСервереБезКонтекста
Функция СостояниеПоТехническойОтсрочке(Партнер, ДатаДокумента)
	Возврат РегистрыСведений.смартСтопЛистТехническойОтсрочки.СостояниеПоТехническойОтсрочке(Партнер, ДатаДокумента, Истина);	
КонецФункции

&НаКлиенте
Процедура смартОткрытьСтопЛистТехническойОтсрочки(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Партнер", Объект.Партнер);
	ОткрытьФорму("РегистрСведений.смартСтопЛистТехническойОтсрочки.Форма.ФормаСтопЛист", 
				ПараметрыОткрытияФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаСервере
Процедура смартОбновитьСостояниеСтопЛистаТехническойОтсрочки()
	
	Элементы.ГруппаСтопЛистТехническойОтсрочки.Видимость = Ложь;
	
	Если НЕ смартКонтрольДебиторскойЗадолженности.ВедетсяКонтрольДебиторскойЗадолженности(Объект.Дата) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Элементы.Найти("ГруппаСтопЛистТехническойОтсрочки") = Неопределено Тогда 
		Если ЗначениеЗаполнено(Объект.Партнер)
			И ЗначениеЗаполнено(Объект.Соглашение) Тогда
			ПорядокРасчетовСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ПорядокРасчетов");
			Если ПорядокРасчетовСоглашения = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда 
				Элементы.ГруппаСтопЛистТехническойОтсрочки.Видимость = Истина;
				СостояниеПоТехническойОтсрочке = РегистрыСведений.смартСтопЛистТехническойОтсрочки.СостояниеПоТехническойОтсрочке(Объект.Партнер);
				ОтгрузкаЗапрещена = СостояниеПоТехническойОтсрочке.ПродажаОтгрузкаЗапрещена И Объект.Дата >= СостояниеПоТехническойОтсрочке.ДатаЗапрета;
				Элементы.смартОткрытьСтопЛистТехническойОтсрочки.Видимость = ОтгрузкаЗапрещена;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

//-- #4792 смарт: Тимофеева 17.03.26

//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
&НаСервере
Процедура смартУстановитьПараметрыВыбораДоговора()
	
	Если НЕ ЗначениеЗаполнено(Объект.Соглашение) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Договор, "Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Договор, "ПометкаУдаления", Ложь);
	
	//++ #7676 смарт: Тимофеева 31.07.2026 / Контроль дебиторской задолженности. Выбор кредитного договора. Дополнение.
	//ЭтоИндивидуальноеСоглашение = НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "Типовое");
	РеквизитыСоглашения 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Соглашение, "Типовое, ЭтапыГрафикаОплаты");
	ЭтоИндивидуальноеСоглашение = НЕ РеквизитыСоглашения.Типовое;
	ЭтоКредитноеСоглашение 		= Ложь;
	ВыборкаЭтапов				= РеквизитыСоглашения.ЭтапыГрафикаОплаты.Выбрать(); 
	Пока ВыборкаЭтапов.Следующий() Цикл
		Если ВыборкаЭтапов.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки
			ИЛИ ВыборкаЭтапов.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитСдвиг Тогда
			ЭтоКредитноеСоглашение = Истина;	
		КонецЕсли;
	КонецЦикла;
	//-- #7676 смарт: Тимофеева 31.07.2026
	Если ЭтоИндивидуальноеСоглашение
		//++ #7676 смарт: Тимофеева 31.07.2026 / Контроль дебиторской задолженности. Выбор кредитного договора. Дополнение.
		И ЭтоКредитноеСоглашение 
		//-- #7676 смарт: Тимофеева 31.07.2026
		Тогда 
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Договор, "ТипДоговора", Перечисления.ТипыДоговоров.СПокупателем);
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Договор, "ОграничиватьСуммуЗадолженности", Истина); 
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Договор, "смартВидДоговора", Перечисления.смартВидыДоговоров.РасходныеМатериалыОтсрочка);  
	//++ #7448 смарт: Тимофеева 14.07.2026 / Контроль дебиторской задолженности. Выбор кредитного договора.
	Иначе
	    ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Договор, "ИсключитьКредитныеДоговорыПоРасходнымМатериалам", Истина);
	//-- #7448 смарт: Тимофеева 14.07.2026
	КонецЕсли;
	
КонецПроцедуры
//-- #4822 смарт: Тимофеева 02.04.2026

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

&НаСервере
//++ #Б-6672 смарт: Фролов 18.05.2026 //При создании заказа клиента подставлять Рекламное воздействие из посещенных мероприятий.
Функция смартПолучитьИсточникРекламногоВоздействия(Номенклатура)
	
	Если НЕ Номенклатура.ВидНоменклатуры = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартИсточникиРекламногоВоздействияАвтоматическоеПроставлениеВЗаказеКлиента.Ссылка КАК Ссылка,
	|	смартИсточникиРекламногоВоздействияАвтоматическоеПроставлениеВЗаказеКлиента.Ссылка.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Справочник.смартИсточникиРекламногоВоздействия.АвтоматическоеПроставлениеВЗаказеКлиента КАК смартИсточникиРекламногоВоздействияАвтоматическоеПроставлениеВЗаказеКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (смартИсточникиРекламногоВоздействияАвтоматическоеПроставлениеВЗаказеКлиента.Оборудование = СпрНоменклатура.Ссылка
	|				ИЛИ смартИсточникиРекламногоВоздействияАвтоматическоеПроставлениеВЗаказеКлиента.Оборудование = СпрНоменклатура.Марка)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОкончания УБЫВ");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции //-- #Б-6672 смарт: Фролов 18.05.2026	

&НаСервере
Процедура смартРассчитатьРучнуюСкидкуСУчетомАкции(ИДСтроки)
	
	стрТовары = Объект.Товары.НайтиПоИдентификатору(ИДСтроки);
	
	НайденныеСтроки = Объект.смартАкции.НайтиСтроки(Новый Структура("КодСтроки", стрТовары.КодСтроки));
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		ЦенаСоСкидкой = РаботаСКурсамиВалют.ПересчитатьВВалюту(НайденныеСтроки[0].ЦенаАкция, НайденныеСтроки[0].ВалютаАкция, Объект.Валюта, Объект.Дата);
		СуммаСоСкидкой = стрТовары.Количество * ЦенаСоСкидкой;
		
		стрТовары.СуммаРучнойСкидки = СуммаСоСкидкой * стрТовары.ПроцентРучнойСкидки / 100;
		стрТовары.СуммаРучнойСкидкиБезВозвратнойТары = стрТовары.СуммаРучнойСкидки;
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
		КэшированныеЗначения = Новый Структура;
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать,ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, СтруктураДействий, КэшированныеЗначения);
			
	КонецЕсли;
	
КонецПроцедуры

//++ #7106 смарт: Тимофеева 29.06.2026 / Списание каталогов. Оповещение пользователей при смене склада отгрузки.

&НаКлиенте
Процедура смарт_СкладПриИзмененииПосле(Элемент)
	ПроверитьИОповеститьОКомлектацииЗаказаСублимационнымОборудованием();
КонецПроцедуры

&НаСервере
Процедура ПроверитьИОповеститьОКомлектацииЗаказаСублимационнымОборудованием(ИдентификаторТекущейСтроки = -1)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;   
	
	СегментСублимационногоОборудования 		= Справочники.смартПредопределенныеЗначения.СегментОборудованияДляКомплектации.Значение;
	ЕстьСублимационноеОборудованиеКОтгрузке = Ложь; 
	
	Если ИдентификаторТекущейСтроки = -1 Тогда
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			Если СегментыСервер.ВходитВСегмент(ТекущаяСтрока.Номенклатура, СегментСублимационногоОборудования, , Ложь) 
				И НЕ ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
				ЕстьСублимационноеОборудованиеКОтгрузке = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если СегментыСервер.ВходитВСегмент(ТекущаяСтрока.Номенклатура, СегментСублимационногоОборудования, , Ложь) 
			И НЕ ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			ЕстьСублимационноеОборудованиеКОтгрузке = Истина;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ЕстьСублимационноеОборудованиеКОтгрузке Тогда
		Возврат;
	КонецЕсли; 
	
	КаталогОтгружается 	= Ложь;
	КаталогСсылка 		= смартСервер.ПолучитьКаталогДляКомплектацииОборудования();		
	Если ЗначениеЗаполнено(КаталогСсылка) Тогда
		ЗаказНаВнутренееПотребление = смартСервер.ПолучитьЗаказНаВнутренееПотребление(Объект.Ссылка, КаталогСсылка);
		РеквизитыЗаказа 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказНаВнутренееПотребление, 
													"Номер, Дата, ПометкаУдаления, Товары");
		Если НЕ РеквизитыЗаказа.ПометкаУдаления Тогда 			
			Выборка = РеквизитыЗаказа.Товары.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Номенклатура = КаталогСсылка
					И Выборка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить 
					Тогда
					КаталогОтгружается = Истина;
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли; 
		
		Если КаталогОтгружается Тогда 
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Внимание! Данный заказ в обязательном порядке комплектуется %1. 
			|У Заказа клиента есть зависимый документ Заказ на внутреннее потребление %2 от %3, в котором также необходимо изменить склад отгрузки или отменить его!"
			, КаталогСсылка, РеквизитыЗаказа.Номер, Формат(РеквизитыЗаказа.Дата, "ДЛФ=D")));
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

//-- #7106 смарт: Тимофеева 29.06.2026 

#КонецОбласти  
