
#Область ПеренесеноСДоработкамиСмарт
	
&НаСервере
Процедура смарт_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РазрешитьРедактированиеИспользованияРегламентногоЗадания = Истина;
	РазрешитьРедактированиеНастройкиСКД                      = Истина;
	РазрешитьРедактированиеРасписание                        = Истина;
	РазрешитьРедактированиеСпособФормирования                = Истина;
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 03.08.2020 15:01:48
	РазрешитьРедактированиеФильтров                          = Истина;
	//Смарт }Подкин Алексей Иванович 03.08.2020 15:01:48

	//++#1311 смарт: Лопато 15.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("РазрешитьРедактированиесмартИдентификаторДляФормул", Новый ОписаниеТипов("Булево"),, "Разрешить редактирование идентификатора для формул");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	НовыйЭлемент = Элементы.Добавить("РазрешитьРедактированиесмартИдентификаторДляФормул", Тип("ПолеФормы"));
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.ПутьКДанным = "РазрешитьРедактированиесмартИдентификаторДляФормул";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭтаФорма.РазрешитьРедактированиесмартИдентификаторДляФормул = Истина;
    //--#1311 смарт: Лопато 15.02.2023
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
&Вместо("РазрешитьРедактирование")
Процедура смарт_РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеИспользованияРегламентногоЗадания Тогда
		Результат.Добавить("РегламентноеЗаданиеИспользуется");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНастройкиСКД Тогда
		Результат.Добавить("ПредставлениеШаблонаСКД");
	КонецЕсли;
	
	Если РазрешитьРедактированиеРасписание Тогда
		Результат.Добавить("Расписание");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСпособФормирования Тогда
		Результат.Добавить("СпособФормирования");
	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 03.08.2020 15:10:36
	Если РазрешитьРедактированиеФильтров Тогда
		Результат.Добавить("ФильтрыБитрикс");
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 03.08.2020 15:10:36

    //++#1311 смарт: Лопато 15.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
	Если ЭтаФорма.РазрешитьРедактированиесмартИдентификаторДляФормул Тогда
		Результат.Добавить("смартИдентификаторДляФормул");
	КонецЕсли;
    //--#1311 смарт: Лопато 15.02.2023
	
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти