
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидВзаимодействия = Параметры.ВидВзаимодействия;
	ПараметрыВыбораВида = Новый Массив;
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы));
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ПланироватьвЖурналеВстреч", Истина));
	Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВида);
	
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Элементы.ПодключитьОтключитьОбсуждения.Заголовок = НСтр("ru='Отключить систему взаимодействий'");
	Иначе 
		Элементы.ПодключитьОтключитьОбсуждения.Заголовок = НСтр("ru='Подключить систему взаимодействий'");
	КонецЕсли;
	
	Элементы.ПодключитьОтключитьОбсуждения.Видимость = РольДоступна("полныеПрава");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбсужденияПодключены" Тогда
		Если Параметр Тогда
			Элементы.ПодключитьОтключитьОбсуждения.Заголовок = НСтр("ru='Отключить систему взаимодействий'");
		Иначе 
			Элементы.ПодключитьОтключитьОбсуждения.Заголовок = НСтр("ru='Подключить систему взаимодействий'");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВидВзаимодействия", ВидВзаимодействия);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОтключитьОбсуждения(Команда)
	
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/command/Обработка.сфпПодключениеСистемыВзаимодействия.Команда.Отключение");
	Иначе 
		ПерейтиПоНавигационнойСсылке("e1cib/app/Обработка.сфпПодключениеСистемыВзаимодействия");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
