
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ #1342 смарт: Фролов 19.04.2023 //Добавить в справочник номера ГТД признак смартНеДляПродажи  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартНеДляПродажи",Тип("ПолеФормы"),ЭтаФорма,);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартНеДляПродажи";
	НовыйЭлемент.Доступность = РольДоступна("ПолныеПрава") ;
	//-- #1342 смарт: Фролов 19.04.2023
	
	//++ #Б1610 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Заявка на гарантийный ремонт.
	Если НЕ РольДоступна("ПолныеПрава") И Объект.ИмяПредопределенныхДанных = "смартГарантийнаяЗапчасть" Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	//-- #Б1610 смарт: Шляпников 09.12.2024
	
	//++ #Б-7382 смарт: Фролов 10.07.2026 //Справочник НомераГТД. Создать роль.
	Если Пользователи.РолиДоступны("смартИзменениеГТДНеДляПродажи") Тогда	
		Элементы.смартНеДляПродажи.Доступность = Истина;
	КонецЕсли;	
	//-- #Б-7382 смарт: Фролов 10.07.2026	
	
КонецПроцедуры

#КонецОбласти