
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Настройки = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Форма не предназначена для непосредственного использования. ';en='Form is not intended for direct use. '");	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	
	КонецЕсли;
	
	Закрыть(СформироватьСтруктуруНастроек());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СформироватьСтруктуруНастроек()

	Настройки = Новый Структура("ИнтервалПродаж, ПериодичностьПродаж");
	ЗаполнитьЗначенияСвойств(Настройки, ЭтотОбъект);
	
	Возврат Настройки;
	
КонецФункции // СформироватьСтруктуруНастроек()

#КонецОбласти

