#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыПочтыДляУстановки();
	ЗаполнитьПараметрыСМСДляУстановки();
	ЗаполнитьПараметрыОбменаССайтомДляУстановки();
	ЗаполнитьПараметрыСинхронизацииДляУстановки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ЭтаФорма.ВладелецФормы.Закрыть();
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройки(Команда)
	
	УстановитьПараметрыПочтыВБазе();
	УстановитьПараметрыСМСВБазе();
	УстановитьПараметрыОбменаССайтомВБазе();
	УстановитьПараметрыСинхронизацииВБазе();
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ЭтаФорма.ВладелецФормы.Закрыть();
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Почта

&НаСервере
Процедура ЗаполнитьПараметрыПочтыДляУстановки()
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПочтыВБазе()
КонецПроцедуры

#КонецОбласти

#Область СМС

&НаСервере
Процедура ЗаполнитьПараметрыСМСДляУстановки()
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСМСВБазе()
КонецПроцедуры

#КонецОбласти

#Область ОбменыССайтом

&НаСервере
Процедура ЗаполнитьПараметрыОбменаССайтомДляУстановки()
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОбменаССайтомВБазе()
КонецПроцедуры

#КонецОбласти

#Область Синхронизации

&НаСервере
Процедура ЗаполнитьПараметрыСинхронизацииДляУстановки()
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСинхронизацииВБазе()
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область Прочее

#КонецОбласти 

