
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
    
    //++ смарт:ПА #815 24.12.2021 10:30:39
    НовыйЭлемент = Элементы.Добавить("смартИспользоватьПоУмолчаниюДляВалюты", Тип("ПолеФормы"), Элементы.ГруппаИспользования);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.Заголовок = "Использовать по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств.Наименование;
    НовыйЭлемент.ПутьКДанным = "Объект.смартИспользоватьПоУмолчаниюДляВалюты";
    НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "ИспользоватьПоУмолчаниюПриИзменении"); 
    //-- смарт:ПА #815 24.12.2021 10:30:39
    
    //Каратеев +
    Если РольДоступна("ПолныеПрава")
        ИЛИ РольДоступна("ДобавлениеИзменениеКлассификаторовНастроекДДС") Тогда
		Элементы.смартИспользоватьПоУмолчаниюДляВалюты.Доступность = Истина;
	Иначе
		Элементы.смартИспользоватьПоУмолчаниюДляВалюты.Доступность = Ложь;
	КонецЕсли;
	//Каратеев -

КонецПроцедуры

#КонецОбласти

#Область смарт_Добавлено

//Каратеев +
&НаКлиенте
Процедура ИспользоватьПоУмолчаниюПриИзменении(Элемент) 
    
    Если Объект.смартИспользоватьПоУмолчаниюДляВалюты Тогда 
        //++ смарт:Подкин #1037 26.05.2022 16:40:46  
        ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановитьУмолчание", ЭтотОбъект);
        ПоказатьВопрос(ОписаниеОповещения, "Назначить счет по-умолчанию для валюты и организации?",РежимДиалогаВопрос.ДаНет, 60);
    Иначе 
        Объект.смартИспользоватьПоУмолчаниюДляВалюты=Истина;
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Устанавливайте флажок на счет по-умолчанию(разрез Организация, Валюта), с остальных счетов флажок снимается автоматически!"); 
        //-- смарт:Подкин #1037 26.05.2022 16:40:46
    КонецЕсли;  
    
КонецПроцедуры 

//++ смарт:Подкин #1037 26.05.2022 17:22:47
&НаКлиенте
Процедура смартУстановитьУмолчание(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ИспользоватьПоУмолчаниюПриИзмененииНаСервере(); 
        Записать();
    Иначе
       Объект.смартИспользоватьПоУмолчаниюДляВалюты=Ложь;    
       Модифицированность=Ложь;
    КонецЕсли; 
    
КонецПроцедуры//-- смарт:Подкин #1037 26.05.2022 17:22:47


&НаСервере
Процедура ИспользоватьПоУмолчаниюПриИзмененииНаСервере()
	
	Организация = Объект.Владелец; 
    
    //++ смарт:Подкин #815 24.12.2021 10:46:58
     ВалютаБС= Объект.ВалютаДенежныхСредств;
    //-- смарт:Подкин #815 24.12.2021 10:46:58
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетОрганизации, 
        //++ смарт:Подкин #1037 26.05.2022 17:06:38
        |   БанковскиеСчетаОрганизаций.смартИспользоватьПоУмолчаниюДляВалюты КАК смартИспользоватьПоУмолчаниюДляВалюты 
        //-- смарт:Подкин #1037 26.05.2022 17:06:38
        |ИЗ
        |   Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
        |ГДЕ
        |   НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
        |   И (БанковскиеСчетаОрганизаций.Владелец = &Организация
        |           ИЛИ &Организация = НЕОПРЕДЕЛЕНО) 
        
        |   И БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &ВалютаБС";    
	
	Запрос.УстановитьПараметр("Организация", Организация);
    
    //++ смарт:Подкин #815 24.12.2021 10:46:40
	Запрос.УстановитьПараметр("ВалютаБС", ВалютаБС);
    //-- смарт:Подкин #815 24.12.2021 10:46:40
    
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    Пока Выборка.Следующий() Цикл 
        //++ смарт:Подкин #1037 26.05.2022 17:09:03
        Если Не Выборка.БанковскийСчетОрганизации.Ссылка = Объект.Ссылка И Выборка.смартИспользоватьПоУмолчаниюДляВалюты Тогда 
            //-- смарт:Подкин #1037 26.05.2022 17:09:03
            
            БанковскийСчет = Выборка.БанковскийСчетОрганизации.ПолучитьОбъект();
            БанковскийСчет.смартИспользоватьПоУмолчаниюДляВалюты = Ложь;
            БанковскийСчет.Записать();
            Сообщить("Со счета "+Выборка.БанковскийСчетОрганизации.Ссылка+" снята пометка Использовать по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств.Наименование);
        КонецЕсли;
    КонецЦикла;
    
	Сообщить("Счет "+Объект.Ссылка+" установлен по умолчанию");
	
КонецПроцедуры
//Каратеев -

//++ смарт:Подкин #815 24.12.2021 11:02:40
&НаКлиенте
Процедура смарт_ВалютаДенежныхСредствПриИзмененииПосле(Элемент)
    Элементы.Найти("смартИспользоватьПоУмолчаниюДляВалюты").Заголовок= "Использовать по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств;  
    Если Объект.смартИспользоватьПоУмолчаниюДляВалюты Тогда
        Оповещение = Новый ОписаниеОповещения("УстановитьИспользоватьПоУмолчаниюДляВалюты",ЭтотОбъект); 
        ПоказатьВопрос(Оповещение, "Установить данный банковский счет по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств,РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да,"Внимание вопрос:");
    КонецЕсли;
КонецПроцедуры //-- смарт:Подкин #815 24.12.2021 11:02:40

//++ смарт:Подкин #815 24.12.2021 11:02:40
&НаКлиенте
Процедура УстановитьИспользоватьПоУмолчаниюДляВалюты(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего
    Если Результат = КодВозвратаДиалога.Да Тогда
        ИспользоватьПоУмолчаниюПриИзмененииНаСервере(); 
    Иначе
       Объект.смартИспользоватьПоУмолчаниюДляВалюты=Ложь; 
    КонецЕсли; 
КонецПроцедуры //-- смарт:Подкин #815 24.12.2021 11:02:40

#КонецОбласти