
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
//++ #Б-2208 смарт: Фролов 26.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ДокументОснование", Объект.ДокументОснование) Тогда
		КонецЕсли;
		Объект.ПлановаяДата = ТекущаяДатаСеанса();
		Объект.ПлановаяДатаЗавершение = Объект.ПлановаяДата + 3600;
		Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
		Если Параметры.Свойство("ВидВзаимодействия", Объект.ВидВзаимодействия) Тогда
			ВидВзаимодействияПриИзмененииНаСервере();
		КонецЕсли;
		Объект.Автор			= Пользователи.АвторизованныйПользователь();
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный	= Объект.Автор;
		КонецЕсли;	
		Объект.Подразделение = Объект.Ответственный.Подразделение;
		Объект.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
		Объект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Запланировано;
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда	
				CRM_ОбщегоНазначенияСервер.ОбработкаЗаполнения(Объект, Объект.ДокументОснование);
				Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
					Объект.ДокументОснование	= Объект.ДокументОснование.Ссылка;
					Объект.КонтактноеЛицо		= Объект.ДокументОснование.КонтактноеЛицо;
					Объект.ОжидаемаяВыручка		= Объект.ДокументОснование.ОжидаемаяВыручка;
					Объект.Ответственный		= Объект.ДокументОснование.Ответственный;
					Объект.Партнер				= Объект.ДокументОснование.Партнер;
					Объект.Подразделение		= Объект.ДокументОснование.Подразделение;
					Объект.ПотенциальныйКлиент	= Объект.ДокументОснование.ПотенциальныйКлиент;
					Объект.Организация			= Объект.ДокументОснование.Организация;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		ТекущийЭлемент = Элементы.ПлановаяДата;
		Элементы.Отменить.Видимость = Ложь;
	Иначе
		ТекущийЭлемент = Элементы.Результат;
		Входящее = (Объект.ВидВзаимодействия.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Входящее);
		Элементы.Редактировать.Видимость = НЕ Входящее;
		Направление = Объект.ВидВзаимодействия.Направление;
	КонецЕсли;
	Если Параметры.Свойство("СостояниеИнтереса") Тогда
		Объект.СостояниеИнтереса = Параметры.СостояниеИнтереса;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Если ЗначениеЗаполнено(Объект.ДокументОснование) 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.ДокументОснование, "СостояниеИнтереса") Тогда
			Объект.СостояниеИнтереса = Объект.ДокументОснование.СостояниеИнтереса;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) И Параметры.Свойство("Партнер") Тогда
		Объект.Партнер = Параметры.Партнер;
		Параметры.Свойство("КонтактноеЛицо", Объект.КонтактноеЛицо); 
	КонецЕсли;
	СостоянияИнтереса = Новый Массив;
	СостоянияИнтереса.Добавить(Объект.СостояниеИнтереса);
	СостоянияИнтереса.Добавить(Справочники.CRM_СостоянияИнтересов.ПустаяСсылка());
	ПараметрыВыбораВида = Новый Массив;
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.Направление", Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее));
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.СостояниеИнтереса", Новый ФиксированныйМассив(СостоянияИнтереса)));
	ПараметрыВыбораВида.Добавить(Новый ПараметрВыбора("Отбор.ВидДела", Справочники.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес));
	Элементы.ВидВзаимодействия.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВида);
	ПлановаяДатаНачала = Объект.ПлановаяДата;
	Элементы.ПлановаяДатаВремя.Видимость			= (Не Объект.НаВесьДень);
	Элементы.ПлановаяДатаЗавершениеВремя.Видимость	= (Не Объект.НаВесьДень);

	CRM_ОбщегоНазначенияПовтИсп.ЗаполнитьСписокВыбораВариантовСроков(Элементы.ПлановаяДата);

	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	#Вставка
	//++ #Б-2208 смарт: Фролов 26.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	Если Объект.смартСогласованоУвеличенияПлановогоСрока Тогда
		
		Элементы.ГруппаДаты.Доступность = Ложь;
		
	КонецЕсли;
	//-- #Б-2208 смарт: Фролов 26.02.2025
	#КонецВставки

КонецПроцедуры //-- #Б-2208 смарт: Фролов 26.02.2025

&НаСервере
//++ #Б-4382 смарт: Фролов 22.09.2025 //Доработка документа Взаимодействие в интересах планируемых Акций.
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//++ #Б-6638 смарт: Фролов 19.06.2026 //Указание причины переноса взаимодействия. Пока только для СЦ.
	Если НЕ ТекущийОбъект.Ссылка.Пустая() Тогда
		
		Если НЕ ТекущийОбъект.ПлановаяДата = ТекущийОбъект.Ссылка.ПлановаяДата И НЕ ЗначениеЗаполнено(ТекущийОбъект.смартПричинаПереносаСрока) Тогда
			
			Если ЗначениеЗаполнено(ТекущийОбъект.Партнер) И ТекущийОбъект.Партнер.смартОсновнойМенеджерСервисЦентра = ТекущийОбъект.Ответственный Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Заполните причину переноса сроков!", , "Объект.смартПричинаПереносаСрока");
				Отказ = Истина;
				Возврат;
			
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-6638 смарт: Фролов 19.06.2026
	
	Если ЗначениеЗаполнено(ТекущийОбъект.смартВидЗадачи) И ТекущийОбъект.смартВидЗадачи.Акция Тогда
		
		Если НЕ ТекущийОбъект.СтатусВзаимодействия = ТекущийОбъект.Ссылка.СтатусВзаимодействия
			И (ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено
			ИЛИ ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено) Тогда
			
			Если СокрЛП(ТекущийОбъект.Результат) = "" Тогда
				
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю("Обязательно заполните результат!", , "Результат");
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если ТекущийОбъект.ПлановаяДата > ТекущийОбъект.смартВидЗадачи.ДатаОкончанияАкции 
			//++ #Б-4522 смарт: Фролов 01.10.2025 //Ошибка при завершении Акционного взаимодействия. 
			И НЕ (ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено
			ИЛИ ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено) Тогда
			//-- #Б-4522 смарт: Фролов 01.10.2025
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Дата окончание акции " + Формат(ТекущийОбъект.смартВидЗадачи.ДатаОкончанияАкции, "ДФ=dd.MM.yyyy")
				+ ", вы пытаетесь запланировать взаимодействие позже!", , "ПлановаяДата");
			
		КонецЕсли;	
		
	КонецЕсли;
	
	//++ #Б-6346 смарт: Фролов 14.05.2026 //Взаимодействие. Внедрение контроля за встречами со связями к интересам.
	Если ТекущийОбъект.ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ВыезднаяВстречаИнтерес
		ИЛИ ТекущийОбъект.ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ВыезднаяВстречаПартнер Тогда
		
		Если ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Запланировано
			ИЛИ ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.ВРаботе Тогда
			
			Если СокрЛП(ТекущийОбъект.Содержание) = "" Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнено описание",,, "Объект.Содержание", Отказ);	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.КонтактноеЛицо) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнено Контактное лицо",,, "Объект.КонтактноеЛицо", Отказ);	
				
			КонецЕсли;	
			
		ИначеЕсли ТекущийОбъект.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда	
			
			Если СокрЛП(ТекущийОбъект.Результат) = "" Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнено описание",,, "Объект.Результат", Отказ);	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.смартРезультатВстречи) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнен Результат встречи",,, "Объект.смартРезультатВстречи", Отказ);	
				
			КонецЕсли;
			
			//++ #Б-7440 смарт: Фролов 15.07.2026 //Взаимодействие. Выездная встреча. Доработка.
			Если ЗначениеЗаполнено(ТекущийОбъект.смартРезультатВстречи) 
				И ТекущийОбъект.смартРезультатВстречи = Перечисления.смартРезультатыВстреч.Положительный 
				И НЕ ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не заполнен Интерес",,, "Объект.ДокументОснование", Отказ);	
				
			КонецЕсли;
			//-- #Б-7440 смарт: Фролов 15.07.2026
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-6346 смарт: Фролов 14.05.2026
	
КонецПроцедуры //-- #Б-4382 смарт: Фролов 22.09.2025	

&НаКлиенте
&ИзменениеИКонтроль("ПлановаяДатаПриИзменении")
//++ #Б-5476 смарт: Фролов 28.01.2026 //Добавить проверку на максимальный срок взаимодействия в другие формы
Процедура смарт_ПлановаяДатаПриИзменении(Элемент)
	
	#Вставка
	//++ #Б-5476 смарт: Фролов 28.01.2026 //Добавить проверку на максимальный срок взаимодействия в другие формы
	СрокМаксимальногоПланированияВзаимодействийВДнях = смартОбщегоНазначения.ПолучитьЗначениеСправочникаПредопределенныеПоНовому(
			"СрокМаксимальногоПланированияВзаимодействийВДнях");
		
	Если СрокМаксимальногоПланированияВзаимодействийВДнях > 0 
		И Объект.ПлановаяДата > Объект.Дата + 3600 * 24 * СрокМаксимальногоПланированияВзаимодействийВДнях Тогда
			
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя планировать взаимодействия на срок более " + СрокМаксимальногоПланированияВзаимодействийВДнях + " дней!");
		Объект.ПлановаяДата = ПлановаяДатаНачала;
		Возврат;	
			
	КонецЕсли;
	//-- #Б-5476 смарт: Фролов 28.01.2026
	#КонецВставки
	
	Если Объект.ПлановаяДата = НачалоДня(Объект.ПлановаяДата) И ЗначениеЗаполнено(ВремяТемп) Тогда
		Объект.ПлановаяДата = Объект.ПлановаяДата+ВремяТемп;
		ВремяТемп = Неопределено;
	КонецЕсли;
	Если НачалоДня(ПлановаяДатаНачала) = НачалоДня(Объект.ПлановаяДатаЗавершение) Тогда
		ВремяЗавершения = Объект.ПлановаяДатаЗавершение - НачалоДня(Объект.ПлановаяДатаЗавершение);
		Объект.ПлановаяДатаЗавершение = НачалоДня(Объект.ПлановаяДата) + ВремяЗавершения;
	КонецЕсли;		
	Если Объект.ПлановаяДата>Объект.ПлановаяДатаЗавершение Тогда
		Объект.ПлановаяДатаЗавершение = Объект.ПлановаяДата + 3600;
	КонецЕсли;
	ПлановаяДатаНачала = Объект.ПлановаяДата;

КонецПроцедуры //-- #Б-5476 смарт: Фролов 28.01.2026

#КонецОбласти
