
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Неопределено;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("БизнесПроцесс", ПараметрКоманды));
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда 	 
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("БизнесПроцесс", ПолучитьЗначениеРеквизита(ПараметрКоманды, "БизнесПроцесс")));
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.CRM_ОбъектыПоБизнесПроцессам.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
// Параметры:
//  СсылкаНаОбъект	- Ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита	- Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(СсылкаНаОбъект, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);
КонецФункции // ПолучитьЗначениеРеквизита()

#КонецОбласти

