
#Область ОписаниеПеременных

&НаКлиенте
Перем ВременныеПараметрыОткрытияФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		
		// +Рарус alexpr
		//CRM_ЛицензированиеЭкспортныеМетоды.ВывестиУведомлениеОНедоступности(НСтр("ru = 'АРМ ""Мои продажи""'"));
		ТекстСообщения = НСтр("ru = 'Невозможно открыть АРМ ""Мои продажи"".
                               |Подсистема 1С:CRM не используется! (отключено в Персональных настройках)'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		// +Рарус alexpr
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПриСозданииНаСервере(ЭтотОбъект,
		 Отказ,
		 СтандартнаяОбработка);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущаяРоль = Справочники.РолиИсполнителей.ПустаяСсылка();
	ОтборПоРолиУстановлен = Истина;
	ВидАРМ = "Канбан";
	
	ИнициализироватьДанныеВоронкиПродаж();
	
	CRM_Теги.ОбновитьЗначенияОтбораПериодов(ЭтотОбъект, Истина);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодПросроченных", НачалоДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодТекущих", КонецДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодПросроченных", НачалоДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодТекущих", КонецДня(ТекущаяДата),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ТекстФайл", НСтр("ru = 'Файл...'; en = 'File...'"),
		 Истина);
	CRM_СмещениеДатыТекущегоСеанса = СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "CRM_СмещениеДатыТекущегоСеанса",
		 CRM_СмещениеДатыТекущегоСеанса);
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -Рабочий стол
	
	// +Виджеты
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		ВидимостьВиджетов = ХранилищеОбщихНастроек.Загрузить(ЭтотОбъект.ИмяФормы, "ПоказыватьПанельВиджетов");
		ПоказыватьВиджетыПриОткрытии = ?(ВидимостьВиджетов <> Неопределено, ВидимостьВиджетов, Ложь);
		Элементы.ГруппаВиджеты.Видимость = ПоказыватьВиджетыПриОткрытии;
		Элементы.СкрытьОтобразитьВиджеты.Пометка = ПоказыватьВиджетыПриОткрытии;
		Элементы.СкрытьОтобразитьВиджеты.Видимость = Истина;
	Иначе
		ВидимостьВиджетов = Ложь;
		ПоказыватьВиджетыПриОткрытии = Ложь;
		Элементы.СкрытьОтобразитьВиджеты.Видимость = Ложь;
		Элементы.ГруппаВиджеты.Видимость = Ложь;
	КонецЕсли;
	Если ПоказыватьВиджетыПриОткрытии Тогда
		ОбновитьВиджетыФормы();
	КонецЕсли;
	// -Виджеты
	
	СписокПериодов.Добавить("ПроизвольныйПериод", НСтр("ru='Произвольный период';en='Custom Period'"));
	СписокПериодов.Добавить("Сегодня", НСтр("ru='Сегодня';en='Today'"));
	СписокПериодов.Добавить("3 дня", НСтр("ru='3 дня';en='3 days'"));
	СписокПериодов.Добавить("Неделя", НСтр("ru='Неделя';en='Week'"));
	СписокПериодов.Добавить("Месяц", НСтр("ru='Месяц';en='Month'"));
	
	КлючОбъекта = "Обработка.CRM_АРМ_МоиПродажи.Форма.Форма/ТекущиеДанные";
	Настройки = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта, "", Новый Соответствие);
	НастройкиСтруктура = Новый Структура;
	Для Каждого КлючИЗначение Из Настройки Цикл
		Если ТипЗнч(КлючИЗначение.Ключ) = Тип("Строка") Тогда
			НастройкиСтруктура.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиСтруктура);
	КонецЦикла;
	
	Если Настройки.Количество() > 0 Тогда
		
		ПоискКлиент = Настройки.Получить("ПоискКлиент");
		ПоискИсточникПривлечения = Настройки.Получить("ПоискИсточникПривлечения");
		ПоискЗначениеИсточникаПривлечения = Настройки.Получить("ПоискЗначениеИсточникаПривлечения");
		ПоискТипУслуги = Настройки.Получить("ПоискТипУслуги");
		ВоронкаПродаж = Настройки.Получить("ВоронкаПродаж");
		ВариантПериода = Настройки.Получить("ВариантПериода");
		ПериодОтбора =  Настройки.Получить("ПериодОтбора");
		//ОтборСозданы[0].Значение = ПериодОтбора;
		
		ОтборВключатьПросроченные = Настройки.Получить("ОтборВключатьПросроченные");
		Если Не ЗначениеЗаполнено(ОтборВключатьПросроченные) Тогда
			ОтборВключатьПросроченные = 2;
		КонецЕсли;
	КонецЕсли;
	
	Если ВоронкаПродаж.Пустая() ИЛИ ВоронкаПродаж.ПометкаУдаления Тогда
		ВоронкаПродаж = Справочники.CRM_ВоронкиПродаж.Интересы;
		Настройки.Вставить("ВоронкаПродаж", ВоронкаПродаж);
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, "", Настройки);
	КонецЕсли;
	Элементы.ВыборСценария.Заголовок = ВоронкаПродаж;
	
	Если Не ЗначениеЗаполнено(ВариантПериода) Тогда
		ВариантПериода = "Неделя";
		ПериодОтбора = Новый СтандартныйПериод(ВариантСтандартногоПериода.Следующие7Дней);
		//ОтборСозданы[0].Значение = ПериодОтбора;
	КонецЕсли;
	
	Если ВариантПериода = "ПроизвольныйПериод" Тогда
		НомерПериода = 0;
	ИначеЕсли ВариантПериода = "Сегодня" Тогда
		НомерПериода = 1;
	ИначеЕсли ВариантПериода = "3 дня" Тогда
		НомерПериода = 2;
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		НомерПериода = 3;
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		НомерПериода = 4;
	КонецЕсли;
	
	Период = ОтборСозданы[НомерПериода];
	ПериодОтбора = ОтборСозданы[НомерПериода].Значение;
	
	Если НомерПериода = 0 Тогда
		Если ЗначениеЗаполнено(Период.Значение.ДатаНачала) Или ЗначениеЗаполнено(Период.Значение.ДатаОкончания) Тогда
			Период.Пометка = Истина;
		Иначе
			Период.Пометка = Ложь;
		КонецЕсли;
	Иначе
		Период.Пометка = Не Период.Пометка;
	КонецЕсли;
	
	// Вариант периода может быть выбран только один.
	Для Индекс = 0 По ОтборСозданы.Количество()-1 Цикл
		ЭлементСпискаПериодов = ОтборСозданы[Индекс];
		Если ЭлементСпискаПериодов <> Период Тогда
			ЭлементСпискаПериодов.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеПериода = СписокПериодов.НайтиПоЗначению(ВариантПериода);
	Если ЗначениеПериода<>Неопределено Тогда
		ПредставлениеПериода = ЗначениеПериода.Представление;
	КонецЕсли;
	
	Календарь = Константы.ОсновнойКалендарьПредприятия.Получить();
	
	ВоронкаПродажПриИзмененииНаСервере();
	
	Элементы.ГруппаНеРазобрано.Видимость = НЕ СкрытьКолонкуОбращения;
	НеРазобраноСводныеДанные_Видимость();
	Если НеРазобраноСводныеДанные_ПериодОбновления = 0 Тогда
		НеРазобраноСводныеДанные_ПериодОбновления = 1;
	КонецЕсли;
	
	ОбновитьОтборыНаСервере();
	
	СоздатьКнопиОтборПросроченные();
	СоздатьКнопкиВидАРМ();
	ПокраситьКнопкиПросроченныеНаСервере();
	
	УстановитьШиринуЭлементовКоманднойПанели();
	
	// +Рарус alexpr
	//// РаспознаваниеРечи
	//РаспознаваниеРечи_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	//// Конец РаспознаваниеРечи
	// -Рарус alexpr
	
	CRM_ОбщегоНазначенияСервер.ЗакончитьЗамерВремениСозданияФормы(ЭтотОбъект, ВремяНачалаЗамера);
	
	// +Рарус alexpr
	Элементы.ОткрытьПутьКлиента.Видимость = Ложь;
	// -Рарус alexpr
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	CRM_ОбщегоНазначенияКлиент.НачатьЗамерВремениОткрытияФормы(ЭтотОбъект);
	Если ПоказыватьВиджетыПриОткрытии Тогда
		Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
			Если Число(ЭлементСписка.Представление) <= 4 Тогда
				ПериодОбновленияВиджета = ПолучитьПериодОбновленияВиджетаНаСервере(ЭлементСписка.Значение,
					 ЭлементСписка.Представление);
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление, ПериодОбновленияВиджета);
			ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НастроитьКонтекстноеМенюТаблиц();
	
	СформироватьЗаголовок(ЭтотОбъект);
	
	НеРазобраноСводныеДанные_ПериодОбновления = Макс(1, НеРазобраноСводныеДанные_ПериодОбновления);
	Если Не СкрытьКолонкуОбращения Тогда
		ПодключитьОбработчикОжидания("ПериодическоеОбновлениеСписков", НеРазобраноСводныеДанные_ПериодОбновления*60, Ложь);
	КонецЕсли;
	
	ЗапуститьОбновлениеЗаголовков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// +Рарус alexpr
	//// РаспознаваниеРечи
	//CRM_РаботаСРечьюБМОКлиент.ОстановитьПотоковоеРаспознавание(УникальныйИдентификатор);
	//CRM_РаботаСРечьюЖурналированиеКлиент.ОчиститьЖурнал(УникальныйИдентификатор);
	//// Конец РаспознаваниеРечи
	// -Рарус alexpr
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Не Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения")
		И Источник.УникальныйИдентификатор = УникальныйИдентификатор Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьВиджеты" Тогда
		
		ОбновитьВиджетыФормы();
		
	ИначеЕсли ИмяСобытия = "ОбновитьАРМ" Тогда
		
		Колонки = Неопределено;
		Если ТипЗнч(Параметр) = Тип("Строка") Тогда
			
			Колонки = Новый Массив;
			Если ИменаТаблиц(ТаблицаЭтапы).Найти(Параметр) <> Неопределено Тогда
				Колонки.Добавить(Параметр);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.CRM_СостоянияИнтересов") Тогда
			
			Колонки = Новый Массив;
			Для Каждого Строка Из ТаблицаЭтапы Цикл
				Если Строка.СписокСостояний.НайтиПоЗначению(Параметр) <> Неопределено Тогда
					Колонки.Добавить(Параметр);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") Тогда
			
			Колонки = Новый Массив;
			Для Каждого Колонка Из Параметр Цикл
				Если ТипЗнч(Колонка) = Тип("Строка") Тогда
					
					Если ИменаТаблиц(ТаблицаЭтапы).Найти(Колонка) <> Неопределено Тогда
						Колонки.Добавить(Колонка);
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(Колонка) = Тип("СправочникСсылка.CRM_СостоянияИнтересов") Тогда
					
					Для Каждого Строка Из ТаблицаЭтапы Цикл
						Если Строка.СписокСостояний.НайтиПоЗначению(Колонка) <> Неопределено Тогда
							Колонки.Добавить(Колонка);
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ОбновитьТаблицы(Колонки);
		
	ИначеЕсли ИмяСобытия = "УстановленНовыйОтветственный" Или ИмяСобытия = "СтартованНовыйНезависимыйБП" Тогда
		
		Если ТипЗнч(Параметр) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			
			СостояниеИнтереса = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр, "СостояниеИнтереса");
			
			Колонки = Новый Массив;
			Для Каждого Строка Из ТаблицаЭтапы Цикл
				Если Строка.СписокСостояний.НайтиПоЗначению(СостояниеИнтереса) <> Неопределено Тогда
					Колонки.Добавить(Колонка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ОбновитьТаблицы(Колонки);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененоСостояниеИнтереса" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.CRM_СостоянияИнтересов") Тогда
			
			СценарийСостояния = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр, "Родитель");
			СценарийТекущейВоронки = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ВоронкаПродаж, "СценарийИнтереса");
			
			Если СценарийСостояния = СценарийТекущейВоронки Тогда
				ВоронкаПродажПриИзмененииНаСервере();
				ОбновитьОтборыНаСервере();
				ЗапуститьОбновлениеЗаголовков();
				СформироватьЗаголовок(ЭтотОбъект);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененСценарийИнтереса" Тогда
		
		ВоронкаПродаж = ПолучитьВоронкуПродажПоСценарию(Параметр);
		ОтобразитьИзменениеДанных(ВоронкаПродаж, ВидИзмененияДанных.Изменение);
		Если ЗначениеЗаполнено(ВоронкаПродаж) Тогда
			Элементы.ВыборСценария.Заголовок = ВоронкаПродаж;
			ЭлементСписка = СписокВоронок.НайтиПоЗначению(ВоронкаПродаж);
			Если ЭлементСписка = Неопределено Тогда
				СписокВоронок.Добавить(ВоронкаПродаж);
			Иначе
				ЭлементСписка.Представление = Строка(ВоронкаПродаж);
			КонецЕсли;
		КонецЕсли;
		
		ВоронкаПродажПриИзмененииНаСервере();
		ОбновитьОтборыНаСервере();
		ЗапуститьОбновлениеЗаголовков();
		СформироватьЗаголовок(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "УдаленСценарийИнтереса" Тогда
		
		УдаленнаяВоронка = ПолучитьВоронкуПродажПоСценарию(Параметр);
		ЭлементСписка = СписокВоронок.НайтиПоЗначению(УдаленнаяВоронка);
		Если ЭлементСписка <> Неопределено Тогда
			СписокВоронок.Удалить(ЭлементСписка);
		КонецЕсли;
		
		Если СписокВоронок.Количество() > 0 Тогда
			ВоронкаПродаж = СписокВоронок[0].Значение;
			Элементы.ВыборСценария.Заголовок = ВоронкаПродаж;
		Иначе
			ВоронкаПродаж = Неопределено;
			Элементы.ВыборСценария.Заголовок = "";
		КонецЕсли;
		
		ВоронкаПродажПриИзмененииНаСервере();
		ОбновитьОтборыНаСервере();
		ЗапуститьОбновлениеЗаголовков();
		СформироватьЗаголовок(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ОбновитьОтборыНаСервере("СтрокаПоиска");
	ЗапуститьОбновлениеЗаголовков();
	СформироватьЗаголовок(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// +Рарус alexpr
	//РаспознаваниеРечи();
	// -Рарус alexpr
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураСтроки = ПолучитьСтруктуруОбъекта(ВыбраннаяСтрока);
	Если ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		ОткрытьФорму("Обработка.CRM_Мессенджер.Форма.ФормаМессенджера", Новый Структура("Ключ", СтруктураСтроки.Объект));//, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.Независимый);
	ИначеЕсли ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ОткрытьФорму("Документ.ЭлектронноеПисьмоВходящее.Форма.CRM_ФормаДокумента",Новый Структура("Ключ",
			 СтруктураСтроки.Объект),
			 ЭтотОбъект);
	ИначеЕсли ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента",
			Новый Структура("Ключ", СтруктураСтроки.Объект),
			 ЭтотОбъект);
	Иначе	
		ПоказатьЗначение(,СтруктураСтроки.Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаУспешноПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		ПараметрыПеретаскивания.Значение = Элемент.ТекущаяСтрока;
	КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда 
		Если ПараметрыПеретаскивания.Значение.Количество() > 1 Тогда
			Выполнение = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Найти(Элемент.Имя, "НеРазобрано") > 0 Тогда
		ТекущийЭтап = "НеРазобрано";
	Иначе 
		ИДЭтапа = Элемент.Имя;
		ИДЭтапа = СтрЗаменить(ИДЭтапа, "Этап_",""); 
		ИДЭтапа = СтрЗаменить(ИДЭтапа, "_","-");
		ТекущийЭтап = ИДЭтапа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ПараметрыПеретаскивания.Значение = Неопределено
		 ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Строка") Тогда Возврат; КонецЕсли;
	Если Найти(Элемент.Имя, "НеРазобрано") > 0 Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ОбрабатываемаяЗапись = ПараметрыПеретаскивания.Значение[0];
		Если ОбрабатываемаяЗапись = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ОбрабатываемаяЗапись = ПараметрыПеретаскивания.Значение;
	КонецЕсли;	
	ИДЭтапа = Элемент.Имя;
	ИДЭтапа = СтрЗаменить(ИДЭтапа, "Этап_",""); 
	ИДЭтапа = СтрЗаменить(ИДЭтапа, "_","-"); 
	Если ТекущийЭтап = "НеРазобрано" Тогда
		СписокСостояний = ПолучитьСостоянияИнтересаПоВоронке(ПолучитьЭтапВоронки(ИДЭтапа));
		ДополнительныеПараметры = Новый Структура("Ссылка, ТекущееИзмерение, НовоеИзмерение,
			| НачалоПериода", ПолучитьОбъектЗаписи(ОбрабатываемаяЗапись), "Не разобрано",
			 ПолучитьЭтапВоронки(ИДЭтапа),
			 ТекущаяДата());
		ВыборСостоянияЗавершение(ДополнительныеПараметры); 
		Возврат;
	Иначе	
		СтруктураЭтап = ПолучитьСруктуруПереноса(ИДЭтапа, ОбрабатываемаяЗапись);
		Задача = ПолучитьТекущуюЗадачуИнтереса(СтруктураЭтап);
		Если ИДЭтапа <> ТекущийЭтап Тогда
			Если ЗначениеЗаполнено(Задача) Тогда
				МассивОшибок = CRM_БизнесПроцессыСервер.ПроверкаНаличияОбъектовПоБизнесПроцессу(Задача, , Истина);
				Если МассивОшибок.Количество() > 0 Тогда
					Для Индекс = 0 По МассивОшибок.ВГраница() Цикл
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(МассивОшибок[Индекс]);
					КонецЦикла;
					Возврат;
				КонецЕсли;
			КонецЕсли;

			Если Не ПроверитьЧекЛист(СтруктураЭтап.Объект) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для изменения состояния интереса необходимо выполнить все задачи чек-листа в Интересе!'"));
				Возврат;
			КонецЕсли;
	
			ЭтапВоронки = ПолучитьЭтапВоронки(ИДЭтапа);
			СписокСостояний = ?(ЗначениеЗаполнено(Задача),
				 ПолучитьСписокСостоянийСервер(СтруктураЭтап.Объект, Задача, ЭтапВоронки),
				 ПолучитьСостоянияИнтересаПоВоронке(ЭтапВоронки,
				 СтруктураЭтап.СостояниеИнтереса));
			Если СписокСостояний.Количество() > 1 Тогда
				ПереносИнтересаЗавершение = Новый ОписаниеОповещения("ОбработатьИнтересЗавершение", ЭтотОбъект,
					 Новый Структура("Ссылка, ТекущееИзмерение, НовоеИзмерение, Период", СтруктураЭтап.Объект,
					 ПолучитьЭтапВоронки(ТекущийЭтап), ПолучитьЭтапВоронки(ИДЭтапа),
					 ТекущаяДата()));
				ПараметрыФормы = Новый Структура("Интерес, ЭтапВоронки, Задача, СписокСостояний",
					 СтруктураЭтап.Объект, ПолучитьЭтапВоронки(ИДЭтапа), Задача,
					 СписокСостояний);
				ОткрытьФорму("Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаПереносаИнтереса", ПараметрыФормы,
					 ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ПереносИнтересаЗавершение,
					 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли СписокСостояний.Количество() = 1 Тогда
				Если ОткрыватьФормуПереносаИнтереса(СписокСостояний[0].Значение, СтруктураЭтап.Объект, Задача) Тогда
					ПереносИнтересаЗавершение = Новый ОписаниеОповещения("ОбработатьИнтересЗавершение", ЭтотОбъект,
						 Новый Структура("Ссылка, ТекущееИзмерение, НовоеИзмерение, Период", СтруктураЭтап.Объект,
						 ПолучитьЭтапВоронки(ТекущийЭтап), ПолучитьЭтапВоронки(ИДЭтапа),
						 ТекущаяДата()));
					ПараметрыФормы = Новый Структура("Интерес, ЭтапВоронки, Задача, СписокСостояний",
						 СтруктураЭтап.Объект, ПолучитьЭтапВоронки(ИДЭтапа), Задача,
						 СписокСостояний);
					ОткрытьФорму("Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаПереносаИнтереса", ПараметрыФормы,
						 ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ПереносИнтересаЗавершение,
						 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Иначе
					ПараметрыОбработки = Новый Структура;
					ПараметрыОбработки.Вставить("Ссылка", ПолучитьОбъектЗаписи(ОбрабатываемаяЗапись));
					ПараметрыОбработки.Вставить("НовоеСостояние", СписокСостояний[0].Значение);
					ПараметрыОбработки.Вставить("Задача", Задача);
					ОбработатьИнтересНаКлиенте(ПараметрыОбработки);
				КонецЕсли;
			Иначе
				Если СписокСостояний.Количество() = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Переход интереса на данный этап невозможен!';
						|en='Transition of lead at this stage is impossible!'"),,,,);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаУспешноПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТекущийЭтап = "НеРазобрано" Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ОбрабатываемаяЗапись = ПараметрыПеретаскивания.Значение[0];
	Иначе
		ОбрабатываемаяЗапись = ПараметрыПеретаскивания.Значение;
	КонецЕсли;	
	СтруктураЭтап = ПолучитьСруктуруПереноса("", ОбрабатываемаяЗапись);
	Задача = ПолучитьТекущуюЗадачуИнтереса(СтруктураЭтап);
	СтатусЗакрыт = ПолучитьСостояниеИнтересаИнтересЗакрыт(СтруктураЭтап.Объект);
	Если ЗначениеЗаполнено(Задача) Тогда
		СписокСостояний = ?(ЗначениеЗаполнено(Задача), ПолучитьСписокСостоянийСервер(СтруктураЭтап.Объект,
			 Задача),
			 Неопределено);
		ЭтапНайден = Ложь;
		Для Каждого ЭлементСписокаСостояний Из СписокСостояний Цикл
			Если ЭлементСписокаСостояний.Значение.Состояние = СтатусЗакрыт Тогда
				ЭтапНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЭтапНайден Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Переход интереса на данный этап невозможен!';
				|en='Transition of lead at this stage is impossible!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Не ПроверитьЧекЛист(СтруктураЭтап.Объект) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для изменения состояния интереса необходимо выполнить все задачи чек-листа в Интересе!'"));
		Возврат;
	КонецЕсли;
	
	Если ОткрыватьФормуПереносаИнтереса(СтатусЗакрыт, СтруктураЭтап.Объект, Задача) Тогда
		ФормаОбработки = "Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаПереносаИнтереса";
		ПереносИнтересаЗавершение = Новый ОписаниеОповещения("ОбработатьИнтересЗавершение", ЭтотОбъект);
		Если ЗначениеЗаполнено(Задача) Тогда
			ПараметрыФормы = Новый Структура("Интерес, Задача, ДанныеВыбранногоСостоянияИнтереса",
				 СтруктураЭтап.Объект, Задача,
				 ЭлементСписокаСостояний.Значение);
		Иначе
			ПараметрыФормы = Новый Структура("Интерес, Задача, ДанныеВыбранногоСостоянияИнтереса",
				 СтруктураЭтап.Объект, Задача,
				 СтатусЗакрыт);
		КонецЕсли;
		ОткрытьФорму(ФормаОбработки, ПараметрыФормы, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,,
			 ПереносИнтересаЗавершение,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если ЗначениеЗаполнено(Задача) Тогда
			Состояние = ЭлементСписокаСостояний.Значение;
		Иначе
			Состояние = СтатусЗакрыт;
		КонецЕсли;
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("Ссылка", ПолучитьОбъектЗаписи(ОбрабатываемаяЗапись));
		ПараметрыОбработки.Вставить("НовоеСостояние", Состояние);
		ПараметрыОбработки.Вставить("Задача", Задача);
		ОбработатьИнтересНаКлиенте(ПараметрыОбработки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНеудачноПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНеудачноПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТекущийЭтап = "НеРазобрано" Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ОбрабатываемаяЗапись = ПараметрыПеретаскивания.Значение[0];
	Иначе
		ОбрабатываемаяЗапись = ПараметрыПеретаскивания.Значение;
	КонецЕсли;	
	СтруктураЭтап = ПолучитьСруктуруПереноса("", ОбрабатываемаяЗапись);
	Задача = ПолучитьТекущуюЗадачуИнтереса(СтруктураЭтап);
	
	СтатусЗакрыт = ПолучитьСостояниеИнтересаИнтересПотерян(СтруктураЭтап.Объект);
	Если ЗначениеЗаполнено(Задача) Тогда
		СписокСостояний = ?(ЗначениеЗаполнено(Задача), ПолучитьСписокСостоянийСервер(СтруктураЭтап.Объект,
			 Задача),
			 Неопределено);
		ЭтапНайден = Ложь;
		Для Каждого ЭлементСписокаСостояний Из СписокСостояний Цикл
			Если ЭлементСписокаСостояний.Значение.Состояние = СтатусЗакрыт Тогда
				ЭтапНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЭтапНайден Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Переход интереса на данный этап невозможен!';
				|en='Transition of lead at this stage is impossible!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Не ПроверитьЧекЛист(СтруктураЭтап.Объект) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для изменения состояния интереса необходимо выполнить все задачи чек-листа в Интересе!'"));
		Возврат;
	КонецЕсли;
	
	ФормаОбработки = "Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаПереносаИнтереса";
	ПереносИнтересаЗавершение = Новый ОписаниеОповещения("ОбработатьИнтересЗавершение", ЭтотОбъект);
	Если ЗначениеЗаполнено(Задача) Тогда
		Если ЗначениеЗаполнено(ЭлементСписокаСостояний.Значение.ВариантВыполнения) Тогда
			ПараметрыФормы = Новый Структура("ОткрытиеИзАРМа, Интерес, Задача,
				| ПредставлениеВариантаВыполнения", Истина, СтруктураЭтап.Объект, Задача,
				 ЭлементСписокаСостояний.Значение.ВариантВыполнения);
		Иначе
			ПараметрыФормы = Новый Структура("ОткрытиеИзАРМа, Интерес, Задача,
				| ПредставлениеВариантаВыполнения, ДосрочноеЗавершение", Истина, СтруктураЭтап.Объект, Задача, 0,
				 Истина);
		КонецЕсли;
	Иначе
		ПараметрыФормы = Новый Структура("ОткрытиеИзАРМа, Интерес, Задача,
			| ДанныеВыбранногоСостоянияИнтереса", Истина, СтруктураЭтап.Объект, Задача,
			 ПолучитьСостояниеИнтересаИнтересПотерян(СтруктураЭтап.Объект));
	КонецЕсли;
	ОткрытьФорму(ФормаОбработки, ПараметрыФормы, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,,
		 ПереносИнтересаЗавершение,
		 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура НеРазобраноПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяТаблица = Элемент.Имя; 
	ПодключитьОбработчикОжидания("АРМПриАктивизацииСтрокиОбработка", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АРМПриАктивизацииСтрокиОбработка()
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц(ТаблицаЭтапы, "Канбан") Цикл
		Если АктивнаяТаблица = ИмяТаблицы Тогда
			Продолжить;
		КонецЕсли;
		Элементы[ИмяТаблицы].ВыделенныеСтроки.Очистить();
		Элементы[ИмяТаблицы].ТекущаяСтрока = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти

#Область Виджеты

&НаКлиенте
Процедура ДобавитьВиджет(Элемент)
	
	Если КоличествоВиджетовНаФорме = 99 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВиджетЗавершение", ЭтотОбъект, Новый Структура);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокОткрытыхВиджетов", СписокВиджетовПользователя);
	ПараметрыФормы.Вставить("ФормаВиджеты", Истина);
	
	ОткрытьФорму("Справочник.CRM_Виджеты.ФормаВыбора",
		ПараметрыФормы, ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВиджетЗавершение(ВыбранныйВиджет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйВиджет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВиджета = ДобавитьВиджетФормы(ВыбранныйВиджет);
	
	Если ДанныеВиджета <> Неопределено Тогда
		Если Число(ДанныеВиджета.ИндексВиджета) <= 4 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДанныеВиджета.ИндексВиджета,
				 ДанныеВиджета.ПериодОбновленияВиджета);
		ИначеЕсли Число(ДанныеВиджета.ИндексВиджета) = 5 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ТекущийЭлемент) <> Тип("ПолеФормы")
		И ТипЗнч(ТекущийЭлемент) <> Тип("ДекорацияФормы") Тогда
		Возврат;
	КонецЕсли;
	
	ИндексВиджета = Прав(ТекущийЭлемент.Имя,2);
	Виджет = Неопределено;
	
	Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
		Если ЭлементСписка.Представление = ИндексВиджета Тогда
			Виджет = ЭлементСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Виджет) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "УдалитьВиджет") Тогда
		УдалитьВиджетФормы(Виджет);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "ОткрытьПоказатель") Тогда
		ПоказатьЗначение( ,Виджет);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "НастройкаВиджета") Тогда
		ПараметрыФормы = Новый Структура("Виджет, ИндексВиджета, ТекущийПользователь", Виджет,
			 ИндексВиджета,
			 ТекущийПользователь);
		ОповещениеНастройкаВиджета = Новый ОписаниеОповещения("НастройкаВиджетаЗавершение", ЭтотОбъект, ПараметрыФормы);
		ОткрытьФорму("Справочник.CRM_Виджеты.Форма.ФормаНастройки", ПараметрыФормы, ЭтотОбъект, , , ,
			 ОповещениеНастройкаВиджета,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "Расшифровать") Тогда
		Показатель = ПолучитьИсточникДанныхВиджета(Виджет);
		ЗначениеАналитики = CRM_РаботаСВиджетамиВызовСервера.ПолучитьЗначениеАналитикиИзНастроекВиджета(Виджет,
			 ИндексВиджета,
			 ТекущийПользователь);
		CRM_УправлениеЦелевымиПоказателямиКлиент.ОткрытьРасшифровкуПоказателя(Показатель, ЗначениеАналитики);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "Обновить") Тогда
		ОбновитьВиджетыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВиджетаЗавершение(НовыеНастройки, ДополнительныеПараметры) Экспорт
	
	Если НовыеНастройки <> Неопределено Тогда
		Если НовыеНастройки = Ложь Тогда
			УдалитьВиджетФормы(ДополнительныеПараметры.Виджет);
			Возврат;
		КонецЕсли;
		ОбновитьВиджетНаСервере(ДополнительныеПараметры.ИндексВиджета);
		Если Число(ДополнительныеПараметры.ИндексВиджета) <= 4 Тогда
			ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДополнительныеПараметры.ИндексВиджета);
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДополнительныеПараметры.ИндексВиджета, НовыеНастройки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаВиджета(Команда)
	
	ИндексВиджета = Прав(Команда.Имя,2);
	Виджет = Неопределено;
	
	Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
		Если ЭлементСписка.Представление = ИндексВиджета Тогда
			Виджет = ЭлементСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Виджет) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Команда.Имя, "Виджет_Настройки_") Тогда
		ПараметрыФормы = Новый Структура("Виджет, ИндексВиджета, ТекущийПользователь", Виджет,
			 ИндексВиджета,
			 ТекущийПользователь);
		ОповещениеНастройкаВиджета = Новый ОписаниеОповещения("НастройкаВиджетаЗавершение", ЭтотОбъект, ПараметрыФормы);
		ОткрытьФорму("Справочник.CRM_Виджеты.Форма.ФормаНастройки", ПараметрыФормы, ЭтотОбъект, , , ,
			 ОповещениеНастройкаВиджета,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли СтрНайти(Команда.Имя, "Виджет_Расшифровать_") Тогда
		ЗначениеАналитики = CRM_РаботаСВиджетамиВызовСервера.ПолучитьЗначениеАналитикиИзНастроекВиджета(Виджет,
			 ИндексВиджета,
			 ТекущийПользователь);
		Если ТипЗнч(ЗначениеАналитики) = Тип("СправочникСсылка.Пользователи") Тогда
			МассивПользователей = Новый Массив;
			МассивПользователей.Добавить(ЗначениеАналитики);
		Иначе
			МассивПользователей = CRM_УправлениеЦелевымиПоказателямиСервер.ДоступныеПользователи(Истина);
		КонецЕсли;
        ОткрытьРасшифровкуПереопределяемого(Виджет, ИндексВиджета, МассивПользователей);
	ИначеЕсли СтрНайти(Команда.Имя, "Виджет_Обновить_") Тогда
		ОбновитьВиджетыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасшифровкуПереопределяемого(Виджет, ИндексВиджета, МассивПользователей)
	
	// +Рарус alexpr
	//Если Виджет = ПредопределенноеЗначение("Справочник.CRM_Виджеты.ВыполнениеПланаПродаж")
	//	Или Виджет = ПредопределенноеЗначение("Справочник.CRM_Виджеты.ВыполнениеПланаПродажКол") Тогда
	//	УсловияОтбора = Новый Структура;
	//	ЗначениеАналитики = ЭтотОбъект["Виджет_ВыполнениеПланаПродаж_ЗначениеАналитики"+ИндексВиджета];
	//	Если ТипЗнч(ЗначениеАналитики) = Тип("СправочникСсылка.Пользователи") Тогда
	//		УсловияОтбора.Вставить("Менеджер", ЗначениеАналитики);
	//	ИначеЕсли ТипЗнч(ЗначениеАналитики) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
	//		УсловияОтбора.Вставить("Подразделение", ЗначениеАналитики);
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//	ПериодПлана = ЭтотОбъект["Виджет_ВыполнениеПланаПродаж_Период"+ИндексВиджета];
	//	УсловияОтбора.Вставить("ГруппировкаПериода", ПредопределенноеЗначение("Перечисление.Периодичность.ПустаяСсылка"));
	//	УсловияОтбора.Вставить("ПериодОтчета", ПериодПлана);
	//	УсловияОтбора.Вставить("Согласовано", Истина);
	//	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	//	ОткрытьФорму("Отчет.CRM_АнализПлановПродаж.Форма", ПараметрыФормы);
	//КонецЕсли;
	// -Рарус alexpr
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройкуСценария(Команда)
	ПараметрыОткрытия = Новый Структура("Сценарий",
		 CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ВоронкаПродаж,
		 "СценарийИнтереса"));
	ОткрытьФорму("Обработка.CRM_НастройкаСценарияПродаж.Форма.Форма", ПараметрыОткрытия, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтобразитьВиджеты(Команда)
	ПоказыватьВиджетыПриОткрытии = НЕ ПоказыватьВиджетыПриОткрытии;
	Элементы.ГруппаВиджеты.Видимость = ПоказыватьВиджетыПриОткрытии;
	СохранитьНастройкуПоказыватьВиджеты(ЭтотОбъект.ИмяФормы, ПоказыватьВиджетыПриОткрытии);
	Если ПоказыватьВиджетыПриОткрытии Тогда
		ОбновитьВиджетыФормы();
		Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
			Если Число(ЭлементСписка.Представление) <= 4 Тогда
				ПериодОбновленияВиджета = ПолучитьПериодОбновленияВиджетаНаСервере(ЭлементСписка.Значение,
					 ЭлементСписка.Представление);
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление, ПериодОбновленияВиджета);
			ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
			Если Число(ЭлементСписка.Представление) <= 4 Тогда
				ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление);
			ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
				ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура Анализ(Команда)
	ОткрытьФорму("Отчет.CRM_ВоронкаПродаж.Форма.Форма", Новый Структура("Воронка", ВоронкаПродаж));
КонецПроцедуры

&НаКлиенте
Процедура НазначитьМне(Команда)
	
	ПеренаправитьОбращение(ПользователиКлиент.АвторизованныйПользователь(), ,Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьИсполнителю(Команда)

	ПеренаправитьОбращение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьРоли(Команда)

	ПеренаправитьОбращение(, Тип("СправочникСсылка.РолиИсполнителей"));
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПисьмоИзАРМПланировщик(Команда)
	ЕстьЛиды = ЕстьЛидыВВыбранныхСтроках();
	Если ЕстьЛиды Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СкрытьПисьмоИзАРМЗавершение", ЭтотОбъект, ЕстьЛиды);
		ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", , ЭтотОбъект,,
			 ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
			ЗадатьВопросПриПереносеВОбработанные();
		Иначе
			ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПисьмоИзАРМЗавершение(Результат, ЕстьЛиды) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("ПричинаОтказа")
			И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
			
		Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
			ЗадатьВопросПриПереносеВОбработанные(Результат);
		Иначе
			ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, Результат);
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("АРММоиПродажи"));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПутьКлиента(Команда)
	// +Рарус alexpr
	//ПараметрыОтчета = Новый Структура();
	//ПараметрыОтчета.Вставить("CRM_КонтекстВызова", "МоиПродажи");
	//Если ЗначениеЗаполнено(ВоронкаПродаж) Тогда
	//	ПараметрыОтчета.Вставить("Сценарий",
	//		 CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ВоронкаПродаж,
	//		 "СценарийИнтереса"));
	//КонецЕсли;
	//ОткрытьФорму("Отчет.CRM_ПутьКлиента.Форма.ФормаОтчета", ПараметрыОтчета);
	// -Рарус alexpr
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтр(Команда)
	
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("СкрытьПропущенныеТелефонныеЗвонки", СкрытьПропущенныеТелефонныеЗвонки);
	СтруктураФильтра.Вставить("СкрытьОтвеченныеТелефонныеЗвонки", СкрытьОтвеченныеТелефонныеЗвонки);
	СтруктураФильтра.Вставить("СкрытьЗаявки", СкрытьЗаявки);
	СтруктураФильтра.Вставить("СкрытьСообщения", СкрытьСообщения);
	СтруктураФильтра.Вставить("ОтборВключен", ОтборВключен);
	СтруктураФильтра.Вставить("ОтборТеги", ОтборТеги);
	СтруктураФильтра.Вставить("ОтображатьПисьма", ОтображатьПисьма);
	СтруктураФильтра.Вставить("СкрытьКолонкуОбращения", СкрытьКолонкуОбращения);
	СтруктураФильтра.Вставить("СкрытьПовторныеОбращения", СкрытьПовторныеОбращения);
	СтруктураФильтра.Вставить("ПоискПодразделение", ПоискПодразделение);
	СтруктураФильтра.Вставить("ВариантПериода", ВариантПериода);
	СтруктураФильтра.Вставить("ПоискКлиент", ПоискКлиент);
	СтруктураФильтра.Вставить("ПоискТипУслуги", ПоискТипУслуги);
	СтруктураФильтра.Вставить("ПоискПроект", ПоискПроект);
	СтруктураФильтра.Вставить("ТекущийПользователь", ТекущийПользователь);
	СтруктураФильтра.Вставить("ТекущаяРоль", ТекущаяРоль);
	СтруктураФильтра.Вставить("ОтборПоРолиУстановлен", ОтборПоРолиУстановлен);
	СтруктураФильтра.Вставить("ТекущийАвтор", ТекущийАвтор);
	СтруктураФильтра.Вставить("ПоискИсточникПривлечения", ПоискИсточникПривлечения);
	СтруктураФильтра.Вставить("ПоискЗначениеИсточникаПривлечения", ПоискЗначениеИсточникаПривлечения);
	
	ПараметрыОткрытия = Новый структура;
	ПараметрыОткрытия.Вставить("СтруктураФильтра", СтруктураФильтра);
	
	ОписаниеОповещенияФильтра = Новый ОписаниеОповещения("ОткрытьФильтрЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.CRM_АРМ_МоиПродажи.Форма.ФормаФильтра",
		ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияФильтра, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтрЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТемпСкрытьКолонкуОбращения = СкрытьКолонкуОбращения;
	УстановитьФильтрНаСервере(Результат);
	НастроитьКонтекстноеМенюТаблиц();
	ЗапуститьОбновлениеЗаголовков();
	
	Если СкрытьКолонкуОбращения <> ТемпСкрытьКолонкуОбращения Тогда
		Если СкрытьКолонкуОбращения Тогда
			ОтключитьОбработчикОжидания("ПериодическоеОбновлениеСписков");
		Иначе
			ПодключитьОбработчикОжидания("ПериодическоеОбновлениеСписков", НеРазобраноСводныеДанные_ПериодОбновления*60, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтр(Команда)
	
	СброситьФильтрНаСервере();
	НастроитьКонтекстноеМенюТаблиц();
	ЗапуститьОбновлениеЗаголовков();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьУспешно(Команда)
	Элементы.ГруппаУспешно.Видимость = Ложь;
	Элементы.ГруппаТаблица_ТаблицаУспешноСвернуто.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьНеудачно(Команда)
	Элементы.ГруппаНеудачно.Видимость = Ложь;
	Элементы.ГруппаТаблица_ТаблицаНеудачноСвернуто.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУспешно(Команда)
	Элементы.ГруппаУспешно.Видимость = Истина;
	Элементы.ГруппаТаблица_ТаблицаУспешноСвернуто.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьНеудачно(Команда)
	Элементы.ГруппаНеудачно.Видимость = Истина;
	Элементы.ГруппаТаблица_ТаблицаНеудачноСвернуто.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОбращение(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сценарий",
		 CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ВоронкаПродаж,
		 "СценарийИнтереса"));
	ПараметрыФормы.Вставить("ДоступноОбращение", Ложь);
	ПараметрыФормы.Вставить("ИсточникОткрытияМастера", CRM_МетодыФормОбработокСервер.МастерОткрытИзПродаж());
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВыборСценария(Команда)
	ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("ПослеВыбораВоронки", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещенияВыбора, СписокВоронок, Элементы.ВыборСценария);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВоронки(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВоронкаПродаж = ВыбранныйЭлемент.Значение;
	Элементы.ВыборСценария.Заголовок = ВоронкаПродаж;
	
	Элементы.ГруппаСоставКолонок.Видимость = Ложь;
	
	ВоронкаПродажПриИзмененииНаСервере();
	ОбновитьОтборыНаСервере();
	ЗапуститьОбновлениеЗаголовков();
	СформироватьЗаголовок(ЭтотОбъект);
	
	Элементы.ГруппаСоставКолонок.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеВнизу(Команда)
	ОтборВключатьПросроченные = 1;
	НастроитьПорядокТаблиц();
	ПокраситьКнопкиПросроченныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеВверху(Команда)
	ОтборВключатьПросроченные = 2;
	НастроитьПорядокТаблиц();
	ПокраситьКнопкиПросроченныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидКанбан(Команда)
	ВидАРМ = "Канбан";
	Элементы.ГруппаВоронка.Видимость = Истина;
	Элементы.ГруппаСписок.Видимость = Ложь;
	ПокраситьКнопкиВидАРМНаСервере(1);
КонецПроцедуры

&НаКлиенте
Процедура ВидСписок(Команда)
	ВидАРМ = "Список";
	Элементы.ГруппаВоронка.Видимость = Ложь;
	Элементы.ГруппаСписок.Видимость = Истина;
	Элементы.ДекорацияРазделительРегулировки.Видимость	= Ложь;
	ПокраситьКнопкиВидАРМНаСервере(2);
КонецПроцедуры

&НаКлиенте
Процедура СменитьЭтап(Команда)
	
	CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.АРММоиПродажи.Удобство.СменаЭтаповИнтересаЧерезКонтекстноеМеню");
	
	Если Не СтрНачинаетсяС(Команда.Имя, "Х_СменитьЭтап_На_") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЭлементЭтапа = ТекущийЭлемент;
	
	Если ТекущийЭлементЭтапа = Неопределено
			Или Не СтрНачинаетсяС(ТекущийЭлементЭтапа.Имя, "Этап_") Тогда
		Возврат;
	КонецЕсли;
	
	СрезИдентификатораПриемника = Сред(Команда.Имя, 1, СтрНайти(Команда.Имя, "_С_") - 1);
	СрезИдентификатораПриемника = СтрЗаменить(СрезИдентификатораПриемника, "Х_СменитьЭтап_На_", "");
	
	// Программная имитация начала перетаскивания.
	
	ПеретаскиваемыйОбъект = ТекущийЭлементЭтапа.ТекущиеДанные.Объект;
	
	ПараметрыПеретаскивания = Новый Структура;
	ПараметрыПеретаскивания.Вставить("Действие",			ДействиеПеретаскивания.Копирование);
	ПараметрыПеретаскивания.Вставить("ДопустимыеДействия",	ДопустимыеДействияПеретаскивания.Копирование);
	ПараметрыПеретаскивания.Вставить("Значение",			ПеретаскиваемыйОбъект);
	
	ФлагВыполнения = Истина;
	
	ТаблицаОбработкаНачалоПеретаскивания(ТекущийЭлементЭтапа, ПараметрыПеретаскивания, ФлагВыполнения);
	
	Если Не ФлагВыполнения Тогда
		СообщениеОшибки =
			НСтр("en = 'The element stage change could not be performed.'; ru = 'Не удалось выполнить смену этапа элемента.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОшибки);
		Возврат;
	КонецЕсли;
	
	// Программная имитация перетаскивания.
	
	ЭлементПриемникПеретаскивания = Элементы.Найти("Этап_" + СрезИдентификатораПриемника);
	
	Если ЭлементПриемникПеретаскивания = Неопределено Тогда
		СообщениеОшибки =
			НСтр("en = 'The element stage change could not be performed.'; ru = 'Не удалось выполнить смену этапа элемента.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОшибки);
		Возврат;
	КонецЕсли;
	
	ТаблицаОбработкаПеретаскивание(
		ЭлементПриемникПеретаскивания,
		ПараметрыПеретаскивания,
		Истина,
		Неопределено,
		Неопределено);
	
КонецПроцедуры // СменитьЭтап()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьДанныеВоронкиПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпПустыеПодраздеоения
	|ИЗ
	|	(ВЫБРАТЬ
	|		CRM_СостоянияИнтересов.Ссылка КАК Ссылка,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_СостоянияИнтересовПодразделения.Ссылка) КАК Ссылка1
	|	ИЗ
	|		Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.Подразделения КАК CRM_СостоянияИнтересовПодразделения
	|			ПО CRM_СостоянияИнтересов.Ссылка = CRM_СостоянияИнтересовПодразделения.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		CRM_СостоянияИнтересов.Ссылка) КАК ВложенныйЗапрос
	|ГДЕ
	|	ЕСТЬNULL(ВложенныйЗапрос.Ссылка1, 0) = 0
	|	И ВложенныйЗапрос.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_СостоянияИнтересовПодразделения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпДоступныеПоПодразделению
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов.Подразделения КАК CRM_СостоянияИнтересовПодразделения
	|ГДЕ
	|	CRM_СостоянияИнтересовПодразделения.Подразделение В ИЕРАРХИИ(&Подразделение)
	|	И CRM_СостоянияИнтересовПодразделения.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.Пустаяссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	тмпПустыеПодраздеоения.Ссылка
	|ИЗ
	|	тмпПустыеПодраздеоения КАК тмпПустыеПодраздеоения
	|
	|СГРУППИРОВАТЬ ПО
	|	тмпПустыеПодраздеоения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ВоронкиПродажСостав.Ссылка.Родитель КАК Воронка
	|ИЗ
	|	Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
	|ГДЕ
	|	CRM_ВоронкиПродажСостав.ТочкаМаршрута ССЫЛКА Справочник.CRM_СостоянияИнтересов
	|	И НЕ CRM_ВоронкиПродажСостав.Ссылка.ПометкаУдаления
	|	И (CRM_ВоронкиПродажСостав.Ссылка.Родитель.СценарийИнтереса В
	|				(ВЫБРАТЬ
	|					тмпДоступныеПоПодразделению.Ссылка КАК Ссылка
	|				ИЗ
	|					тмпДоступныеПоПодразделению КАК тмпДоступныеПоПодразделению)
	|			ИЛИ CRM_ВоронкиПродажСостав.Ссылка.Родитель.СценарийИнтереса = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка))
	|	И НЕ ЕСТЬNULL(CRM_ВоронкиПродажСостав.Ссылка.Родитель.СценарийИнтереса.ЭтоПоддержка, ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_ВоронкиПродажСостав.Ссылка.Родитель.Наименование";
	Запрос.УстановитьПараметр("Подразделение", ТекущийПользователь.Подразделение);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокВоронок.Добавить(ВыборкаДетальныеЗаписи.Воронка); 
	КонецЦикла;
	ВоронкаИнтересы = СписокВоронок.НайтиПоЗначению(Справочники.CRM_ВоронкиПродаж.Интересы);
	
	Если ВоронкаИнтересы <> Неопределено Тогда
		ВоронкаПродаж = ВоронкаИнтересы.Значение;
	Иначе
		ВоронкаПродаж = ?(СписокВоронок.Количество() <> 0, СписокВоронок[0].Значение, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВоронкаПродажПриИзмененииНаСервере()
	
	УдалитьЭтапыВоронкиНаСервере();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ВоронкиПродажСостав.Ссылка
	|ИЗ
	|	Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
	|ГДЕ
	|	CRM_ВоронкиПродажСостав.Ссылка.Родитель = &ВоронкаПродаж
	|	И CRM_ВоронкиПродажСостав.ТочкаМаршрута ССЫЛКА Справочник.CRM_СостоянияИнтересов
	|	И НЕ CRM_ВоронкиПродажСостав.Ссылка.ПометкаУдаления
	|	И НЕ CRM_ВоронкиПродажСостав.ТочкаМаршрута.ПометкаУдаления
	|	И НЕ CRM_ВоронкиПродажСостав.ТочкаМаршрута.Завершено
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_ВоронкиПродажСостав.Ссылка.РеквизитДопУпорядочивания";
	Запрос.УстановитьПараметр("ВоронкаПродаж", ВоронкаПродаж);
	
	ТаблицаЭтапы.Очистить();
	ТабВоронка = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТабВоронка Цикл
		НоваяСтрока = ТаблицаЭтапы.Добавить();
		НоваяСтрока.Ссылка = Строка.Ссылка;
		НоваяСтрока.Идентификатор = Строка(НоваяСтрока.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Имя = "Этап_" + СтрЗаменить(НоваяСтрока.Идентификатор, "-", "_");
		Спс = Новый СписокЗначений;
		Для Каждого Строка Из Строка.Ссылка.Состав Цикл
			Спс.Добавить(Строка.ТочкаМаршрута);	
		КонецЦикла;	
		НоваяСтрока.СписокСостояний = Спс;
	КонецЦикла;	
	
	ДобавитьЭтапыВоронкиНаСервере();
	НастроитьПорядокТаблиц();
	
	НастройкиШирины = ХранилищеОбщихНастроек.Загрузить("МоиПродажиНастройкиШириныКолонок");
	Если НастройкиШирины = Неопределено Тогда
		ШиринаКолонокКанбан = 30;
	Иначе
		НастройкиШирины.Свойство("Ширина"+СтрЗаменить(Строка(ВоронкаПродаж.УникальныйИдентификатор()),
			 "-", ""), ШиринаКолонокКанбан);
		Если ШиринаКолонокКанбан = 0 Тогда
			НастройкиШирины.Свойство("ОбщаяНастройка", ШиринаКолонокКанбан);
		КонецЕсли;
	КонецЕсли;
	УстановитьШиринуКолонокКанбанСервер();
	Элементы.НастройкаСценария.Видимость = НЕ ВоронкаПродаж.СценарийИнтереса.Пустая();
	
	КомандаВыборСценария = Команды.Найти("ВыборСценария");
	Если ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса) Тогда
		КомандаВыборСценария.Подсказка	= ВоронкаПродаж.СценарийИнтереса.Наименование;
	Иначе
		КомандаВыборСценария.Подсказка	= НСтр("ru='Выбор сценария'");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОбъекта(ВыбраннаяСтрока)
	
	ЭтоCRM_ОбъектыАРМ = (ТипЗнч(ВыбраннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.CRM_ОбъектыАРМ")
		Или ТипЗнч(ВыбраннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.CRM_ОбъектыАРМ_Обращения"));
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Объект", ?(ЭтоCRM_ОбъектыАРМ, ВыбраннаяСтрока.Объект, ВыбраннаяСтрока.Ссылка));
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаСервере
Функция ПолучитьЭтапВоронки(ИДЭтапа)
	Возврат Справочники.CRM_ВоронкиПродаж.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДЭтапа));
КонецФункции

&НаСервере
Функция ПолучитьОбъектЗаписи(ВыбраннаяСтрока)
	
	СтруктураОбъекта = ПолучитьСтруктуруОбъекта(ВыбраннаяСтрока);
	Возврат СтруктураОбъекта.Объект;
	
КонецФункции

&НаСервере
Функция ПолучитьСруктуруПереноса(ИДЭтапа, ВыбраннаяСтрока)
	СтруктураОбъекта = Новый Структура;
	Если ИДЭтапа <> "" Тогда
		СтруктураОбъекта.Вставить("Этап", ПолучитьЭтапВоронки(ИДЭтапа));
	КонецЕсли;
	СтруктураОбъекта.Вставить("Объект", ПолучитьОбъектЗаписи(ВыбраннаяСтрока));
	СтруктураОбъекта.Вставить("СостояниеИнтереса", ВыбраннаяСтрока.СостояниеИнтереса);
	Возврат СтруктураОбъекта;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСостоянияИнтересаПоВоронке(ЭтапВоронки, СостояниеИнтереса = Неопределено)
	СписокСостояний = Новый СписокЗначений;
	Для Каждого СтрокаТЧ Из ЭтапВоронки.Состав Цикл
		Если ТипЗнч(СтрокаТЧ.ТочкаМаршрута) = Тип("СправочникСсылка.CRM_СостоянияИнтересов")
				И (НЕ ЗначениеЗаполнено(СостояниеИнтереса) ИЛИ СтрокаТЧ.ТочкаМаршрута.Родитель = СостояниеИнтереса.Родитель) Тогда
			СписокСостояний.Добавить(СтрокаТЧ.ТочкаМаршрута);
		КонецЕсли;
	КонецЦикла;
	Возврат СписокСостояний;
КонецФункции

&НаСервере
Функция НеобходимоЗаполнитьРеквизиты(Состояние, ПроверяемыеРеквизитыИнтереса, Интерес)
	НеобходимоЗаполнитьРеквизиты = Ложь;
	Если ЗначениеЗаполнено(Состояние) Тогда
		Для каждого ПроверяемыйРеквизит из ПроверяемыеРеквизитыИнтереса Цикл
			Если ТипЗнч(ПроверяемыйРеквизит) = Тип("Строка") Тогда 
				Если НЕ ЗначениеЗаполнено(Интерес[ПроверяемыйРеквизит]) Тогда
					НеобходимоЗаполнитьРеквизиты = Истина;
					Прервать;
				КонецЕсли;
			Иначе
				СтрДопРек = Интерес.ДополнительныеРеквизиты.Найти(Новый Структура("Свойство", ПроверяемыйРеквизит));
				Если СтрДопРек<>Неопределено Тогда
					Если НЕ ЗначениеЗаполнено(СтрДопРек.Значение) Тогда
						НеобходимоЗаполнитьРеквизиты = Истина;
						Прервать;
					КонецЕсли;
				Иначе
					НеобходимоЗаполнитьРеквизиты = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если НЕ ЗначениеЗаполнено(Интерес.Партнер) Тогда
			НеобходимоЗаполнитьРеквизиты = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат НеобходимоЗаполнитьРеквизиты;
КонецФункции

&НаСервере
Функция ПолучитьСостояниеИнтересаИнтересЗакрыт(Интерес)
	Возврат Справочники.CRM_СостоянияИнтересов.УспешноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель);
КонецФункции

&НаСервере
Функция ПолучитьСостояниеИнтересаИнтересПотерян(Интерес)
	Возврат Справочники.CRM_СостоянияИнтересов.НеудачноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель);
КонецФункции

&НаСервере
Функция ПолучитьВоронкуПродажПоСценарию(Сценарий)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВоронкиПродаж.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ВоронкиПродаж КАК CRM_ВоронкиПродаж
	                      |ГДЕ
	                      |	CRM_ВоронкиПродаж.Родитель = Значение(Справочник.CRM_ВоронкиПродаж.ПустаяСсылка)
	                      |	И CRM_ВоронкиПродаж.СценарийИнтереса = &СценарийИнтереса");
	Запрос.УстановитьПараметр("СценарийИнтереса", Сценарий);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьСписокСостоянийСервер(Интерес, Задача, ЭтапВоронки = Неопределено)
	
	СписокСостояний = Новый СписокЗначений;
		
	РазрешеноПеремещатьЭтап			= Задача.БизнесПроцесс.КартаМаршрута.РазрешитьПеремещатьТекущийЭтап;
	РазрешеноДосрочноеЗавершение	= Задача.БизнесПроцесс.КартаМаршрута.РазрешеноДосрочноеЗавершение;
	
	НеФормируемЗадачи = Ложь;
	CRM_БизнесПроцессыСервер.ПроверитьВыполнениеГрупповойПереадресованнойЗадачи(Задача, НеФормируемЗадачи);
	
	СоответствиеЭтаповВариантам = Новый Соответствие;
	
	СписокЭтапов = Новый СписокЗначений;
	МассивЭтапов = Новый Массив;
	МассивЭтапов.Добавить(Задача.CRM_ТочкаМаршрута);
	
	МассивТочекЗавершения = Новый Массив;
	
	Если НЕ НеФормируемЗадачи ИЛИ РазрешеноПеремещатьЭтап Тогда
		
		СтруктураВариантовВыполнения = CRM_БизнесПроцессыСервер.ПолучитьВариантыВыполненияЗадачи(Задача);
		
		Если СтруктураВариантовВыполнения.СписокВариантов.Количество() = 0 Тогда
			ВариантВыполнения = 0;
			МассивИсходящихТочек = CRM_БизнесПроцессыЭкспортныеМетоды.ПолучитьСледующиеТочкиМаршрута(Задача.БизнесПроцесс,
				 Задача.CRM_ТочкаМаршрута,,,
				ВариантВыполнения);
			Для Каждого СтруктураИсхточки Из МассивИсходящихТочек Цикл
				СоответствиеЭтаповВариантам.Вставить(СтруктураИсхточки.ИсходящаяТочка,ВариантВыполнения);
				МассивЭтапов.Добавить(СтруктураИсхточки.ИсходящаяТочка);
				Если СтруктураИсхточки.ИсходящаяТочка.Вид = Перечисления.CRM_ВидыТочекМаршрута.Завершение Тогда
					МассивТочекЗавершения.Добавить(СтруктураИсхточки.ИсходящаяТочка);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ЭлементСписка Из СтруктураВариантовВыполнения.СписокВариантов Цикл
				ВариантВыполнения = ЭлементСписка.Значение;
				МассивИсходящихТочек = CRM_БизнесПроцессыЭкспортныеМетоды.ПолучитьСледующиеТочкиМаршрута(Задача.БизнесПроцесс,
					 Задача.CRM_ТочкаМаршрута,,,
					ВариантВыполнения);
				Для Каждого СтруктураИсхточки Из МассивИсходящихТочек Цикл
					СоответствиеЭтаповВариантам.Вставить(СтруктураИсхточки.ИсходящаяТочка,ВариантВыполнения);
					МассивЭтапов.Добавить(СтруктураИсхточки.ИсходящаяТочка);
					Если СтруктураИсхточки.ИсходящаяТочка.Вид = Перечисления.CRM_ВидыТочекМаршрута.Завершение Тогда
						МассивТочекЗавершения.Добавить(СтруктураИсхточки.ИсходящаяТочка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СписокЭтапов.ЗагрузитьЗначения(МассивЭтапов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Интерес",Интерес);
	Запрос.УстановитьПараметр("МассивЭтапов",МассивЭтапов);
	ТекстЗапроса = "ВЫБРАТЬ
	|	CRM_НастройкиЭтаповБизнесПроцессов.ТочкаМаршрута КАК Этап,
	|	ЕСТЬNULL(CRM_НастройкиЭтаповБизнесПроцессов.Состояние, ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)) КАК Состояние
	|ПОМЕСТИТЬ НастройкиЭтапов
	|ИЗ
	|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НастройкиЭтаповБизнесПроцессов КАК CRM_НастройкиЭтаповБизнесПроцессов
	|		ПО CRM_БизнесПроцесс.Ссылка = CRM_НастройкиЭтаповБизнесПроцессов.Объект
	|ГДЕ
	|	CRM_БизнесПроцесс.Интерес = &Интерес
	|	И НЕ CRM_БизнесПроцесс.ПометкаУдаления";
	Если НЕ РазрешеноПеремещатьЭтап Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И CRM_НастройкиЭтаповБизнесПроцессов.ТочкаМаршрута В(&МассивЭтапов)";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_СостоянияИнтересов.Ссылка,
	|	CRM_СостоянияИнтересов.ВероятностьСделки КАК ВероятностьСделки,
	|	CRM_СостоянияИнтересов.Наименование,
	|	ЕСТЬNULL(НастройкиЭтапов.Этап, ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)) КАК Этап
	|ИЗ
	|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиЭтапов КАК НастройкиЭтапов
	|		ПО CRM_СостоянияИнтересов.Ссылка = НастройкиЭтапов.Состояние
	|ГДЕ
	|	CRM_СостоянияИнтересов.ПометкаУдаления = ЛОЖЬ
	|	И CRM_СостоянияИнтересов.ВидДела = ЗНАЧЕНИЕ(Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес)
	|	И НЕ НастройкиЭтапов.Этап ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВероятностьСделки";
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Этап) Тогда
			
			Если СписокЭтапов.НайтиПоЗначению(Выборка.Этап) = Неопределено Тогда
				ВариантВыполнения=Неопределено;
				СтруктураСостояния = Новый Структура("Состояние, Этап, ВариантВыполнения, ЭтоПереход",
					Выборка.Ссылка,Выборка.Этап, ?(ВариантВыполнения=Неопределено,0,ВариантВыполнения),
					Истина);
				СписокСостояний.Добавить(СтруктураСостояния, Выборка.Наименование + " (" + Выборка.ВероятностьСделки + "%), "
					+ Выборка.Этап);
			Иначе
				ВариантВыполнения = СоответствиеЭтаповВариантам.Получить(Выборка.Этап);
				СтруктураСостояния = Новый Структура("Состояние, Этап, ВариантВыполнения, ЭтоПереход",Выборка.Ссылка,Выборка.Этап, ?(ВариантВыполнения=Неопределено,0,ВариантВыполнения),(НеФормируемЗадачи
					 И РазрешеноПеремещатьЭтап));
				СписокСостояний.Добавить(СтруктураСостояния, Выборка.Наименование + " (" + Выборка.ВероятностьСделки + "%), "
					+ Выборка.Этап);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЕстьНеудачныйВариант = Ложь;
	Для Каждого ТочкаЗавершения Из МассивТочекЗавершения Цикл
		ВариантВыполнения	= СоответствиеЭтаповВариантам.Получить(ТочкаЗавершения);
		Состояние			= ?(ТочкаЗавершения.ВариантЗавершения = Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно,
			Справочники.CRM_СостоянияИнтересов.НеудачноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель),
			Справочники.CRM_СостоянияИнтересов.УспешноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель));
		СтруктураСостояния	= Новый Структура("Состояние, Этап, ВариантВыполнения, ЭтоПереход",Состояние,
			ТочкаЗавершения, ?(ВариантВыполнения=Неопределено,0,ВариантВыполнения), (НеФормируемЗадачи
			 И РазрешеноПеремещатьЭтап));
		СписокСостояний.Добавить(СтруктураСостояния, Состояние.Наименование + " (" + Состояние.ВероятностьСделки + "%), "
			+ ТочкаЗавершения);
		Если НЕ ЕстьНеудачныйВариант Тогда
			ЕстьНеудачныйВариант =
				(ТочкаЗавершения.ВариантЗавершения = Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно);
		КонецЕсли;
	КонецЦикла;
	
	Если РазрешеноПеремещатьЭтап Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Задача.БизнесПроцесс.КартаМаршрута);
		Запрос.УстановитьПараметр("НомерВерсии", Задача.БизнесПроцесс.НомерВерсииКартыМаршрута);
		Запрос.УстановитьПараметр("МассивЭтапов", МассивТочекЗавершения);
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CRM_ТочкиМаршрутовИсходящиеТочки.ТочкаМаршрута
		|ИЗ
		|	Справочник.CRM_ТочкиМаршрутов.ИсходящиеТочки КАК CRM_ТочкиМаршрутовИсходящиеТочки
		|ГДЕ
		|	CRM_ТочкиМаршрутовИсходящиеТочки.Ссылка.Владелец = &Владелец
		|	И CRM_ТочкиМаршрутовИсходящиеТочки.НомерВерсии = &НомерВерсии";
		Если МассивТочекЗавершения.Количество() > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И НЕ CRM_ТочкиМаршрутовИсходящиеТочки.ТочкаМаршрута В(&МассивЭтапов)";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	И CRM_ТочкиМаршрутовИсходящиеТочки.ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.Завершение)";
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВариантВыполнения	=Неопределено;
			Состояние			= ?(Выборка.ТочкаМаршрута.ВариантЗавершения = Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно,
			Справочники.CRM_СостоянияИнтересов.НеудачноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель),
			Справочники.CRM_СостоянияИнтересов.УспешноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель));
			СтруктураСостояния	= Новый Структура("Состояние, Этап, ВариантВыполнения, ЭтоПереход",Состояние,
				Выборка.ТочкаМаршрута, ?(ВариантВыполнения=Неопределено,0,ВариантВыполнения),
				 Истина);
			СписокСостояний.Добавить(СтруктураСостояния, Состояние.Наименование + " (" + Состояние.ВероятностьСделки + "%), "
				+ Выборка.ТочкаМаршрута);
			Если НЕ ЕстьНеудачныйВариант Тогда
				ЕстьНеудачныйВариант =
					(Выборка.ТочкаМаршрута.ВариантЗавершения = Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	Если НЕ ЕстьНеудачныйВариант И РазрешеноДосрочноеЗавершение Тогда
		ВариантВыполнения	=Неопределено;
		Состояние			= Справочники.CRM_СостоянияИнтересов.НеудачноеЗавершениеСценария(Интерес.СостояниеИнтереса.Родитель);
		СтруктураСостояния	= Новый Структура("Состояние, Этап, ВариантВыполнения, ЭтоПереход",Состояние,
			 Справочники.CRM_ТочкиМаршрутов.ПустаяСсылка(), ?(ВариантВыполнения=Неопределено,0,
			ВариантВыполнения),
			 Истина);
		СписокСостояний.Добавить(СтруктураСостояния, Состояние.Наименование + " (" + Состояние.ВероятностьСделки + "%),
			| Досрочное завершение");
	КонецЕсли;
	
	Если ЭтапВоронки<>Неопределено Тогда
		СписокСостоянийОтбор = Новый СписокЗначений;
		Для Каждого ЭлементСписокаСостояний Из СписокСостояний Цикл
			Если НЕ ЭтапВоронки.Состав.Найти(ЭлементСписокаСостояний.Значение.Состояние, "ТочкаМаршрута") = Неопределено Тогда
				СписокСостоянийОтбор.Добавить(ЭлементСписокаСостояний.Значение,ЭлементСписокаСостояний.Представление);
			КонецЕсли;
		КонецЦикла;
		Возврат СписокСостоянийОтбор;
	Иначе		
		Возврат СписокСостояний;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыборСостоянияЗавершение(ДополнительныеПараметры)
	ПереносИнтересаЗавершение = Новый ОписаниеОповещения("ОбработатьИнтересЗавершение", ЭтотОбъект,
		 Новый Структура("Ссылка, ТекущееИзмерение, НовоеИзмерение, Период", ДополнительныеПараметры.Ссылка,
		 ДополнительныеПараметры.ТекущееИзмерение, ДополнительныеПараметры.НовоеИзмерение,
		 ДополнительныеПараметры.НачалоПериода));
	ПараметрыФормы = Новый Структура;
	
	Если ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		ПараметрыФормы.Вставить("ТелефонныйЗвонок", ДополнительныеПараметры.Ссылка);
		МассивСсылок = Новый Массив;
		ПараметрыФормы.Вставить("МассивСсылок",	МассивСсылок);		
		ПараметрыФормы.Вставить("НомерТелефона",
			 CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ДополнительныеПараметры.Ссылка,
			 "АбонентКакСвязаться"));
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СообщениеМессенджера", ДополнительныеПараметры.Ссылка);
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заявка", ДополнительныеПараметры.Ссылка);	
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ПараметрыФормы.Вставить("ПисьмоИсходящее", ДополнительныеПараметры.Ссылка);
		ПараметрыФормы.Вставить("ПереданаТолькоСсылкаПисьма", Истина);
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ПараметрыФормы.Вставить("ПисьмоВходящее", ДополнительныеПараметры.Ссылка);
		ПараметрыФормы.Вставить("ПереданаТолькоСсылкаПисьма", Истина);
	ИначеЕсли ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Диалог", ДополнительныеПараметры.Ссылка);
	КонецЕсли;
	ПараметрыФормы.Вставить("Сценарий",
		 CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ВоронкаПродаж,
		 "СценарийИнтереса"));
	ВременныеПараметрыОткрытияФормы = Новый Структура("ПараметрыФормы, ПереносИнтересаЗавершение",
		 ПараметрыФормы,
		 ПереносИнтересаЗавершение);
	ПодключитьОбработчикОжидания("ОткрытьФормуМастераРегистрацииОбращения", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодическоеОбновлениеСписков()
	
	Если ВводДоступен() Тогда
		Если ОбновитьОбращенияПриАктивации Тогда
			ОбновитьОбращенияПриАктивации = Ложь;
			ОтключитьОбработчикОжидания("ПериодическоеОбновлениеСписков");
			ПодключитьОбработчикОжидания("ПериодическоеОбновлениеСписков", НеРазобраноСводныеДанные_ПериодОбновления*60, Ложь);
		КонецЕсли;
	Иначе
		Если Не ОбновитьОбращенияПриАктивации Тогда
			ОбновитьОбращенияПриАктивации = Истина;
			ОтключитьОбработчикОжидания("ПериодическоеОбновлениеСписков");
			ПодключитьОбработчикОжидания("ПериодическоеОбновлениеСписков", 3, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// +Рарус alexpr
	//ТекущаяДата = ТекущаяДата();
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НеРазобрано, "ТекущаяДата", ТекущаяДата, Истина);
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НеРазобрано,
	//	 "ПериодПросроченных", НачалоДня(ТекущаяДата),
	//	 Истина);
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НеРазобрано, "ПериодТекущих",
	//	 КонецДня(ТекущаяДата),
	//	 Истина);
	// -Рарус alexpr
	
	ОбновитьТаблицы("НеРазобрано");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеудачноеЗавершениеСценария(ВоронкаПродаж)
	СостояниеИнтереса = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса) Тогда
		СостояниеИнтереса.Добавить(Справочники.CRM_СостоянияИнтересов.НеудачноеЗавершениеСценария(ВоронкаПродаж.СценарийИнтереса));
	Иначе
		ЗапросСостояний = Новый Запрос;
		ЗапросСостояний.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                        |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
		                        |ИЗ
		                        |	Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
		                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
		                        |		ПО CRM_ВоронкиПродажСостав.КартаМаршрута = CRM_СостоянияИнтересов.Родитель
		                        |			И (CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение))
		                        |ГДЕ
		                        |	CRM_ВоронкиПродажСостав.Ссылка.Родитель = &Воронка";
		ЗапросСостояний.УстановитьПараметр("Воронка", ВоронкаПродаж);
		ВыборкаСостояний = ЗапросСостояний.Выполнить().Выбрать();
		Пока ВыборкаСостояний.Следующий() Цикл
			СостояниеИнтереса.Добавить(ВыборкаСостояний.Ссылка);
		КонецЦикла;	
	КонецЕсли;
	Возврат СостояниеИнтереса;
КонецФункции

&НаСервереБезКонтекста
Функция УспешноеЗавершениеСценария(ВоронкаПродаж)
	СостояниеИнтереса = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса) Тогда
		СостояниеИнтереса.Добавить(Справочники.CRM_СостоянияИнтересов.УспешноеЗавершениеСценария(ВоронкаПродаж.СценарийИнтереса));
	Иначе
		ЗапросСостояний = Новый Запрос;
		ЗапросСостояний.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                        |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
		                        |ИЗ
		                        |	Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
		                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
		                        |		ПО CRM_ВоронкиПродажСостав.КартаМаршрута = CRM_СостоянияИнтересов.Родитель
		                        |			И (CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение))
		                        |ГДЕ
		                        |	CRM_ВоронкиПродажСостав.Ссылка.Родитель = &Воронка";
		ЗапросСостояний.УстановитьПараметр("Воронка", ВоронкаПродаж);
		ВыборкаСостояний = ЗапросСостояний.Выполнить().Выбрать();
		Пока ВыборкаСостояний.Следующий() Цикл
			СостояниеИнтереса.Добавить(ВыборкаСостояний.Ссылка);
		КонецЦикла;	
	КонецЕсли;
	Возврат СостояниеИнтереса;
КонецФункции

&НаСервере
Функция ИсточникиЛидовСценария(СценарийИнтереса)
	
	Если Не ЗначениеЗаполнено(СценарийИнтереса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// +Рарус alexpr
	//Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//                      |	CRM_ИсточникиПолученияЛидовСценарии.Ссылка КАК Ссылка
	//                      |ИЗ
	//                      |	Справочник.CRM_ИсточникиПолученияЛидов.CRM_Сценарии КАК CRM_ИсточникиПолученияЛидовСценарии
	//                      |ГДЕ
	//                      |	CRM_ИсточникиПолученияЛидовСценарии.Сценарий = &Сценарий
	//                      |	И НЕ CRM_ИсточникиПолученияЛидовСценарии.Ссылка.ПометкаУдаления
	//                      |	И CRM_ИсточникиПолученияЛидовСценарии.Ссылка.Включено
	//                      |	И CRM_ИсточникиПолученияЛидовСценарии.Ссылка.CRM_ИсточникЛидов
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка
	//                      |ИЗ
	//                      |	Справочник.CRM_УчетныеЗаписиМессенджеров.CRM_Сценарии КАК CRM_УчетныеЗаписиМессенджеровСценарии
	//                      |ГДЕ
	//                      |	CRM_УчетныеЗаписиМессенджеровСценарии.Сценарий = &Сценарий
	//                      |	И НЕ CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка.ПометкаУдаления
	//                      |	И CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка.Включена
	//                      |	И CRM_УчетныеЗаписиМессенджеровСценарии.Ссылка.CRM_ИсточникЛидов
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка
	//                      |ИЗ
	//                      |	Справочник.УчетныеЗаписиЭлектроннойПочты.CRM_Сценарии КАК УчетныеЗаписиЭлектроннойПочтыСценарии
	//                      |ГДЕ
	//                      |	УчетныеЗаписиЭлектроннойПочтыСценарии.Сценарий = &Сценарий
	//                      |	И НЕ УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка.ПометкаУдаления
	//                      |	И УчетныеЗаписиЭлектроннойПочтыСценарии.Ссылка.CRM_ИсточникЛидов");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_ИсточникиПолученияЛидов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_ИсточникиПолученияЛидов КАК CRM_ИсточникиПолученияЛидов
	|ГДЕ
	|	НЕ CRM_ИсточникиПолученияЛидов.ПометкаУдаления
	|	И CRM_ИсточникиПолученияЛидов.Включено
	|	И CRM_ИсточникиПолученияЛидов.CRM_ИсточникЛидов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка
	|ИЗ
	|	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|ГДЕ
	|	НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления
	|	И CRM_УчетныеЗаписиМессенджеров.Включена
	|	И CRM_УчетныеЗаписиМессенджеров.CRM_ИсточникЛидов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	НЕ УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления
	|	И УчетныеЗаписиЭлектроннойПочты.CRM_ИсточникЛидов");
	
	// -Рарус alexpr
	
	Запрос.УстановитьПараметр("Сценарий", СценарийИнтереса);
	МассивИсточников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если ПроверитьОтборПоСценариюТелефония(СценарийИнтереса) Тогда
		МассивИсточников.Добавить(Неопределено);
	КонецЕсли;
	
	Возврат МассивИсточников;
	
КонецФункции

&НаСервере
Функция ПроверитьОтборПоСценариюТелефония(СценарийИнтереса)
	
	// +Рарус alexpr
	//Если Не ЗначениеЗаполнено(СценарийИнтереса) Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//СценарииОбработки = Константы.сфпНастройкиТелефонии_СценарииОбработки.Получить().Получить();
	//Если СценарииОбработки = Неопределено Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//ИсточникОбращения = Новый Структура;
	//ИсточникОбращения.Вставить("CRM_ИсточникЛидов", Константы.сфпНастройкиТелефонии_ИсточникЛидов.Получить());
	//ИсточникОбращения.Вставить("СценарииОбработки",
	//	 Константы.сфпНастройкиТелефонии_СценарииОбработки.Получить().Получить());
	//
	//Если ИсточникОбращения.CRM_ИсточникЛидов Тогда
	//	
	//	Для Каждого СтрокаПравил Из ИсточникОбращения.СценарииОбработки Цикл
	//		Если СтрокаПравил.Сценарий = СценарийИнтереса Тогда
	//			Возврат Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	Возврат Истина;
	//КонецЕсли;
	//
	//Возврат Ложь;
	
	Возврат Истина;
	
	// -Рарус alexpr
	
КонецФункции

#Область ДействияСИнтересами

&НаКлиенте
Процедура ОткрытьФормуМастераРегистрацииОбращения()
	ПараметрыФормы = Новый Структура("Обращение, Сценарий", "МоиПродажи",
		 CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ВоронкаПродаж,
		 "СценарийИнтереса"));
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма",
		 ВременныеПараметрыОткрытияФормы.ПараметрыФормы, ЭтотОбъект,, ,,
		 ВременныеПараметрыОткрытияФормы.ПереносИнтересаЗавершение,);
КонецПроцедуры

&НаСервере
Функция ОткрыватьФормуПереносаИнтереса(Состояние, Интерес, Задача)
	
	СостояниеИнтереса = ?(ТипЗнч(Состояние)=Тип("Структура"), Состояние.Состояние, Состояние);
	
	УказыватьДостигнутыйРезультат = Ложь;
	Если ЗначениеЗаполнено(Задача) Тогда
		НастройкиЭтапа = CRM_БизнесПроцессыИЗадачиВызовСервера.ПолучитьНастройкиЭтапа(Задача);
		УказыватьДостигнутыйРезультат = НастройкиЭтапа.ЗапрашиватьРезультатВыполненияПриЗавершении;
	ИначеЕсли СостояниеИнтереса.УказыватьДостигнутыйРезультат Тогда
		Если ЗначениеЗаполнено(СостояниеИнтереса.ЗавершатьЗапланированныеАктивности) Тогда
			Если СостояниеИнтереса.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.Взаимодействия Тогда
				ТипАктивности = Перечисления.CRM_ТипыАктивности.Взаимодействие;
			ИначеЕсли СостояниеИнтереса.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.Задачи Тогда
				ТипАктивности = Перечисления.CRM_ТипыАктивности.Задача;
			Иначе
				ТипАктивности = Неопределено;
			КонецЕсли;
			УказыватьДостигнутыйРезультат = РегистрыСведений.CRM_ЗапланированныеАктивности.ЕстьАктивностиКЗавершению(Интерес,
				 ТипАктивности,
				 СостояниеИнтереса.ОтборЗавершаемыхАктивностей);
		КонецЕсли;
	КонецЕсли;
	
	ПроверяемыеРеквизитыИнтереса =
		CRM_КонтрольЗаполненностиРеквизитовОбъектовПовтИсп.ПроверяемыеРеквизитыИнтересаВСостоянии(СостояниеИнтереса);
	
	ОграничитьОтветственного = ЗначениеЗаполнено(СостояниеИнтереса) И НЕ СостояниеИнтереса.РазрешитьРолевуюАдресацию
								И ТипЗнч(Интерес.Ответственный) = Тип("СправочникСсылка.РолиИсполнителей");
	
	Возврат УказыватьДостигнутыйРезультат 
				ИЛИ СостояниеИнтереса.ИнтерактивноеПланированиеАктивностей
				ИЛИ НеобходимоЗаполнитьРеквизиты(СостояниеИнтереса, ПроверяемыеРеквизитыИнтереса, Интерес)
				ИЛИ ОграничитьОтветственного;
	
КонецФункции

&НаКлиенте
Процедура ПеренаправитьОбращение(Ответственный = Неопределено, ТипОтветственного = Неопределено, ИмяКоманды="")
	
	Если ВидАРМ = "Канбан" Тогда
		ТекущиеДанные = Элементы[АктивнаяТаблица].ТекущиеДанные;
		ТекущаяСтрока = Элементы[АктивнаяТаблица].ТекущаяСтрока;
	Иначе
		ТекущиеДанные = Элементы.ТаблицаСписок.ТекущиеДанные;
		ТекущаяСтрока = Элементы.ТаблицаСписок.ТекущаяСтрока;
	КонецЕсли;
	
	ТекущееОбращение = ПолучитьОбъектЗаписи(ТекущаяСтрока);
	Если ТипЗнч(ТекущееОбращение) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ТекущийОтветственный = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ТекущееОбращение, "Ответственный");
	ИначеЕсли ТипЗнч(ТекущееОбращение) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		// Для сообщения мессенджера текущим объектом устанавливается диалог, так как ответственного требуется установить в обоих объекта
		ТекущееОбращение = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ТекущееОбращение, "Диалог");
		ТекущийОтветственный = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ТекущееОбращение, "Ответственный");
		
		Если ИмяКоманды = "ПринятьВРаботу" Тогда
			// В ситуации, когда диалог перенаправлен пользователю, ответственный уже установлен, а сам диалог в работу еще не принят
			// поэтому сравнивать ответственного нет смысла. Нужно принять диалог.
			CRM_РаботаСМессенджерамиСервер.ПринятьДиалог(ТекущееОбращение);
			Возврат;
		КонецЕсли;
	Иначе
		ТекущийОтветственный = ТекущиеДанные.Ответственный;
	КонецЕсли;
	
	Если ТекущийОтветственный = Ответственный Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипОтветственного) Тогда
		ТипОтветственного = Тип("СправочникСсылка.Пользователи");
	КонецЕсли;
	Если (ТипОтветственного = Тип("СправочникСсылка.РолиИсполнителей"))
		 И (ТипЗнч(ТекущееОбращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Переадресация исходящих писем на роль исполнителя не поддерживается'"));
		Возврат;
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущееОбращение", ТекущееОбращение);
	ДополнительныеПараметры.Вставить("ТекущийОтветственный", ТекущийОтветственный);
	ДополнительныеПараметры.Вставить("ТипОтветственного", ТипОтветственного);
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПеренаправитьОбращениеЗавершение", ЭтотОбъект,
		 ДополнительныеПараметры);
	Если Ответственный = Неопределено Тогда
		Если ТипОтветственного = Тип("СправочникСсылка.Пользователи") Тогда
			ОткрытьФорму("ОбщаяФорма.CRM_ПодборПользователейПоТипуУслуги",,ЭтотОбъект,,,, ОповещениеЗавершения);
		ИначеЕсли ТипОтветственного = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			ОткрытьФорму("Справочник.РолиИсполнителей.ФормаВыбора",,ЭтотОбъект,,,, ОповещениеЗавершения);
		КонецЕсли;
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Ответственный);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьОбращениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ТипЗнч(Результат) = ДополнительныеПараметры.ТипОтветственного Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = ДополнительныеПараметры.ТекущийОтветственный Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = ПредопределенноеЗначение("Справочник.РолиИсполнителей.CRM_ДинамическаяАдресация") Тогда
		ТекстОшибки = НСтр("ru='Это служебная роль. Переадресация на нее не предусмотрена.'");
		ПоказатьПредупреждение(,ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеОбращений = Новый Массив;
	ДанныеОбращений.Добавить(ДополнительныеПараметры.ТекущееОбращение);
	ТекстОшибки = CRM_БизнесПроцессыИЗадачиСервер.УстановитьНовогоОтветственного(ДанныеОбращений, Результат);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	ОбновитьТаблицы(АктивнаяТаблица);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущуюЗадачуИнтереса(СтруктураЭтап)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Интерес",СтруктураЭтап.Объект);
	Запрос.УстановитьПараметр("CRM_СостояниеИнтереса",СтруктураЭтап.СостояниеИнтереса);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаИсполнителя.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.БизнесПроцесс.Интерес = &Интерес
	|	И ЗадачаИсполнителя.CRM_СостояниеИнтереса = &CRM_СостояниеИнтереса
	|	И НЕ ЗадачаИсполнителя.Выполнена";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Задачи.ЗадачаИсполнителя.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СкрытьОбъектВАРМ(Ссылка)
	Если Ссылка.Пустая() ИЛИ Ссылка.CRM_СкрытьВАРМ Тогда
		Возврат;
	КонецЕсли;
	Об = Ссылка.ПолучитьОбъект();
	Об.ДополнительныеСвойства.Вставить("НеЗапускатьТриггер", Истина);
	Об.CRM_СкрытьВАРМ = Истина;
	Об.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИнтересЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Успех Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Сообщение);
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("Состояние") И Результат.Свойство("НовоеСостояние") Тогда
		ОбработатьПараметрыОбновления(Результат);
		КолонкиАРМ = Новый Массив;
		КолонкиАРМ.Добавить(Результат.Состояние);
		КолонкиАРМ.Добавить(Результат.НовоеСостояние);
		ОбновитьТаблицы(КолонкиАРМ);
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
			Или ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок")
			Или ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("ДокументСсылка.CRM_Заявка") Тогда
			СкрытьОбъектВАРМ(ДополнительныеПараметры.Ссылка);
			ОбновитьТаблицы("НеРазобрано");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИнтересНаКлиенте(ПараметрыОбработки)
	
	ОбработатьИнтересНаСервере(ПараметрыОбработки);
	
	ОбработатьПараметрыОбновления(ПараметрыОбработки);
	КолонкиАРМ = Новый Массив;
	КолонкиАРМ.Добавить(ПараметрыОбработки.Состояние);
	КолонкиАРМ.Добавить(ПараметрыОбработки.НовоеСостояние);
	ОбновитьТаблицы(КолонкиАРМ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИнтересНаСервере(ПараметрыОбработки)
	
	Интерес = ПараметрыОбработки.Ссылка;
	Состояние = ПараметрыОбработки.НовоеСостояние;
	Задача = ПараметрыОбработки.Задача;
	
	ПараметрыОбработки.Вставить("Состояние", Интерес.СостояниеИнтереса);
	
	// обработка интереса
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачаИсполнителя.Ссылка КАК Задача
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.БизнесПроцесс.Интерес = &Интерес
	|	И ЗадачаИсполнителя.CRM_СостояниеИнтереса <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ ЗадачаИсполнителя.Выполнена";
	
	Запрос.УстановитьПараметр("Интерес", Интерес);
	ВыбранныеЗадачи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Задача");
	
	НачатьТранзакцию();
	
	Попытка
		СсылкаНаЗадачу = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
		СостояниеИнтереса = ?(ТипЗнч(Состояние)=Тип("Структура"), Состояние.Состояние, Состояние);
		
		Если ЗначениеЗаполнено(Задача) И ВыбранныеЗадачи.Найти(Задача) <> Неопределено Тогда
			ВариантВыполнения = Состояние.ВариантВыполнения;
			Этап = Состояние.Этап;
			Если Состояние.ЭтоПереход Тогда
				Если (СостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение
					 И Этап = Справочники.CRM_ТочкиМаршрутов.ПустаяСсылка())
					ИЛИ Этап.Вид = Перечисления.CRM_ВидыТочекМаршрута.Завершение Тогда
					
					ПараметрыДосрочногоЗавершения = Новый Структура();
					ПараметрыДосрочногоЗавершения.Вставить("ЗавершенДосрочно"				,Истина);
					ПараметрыДосрочногоЗавершения.Вставить("ПричинаДосрочногоЗавершения"	,
						Справочники.CRM_ПричиныОтказов.ПустаяСсылка());
					ПараметрыДосрочногоЗавершения.Вставить("Задача"							,Задача);
					
					Если Этап = Справочники.CRM_ТочкиМаршрутов.ПустаяСсылка() Тогда
						ПараметрыДосрочногоЗавершения.Вставить("ЭтапДосрочногоЗавершения"	,Задача.CRM_ТочкаМаршрута);
						ПараметрыДосрочногоЗавершения.Вставить("ВариантЗавершения"			,
							Справочники.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно);
					Иначе
						ПараметрыДосрочногоЗавершения.Вставить("ЭтапДосрочногоЗавершения"	,Этап);
						ПараметрыДосрочногоЗавершения.Вставить("ВариантЗавершения"			,Этап.ВариантЗавершения);
					КонецЕсли;
					
					CRM_БизнесПроцессыСервер.ЗавершитьДосрочноБизнесПроцесс(ПараметрыДосрочногоЗавершения);
				Иначе
					CRM_БизнесПроцессыСервер.ВыполнитьПереходБизнесПроцессаНаЭтап(Задача.БизнесПроцесс, Этап);
				КонецЕсли;
			Иначе
				ЗадачаОбъект = Задача.ПолучитьОбъект();
				ЗадачаОбъект.CRM_ВариантВыполнения = ВариантВыполнения;
				Попытка
					ЗадачаОбъект.CRM_ВариантВыполненияСтрокой = CRM_БизнесПроцессыСервер.ПолучитьПредставлениеВариантаУсловия(ЗадачаОбъект.CRM_ТочкаМаршрута,
					ВариантВыполнения,
					ЗадачаОбъект.БизнесПроцесс.НомерВерсииКартыМаршрута);
				Исключение
					ЗадачаОбъект.CRM_ВариантВыполненияСтрокой = "";
				КонецПопытки;
				ЗадачаОбъект.Записать();
				
				CRM_БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(Задача,,Неопределено,,);
			КонецЕсли;
			
			Если НЕ Задача.БизнесПроцесс.Завершен Тогда
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Интерес",Интерес);
				Запрос.УстановитьПараметр("CRM_СостояниеИнтереса", СостояниеИнтереса);
				Запрос.Текст = "ВЫБРАТЬ
				|	ЗадачаИсполнителя.Ссылка
				|ИЗ
				|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
				|ГДЕ
				|	ЗадачаИсполнителя.БизнесПроцесс.Интерес = &Интерес
				|	И ЗадачаИсполнителя.CRM_СостояниеИнтереса = &CRM_СостояниеИнтереса
				|	И НЕ ЗадачаИсполнителя.Выполнена";
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					СсылкаНаЗадачу = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Интерес.СостояниеИнтереса <> СостояниеИнтереса Тогда
			Если ЗначениеЗаполнено(СостояниеИнтереса.ЗавершатьЗапланированныеАктивности) Тогда
				Если СостояниеИнтереса.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.Взаимодействия Тогда
					ТипАктивности = Перечисления.CRM_ТипыАктивности.Взаимодействие;
				ИначеЕсли СостояниеИнтереса.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.Задачи Тогда
					ТипАктивности = Перечисления.CRM_ТипыАктивности.Задача;
				Иначе
					ТипАктивности = Неопределено;
				КонецЕсли;
				РегистрыСведений.CRM_ЗапланированныеАктивности.ЗавершитьАктивности(Интерес, "", ТипАктивности,
					 СостояниеИнтереса.ОтборЗавершаемыхАктивностей);
			КонецЕсли;
		
			МассивВидовВзаимодействий =
				Справочники.CRM_ВидыВзаимодействий.ПолучитьАвтоСоздаваемыеПоСостояниюИнтереса(СостояниеИнтереса);
			Для каждого ВидНовогоВзаимодействия Из МассивВидовВзаимодействий Цикл
				ПлановаяДата = ТекущаяДатаСеанса()+ВидНовогоВзаимодействия.ПлановыйСрокДней*60*60*24;
				НовоеВзаимодействие = Документы.CRM_Взаимодействие.СоздатьДокумент();
				НовоеВзаимодействие.Дата					= ТекущаяДатаСеанса();
				НовоеВзаимодействие.Автор					= ТекущийПользователь;
				НовоеВзаимодействие.Тема					= ВидНовогоВзаимодействия.Описание;
				НовоеВзаимодействие.Баллы					= ВидНовогоВзаимодействия.Баллы;
				НовоеВзаимодействие.ВидВзаимодействия		= ВидНовогоВзаимодействия;
				НовоеВзаимодействие.ДокументОснование		= Интерес;
				НовоеВзаимодействие.КонтактноеЛицо			= Интерес.КонтактноеЛицо;
				НовоеВзаимодействие.Ответственный			= Интерес.Ответственный;
				НовоеВзаимодействие.Партнер					= Интерес.Партнер;
				НовоеВзаимодействие.ПлановаяДата			= ПлановаяДата;
				НовоеВзаимодействие.Подразделение			= Интерес.Подразделение;
				НовоеВзаимодействие.ПотенциальныйКлиент		= Интерес.ПотенциальныйКлиент;
				НовоеВзаимодействие.Содержание				= ВидНовогоВзаимодействия.Описание;
				НовоеВзаимодействие.СостояниеИнтереса		= СостояниеИнтереса;
				НовоеВзаимодействие.СтатусВзаимодействия	= Справочники.CRM_СостоянияСобытий.Запланировано;
				НовоеВзаимодействие.Организация				= Интерес.Организация;
				НовоеВзаимодействие.ПлановаяДатаЗавершение	= ПлановаяДата + 60*15;
				НовоеВзаимодействие.Задача					= СсылкаНаЗадачу;
				НовоеВзаимодействие.Записать();
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(СсылкаНаЗадачу) Тогда
				ИнтересОбъект = Интерес.ПолучитьОбъект();
				ИнтересОбъект.СостояниеИнтереса = СостояниеИнтереса;
				ИнтересОбъект.Завершен = СостояниеИнтереса.Завершено;
				ИнтересОбъект.ДатаЗакрытия = ТекущаяДатаСеанса();
				ИнтересОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
		ТекстСообщения = "";
		Если ЗначениеЗаполнено(СостояниеИнтереса.ОбязательноеПланированиеАктивности) Тогда
			Если СостояниеИнтереса.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИЗадача Тогда
				Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Интерес,
					 Перечисления.CRM_ТипыАктивности.Взаимодействие); 
				РезультатПроверки = Истина;
				Если Результат = Неопределено Тогда
					ТекстСообщения =
						НСтр("ru='Нет запланированных взаимодействий по текущему интересу. Переход в состояние невозможен!';
						|en='There will be no planned interactions for the current lead. You can not record a document!'");
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
				Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Интерес,
					 Перечисления.CRM_ТипыАктивности.Задача); 
				Если Результат = Неопределено Тогда
					ТекстСообщения = НСтр("ru='Нет запланированных задач по текущему интересу. Переход в состояние невозможен!';
						|en='There are no scheduled tasks for the current lead. You can not record a document!'");
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			ИначеЕсли СостояниеИнтереса.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.Взаимодействие Тогда
				ТипАктивности = Перечисления.CRM_ТипыАктивности.Взаимодействие;
				ТекстСообщения =
					НСтр("ru='Нет запланированных взаимодействий по текущему интересу. Переход в состояние невозможен!';
					|en='There will be no planned interactions for the current lead. You can not record a document!'");
			ИначеЕсли СостояниеИнтереса.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.Задача Тогда
				ТипАктивности = Перечисления.CRM_ТипыАктивности.Задача;
				ТекстСообщения = НСтр("ru='Нет запланированных задач по текущему интересу. Переход в состояние невозможен!';
					|en='There are no scheduled tasks for the current lead. You can not record a document!'");
			Иначе 
				ТипАктивности = Неопределено;
				ТекстСообщения = НСтр("ru='Нет запланированных дел по текущему интересу. Переход в состояние невозможен!';
					|en='There are no scheduled activities for the current lead. You can not record a document!'");
			КонецЕсли;
			Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Интерес,
				 ТипАктивности); 
			Если Результат = Неопределено Тогда
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение	
		ОтменитьТранзакцию();
		Если ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Иначе 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПроверитьЧекЛист(Интерес)
	
	// +Рарус alexpr
	//Если Интерес.СостояниеИнтереса.ПроверкаВыполненияЧекЛиста 
	//	И Интерес.ЧекЛист.НайтиСтроки(Новый Структура("СостояниеИнтереса, Выполнено",
	//		 Интерес.СостояниеИнтереса,
	//		 Ложь)).Количество() > 0 Тогда
	//	
	//	Возврат Ложь;
	//КонецЕсли;
	// -Рарус alexpr
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура СкрытьПисьмоИзАРМНаСервере(ПричинаОтказа=Неопределено, Комментарий="", ПереноситьПисьмаВОбработанные = Истина)
	
	Если Элементы.НеРазобрано.ВыделенныеСтроки.Количество() > 0 Тогда
		
		Для Каждого  ТекСтрока Из Элементы.НеРазобрано.ВыделенныеСтроки Цикл
			Если ТекСтрока <> Неопределено Тогда
				СтруктураСтроки = ПолучитьСтруктуруОбъекта(ТекСтрока);
				Если ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ТелефонныйЗвонок")
					 ИЛИ ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
					ИЛИ ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
					ИЛИ ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.CRM_СообщениеМессенджера")
						 ИЛИ ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.CRM_Заявка") Тогда
					
					Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(СтруктураСтроки.Объект) Тогда
						
						СостояниеЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(СтруктураСтроки.Объект);
						
						Если РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(СтруктураСтроки.Объект) Тогда
							РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(СтруктураСтроки.Объект,
								 Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа,
								 Комментарий); 
						ИначеЕсли СостояниеЛида <> Неопределено и СостояниеЛида.Состояние = Справочники.CRM_СостоянияЛидов.Повторный Тогда
							РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(СтруктураСтроки.Объект,
																						Справочники.CRM_СостоянияЛидов.ПовторныйОбработанный,
																						СостояниеЛида.СконвертированВОбъект); 
						Иначе
							РегистрыСведений.CRM_СостоянияЛидов.УдалитьСостояниеЛида(СтруктураСтроки.Объект); 
						КонецЕсли;
						
					КонецЕсли;
					
					Об = ?(
						ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.CRM_СообщениеМессенджера"),
						СтруктураСтроки.Объект.Диалог.ПолучитьОбъект(),
						СтруктураСтроки.Объект.ПолучитьОбъект()
					);
					Об.CRM_СкрытьВАРМ = Истина;
					Об.Записать();
					
					Если ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
						
						// Перенос в обработанные осуществляется, если учетная запись конкретного письма разрешает данное действие,
						// а при наличии необходимости задавать вопрос о переносе - на него был дан утвердительный ответ ранее на стороне Клиента:
						Если Об.УчетнаяЗапись.CRM_ПереноситьВОбработанные И ПереноситьПисьмаВОбработанные Тогда						
							// +Рарус alexpr
							//Папка = CRM_УправлениеЭлектроннойПочтой.ПапкаУчетнойЗаписи(Об.УчетнаяЗапись, "Обработанные");
							Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Об.УчетнаяЗапись,
								Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные);
							// -Рарус alexpr
							Взаимодействия.УстановитьПапкуЭлектронногоПисьма(Об.Ссылка, Папка);
							
							ПрочитанныеПисьма = Новый Массив;
							ПрочитанныеПисьма.Добавить(Об.Ссылка);
							CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(ПрочитанныеПисьма, Истина);
						КонецЕсли;
						
					ИначеЕсли ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
						CRM_РаботаСМессенджерамиСервер.ЗавершитьДиалог(Об.Ссылка);
						CRM_РаботаСМессенджерамиСервер.ПометитьВходящиеКакПрочтенные(
							Об.УчетнаяЗапись,
							Об.Группа,
							Об.ID_Пользователя,
							Пользователи.ТекущийПользователь()
						);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьЛидыВВыбранныхСтроках()
	МассивСсылок = Новый Массив;
	Для Каждого  ТекСтрока Из Элементы.НеРазобрано.ВыделенныеСтроки Цикл
		СтруктураСтроки = ПолучитьСтруктуруОбъекта(ТекСтрока);
		МассивСсылок.Добавить(СтруктураСтроки.Объект);
	КонецЦикла;
	Возврат РегистрыСведений.CRM_СостоянияЛидов.ЕстьЛидыВМассивеСсылок(МассивСсылок, Истина);
КонецФункции

&НаКлиенте
Процедура ВопросПриПереносеВОбработанныеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПереноситьПисьмаВОбработанные = (Результат = КодВозвратаДиалога.Да);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		СкрытьПисьмоИзАРМНаСервере(ДополнительныеПараметры.ПричинаОтказа,
			 ДополнительныеПараметры.Комментарий,
			 ПереноситьПисьмаВОбработанные);
	Иначе
		СкрытьПисьмоИзАРМНаСервере(,,ПереноситьПисьмаВОбработанные);
	КонецЕсли;
	
	ОбновитьТаблицы("НеРазобрано");
	Оповестить("ОбновитьКонтактыДиалогов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры = Неопределено)
	ТекстВопроса = НСтр("ru = 'Перенести письмо в папку обработанные?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриПереносеВОбработанныеЗавершение",
		 ЭтотОбъект,
		 ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,,);
КонецПроцедуры

&НаСервере
Функция НеобходимоЗадатьВопросПриПереносеВОбработанные()
		
	Для Каждого ТекСтрока Из Элементы.НеРазобрано.ВыделенныеСтроки Цикл
		Если ТекСтрока <> Неопределено Тогда
			СтруктураСтроки = ПолучитьСтруктуруОбъекта(ТекСтрока);
			Если ТипЗнч(СтруктураСтроки.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
				УчетнаяЗапись = СтруктураСтроки.Объект.УчетнаяЗапись;
				Если УчетнаяЗапись.CRM_ЗадаватьВопросПриПереносеВОбработанные Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
					
КонецФункции

#КонецОбласти

#Область Колонки

&НаКлиенте
Процедура ОбновитьТаблицы(Колонки = Неопределено)
	
	Если ВидАРМ = "Канбан" Тогда
		
		Если Колонки = Неопределено Тогда
			
			КолонкиДляОбновления = ИменаТаблиц(ТаблицаЭтапы, "Канбан");
			
		ИначеЕсли ТипЗнч(Колонки) = Тип("Строка") Тогда
			
			КолонкиДляОбновления = Новый Массив;
			КолонкиДляОбновления.Добавить(Колонки);
			
		ИначеЕсли ТипЗнч(Колонки) = Тип("Массив") Тогда
			
			Если Колонки.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			КолонкиДляОбновления = Новый Массив;
			
			Для Каждого Колонка Из Колонки Цикл
				Если ТипЗнч(Колонка) = Тип("Строка") Тогда
					
					Если ИменаТаблиц(ТаблицаЭтапы).Найти(Колонка) <> Неопределено Тогда
						КолонкиДляОбновления.Добавить(Колонка);
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(Колонка) = Тип("СправочникСсылка.CRM_СостоянияИнтересов") Тогда
					
					Для Каждого Строка Из ТаблицаЭтапы Цикл
						Если Строка.СписокСостояний.НайтиПоЗначению(Колонка) <> Неопределено Тогда
							КолонкиДляОбновления.Добавить(Строка.Имя);
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого ИмяТаблицы Из КолонкиДляОбновления Цикл
			CRM_ОбщегоНазначенияКлиентСервер.ОбновлениеТаблицыФормы(Элементы[ИмяТаблицы]);
		КонецЦикла;
		
		КолонкиДляОбновления = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			КолонкиДляОбновления, ИменаТаблиц(ТаблицаЭтапы, "ВсеСвернутые"));
		
		ЗапуститьОбновлениеЗаголовков(КолонкиДляОбновления);
		
	Иначе
		
		CRM_ОбщегоНазначенияКлиентСервер.ОбновлениеТаблицыФормы(Элементы.ТаблицаСписок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаТаблиц(ТаблицаЭтапы, Режим = "Все")
	
	ИменаТаблиц = Новый Массив;
	
	Если Режим = "Все" Или Режим = "ВсеРазвернутые" Или Режим = "Канбан" Тогда
		ИменаТаблиц.Добавить("НеРазобрано");
		ИменаТаблиц.Добавить("ТаблицаНеудачно");
		ИменаТаблиц.Добавить("ТаблицаУспешно");
	КонецЕсли;
	
	Если Режим = "Все" Или Режим = "ВсеРазвернутые" Или Режим = "Канбан"
		Или Режим = "Динамические" Тогда
		Для Каждого Строка Из ТаблицаЭтапы Цикл
			ИменаТаблиц.Добавить(Строка.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Если Режим = "Все" Или Режим = "ВсеСвернутые" Или Режим = "Канбан" Тогда
		ИменаТаблиц.Добавить("ТаблицаНеудачноСвернуто");
		ИменаТаблиц.Добавить("ТаблицаУспешноСвернуто");
	КонецЕсли;
	
	Если Режим = "Все" Или Режим = "ВсеРазвернутые" Тогда
		ИменаТаблиц.Добавить("ТаблицаСписок");
	КонецЕсли;
	
	Возврат ИменаТаблиц;
	
КонецФункции

&НаСервере
Процедура НастроитьПорядокТаблиц()
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц(ТаблицаЭтапы, "ВсеРазвернутые") Цикл
		
		ЭлементыПользовательскихНастроек = ЭтотОбъект[ИмяТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		
		Для Каждого Элемент Из ЭлементыПользовательскихНастроек Цикл
			Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
				
				Элемент.Элементы.Очистить();
				
				ТаблицыБезПросрочки = Новый Массив;
				ТаблицыБезПросрочки.Добавить("НеРазобрано");
				ТаблицыБезПросрочки.Добавить("ТаблицаУспешно");
				ТаблицыБезПросрочки.Добавить("ТаблицаНеудачно");
				
				Если ТаблицыБезПросрочки.Найти(ИмяТаблицы) = Неопределено Тогда
					УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
					УсловиеСортировки.Использование = Истина;
					УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ПросроченоДляСортировки");
					УсловиеСортировки.ТипУпорядочивания = ?(ОтборВключатьПросроченные = 2,
						 НаправлениеСортировкиКомпоновкиДанных.Возр,
						 НаправлениеСортировкиКомпоновкиДанных.Убыв);
				КонецЕсли;
				
				УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				УсловиеСортировки.Использование = Истина;
				УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаДляСортировки");
				
				Если ТаблицыБезПросрочки.Найти(ИмяТаблицы) = Неопределено Тогда
					УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
				Иначе
					УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭтапыВоронкиНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.ТаблицаСписок,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()),
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
		 "ПустаяДата", Дата('00010101'),
		 Истина);
	СписокЦветов = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьСписокЦветов();
	
	ДобавитьТаблицуНеРазобрано();
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		
		Если Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита,
				 Новый ОписаниеТипов("ДинамическийСписок"),,
				"Поле таблицы"));
		КонецЕсли;
		
		ИмяРеквизитаСумма = "Декорация_"+ИмяРеквизита+"_Сумма";
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизитаСумма) Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаСумма, Новый ОписаниеТипов("ФорматированнаяСтрока")));
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		
		Если Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			
			ИндексЦвета = Строка.Ссылка.ИндексЦвета;
			
			ЭтотОбъект[ИмяРеквизита].ТекстЗапроса = ТекстЗапросаКолонкиАРМ();
			ЭтотОбъект[ИмяРеквизита].ОсновнаяТаблица = "Документ.CRM_Интерес";
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				"ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				"ПериодТекущих", КонецДня(ТекущаяДатаСеанса()), Истина);
			
			ДнейПоКалендарюНаСегодня = CRM_ОбщегоНазначенияСервер.КоличествоДнейСНачалаГодаПоКалендарю(Календарь,
				 ТекущаяДатаСеанса());
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ДнейПоКалендарюНаСегодня", ДнейПоКалендарюНаСегодня,
				 Истина);
			
			ЭтотОбъект[ИмяРеквизита].УстановитьОбязательноеИспользование("Объект", Истина);
			ЭтотОбъект[ИмяРеквизита].УстановитьОбязательноеИспользование("Пользователь", Истина);
			ЭтотОбъект[ИмяРеквизита].УстановитьОбязательноеИспользование("ОжидаемаяВыручка", Истина);
			
			УО = ЭтотОбъект[ИмяРеквизита].УсловноеОформление.Элементы;
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 211, 194));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 1; // красный
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 211, 194));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 1; // красный

			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 2; // желтый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоЗолотистый);
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 2; // желтый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(191, 238, 191));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 3; // зеленый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(191, 238, 191));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочено");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 3; // зеленый
			
			// Условное оформление СрокНаЭтапе
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='""Срок на этапе: ""Ч"" дн.""'");
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлементУсловия.ПравоеЗначение = 0; 
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(229, 249, 238));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапеСветофор");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 0; // зеленый
	
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 255, 220));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапеСветофор");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 1; // желтый
			
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 238, 233));
			ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
			ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("СрокНаЭтапе");
			ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокНаЭтапеСветофор");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = 2; // красный
			// -
			
			ГруппаЭлемент = Элементы.Добавить("Группа_"+ИмяРеквизита, Тип("ГруппаФормы"), Элементы.ГруппаСоставКолонок);
			ГруппаЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаЭлемент.ОтображатьЗаголовок = Ложь;
			ГруппаЭлемент.РастягиватьПоГоризонтали = Ложь;
			ГруппаЭлемент.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
						
			ДекорацияНазвание = Элементы.Добавить("Декорация_"+ИмяРеквизита, Тип("ДекорацияФормы"), ГруппаЭлемент);
			ДекорацияНазвание.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияНазвание.Заголовок = Строка.Ссылка.Наименование;
			ДекорацияНазвание.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияНазвание.Подсказка = Строка.Ссылка.Наименование;
			ДекорацияНазвание.Высота = 1;
			ДекорацияНазвание.РастягиватьПоГоризонтали = Истина;
			ДекорацияНазвание.РастягиватьПоВертикали = Ложь;
			ДекорацияНазвание.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияНазвание.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,13,Ложь);
			
			ГруппаНадписи = Элементы.Добавить("Группа_"+ИмяРеквизита+"_Надписи", Тип("ГруппаФормы"), ГруппаЭлемент);
			ГруппаНадписи.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНадписи.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаНадписи.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаНадписи.ОтображатьЗаголовок = Ложь;
			ГруппаНадписи.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;			
			
			ИмяРеквизитаСумма = "Декорация_"+ИмяРеквизита+"_Сумма";
			ДекорацияСумма = Элементы.Добавить(ИмяРеквизитаСумма, Тип("ПолеФормы"), ГруппаНадписи);
			ДекорацияСумма.Вид = ВидПоляФормы.ПолеНадписи;
			ДекорацияСумма.ПутьКДанным = ИмяРеквизитаСумма;
			ДекорацияСумма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ДекорацияСумма.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияСумма.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияСумма.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,10,Ложь);
			
			ГруппаТаблица = Элементы.Добавить("ГруппаТаблица_"+ИмяРеквизита, Тип("ГруппаФормы"), ГруппаЭлемент);
			ГруппаТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаТаблица.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаТаблица.ОтображатьЗаголовок = Ложь;
			ГруппаТаблица.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
			
			ДекорацияЦвет = Элементы.Добавить("ДекорацияЦвет_"+ИмяРеквизита, Тип("ДекорацияФормы"), ГруппаТаблица);
			ДекорацияЦвет.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияЦвет.Заголовок = "";
			ДекорацияЦвет.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ДекорацияЦвет.РастягиватьПоГоризонтали = Ложь;
			ДекорацияЦвет.АвтоМаксимальнаяШирина = Ложь;
			ДекорацияЦвет.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Истина);
			ДекорацияЦвет.ЦветФона = СписокЦветов.Получить(ИндексЦвета).Цвет;
			
			Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ТаблицаФормы"), ГруппаТаблица);
			Элемент.РежимВыделенияСтроки =РежимВыделенияСтрокиТаблицы.Строка;
			Элемент.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
			Элемент.РежимВыбора = Истина;
			Элемент.ОтображениеСостоянияПросмотра.Видимость = Истина;
			Элемент.ОтображениеСтрокиПоиска.Видимость = Истина;
			Элемент.КоманднаяПанель.Видимость = Ложь;
			Элемент.ПутьКДанным = ИмяРеквизита;
			Элемент.ПутьКДаннымКартинкиСтроки  = ИмяРеквизита+".Картинка";
			Элемент.КартинкаСтрок  = БиблиотекаКартинок.CRM_ЗвездочкаГолубая;
			Элемент.РазрешитьПеретаскивание = Истина;
			Элемент.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
			Элемент.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
			Элемент.ЧередованиеЦветовСтрок = Ложь;
			Элемент.Видимость = Истина;
			Элемент.Шапка = Ложь;
			Элемент.ГоризонтальныеЛинии = Истина;
			Элемент.ВертикальныеЛинии = Ложь;
			Элемент.УстановитьДействие("Выбор", "ТаблицаВыбор");
			Элемент.УстановитьДействие("Перетаскивание", "ТаблицаОбработкаПеретаскивание");
			Элемент.УстановитьДействие("ПередУдалением", "ТаблицаОбработкаПередУдалением");
			Элемент.УстановитьДействие("НачалоПеретаскивания", "ТаблицаОбработкаНачалоПеретаскивания");
			Элемент.УстановитьДействие("ПроверкаПеретаскивания", "ТаблицаОбработкаПроверкаПеретаскивания");
			Элемент.УстановитьДействие("ПередНачаломДобавления", "ТаблицаПередНачаломДобавления");
			Элемент.УстановитьДействие("ПриАктивизацииСтроки", "НеРазобраноПриАктивизацииСтроки");
			Элемент.Заголовок = Строка.Ссылка.Наименование;
			Элемент.КонтекстноеМеню.Видимость = Ложь;
			Для Каждого ЭлементМеню Из Элемент.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
				ЭлементМеню.Видимость = Ложь;
			КонецЦикла;
			СформироватьКонтекстноеМеню(Элемент.Имя);
			Элемент.ТолькоПросмотр = Истина;
			Элемент.Высота = 4;
			Элемент.РастягиватьПоВертикали = Истина;
			Элемент.АвтоМаксимальнаяВысота = Ложь;
			Элемент.АвтоМаксимальнаяШирина = Ложь;
			Элемент.РастягиватьПоГоризонтали = Ложь;
			Элемент.ЦветФона = ЦветаСтиля.CRM_СерыйДляПодложек;
			Элемент.ЦветРамки = ЦветаСтиля.ЦветФонаПоля;
			
			ГруппаСтрокаГлавная = Элементы.Добавить("ГруппаСтрокаГлавная_" + ИмяРеквизита,
				 Тип("ГруппаФормы"), Элементы[ИмяРеквизита]);
			ГруппаСтрокаГлавная.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаСтрокаГлавная.Группировка = ГруппировкаКолонок.Вертикальная;
			ГруппаСтрокаГлавная.ОтображатьЗаголовок = Ложь;
			
			ГруппаСтрока = Элементы.Добавить("ГруппаСтрока_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаСтрокаГлавная);
			ГруппаСтрока.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаСтрока.Группировка = ГруппировкаКолонок.Горизонтальная;
			ГруппаСтрока.ОтображатьЗаголовок = Ложь;
			
			ГруппаКолонок = Элементы.Добавить("ГруппаКолонок_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаСтрока);
			ГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
			ГруппаКолонок.ОтображатьЗаголовок = Ложь;
			
			ГруппаЗаголовок = Элементы.Добавить("ГруппаЗаголовок_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаКолонок);
			ГруппаЗаголовок.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаЗаголовок.Группировка = ГруппировкаКолонок.Горизонтальная;
			ГруппаЗаголовок.ОтображатьЗаголовок = Ложь;
 			ГруппаЗаголовок.РастягиватьПоГоризонтали = Ложь;

			КолонкаНаименование = Элементы.Добавить("Заголовок" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаЗаголовок);
			КолонкаНаименование.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаНаименование.ПутьКДанным = ИмяРеквизита + ".Заголовок";
			КолонкаНаименование.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаНаименование.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,10,Истина,Ложь,Ложь);
			КолонкаНаименование.РастягиватьПоГоризонтали = Ложь;
			
			// +Рарус alexpr
			//КолонкаСоисполнение = Элементы.Добавить("Соисполнение" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаЗаголовок);
			//КолонкаСоисполнение.Вид = ВидПоляФормы.ПолеКартинки;
			//КолонкаСоисполнение.ПутьКДанным = ИмяРеквизита + ".Соисполнение";
			//КолонкаСоисполнение.КартинкаЗначений = БиблиотекаКартинок.CRM_СоисполнениеКоллекция;
			//КолонкаСоисполнение.Ширина = 1;
			//КолонкаСоисполнение.ОтображатьВШапке = Ложь;
			//КолонкаСоисполнение.Подсказка = НСтр("ru = 'В соисполнении'");
			// -Рарус alexpr
			
			КолонкаПартнер = Элементы.Добавить("Партнер" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаКолонок);
			КолонкаПартнер.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаПартнер.ПутьКДанным = ИмяРеквизита + ".Партнер";
			КолонкаПартнер.ОтображатьВШапке = Ложь;
			КолонкаПартнер.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаПартнер.РастягиватьПоГоризонтали = Ложь;
			//
			КолонкаОписание = Элементы.Добавить("ОписаниеИнтереса" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаКолонок);
			КолонкаОписание.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаОписание.ПутьКДанным = ИмяРеквизита + ".ОписаниеИнтереса";
			КолонкаОписание.ОтображатьВШапке = Ложь;
			КолонкаОписание.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаОписание.РастягиватьПоГоризонтали = Ложь;
			
			КолонкаОписание = Элементы.Добавить("СрокНаЭтапе" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаКолонок);
			КолонкаОписание.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаОписание.ПутьКДанным = ИмяРеквизита + ".СрокНаЭтапе";
			КолонкаОписание.ОтображатьВШапке = Ложь;
			КолонкаОписание.ЦветФона = Новый Цвет(245, 245, 245);
			КолонкаОписание.Ширина = 1;
			КолонкаОписание.РастягиватьПоГоризонтали = Ложь;
			КолонкаОписание.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			
			КолонкаПросрочено = Элементы.Добавить("Просрочено" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
			КолонкаПросрочено.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаПросрочено.ПутьКДанным = ИмяРеквизита + ".Просрочено";
			КолонкаПросрочено.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Ложь,Ложь,Ложь);
			КолонкаПросрочено.ОтображатьВШапке = Ложь;
			КолонкаПросрочено.Ширина = 1;
			КолонкаПросрочено.РастягиватьПоГоризонтали = Ложь;
			
			КолонкаСумма = Элементы.Добавить("ОжидаемаяВыручка" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
			КолонкаСумма.Вид = ВидПоляФормы.ПолеВвода;
			КолонкаСумма.ПутьКДанным = ИмяРеквизита + ".ОжидаемаяВыручка";
			КолонкаСумма.Видимость = Ложь;
			
			КолонкаРазделитель = Элементы.Добавить("Ячейка" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрокаГлавная);
			КолонкаРазделитель.Вид = ВидПоляФормы.ПолеНадписи;
			КолонкаРазделитель.ПутьКДанным = ИмяРеквизита + ".ПустаяЯчейка";
			КолонкаРазделитель.ОтображатьВШапке = Ложь;
			КолонкаРазделитель.ЦветФона = Новый Цвет(255, 255, 255);
			КолонкаРазделитель.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Ложь,Ложь,Истина);
			КолонкаРазделитель.Высота = 1;
			КолонкаРазделитель.РастягиватьПоГоризонтали = Ложь;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "Пользователь", ТекущийПользователь,
				 Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()),
				 Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ПериодТекущих", КонецДня(ТекущаяДатаСеанса()),
				 Истина);
			
			ДнейПоКалендарюНаСегодня = CRM_ОбщегоНазначенияСервер.КоличествоДнейСНачалаГодаПоКалендарю(Календарь,
				 ТекущаяДатаСеанса());
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяРеквизита],
				 "ДнейПоКалендарюНаСегодня", ДнейПоКалендарюНаСегодня,
				 Истина);
			
			Элемент = Элементы.Найти("Группа_"+ИмяРеквизита);
			Элемент.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаЭтапы.Количество() > 0 Тогда
		ПоследняяСтрока = ТаблицаЭтапы[ТаблицаЭтапы.Количество()-1];
		ИдентификаторЭтапа = СтрЗаменить(Строка(ПоследняяСтрока.Ссылка.УникальныйИдентификатор()),"-","_");
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		ДобавитьСвернутыеТаблицы(Элементы["Группа_"+ИмяРеквизита]);
	Иначе
		ДобавитьСвернутыеТаблицы(Элементы.ГруппаСоставКолонок);
	КонецЕсли;
	
	УстановиьОформлениеСписковУспешноНеудачно();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект["НеРазобрано"],
		 "Пользователь", ТекущийПользователь,
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект["ТаблицаНеудачно"],
		 "Пользователь", ТекущийПользователь,
		 Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект["ТаблицаУспешно"],
		 "Пользователь", ТекущийПользователь,
		 Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаКолонкиАРМ()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ОбъектыАРМ.Объект КАК Объект,
	|	CRM_ОбъектыАРМ.НаименованиеАРМ КАК НаименованиеАРМ,
	|	CRM_ОбъектыАРМ.СостояниеИнтереса КАК СостояниеИнтереса,
	|	CRM_ОбъектыАРМ.Заголовок КАК Заголовок,
	|	CRM_ОбъектыАРМ.КрайнийСрок КАК КрайнийСрок,
	|	CRM_ОбъектыАРМ.ДатаДляСортировки КАК ДатаДляСортировки,
	|	CRM_ОбъектыАРМ.День КАК День,
	|	CRM_ОбъектыАРМ.Время КАК Время,
	|	CRM_ОбъектыАРМ.Избранный КАК Избранный,
	|	CRM_ОбъектыАРМ.ОписаниеИнтереса КАК ОписаниеИнтереса,
	|	CRM_ОбъектыАРМ.Подразделение КАК Подразделение,
	|	МИНИМУМ(CRM_ОбъектыАРМ.Соисполнение) КАК Соисполнение
	|ПОМЕСТИТЬ ОбъектыПользователя
	|ИЗ
	|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
	|ГДЕ
	|	CRM_ОбъектыАРМ.НаименованиеАРМ = ""МоиПродажи""
	|	И CRM_ОбъектыАРМ.ИзмерениеАРМ = """"
	|	И CRM_ОбъектыАРМ.СостояниеИнтереса В (&СостояниеИнтереса)
	|{ГДЕ
	|	CRM_ОбъектыАРМ.КрайнийСрок <= &КрайнийСрокКонец,
	|	CRM_ОбъектыАРМ.Пользователь В(&Пользователь)}
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_ОбъектыАРМ.Объект,
	|	CRM_ОбъектыАРМ.НаименованиеАРМ,
	|	CRM_ОбъектыАРМ.СостояниеИнтереса,
	|	CRM_ОбъектыАРМ.Заголовок,
	|	CRM_ОбъектыАРМ.КрайнийСрок,
	|	CRM_ОбъектыАРМ.ДатаДляСортировки,
	|	CRM_ОбъектыАРМ.День,
	|	CRM_ОбъектыАРМ.Время,
	|	CRM_ОбъектыАРМ.Избранный,
	|	CRM_ОбъектыАРМ.ОписаниеИнтереса,
	|	CRM_ОбъектыАРМ.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыПользователя.Объект КАК Объект,
	|	Интерес.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Интерес.ПотенциальныйКлиент
	|		ИНАЧЕ Интерес.Партнер
	|	КОНЕЦ КАК Партнер,
	|	ВЫБОР
	|		КОГДА Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Интерес.ПотенциальныйКлиент.Наименование
	|		ИНАЧЕ Интерес.Партнер.Наименование
	|	КОНЕЦ КАК ПартнерНаименование,
	|	ОбъектыПользователя.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ОбъектыПользователя.Заголовок КАК Заголовок,
	|	ВЫБОР
	|		КОГДА ОбъектыПользователя.КрайнийСрок < &ПериодПросроченных
	|				И ОбъектыПользователя.КрайнийСрок > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 1
	|		КОГДА ОбъектыПользователя.КрайнийСрок < &ПериодТекущих
	|				И ОбъектыПользователя.КрайнийСрок > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Просрочено,
	|	ВЫБОР
	|		КОГДА ОбъектыПользователя.КрайнийСрок < &ПериодПросроченных
	|				И ОбъектыПользователя.КрайнийСрок > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ПросроченоДляСортировки,
	|	ОбъектыПользователя.ДатаДляСортировки КАК ДатаДляСортировки,
	|	ОбъектыПользователя.День КАК День,
	|	ОбъектыПользователя.Время КАК Время,
	|	ОбъектыПользователя.Избранный КАК Избранный,
	|	ОбъектыПользователя.ОписаниеИнтереса КАК ОписаниеИнтереса,
	|	"""" КАК ПустаяЯчейка,
	|	Интерес.ТипУслуги КАК ТипУслуги,
	|	ОбъектыПользователя.КрайнийСрок КАК КрайнийСрок,
	|	ОбъектыПользователя.КрайнийСрок КАК КрайнийСрокОкончание,
	|	ВЫБОР
	|		КОГДА ОбъектыПользователя.Избранный
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Картинка,
	|	Интерес.Проект КАК Проект,
	|	ОбъектыПользователя.Подразделение КАК Подразделение,
	|	Интерес.Автор КАК Автор,
	|	ОбъектыПользователя.СостояниеИнтереса.ИндексЦвета КАК ИндексЦвета,
	|	ВЫБОР
	|		КОГДА ОбъектыПользователя.Соисполнение
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Соисполнение,
	|	ВЫБОР
	|		КОГДА ГОД(&ПериодТекущих) = ЕСТЬNULL(ГОД(Интерес.СостояниеИнтересаДатаНачала), 0)
	|			ТОГДА &ДнейПоКалендарюНаСегодня - ЕСТЬNULL(Интерес.СостояниеИнтересаДнейСНачалаГода, 0)
	|		КОГДА ГОД(&ПериодТекущих) = ЕСТЬNULL(ГОД(Интерес.СостояниеИнтересаДатаНачала), 0) + 1
	|			ТОГДА &ДнейПоКалендарюНаСегодня + ЕСТЬNULL(Интерес.СостояниеИнтересаДнейДоКонцаГода, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокНаЭтапе,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Интерес.СостояниеИнтересаДнейСНачалаГода, 0) = 0
	|				ИЛИ &ДнейПоКалендарюНаСегодня = 0
	|				ИЛИ ЕСТЬNULL(Интерес.СостояниеИнтереса.ОжидаемыйСрокНаЭтапе, 0) = 0
	|			ТОГДА -1
	|		КОГДА ВЫБОР
	|				КОГДА ГОД(&ПериодТекущих) = ЕСТЬNULL(ГОД(Интерес.СостояниеИнтересаДатаНачала), 0)
	|					ТОГДА &ДнейПоКалендарюНаСегодня - ЕСТЬNULL(Интерес.СостояниеИнтересаДнейСНачалаГода, 0)
	|				КОГДА ГОД(&ПериодТекущих) = ЕСТЬNULL(ГОД(Интерес.СостояниеИнтересаДатаНачала), 0) + 1
	|					ТОГДА &ДнейПоКалендарюНаСегодня + ЕСТЬNULL(Интерес.СостояниеИнтересаДнейДоКонцаГода, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ < Интерес.СостояниеИнтереса.ОжидаемыйСрокНаЭтапе
	|			ТОГДА 0
	|		КОГДА ВЫБОР
	|				КОГДА ГОД(&ПериодТекущих) = ЕСТЬNULL(ГОД(Интерес.СостояниеИнтересаДатаНачала), 0)
	|					ТОГДА &ДнейПоКалендарюНаСегодня - ЕСТЬNULL(Интерес.СостояниеИнтересаДнейСНачалаГода, 0)
	|				КОГДА ГОД(&ПериодТекущих) = ЕСТЬNULL(ГОД(Интерес.СостояниеИнтересаДатаНачала), 0) + 1
	|					ТОГДА &ДнейПоКалендарюНаСегодня + ЕСТЬNULL(Интерес.СостояниеИнтересаДнейДоКонцаГода, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ = Интерес.СостояниеИнтереса.ОжидаемыйСрокНаЭтапе
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СрокНаЭтапеСветофор,
	|	ЕСТЬNULL(Интерес.ОжидаемаяВыручка, 0) КАК ОжидаемаяВыручка
	|ИЗ
	|	ОбъектыПользователя КАК ОбъектыПользователя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_Интерес КАК Интерес
	|		ПО ОбъектыПользователя.Объект = Интерес.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ДанныеКолонокКанбан()
	
	ВалютаПредставление = ПолучитьПредставлениеВалюты();
	
	ДанныеКолонок = Новый Структура;
	
	ИмяСписка = "НеРазобраноСводныеДанные";
	ДанныеЗаголовка = ПоместитьНастройкиСводныхДанныхКолонкиНеРазобраноВХранилище();
	ДанныеКолонок.Вставить(ИмяСписка, ДанныеЗаголовка);
	
	ИмяСписка = "НеРазобрано";
	ТаблицаСписка = Элементы[ИмяСписка];
	ДанныеЗаголовка = ПоместитьНастройкиДинамическогоСпискаВХранилище(ТаблицаСписка);
	ДанныеЗаголовка.Вставить("НаименованиеСписка", НСтр("ru = 'Не разобрано'"));
	ДанныеЗаголовка.Вставить("ВалютаПредставление", ВалютаПредставление);
	ДанныеКолонок.Вставить("Этап_НеРазобрано", ДанныеЗаголовка);
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИмяСписка = Строка.Имя;
		ТаблицаСписка = Элементы[ИмяСписка];
		ДанныеЗаголовка = ПоместитьНастройкиДинамическогоСпискаВХранилище(ТаблицаСписка);
		ДанныеЗаголовка.Вставить("НаименованиеСписка", Строка.Ссылка.Наименование);
		ДанныеЗаголовка.Вставить("ВалютаПредставление", ВалютаПредставление);
		ДанныеКолонок.Вставить(ИмяСписка, ДанныеЗаголовка);
	КонецЦикла;
	
	ИмяСписка = "ТаблицаНеудачно";
	ТаблицаСписка = Элементы[ИмяСписка];
	ДанныеЗаголовка = ПоместитьНастройкиДинамическогоСпискаВХранилище(ТаблицаСписка);
	ДанныеЗаголовка.Вставить("НаименованиеСписка", НСтр("ru = 'Неудачно'"));
	ДанныеЗаголовка.Вставить("ВалютаПредставление", ВалютаПредставление);
	ДанныеКолонок.Вставить("Этап_Неудачно", ДанныеЗаголовка);
	
	ИмяСписка = "ТаблицаУспешно";
	ТаблицаСписка = Элементы[ИмяСписка];
	ДанныеЗаголовка = ПоместитьНастройкиДинамическогоСпискаВХранилище(ТаблицаСписка);
	ДанныеЗаголовка.Вставить("НаименованиеСписка", НСтр("ru = 'Успешно'"));
	ДанныеЗаголовка.Вставить("ВалютаПредставление", ВалютаПредставление);
	ДанныеКолонок.Вставить("Этап_Успешно", ДанныеЗаголовка);
	
	Возврат ДанныеКолонок;
	
КонецФункции

&НаСервере
Процедура УдалитьЭтапыВоронкиНаСервере()
	МассивРеквизитов = Новый Массив;
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		МассивРеквизитов.Добавить(ИмяРеквизита);
		Элемент = Элементы.Найти("Группа_"+ИмяРеквизита);
		Если Элемент <> Неопределено Тогда
			 Элементы.Удалить(Элемент);
			 
			// Элемент.Видимость = Ложь;
			
		КонецЕсли;
	КонецЦикла;
	ИмяРеквизита = "НеРазобрано";
	Элемент = Элементы.Найти("Группа_"+ИмяРеквизита);
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;	
	
	ИмяРеквизита = "ТаблицаУспешноСвернуто";
	Элемент = Элементы.Найти("ГруппаТаблица_"+ИмяРеквизита);
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;	
	
	ИмяРеквизита = "ТаблицаНеудачноСвернуто";
	Элемент = Элементы.Найти("ГруппаТаблица_"+ИмяРеквизита);
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;	

	Элементы.ГруппаНеудачно.Видимость = Ложь;
	Элементы.ГруппаУспешно.Видимость = Ложь;
	
	ЭтотОбъект.ИзменитьРеквизиты(,МассивРеквизитов);
	// если реквизит создан ранее меняем его видимость на форме
КонецПроцедуры

&НаСервере
Процедура СформироватьКонтекстноеМеню(ИмяТаблицы)
	
	Если Найти(ИмяТаблицы, "НеРазобрано") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаКнопки = "Х_ПринятьВРаботу_" + ИмяТаблицы;
	КнопкаПринятьВРаботу = Элементы.Найти(ИмяЭлементаКнопки);
	Если КнопкаПринятьВРаботу = Неопределено Тогда
		КнопкаПринятьВРаботу = Элементы.Добавить(ИмяЭлементаКнопки, Тип("КнопкаФормы"), Элементы[ИмяТаблицы].КонтекстноеМеню);
		КнопкаПринятьВРаботу.ИмяКоманды = "ПринятьВРаботу";
	КонецЕсли;
	КнопкаПринятьВРаботу.Видимость = Истина;
	
	ИмяЭлементаКнопки = "Х_ПередатьИсполнителю_" + ИмяТаблицы;
	КнопкаПередатьИсполнителю = Элементы.Найти(ИмяЭлементаКнопки);
	Если КнопкаПередатьИсполнителю = Неопределено Тогда
		КнопкаПередатьИсполнителю = Элементы.Добавить(ИмяЭлементаКнопки, Тип("КнопкаФормы"),
			 Элементы[ИмяТаблицы].КонтекстноеМеню);
		КнопкаПередатьИсполнителю.ИмяКоманды = "ПередатьИсполнителю";
	КонецЕсли;
	КнопкаПередатьИсполнителю.Видимость = Истина;
	
	ИДЭтапа = ИмяТаблицы;
	ИДЭтапа = СтрЗаменить(ИДЭтапа, "Этап_",""); 
	ИДЭтапа = СтрЗаменить(ИДЭтапа, "_","-"); 
	СостоянияЭтапа = ПолучитьСостоянияИнтересаПоВоронке(ПолучитьЭтапВоронки(ИДЭтапа));
	Если НЕ (СостоянияЭтапа.Количество() > 0
		 И НЕ СостоянияЭтапа[0].Значение.РазрешитьРолевуюАдресацию) Тогда // Истина, если нет состояний, 
																									// либо для первого состояния ролевая адресация разрешена
		ИмяЭлементаКнопки = "Х_ПередатьРоли_" + ИмяТаблицы;
		КнопкаПередатьРоли = Элементы.Найти(ИмяЭлементаКнопки);
		Если КнопкаПередатьРоли = Неопределено Тогда
			КнопкаПередатьРоли = Элементы.Добавить(ИмяЭлементаКнопки, Тип("КнопкаФормы"), Элементы[ИмяТаблицы].КонтекстноеМеню);
			КнопкаПередатьРоли.ИмяКоманды = "ПередатьРоли";
		КонецЕсли;
		КнопкаПередатьРоли.Видимость = Истина;
		
	КонецЕсли;
	
	// Смена этапа
	
	ИмяЭлементаГруппыКнопок	= "Х_СменитьЭтапГруппаКнопок_" + ИмяТаблицы;
	ИмяЭлементаПодменю		= "Х_СменитьЭтапПодменю_" + ИмяТаблицы;
	
	ГруппаКнопокСменитьЭтап = Элементы.Найти(ИмяЭлементаГруппыКнопок);
	Если ГруппаКнопокСменитьЭтап = Неопределено Тогда
		ГруппаКнопокСменитьЭтап = Элементы.Добавить(ИмяЭлементаГруппыКнопок, Тип("ГруппаФормы"),
			 Элементы[ИмяТаблицы].КонтекстноеМеню);
		ГруппаКнопокСменитьЭтап.Вид = ВидГруппыФормы.ГруппаКнопок;
		
		ПодменюСменитьЭтап = Элементы.Добавить(ИмяЭлементаПодменю, Тип("ГруппаФормы"), ГруппаКнопокСменитьЭтап);
		ПодменюСменитьЭтап.Заголовок	= "Сменить этап";
		ПодменюСменитьЭтап.Вид			= ВидГруппыФормы.Подменю;
		
		ИдентификаторИсточника = СтрЗаменить(ИмяТаблицы, "Этап_", "");
		
		Для Каждого ТекущаяТаблицаЭтапа Из ТаблицаЭтапы Цикл
			ИдентификаторЭтапаПриемника	= СтрЗаменить(Строка(ТекущаяТаблицаЭтапа.Ссылка.УникальныйИдентификатор()), "-", "_");
			ИмяРеквизитаЭтапаПриемника	= "Этап_" + ИдентификаторЭтапаПриемника;
			
			ИмяЭлементаКнопкиСменитьЭтап	= "Х_СменитьЭтап_На_" + ИдентификаторЭтапаПриемника + "_Из_" + ИдентификаторИсточника;
			КнопкаСменитьЭтап				= Элементы.Добавить(ИмяЭлементаКнопкиСменитьЭтап, Тип("КнопкаФормы"), ПодменюСменитьЭтап);
			
			Если ИмяРеквизитаЭтапаПриемника = ИмяТаблицы Тогда
				КнопкаСменитьЭтап.Доступность	= Ложь;
				КнопкаСменитьЭтап.Картинка		= БиблиотекаКартинок.ОформлениеФлагЗеленый;
				КнопкаСменитьЭтап.Отображение	= ОтображениеКнопки.КартинкаИТекст;
				КнопкаСменитьЭтап.ИмяКоманды	= "СменитьЭтап";
			Иначе
				КомандаПоиска		= "Х_СменитьЭтап_На_" + ИдентификаторЭтапаПриемника;
				КомандаСменыЭтапа	= Команды.Найти(КомандаПоиска);
				
				Если КомандаСменыЭтапа = Неопределено Тогда
					КомандаСменыЭтапа = Команды.Добавить(КомандаПоиска);
				КонецЕсли;
				
				КомандаСменыЭтапа.Действие = "СменитьЭтап";
				КнопкаСменитьЭтап.ИмяКоманды = КомандаПоиска;
			КонецЕсли;
			
			КнопкаСменитьЭтап.Заголовок = ТекущаяТаблицаЭтапа.Ссылка.Наименование;
			КнопкаСменитьЭтап.Видимость = Истина;
		КонецЦикла;
		
		ПодменюСменитьЭтап.Видимость = Истина;
	КонецЕсли;
	ГруппаКнопокСменитьЭтап.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановиьОформлениеСписковУспешноНеудачно()
	
	ВалютаПредставление = ПолучитьПредставлениеВалюты();
	УО_Успешно = ЭтотОбъект.ТаблицаУспешно.УсловноеОформление.Элементы;
	
	ЭлементУО = УО_Успешно.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='Ч " + ВалютаПредставление + "'");
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("ОжидаемаяВыручка");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОжидаемаяВыручка");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение = 0;
	
	УО_Неудачно = ЭтотОбъект.ТаблицаНеудачно.УсловноеОформление.Элементы;
	
	ЭлементУО = УО_Неудачно.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧФ='Ч " + ВалютаПредставление + "'");
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("ОжидаемаяВыручка");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОжидаемаяВыручка");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение = 0;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуНеРазобрано()
	
	ИмяРеквизита = "НеРазобрано";
	УО = ЭтотОбъект[ИмяРеквизита].УсловноеОформление.Элементы;
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Заголовок");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Избранный");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина; // Жирный
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 211, 194));
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = "Просрочено"; // красный
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 211, 194));
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = "Просрочено"; // красный
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = "Сегодня"; // желтый
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоЗолотистый);
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = "Сегодня"; // желтый
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(191, 238, 191));
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = "ВОжидании"; // зеленый
	
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(191, 238, 191));
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Светофор");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = "ВОжидании"; // зеленый
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьСвернутыеТаблицы(ГруппаДобавления)
	ИмяРеквизита = "ТаблицаУспешноСвернуто";
	Элемент = Элементы.Найти(ИмяРеквизита);
	
	Если Элемент = Неопределено Тогда
		
		ГруппаТаблица = Элементы.Добавить("ГруппаТаблица_"+ИмяРеквизита, Тип("ГруппаФормы"), ГруппаДобавления);
		ГруппаТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаТаблица.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаТаблица.ОтображатьЗаголовок = Ложь;
		ГруппаТаблица.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		ДекорацияЦвет = Элементы.Добавить("ДекорацияЦвет_"+ИмяРеквизита, Тип("ДекорацияФормы"), ГруппаТаблица);
		ДекорацияЦвет.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияЦвет.Заголовок = "";
		ДекорацияЦвет.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияЦвет.РастягиватьПоГоризонтали = Ложь;
		ДекорацияЦвет.АвтоМаксимальнаяШирина = Ложь;
		ДекорацияЦвет.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Истина);
		ДекорацияЦвет.ЦветФона = Новый Цвет(0, 200, 83);
		
		Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ТаблицаФормы"), ГруппаТаблица);
		Элемент.РежимВыделенияСтроки =РежимВыделенияСтрокиТаблицы.Строка;
		Элемент.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		Элемент.РежимВыбора = Истина;
		Элемент.ОтображениеСостоянияПросмотра.Видимость = Истина;
		Элемент.ОтображениеСтрокиПоиска.Видимость = Истина;
		Элемент.КоманднаяПанель.Видимость = Ложь;
		Элемент.ПутьКДанным = ИмяРеквизита;
		Элемент.ПутьКДаннымКартинкиСтроки  = ИмяРеквизита+".Заголовок";
		Элемент.РазрешитьПеретаскивание = Истина;
		Элемент.РазрешитьНачалоПеретаскивания = Ложь;
		Элемент.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		Элемент.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		Элемент.ЧередованиеЦветовСтрок = Ложь;
		Элемент.Видимость = Истина;
		Элемент.Шапка = Ложь;
		Элемент.ГоризонтальныеЛинии = Ложь;
		Элемент.ВертикальныеЛинии = Ложь;
		Элемент.УстановитьДействие("Выбор", "РазвернутьУспешно");
		Элемент.УстановитьДействие("Перетаскивание", "ТаблицаУспешноПеретаскивание");
		Элемент.УстановитьДействие("ПередУдалением", "ТаблицаОбработкаПередУдалением");
		//Элемент.УстановитьДействие("НачалоПеретаскивания", "ТаблицаОбработкаНачалоПеретаскивания");
		Элемент.УстановитьДействие("ПроверкаПеретаскивания", "ТаблицаУспешноПроверкаПеретаскивания");
		Элемент.УстановитьДействие("ПередНачаломДобавления", "ТаблицаПередНачаломДобавления");
		Элемент.УстановитьДействие("ПриАктивизацииСтроки", "НеРазобраноПриАктивизацииСтроки");
		Элемент.Заголовок = "";
		Элемент.КонтекстноеМеню.Видимость = Истина;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.Высота = 2;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.РастягиватьПоВертикали = Ложь;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ЦветФона = Новый Цвет(255, 238, 233);
		Элемент.ЦветРамки = ЦветаСтиля.ЦветФонаПоля;

		ГруппаСтрокаГлавная = Элементы.Добавить("ГруппаСтрокаГлавная_" + ИмяРеквизита, Тип("ГруппаФормы"),
			 Элементы[ИмяРеквизита]);
		ГруппаСтрокаГлавная.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаСтрокаГлавная.Группировка = ГруппировкаКолонок.Вертикальная;
		ГруппаСтрокаГлавная.ОтображатьЗаголовок = Ложь;
		
		КолонкаНаименование = Элементы.Добавить("Заголовок" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрокаГлавная);
		КолонкаНаименование.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаНаименование.ПутьКДанным = ИмяРеквизита + ".Заголовок";
		КолонкаНаименование.ОтображатьВШапке = Ложь;
		КолонкаНаименование.ЦветФона = Новый Цвет(229, 249, 238);
		КолонкаНаименование.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,10,Истина,Ложь,Ложь);
		КолонкаНаименование.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Центр;
		КолонкаНаименование.РастягиватьПоГоризонтали = Ложь;
		КолонкаНаименование.АвтоМаксимальнаяШирина = Ложь;
		
		ГруппаСтрока = Элементы.Добавить("ГруппаСтрока_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаСтрокаГлавная);
		ГруппаСтрока.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаСтрока.Группировка = ГруппировкаКолонок.Горизонтальная;
		ГруппаСтрока.ОтображатьЗаголовок = Ложь;

		КолонкаОписание = Элементы.Добавить("Сумма" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
		КолонкаОписание.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаОписание.ПутьКДанным = ИмяРеквизита + ".Сумма";
		КолонкаОписание.ОтображатьВШапке = Ложь;
		КолонкаОписание.ЦветФона = Новый Цвет(229, 249, 238);
		КолонкаОписание.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Центр;
		КолонкаОписание.РастягиватьПоГоризонтали = Ложь;
		
		КолонкаКнопка = Элементы.Добавить("Ячейка" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
		КолонкаКнопка.Вид = ВидПоляФормы.ПолеКартинки;
		КолонкаКнопка.ПутьКДанным = ИмяРеквизита + ".ПустаяЯчейка";
		КолонкаКнопка.Ширина = 1;
		КолонкаКнопка.ОтображатьВШапке = Ложь;
		КолонкаКнопка.ГиперссылкаЯчейки = Истина;
		КолонкаКнопка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
		КолонкаКнопка.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	ИмяРеквизита = "ТаблицаНеудачноСвернуто";
	Элемент = Элементы.Найти(ИмяРеквизита);
	
	Если Элемент = Неопределено Тогда
		
		ГруппаТаблица = Элементы.Добавить("ГруппаТаблица_"+ИмяРеквизита, Тип("ГруппаФормы"), ГруппаДобавления);
		ГруппаТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаТаблица.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаТаблица.ОтображатьЗаголовок = Ложь;
		ГруппаТаблица.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		
		ДекорацияЦвет = Элементы.Добавить("ДекорацияЦвет_"+ИмяРеквизита, Тип("ДекорацияФормы"), ГруппаТаблица);
		ДекорацияЦвет.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияЦвет.Заголовок = "";
		ДекорацияЦвет.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		ДекорацияЦвет.РастягиватьПоГоризонтали = Ложь;
		ДекорацияЦвет.АвтоМаксимальнаяШирина = Ложь;
		ДекорацияЦвет.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,1,Истина);
		ДекорацияЦвет.ЦветФона = Новый Цвет(255, 87, 34);
		
		Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ТаблицаФормы"), ГруппаТаблица);
		Элемент.РежимВыделенияСтроки =РежимВыделенияСтрокиТаблицы.Строка;
		Элемент.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		Элемент.РежимВыбора = Истина;
		Элемент.ОтображениеСостоянияПросмотра.Видимость = Истина;
		Элемент.ОтображениеСтрокиПоиска.Видимость = Истина;
		Элемент.КоманднаяПанель.Видимость = Ложь;
		Элемент.ПутьКДанным = ИмяРеквизита;
		Элемент.ПутьКДаннымКартинкиСтроки  = ИмяРеквизита+".Заголовок";
		Элемент.РазрешитьПеретаскивание = Истина;
		Элемент.РазрешитьНачалоПеретаскивания = Ложь;
		Элемент.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		Элемент.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		Элемент.ЧередованиеЦветовСтрок = Ложь;
		Элемент.Видимость = Истина;
		Элемент.Шапка = Ложь;
		Элемент.ГоризонтальныеЛинии = Ложь;
		Элемент.ВертикальныеЛинии = Ложь;
		Элемент.УстановитьДействие("Выбор", "РазвернутьНеудачно");
		Элемент.УстановитьДействие("Перетаскивание", "ТаблицаНеудачноПеретаскивание");
		Элемент.УстановитьДействие("ПередУдалением", "ТаблицаОбработкаПередУдалением");
		//Элемент.УстановитьДействие("НачалоПеретаскивания", "ТаблицаОбработкаНачалоПеретаскивания");
		Элемент.УстановитьДействие("ПроверкаПеретаскивания", "ТаблицаНеудачноПроверкаПеретаскивания");
		Элемент.УстановитьДействие("ПередНачаломДобавления", "ТаблицаПередНачаломДобавления");
		Элемент.УстановитьДействие("ПриАктивизацииСтроки", "НеРазобраноПриАктивизацииСтроки");
		Элемент.Заголовок = "";
		Элемент.КонтекстноеМеню.Видимость = Истина;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.Высота = 2;
		Элемент.АвтоМаксимальнаяВысота = Ложь;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.РастягиватьПоВертикали = Ложь;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ЦветФона = Новый Цвет(255, 238, 233);
		Элемент.ЦветРамки = ЦветаСтиля.ЦветФонаПоля;
		
		ГруппаСтрокаГлавная = Элементы.Добавить("ГруппаСтрокаГлавная_" + ИмяРеквизита, Тип("ГруппаФормы"),
			 Элементы[ИмяРеквизита]);
		ГруппаСтрокаГлавная.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаСтрокаГлавная.Группировка = ГруппировкаКолонок.Вертикальная;
		ГруппаСтрокаГлавная.ОтображатьЗаголовок = Ложь;
		
		КолонкаНаименование = Элементы.Добавить("Заголовок" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрокаГлавная);
		КолонкаНаименование.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаНаименование.ПутьКДанным = ИмяРеквизита + ".Заголовок";
		КолонкаНаименование.ОтображатьВШапке = Ложь;
		КолонкаНаименование.ЦветФона = Новый Цвет(255, 238, 233);
		КолонкаНаименование.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,10,Истина,Ложь,Ложь);
		КолонкаНаименование.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Центр;
		КолонкаНаименование.РастягиватьПоГоризонтали = Ложь;
		КолонкаНаименование.АвтоМаксимальнаяШирина = Ложь;
		
		ГруппаСтрока = Элементы.Добавить("ГруппаСтрока_" + ИмяРеквизита, Тип("ГруппаФормы"), ГруппаСтрокаГлавная);
		ГруппаСтрока.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаСтрока.Группировка = ГруппировкаКолонок.Горизонтальная;
		ГруппаСтрока.ОтображатьЗаголовок = Ложь;

		КолонкаОписание = Элементы.Добавить("Сумма" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
		КолонкаОписание.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаОписание.ПутьКДанным = ИмяРеквизита + ".Сумма";
		КолонкаОписание.ОтображатьВШапке = Ложь;
		КолонкаОписание.ЦветФона = Новый Цвет(255, 238, 233);
		КолонкаОписание.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Центр;
		КолонкаОписание.РастягиватьПоГоризонтали = Ложь;
		
		КолонкаКнопка = Элементы.Добавить("Ячейка" + ИмяРеквизита, Тип("ПолеФормы"), ГруппаСтрока);
		КолонкаКнопка.Вид = ВидПоляФормы.ПолеКартинки;
		КолонкаКнопка.ПутьКДанным = ИмяРеквизита + ".ПустаяЯчейка";
		КолонкаКнопка.Ширина = 1;
		КолонкаКнопка.ОтображатьВШапке = Ложь;
		КолонкаКнопка.ГиперссылкаЯчейки = Истина;
		КолонкаКнопка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право;
		КолонкаКнопка.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьКонтекстноеМенюТаблиц()
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц(ТаблицаЭтапы, "Динамические") Цикл
		КонтекстноеМенюЭтапа = Элементы[ИмяТаблицы].КонтекстноеМеню;
		Для Каждого ПодчиненныйЭлемент Из КонтекстноеМенюЭтапа.ПодчиненныеЭлементы Цикл
			Если Лев(ПодчиненныйЭлемент.Имя, 2) = "Х_" Тогда
				Продолжить;
			КонецЕсли;
			ПодчиненныйЭлемент.Видимость = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	КонтекстноеМенюЭтапа = Элементы["ТаблицаУспешноСвернуто"].КонтекстноеМеню;
	Для Каждого ПодчиненныйЭлемент Из КонтекстноеМенюЭтапа.ПодчиненныеЭлементы Цикл
		ПодчиненныйЭлемент.Видимость = Ложь;
	КонецЦикла;
	КонтекстноеМенюЭтапа = Элементы["ТаблицаНеудачноСвернуто"].КонтекстноеМеню;
	Для Каждого ПодчиненныйЭлемент Из КонтекстноеМенюЭтапа.ПодчиненныеЭлементы Цикл
		ПодчиненныйЭлемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьНастройкиДинамическогоСпискаВХранилище(ТаблицаСписка)
	
	СхемаКомпоновкиДанных = ТаблицаСписка.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКомпоновкиДанных = ТаблицаСписка.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Результат = Новый Структура;
	Результат.Вставить("СхемаКомпоновкиДанных", ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,
		 УникальныйИдентификатор));
	Результат.Вставить("НастройкиКомпоновкиДанных",
		 ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанных,
		 УникальныйИдентификатор));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПоместитьНастройкиСводныхДанныхКолонкиНеРазобраноВХранилище()
	
	СхемаКомпоновкиДанных = Элементы.НеРазобрано.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКомпоновкиДанных = Элементы.НеРазобрано.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	ПолеРесурса.ПутьКДанным = "Количество";
	ПолеРесурса.Выражение   = "Сумма(Количество)";
	
	ГруппировкаКомпоновкиДанных = НастройкиКомпоновкиДанных.Структура[0];
	
	ПолеГруппировки =
		ГруппировкаКомпоновкиДанных.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Светофор");
	
	ГруппировкаКомпоновкиДанных.Выбор.Элементы.Очистить();
	
	ПолеКомпоновкиДанных = ГруппировкаКомпоновкиДанных.Выбор.ДоступныеПоляВыбора.Элементы.Найти("Светофор").Поле;
	ВыбранноеПолеКомпоновкиДанных =
		ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = ПолеКомпоновкиДанных;
	ПолеКомпоновкиДанных = ГруппировкаКомпоновкиДанных.Выбор.ДоступныеПоляВыбора.Элементы.Найти("Количество").Поле;
	ВыбранноеПолеКомпоновкиДанных =
		ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = ПолеКомпоновкиДанных;
	
	Для каждого ЭлементОтбора Из НастройкиКомпоновкиДанных.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "Отбор по светофору" Тогда
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("СхемаКомпоновкиДанных", ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,
		 УникальныйИдентификатор));
	Результат.Вставить("НастройкиКомпоновкиДанных",
		 ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанных,
		 УникальныйИдентификатор));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОбновлениеЗаголовков(Колонки = Неопределено)
	
	ДанныеКолонок = Новый Структура;;
	Если Колонки = Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СтруктураОбновленияКолонок Цикл
			ИмяСписка = КлючИЗначение.Ключ;
			ДанныеКолонок.Вставить(ИмяСписка, КлючИЗначение.Значение);
			Если НеРазобраноСводныеДанные_Показать Тогда
				ДанныеКолонок.Удалить("Этап_НеРазобрано");
			Иначе
				ДанныеКолонок.Удалить("НеРазобраноСводныеДанные");
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Колонки) = Тип("Массив") Тогда
		
		Для Каждого ИмяСписка Из Колонки Цикл
			Если ТипЗнч(ИмяСписка) = Тип("Строка") Тогда
				
				Если ИмяСписка = "НеРазобрано" Тогда
					Если НеРазобраноСводныеДанные_Показать Тогда
						ИмяСписка = "НеРазобраноСводныеДанные";
					Иначе
						ИмяСписка = "Этап_НеРазобрано";
					КонецЕсли;
				ИначеЕсли  ИмяСписка = "ТаблицаНеудачно" Тогда
					ИмяСписка = "Этап_Неудачно";
				ИначеЕсли  ИмяСписка = "ТаблицаУспешно" Тогда
					ИмяСписка = "Этап_Успешно";
				КонецЕсли;
				
				ДанныеКолонки = СтруктураОбновленияКолонок[ИмяСписка];
				ДанныеКолонок.Вставить(ИмяСписка, ДанныеКолонки);
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьОбновлениеЗаголовковВФоне(ДанныеКолонок, УникальныйИдентификатор);
	ДополнительныеПараметры = Новый Структура;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ЗапуститьОбновлениеЗаголовковЗавершение(ДлительнаяОперация, ДополнительныеПараметры);
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗапуститьОбновлениеЗаголовковЗавершение",
			 ЭтотОбъект,
			 ДополнительныеПараметры);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеЗаголовковЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого ЭлементСтруктуры Из РезультатВыполнения Цикл
			
			ИмяРеквизита = "Декорация_"+ЭлементСтруктуры.Ключ+"_Сумма";
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизита) Тогда
				ПодстрокиЗаголовка = Новый Массив;
				ПодстрокиЗаголовка.Добавить(ЭлементСтруктуры.Значение.Сумма);
				Если ЭлементСтруктуры.Ключ <> "Этап_НеРазобрано" Тогда
					ПодстрокиЗаголовка.Добавить(" ");
					ПодстрокиЗаголовка.Добавить(Новый ФорматированнаяСтрока(ЭлементСтруктуры.Значение.Сумма1,
						 Новый Шрифт(,10,
						Истина)));
				КонецЕсли;
				ЭтотОбъект[ИмяРеквизита] = Новый ФорматированнаяСтрока(ПодстрокиЗаголовка);
			КонецЕсли;
			
			Если ЭлементСтруктуры.Ключ = "Этап_Успешно" Тогда
				
				ТаблицаУспешноСвернуто.Очистить();
				СтрокаТаблицыСвернуто = ТаблицаУспешноСвернуто.Добавить();
				СтрокаТаблицыСвернуто.Заголовок = НСтр("ru='Завершено успешно';en='Completed Successfully'");
				СтрокаТаблицыСвернуто.Сумма = ЭлементСтруктуры.Значение.Сумма+" "+ЭлементСтруктуры.Значение.Сумма1;
				СтрокаТаблицыСвернуто.ПустаяЯчейка = БиблиотекаКартинок.CRM_КнопкаРазвернуть;
				
			ИначеЕсли ЭлементСтруктуры.Ключ = "Этап_Неудачно" Тогда
				
				ТаблицаНеудачноСвернуто.Очистить();
				СтрокаТаблицыСвернуто = ТаблицаНеудачноСвернуто.Добавить();
				СтрокаТаблицыСвернуто.Заголовок = НСтр("ru='Завершено неудачно';en='Completed Unsuccessfully'");
				СтрокаТаблицыСвернуто.Сумма = ЭлементСтруктуры.Значение.Сумма+" "+ЭлементСтруктуры.Значение.Сумма1;
				СтрокаТаблицыСвернуто.ПустаяЯчейка = БиблиотекаКартинок.CRM_КнопкаРазвернуть;
				
			ИначеЕсли ЭлементСтруктуры.Ключ = "НеРазобраноСводныеДанные" Тогда
				
				Элементы.НадписьВсего.Заголовок = НСтр("ru = 'Всего'") + " ("+Формат(ЭлементСтруктуры.Значение.Всего, "ЧН=0")+")";
				
				КоличествоОбращений = 0;
				Если Не ЭлементСтруктуры.Значение.Свойство("ВОжидании", КоличествоОбращений) Тогда
					КоличествоОбращений = 0;
				КонецЕсли;
				Элементы.НадписьВОжидании.Заголовок = НСтр("ru = 'В ожидании'") + " ("+Формат(КоличествоОбращений, "ЧН=0")+")";
				
				Если Не ЭлементСтруктуры.Значение.Свойство("Просрочено", КоличествоОбращений) Тогда
					КоличествоОбращений = 0;
				КонецЕсли;
				Элементы.НадписьПросрочено.Заголовок = НСтр("ru = 'Просрочено'") + " ("+Формат(КоличествоОбращений, "ЧН=0")+")";
				
				Если Не ЭлементСтруктуры.Значение.Свойство("Сегодня", КоличествоОбращений) Тогда
					КоличествоОбращений = 0;
				КонецЕсли;
				Элементы.НадписьСегодня.Заголовок = НСтр("ru = 'Обработать сегодня'") + " ("
					+Формат(КоличествоОбращений, "ЧН=0")+")";
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьОбновлениеЗаголовковВФоне(Знач ПереданныеДанныеКолонок, УникальныйИдентификатор)
	
	ДанныеКолонок = Новый Структура;
	Для Каждого КлючИЗначение Из ПереданныеДанныеКолонок Цикл
		ДанныеКолонки = Новый Структура;
		Для Каждого КлючИЗначениеВложенные Из КлючИЗначение.Значение Цикл
			Если КлючИЗначениеВложенные.Ключ = "СхемаКомпоновкиДанных" Или
				КлючИЗначениеВложенные.Ключ = "НастройкиКомпоновкиДанных" Тогда
				ДанныеКолонки.Вставить(КлючИЗначениеВложенные.Ключ, ПолучитьИзВременногоХранилища(КлючИЗначениеВложенные.Значение));
			Иначе
				ДанныеКолонки.Вставить(КлючИЗначениеВложенные.Ключ, КлючИЗначениеВложенные.Значение);
			КонецЕсли;
		КонецЦикла;
		ДанныеКолонок.Вставить(КлючИЗначение.Ключ, ДанныеКолонки);
	КонецЦикла;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДанныеКолонок", ДанныеКолонок);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление заголовков АРМ Мои продажи'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Обработки.CRM_АРМ_МоиПродажи.ПолучитьДанныеЗаголовковДинамическихСписков",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьПараметрыОбновления(ПараметрыОбработки)
	
	Если ТипЗнч(ПараметрыОбработки.НовоеСостояние) = Тип("СправочникСсылка.CRM_СостоянияИнтересов") Тогда
		
		Если ПараметрыОбработки.НовоеСостояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
			ПараметрыОбработки.НовоеСостояние = "ТаблицаУспешно";
		ИначеЕсли ПараметрыОбработки.НовоеСостояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
			ПараметрыОбработки.НовоеСостояние = "ТаблицаНеудачно";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыОбработки.Состояние) = Тип("СправочникСсылка.CRM_СостоянияИнтересов") Тогда
		
		Если ПараметрыОбработки.Состояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
			ПараметрыОбработки.Состояние = "ТаблицаУспешно";
		ИначеЕсли ПараметрыОбработки.Состояние.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
			ПараметрыОбработки.Состояние = "ТаблицаНеудачно";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаСервере
Процедура УстановитьФильтрНаСервере(Результат)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
	ИначеЕсли ТипЗнч(Результат) = Тип("Соответствие") Тогда
		РезультатСтруктура = Новый Структура;
		Для Каждого КлючИЗначение Из Результат Цикл
			Если ТипЗнч(КлючИЗначение.Ключ) = Тип("Строка") Тогда
				РезультатСтруктура.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатСтруктура);
		КонецЦикла;
	КонецЕсли;
	
	Если ВариантПериода = "" Тогда
		Период = ОтборСозданы[0];
		ПериодОтбора = ОтборСозданы[0].Значение;
		ПредставлениеПериода = ПредставлениеПериода(ПериодОтбора.ДатаНачала, ПериодОтбора.ДатаОкончания, );
	Иначе
		Если ВариантПериода = "ПроизвольныйПериод" Тогда
			НомерПериода = 0;
		ИначеЕсли ВариантПериода = "Сегодня" Тогда
			НомерПериода = 1;
		ИначеЕсли ВариантПериода = "3 дня" Тогда
			НомерПериода = 2;
		ИначеЕсли ВариантПериода = "Неделя" Тогда
			НомерПериода = 3;
		ИначеЕсли ВариантПериода = "Месяц" Тогда
			НомерПериода = 4;
		КонецЕсли;
		
		Период = ОтборСозданы[НомерПериода];
		ПериодОтбора = ОтборСозданы[НомерПериода].Значение;
		ЗначениеПериода = СписокПериодов.НайтиПоЗначению(ВариантПериода);
		Если ЗначениеПериода<>Неопределено Тогда
			ПредставлениеПериода = ЗначениеПериода.Представление;
		КонецЕсли;
		Если НомерПериода = 0 Тогда
			Если ЗначениеЗаполнено(Период.Значение.ДатаНачала) Или ЗначениеЗаполнено(Период.Значение.ДатаОкончания) Тогда
				Период.Пометка = Истина;
			Иначе
				Период.Пометка = Ложь;
			КонецЕсли;
		Иначе
			Период.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;	
	Теги = Новый Массив;
	Для Каждого ЭлементТегов Из ОтборТеги Цикл
		Теги.Добавить(ЭлементТегов.Значение);	
	КонецЦикла;	
	ОтборВключен = Теги.Количество() > 0;
	СсылкиНаОбъектыСтегами.ЗагрузитьЗначения(CRM_ТегиВызовСервера.ОбъектыПоТегамПоВсемОтборам("Документ.CRM_Интерес",
		 Теги));
	
	ОбновитьОтборыНаСервере();
	СформироватьЗаголовок(ЭтотОбъект);
	
	ОбновитьВиджетыФормы();
	
	Элементы.ГруппаНеРазобрано.Видимость = НЕ СкрытьКолонкуОбращения;
	
КонецПроцедуры	

&НаСервере
Процедура СброситьФильтрНаСервере()
	
	ОтборТеги.Очистить();
	
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("ОтборВключен", Ложь);
	СтруктураФильтра.Вставить("ОтборТеги", ОтборТеги);
	СтруктураФильтра.Вставить("ПоискПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	СтруктураФильтра.Вставить("ВариантПериода", "");
	СтруктураФильтра.Вставить("ПоискКлиент", Справочники.Партнеры.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискТипУслуги", Справочники.CRM_ТипУслуги.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискПроект", Справочники.Проекты.ПустаяСсылка());
	СтруктураФильтра.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
	СтруктураФильтра.Вставить("ТекущаяРоль", Справочники.РолиИсполнителей.ПустаяСсылка());
	СтруктураФильтра.Вставить("ОтборПоРолиУстановлен", Истина);
	СтруктураФильтра.Вставить("ТекущийАвтор", Справочники.Пользователи.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискИсточникПривлечения",
		 ПланыВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка());
	СтруктураФильтра.Вставить("ПоискЗначениеИсточникаПривлечения", Неопределено);
	СтруктураФильтра.Вставить("ПоискПроект", Справочники.Проекты.ПустаяСсылка());
	
	УстановитьФильтрНаСервере(СтруктураФильтра);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыНаСервере(ВидОтборов = "Все", Колонки = Неопределено)
	
	ОтборыУстановлены = Ложь;
	
	КоличествоФильтров = 0;
	
	МассивТаблиц = Новый СписокЗначений;
	МассивТаблиц.Добавить("НеРазобрано","НеРазобрано");
	МассивТаблиц.Добавить("ТаблицаНеудачно","ТаблицаНеудачно");
	МассивТаблиц.Добавить("ТаблицаУспешно","ТаблицаУспешно");
	МассивТаблиц.Добавить("ТаблицаСписок","ТаблицаСписок");
	
	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		МассивТаблиц.Добавить(Строка.СписокСостояний,ИмяРеквизита);
	КонецЦикла;
	Период = ОтборСозданы.НайтиПоЗначению(ПериодОтбора);
	Если Период = Неопределено Тогда
		Период = ОтборСозданы.Добавить(ПериодОтбора);
	КонецЕсли;

	// Подсчет количества фильтров
	Если ОтборВключен Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПоискКлиент) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискПроект) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискТипУслуги) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискЗначениеИсточникаПривлечения) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискИсточникПривлечения) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если НЕ ОтборПоРолиУстановлен Или ЗначениеЗаполнено(ТекущаяРоль) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийАвтор) Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискПодразделение) Тогда
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	ОтборПоОтветственному = ЗначенияОтбораПоОтветственному(ТекущийПользователь, ТекущаяРоль, ОтборПоРолиУстановлен);
	ОтборПоОтветственномуЗаполнен = (ОтборПоОтветственному.Количество() > 1);

	ТекущаяДата = ТекущаяДатаСеанса();
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Если ВидОтборов = "СтрокаПоиска" ИЛИ ВидОтборов = "Все" Тогда
			Отбор = ВзаимодействияКлиентСервер.ОтборДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление]);
			ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Отбор.Элементы,
				НСтр("ru='Отбор по строке поиска'"),
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			
			Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "Заголовок",
					 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
					+"%");
			КонецЕсли;	
			
			Если ИмяТаблицы.Представление = "НеРазобрано" Тогда
				Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ТекстОснования",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
				КонецЕсли;
			ИначеЕсли ИмяТаблицы.Представление = "ТаблицаНеудачно"
				 ИЛИ ИмяТаблицы.Представление = "ТаблицаУспешно"
				 Или ИмяТаблицы.Представление = "ТаблицаСписок" Тогда
				Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ПартнерНаименование",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
				КонецЕсли;
			ИначеЕсли ИмяТаблицы.Представление <> "ТаблицаСписок" Тогда	
				Если ЗначениеЗаполнено(СтрокаПоискаОтбор) Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ОписаниеИнтереса",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ПартнерНаименование",
						 ВидСравненияКомпоновкиДанных.Подобно, "%"+СтрокаПоискаОтбор
						+"%");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ВидОтборов = "Период" Или ВидОтборов = "Все" Тогда
			Если ИмяТаблицы.Представление = "ТаблицаНеудачно" Или ИмяТаблицы.Представление = "ТаблицаУспешно" Тогда
				Если ВариантПериода = "Сегодня" Тогда
					ПериодНачалаОтбора = ПериодОтбора.ДатаНачала;
				Иначе
					ДлительностьПериодаОтбора	= ПериодОтбора.ДатаОкончания - ПериодОтбора.ДатаНачала;
					ПериодНачалаОтбора			= НачалоДня(ПериодОтбора.ДатаНачала - ДлительностьПериодаОтбора);
				КонецЕсли;
			Иначе
				ПериодНачалаОтбора = Дата('00010101');
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				 "КрайнийСрокНачало",
				ПериодНачалаОтбора, Период.Пометка);
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				 "КрайнийСрокКонец",
				ПериодОтбора.ДатаОкончания, Период.Пометка);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
			"Пользователь", ОтборПоОтветственному, ОтборПоОтветственномуЗаполнен);
		Если ИмяТаблицы.Представление = "НеРазобрано" Тогда
			
			ВидыКаналов = Новый Массив;
			Если Не СкрытьЗаявки Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.Заявка);
			КонецЕсли;
			Если Не СкрытьСообщения Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.Диалоги);
			КонецЕсли;
			Если НЕ ОтображатьПисьма Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.ЭлектроннаяПочта);
			КонецЕсли;
			Если ПроверитьОтборПоСценариюТелефония(ВоронкаПродаж.СценарийИнтереса) Тогда
				ВидыКаналов.Добавить(Перечисления.CRM_ВидыКаналовПоступленияОбращений.ТелефонныйЗвонок);
			КонецЕсли;
			
			СкрываемыеЗвонки = Новый Массив;
			Если СкрытьПропущенныеТелефонныеЗвонки Тогда
				СкрываемыеЗвонки.Добавить(Перечисления.сфпСостоянияЗвонков.Пропущенный);
			КонецЕсли;
			Если СкрытьОтвеченныеТелефонныеЗвонки Тогда
				СкрываемыеЗвонки.Добавить(Перечисления.сфпСостоянияЗвонков.Отвеченный);
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ВидыКаналов",
				ВидыКаналов, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "БезСценария",
				Не ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ТекущаяДата",
				ТекущаяДата, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ПериодПросроченных",
				НачалоДня(ТекущаяДата), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ПериодТекущих",
				КонецДня(ТекущаяДата), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "ИсточникиЛидов",
				ИсточникиЛидовСценария(ВоронкаПродаж.СценарийИнтереса), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано, "СкрываемыеЗвонки",
				СкрываемыеЗвонки, СкрываемыеЗвонки.Количество()>0);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
				 "СостояниеЛидов", Справочники.CRM_СостоянияЛидов.Новый,
				 СкрытьПовторныеОбращения);

			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
																				"СтрокаТелефонныйЗвонок",
																				НСтр("ru = 'Телефонный звонок'"), Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект.НеРазобрано,
																				"СтрокаПропущенныйТелефонныйЗвонок",
																				НСтр("ru = 'Пропущенный телефонный звонок'"), Истина);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				"Автор", ТекущийАвтор, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ТекущийАвтор));
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				"Подразделение", ПоискПодразделение, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ПоискПодразделение));
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление],
				"Проект", ПоискПроект, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ПоискПроект), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		Если ИмяТаблицы.Представление <> "НеРазобрано" 
			И ИмяТаблицы.Представление <> "ТаблицаУспешно" 
			И ИмяТаблицы.Представление <> "ТаблицаНеудачно" 
			И ИмяТаблицы.Представление <> "ТаблицаСписок" Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
				"СостояниеИнтереса", ИмяТаблицы.Значение, Истина);
		ИначеЕсли ЗначениеЗаполнено(ВоронкаПродаж.СценарийИнтереса) Тогда
			Если ИмяТаблицы.Представление = "ТаблицаНеудачно" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
					"СостояниеИнтереса", НеудачноеЗавершениеСценария(ВоронкаПродаж), Истина);
			ИначеЕсли ИмяТаблицы.Представление = "ТаблицаУспешно" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы.Представление], 
					"СостояниеИнтереса", УспешноеЗавершениеСценария(ВоронкаПродаж), Истина);
			ИначеЕсли ИмяТаблицы.Представление = "ТаблицаСписок" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаСписок, "СостояниеИнтереса",
					Справочники.CRM_СостоянияИнтересов.МассивСостоянийПоСценарию(ВоронкаПродаж.СценарийИнтереса), ВидСравненияКомпоновкиДанных.ВСписке,
					, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
			КонецЕсли;
		КонецЕсли;
		Если ИмяТаблицы.Представление <> "НеРазобрано" Тогда
			Если ВидОтборов = "Все" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"Объект",
					СсылкиНаОбъектыСтегами,
					ВидСравненияКомпоновкиДанных.ВСписке, ,
					ОтборВключен,
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"Партнер",
					ПоискКлиент,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискКлиент),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"ТипУслуги",
					ПоискТипУслуги,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискТипУслуги),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"ИсточникПервичногоИнтереса",
					ПоискЗначениеИсточникаПривлечения,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискЗначениеИсточникаПривлечения),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					ЭтотОбъект[ИмяТаблицы.Представление],
					"КаналПервичногоИнтереса",
					ПоискИсточникПривлечения,
					ВидСравненияКомпоновкиДанных.Равно, ,
					ЗначениеЗаполнено(ПоискИсточникПривлечения),
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущийПользователь <> Пользователи.ТекущийПользователь() Тогда
		ОтборыУстановлены = Истина;
		КоличествоФильтров = КоличествоФильтров + 1;
	КонецЕсли;
	
	Элементы.ОткрытьФильтр.Заголовок = ?(ОтборыУстановлены, НСтр("ru='Фильтр: ';en='Filter: '")
		+КоличествоФильтров,
		 НСтр("ru='Фильтр';en='Filter'"));
	Элементы.ОткрытьФильтр.Картинка = ?(ОтборыУстановлены, БиблиотекаКартинок.CRM_ФильтрАктивный,
		 БиблиотекаКартинок.CRM_ФильтрНеАктивный);
	Элементы.ОткрытьФильтр.ЦветТекста = ?(ОтборыУстановлены, ЦветаСтиля.CRM_ОсновнойГолубой, Новый Цвет(77, 77, 77));
	
	СтруктураОбновленияКолонок = ДанныеКолонокКанбан();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияОтбораПоОтветственному(ТекущийПользователь, ТекущаяРоль, ОтборПоРолиУстановлен)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) И ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		
		// Отбор по "Все роли"
		Если НЕ ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен Тогда
			РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь).ВыгрузитьЗначения();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, РолиПользователя, Истина);
		КонецЕсли;
 		
		// +Рарус alexpr
		//ЗамещаемыеПользователи = РегистрыСведений.CRM_ОтсутствиеСотрудников.ЗамещаемыеПользователи(ТекущийПользователь);
		ЗамещаемыеПользователи = Новый Массив;
		// -Рарус alexpr
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ЗамещаемыеПользователи, Истина);
		
	Иначе
		
		Если ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен Тогда
			ИсполнителиПоРоли = CRM_БизнесПроцессыСервер.ПолучитьВозможныхИсполнителейПоРоли(ТекущаяРоль).ВыгрузитьЗначения();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ИсполнителиПоРоли, Истина);
		Иначе
			// Все доступные пользователи и роли
			Если Константы.CRM_ИспользоватьДоступныхПользователей.Получить() Тогда
				Результат = ПолучитьДоступныхМенеджеровИРоли();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен Тогда
		Результат.Добавить(ТекущаяРоль);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Результат.Добавить(ТекущийПользователь);
	КонецЕсли;

	Результат.Добавить(Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Виджеты

&НаСервере
Процедура ОбновитьВиджетыФормы()
	//Если РаботаВМоделиСервиса.РазделениеВключено() Тогда Возврат КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		CRM_РаботаСВиджетамиВызовСервера.ОбновитьВиджетыФормы(ЭтотОбъект, "ГруппаВиджеты");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьВиджетФормы(Виджет)
	
	Возврат CRM_РаботаСВиджетамиВызовСервера.ДобавитьВиджетФормы(ЭтотОбъект, "ГруппаВиджеты", Виджет);
	
КонецФункции

&НаСервере
Процедура УдалитьВиджетФормы(Виджет)
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		CRM_РаботаСВиджетамиВызовСервера.УдалитьВиджетФормы(ЭтотОбъект, "ГруппаВиджеты", Виджет);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_01()
	ОбновитьВиджетНаСервере("01");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_02()
	ОбновитьВиджетНаСервере("02");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_03()
	ОбновитьВиджетНаСервере("03");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_04()
	ОбновитьВиджетНаСервере("04");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_Прочие()
	ОбновитьВиджетНаСервере("Прочие");
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетНаСервере(ИндексВиджета)
	
	CRM_РаботаСВиджетамиВызовСервера.ОбновитьВиджет(ЭтотОбъект, ИндексВиджета);
КонецПроцедуры

&НаСервере
Функция ПолучитьИсточникДанныхВиджета(Виджет)
	Возврат Виджет.ИсточникДанных;
КонецФункции

&НаСервере
Функция ПолучитьПериодОбновленияВиджетаНаСервере(Виджет, Индекс)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиВиджетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь 	= ТекущийПользователь;
	МенеджерЗаписи.Виджет 			= Виджет;
	МенеджерЗаписи.ИндексВиджета 	= Индекс;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат ?(ЗначениеЗаполнено(МенеджерЗаписи.ПериодОбновления), МенеджерЗаписи.ПериодОбновления, 3600);
	Иначе
		Если Виджет.ИсточникДанных.КонтролируемыйПоказатель = "" Тогда
			Возврат 3600;
		Иначе	
			Возврат Виджет.ИсточникДанных.ПериодОбновления;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкуПоказыватьВиджеты(КлючОбъекта, Настройка)
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "ПоказыватьПанельВиджетов", Настройка);  
КонецПроцедуры

#КонецОбласти

#Область НастройкаШириныКолонок

&НаКлиенте
Процедура УстановитьШиринуКолонокКанбан()
	
	ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("НеРазобрано");
	МассивТаблиц.Добавить("ТаблицаНеудачно");
	МассивТаблиц.Добавить("ТаблицаУспешно");
	МассивТаблиц.Добавить("ТаблицаСписок");
	МассивТаблиц.Добавить("ТаблицаНеудачноСвернуто");
	МассивТаблиц.Добавить("ТаблицаУспешноСвернуто");

	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		МассивТаблиц.Добавить(ИмяРеквизита);
	КонецЦикла;
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы[ИмяТаблицы].Ширина   = ШиринаКолонокКанбан;
		ЭлементДекорацияЦвет = Элементы.Найти("ДекорацияЦвет_Этап_" + ИмяТаблицы);
		Если ЭлементДекорацияЦвет<>Неопределено Тогда
			ЭлементДекорацияЦвет.Ширина   = ШиринаКолонокКанбан;
		КонецЕсли;
		ЭлементДекорацияЦвет = Элементы.Найти("ДекорацияЦвет_" + ИмяТаблицы);
		Если ЭлементДекорацияЦвет<>Неопределено Тогда
			ЭлементДекорацияЦвет.Ширина   = ШиринаКолонокКанбан;
		КонецЕсли;

		Если Элементы.Найти("ГруппаЗаголовок_" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["ГруппаЗаголовок_" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("Заголовок" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Заголовок" + ИмяТаблицы].Ширина = ШиринаЭлемента-4;
		КонецЕсли;
		Если Элементы.Найти("Партнер" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Партнер" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("ОписаниеИнтереса" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["ОписаниеИнтереса" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("Сумма" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Сумма" + ИмяТаблицы].Ширина = ШиринаЭлемента-1;
		КонецЕсли;
		Если Элементы.Найти("СрокНаЭтапе" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["СрокНаЭтапе" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
	КонецЦикла;
	Элементы.ДекорацияЦвет_Этап_Успешно.Ширина   = ШиринаКолонокКанбан;
	Элементы.ДекорацияЦвет_Этап_Неудачно.Ширина   = ШиринаКолонокКанбан;
	Элементы.НеРазобраноЗаголовок.Ширина = ШиринаЭлемента+2;
	
	ТекущийЭлемент = Элементы.ШиринаКолонокКанбан;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьШиринуКолонокКанбанСервер()
	
	ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("НеРазобрано");
	МассивТаблиц.Добавить("ТаблицаНеудачно");
	МассивТаблиц.Добавить("ТаблицаУспешно");
	МассивТаблиц.Добавить("ТаблицаСписок");
	МассивТаблиц.Добавить("ТаблицаНеудачноСвернуто");
	МассивТаблиц.Добавить("ТаблицаУспешноСвернуто");

	Для Каждого Строка Из ТаблицаЭтапы Цикл
		ИдентификаторЭтапа = СтрЗаменить(Строка(Строка.Ссылка.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "Этап_"+ИдентификаторЭтапа;
		МассивТаблиц.Добавить(ИмяРеквизита);
	КонецЦикла;
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы[ИмяТаблицы].Ширина   = ШиринаКолонокКанбан;
		ЭлементДекорацияЦвет = Элементы.Найти("ДекорацияЦвет_Этап_" + ИмяТаблицы);
		Если ЭлементДекорацияЦвет<>Неопределено Тогда
			ЭлементДекорацияЦвет.Ширина   = ШиринаКолонокКанбан;
		КонецЕсли;
		ЭлементДекорацияЦвет = Элементы.Найти("ДекорацияЦвет_" + ИмяТаблицы);
		Если ЭлементДекорацияЦвет<>Неопределено Тогда
			ЭлементДекорацияЦвет.Ширина   = ШиринаКолонокКанбан;
		КонецЕсли;

		Если Элементы.Найти("ГруппаЗаголовок_" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["ГруппаЗаголовок_" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("Заголовок" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Заголовок" + ИмяТаблицы].Ширина = ШиринаЭлемента-4;
		КонецЕсли;
		Если Элементы.Найти("Партнер" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Партнер" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("ОписаниеИнтереса" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["ОписаниеИнтереса" + ИмяТаблицы].Ширина = ШиринаЭлемента-2;
		КонецЕсли;
		Если Элементы.Найти("Сумма" + ИмяТаблицы)<>Неопределено Тогда
			Элементы["Сумма" + ИмяТаблицы].Ширина = ШиринаЭлемента-1;
		КонецЕсли;
	КонецЦикла;
	Элементы.ДекорацияЦвет_Этап_Успешно.Ширина = ШиринаКолонокКанбан;
	Элементы.ДекорацияЦвет_Этап_Неудачно.Ширина = ШиринаКолонокКанбан;
	Элементы.НеРазобраноЗаголовок.Ширина = ШиринаЭлемента + 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаКолонокКанбанПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ИзменениеШириныКолонокКанбан", 0.5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеШириныКолонокКанбан()
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		УстановитьШиринуКолонокКанбанСервер();
	Иначе	
		УстановитьШиринуКолонокКанбан();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьШиринуКолонок(Команда)
	
	Если Элементы.ГруппаПолосаРегулированияВсплывающая.Скрыта() Тогда
		Элементы.ГруппаПолосаРегулированияВсплывающая.Показать();
		ПодключитьОбработчикОжидания("ЗакрытьПанельРегулирования", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельРегулирования()
	
	Если Элементы.ГруппаПолосаРегулированияВсплывающая.Скрыта() Тогда
		СохранитьНастройкиШириныКолонок(ШиринаКолонокКанбан, ВоронкаПродаж);
		ТекущийЭлемент = Элементы.НастроитьШиринуКолонок;
	Иначе
		ПодключитьОбработчикОжидания("ЗакрытьПанельРегулирования", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиШириныКолонок(ШиринаКолонокКанбан, ВоронкаПродаж)
	НастройкиШирины = ХранилищеОбщихНастроек.Загрузить("МоиПродажиНастройкиШириныКолонок");
	Если НастройкиШирины = Неопределено Тогда
		НастройкиШирины = Новый Структура();
	КонецЕсли;
	НастройкиШирины.Вставить("Ширина"+СтрЗаменить(Строка(ВоронкаПродаж.УникальныйИдентификатор()), "-",
		 ""), ШиринаКолонокКанбан);
	Если НастройкиШирины.Количество() < 3 Тогда
		НастройкиШирины.Вставить("ОбщаяНастройка", ШиринаКолонокКанбан);
	КонецЕсли;
	ХранилищеОбщихНастроек.Сохранить("МоиПродажиНастройкиШириныКолонок",, НастройкиШирины);
КонецПроцедуры

&НаСервере
Процедура УстановитьШиринуЭлементовКоманднойПанели()
	
	МассивЭкранов = ПолучитьИнформациюЭкрановКлиента();
	// Защита от Толстого клиента - в нем ПолучитьИнформациюЭкрановКлиента() возвращает Неопределено и падает ошибка
	Если МассивЭкранов <> Неопределено Тогда
		ШиринаЭкрана = МассивЭкранов[0].Ширина;
	Иначе
		ШиринаЭкрана = 0;
	КонецЕсли;
	
	Если ШиринаЭкрана < 1600 Тогда
		Элементы.ВыборСценария.Ширина				= 11;
		Элементы.НастройкаСценария.Ширина			= 3;
		Элементы.СтрокаПоиска.МаксимальнаяШирина	= 14;
		Элементы.ГруппаЕщеКП.Ширина					= 7;
		Элементы.ДекорацияРазделительРегулировки.Видимость	= Ложь;
	Иначе
		Элементы.ВыборСценария.Ширина				= 16;
		Элементы.НастройкаСценария.Ширина			= 4;
		Элементы.СтрокаПоиска.МаксимальнаяШирина	= 20;
		Элементы.ГруппаЕщеКП.Ширина					= 14;
		Элементы.ДекорацияРазделительРегулировки.Видимость	= Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СводныеДанные

&НаКлиенте
Процедура НеРазобраноСводныеДанные_Обновить(Команда)
	
	ОбновитьТаблицы("НеРазобрано");
	
КонецПроцедуры

&НаКлиенте
Процедура НеРазобраноСводныеДанные_Настройка(Команда)
	
	Если Элементы.ГруппаСводныеДанные_Настройка.Скрыта() Тогда
		Элементы.ГруппаСводныеДанные_Настройка.Показать();
		ПодключитьОбработчикОжидания("НеРазобраноСводныеДанные_ЗакрытьНастройку", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеРазобраноСводныеДанные_ЗакрытьНастройку()
	
	Если Элементы.ГруппаСводныеДанные_Настройка.Скрыта() Тогда
		ТекущийЭлемент = Элементы.НеРазобраноСводныеДанные_Настройка;
		ОтключитьОбработчикОжидания("НеРазобраноСводныеДанные_ЗакрытьНастройку");
	Иначе
		ПодключитьОбработчикОжидания("НеРазобраноСводныеДанные_ЗакрытьНастройку", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеРазобраноСводныеДанные_СкрытьПоказать(Команда)
	НеРазобраноСводныеДанные_Показать = Не НеРазобраноСводныеДанные_Показать;
	Если НеРазобраноСводныеДанные_Показать Тогда
		CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.УправлениеСрокомОбработкиОбращений.Удобство.ПоказатьСводныеДанные");
		НеРазобраноСводныеДанные_ТекРежим = "Всего";
	Иначе
		CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.УправлениеСрокомОбработкиОбращений.Удобство.СвернутьСводныеДанные");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НеРазобрано, "Светофор", 
			НеРазобраноСводныеДанные_ТекРежим, ВидСравненияКомпоновкиДанных.Равно, "Отбор по светофору", Ложь);
	КонецЕсли;
	НеРазобраноСводныеДанные_Видимость();
	ОбновитьТаблицы("НеРазобрано");
КонецПроцедуры

&НаСервере
Процедура НеРазобраноСводныеДанные_Видимость()
	Элементы.ГруппаНеРазобраноСводныеДанные.Видимость = НеРазобраноСводныеДанные_Показать;
	Элементы.ДекорацияОтступНеРазобрано.Видимость = НеРазобраноСводныеДанные_Показать;
	// +Рарус alexpr
	//Элементы.НеРазобраноСводныеДанные_Показать.Видимость = Не НеРазобраноСводныеДанные_Показать;
	Элементы.НеРазобраноСводныеДанные_Показать.Видимость = Ложь;
	// -Рарус alexpr
	Элементы.НеРазобраноСводныеДанные_Свернуть.Видимость = НеРазобраноСводныеДанные_Показать;
	Элементы.Декорация_Этап_НеРазобрано_Сумма.Видимость = Не НеРазобраноСводныеДанные_Показать;
	Элементы.ГруппаАнализОбращений.Видимость = НеРазобраноСводныеДанные_Показать;
	Если НеРазобраноСводныеДанные_Показать Тогда
		НеРазобраноСводныеДанные_ИзменениеРежимаСервер(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НеРазобраноСводныеДанные_ПериодОбновленияПриИзменении(Элемент)
	ОтключитьОбработчикОжидания("ПериодическоеОбновлениеСписков");
	ПодключитьОбработчикОжидания("ПериодическоеОбновлениеСписков", НеРазобраноСводныеДанные_ПериодОбновления*60, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АнализОбращенийНажатие(Элемент)
	CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.УправлениеСрокомОбработкиОбращений.Удобство.ОткрытиеОтчетаАнализОбращенийИзАРММоиПродажи");
	ПараметрыОтчета = Новый Структура();
	ОткрытьФорму("Отчет.CRM_АнализОбращений.ФормаОбъекта", ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура НеРазобраноСводныеДанные_ИзменениеРежима(Элемент)
	
	Если Элемент.Родитель = Элементы.ГруппаСводныеДанныеВсего Тогда
		НеРазобраноСводныеДанные_ТекРежим = "Всего";
		CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.УправлениеСрокомОбработкиОбращений.Удобство.ГруппировкаВсего");
	ИначеЕсли Элемент.Родитель = Элементы.ГруппаСводныеДанныеВОжидании Тогда
		НеРазобраноСводныеДанные_ТекРежим = "ВОжидании";
	ИначеЕсли Элемент.Родитель = Элементы.ГруппаСводныеДанныеСегодня Тогда
		НеРазобраноСводныеДанные_ТекРежим = "Сегодня";
		CRM_ЦентрМониторингаКлиентСервер.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.УправлениеСрокомОбработкиОбращений.Удобство.ГруппировкаОбработатьСегодня");
	ИначеЕсли Элемент.Родитель = Элементы.ГруппаСводныеДанныеПросрочено Тогда
		НеРазобраноСводныеДанные_ТекРежим = "Просрочено";
	КонецЕсли;
	НеРазобраноСводныеДанные_ИзменениеРежимаСервер(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НеРазобраноСводныеДанные_ИзменениеРежимаСервер(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.НадписьВсего.Шрифт = Новый Шрифт(Элементы.НадписьВсего.Шрифт,,,Ложь);
	Элементы.НадписьВОжидании.Шрифт = Новый Шрифт(Элементы.НадписьВОжидании.Шрифт,,,Ложь);
	Элементы.НадписьСегодня.Шрифт = Новый Шрифт(Элементы.НадписьСегодня.Шрифт,,,Ложь);
	Элементы.НадписьПросрочено.Шрифт = Новый Шрифт(Элементы.НадписьПросрочено.Шрифт,,,Ложь);

	ИмяЭлемента = "Надпись" + Форма.НеРазобраноСводныеДанные_ТекРежим;
	Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
		Элементы[ИмяЭлемента].Шрифт = Новый Шрифт(Элементы[ИмяЭлемента].Шрифт,,, Истина);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.НеРазобрано, "Светофор", 
		Форма.НеРазобраноСводныеДанные_ТекРежим, ВидСравненияКомпоновкиДанных.Равно, "Отбор по светофору", Форма.НеРазобраноСводныеДанные_ТекРежим <> "Всего");
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьЗаголовок(Форма)
	Форма.Заголовок = НСтр("ru='Мои продажи';en='My Sales'")+" / "+ Строка(Форма.ВоронкаПродаж) +" / "+ Форма.ТекущийПользователь +" / " 
		+ Форма.ПредставлениеПериода; 
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеВалюты()
	
	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	Если ЗначениеЗаполнено(ВалютаУправленческогоУчета) Тогда
		Если ВалютаУправленческогоУчета.Код = "643" Тогда
			// Рубль
			ВалютаПредставление = Символ("8381");
		ИначеЕсли ВалютаУправленческогоУчета.Код = "978" Тогда
			// Евро
			ВалютаПредставление = Символ("8364");
		ИначеЕсли ВалютаУправленческогоУчета.Код = "840" Тогда
			// Доллар
			ВалютаПредставление = Символ("36");
		Иначе
			ВалютаПредставление = ВалютаУправленческогоУчета.Наименование;
		КонецЕсли;
	Иначе
		ВалютаПредставление = "";
	КонецЕсли;
	
	Возврат ВалютаПредставление;
	
КонецФункции

&НаСервере
Процедура СоздатьКнопкиВидАРМ()
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "ГруппаГруппаВидАРМ");
	СтруктураКоманднаяПанель.Вставить("Родитель", "ГруппаВидАРМ");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "ЭлементГруппаВидАРМ");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидКанбан";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Канбан';en='Kanban'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ВидКанбан");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	СтруктураКнопка.Вставить("Пометка", Истина);

	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидСписок";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Список';en='List'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ВидСписок");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);
	// +Рарус alexpr
	//CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().
	//	СформироватьКоманднуюПанельПоСтруктуре(ЭтотОбъект, СтруктураСоздания);
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().
		СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
	// -Рарус alexpr
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопиОтборПросроченные()
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "ГруппаОтборВключатьПросроченные");
	СтруктураКоманднаяПанель.Вставить("Родитель", "ГруппаОтборПросроченные");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "ЭлементГруппаОтборВключатьПросроченные");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВнизу";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Внизу';en='Down'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ПросроченныеВнизу");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВверху";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Вверху';en='Up'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ПросроченныеВверху");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);
	// +Рарус alexpr
	//CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().
	//	СформироватьКоманднуюПанельПоСтруктуре(ЭтотОбъект, СтруктураСоздания);
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().
		СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
	// -Рарус alexpr
КонецПроцедуры

&НаСервере
Процедура ПокраситьКнопкиПросроченныеНаСервере()
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВнизу";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(ОтборВключатьПросроченные = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВверху";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(ОтборВключатьПросроченные = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().
		ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
	
КонецПроцедуры

&НаСервере
Процедура ПокраситьКнопкиВидАРМНаСервере(РежимАРМ)
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидКанбан";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(РежимАРМ = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидСписок";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(РежимАРМ = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().
		ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
	
КонецПроцедуры

#КонецОбласти

#Область РаспознаваниеРечи

// +Рарус alexpr

//&НаСервере
//Процедура РаспознаваниеРечи_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
//	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
//	
//	ИмяРаспознаваниеРечиДоступно = "РаспознаваниеРечи_РаспознаваниеДоступно";
//	
//	ДобавляемыеРеквизиты = Новый Массив;
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРаспознаваниеРечиДоступно, ОписаниеТиповБулево));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаспознаваниеРечи_ВыполняетсяРаспознавание", ОписаниеТиповБулево));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаспознаваниеРечи_РаспознаваниеФразыЗавершено",
//		 ОписаниеТиповБулево));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаспознаваниеРечи_ВремяНачалаРаспознавания",
//		 Новый ОписаниеТипов("Число")));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаспознаваниеРечи_ПараметрыРаспознавания",
//		 Новый ОписаниеТипов)); // Произвольный
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаспознаваниеРечи_ПерезапускРаспознавания", ОписаниеТиповБулево));
//	
//	ИмяТаблицы = "РаспознаваниеРечи_ТаблицаЭлементов";
//	
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы,       Новый ОписаниеТипов("ТаблицаЗначений")));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЦветРамки",      Новый ОписаниеТипов("Цвет"), ИмяТаблицы));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяЭлемента",    ОписаниеТиповСтрока,         ИмяТаблицы));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяРеквизита",   ОписаниеТиповСтрока,         ИмяТаблицы));
//	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПодсказкаВвода", ОписаниеТиповСтрока,         ИмяТаблицы));
//	
//	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
//	
//	//
//	
//	ТекущиеПараметры = CRM_ПараметрыРаспознаванияРечи.ТекущиеПараметры(ЭтотОбъект);
//	
//	ЭтотОбъект["РаспознаваниеРечи_ПараметрыРаспознавания"] = ТекущиеПараметры;
//	ЭтотОбъект[ИмяРаспознаваниеРечиДоступно] = CRM_ПараметрыРаспознаванияРечи.РаспознаваниеДоступно(ТекущиеПараметры);
//	
//	Элементы.СтрокаПоиска.КнопкаВыбора = ЭтотОбъект[ИмяРаспознаваниеРечиДоступно];
//	
//	ЭтотОбъект["РаспознаваниеРечи_РаспознаваниеФразыЗавершено"] = Истина;
//	
//	РаспознаваниеРечи_ЗаполнитьТаблицуОформленийЭлементов();
//	
//	//
//	
//	Константы.CRM_ОбщаяГрамматикаРаботыСРечью.УстановитьГрамматикуСеанса();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РаспознаваниеРечи(Команда = Неопределено)
//	
//	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
//		CRM_ЛицензированиеЭкспортныеМетоды.ВывестиУведомлениеОНедоступности(НСтр("ru = 'Голосовой ввод'"));
//		Возврат;
//	КонецЕсли;
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("РаспознаваниеРечиПродолжение", ЭтотОбъект);
//	CRM_ЛицензированиеКлиент.ПроверитьПодключениеОтраслевыхСервисовИОткрыть(ОписаниеОповещения);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РаспознаваниеРечиПродолжение(Результат, ДопПараметр) Экспорт
//	
//	Если ЭтотОбъект["РаспознаваниеРечи_ВыполняетсяРаспознавание"] Тогда
//		CRM_РаботаСРечьюБМОКлиент.ОстановитьПотоковоеРаспознавание(УникальныйИдентификатор);
//	Иначе
//		РаспознаваниеРечи_НачатьРаспознавание();
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РаспознаваниеРечи_НачатьРаспознавание()
//	
//	ТекущиеПараметры = ЭтотОбъект["РаспознаваниеРечи_ПараметрыРаспознавания"];
//	ПараметрыМодели = CRM_ПараметрыРаспознаванияРечиКлиент.ПараметрыМодели(ТекущиеПараметры);
//	ВариантИспользования = CRM_ПараметрыРаспознаванияРечиКлиент.ВариантИспользования(ТекущиеПараметры);
//	ПараметрыРаспознавания = CRM_ПараметрыРаспознаванияРечиКлиент.ПараметрыПотоковогоРаспознаванияРечи(ТекущиеПараметры,
//		Новый ОписаниеОповещения("ПриОстановкеАудиозаписи", ЭтотОбъект));
//	
//	Элемент = Элементы.СтрокаПоиска;
//	СтрокаПоискаОтбор = "";
//	
//	Контекст = Новый Структура;
//	Контекст.Вставить("Форма", ЭтотОбъект);
//	Контекст.Вставить("Элемент", Элемент);
//	Контекст.Вставить("ИмяРеквизита", "СтрокаПоискаОтбор");
//	
//	Попытка
//		Оповещение = Новый ОписаниеОповещения("ПриПолученииРезультатаРаспознавания", ЭтотОбъект, Контекст,
//		             "ПриОбработкеОшибкиРаспознавания", ЭтотОбъект);
//		
//		CRM_РаботаСРечьюБМОКлиент.НачатьПотоковоеРаспознавание(
//			УникальныйИдентификатор,
//			Оповещение,
//			ПараметрыМодели,
//			ВариантИспользования,
//			ПараметрыРаспознавания);
//		
//		ЭтотОбъект["РаспознаваниеРечи_ВыполняетсяРаспознавание"] = Истина;
//		ЭтотОбъект["РаспознаваниеРечи_ВремяНачалаРаспознавания"] = ТекущаяУниверсальнаяДатаВМиллисекундах();
//		
//	Исключение
//		ПриОбработкеОшибкиРаспознавания(ИнформацияОбОшибке(), Истина, Контекст);
//	КонецПопытки;
//	
//	РаспознаваниеРечи_ИзменитьСостояниеФормы();
//	ТекущийЭлемент = Элементы.СтрокаПоиска;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РаспознаваниеРечи_ИзменитьСостояниеФормы()
//	
//	Если ЭтотОбъект["РаспознаваниеРечи_ВыполняетсяРаспознавание"] Тогда
//		Элементы.СтрокаПоиска.КартинкаКнопкиВыбора = БиблиотекаКартинок.CRM_МикрофонАктивный16;
//	Иначе
//		Элементы.СтрокаПоиска.КартинкаКнопкиВыбора = БиблиотекаКартинок.CRM_Микрофон16;
//	КонецЕсли;
//	
//	Элементы.СтрокаПоиска.КнопкаВыбора = ЭтотОбъект["РаспознаваниеРечи_РаспознаваниеДоступно"]
//		 И CRM_РаботаСРечьюБМОКлиент.ПоддерживаетсяПотоковоеРаспознавание();
//	
//	РаспознаваниеРечи_ИзменитьОформление();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриПолученииРезультатаРаспознавания(РезультатРаспознавания, ПродолжитьРаспознавание, Контекст) Экспорт 
//	
//	Если Не ВводДоступен() Тогда
//		CRM_РаботаСРечьюБМОКлиент.ОстановитьПотоковоеРаспознавание(УникальныйИдентификатор);
//		Возврат;
//	КонецЕсли;
//	
//	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	Если Не РезультатРаспознавания.РаспознаваниеФразыЗавершено Тогда
//		ЭтотОбъект[Контекст.ИмяРеквизита] = "";
//		Контекст.Элемент.ОбновитьТекстРедактирования();
//	КонецЕсли;
//	
//	CRM_ПоляВводаКлиент.ВставитьРезультатРаспознаванияПоКурсору(
//		Контекст.Форма,
//		Контекст.Элемент,
//		Контекст.ИмяРеквизита,
//		РезультатРаспознавания);
//	
//	ВремяКонца = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	CRM_РаботаСРечьюЖурналированиеКлиент.ДобавитьРезультатРаспознавания(
//		УникальныйИдентификатор,
//		РезультатРаспознавания,
//		ВремяНачала,
//		ВремяКонца);
//	
//	ЭтотОбъект["РаспознаваниеРечи_РаспознаваниеФразыЗавершено"] = РезультатРаспознавания.РаспознаваниеФразыЗавершено;
//	РаспознаваниеРечи_ИзменитьСостояниеФормы();
//	ТекущийЭлемент = Элементы.СтрокаПоиска;
//	
//	// +CRM
//	СтрокаПоискаПриИзменении(ТекущийЭлемент);
//	// -CRM
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОбработкеОшибкиРаспознавания(ИнформацияОбОшибке, СтандартнаяОбработка, Контекст) Экспорт
//	
//	СтандартнаяОбработка = Ложь;
//	
//	CRM_РаботаСРечьюЖурналированиеКлиент.ДобавитьИсключение(УникальныйИдентификатор, ИнформацияОбОшибке);
//	
//	ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке);
//	
//	ЭтотОбъект["РаспознаваниеРечи_РаспознаваниеФразыЗавершено"] = Истина;
//	РаспознаваниеРечи_ИзменитьСостояниеФормы();
//	ТекущийЭлемент = Элементы.СтрокаПоиска;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОстановкеАудиозаписи(РезультатАудиозаписи, Контекст) Экспорт 
//	
//	ЭтотОбъект["РаспознаваниеРечи_ВыполняетсяРаспознавание"] = Ложь;
//	ЭтотОбъект["РаспознаваниеРечи_РаспознаваниеФразыЗавершено"] = Истина;
//	РаспознаваниеРечи_ИзменитьСостояниеФормы();
//	ТекущийЭлемент = Элементы.СтрокаПоиска;
//	
//	ВремяКонца = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	ТекущиеПараметры = ЭтотОбъект["РаспознаваниеРечи_ПараметрыРаспознавания"];
//	ПараметрыМодели = CRM_ПараметрыРаспознаванияРечиКлиент.ПараметрыМодели(ТекущиеПараметры);
//	ВариантИспользования = CRM_ПараметрыРаспознаванияРечиКлиент.ВариантИспользования(ТекущиеПараметры);
//	
//	CRM_РаботаСРечьюЖурналированиеКлиент.ДобавитьАудио(
//		УникальныйИдентификатор,
//		РезультатАудиозаписи,
//		ПараметрыМодели,
//		ВариантИспользования,
//		ЭтотОбъект["РаспознаваниеРечи_ВремяНачалаРаспознавания"],
//		ВремяКонца);
//	
//	Если ЭтотОбъект["РаспознаваниеРечи_ПерезапускРаспознавания"] Тогда
//		РаспознаваниеРечи_НачатьРаспознавание();
//		ЭтотОбъект["РаспознаваниеРечи_ПерезапускРаспознавания"] = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура РаспознаваниеРечи_ИзменитьОформление()
//	
//	ЦветРамкиГолосовойВвод = ЦветаСтиля.CRM_РаботаСРечьюЦветРамкиДоступного;
//	ПодсказкаГолосовойВвод = "Слушаю...";
//	ГолосовойВводВключен = Элементы.СтрокаПоиска.КартинкаКнопкиВыбора = БиблиотекаКартинок.CRM_МикрофонАктивный16;
//	
//	Для Каждого ТекСтрока Из ЭтотОбъект["РаспознаваниеРечи_ТаблицаЭлементов"] Цикл
//		Элементы[ТекСтрока.ИмяЭлемента].ЦветРамки = ?(ГолосовойВводВключен, ЦветРамкиГолосовойВвод, ТекСтрока.ЦветРамки);
//		Элементы[ТекСтрока.ИмяЭлемента].ПодсказкаВвода = ?(ГолосовойВводВключен,
//		                                                   ПодсказкаГолосовойВвод,
//		                                                   ТекСтрока.ПодсказкаВвода);
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервере
//Процедура РаспознаваниеРечи_ЗаполнитьТаблицуОформленийЭлементов()
//	
//	ИмяТаблицыЭлементов = "РаспознаваниеРечи_ТаблицаЭлементов";
//	
//	НоваяСтрока = ЭтотОбъект[ИмяТаблицыЭлементов].Добавить();
//	НоваяСтрока.ИмяЭлемента = "СтрокаПоиска";
//	НоваяСтрока.ИмяРеквизита = "СтрокаПоискаОтбор";
//	НоваяСтрока.ПодсказкаВвода = Элементы.СтрокаПоиска.ПодсказкаВвода;
//	НоваяСтрока.ЦветРамки = Элементы.СтрокаПоиска.ЦветРамки;
//	
//КонецПроцедуры

// -Рарус alexpr

#КонецОбласти // РаспознаваниеРечи

#КонецОбласти
