Функция АдресаМетодов() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("Авторизация", "v3/auth/login.json"); 
	Результат.Вставить("ИнформацияОСессии", "v3/auth/session_info.json");
	Результат.Вставить("СписокЗаказов", "v3/orders.json");  
	Результат.Вставить("Калькулятор", "v2/calculator.json");
	Результат.Вставить("РазмещениеЗаказа", "v2/request.json");  
	Результат.Вставить("Мультизаказ", "v1/customers/multi_request.json");  
	Результат.Вставить("Преалерт", "v2/batch_request.json");  
	Результат.Вставить("ПреалертВодительМашина", "v2/batch_request/update.json");
	Результат.Вставить("ПоискКонтрагента", "v2/book/counteragents/search.json"); 
	Результат.Вставить("СписокКонтрагентов", "v2/counteragents.json");
	Результат.Вставить("Справочник.ДЛ_ХарактерГруза", "v1/public/freight_types.json");
	Результат.Вставить("Справочник.ДЛ_ДополнительныеУслуги", "v1/public/request_services.json"); 
	Результат.Вставить("Справочник.ДЛ_ДокументыДляПолучения", "v1/public/documents_for_receive.json");
	Результат.Вставить("Справочник.ДЛ_ПараметрыДляОтчета", "v1/public/report_params.json");  
	Результат.Вставить("Справочник.ДЛ_ВидыЗагрузки", "v1/references/load_types.json");
	Результат.Вставить("Справочник.ДЛ_СпециальныеТребования", "v1/references/services.json");
	Результат.Вставить("Справочник.ДЛ_ВидыУпаковок", "v1/references/packages.json"); 
	Результат.Вставить("Справочник.ДЛ_СтатусыЗаказа", "v1/references/statuses.json"); 
	Результат.Вставить("Справочник.ДЛ_Терминалы_Города", "v3/public/terminals.json"); 
	Результат.Вставить("ЗаявкаНаЗабор", "v1/customers/request/pdf.json");
	Результат.Вставить("ЗаявкаНаОтвоз", "v1/customers/request_sf/pdf.json");    
	Результат.Вставить("ПечатнаяФормаНакладной", "v1/printable.json");	
	Результат.Вставить("Справочник.ДЛ_Контрагенты", "v2/counteragents.json");
	Результат.Вставить("ПередачаАртикуловГрузовыхМест", "v2/request/cargo/shipment_labels.json");  
	Результат.Вставить("ПечатьЭтикеткиГруз", "v2/request/cargo/shipment_labels/get.json");
	Результат.Вставить("ПечатьЭтикеткиДокументы", "v2/request/cargo/docs_shipment_labels/get.json"); 
	Результат.Вставить("ДоступныеИзменения", "v3/orders/change_available.json");      
	Результат.Вставить("ОтменаДоставки", "v3/orders/cancel_delivery.json");
	Результат.Вставить("ОтменаОтправки", "v3/orders/cancel_pickup.json"); 
	Результат.Вставить("ПриостановкаВыдачи", "v3/orders/suspend.json"); 
	Результат.Вставить("ВозобновлениеВыдачи", "v3/orders/resume.json");                   
	Результат.Вставить("ИзменитьПолучателя", "v3/orders/change_receiver.json"); 
	Результат.Вставить("ИзменитьПлательщика", "v3/orders/change_payer.json");   
	Результат.Вставить("ИзменитьКонтактнуюИнформацию", "v3/orders/change_contacts.json");
	Результат.Вставить("ИзменитьПараметрыЗабора", "v3/orders/change_pickup.json");  
	Результат.Вставить("ИзменитьПараметрыДоставки", "v3/orders/change_delivery.json");  
	Результат.Вставить("Справочник.ДЛ_Страны", "v1/references/countries.json");
	Результат.Вставить("Справочник.ДЛ_ОПФ", "v1/references/opf_list.json");  
	Результат.Вставить("Справочник.ДЛ_ПараметрыНГГ", "v1/oversized_cargo_thresholds.json");
	Результат.Вставить("ПодсказкаАдреса", "v1/suggest_address.json"); 
	Результат.Вставить("Справочник.ДЛ_Города", "v1/public/places.json"); 
	Результат.Вставить("Метрики", "v1/metrics/events.json");
	Результат.Вставить("КонтрагентыЗаказов", "v3/orders/counteragents");
	Результат.Вставить("ГородаЗаказов", "v3/orders/cities");
	Результат.Вставить("ПечатьЭтикетокНовая", "v2/request/cargo/shipment_labels/get/batch.json"); 
	Результат.Вставить("ПередачаАртикуловНовая", "v2/request/cargo/shipment_labels/batch.json");
	Результат.Вставить("ПериодыВзаиморасчётов", "v2/mutual_period.json");
	Результат.Вставить("Взаиморасчёты", "v2/mutual_calculations.json");
	Результат.Вставить("ПоискТеминалов", "v1/public/request_terminals.json");
	
	Возврат Результат;     
	
КонецФункции    

Функция НазванияМетодов() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("v3/auth/login.json", "Авторизация пользователя");	
	Результат.Вставить("v3/auth/session_info.json", "Данные сессии");	
	Результат.Вставить("v3/orders.json", "Журнал заказов");  
	Результат.Вставить("v2/calculator.json", "Калькулятор стоимости и сроков перевозки");
	Результат.Вставить("v2/request.json", "Перевозка сборных грузов");  
	Результат.Вставить("v1/customers/multi_request.json", "Мультизаявка");  
	Результат.Вставить("v2/batch_request.json", "Создание пакетного заказа");  
	Результат.Вставить("v2/batch_request/update.json", "Передача данных водителя и машины");
	Результат.Вставить("v2/book/counteragents/search.json", "Поиск контрагентов"); 
	Результат.Вставить("v2/counteragents.json", "Получение списка контрагентов");
	Результат.Вставить("v1/public/freight_types.json", "Характер груза");
	Результат.Вставить("v1/public/request_services.json", "Справочник дополнительных услуг"); 
	Результат.Вставить("v1/public/documents_for_receive.json", "Документы для получения груза");
	Результат.Вставить("v1/public/report_params.json", "Справочник параметров для статистического отчета");  
	Результат.Вставить("v1/references/load_types.json", "Справочник видов загрузки");
	Результат.Вставить("v1/references/services.json", "Справочник специальных требований к транспорту");
	Результат.Вставить("v1/references/packages.json", "Справочник упаковок"); 
	Результат.Вставить("v1/references/statuses.json", "Справочник статусов заказа груза"); 
	Результат.Вставить("v3/public/terminals.json", "Справочник терминалов"); 
	Результат.Вставить("v1/customers/request/pdf.json", "Печатные формы заявки на забор");
	Результат.Вставить("v1/customers/request_sf/pdf.json", "Печатные формы заявки на отвоз");    
	Результат.Вставить("v1/printable.json", "Печатные формы документов");	
	Результат.Вставить("v2/request/cargo/shipment_labels.json", "Передача номеров грузовых мест");  
	Результат.Вставить("v2/request/cargo/shipment_labels/get.json", "Генерация этикеток на груз");
	Результат.Вставить("v2/request/cargo/docs_shipment_labels/get.json", "Генерация этикеток на сопроводительные документы"); 
	Результат.Вставить("v3/orders/change_available.json", "Доступные изменения");      
	Результат.Вставить("v3/orders/cancel_delivery.json", "Отмена доставки до адреса получателя");
	Результат.Вставить("v3/orders/cancel_pickup.json", "Отмена доставки от адреса отправителя"); 
	Результат.Вставить("v3/orders/suspend.json", "Запрос на приостановку"); 
	Результат.Вставить("v3/orders/resume.json", "Запрос на возобновление");  
	Результат.Вставить("v3/orders/change_receiver.json", "Изменение получателя по заказу"); 
	Результат.Вставить("v3/orders/change_payer.json", "Изменение плательщика по заказу");   
	Результат.Вставить("v3/orders/change_contacts.json", "Изменение контактной информации по заказу");
	Результат.Вставить("v3/orders/change_pickup.json", "Изменение адреса или времени отправки");  
	Результат.Вставить("v3/orders/change_delivery.json", "Изменение адреса, даты и времени доставки"); 
	Результат.Вставить("v1/references/countries.json", "Справочник стран");  
	Результат.Вставить("v1/references/opf_list.json", "Справочник ОПФ"); 
	Результат.Вставить("v1/oversized_cargo_thresholds.json", "Справочник параметров негабаритного груза");
	Результат.Вставить("v1/suggest_address.json", "Подсказки ввода адреса"); 
	Результат.Вставить("v1/public/places.json", "Справочник населенные пункты");
	Результат.Вставить("v1/metrics/events.json", "Метрики");
	Результат.Вставить("v3/orders/counteragents", "Контрагенты из заказов");
	Результат.Вставить("v3/orders/cities", "Города из заказов");  
	Результат.Вставить("v2/request/cargo/shipment_labels/get/batch.json", "Генерация этикеток на груз"); 
	Результат.Вставить("v2/request/cargo/shipment_labels/batch.json", "Передача номеров грузовых мест");
	Результат.Вставить("v2/mutual_period.json", "Периоды взаиморасчётов"); 
	Результат.Вставить("v2/mutual_calculations.json", "Взаиморасчёты"); 
	Результат.Вставить("v1/public/request_terminals.json", "Поиск теминалов");
	
	Возврат Результат;     
	
КонецФункции

Функция ПолучитьПараметрыТекцущейВерсии() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура("Идентификатор", "ERP, KA, Trade"); 	
	
	Расширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "ДоставкаДеловыеЛинии"));
	
	Если Расширения.Количество() Тогда
		
		Результат.Вставить("Версия", Расширения[0].Версия);
		
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции

Функция ФайловыйРежимЗапускаБазы() Экспорт
	
	Результат = Ложь;
	
	Если Лев(СтрокаСоединенияИнформационнойБазы(), 4) = "File" Тогда    
		
		Результат = Истина;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции