
&НаКлиенте
Процедура РазместитьМультизаказ(Команда) 
	
	ВыбранныеЗаказы = Новый Массив;
	
	Для Каждого Заявка Из Список Цикл
		
		Если Заявка.Флажок Тогда
			
			ВыбранныеЗаказы.Добавить(Заявка.НомерЗаказа);	
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ВыбранныеЗаказы.Количество() Тогда
		
		СтруктураОтвета = ДЛ_ДеловыеЛинии.РазместитьМультизаказ(ВыбранныеЗаказы);
		
		Если СтруктураОтвета["errors"] <> Неопределено Тогда
			
			ОписаниеОшибки = СтруктураОтвета["errors"]["requestids"]; 
			
			ПодстрокаОшибки = "Error: id заявок не соответствует условиям:";
			
			Если ОписаниеОшибки = "Количество id необходимо более одного" Тогда 
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для формирования мультизаказа выберите не менее двух заказов");				
				
			ИначеЕсли СтрНайти(ОписаниеОшибки, ПодстрокаОшибки) > 0 Тогда
				
				НомераЗаявок = СтрЗаменить(ОписаниеОшибки, ПодстрокаОшибки, "");
				
				КонецНомеров = СтрНайти(НомераЗаявок, ", ошибка"); 
				
				Если КонецНомеров > 0 Тогда
					
					НомераЗаявок = Лев(НомераЗаявок, КонецНомеров);	
					
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Заявки с номерами%1 не соответствуют условиям объединения в мультизаказ", НомераЗаявок));
				
			ИначеЕсли ОписаниеОшибки = "Error: данные заявки уже оформлены" Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные заявки уже оформлены");
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
				
			КонецЕсли;
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;	
	  
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуЗаявок(РежимФормы)
	
	СтруктураПараметров = Новый Структура;           
	
	ОтборПоСтатусам = Новый Массив;          
	
	Если РежимФормы = "Мультизаказ" Тогда
	
		ОтборПоСтатусам.Добавить("draft");	 
		
		Элементы.ФормаРазместитьПреалерт.Видимость = Ложь;  
		Элементы.ФормаПечатьПреалерт.Видимость = Ложь;
		Элементы.грПериод.Видимость = Ложь; 
		
		ЭтаФорма.Заголовок = "Создание мультизаказа";  
		Элементы.днСправка.Заголовок = "Для объединения у выбранных заказов должны совпадать Отправитель, Адрес отправки и Cпособ отправки";
		
	ИначеЕсли РежимФормы = "Преалерт" Тогда 		
		
		ОтборПоСтатусам.Добавить("processing");
		ОтборПоСтатусам.Добавить("waiting");
		ОтборПоСтатусам.Добавить("received");
		ОтборПоСтатусам.Добавить("received_warehousing"); 
		ОтборПоСтатусам.Добавить("inway");  
		
		Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда
			
			СтруктураПараметров.Вставить("НачалоПериода", Период.ДатаНачала);
			
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			
			СтруктураПараметров.Вставить("ОкончаниеПериода", Период.ДатаОкончания);			
			
		КонецЕсли;
		
		Элементы.ФормаРазместитьМультизаказ.Видимость = Ложь;   
		Элементы.ФормаОбновитьДанныеМультизаказ.Видимость = Ложь;
		
		ЭтаФорма.Заголовок = "Создание пакетного заказа"; 
		Элементы.днСправка.Заголовок = "Убедитесь, что у вас заключен договор с Деловыми линиями на пакетный заказ.
		|Для объединения у выбранных заказов должны совпадать Отправитель, Терминал отправки и Cпособ отправки"
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
	СтруктураПараметров.Вставить("Статус", ОтборПоСтатусам); 
	
	СтруктураПараметров.Вставить("Страница", 1);
	
	ДанныеЗаказов =  ДЛ_ДеловыеЛинии.ПолучитьЖурналОтправок(СтруктураПараметров);    
	
	Если ДанныеЗаказов["error"] <> Неопределено Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(ДанныеЗаказов["error"]["description"]);
		
		Возврат;  
		
	ИначеЕсли ДанныеЗаказов["errors"] <> Неопределено Тогда
			
		Для Каждого Ошибка Из ДанныеЗаказов["errors"] Цикл	
		
			ОбщегоНазначения.СообщитьПользователю(Ошибка["description"]);
			
		КонецЦикла;	
		
		Возврат;	
		
	КонецЕсли;  
	
	ОбновитьСписокЗаказов(ДанныеЗаказов["orders"]);    
	
	КоличествоСтраниц = ДанныеЗаказов["metadata"]["totalPages"];  		
	
	Если КоличествоСтраниц > 1 Тогда
		
		Для ТекСтраница = 2 По КоличествоСтраниц Цикл
			
			СтруктураПараметров.Страница = ТекСтраница;
			
			ДанныеЗаказов =  ДЛ_ДеловыеЛинии.ПолучитьЖурналОтправок(СтруктураПараметров);      
			
			Если ДанныеЗаказов["error"] <> Неопределено Тогда 
				
				ОбщегоНазначения.СообщитьПользователю(ДанныеЗаказов["error"]["description"]);
				
				Возврат;  
				
			ИначеЕсли ДанныеЗаказов["errors"] <> Неопределено Тогда
				
				Для Каждого Ошибка Из ДанныеЗаказов["errors"] Цикл	
					
					ОбщегоНазначения.СообщитьПользователю(Ошибка["description"]);
					
				КонецЦикла;	
				
				Возврат;	
				
			КонецЕсли;
			
			ОбновитьСписокЗаказов(ДанныеЗаказов["orders"], Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала = НачалоДня(ТекущаяДата() - 7 * 24 * 60 *60);
	Период.ДатаОкончания = КонецДня(ТекущаяДата()); 
	
	ЗаполнитьТаблицуЗаявок(Параметры.РежимФормы);
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьСписокЗаказов(МассивЗаказов, Очищать = Истина) 
	
	Если Очищать Тогда
		
		Список.Очистить();
		
	КонецЕсли;
	
	Для Каждого Заказ Из МассивЗаказов Цикл		
		
		СтрокаЗаказа = Список.Добавить();
		СтрокаЗаказа.НомерЗаказа = Заказ["orderId"];
		СтрокаЗаказа.ДатаЗаказа = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(Заказ["orderedAt"]);  
		СтрокаЗаказа.Состояние = Заказ["stateName"]; 
		СтрокаЗаказа.Сумма = Заказ["totalSum"];
		СтрокаЗаказа.ОтправительНаименование = ?(ЗначениеЗаполнено(Заказ["sender"]["name"]), СтрШаблон("%1 (ИНН %2)", Заказ["sender"]["name"], Заказ["sender"]["inn"]), ""); 
		СтрокаЗаказа.ПолучательНаименование = ?(ЗначениеЗаполнено(Заказ["receiver"]["name"]), СтрШаблон("%1 (ИНН %2)", Заказ["receiver"]["name"], Заказ["receiver"]["inn"]), "");	
		СтрокаЗаказа.Получатель = Заказ["receiver"]["name"];	
		СтрокаЗаказа.ПолучательИНН = Заказ["receiver"]["inn"];	
		СтрокаЗаказа.ПлательщикНаименование = ?(ЗначениеЗаполнено(Заказ["payer"]["name"]), СтрШаблон("%1 (ИНН %2)", Заказ["payer"]["name"], Заказ["payer"]["inn"]), "");	
		СтрокаЗаказа.Оплачен = Заказ["isPaid"]; 
		СтрокаЗаказа.СуммаНаложенногоПлатежа = Заказ["webOrderItemsSum"]; 
		СтрокаЗаказа.ПолучательТелефон =  ?(ЗначениеЗаполнено(Заказ["receiver"]["phones"]), Заказ["receiver"]["phones"], Заказ["receiver"]["anonymPhone"]);
		СтрокаЗаказа.СпособОтправки = ?(Заказ["orderedDeliveryFromAddress"] = Истина, "От адреса", "От терминала");  
		СтрокаЗаказа.ТерминалОтправки = Заказ["derival"]["terminalName"];
		
		ДанныеГруза = Заказ["freight"];
		
		Если ДанныеГруза <> Неопределено Тогда 
			
			СтрокаЗаказа.КоличествоГрузовыхМест = ДанныеГруза["places"];
			СтрокаЗаказа.ХарактерГруза = ДанныеГруза["name"];
			СтрокаЗаказа.ГрузВес = ДанныеГруза["weight"];
			СтрокаЗаказа.ГрузОбъем = ДанныеГруза["volume"]; 
			СтрокаЗаказа.ГрузДлина = ДанныеГруза["length"];
			СтрокаЗаказа.ГрузШирина = ДанныеГруза["width"];
			СтрокаЗаказа.ГрузВысота = ДанныеГруза["height"];
			
		КонецЕсли; 
		
		Для Каждого ДокументЗаказа Из Заказ["documents"] Цикл
			
			Если ЗначениеЗаполнено(ДокументЗаказа["comment"]) Тогда 
				
				СтрокаЗаказа.Комментарий = СтрокаЗаказа.Комментарий	+ " " + ДокументЗаказа["comment"]; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Заказ["orderedDeliveryFromAddress"] = Истина Тогда  
			
			АдресОтправки = Заказ["derival"]["address"];
			
			СтрокаЗаказа.АдресОтгрузкиПредставление = ?(ЗначениеЗаполнено(АдресОтправки), АдресОтправки, Заказ["derival"]["city"]);
			
		Иначе
			
			СтрокаЗаказа.АдресОтгрузкиПредставление = Заказ["derival"]["terminalAddress"];
			
		КонецЕсли; 
		
		СтрокаЗаказа.АдресДоставки = Заказ["arrival"]["address"];
		СтрокаЗаказа.АдресДоставкиГород = Заказ["arrival"]["city"];
		
		Если Заказ["orderedDeliveryToAddress"] = Истина Тогда			
			
			СтрокаЗаказа.АдресДоставкиПредставление = ?(ЗначениеЗаполнено(СтрокаЗаказа.АдресДоставки), СтрокаЗаказа.АдресДоставки, СтрокаЗаказа.АдресДоставкиГород);			
			
		Иначе			
			
			СтрокаЗаказа.АдресДоставкиПредставление = Заказ["arrival"]["terminalAddress"];
			
		КонецЕсли;		
		
		ГрафикПеревозки = Заказ["orderDates"]; 
		ДатаДоставки = ?(ЗначениеЗаполнено(ГрафикПеревозки["arrivalToReceiver"]), ГрафикПеревозки["arrivalToReceiver"], ГрафикПеревозки["arrivalToOspReceiver"]); 
		
		СтрокаЗаказа.ДатаОтгрузки = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ГрафикПеревозки["derivalFromOspSender"]); 
		СтрокаЗаказа.ДатаДоставки = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ДатаДоставки);   
		СтрокаЗаказа.ДатаПрибытияСД = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ГрафикПеревозки["arrivalToOspReceiverAccdoc"]);  
		СтрокаЗаказа.ДатаВозвратаСД = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(Заказ["documentsReturnDate"]);
		
		ДокументЗаказа = Документы.ДЛ_ЗаявкаНаДоставку.НайтиПоРеквизиту("НомерЗаказа", Заказ["orderId"]);
		
		Если ЗначениеЗаполнено(ДокументЗаказа) Тогда	
			
			СтрокаЗаказа.ДокументЗаказа = ДокументЗаказа;
			
			КоличествоОснований = ДокументЗаказа.ДокументыОснования.Количество();
			
			Если КоличествоОснований > 0 Тогда
				
				Для Каждого Основание Из ДокументЗаказа.ДокументыОснования Цикл
					
					СтрокаЗаказа.ДокументыОснования.Добавить(Основание.Документ);	
					
				КонецЦикла; 
				
				СтрокаЗаказа.ДокументОснованиеПредставление = ?(КоличествоОснований = 1, ДокументЗаказа.ДокументыОснования[0].Документ, "Несколько");								
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьПреалерт(Команда)
	
	ВыбранныеЗаказы = Новый Массив;
	
	Для Каждого Заявка Из Список Цикл
		
		Если Заявка.Флажок Тогда
			
			ВыбранныеЗаказы.Добавить(Заявка.НомерЗаказа);	
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ВыбранныеЗаказы.Количество() Тогда
		
		СтруктураОтвета = ДЛ_ДеловыеЛинии.РазместитьПреалерт(ВыбранныеЗаказы);
		
		Если СтруктураОтвета["data"] <> Неопределено Тогда
			
			СтруктураПараметров = Новый Структура("НомерПреалерта", СтруктураОтвета["data"]["batchRequestID"]);
			
			ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ДанныеВодителяМашины", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ИначеЕсли СтруктураОтвета["errors"] <> Неопределено Тогда  
			
			Для Каждого СтруктураОшибки Из СтруктураОтвета["errors"] Цикл 
			
				Сообщить(СтруктураОшибки["title"]); 
				
			КонецЦикла;
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЗаполнитьТаблицуЗаявок("Преалерт");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПреалерт(Команда)	
	
	ТабДок = ПечатьПреалертНаСервере();	 	
	ТабДок.Показать();
	
КонецПроцедуры 

&НаСервере
Функция ПечатьПреалертНаСервере()
	
	Макет = Документы.ДЛ_ЗаявкаНаДоставку.ПолучитьМакет("МакетПреалерт");	
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы"); 	
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);	
	
	Для Каждого Заявка Из Список Цикл
		
		Если Заявка.Флажок Тогда 
			
			ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");            
			
			ОбластьДетальныхЗаписей.Параметры.ВозвратСД = ЗначениеЗаполнено(Заявка.ДатаВозвратаСД);
			ОбластьДетальныхЗаписей.Параметры.ОтправкаСД = ЗначениеЗаполнено(Заявка.ДатаПрибытияСД) Или ОбластьДетальныхЗаписей.Параметры.ВозвратСД; 
			
			ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры, Заявка);
			ТабДок.Вывести(ОбластьДетальныхЗаписей);	
			
		КонецЕсли;
		
	КонецЦикла;	
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);  
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеМультизаказ(Команда)
	
	ЗаполнитьТаблицуЗаявок("Мультизаказ");
	
КонецПроцедуры


