Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат смартДеловыеЛинии.МассивДвухЭлементов("uid", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = смартДеловыеЛинии.НоваяТаблицаПолейЗначений();
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "title", "Наименование", "Реквизит"); 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "УсловноеНаименование", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "countable", "МожноЗаказатьНесколько", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "incompatible", "Несовместимость", "ТабличнаяЧасть", Новый Структура("UID", Неопределено));	
	
	Возврат Результат;
	
КонецФункции