
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДоступныеДействия") Тогда
		ДоступныеДействия = Параметры.ДоступныеДействия;
	Иначе
		ДоступныеДействия = Неопределено;
	КонецЕсли;
	
	Элементы.СпособИзмененияРяда.СписокВыбора.Очистить();
	Элементы.СпособИзмененияРяда.СписокВыбора.Добавить("ТолькоТекущее",	НСтр("ru='Только текущее мероприятие';en='Only the current event'"));
	Элементы.СпособИзмененияРяда.СписокВыбора.Добавить("ДоКонцаРяда",	НСтр("ru='Это и последующие мероприятия';en='This and subsequent activities'"));
	Элементы.СпособИзмененияРяда.СписокВыбора.Добавить("ВесьРяд",		НСтр("ru='Все мероприятия';en='All Events'"));
	
	Если ДоступныеДействия <> Неопределено Тогда
		Если ДоступныеДействия.Найти("ТолькоТекущее") = Неопределено Тогда
			ЗначениеУдалить = Элементы.СпособИзмененияРяда.СписокВыбора.НайтиПоЗначению("ТолькоТекущее");
			Если ЗначениеУдалить <> Неопределено Тогда
				Элементы.СпособИзмененияРяда.СписокВыбора.Удалить(ЗначениеУдалить)
			КонецЕсли;
		КонецЕсли;
		Если ДоступныеДействия.Найти("ДоКонцаРяда") = Неопределено Тогда
			ЗначениеУдалить = Элементы.СпособИзмененияРяда.СписокВыбора.НайтиПоЗначению("ДоКонцаРяда");
			Если ЗначениеУдалить <> Неопределено Тогда
				Элементы.СпособИзмененияРяда.СписокВыбора.Удалить(ЗначениеУдалить)
			КонецЕсли;
		КонецЕсли;
		Если ДоступныеДействия.Найти("ВесьРяд") = Неопределено Тогда
			ЗначениеУдалить = Элементы.СпособИзмененияРяда.СписокВыбора.НайтиПоЗначению("ВесьРяд");
			Если ЗначениеУдалить <> Неопределено Тогда
				Элементы.СпособИзмененияРяда.СписокВыбора.Удалить(ЗначениеУдалить)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособИзмененияРяда) Тогда
		СпособИзмененияРяда = Элементы.СпособИзмененияРяда.СписокВыбора[0].Значение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ПринятьИзменения",  Истина);
	ПараметрыЗакрытия.Вставить("СпособИзмененияРяда", СпособИзмененияРяда);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ПринятьИзменения", Ложь);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

#КонецОбласти

