
&НаСервере
&ИзменениеИКонтроль("ОбъектыПоКритериюОтбора")
Функция смарт_ОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора)

	Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
		Возврат Неопределено;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
	
	#Вставка
	//++ #1638 смарт: Ермаков 16.02.2024 / Грузы. Сделать связь объектов
	// Если родитель - Груз - выводим подчиненные Контейнеры
	Если ТипЗнч(ЗначениеКритерияОтбора) = Тип("СправочникСсылка.смартГрузы") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Контейнер КАК Ссылка
		|ИЗ 
		|	РегистрСведений.смартСобытияКонтейнеров 
		|ГДЕ 
		|	Груз = &ЗначениеКритерияОтбора
		|ОБЪЕДИНИТЬ
		|" + Запрос.Текст;
		
	// Если родитель - Контейнер - выводим подчиненные Грузы	
	ИначеЕсли ТипЗнч(ЗначениеКритерияОтбора) = Тип("СправочникСсылка.смартКонтейнеры") Тогда
		
		Запрос.Текст = Запрос.Текст + 
		"
		|ОБЪЕДИНИТЬ 
		|ВЫБРАТЬ 
		|	Груз 
		|ИЗ 
		|	РегистрСведений.смартСобытияКонтейнеров 
		|ГДЕ 
		|	Контейнер = &ЗначениеКритерияОтбора";
		
	КонецЕсли;
	//-- #1638 смарт: Ермаков 16.02.2024
	#КонецВставки
	
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ВывестиПодчиненныеОбъекты")
Процедура смарт_ВывестиПодчиненныеОбъекты(ТекущийОбъект, ДеревоРодитель)

	СтрокиДерева = ДеревоРодитель.ПолучитьЭлементы();
	Таблица      = ОбъектыПоКритериюОтбора(ТекущийОбъект);
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КэшПоТипамОбъектов   = Новый Соответствие;
	КэшРеквизитовОбъекта = Новый Соответствие;

	Для Каждого СтрокаТаблицы Из Таблица Цикл

		МетаданныеОбъекта = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда
			Продолжить;
		КонецЕсли;

		ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ДополнитьКэшМетаданных(МетаданныеОбъекта, ПолноеИмяОбъекта, КэшРеквизитовОбъекта);

		МассивСсылок = КэшПоТипамОбъектов[ПолноеИмяОбъекта];
		Если МассивСсылок = Неопределено Тогда

			МассивСсылок = Новый Массив;
			КэшПоТипамОбъектов.Вставить(ПолноеИмяОбъекта, МассивСсылок);

		КонецЕсли;

		МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);

	КонецЦикла;

	Если КэшПоТипамОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеОбъекты УПОРЯДОЧИТЬ ПО ПодчиненныеОбъекты.Дата";

	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из КэшПоТипамОбъектов Цикл

		МассивИмениОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючИЗначение.Ключ, ".");
		Если МассивИмениОбъекта.Количество() = 2 Тогда
			ИмяОбъекта = МассивИмениОбъекта[1];
		Иначе
			Продолжить;
		КонецЕсли;

		ТекстПоТипуОбъекта = "
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Дата"] + "           КАК Дата,
		|	Ссылка,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Проведен"] + "       КАК Проведен,
		|	ПометкаУдаления,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["СуммаДокумента"] + " КАК СуммаДокумента,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Валюта"] + "         КАК Валюта,
		|	#Представление
		|ИЗ
		|	" + КлючИЗначение.Ключ + "
		|ГДЕ
		|	Ссылка В (&" + ИмяОбъекта + ")";

		Запрос.УстановитьПараметр(ИмяОбъекта, КлючИЗначение.Значение);

		МассивДопРеквизитов = CRM_СтруктураПодчиненностиПереопределяемый.МассивРеквизитовОбъектаДляФормированияПредставления(ИмяОбъекта);
		ДополнитьТекстЗапросаПоРеквизитамОбъекта(ТекстПоТипуОбъекта, МассивДопРеквизитов);

		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", " ВЫБРАТЬ ", " ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ") + ТекстПоТипуОбъекта;

	КонецЦикла;

	Запрос.Текст = ТекстЗапросаНачало + ТекстЗапроса + ТекстЗапросаКонец;
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		#Удаление //++ #1638 смарт: Ермаков 16.02.2024 / Грузы. Сделать связь объектов
		НоваяСтрока = ДобавитьСтрокуВДерево(СтрокиДерева, Выборка);
		Если НЕ ДобавляемыйОбъектИмеетсяСредиРодителей(ДеревоРодитель,Выборка.Ссылка) Тогда
			ВывестиПодчиненныеОбъекты(Выборка.Ссылка,НоваяСтрока)
		КонецЕсли;
        #КонецУдаления //-- #1638 смарт: Ермаков 16.02.2024
		
		#Вставка
		//++ #1638 смарт: Ермаков 16.02.2024 / Грузы. Сделать связь объектов
		// Исправлена ошибка логики. Сначала проверяем, потом добавляем строку.
		Если НЕ ДобавляемыйОбъектИмеетсяСредиРодителей(ДеревоРодитель, Выборка.Ссылка) Тогда
			
			НоваяСтрока = ДобавитьСтрокуВДерево(СтрокиДерева, Выборка);
			ВывестиПодчиненныеОбъекты(Выборка.Ссылка, НоваяСтрока)
			
		КонецЕсли;
		//-- #1638 смарт: Ермаков 16.02.2024
		#КонецВставки 
		
	КонецЦикла;

КонецПроцедуры
