#Область ПеренесеноСДоработками

&НаКлиенте
Процедура смарт_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	смартОтправитьКурсНаСервере(Запись.Валюта,Запись.Курс);
    
    //++ смарт:Подкин #1025 24.05.2022 13:25:13
    смартУстановкаЦенНоменклатуры(Запись.Валюта, Запись.Курс, Запись.Период);
    ПоказатьОповещениеПользователя("Запущен обраб. Созд.док Установка цен!",,,,СтатусОповещенияПользователя.Важное,);
    //-- смарт:Подкин #1025 24.05.2022 13:25:13

КонецПроцедуры  

&НаСервереБезКонтекста
Процедура смартОтправитьКурсНаСервере(Валюта,Курс)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	|ГДЕ
	|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", "ОтправкаКурсаВалютыВТелеграм");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		ВнешнОбработка = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ВыборкаДетальныеЗаписи.Ссылка);
		
		ПараметрыВыполнения = Новый Структура();
		
		ПараметрыВыполнения.Вставить("Валюта", Валюта);
		ПараметрыВыполнения.Вставить("Курс", Курс);
		
		ВнешнОбработка.ОтправитьСообщениеВТелеграм(ПараметрыВыполнения);
    КонецЕсли;
    
КонецПроцедуры 

//++ смарт:Подкин #1025 24.05.2022 13:17:10 установка цен УЕ-РУБ 
&НаСервере
Процедура смартУстановкаЦенНоменклатуры(Валюта,Курс,Период)
    
    Если Валюта=Справочники.Валюты.НайтиПоКоду("000") Тогда 
        ВнешнОбработка=смартОбщегоНазначения.ПолучитьВнешнююОбработку("УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ");
        Если НЕ ВнешнОбработка=Неопределено Тогда 
            ИдентификаторЗадания=ХранилищеОбщихНастроек.Загрузить("УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ", "УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ"); 
            //Результат=ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
            Если ИдентификаторЗадания=Неопределено Тогда 
                СтруктураОтвета=ВыполнитьКомандуВФоне("УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ",ВнешнОбработка);
                Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураОтвета,"ИдентификаторЗадания") Тогда
                    ХранилищеОбщихНастроек.Сохранить("УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ","УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ",СтруктураОтвета.ИдентификаторЗадания, , ); 
                КонецЕсли;
            Иначе
                Результат=ДлительныеОперации.ОперацияВыполнена(ИдентификаторЗадания, , Истина,);
                Если Результат.Статус="Выполнено" ИЛИ Результат.Статус="Ошибка" Тогда
                    СтруктураОтвета=ВыполнитьКомандуВФоне("УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ",ВнешнОбработка);
                    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураОтвета,"ИдентификаторЗадания") Тогда
                        ХранилищеОбщихНастроек.Сохранить("УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ","УстановкаЦенНоменклатурыПриИзмененииВалютыУЕ",СтруктураОтвета.ИдентификаторЗадания, , ); 
                    КонецЕсли;
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;   
    
КонецПроцедуры //-- смарт:Подкин #1025 24.05.2022 13:17:10 

//++ смарт:Подкин #1025 26.05.2022 11:25:37
&НаСервере 
Функция ВыполнитьКомандуВФоне(ИдентификаторКоманды,ДополнительнаяОбработкаСсылка)
    
    ПараметрыПроцедуры = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, СтруктураДанных");
    ПараметрыПроцедуры.ДополнительнаяОбработкаСсылка = ДополнительнаяОбработкаСсылка;
    ПараметрыПроцедуры.ИдентификаторКоманды          = ИдентификаторКоманды;

    НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне();
    НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение создания документа Установка цен для УЕ'");
    
    Возврат ДлительныеОперации.ВыполнитьВФоне("ДополнительныеОтчетыИОбработки.ВыполнитьКоманду", ПараметрыПроцедуры, НастройкиЗапуска);
    
КонецФункции //-- смарт:Подкин #1025 26.05.2022 11:25:37

#КонецОбласти 