
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураФильтра);
	
	УстановитьПараметрыВыбора();
	
	ОбновитьПредставлениеПериода();
	
	CRM_СоздатьКнопкиРежимФильтра();
	
	Если Параметры.СтруктураФильтра.Свойство("НастройкиКомпоновки") И Параметры.СтруктураФильтра.НастройкиКомпоновки <> Неопределено Тогда
		РежимФильтра = 1;
		ПокраситьКнопкиРежимФильтраНаСервере();
		Элементы.ГруппаПростыеНастройки.Видимость = Ложь;
		Элементы.ГруппаРасширенныеНастройки.Видимость = Истина;
		ИнициализацияКомпоновки();
		Компоновщик.ЗагрузитьНастройки(Параметры.СтруктураФильтра.НастройкиКомпоновки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РежимФильтра = 0 Тогда
		CRM_Простой(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Период

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент)

	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Период;
	Диалог.Показать(Оповещение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатиеЗавершение(НовыйПериод, ДополнительныеДанные) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыйПериод)=Тип("СтандартныйПериод") Тогда
		Период = НовыйПериод;
	ИначеЕсли ТипЗнч(НовыйПериод)=Тип("Дата") Тогда
		Период.ДатаНачала = '0001-01-01';
		Период.ДатаОкончания = НовыйПериод;
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	КонецЕсли;
	
	ПериодПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииСервер()
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеПериода()
	
	Если НЕ Элементы.ПредставлениеПериодаКнопка.Видимость Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ПредставлениеПериода = НСтр("ru='за все время';en='For All Time'");
	//ИначеЕсли Элементы.ПредставлениеПериода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет Тогда
	//	ПредставлениеПериода = НСтр("ru='за ';en='for '")+НРег(ПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Период.ДатаОкончания)));
	Иначе
		ПредставлениеПериода = НРег(ПредставлениеПериода(НачалоДня(Период.ДатаНачала), ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания)));
	КонецЕсли;
	
	Элементы.ПредставлениеПериодаКнопка.Заголовок = ПредставлениеПериода;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если Ответственный = Неопределено Тогда
		Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	ВыбранПользователь = (ТипЗнч(Ответственный) = Тип("СправочникСсылка.Пользователи"));
	
	
	Если ВыбранПользователь Тогда
		
		УстановитьПараметрыВыбора();
		
	Иначе
		
		Элементы.Ответственный.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Закрыть(ПолучитьСтруктуруФильтра());
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьНаСервере();
		
	Если Элементы.ГруппаРасширенныеНастройки.Видимость Тогда
		ИнициализацияКомпоновки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_Простой(Команда)
	
	РежимФильтра = 0;
	ПокраситьКнопкиРежимФильтраНаСервере();
	
	Элементы.ГруппаПростыеНастройки.Видимость = Истина;
	Элементы.ГруппаРасширенныеНастройки.Видимость = Ложь;
	ЗаполнитьПоляФильтраПоОтборуКомпоновщика();

КонецПроцедуры

&НаКлиенте
Процедура CRM_Расширенный(Команда)
	
	РежимФильтра = 1;
	ПокраситьКнопкиРежимФильтраНаСервере();
	
	Элементы.ГруппаПростыеНастройки.Видимость = Ложь;
	Элементы.ГруппаРасширенныеНастройки.Видимость = Истина;
	ЗаполнитьОтборКомпоновщика();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияКомпоновки()

	СхемаКомпоновкиДанных = Обработки.CRM_МенеджерПочты.ПолучитьМакет("МакетФильтра");

	ХранилищеСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ХранилищеСхемы));
    Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляФильтраПоОтборуКомпоновщика()
	
	Если Компоновщик.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьНаСервере();
	
	Для Каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если ЭлементОтбора.Использование Тогда
				ЭтотОбъект[ЭлементОтбора.Представление] = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			Для Каждого ЭлементОтбораГруппы Из ЭлементОтбора.Элементы Цикл
				Если ЭлементОтбораГруппы.Использование Тогда
					ЭтотОбъект[ЭлементОтбораГруппы.Представление] = ЭлементОтбораГруппы.ПравоеЗначение;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтборКомпоновщика()
	
	ИнициализацияКомпоновки();
	
	Для Каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если ЗначениеЗаполнено(ЭтотОбъект[ЭлементОтбора.Представление]) Тогда
				ЭлементОтбора.ПравоеЗначение = ЭтотОбъект[ЭлементОтбора.Представление];
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			Для Каждого ЭлементОтбораГруппы Из ЭлементОтбора.Элементы Цикл
				Если ЗначениеЗаполнено(ЭтотОбъект[ЭлементОтбораГруппы.Представление]) Тогда
					ЭлементОтбораГруппы.ПравоеЗначение = ЭтотОбъект[ЭлементОтбораГруппы.Представление];
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруФильтра()
	
	СтруктураФильтра = Новый Структура;
	
	СтруктураФильтра.Вставить("Период", Период);
	
	Если Элементы.ГруппаПростыеНастройки.Видимость Тогда
		СтруктураФильтра.Вставить("Отправитель", Отправитель);
		СтруктураФильтра.Вставить("Получатель", Получатель);
		СтруктураФильтра.Вставить("Тема", Тема);
		СтруктураФильтра.Вставить("ТекстПисьма", ТекстПисьма);	
		СтруктураФильтра.Вставить("Ответственный", Ответственный);
		СтруктураФильтра.Вставить("НастройкиКомпоновки", Неопределено);
	КонецЕсли;
	
	Если Элементы.ГруппаРасширенныеНастройки.Видимость Тогда
		
		Для Каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				
				Если ЭлементОтбора.Использование Тогда
					СтруктураФильтра.Вставить(ЭлементОтбора.Представление, ЭлементОтбора.ПравоеЗначение);
				Иначе
					СтруктураФильтра.Вставить(ЭлементОтбора.Представление);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
				Для Каждого ЭлементОтбораГруппы Из ЭлементОтбора.Элементы Цикл
					Если ЭлементОтбораГруппы.Использование Тогда
						СтруктураФильтра.Вставить(ЭлементОтбораГруппы.Представление, ЭлементОтбораГруппы.ПравоеЗначение);
					Иначе
						СтруктураФильтра.Вставить(ЭлементОтбораГруппы.Представление);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураФильтра.Вставить("НастройкиКомпоновки", Компоновщик.Настройки);
		
	КонецЕсли;
	
	СтруктураФильтра.Вставить("ПоказатьТолькоНепрочитанные", ПоказатьТолькоНепрочитанные);
	
	Возврат СтруктураФильтра;
	
КонецФункции	

&НаСервере
Функция ОчиститьНаСервере()
	
	Период = Новый СтандартныйПериод;
	ОбновитьПредставлениеПериода();
	
	Отправитель = "";
	Получатель = "";
	Тема = "";
	ТекстПисьма = "";
	Ответственный = Справочники.Пользователи.ПустаяСсылка(); //Пользователи.ТекущийПользователь();
	ПоказатьТолькоНепрочитанные = Ложь;

КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбора()
	
	ПараметрыВыбораПользователь = Новый Массив;
	ПараметрыВыбораПользователь.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ПараметрыСеанса.CRM_ДоступныеПользователи));
	Элементы.Ответственный.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПользователь);
	
КонецПроцедуры

&НаСервере
Процедура CRM_СоздатьКнопкиРежимФильтра()
	
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "CRM_РежимФильтра_Группа");
	СтруктураКоманднаяПанель.Вставить("Родитель", "CRM_РежимФильтра");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "CRM_РежимФильтра_Элемент");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Простой";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru = 'Простой'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	СтруктураКнопка.Вставить("Пометка", Истина);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Расширенный";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru = 'Расширенный'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
	
	//
	
	ГруппаКнопокТумблера = Элементы.Найти("CRM_РежимФильтра_Группа");
	Если ГруппаКнопокТумблера <> Неопределено Тогда
		//ГруппаКнопокТумблера.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ГруппаКнопокТумблера.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПокраситьКнопкиРежимФильтраНаСервере()
	
	НомерКнопки = 1;
	
	Если РежимФильтра = 0 Тогда
		НомерКнопки = 1;
	ИначеЕсли РежимФильтра = 1 Тогда
		НомерКнопки = 2;
	КонецЕсли;
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Простой";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Расширенный";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);


	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
	
КонецПроцедуры

#КонецОбласти



