
////////////////////////////////////////////////////////////////////////////////
// CRM методы форм справочников сервер
//  
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.
// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область Справочник_ВнешниеПользователи_ФормаЭлемента

Функция ОбъектАктивацииПолучитьУчаствуетВАнкетировании(ОбъектАнкетирования) Экспорт
	Возврат ОбъектАнкетирования.CRM_УчаствуетВАнкетировании;
КонецФункции // ПолучитьСтруктураПараметровАнкетирование()

Процедура ОбъектАвторизацииУстановитьУчаствуетВАнкетировании(Респондент, УчаствуетВАнкетировании) Экспорт
	РеспондентОбъект = Респондент.ПолучитьОбъект();
	РеспондентОбъект.CRM_УчаствуетВАнкетировании = УчаствуетВАнкетировании;
	Попытка
		РеспондентОбъект.Записать();
	Исключение		
	КонецПопытки;
КонецПроцедуры // ОбъектАвторизацииУстановитьУчаствуетВАнкетировании()

#КонецОбласти

#Область Справочник_Пользователи_ФормаЭлемента

// Функция определяет, что к объекту присоединен по крайней мере один файл.
//
// Параметры:
//	ВладелецФайлов	- СправочникСсылка	- Владелец файлов.
//	ФайлИсключение	- СправочникСсылка	- Файл-исключение
//
Функция ОбъектИмеетФайлы(Знач ВладелецФайлов, Знач ФайлИсключение = Неопределено, Фильтр) Экспорт
	
	Возврат CRM_ПрисоединенныеФайлы.ОбъектИмеетФайлы(ВладелецФайлов, ФайлИсключение);
	
КонецФункции // ОбъектИмеетФайлы()

Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы) Экспорт
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область Справочник_Партнёры_ФормаЭлемента

// Функция вычисляет дубли в массиве элементов и очищает их.
//
//  Параметры:
//   Массив		- Массив - Массив для проверки.
//   ЭтоТелефон - Булево - Признак того, что проверяется телефон.
//
//  Возвращаемое значение
//   Массив - Массив - Проверенный массив.
//
Функция УдалитьПовторяющиесяЭлементыМассива(Массив, ЭтоТелефон) Экспорт
		
	ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		ТекИндекс2 = ТекущийИндекс + 1; 
		Пока ТекИндекс2 < ВсегоЭлементов Цикл 
			Если ЭтоТелефон Тогда
				Если сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Массив[ТекИндекс2]) 
					= сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Массив[ТекущийИндекс]) Тогда 
					Массив.Удалить(ТекИндекс2); 
					ВсегоЭлементов = ВсегоЭлементов - 1; 
				Иначе 
					ТекИндекс2 = ТекИндекс2 + 1; 
				КонецЕсли;
			Иначе
				Если Массив[ТекИндекс2] = (Массив[ТекущийИндекс]) Тогда 
					Массив.Удалить(ТекИндекс2); 
					ВсегоЭлементов = ВсегоЭлементов - 1; 
				Иначе 
					ТекИндекс2 = ТекИндекс2 + 1; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла; 
	
	Возврат Массив; 
	
КонецФункции 

#КонецОбласти

#Область Справочник_ФизическиеЛица_ФормаЭлемента

Процедура ФизическиеЛицаФормаЭлементаПриСозданииНаСервере(Форма, Объект) Экспорт
	
	Если Объект.Ссылка.Пустая() И Форма.Параметры.Свойство("ПараметрыНового") Тогда
		Объект.Наименование = Форма.Параметры.ПараметрыНового.Наименование;
		
		МассивДопРеквизитов = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица));
		Если МассивДопРеквизитов.количество() > 0 Тогда
			Форма[МассивДопРеквизитов[0].ИмяРеквизита] = Форма.Параметры.ПараметрыНового.АдресПочты;
		КонецЕсли;
	КонецЕсли;
	
	// Учесть возможность создания из взаимодействия.
	Если Форма.Параметры.Свойство("Основание")
	   И CRM_Взаимодействия.ЕстьРеспондент(Форма.Параметры.Основание) Тогда
		Форма.НеобходимоОповещение = Истина;
		Форма.ОбъектОснование = Форма.Параметры.Основание.Объект;
	КонецЕсли;
	
	
	Если Форма.Параметры.Свойство("Основание") И ТипЗнч(Форма.Параметры.Основание) = Тип("ДокументСсылка.ТелефонныйЗвонок") И Объект.Ссылка.Пустая() Тогда
		Форма.НеобходимоОповещение = Истина;
		Форма.ОбъектОснование = Форма.Параметры.Основание;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидыКонтактнойИнформации_ФормаЭлемента

// Процедура установливает доступность флажка "CRM_Основной".
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Передаваемая форма. 
//
Функция ВычислитьВидимостьОсновной(Родитель) Экспорт
	
	Возврат (Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров
		ИЛИ Родитель = Справочники.ВидыКонтактнойИнформации.СправочникПартнеры
		ИЛИ Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания
		ИЛИ Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо
		ИЛИ (Метаданные.Справочники.ВидыКонтактнойИнформации.ПолучитьИменаПредопределенных().Найти("СправочникКонтрагенты")<>Неопределено
			И Родитель = Справочники.ВидыКонтактнойИнформации["СправочникКонтрагенты"]));
	
КонецФункции // УстановитьВидимостьОсновной()

#КонецОбласти

#КонецОбласти
