#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура СоздатьЭлементыПоУмолчанию() Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Бухгалтер';en='Accountant'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Генеральный директор';en='CEO'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Главный бухгалтер';en='Chief accountant'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Директор';en='CEO'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Коммерческий директор';en='Commercial Director'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Менеджер по закупкам';en='Purchasing Manager'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Менеджер по продажам';en='Sales representative'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Руководитель отдела продаж';en='Sales Manager'");
	НовыйЭлемент.Записать();
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли