
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("КП_ДобавитьКомандыПечати")
//++ #Б-3502 смарт: Фролов 06.06.2025 //Доработка НСИ Конструктора КП
Процедура смарт_КП_ДобавитьКомандыПечати(КомандыПечати)

	ЭтоCRM = CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM();
	#Удаление //++ #Б-3502 смарт: Фролов 06.06.2025 //Доработка НСИ Конструктора КП
	Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		// Коммерческое предложение (Microsoft Word)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложениеMicrosoftWord";
		КомандаПечати.МенеджерПечати = "";
		КомандаПечати.Идентификатор = "КоммерческоеПредложениеMicrosoftWord";
		КомандаПечати.Представление = НСтр("ru='Коммерческое предложение (Microsoft Word)';en='Quote (Microsoft Word)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ЭтоCRM;

		// Коммерческое предложение (OpenOffice.org Writer)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложениеOpenOfficeOrgWriter";
		КомандаПечати.МенеджерПечати = "";
		КомандаПечати.Идентификатор = "КоммерческоеПредложениеOpenOfficeOrgWriter";
		КомандаПечати.Представление = НСтр("ru='Коммерческое предложение (OpenOffice.org Writer)';en='Quote (OpenOffice.org Writer)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ЭтоCRM;
		// Договор (Microsoft Word)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьДоговорMicrosoftWord";
		КомандаПечати.МенеджерПечати = "";
		КомандаПечати.Идентификатор = "ДоговорMicrosoftWord";
		КомандаПечати.Представление = НСтр("ru='Договор (Microsoft Word)';en='Contract (Microsoft Word)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ЭтоCRM;

		// Договор (OpenOffice.org Writer)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьДоговорOpenOfficeOrgWriter";
		КомандаПечати.МенеджерПечати = "";
		КомандаПечати.Идентификатор = "ДоговорOpenOfficeOrgWriter";
		КомандаПечати.Представление = НСтр("ru='Договор (OpenOffice.org Writer)';en='Contract (OpenOffice.org Writer)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ЭтоCRM;
	КонецЕсли;

	// Коммерческое предложение (Microsoft Word)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложениеHTML";
	КомандаПечати.МенеджерПечати = "";
	КомандаПечати.Идентификатор = "КоммерческоеПредложениеHTML";
	КомандаПечати.Представление = НСтр("ru='Коммерческое предложение (HTML)';en='Quote (HTML)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ЭтоCRM;

	// Договор (Microsoft Word)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьДоговорHTML";
	КомандаПечати.МенеджерПечати = "";
	КомандаПечати.Идентификатор = "ДоговорHTML";
	КомандаПечати.Представление = НСтр("ru='Договор (HTML)';en='Contract (HTML)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ЭтоCRM;

	Если ЭтоCRM Тогда
		// Коммерческое предложение
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложение";
		КомандаПечати.МенеджерПечати = "";
		КомандаПечати.Идентификатор = "КоммерческоеПредложениеКлиенту";
		КомандаПечати.Представление = НСтр("ru='Коммерческое предложение';en='Quote'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	Иначе

		МодульКоммерческиеПредложенияДокументы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияДокументы");
		НастройкиУчета = МодульКоммерческиеПредложенияДокументы.НастройкиУчета();

		Если НастройкиУчета.НеВыводитьСкидкиВДокументахПродажи Тогда

			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложение";
			КомандаПечати.МенеджерПечати = "";
			КомандаПечати.Идентификатор                  = "КоммерческоеПредложение";
			КомандаПечати.Представление                  = НСтр("ru = 'Коммерческое предложение клиенту'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ОтображатьСкидки", Ложь);

		ИначеЕсли НастройкиУчета.ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи Тогда

			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложение";
			КомандаПечати.МенеджерПечати = "";
			КомандаПечати.Идентификатор                  = "КоммерческоеПредложение";
			КомандаПечати.Представление                  = НСтр("ru = 'Коммерческое предложение клиенту (со скидками)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ОтображатьСкидки", Истина);

			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложение";
			КомандаПечати.МенеджерПечати = "";
			КомандаПечати.Идентификатор                  = "КоммерческоеПредложение";
			КомандаПечати.Представление                  = НСтр("ru = 'Коммерческое предложение клиенту (без скидок)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ОтображатьСкидки", Ложь);

		Иначе

			// Коммерческое предложение
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.Обработчик = "CRM_УправлениеПечатьюКлиент.CRM_ПечатьКоммерческоеПредложение";
			КомандаПечати.МенеджерПечати = "";
			КомандаПечати.Идентификатор = "КоммерческоеПредложение";
			КомандаПечати.Представление = НСтр("ru = 'Коммерческое предложение клиенту'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ОтображатьСкидки", Истина);

		КонецЕсли;
	КонецЕсли;
	#КонецУдаления
	
КонецПроцедуры //-- #Б-3502 смарт: Фролов 06.06.2025  

#КонецОбласти
