#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		МассивВложений = ЗначениеИзСтрокиВнутр(Запись.Вложения);
		Если ТипЗнч(МассивВложений) = Тип("Массив") Тогда
			
			Для каждого стрВложение Из МассивВложений Цикл
				
				НоваяСтрока = ТаблицаВложений.Добавить();
				НоваяСтрока.Файл = стрВложение;
				
			КонецЦикла;
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если Запись.СпособУведомления = Перечисления.смартСпособыУведомлений.Почта Тогда
		
		Элементы.СтраницаЗадачаУТ.Видимость = Ложь;
		Элементы.СтраницаНапоминаниеУТ.Видимость = Ложь;
		Элементы.СтраницаТелеграм.Видимость = Ложь;
		
		Массив = ЗначениеИзСтрокиВнутр(Запись.Получатели);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейПочта.Добавить();
				НоваяСтрока.Адрес = стрЗначение.Адрес;
				НоваяСтрока.Представление = стрЗначение.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Массив = ЗначениеИзСтрокиВнутр(Запись.ПолучателиКопии);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейКопииПочта.Добавить();
				НоваяСтрока.Адрес = стрЗначение.Адрес;
				НоваяСтрока.Представление = стрЗначение.Представление;
				
			КонецЦикла;
			
		КонецЕсли;

		
		Массив = ЗначениеИзСтрокиВнутр(Запись.ПолучателиСкрытые);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейСкрытыеПочта.Добавить();
				НоваяСтрока.Адрес = стрЗначение.Адрес;
				НоваяСтрока.Представление = стрЗначение.Представление;
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли Запись.СпособУведомления = Перечисления.смартСпособыУведомлений.НапоминаниеУТ Тогда
		
		Элементы.СтраницаЗадачаУТ.Видимость = Ложь;
		Элементы.СтраницаПочта.Видимость = Ложь;
		Элементы.СтраницаТелеграм.Видимость = Ложь;
		
		Массив = ЗначениеИзСтрокиВнутр(Запись.Получатели);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейНапоминание.Добавить();
				НоваяСтрока.Пользователь = стрЗначение;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти