
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	// Фролов+
	Если Не РольДоступна("ПолныеПрава") Тогда 
		Если Форма.ИмяФормы="Документ.ЗаказКлиента.Форма.ФормаДокумента" 
			Или Форма.ИмяФормы="Документ.ЗаказПоставщику.Форма.ФормаДокумента" 
			Или Форма.ИмяФормы="Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента" 
			Или Форма.ИмяФормы="Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			
			Форма.Элементы.Дата.ТолькоПросмотр=Истина;
			Форма.Элементы.Номер.ТолькоПросмотр=Истина;
			
			//++ смарт:ММ #029 209 05.03.2020 - доступность даты для изменения
			Если УправлениеДоступом.ЕстьРоль("смартИзменениеДатыДокументов") Тогда  
				Если Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента"
					ИЛИ Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента" 
					Тогда
					Форма.Элементы.Дата.ТолькоПросмотр = Ложь;
				КонецЕсли;
			КонецЕсли;
			//-- смарт:ММ 05.03.2020
			
		КонецЕсли;	
	КонецЕсли;
	// Фролов-
	
	//++ смарт:ММ #030 210 05.03.2020 - добавление Причины возврата товаров
	Если Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.ВозвратТоваровОтКлиента.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
			
		Если Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" Тогда
			
			ЭлементСмартПричинаВозврата = Форма.Элементы.Вставить("смартПричинаВозврата", Тип("ПолеФормы"), 
												Форма.Элементы.ГруппаДополнительно, Форма.Элементы.ДополнительнаяИнформация); 	
												
			//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
			Форма.Элементы.ГруппаРеализации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартПретензияКлиента", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеализации);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартПретензияКлиента";
			//-- #Б2802 смарт: Шляпников 15.04.2025
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ВозвратТоваровОтКлиента.Форма.ФормаДокумента" Тогда
			
			ЭлементСмартПричинаВозврата = Форма.Элементы.Вставить("смартПричинаВозврата", Тип("ПолеФормы"), 
												Форма.Элементы.ГруппаДополнительно, Форма.Элементы.ГруппаПечать); 		
			
		ИначеЕсли Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда

			ЭлементСмартПричинаВозврата = Форма.Элементы.Добавить("смартПричинаВозврата", Тип("ПолеФормы"), 
												Форма.Элементы.ГруппаПараметрыПраво);
			
		КонецЕсли;	
		
		ЭлементСмартПричинаВозврата.Вид 						= ВидПоляФормы.ПолеВвода;
		ЭлементСмартПричинаВозврата.ПутьКДанным 				= "Объект.смартПричинаВозврата";
		ЭлементСмартПричинаВозврата.РежимВыбораИзСписка 		= Истина;
		ЭлементСмартПричинаВозврата.РедактированиеТекста 		= Ложь;
		ЭлементСмартПричинаВозврата.АвтоОтметкаНезаполненного 	= Истина;
		ЭлементСмартПричинаВозврата.КнопкаОчистки 				= Истина;
		
		ЭлементСмартПричинаВозврата.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивПричинВозврата());

	КонецЕсли;
	//-- смарт:ММ 05.03.2020
	
	// Смарт Фролов+ Доп. расходы внесены 
	Если Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаСписка" 
		Или Форма.ИмяФормы = "Обработка.ЖурналДокументовЗакупки.Форма.СписокДокументов" Тогда 
		ДобавитьЭлементыУправленияНаФормыСписковДокументов(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;	
	// Фролов-
	
	//++ смарт:ММ #095 458 14.02.2021 На основании заказа на сборку создавать предзаказ поставщику
	Если Форма.ИмяФормы = "Документ.ЗаказНаСборку.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.ЗаказНаСборку.Форма.ФормаСписка" Тогда 
		
		// Спрятать типовую кнопку из подменю Создать на основании
		ЭлементСоздатьНаОсновании = Форма.Элементы.Найти("ФормаДокументсмартПредзаказПоставщикуСоздатьНаОсновании");
		Если ЭлементСоздатьНаОсновании <> Неопределено Тогда
			ЭлементСоздатьНаОсновании.Видимость = Ложь;
		КонецЕсли;

	КонецЕсли;	
	//-- смарт:ММ 14.02.2021
	
	//смарт+ Вахов Владимир /426 / 18.06.2021   
	Если Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда
		
		Если  РольДоступна("ПолныеПрава") Или смартИмеетПравоБлокироватьДокументы(Пользователи.ТекущийПользователь()) Тогда
			
			ДобавляемыеРеквизиты = Новый Массив;
			
			ТипРеквизита = Новый ОписаниеТипов("Булево");
			
			РеквизитФормы = Новый РеквизитФормы(
				"БлокировкаДокумента",  //Имя реквизита формы
				ТипРеквизита,     //Тип
				"",               //Путь  (Пусто, "Объект", ИмяТЧ)
								  // например "Объект.Товары"	
				"Блокировка документа");//Заголовок
								  							 
			ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
			
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			ПолеВвода = Форма.Элементы.Добавить("БлокировкаДокумента", Тип("ПолеФормы"), Форма.Элементы.Организации);
			ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
			ПолеВвода.ПутьКДанным = "БлокировкаДокумента";		
			ПолеВвода.УстановитьДействие("ПриИзменении", "смартБлокировкаДокументаПриИзменении");
			
		    ДопСвойствоБлокировка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Блокировка документа");
			ПризнакБлокировкиДокумента =  УправлениеСвойствами.ЗначениеСвойства(Форма.Объект.Ссылка, ДопСвойствоБлокировка);
			Форма.БлокировкаДокумента = ?(ПризнакБлокировкиДокумента = Неопределено, Ложь, ПризнакБлокировкиДокумента);
		
		КонецЕсли;  
		
		//++ #1670 смарт: Мосолов 14.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказНаПеремещение 
		
		ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3,0));
		НовыйРеквизитПроцентОплаты = Новый РеквизитФормы("смартПроцентОплаты", ОписаниеТипаЧисло);
		НовыйРеквизитПроцентОтгрузки = Новый РеквизитФормы("смартПроцентОтгрузки", ОписаниеТипаЧисло);

		НовыеРеквизиты = Новый Массив;
		НовыеРеквизиты.Добавить(НовыйРеквизитПроцентОплаты);
		НовыеРеквизиты.Добавить(НовыйРеквизитПроцентОтгрузки);
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);
		
		НоваяКоманда = Форма.Команды.Добавить("смартПродлитьРезерв");
		НоваяКоманда.Заголовок = "Продлить резерв";
		НоваяКоманда.Действие = "смарт_смартПродлитьРезервВместо";    
		
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаРезервов", Тип("ГруппаФормы"), Форма.Элементы.ГруппаСтатусЗакрыть);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;  
		
		НоваяДекорация = Форма.Элементы.Добавить("смартРезервДо", Тип("ДекорацияФормы"), НоваяГруппа); 
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.Заголовок = "";
		НоваяДекорация.ЦветТекста = ЦветаСтиля.ЦветТекстаЗаголовокОтчетаВТакси;
 		
		НовыйЭлемент = Форма.Элементы.Добавить("смартПродлитьРезерв", Тип("КнопкаФормы"), НоваяГруппа);
		НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
		НовыйЭлемент.ИмяКоманды = "смартПродлитьРезерв";
		НовыйЭлемент.Заголовок = "Продлить резерв";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартДатаПродленияРезервов", Тип("ПолеФормы"), НоваяГруппа);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДатаПродленияРезервов";
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартДатаПродленияРезервовПриИзменении");
		
		//-- #1670 смарт: Мосолов 14.03.2024  
		
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) И ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.Видимость = Ложь;
		КонецЕсли;
		//-- #Б1376 смарт: Шляпников 19.11.2024
		
	КонецЕсли;	
	//смарт- Вахов Владимир /426 / 18.06.2021
	
	//++#1457 смарт: Ермаков 14.09.2023 // Добавил новую форму к обработке
	Если Форма.ИмяФормы = "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия" Тогда
		
		////////////////////////////////////////////////////////////////////////////////////////////////////
		// Обработка документов Заказы Клиентов (важно, т.к., форма работает и с другими видами заказов)
		Если Форма.Заказы.Количество() > 0 И ТипЗнч(Форма.Заказы[0].Значение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			//++#1457 смарт: Ермаков 14.09.2023 // Выполняет проверку возможности закрытия заказов с дополнительным информированием пользователя
			// Концепция:
			// - Менеджер оформляет заказ
			// - Бухгалтер (или иное лицо) берет заказ в работу, устанавливает в документе признак "Согласовать ФИН" и начинает готовить документы отгрузки
			// - Менеджер понимает, что если признак "Согласовать ФИН" установлен, значит заказ изменять нельзя (форма закрытия запрещает это делать).
			// - Когда отгрузка осуществится, и будут подписаны первичные документы, бухгалтер (или менеджер) устанавливают признак "Оригиналы документов подписаны".
			// - Если признаки "Согласовать ФИН" и "Оригиналы документов подписаны" положительные, а процент отгрузки по заказу больше 0, то форма разрешит закрыть такой заказ, даже если он отгружен частично.
			// - Форма разрешит закрыть заказ если по заказу нет движений и ни один из признаков не установлен.
			
			// Реквизиты и наполнение данными
			МассивРеквизитов = Новый Массив; 
			
			// Таблица фоормы и ее колонки
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнаками", Новый ОписаниеТипов("ТаблицаЗначений"), "", "Финансовые признаки документов"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнакамиЗаказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"), "ДокументыСПризнаками", "Заказ"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнакамиСогласованоБух", Новый ОписаниеТипов("Булево"), "ДокументыСПризнаками", "Согл. ФИН"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнакамисмартДокументыПодписаны", Новый ОписаниеТипов("Булево"), "ДокументыСПризнаками", "Ориг. получ."));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнакамиПроцентОплаты", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0)), "ДокументыСПризнаками", "% оплаты"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнакамиПроцентОтгрузки", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0)), "ДокументыСПризнаками", "% отгрузки"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ДокументыСПризнакамиЗакрытие", Новый ОписаниеТипов("Булево"), "ДокументыСПризнаками", "Закрытие"));
			
			// Реквизиты формы
			МассивРеквизитов.Добавить(Новый РеквизитФормы("СогласованоБух", Новый ОписаниеТипов("Булево"), "", "Согл. ФИН"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("смартДокументыПодписаны", Новый ОписаниеТипов("Булево"), "", "Ориг. получ."));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("Закрытие", Новый ОписаниеТипов("Булево"), "", "Закрытие заказа возможно"));
				
			Форма.ИзменитьРеквизиты(МассивРеквизитов);
			
			// Массив собирает заказы, которые следует исключить из стандартной обработки закрытия
			МассивЗаказовИсключений = Новый Массив;
			
			// Наполнение таблицы формы
			ДокументыСПризнаками = Форма.РеквизитФормыВЗначение("ДокументыСПризнаками"); 
			Для Каждого ЭлементСписка Из Форма.Заказы Цикл
				
				// Если заказ в статусе Закрыт, он исключается из обработки
				Если ЭлементСписка.Значение.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
					МассивЗаказовИсключений.Добавить(ЭлементСписка);
					Продолжить;
				КонецЕсли;
				
				НоваяСтрокаТаблицы = ДокументыСПризнаками.Добавить();
				НоваяСтрокаТаблицы.ДокументыСПризнакамиЗаказ = ЭлементСписка.Значение;
				НоваяСтрокаТаблицы.ДокументыСПризнакамиСогласованоБух = ЭлементСписка.Значение.СогласованоБух; 
				НоваяСтрокаТаблицы.ДокументыСПризнакамисмартДокументыПодписаны = ЭлементСписка.Значение.смартДокументыПодписаны; 
				
				СтруктураСостоянияРасчетов = Новый Структура();
				СтруктураСостоянияРасчетов.Вставить("Состояние", Перечисления.СостоянияЗаказовКлиентов.ПустаяСсылка());
				СтруктураСостоянияРасчетов.Вставить("СостояниеПросрочено", Ложь);
				СтруктураСостоянияРасчетов.Вставить("СуммаОплаты",		0);
				СтруктураСостоянияРасчетов.Вставить("СуммаОтгрузки",	0);
				СтруктураСостоянияРасчетов.Вставить("ПроцентОплаты", 	0);
				СтруктураСостоянияРасчетов.Вставить("ПроцентОтгрузки", 	0);
				СтруктураСостоянияРасчетов.Вставить("СуммаДолга", 		0);
				СтруктураСостоянияРасчетов.Вставить("ПроцентДолга", 	0);
				СтруктураСостоянияРасчетов.Вставить("СуммаКОплате", 	0);
				
				РеквизитыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементСписка.Значение, "Договор, Валюта");
				Документы.ЗаказКлиента.РассчитатьСостояние(ЭлементСписка.Значение, РеквизитыЗаказа.Договор, СтруктураСостоянияРасчетов);
				
				НоваяСтрокаТаблицы.ДокументыСПризнакамиПроцентОплаты = СтруктураСостоянияРасчетов.ПроцентОплаты;
				НоваяСтрокаТаблицы.ДокументыСПризнакамиПроцентОтгрузки = СтруктураСостоянияРасчетов.ПроцентОтгрузки;
				
				// На форме документа ЗаказКлиента - это флаг "Согласовать ФИН"
				ДокументСогласованБухгалтерией = ЭлементСписка.Значение.СогласованоБух;
				// На форме документа ЗаказКлиента - это флаг "Оригиналы документов получены"
				ПервичныеДокументыПодписаны = ЭлементСписка.Значение.смартДокументыПодписаны;
				ТоварыОтгружены = СтруктураСостоянияРасчетов.ПроцентОтгрузки > 0;
				
				// Условия закрытия
				МожноЗакрыть = (ДокументСогласованБухгалтерией И ПервичныеДокументыПодписаны И ТоварыОтгружены)
								Или (Не ДокументСогласованБухгалтерией И Не ПервичныеДокументыПодписаны И Не ТоварыОтгружены);
					
				НоваяСтрокаТаблицы.ДокументыСПризнакамиЗакрытие = МожноЗакрыть;
				
				// Если заказ нельзя закрыть, добавляем его в массив исключений
				Если Не МожноЗакрыть Тогда
					МассивЗаказовИсключений.Добавить(ЭлементСписка);	
				КонецЕсли;
				
			КонецЦикла;
			
			// Определяет, что в выборке только один заказ. Требуется для условий отрисовки формы
			ОбработкаЕдиничногоЗаказа = Форма.Заказы.Количество() = 1;
			
			// Удаляем заказы-исключения из списка для стандартной обработки закрытия
			Для Каждого ЭлементМассива Из МассивЗаказовИсключений Цикл
				Форма.Заказы.Удалить(ЭлементМассива);
			КонецЦикла;                              
			
			Форма.ЗначениеВРеквизитФормы(ДокументыСПризнаками, "ДокументыСПризнаками");
			
			// Элементы	формы		
			
			// Отключаем кнопки навигационной панели, если ни один заказ закрыть невозможно
			ЕстьЗаказыКоторыеМожноЗакрыть = Не ДокументыСПризнаками.Найти(Истина, "ДокументыСПризнакамиЗакрытие") = Неопределено; 
			Если Не ЕстьЗаказыКоторыеМожноЗакрыть Тогда
				Форма.Элементы.НавигацияНачалоКоманднаяПанель.Доступность = Ложь;
			КонецЕсли;
			
			// Отрисовка формы
			РодительскийЭлемент = Форма.Элементы.ГруппаРасчеты;
			
			Для Каждого ЭлементМассива Из МассивРеквизитов Цикл
				
				// Обработка элементов формы,  связанных с таблицей "ДокументыСПризнаками"
				Если СтрНайти(ЭлементМассива.Имя, "ДокументыСПризнаками") > 0 Тогда                       
					
					// Если в выборке только один заказ, таблицу не рисуем
					Если ОбработкаЕдиничногоЗаказа Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЭлементМассива.ТипЗначения = Новый ОписаниеТипов("ТаблицаЗначений") Тогда
						
						// Отрисовка таблицы формы
						НовыйЭлемент = Форма.Элементы.Добавить(ЭлементМассива.Имя, Тип("ТаблицаФормы"), РодительскийЭлемент);
						НовыйЭлемент.ПутьКДанным = ЭлементМассива.Имя;
						НовыйЭлемент.Доступность = Истина;
						НовыйЭлемент.ТолькоПросмотр = Истина;
						НовыйЭлемент.Отображение = ОтображениеТаблицы.Список;
						НовыйЭлемент.ЧередованиеЦветовСтрок = Истина;
						НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
						НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
						
					Иначе
						
						// Отрисовка колонок формы
						НовыйЭлемент = Форма.Элементы.Добавить(ЭлементМассива.Имя, Тип("ПолеФормы"), Форма.Элементы.ДокументыСПризнаками);
						НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;	
						НовыйЭлемент.ПутьКДанным = Форма.Элементы.ДокументыСПризнаками.Имя + "." + ЭлементМассива.Имя;							
						
					КонецЕсли;
					
				// Обработка иных элементов формы	
				ИначеЕсли ЭлементМассива.ТипЗначения = Новый ОписаниеТипов("Булево") Тогда 
					
					// Если в выборке более одного заказа, то данная ветка не требуется
					// Вместо нее будет отрисована Таблица формы
					Если Не ОбработкаЕдиничногоЗаказа Тогда
						Продолжить;
					КонецЕсли;
					
					// Важно. Даже если в выборке только один заказ, он все равно помещен в таблицу.
					// Поэтому, ПутьКДанным ссылаем на нулевой индекс таблицы.
					НовыйЭлемент = Форма.Элементы.Добавить(ЭлементМассива.Имя, Тип("ПолеФормы"), РодительскийЭлемент);
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
					НовыйЭлемент.ПутьКДанным = "ДокументыСПризнаками[0].ДокументыСПризнаками" + ЭлементМассива.Имя;
					НовыйЭлемент.ТолькоПросмотр = Истина;
					
					Если ЭлементМассива.Имя = "Закрытие" Тогда
						НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
					КонецЕсли;
		
				КонецЕсли;
				
			КонецЦикла;
			//--#1457 смарт: Ермаков 14.09.2023 // Выполняет проверку возможности закрытия заказов с дополнительным информированием пользователя
			
		КонецЕсли; // Только заказы клиентов
		////////////////////////////////////////////////////////////////////////////////////////////////////
		
	КонецЕсли;
	//--#1457 смарт: Ермаков 14.09.2023 // Добавил новую форму к обработке 
	
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	//++#1457 смарт: Ермаков 14.09.2023 // Добавил форму документа документа Заказ клиента к обработке	
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		
		//++#1457 смарт: Ермаков 14.09.2023 // Делаем поле "Статус" недоступным для редактирования	
		// Требуется для того, чтобы пользователь получал только один путь для закрытия заказа
		// Этот путь лежит через форму "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия"
		Форма.Элементы.Статус.Вид = ВидПоляФормы.ПолеНадписи;                                       
		//--#1457 смарт: Ермаков 14.09.2023 // Делаем поле "Статус" недоступным для редактирования	
		
		//++ #1652 смарт: Ермаков 26.06.2024 / Доработка карточки Контрагента
		// Служит для информирования о том, что контрагент работает только через ЭДО
		НовыйЭлемент = 
			Форма.Элементы.Добавить(
				"смартОтправлятьВсеДокументыЧерезЭДО", 
				Тип("ДекорацияФормы"), 
				Форма.Элементы.смартГруппаНадписьИДатаРезерва);
		
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Отправлять по ЭДО все документы";
		НовыйЭлемент.Ширина = 25; 
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт,,, Истина);		
		
		Форма.смартОпределитьВидимостьОтправлятьВсеДокументыЧерезЭДО();
        //-- #1652 смарт: Ермаков 26.06.2024
		
		//++ #1807 смарт: Мосолов 05.07.2024 //Расчет автоматических скидок при записи
		МассивРеквизитов = Новый Массив;

		Реквизит = Новый РеквизитФормы("смартВопросПроСкидкиЗадан", Новый ОписаниеТипов("Булево"));
		МассивРеквизитов.Добавить(Реквизит);   
		
		Реквизит = Новый РеквизитФормы("смартЖдемОтветаНаВопросПроСкидки", Новый ОписаниеТипов("Булево"));
		МассивРеквизитов.Добавить(Реквизит);    
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		//-- #1807 смарт: Мосолов 05.07.2024 
		
		//++ #Б-1234 смарт: Мосолов 29.10.2024 //Уведомление об автоматических скидках выводить только один раз
		МассивРеквизитов = Новый Массив;
		
		Реквизит = Новый РеквизитФормы("смартСуммаДокументаИзменилась", Новый ОписаниеТипов("Булево"));
		МассивРеквизитов.Добавить(Реквизит);    
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		//-- #1944 смарт: Мосолов 26.07.2024  
		
		НоваяГруппа = Форма.Элементы.Вставить("смартГруппаУсловияДопГарантии", Тип("ГруппаФормы"), Форма.Элементы.ГруппаТовары, Форма.Элементы.СоздатьРеализацию);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.ЦветФона = WebЦвета.Лимонный;
		НоваяГруппа.Видимость = Ложь;
		
		НоваяДекорация = Форма.Элементы.Добавить("смартКартинкаДопУсловий", Тип("ДекорацияФормы"), НоваяГруппа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Картинка;
		НоваяДекорация.Картинка = БиблиотекаКартинок.CRM_ТипОбращения14;
		НоваяДекорация.РазмерКартинки = РазмерКартинки.РеальныйРазмер; 
		НоваяДекорация.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр; 
		
		НоваяДекорация = Форма.Элементы.Добавить("смартТекстДопУсловий", Тип("ДекорацияФормы"), НоваяГруппа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.РастягиватьПоГоризонтали = Истина;			
		НоваяДекорация.АвтоМаксимальнаяШирина = Ложь;			
		НоваяДекорация.УстановитьДействие("ОбработкаНавигационнойСсылки", "смартТекстДопУсловийОбработкаНавигационнойСсылки");  
		//-- #1944 смарт: Мосолов 26.07.2024   
		
		//++ #2059 смарт: Мосолов 19.09.2024 // Подсказка для документов Интерес и Заказ клиента при первоначальной продажи Доп. гарантии 
		НоваяГруппа = Форма.Элементы.Добавить("смартГруппаПодсказкаДопГарантии", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаУсловияДопГарантии);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Заголовок = Символы.НПП;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
		НоваяГруппа.Объединенная = Истина; 
		
		НоваяДекорация = Форма.Элементы.Добавить("смартТекстПодсказкиДопУсловий", Тип("ДекорацияФормы"), НоваяГруппа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись; 
		
		//++ #Б-1248 смарт: Мосолов 29.10.2024 // Дополнить текст Подсказки Доп гарантии
		НоваяДекорация.Заголовок = "Услуга по продлению срока гарантийных условий в отношении поставляемого Оборудования,"
			+ Символы.ПС
			+ "в соответствии с разделом 6 Гарантийные обязательства Договора купли-продажи";
		//-- #Б-1248 смарт: Мосолов 29.10.2024 
			
		НоваяГруппа.Скрыть();
		//-- #2059 смарт: Мосолов 19.09.2024  
		
		//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
		НовыйЭлемент = Форма.Элементы.Добавить("ТоварысмартКтоКонсультировал", Тип("ПолеФормы"), Форма.Элементы.Товары);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.Товары.смартКтоКонсультировал";
		Форма.Элементы.Переместить(НовыйЭлемент, Форма.Элементы.Товары, Форма.Элементы.ТоварыСодержание);
		//-- #1936 смарт: Шляпников 20.01.2025
		
		//++ #Б-1954 смарт: Лопато 22.01.2025 //Заказ клиента. Колонка "Кто консультировал". Настроить выбор.  
		НовыйЭлемент.РежимВыбораИзСписка  = Истина;
		НовыйЭлемент.РедактированиеТекста = Ложь;
		НовыйЭлемент.КнопкаОткрытия		  = Ложь;
		НовыйЭлемент.КнопкаСоздания 	  = Ложь;
		
		МассивПользователей = смартПользователи.ПолучитьМассивПользователейКтоКонсультировал();
		НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(МассивПользователей);
		//-- #Б-1954 смарт: Лопато 22.01.2025
		
		//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(Форма, Истина, "ПартнерБезКЛ");
		смартСервер.УстановитьОтображениеПризнакаВИП(Форма, Форма.Объект.Партнер);
		//-- #Б3960 смарт: Шляпников 16.09.2025
		
	КонецЕсли;
	//--#1457 смарт: Ермаков 14.09.2023 // Добавил форму документа документа Заказ клиента к обработке	

	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	//++#1457 смарт: Ермаков 14.09.2023 // Добавил форму списка документов Заказ клиент к обработке	
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСпискаДокументов" Тогда
		
		//++#1457 смарт: Ермаков 14.09.2023 // Под неполными правами блокируется возможность
		// установки всех статусов, кроме закрытия
		// Запрещено выводить заказ из статуса Закрыт без согласования (политика организации)
		Форма.Элементы.УстановитьСтатусКВыполнению.Доступность = РольДоступна("ПолныеПрава");
		Форма.Элементы.УстановитьСтатусНаСогласовании.Доступность = РольДоступна("ПолныеПрава");
		//--#1457 смарт: Ермаков 14.09.2023 // Под неполными правами блокируется возможность	
		
	КонецЕсли;
	//--#1457 смарт: Ермаков 14.09.2023 // Добавил форму документа документа Заказ клиента к обработке
	
	//++ смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
	
		//Создадим элемент формы
		МассивРеквизитов = Новый Массив;
		КвалификаторСтр = Новый КвалификаторыСтроки(4);
		Реквизит = Новый РеквизитФормы("ОсновнойЭДО", Новый ОписаниеТипов("Строка",,,,КвалификаторСтр));
		МассивРеквизитов.Добавить(Реквизит); 
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		НоваяГруппаКор = Форма.Элементы.Добавить("смартГруппаОсновнойЭДО", ТИп("ГруппаФормы"), Форма.Элементы.ГруппаСтраницаРоссийскогоКонтрагента);
		НоваяГруппаКор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаКор.ОтображатьЗаголовок = Ложь;
		НоваяГруппаКор.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппаКор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		КонтрМасс = Новый Массив;
		КонтрМасс.Добавить(Форма.Объект.Ссылка);
		КонтрагентИЭДО = смартОбщегоНазначения.ПолучитьОсновнойЭДОКонтрагентов(КонтрМасс);
		Форма.ОсновнойЭДО = КонтрагентИЭДО[Форма.Объект.Ссылка];
	
		НовыйЭлемент = Форма.Элементы.Добавить("смартВыборОсновногоЭДО", Тип("ПолеФормы"), НоваяГруппаКор);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаСпискаВыбора = Истина;
		НовыйЭлемент.РежимВыбораИзСписка = Истина;
		НовыйЭлемент.ПутьКДанным = "ОсновнойЭДО";
		НовыйЭлемент.КнопкаОчистки = Истина;
		НовыйЭлемент.МаксимальнаяШирина = 50; 
		смартОбщегоНазначения.ЗаполнитьСписокВыбораЭДОНаСервере(НовыйЭлемент);
		НовыйЭлемент.УстановитьДействие("ОбработкаВыбора","смартОбработкаВыбораОсновногоЭДО");
		НовыйЭлемент.УстановитьДействие("Очистка","смартОчисткаОсновногоЭДО");
		НовыйЭлемент.Подсказка = "Оператор ЭДО, предпочитаемый контрагентом";
		//++ #5046 смарт: Тимофеева 27.11.2025 / Оператор ЭДО в карточке контрагента
		НовыйЭлемент.ПодсказкаВвода = СформироватьТекстПодсказкиОператоровЭДО(Форма.Объект.Ссылка);
		//-- #5046 смарт: Тимофеева 27.11.2025
		
		смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартВыборОсновногоЭДО", "поле ""ВыборОсновного ЭДО Контрагента""", 
													 Форма.Элементы.смартГруппаОсновнойЭДО, Форма);		
													 
		//++ #1652 смарт: Ермаков 26.06.2024 / Доработка карточки Контрагента
		НовыйЭлементОтправлятьВсеДокументыЧерезЭДО = 
			Форма.Элементы.Добавить("смартОтправлятьВсеДокументыЧерезЭДО", Тип("ПолеФормы"), НоваяГруппаКор);
			
		НовыйЭлементОтправлятьВсеДокументыЧерезЭДО.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементОтправлятьВсеДокументыЧерезЭДО.ПутьКДанным = "Объект.смартОтправлятьВсеДокументыЧерезЭДО";
		НовыйЭлементОтправлятьВсеДокументыЧерезЭДО.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка; 
		
		// Доступность лишь для полных прав и роли "ДобавлениеИзменениеРеализацийТоваровУслуг" 
		НовыйЭлементОтправлятьВсеДокументыЧерезЭДО.Доступность = 
			Пользователи.РолиДоступны("ДобавлениеИзменениеРеализацийТоваровУслуг");
		//-- #1652 смарт: Ермаков 26.06.2024
		
	КонецЕсли; 
	//-- смарт: #1438 Корбутов 04.09.2023
	
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	// Перенес из расширенного модуля формы документа
	Если Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		
		//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		// Заменил на метод БСП
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда	
		//Каратеев ++
		//Если НЕ РольДоступна("ПолныеПрава") Тогда
		//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
			
			Форма.Элементы.Склад.ТолькоПросмотр 		= Истина;
			Форма.Элементы.Ответственный.ТолькоПросмотр = Истина;
			Форма.Элементы.Дата.ТолькоПросмотр 			= Истина;
		
		КонецЕсли; 
		//Каратеев -- 
		
		//++ смарт:ММ #006 144 05.12.2019
		смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(Форма);	
		//-- смарт:ММ #006 144 05.12.2019
		
		//Форма.УстановитьДействие("ПередЗаписью", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		
		//++ #1834 смарт: Шляпников 09.01.2025 / Интеграция с WMS. Загрузка приходных ордеров.
		НовыйЭлемент = Форма.Элементы.Добавить("смартИдентификаторWMS", Тип("ПолеФормы"), Форма.Элементы.ГруппаИнформацияПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартИдентификаторWMS";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.МаксимальнаяШирина = Форма.Элементы.Ответственный.МаксимальнаяШирина;
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		//-- #1834 смарт: Шляпников 09.01.2025
		//++ #Б2942 смарт: Шляпников 07.04.2025 / Интеграция с WMS. Загрузка расходных ордеров. Дополнение.
		НовыйЭлемент = Форма.Элементы.Добавить("смартДатаОрдера", Тип("ПолеФормы"), Форма.Элементы.ГруппаИнформацияПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДатаОрдера";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		//-- #Б2942 смарт: Шляпников 07.04.2025
		
		//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
		смартФормированиеИнтерфейса.СздПоле(Форма, "ТоварыПоРаспоряжениямсмартЗапчастиГарантийные", "ТоварыПоРаспоряжениям",, 2, "Объект.ТоварыПоРаспоряжениям.смартЗапчастиГарантийные");
		смартФормированиеИнтерфейса.СздПоле(Форма, "ОтгружаемыеТоварысмартЗапчастиГарантийные", "ОтгружаемыеТовары",, 2, "Объект.ОтгружаемыеТовары.смартЗапчастиГарантийные");
		//-- #Б2972 смарт: Шляпников 07.11.2025

	КонецЕсли; 
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	// Перенес из расширенного модуля формы документа
	Если Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		
		//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		// Заменил на метод БСП
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда	
		//Каратеев ++
		//Если НЕ РольДоступна("ПолныеПрава") Тогда
		//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
			
			Форма.Элементы.Склад.ТолькоПросмотр 		= Истина;
			Форма.Элементы.Ответственный.ТолькоПросмотр = Истина;
			Форма.Элементы.Дата.ТолькоПросмотр 			= Истина;
		
		КонецЕсли; 
		//Каратеев -- 
		
		//++ смарт:ММ #006 144 05.12.2019
		смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(Форма);	
		//-- смарт:ММ #006 144 05.12.2019 
		
		//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		//++#1374 смарт: Балашов 06.07.2023 //Разработать учет закупок в разрезе Контейнеров
		//Если Объект.Ссылка = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка() Тогда
		//	смартПроверитьЗаполнитьКонтейнеры(Отказ,истина);
		//Иначе	
		//	смартПроверитьЗаполнитьКонтейнеры(Отказ,ложь);
		//КонецЕсли; 
		//--#1374 смарт: Балашов 06.07.2023
		смартСервер.смартПроверитьЗаполнитьКонтейнеры(Форма, Отказ, Форма.Объект.Ссылка.Пустая());
		//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		
		//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		смартСервер.смартПеречитатьДанныеКонтейнеров(Форма.Объект);
		//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
		
		//++ #1834 смарт: Шляпников 09.01.2025 / Интеграция с WMS. Загрузка приходных ордеров.
		НовыйЭлемент = Форма.Элементы.Добавить("смартИдентификаторWMS", Тип("ПолеФормы"), Форма.Элементы.ИнформацияШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартИдентификаторWMS";
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.МаксимальнаяШирина = Форма.Элементы.Ответственный.МаксимальнаяШирина;
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		//-- #1834 смарт: Шляпников 09.01.2025
		
	КонецЕсли; 
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  	
	
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	// Перенес из расширенного модуля формы документа
	Если Форма.ИмяФормы = "Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента" Тогда
		
		//++ смарт:ММ #006 144 05.12.2019
		смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(Форма);	
		//-- смарт:ММ 05.12.2019
		
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		//-- #Б1376 смарт: Шляпников 19.11.2024
		
		//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
		Если ЗначениеЗаполнено(Форма.Объект.ЗаказНаВнутреннееПотребление) И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		//-- #Б1598 смарт: Шляпников 09.12.2024
		
		//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
		смартФормированиеИнтерфейса.СздПоле(Форма, "ТоварыНазначение", "Товары",, 1, "Объект.Товары.Назначение",,, "ТоварыУпаковкаЕдиницаИзмерения");
		//-- #Б4636 смарт: Шляпников 14.10.2025

	КонецЕсли;
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  	

	//++#1316 смарт: Лопато 06.10.2023 //Запретить использование в документах подразделения другой организации  
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") И Форма.Объект.Свойство("Ссылка") Тогда
	
		ОбъектМетаданных = Форма.Объект.Ссылка.Метаданные();
		
		Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			
			ЕстьПодразделениеВОбъектеМетаданных = Ложь;
			
			МассивПутейКДанным = Новый Массив;
			
			Если ОбъектМетаданных.Реквизиты.Найти("Организация") <> Неопределено
				И ОбъектМетаданных.Реквизиты.Найти("Подразделение") <> Неопределено Тогда
				
				МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
															"Объект.Подразделение", 
															"Объект.Организация"));
					
				ЕстьПодразделениеВОбъектеМетаданных = Истина;
				
			КонецЕсли;	

			Для Каждого ОбъектМетаданныхТабЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
				
				Если ОбъектМетаданныхТабЧасть.Реквизиты.Найти("Подразделение") <> Неопределено Тогда
					
					Если ОбъектМетаданныхТабЧасть.Имя = "РасшифровкаПлатежа" И ОбъектМетаданныхТабЧасть.Реквизиты.Найти("АналитикаДоходов") <> Неопределено Тогда
						
						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Объект." + ОбъектМетаданныхТабЧасть.Имя + ".Подразделение", 
																	"Объект." + "Организация"));
						
						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".Подразделение", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".АналитикаДоходов"));
						
					ИначеЕсли ОбъектМетаданныхТабЧасть.Имя = "РасшифровкаПлатежа" И ОбъектМетаданныхТабЧасть.Реквизиты.Найти("АналитикаРасходов") <> Неопределено Тогда

						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Объект." + ОбъектМетаданныхТабЧасть.Имя + ".Подразделение", 
						                                            "Объект." + "Организация"));
						
						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".Подразделение", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".АналитикаРасходов"));
						
					ИначеЕсли ОбъектМетаданныхТабЧасть.Имя = "РасшифровкаПлатежа" И ОбъектМетаданных.Реквизиты.Найти("Организация") <> Неопределено Тогда	

						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Объект." + ОбъектМетаданныхТабЧасть.Имя + ".Подразделение", 
																	"Объект." + "Организация"));
						
						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".Подразделение", 
																	"Объект." + "Организация"));
						
					ИначеЕсли ОбъектМетаданныхТабЧасть.Реквизиты.Найти("Организация") <> Неопределено Тогда	

						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Объект." + ОбъектМетаданныхТабЧасть.Имя + ".Подразделение", 
						                                            "Объект." + "Организация"));
						
						МассивПутейКДанным.Добавить(Новый Структура("ПутьПодразделение, ПутьОрганизация", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".Подразделение", 
																	"Элементы." + ОбъектМетаданныхТабЧасть.Имя + ".ТекущиеДанные" + ".Организация"));
						
					Иначе
						Продолжить;
					КонецЕсли;
					
					ЕстьПодразделениеВОбъектеМетаданных = Истина;
					
				КонецЕсли;	
					
			КонецЦикла;	
				
			Если ЕстьПодразделениеВОбъектеМетаданных Тогда

				Для Каждого ЭлементФормы Из Форма.Элементы Цикл
					
					Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Тогда
						
						Для Каждого ЭлементПутьКДанным Из МассивПутейКДанным Цикл
						
							Если ЭлементФормы.ПутьКДанным = ЭлементПутьКДанным.ПутьПодразделение Тогда	
								
								МассивСвязей = Новый Массив;
								МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.смартОрганизацияВладелец", ЭлементПутьКДанным.ПутьОрганизация));
								ЭлементФормы.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
								
								МассивПараметров = Новый Массив;
								МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.смартПодразделениеНеИспользуется", Ложь));
								МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
								ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

								ЭлементФормы.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;

							КонецЕсли;

						КонецЦикла;	
							
					КонецЕсли;
					
				КонецЦикла;	

			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	//--#1316 смарт: Лопато 06.10.2023
	
	//++ #1419 смарт: Ермаков 12.10.2023 //Контроль использования запчастей не для продажи  
	//Если Форма.ИмяФормы = "Документ.КорректировкаРегистров.Форма.ФормаДокумента" Тогда
	//	
	//	Если ЗначениеЗаполнено(Форма.Объект.смартКорректировкаГТДНеДляПродажи) Тогда
	//		
	//		НовыйЭлемент = Форма.Элементы.Добавить("смартКорректировкаГТДНеДляПродажи", Тип("ПолеФормы"), Форма.Элементы.ГруппаЛево);
	//		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//		НовыйЭлемент.ПутьКДанным = "Объект.смартКорректировкаГТДНеДляПродажи";
	//		НовыйЭлемент.ТолькоПросмотр = Истина; 
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//-- #1419 смарт: Ермаков 12.10.2023 //Контроль использования запчастей не для продажи  
	
	//++#1517 смарт: Лопато 20.10.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры  
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартДатаНачалаСерийногоУчетаВременная", Тип("ПолеФормы"), Форма.Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета, Форма.Элементы.ВариантОформленияПродажи);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДатаНачалаСерийногоУчетаВременная";
		//++ #Б-5692 смарт: Фролов 25.02.2026 //Номенклатура. Реквизит Дата начала серийного учета.
		//НовыйЭлемент.ТолькоПросмотр = НЕ Пользователи.ЭтоПолноправныйПользователь(Пользователи.АвторизованныйПользователь())
		НовыйЭлемент.ТолькоПросмотр = НЕ Форма.Объект.ВидНоменклатуры.ИспользоватьСерии
		И НЕ Пользователи.ЭтоПолноправныйПользователь(Пользователи.АвторизованныйПользователь());
		//-- #Б-5692 смарт: Фролов 25.02.2026
		
	КонецЕсли;	
	//--#1517 смарт: Лопато 20.10.2023
	
	//++#1323 смарт: Лопато 31.10.2023 //Восстановить и переделать механизм индивидуальных скидок
	Если Форма.ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаСпискаТиповыхСоглашений" Тогда
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартГруппаМаксимальныйПроцентИндивидуальнойРучнойСкидки", Тип("ГруппаФормы"), Форма.Элементы.ГруппаБыстрыеОтборы);
		НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		НовыйЭлемент.ОтображатьЗаголовок = Ложь;
		
		ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5,2));
		НовыйРеквизитМаксимальныйПроцентРучнойСкидки = Новый РеквизитФормы("смартМаксимальныйПроцентИндивидуальнойРучнойСкидки", ОписаниеТипаЧисло);

		НовыеРеквизиты = Новый Массив;
		НовыеРеквизиты.Добавить(НовыйРеквизитМаксимальныйПроцентРучнойСкидки);
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);
		
		МаксимальныйПроцентРучнойСкидки = Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
		Форма.смартМаксимальныйПроцентИндивидуальнойРучнойСкидки = МаксимальныйПроцентРучнойСкидки;
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартМаксимальныйПроцентИндивидуальнойРучнойСкидки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаМаксимальныйПроцентИндивидуальнойРучнойСкидки);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартМаксимальныйПроцентИндивидуальнойРучнойСкидки";
		НовыйЭлемент.Заголовок = "Максимальный процент ручной скидки (смарт)";
	    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");  

		НовыйЭлемент.Доступность = Пользователи.ЭтоПолноправныйПользователь(ПользователиКлиентСервер.АвторизованныйПользователь(), Истина, Ложь);
		
		смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартМаксимальныйПроцентИндивидуальнойРучнойСкидки", "поле ""Максимальный процент ручной скидки""", 
													 	 Форма.Элементы.смартГруппаМаксимальныйПроцентИндивидуальнойРучнойСкидки, Форма, Истина);

	КонецЕсли;	
	//--#1323 смарт: Лопато 31.10.2023
	
	//++ #1567 смарт: Ермаков / Проверить и исправить синхронизацию УТ-УТ и выгрузку БП2.0-УТ + исправить ошибки
	Если Форма.ИмяФормы = "ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Форма.ФормаУзла" Тогда
		
		НоваяСтраницаГруппы = Форма.Элементы.Добавить("смартДополнительныеПараметы", Тип("ГруппаФормы"), Форма.Элементы.Группа);
		НоваяСтраницаГруппы.Вид = ВидГруппыФормы.Страница;
		НоваяСтраницаГруппы.Заголовок = "Доп. параметры (смарт)";
		
		ЭлементСтранаМира = Форма.Элементы.Добавить("смартСтранаМира", Тип("ПолеФормы"), НоваяСтраницаГруппы);
		ЭлементСтранаМира.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСтранаМира.ПутьКДанным = "Объект.смартСтранаМира";
		ЭлементСтранаМира.Заголовок = "Страна мира";
		
		ЭлементСтранаМира.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		ЭлементСтранаМира.Подсказка = "Указывается страна мира, к которой относится база-корреспондент. 
									  |Данный параметр влияет на условие выгрузки данных, таких как справочник Контрагенты
									  |и подобных. 
									  |Если значение не заполнено, считается, что страна мира - Россия";

		//++ #Б2356 смарт: Шляпников 17.02.2025 / Синхронизация УТ-БП. Выгрузка складов Атлант и Цифровая упаковка
		Группа = Форма.Элементы.Добавить("смартГруппаВыгружаемыеСклады", Тип("ГруппаФормы"), НоваяСтраницаГруппы);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = "Выгружаемые склады";
		
		Таблица = Форма.Элементы.Добавить("смартВыгружаемыеСклады", Тип("ТаблицаФормы"), Группа);
		Таблица.ПутьКданным = "Объект.смартВыгружаемыеСклады";
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартВыгружаемыеСкладыСклад", Тип("ПолеФормы"), Таблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартВыгружаемыеСклады.Склад";
		//-- #Б2356 смарт: Шляпников 17.02.2025
		
		//++ #Б868 смарт: Шляпников 12.05.2025 / Настроить обмен УТ_РФ -> УТ_БР
		Группа = Форма.Элементы.Добавить("смартГруппаНоменклатура", Тип("ГруппаФормы"), НоваяСтраницаГруппы);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = "Выгружаемая номенклатура";
		
		Таблица = Форма.Элементы.Добавить("смартВыгружаемаяНоменклатура", Тип("ТаблицаФормы"), Группа);
		Таблица.ПутьКданным = "Объект.смартВыгружаемаяНоменклатура";
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартВыгружаемаяНоменклатураНоменклатура", Тип("ПолеФормы"), Таблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартВыгружаемаяНоменклатура.Номенклатура";
		//-- #Б868 смарт: Шляпников 12.05.2025
		
	КонецЕсли;
	//-- #1567 смарт: Ермаков / Проверить и исправить синхронизацию УТ-УТ и выгрузку БП2.0-УТ + исправить ошибки
	
	//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
	Если (Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаСборку.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" 
		)
		//И Пользователи.ЭтоПолноправныйПользователь()
		Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("смартЗаполнитьСтатусыУказанияСерий");
		НоваяКоманда.Заголовок = "Заполнить статусы указания серий (смарт)";
		НоваяКоманда.Действие = "смартЗаполнитьСтатусыУказанияСерий";
		
		Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" 
			ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда 

			ГруппаРодитель = Форма.Элементы.ТоварыГруппаЗаполнить;
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" 
			ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаСборку.Форма.ФормаДокумента" Тогда 
			
			ГруппаРодитель = Форма.Элементы.ГруппаЗаполнить;

		ИначеЕсли Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("смартЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениям");
			НоваяКоманда.Заголовок = "Заполнить статусы указания серий (смарт)";
			НоваяКоманда.Действие = "смартЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениям";

			НовыйЭлемент = Форма.Элементы.Добавить("смартЗаполнитьСтатусыУказанияСерийКнопкаТоварыПоРаспоряжениям", Тип("КнопкаФормы"), Форма.Элементы.ТоварыПоРаспоряжениямКоманднаяПанель);
			НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			НовыйЭлемент.ИмяКоманды = "смартЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениям";
			НовыйЭлемент.Заголовок = "Заполнить статусы указания серий";
			
			ГруппаРодитель = Форма.Элементы.ОтгружаемыеТоварыПодменюЗаполнить;
			
		ИначеЕсли Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
			
			ГруппаРодитель = Форма.Элементы.ЗаполнитьПоРаспоряжению;
			
		КонецЕсли;	
			
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗаполнитьСтатусыУказанияСерийКнопка", Тип("КнопкаФормы"), ГруппаРодитель);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "смартЗаполнитьСтатусыУказанияСерий";
		НовыйЭлемент.Заголовок = "Заполнить статусы указания серий";

	КонецЕсли;
	//--#1517 смарт: Лопато 20.12.2023  
	
	//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы   
	Если Форма.ИмяФормы="Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаСписка" Тогда 
		
		Если Форма.Параметры.Свойство("РежимВыбора") И Форма.Параметры.РежимВыбора Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("смартВыбрать");
			НоваяКоманда.Заголовок = "Выбрать (смарт)";
			НоваяКоманда.Действие = "смартВыбрать";
			
			НовыйЭлемент = Форма.Элементы.Вставить("смартВыбрать", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель, Форма.Элементы.ФормаСоздать);
			НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			НовыйЭлемент.ИмяКоманды = "смартВыбрать";
			НовыйЭлемент.Заголовок = "Выбрать";  
			
			Форма.Элементы.Список.УстановитьДействие("Выбор", "смартСписокВыбор")
			
		КонецЕсли;
		
		НоваяКоманда = Форма.Команды.Добавить("смартДобавитьИзКлассификатора");
		НоваяКоманда.Заголовок = "Добавить из классификатора (смарт)";
		НоваяКоманда.Действие = "смартДобавитьИзКлассификатора";
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартДобавитьИзКлассификатора", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель, Форма.Элементы.ФормаПодборИзКлассификатора);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "смартДобавитьИзКлассификатора";
		НовыйЭлемент.Заголовок = "Добавить из классификатора";  
		
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда	
			Форма.Элементы.Список.ИзменятьСоставСтрок = Ложь; 
			Форма.Элементы.ФормаПодборИзКлассификатора.Видимость = Ложь;
			Форма.Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
			Форма.Элементы.ФормаСоздатьБизнесРегионы.Видимость = Ложь;
			Форма.Элементы.ФормаНачальноеЗаполнение.Видимость = Ложь;
		КонецЕсли; 
		
	КонецЕсли;    
	//-- #1537 смарт: Мосолов 26.12.2023
	
	//++ #1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы   
	Если Форма.ИмяФормы = "Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаЭлемента" Тогда
		
		Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			
			Форма.ТолькоПросмотр = Истина;
			Форма.Элементы.ФормаСкопировать.Видимость = Ложь;   
			
		КонецЕсли;
		
		//++#1472 смарт Ермаков 14.11.2023 Запрет изменения бизнес-регионов
		НовыйЭлемент = Форма.Элементы.Добавить("СмартКодСубъектаРФ", Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.СмартКодСубъектаРФ";
		НовыйЭлемент.Заголовок = "Код субъекта РФ";                        
		//--#1472 смарт Ермаков 14.11.2023 Запрет изменения бизнес-регионов
		
	КонецЕсли;	
	//-- #1537 смарт: Мосолов 26.12.2023
	
	//++#1547 смарт: Лопато 26.01.2024 //Автоматическое заполнение серий чернил в заказах
	Если Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		
		Если Пользователи.ЭтоПолноправныйПользователь() Тогда	

			НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременныйТоварыПоРаспоряжениям", Тип("ПолеФормы"), Форма.Элементы.ТоварыПоРаспоряжениям); 
			НоваяКолонка.Заголовок = "Отгрузка без серии"; 
			НоваяКолонка.ПутьКДанным = "Объект.ТоварыПоРаспоряжениям.смартОтгрузкаБезСерииСлужебныйВременный"; 
			НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	 	 	НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерийТоварыПоРаспоряжениям");  

			НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременныйОтгружаемыеТовары", Тип("ПолеФормы"), Форма.Элементы.ОтгружаемыеТовары); 
			НоваяКолонка.Заголовок = "Отгрузка без серии"; 
			НоваяКолонка.ПутьКДанным = "Объект.ОтгружаемыеТовары.смартОтгрузкаБезСерииСлужебныйВременный"; 
			НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	 	 	НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерий");  
			
		КонецЕсли; 
		
	КонецЕсли; 
	//--#1547 смарт: Лопато 26.01.2024
	
	//++#1626 смарт: Лопато 06.02.2024 //Справочник Номенклатура. Обнулить связи параметров выбора для Марка.  
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Форма.Элементы.Марка.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
		
	КонецЕсли;	
	//--#1626 смарт: Лопато 06.02.2024   
	
	//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей
	Если Форма.ИмяФормы = "Документ.ЗаказНаСборку.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.СборкаТоваров.Форма.ФормаДокумента" Тогда 
		
		Если Форма.ИмяФормы = "Документ.ЗаказНаСборку.Форма.ФормаДокумента" Тогда 
			
			//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
			
			Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
				НовыйЭлемент.ТолькоПросмотр = Истина;
			КонецЕсли;
			
		Иначе
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
			//-- #Б1376 смарт: Шляпников 19.11.2024
			
			//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
			Если ЗначениеЗаполнено(Форма.Объект.ЗаказНаСборку) И НЕ РольДоступна("ПолныеПрава") Тогда
				НовыйЭлемент.ТолькоПросмотр = Истина;
			ИначеЕсли НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
				НовыйЭлемент.ТолькоПросмотр = Истина;
			КонецЕсли;
			//-- #Б1598 смарт: Шляпников 09.12.2024
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1646 смарт: Мосолов 20.02.2024 	

	//++ #1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
	Если Форма.ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		
		Форма.Элементы.ПроцентРучнойСкидки.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Форма.Элементы.ПроцентРучнойСкидки.Подсказка = "Изменение ограничений ручной скидки в соглашении 
													   |ни на что не влияет, используется общее ограничение ручной скидки, 
													   |которое устанавливает администратор по согласованию с коммерческим директором.";
	
	КонецЕсли;
	//-- #1356 смарт: Лопато 14.06.2024   
	
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику
	Если Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		
		МассивРеквизитов = Новый Массив; 
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("НадписьДокументыОснования", Новый ОписаниеТипов("Строка")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартКонтрагентКешированноеЗначение", Новый ОписаниеТипов("СправочникСсылка.Контрагенты")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("СписокПредзаказов", Новый ОписаниеТипов("СписокЗначений")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("НеВыполнятьПроверкуСопоставленнойНоменклатурыПоставщика", 
		Новый ОписаниеТипов("Булево"), 
		"", 
		"Не выполнять проверку сопоставленной номенклатуры поставщика")); 
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов);   
		
		НоваяГруппаОснования = Форма.Элементы.Вставить("Основания", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновное, Форма.Элементы.ГруппаШапка);
		НоваяГруппаОснования.Вид = ВидГруппыФормы.Страницы;
		НоваяГруппаОснования.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет; 
		
		НоваяГруппа = Форма.Элементы.Добавить("ГруппаОснование", Тип("ГруппаФормы"), НоваяГруппаОснования);
		НоваяГруппа.Вид = ВидГруппыФормы.Страница;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;  
		
		НовыйЭлемент = Форма.Элементы.Добавить("ДокументОснование", Тип("ПолеФормы"), НоваяГруппа);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.ПутьКданным = "Объект.ДокументОснование";
		
		НоваяГруппа = Форма.Элементы.Добавить("ГруппаОснования", Тип("ГруппаФормы"), НоваяГруппаОснования);
		НоваяГруппа.Вид = ВидГруппыФормы.Страница; 
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.ОтображатьЗаголовок = Истина;  
		
		НовыйЭлемент = Форма.Элементы.Добавить("ДокументыОснования", Тип("ПолеФормы"), НоваяГруппа); 
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = "Основания";
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.ПутьКданным = "Объект.ДокументОснование";
	 	НовыйЭлемент.УстановитьДействие("Нажатие", "смарт_ДокументыОснованияНажатиеВместо"); 
		
		НоваяГруппаГруз = Форма.Элементы.Вставить("ГруппаГруз", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновное, Форма.Элементы.ГруппаИндексыСПАРКРиски);
		НоваяГруппаГруз.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаГруз.ОтображатьЗаголовок = Ложь; 
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		
		НовыйЭлемент = Форма.Элементы.Добавить("Груз", Тип("ПолеФормы"), НоваяГруппаГруз);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКданным = "Объект.Груз";
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смарт_ГрузПриИзменении"); 
		
		НоваяДекорация = Форма.Элементы.Добавить("ДекорацияГруз", Тип("ДекорацияФормы"), НоваяГруппа); 
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.Заголовок = "";
		НоваяДекорация.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,, Истина); 
		
		НоваяГруппаСПАРК = Форма.Элементы.Добавить("ГруппаРазрешениеСПАРКРисков", Тип("ГруппаФормы"), Форма.Элементы.ГруппаИндексыСПАРКРиски);
		НоваяГруппаСПАРК.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаСПАРК.ОтображатьЗаголовок = Ложь; 
		НоваяГруппаСПАРК.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартПроводитьДокументПриВысокомСПАРКРиске", Тип("ПолеФормы"), НоваяГруппаСПАРК);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКданным = "Объект.смартПроводитьДокументПриВысокомСПАРКРиске";
        НовыйЭлемент.Заголовок = "Разрешаю проведение";
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смарт_смартПроводитьДокументПриВысокомСПАРКРискеПриИзмененииВместо"); 
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОтветственныйЗаСПАРКРиски", Тип("ПолеФормы"), НоваяГруппаСПАРК);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКданным = "Объект.смартОтветственныйЗаСПАРКРиски";
        НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.ТолькоПросмотр = Истина;
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смарт_смартПроводитьДокументПриВысокомСПАРКРискеПриИзмененииВместо");
		
		НоваяКолонка = Форма.Элементы.Вставить("ТоварысмартПредзаказПоставщику", Тип("ПолеФормы"), Форма.Элементы.Товары, Форма.Элементы.ТоварыГруппаОтменено); 
		НоваяКолонка.Заголовок = "Предзаказ"; 
		НоваяКолонка.ПутьКДанным = "Объект.Товары.смартПредзаказПоставщику"; 
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;  
		НоваяКолонка.КнопкаОткрытия = Истина;  
	 	НоваяКолонка.УстановитьДействие("НачалоВыбора", "смарт_ТоварысмартПредзаказПоставщикуНачалоВыбораПосле");
		
		// Фролов+   
		Форма.Элементы.ТоварысмартПредзаказПоставщику.КнопкаВыбора = РольДоступна("ПолныеПрава");
		Форма.Элементы.смартПроводитьДокументПриВысокомСПАРКРиске.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартНеПроверятьСПАРКРиски");
		// Фролов-
		
	КонецЕсли;
	//-- #1671 смарт: Мосолов 18.03.2024     
	
	//++ #1686 смарт: Мосолов 02.04.2024 // Создать механизм ручного резервирования товаров (временного вывода из оборота)
	Если Форма.ИмяФормы = "Документ.КорректировкаРегистров.Форма.ФормаДокумента" Тогда  
		
		Если Форма.Объект.смартВыводТоваровИзОборота И НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда  
			
			Форма.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1686 смарт: Мосолов 02.04.2024   
	
	//++ #1766 смарт: Мосолов 09.04.2024 //Создать предварительный шаг по контролю созданных документов в БП при отгрузке
	Если Форма.ИмяФормы = "Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента" Тогда  
		
		// Команда
		смартСформироватьПакетДокументовКоманда = Форма.Команды.Добавить("смартСформироватьПакетДокументов");
		смартСформироватьПакетДокументовКоманда.Действие = "смартСформироватьПакетДокументовНажатие";
		смартСформироватьПакетДокументовКоманда.Подсказка = "Сформировать ТН и Заявку на машину, сохранить в каталог Адмирал, отправить на почту";
		
		// Кнопка 
		смартСформироватьПакетДокументов = Форма.Элементы.Добавить("смартСформироватьПакетДокументов", Тип("КнопкаФормы"), Форма.Элементы.ПодменюПечать);
		смартСформироватьПакетДокументов.ИмяКоманды = "смартСформироватьПакетДокументов";
		смартСформироватьПакетДокументов.Заголовок = "Сформировать пакет документов Адмирал (смарт)";
		смартСформироватьПакетДокументов.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
		
		//++ #Б3836 смарт: Шляпников 16.07.2025 / Интеграция с WMS. Атлант. Отгрузка. Дополнение.
		смартСформироватьПакетДокументовКоманда = Форма.Команды.Добавить("смартСформироватьПакетДокументовАтлант");
		смартСформироватьПакетДокументовКоманда.Действие = "смартСформироватьПакетДокументовНажатие";
		смартСформироватьПакетДокументовКоманда.Подсказка = "Сформировать ТН и Заявку на машину, сохранить в каталог Атлант, отправить на почту";
		
		смартСформироватьПакетДокументов = Форма.Элементы.Добавить("смартСформироватьПакетДокументовАтлант", Тип("КнопкаФормы"), Форма.Элементы.ПодменюПечать);
		смартСформироватьПакетДокументов.ИмяКоманды = "смартСформироватьПакетДокументовАтлант";
		смартСформироватьПакетДокументов.Заголовок = "Сформировать пакет документов Атлант (смарт)";
		смартСформироватьПакетДокументов.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартВидСкладаПриФормированииПакета", ОбщегоНазначения.ОписаниеТипаСтрока(30)));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		//-- #Б3836 смарт: Шляпников 16.07.2025    
		
		//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
		смартФормированиеИнтерфейса.СздПоле(Форма, "МаршрутВесБрутто", "Маршрут", "Вес брутто, кг", 1, "Объект.Маршрут.ВесБрутто",,, "МаршрутОбъем");
		//-- #Б4398 смарт: Шляпников 02.10.2025

	КонецЕсли;
	//-- #1766 смарт: Мосолов 09.04.2024 

	//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
	Если Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" 
		//++#1800 смарт: Лопато 03.05.2024 //Доработка перемещение товара (продолжение 1775) серийный учет чернил  
		Или Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" 
		//--#1800 смарт: Лопато 03.05.2024
		//++#2000 смарт: Лопато 23.08.2024 //Доработка оприходование излишков товара (продолжение 1800) серийный учет чернил  
		Или Форма.ИмяФормы = "Документ.ОприходованиеИзлишковТоваров.Форма.ФормаДокумента" 
		//--#2000 смарт: Лопато 23.08.2024
		//++#2052 смарт: Лопато 16.09.2024 //Доработка документа ВнутреннееПотреблениеТоваров (продолжение 2000) серийный учет чернил
		Или Форма.ИмяФормы = "Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента"
		//--#2052 смарт: Лопато 16.09.2024
		Или Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
		
		Если Пользователи.ЭтоПолноправныйПользователь() Тогда	

			Если Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" Тогда
				
				НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременный", Тип("ПолеФормы"), Форма.Элементы.ВозвращаемыеТовары); 
				НоваяКолонка.Заголовок = "Без серии"; 
				НоваяКолонка.ПутьКДанным = "Объект.ВозвращаемыеТовары.смартОтгрузкаБезСерииСлужебныйВременный"; 
				НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
		 	 	НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерийВСтроке");  
				
			ИначеЕсли Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
				
				НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременный", Тип("ПолеФормы"), Форма.Элементы.Товары); 
				НоваяКолонка.Заголовок = "Без серии"; 
				НоваяКолонка.ПутьКДанным = "Объект.Товары.смартОтгрузкаБезСерииСлужебныйВременный"; 
				НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
				НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерийТовары");  

			ИначеЕсли Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
				
				НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременный", Тип("ПолеФормы"), Форма.Элементы.Товары); 
				НоваяКолонка.Заголовок = "Без серии"; 
				НоваяКолонка.ПутьКДанным = "Объект.Товары.смартОтгрузкаБезСерииСлужебныйВременный"; 
				НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
				НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерий");  

			//++#1800 смарт: Лопато 03.05.2024 //Доработка перемещение товара (продолжение 1775) серийный учет чернил  
			ИначеЕсли Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
				
				НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременный", Тип("ПолеФормы"), Форма.Элементы.Товары); 
				НоваяКолонка.Заголовок = "Без серии"; 
				НоваяКолонка.ПутьКДанным = "Объект.Товары.смартОтгрузкаБезСерииСлужебныйВременный"; 
				НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
				НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерийТовары");  
			//--#1800 смарт: Лопато 03.05.2024

			//++#2000 смарт: Лопато 23.08.2024 //Доработка оприходование излишков товара (продолжение 1800) серийный учет чернил
			ИначеЕсли Форма.ИмяФормы = "Документ.ОприходованиеИзлишковТоваров.Форма.ФормаДокумента" Тогда
				
				НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременный", Тип("ПолеФормы"), Форма.Элементы.Товары); 
				НоваяКолонка.Заголовок = "Без серии"; 
				НоваяКолонка.ПутьКДанным = "Объект.Товары.смартОтгрузкаБезСерииСлужебныйВременный"; 
				НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
				НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерийТовары");  
			//--#2000 смарт: Лопато 23.08.2024

			//++#2052 смарт: Лопато 16.09.2024 //Доработка документа ВнутреннееПотреблениеТоваров (продолжение 2000) серийный учет чернил
			ИначеЕсли Форма.ИмяФормы = "Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента" Тогда
				
				НоваяКолонка = Форма.Элементы.Добавить("смартОтгрузкаБезСерииСлужебныйВременный", Тип("ПолеФормы"), Форма.Элементы.Товары); 
				НоваяКолонка.Заголовок = "Без серии"; 
				НоваяКолонка.ПутьКДанным = "Объект.Товары.смартОтгрузкаБезСерииСлужебныйВременный"; 
				НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
				НоваяКолонка.УстановитьДействие("ПриИзменении", "смартЗаполнитьСтатусыУказанияСерийТовары");  
			//--#2052 смарт: Лопато 16.09.2024
			
			КонецЕсли;	
			
		КонецЕсли; 
		
	КонецЕсли; 
	//--#1775 смарт: Лопато 12.04.2024
	
	//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
	Если Форма.ИмяФормы = "Справочник.ПретензииКлиентов.Форма.ФормаЭлемента" Тогда  
		
		НоваяГруппа = Форма.Элементы.Вставить("смартСтраницаТовары", Тип("ГруппаФормы"), Форма.Элементы.ГруппаСтраницы, Форма.Элементы.СтраницаДополнительнаяИнформация);
		НоваяГруппа.Вид = ВидГруппыФормы.Страница; 
		НоваяГруппа.ОтображатьЗаголовок = Истина;  
		НоваяГруппа.Заголовок = "Товары";  
		НоваяГруппа.ПутьКДаннымЗаголовка = "Объект.смартТовары.КоличествоСтрок";  
		
		НоваяТаблица = Форма.Элементы.Добавить("смартТовары", Тип("ТаблицаФормы"), НоваяГруппа);
		НоваяТаблица.ПутьКДанным = "Объект.смартТовары";  
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартТоварыНомерСтроки", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТовары.НомерСтроки";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартТоварыАртикул", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТовары.Номенклатура.Артикул"; 
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартТоварыНоменклатура", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТовары.Номенклатура"; 
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартТоварыНоменклатураПриИзменении");
	 	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "смартТоварыНоменклатураНачалоВыбора");
		
		//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
		НовыйЭлемент = Форма.Элементы.Добавить("смартТоварыХарактеристика", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТовары.Характеристика";
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартТоварыХарактеристикаПриИзменении");
	 	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "смартТоварыХарактеристикаНачалоВыбора");
		//-- #Б2802 смарт: Шляпников 15.04.2025
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартТоварыСерия", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТовары.Серия";
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартТоварыСерияПриИзменении");
	 	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "смартТоварыСерияНачалоВыбора");

		НовыйЭлемент = Форма.Элементы.Добавить("смартТоварыКоличество", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТовары.Количество";
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартТоварыКоличествоПриИзменении");
		
		//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
		НоваяКоманда = Форма.Команды.Добавить("смартПодборТоваров");
		НоваяКоманда.Заголовок = "Подобрать товары из заказа";
		НоваяКоманда.Действие = "смартПодборТоваров";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартПодборТоваров", Тип("КнопкаФормы"), Форма.Элементы.смартТоварыКоманднаяПанель);
		НовыйЭлемент.Заголовок = "Подобрать товары из заказа";
		НовыйЭлемент.ИмяКоманды = "смартПодборТоваров";
		
		Если Форма.Объект.Статус = Перечисления.СтатусыПретензийКлиентов.Удовлетворена
			И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
			
			Форма.ТолькоПросмотр = Истина;
			Форма.Элементы.смартПодборТоваров.Доступность = Ложь;
			
		ИначеЕсли Форма.Объект.Статус = Перечисления.СтатусыПретензийКлиентов.Обрабатывается
			И НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРуководительCRM") Тогда
			
			Форма.ТолькоПросмотр = Истина;
			Форма.Элементы.смартПодборТоваров.Доступность = Ложь;
			
		ИначеЕсли Форма.Объект.Статус = Перечисления.СтатусыПретензийКлиентов.НеУдовлетворена
			И НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРуководительCRM") Тогда
			
			Форма.ТолькоПросмотр = Истина;
			Форма.Элементы.смартПодборТоваров.Доступность = Ложь;
			
		КонецЕсли;
		
		//-- #Б2802 смарт: Шляпников 15.04.2025
		
		//++ #Б3202 смарт: Шляпников 24.06.2025 / Претензия клиента. Возврат товара.
		Форма.Элементы.Статус.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартРазрешеноМенятьАктивностьПричинВозникновенияПретензийИСтатусПретензий");
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартТелефонКонтактногоЛица", Тип("ПолеФормы"), Форма.Элементы.ПартнерыИКонтактныеЛица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ПартнерыИКонтактныеЛица.смартТелефонКонтактногоЛица";
		НовыйЭлемент.РежимВыбораИзСписка = Истина;
		Форма.Элементы.Переместить(НовыйЭлемент, Форма.Элементы.ПартнерыИКонтактныеЛица, Форма.Элементы.ПартнерыИКонтактныеЛицаРольКонтактногоЛица);
		
		Форма.Элементы.ПартнерыИКонтактныеЛицаКонтактноеЛицо.УстановитьДействие("ПриИзменении", "смартКонтактноеЛицоПриИзменении");
		Форма.Элементы.ПартнерыИКонтактныеЛица.УстановитьДействие("ПриНачалеРедактирования", "смартПартнерыИКонтактныеЛицаПриНачалеРедактирования");
		Форма.Элементы.ПричинаВозникновения.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		//-- #Б3202 смарт: Шляпников 24.06.2025
		
	КонецЕсли;
	//-- #1844 смарт: Мосолов 10.06.2024
	
	//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
	Если Форма.ИмяФормы = "Справочник.ПричиныВозникновенияПретензий.Форма.ФормаЭлемента" Тогда  
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартОбязательноеУказаниеТоваров", Тип("ПолеФормы"), Форма);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартОбязательноеУказаниеТоваров"; 
		
		//++ #Б3202 смарт: Шляпников 24.06.2025 / Претензия клиента. Возврат товара.
		НовыйЭлемент = Форма.Элементы.Добавить("смартТребуетсяВозвратТоваров", Тип("ПолеФормы"), Форма);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартТребуетсяВозвратТоваров";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартАктивна", Тип("ПолеФормы"), Форма);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартАктивна";
		НовыйЭлемент.Доступность = Пользователи.РолиДоступны("ПолныеПрава,смартРазрешеноМенятьАктивностьПричинВозникновенияПретензийИСтатусПретензий");
		//-- #Б3202 смарт: Шляпников 24.06.2025
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.ПричиныВозникновенияПретензий.Форма.ФормаВыбора" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "Ссылка.смартАктивна", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	//-- #Б2802 смарт: Шляпников 15.04.2025
	
	//++ #1918 смарт: Шляпников 23.09.2024 / Настройка синхронизации УТ-БП при закупке товаров по гарантии, ИТСМ 1918
	Если Форма.ИмяФормы = "ПланВидовХарактеристик.СтатьиРасходов.Форма.ФормаЭлемента" Тогда  
		Форма.Элементы.КорреспондирующийСчет.Маска = "99.99.@";
	КонецЕсли;
	//++ #1918 смарт: Шляпников 23.09.2024
	
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
	Если Форма.ИмяФормы = "Документ.ПоступлениеБезналичныхДенежныхСредств.Форма.ФормаДокумента" Тогда  
		
		НовыйЭлемент = Форма.Элементы.Добавить("смарт_ОплаченоЧерезКассуБанка", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительныеРеквизитыШапки);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смарт_ОплаченоЧерезКассуБанка"; 
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смарт_смарт_ОплаченоЧерезКассуБанкаПриИзмененииПосле"); 
		
		НовыйЭлемент = Форма.Элементы.Добавить("РасшифровкаБезРазбиенияКурс", Тип("ПолеФормы"), Форма.Элементы.ГруппаСуммаВзаиморасчетов);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Элементы.РасшифровкаПлатежа.ТекущиеДанные.смартКурсДокумента"; 
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "РасшифровкаПлатежаКурсПриИзменении"); 
		
		НовыйЭлемент = Форма.Элементы.Вставить("РасшифровкаПлатежаКурс", Тип("ПолеФормы"), Форма.Элементы.РасшифровкаПлатежа, Форма.Элементы.РасшифровкаПлатежаСтавкаНДС);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.РасшифровкаПлатежа.смартКурсДокумента"; 
	 	НовыйЭлемент.УстановитьДействие("ПриИзменении", "РасшифровкаПлатежаКурсПриИзменении"); 
		
		Форма.Элементы.РасшифровкаПлатежаСумма.УстановитьДействие("ОбработкаВыбора", "смарт_РасшифровкаПлатежаСуммаОбработкаВыбораПеред");
		Форма.Элементы.РасшифровкаПлатежаСумма.УстановитьДействие("АвтоПодбор", "смарт_РасшифровкаПлатежаСуммаАвтоПодборПеред");
		
	КонецЕсли;	
	//-- #Б-960 смарт: Мосолов 23.09.2024 
	
	//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		
		Если ЗначениеЗаполнено(Форма.Объект.ИНН) Тогда

			Попытка
			
				смартИнтеграцияDaData.ВывестиНаФормуИнформациюПоКонтрагенту(Форма.Объект.ИНН, Форма);

			Исключение

				ТекстСообщения = "Возникла ошибка при запросе данных контрагента из сервиса DaData по ИНН: " 
								 + Форма.Объект.ИНН + Символы.ПС + ОписаниеОшибки();
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

				ЗаписьЖурналаРегистрации("Ошибка при выводе информации из DaData", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			
			КонецПопытки
			
		КонецЕсли;	
		
	 	Форма.Элементы.ИННИностранногоКонтрагента.УстановитьДействие("ПриИзменении", "смарт_ПриИзмененииИНННеРезидент"); 
		
	КонецЕсли;	
	//-- #Б-1018 смарт: Лопато 07.10.2024
	
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	Если Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.Организации);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
		Если ЗначениеЗаполнено(Форма.Объект.ЗаказНаПеремещение) И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		//-- #Б1598 смарт: Шляпников 09.12.2024
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЗаказНаВнутреннееПотребление.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПрочееОприходованиеТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование) И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		//-- #Б1598 смарт: Шляпников 09.12.2024
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ОрдерНаОтражениеНедостачТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ГруппаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ОрдерНаОтражениеПересортицыТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ГруппаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ОрдерНаОтражениеПорчиТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ГруппаИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПересчетТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаЛево);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если ЗначениеЗаполнено(Форма.Объект.ДокументПоступления) И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	//++ #Б2578 смарт: Шляпников 24.06.2025 / Добавить признак гарантийных запчастей в документы Оприходование излишков/Списание недостач/Пересотрица товаров
	Если Форма.ИмяФормы = "Документ.ОрдерНаОтражениеИзлишковТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.Шапка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.СписаниеНедостачТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПересортицаТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ШапкаПраво);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;  
	
	//++ #5716 смарт: Тимофеева 11.02.26 / Документ Корректировка назначения товаров. Добавить признак гарантийных запчастей. Раздельный учет товаров.
	Если Форма.ИмяФормы = "Документ.КорректировкаНазначенияТоваров.Форма.ФормаДокумента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитыПраваяКолонка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
		
		Если НЕ РольДоступна("смартГарантийныеЗапчастиРедактирование") И НЕ РольДоступна("ПолныеПрава") Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	//-- #5716 смарт: Тимофеева 11.02.26
	
	//-- #Б2578 смарт: Шляпников 24.06.2025
	
	//++ #1834 смарт: Шляпников 09.01.2025 / Интеграция с WMS. Загрузка приходных ордеров.
	Если Форма.ИмяФормы = "Обработка.УправлениеПоступлением.Форма.Форма" Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("смартЗагрузитьОрдераИзАдмирал");
		НоваяКоманда.Заголовок = "Загрузить ордера из Адмирала";
		НоваяКоманда.Действие = "смартЗагрузитьОрдераИзАдмирал";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗагрузитьОрдераИзАдмирал", Тип("КнопкаФормы"), Форма.Элементы.ГруппаРаспоряженияКоманднаяПанель);
		НовыйЭлемент.Заголовок = "Загрузить ордера из Адмирала";
		НовыйЭлемент.ИмяКоманды = "смартЗагрузитьОрдераИзАдмирал";
		НовыйЭлемент.Видимость = (Форма.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение);
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Обработка.УправлениеОтгрузкой.Форма.Форма" Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("смартЗагрузитьОрдераИзАдмирал");
		НоваяКоманда.Заголовок = "Загрузить ордера из Адмирала";
		НоваяКоманда.Действие = "смартЗагрузитьОрдераИзАдмирал";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗагрузитьОрдераИзАдмирал", Тип("КнопкаФормы"), Форма.Элементы.ГруппаКоманднаяПанельРаспоряженияНаОтгрузку);
		НовыйЭлемент.Заголовок = "Загрузить ордера из Адмирала";
		НовыйЭлемент.ИмяКоманды = "смартЗагрузитьОрдераИзАдмирал";
		НовыйЭлемент.Видимость = (Форма.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение);
		
	КонецЕсли;
	//-- #1834 смарт: Шляпников 09.01.2025

	//++ #Б-2214 смарт: Лопато 07.02.2025 //Наименование веса в карточке номенклатуры  
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда

		Форма.Элементы.ВесИспользовать.Заголовок = "Вес (нетто)";
		
	КонецЕсли;
	//-- #Б-2214 смарт: Лопато 07.02.2025
	
	//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
	Если Форма.ИмяФормы = "Справочник.Назначения.Форма.ФормаЭлемента" Тогда
		
		//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка 
		
		Если Форма.Объект.ТипНазначения = Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота Тогда
			
			СвойстваНовогоЭлемента = Новый Структура;
			СвойстваНовогоЭлемента.Вставить("АвтомаксимальнаяШирина", Ложь);
			СвойстваНовогоЭлемента.Вставить("ТолькоПросмотр", Истина);	
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартПричинаВыводаИзОборота", Форма,, 1, "Объект.смартПричинаВыводаИзОборота", СвойстваНовогоЭлемента);
			
			Если Форма.Объект.смартПричинаВыводаИзОборота = Перечисления.смартПричиныВыводаТоваровИзОборота.Другое Тогда				
				СвойстваНовогоЭлемента = Новый Структура;
				СвойстваНовогоЭлемента.Вставить("АвтомаксимальнаяШирина", Ложь);
				СвойстваНовогоЭлемента.Вставить("ТолькоПросмотр", Истина);				
				смартФормированиеИнтерфейса.СздПоле(Форма, "смартУточнениеПричиныВыводаИзОборота", Форма,, 1, "Объект.смартУточнениеПричиныВыводаИзОборота", СвойстваНовогоЭлемента);
			КонецЕсли;
			
			Форма.Элементы.НаправлениеДеятельности.Видимость = Ложь;
			Форма.Элементы.Партнер.Видимость = Ложь;
            Форма.Элементы.Договор.Видимость = Ложь;
			Форма.Элементы.ТипНазначения.Видимость = Ложь;
			Форма.Элементы.ВидДеятельностиНДС.Видимость = Ложь;
						
		Иначе
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудованиеТипНазначения", Тип("ПолеФормы"), Форма);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеТипНазначения";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудование", Тип("ПолеФормы"), Форма);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудование";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудованиеСерия", Тип("ПолеФормы"), Форма);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеСерия";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
			НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудованиеУзел", Тип("ПолеФормы"), Форма);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеУзел";
			НовыйЭлемент.ТолькоПросмотр = Истина;

		КонецЕсли; 	
				
		//НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудованиеТипНазначения", Тип("ПолеФормы"), Форма);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеТипНазначения";
		//НовыйЭлемент.ТолькоПросмотр = Истина;
		//
		//НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудование", Тип("ПолеФормы"), Форма);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудование";
		//НовыйЭлемент.ТолькоПросмотр = Истина;
		//
		//НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудованиеСерия", Тип("ПолеФормы"), Форма);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеСерия";
		//НовыйЭлемент.ТолькоПросмотр = Истина;
		//
		//НовыйЭлемент = Форма.Элементы.Добавить("смартРазобранноеОборудованиеУзел", Тип("ПолеФормы"), Форма);
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.ПутьКДанным = "Объект.смартРазобранноеОборудованиеУзел";
		//НовыйЭлемент.ТолькоПросмотр = Истина; 
		
		//-- #5030 смарт: Тимофеева 02.02.26

	КонецЕсли;
	//-- #Б2340 смарт: Шляпников 17.02.2025
	
	//++ #Б-2336 смарт: Лопато 26.02.2025 //Печатная форма приказа на выплату ДС подотчетнику в УТ  
	Если Форма.ИмяФормы = "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента" Тогда 
		
		НовыйЭлемент = Форма.Элементы.Вставить("смартГруппаПриказНаВыплатуДСПодотчетнику", Тип("ГруппаФормы"), Форма.Элементы.СтраницаОсновное);
		НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлемент.Заголовок = "Данные приказа на выплату ДС подотчетнику";

		НовыйЭлемент = Форма.Элементы.Вставить("смартГруппаПриказНаВыплатуДСПодотчетнику1", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику);
		НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НовыйЭлемент.ОтображатьЗаголовок = Ложь;
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартНомерПриказаПрефикс", Новый ОписаниеТипов("Строка")));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);   
		
		Форма.смартНомерПриказаПрефикс = Документы.ЗаявкаНаРасходованиеДенежныхСредств.смартПолучитьПрефиксДатыПриказаНаВыплатуДСПодотчетнику(Форма.Объект.Ссылка);
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартНомерПриказаПрефикс", Тип("ПолеФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику1);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "смартНомерПриказаПрефикс";
		НовыйЭлемент.Заголовок = "Номер приказа";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		НовыйЭлемент.ТолькоПРосмотр = Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь; 
		НовыйЭлемент.МаксимальнаяШирина = 8; 
		НовыйЭлемент.Ширина = 8; 
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		
		НоваяДекорация = Форма.Элементы.Добавить("ДекорацияГруз", Тип("ДекорацияФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику1); 
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.Заголовок = "-";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартНомерПриказа", Тип("ПолеФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику1);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартНомерПриказа";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь; 
		НовыйЭлемент.МаксимальнаяШирина = 15; 
		НовыйЭлемент.Ширина = 15; 
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартГородКомандировки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику1);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартГородКомандировки";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;

		НовыйЭлемент = Форма.Элементы.Добавить("смартДатыКомандировки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику1);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартДатыКомандировки";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;

		НовыйЭлемент = Форма.Элементы.Вставить("смартГруппаПриказНаВыплатуДСПодотчетнику2", Тип("ГруппаФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику);
		НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НовыйЭлемент.ОтображатьЗаголовок = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартПрочаяИнформация", Тип("ПолеФормы"), Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику2);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартПрочаяИнформация";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь; 
		НовыйЭлемент.МаксимальнаяШирина = 110; 
		НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь; 
		НовыйЭлемент.МаксимальнаяВысота = 2; 
		
		//++ #Б-2610 смарт: Лопато 07.03.2025 //Поля для приказа на выплату ДС подотчетнику в заявке на расходование ДС сделать только для одной операции.  
		Форма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику.Видимость 
			= Форма.Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику;
		//-- #Б-2610 смарт: Лопато 07.03.2025
		
	КонецЕсли;	
 	//-- #Б-2336 смарт: Лопато 26.02.2025

	//++ #Б-2768 смарт: Лопато 21.03.2025 //Заполнение корректного срока гарантии на оборудование и ПГ при формировании ПНР.  
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда

		НовыйЭлемент = Форма.Элементы.Вставить("смартГруппаГарантия", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОписания);
		НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлемент.ОтображатьЗаголовок = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартГарантияНаОборудование", Тип("ПолеФормы"), Форма.Элементы.смартГруппаГарантия);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартГарантияНаОборудование";

		НовыйЭлемент = Форма.Элементы.Добавить("смартГарантияНаПечатающиеГоловки", Тип("ПолеФормы"), Форма.Элементы.смартГруппаГарантия);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартГарантияНаПечатающиеГоловки";
		
	КонецЕсли;	
	//-- #Б-2768 смарт: Лопато 21.03.2025

	//++ #Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.  
	РазрешеноИзменениеШаблонаБрэнда = Пользователи.РолиДоступны("ДобавлениеИзменениеНоменклатуры");
	
	//++ #4994 смарт: Тимофеева 17.11.2025 / Номенклатура. Форма элемента. Права доступа для юристов.
	РазрешеноИзменениеШаблонаБрэндаЮристам = Пользователи.РолиДоступны("смартОтветственныйЗаПодписаниеДоговора");
	//-- #4994 смарт: Тимофеева 17.11.2025
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартШаблонБрэнда", Тип("ПолеФормы"), Форма.Элементы.ГруппаОписания);
		НовыйЭлемент.Заголовок = "Шаблон брэнда договора (смарт)";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартШаблонБрэнда";
		НовыйЭлемент.ТолькоПросмотр = НЕ РазрешеноИзменениеШаблонаБрэнда;
        //++ #4994 смарт: Тимофеева 17.11.2025 / Номенклатура. Форма элемента. Права доступа для юристов.
		НовыйЭлемент.Заголовок = "Шаблон бренда договора (смарт)";
        НовыйЭлемент.ТолькоПросмотр = НЕ РазрешеноИзменениеШаблонаБрэнда И НЕ РазрешеноИзменениеШаблонаБрэндаЮристам;
		//-- #4994 смарт: Тимофеева 17.11.2025
		
		//++ #Б-3594 смарт: Лопато 25.06.2025 //Номенклатура. Форма элемента. Права доступа.  
		Форма.Элементы.смартГарантияНаОборудование.ТолькоПросмотр 	   = НЕ РазрешеноИзменениеШаблонаБрэнда;
		Форма.Элементы.смартГарантияНаПечатающиеГоловки.ТолькоПросмотр = НЕ РазрешеноИзменениеШаблонаБрэнда;
		Форма.Элементы.СтранаПроисхождения.ТолькоПросмотр 			   = НЕ РазрешеноИзменениеШаблонаБрэнда;
		//-- #Б-3594 смарт: Лопато 25.06.2025
		
	КонецЕсли;	

	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаГруппы" Тогда

		НовыйЭлемент = Форма.Элементы.Добавить("смартШаблонБрэнда", Тип("ПолеФормы"));
		НовыйЭлемент.Заголовок = "Шаблон брэнда договора (смарт)";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартШаблонБрэнда";
		НовыйЭлемент.ТолькоПросмотр = НЕ РазрешеноИзменениеШаблонаБрэнда;

	КонецЕсли;	
	//-- #Б-3164 смарт: Лопато 20.05.2025
	
	//++ #4086 смарт: Тимофеева 25.08.2025 / Маркировка радиоэлектронной продукции. Новый реквизит-иконка Честный знак в документах. 
	Если Лев(Форма.ИмяФормы, 8) = "Документ" 
		И НЕ Форма.Элементы.Найти("Товары") = Неопределено И ТипЗнч(Форма.Элементы["Товары"]) = Тип("ТаблицаФормы") 
		И НЕ Форма.Элементы.Найти("ТоварыНоменклатура") = Неопределено И ТипЗнч(Форма.Элементы["ТоварыНоменклатура"]) = Тип("ПолеФормы")
		Тогда
		
		//++ #Б4664 смарт: Шляпников 17.11.2025 / Маркировка радиоэлектронной продукции. Ожидаемые Поступления Гарантийных Запчастей.
		смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(Форма);
		//-- #Б4664 смарт: Шляпников 17.11.2025
		
	КонецЕсли;
	//-- #4086 смарт: Тимофеева 25.08.2025
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСписка" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма,
																			 "ДокументЗаказКлиента", 
																			 "ИЗ Документ.ЗаказКлиента КАК ДокументЗаказКлиента", 
																			 " *");
																			 
	ИначеЕсли Форма.ИмяФормы = "Документ.СчетФактураВыданный.Форма.ФормаДокумента" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(Форма, Истина, "Контрагент");
		смартСервер.УстановитьОтображениеПризнакаВИП(Форма, Форма.Объект.Партнер);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ПретензииКлиентов.Форма.ФормаСписка" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма,
																			 "СправочникПретензииКлиентов", 
																			 "ИЗ Справочник.ПретензииКлиентов КАК СправочникПретензииКлиентов", 
																			 " *"
																			 ,,,, "Партнер");
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ПретензииКлиентов.Форма.ФормаЭлемента" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(Форма, Истина, "Партнер");
		смартСервер.УстановитьОтображениеПризнакаВИП(Форма, Форма.Объект.Партнер);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаСпискаИндивидуальныхСоглашений" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма,
																		 "СправочникСоглашенияСКлиентами", 
																		 "Справочник.СоглашенияСКлиентами КАК СправочникСоглашенияСКлиентами", 
																		 "СправочникСоглашенияСКлиентами.Ссылка                  КАК Ссылка,",
																		 "Список",
																		 ,
																		 Ложь,
																		 "СписокПартнер");
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(Форма, Истина, "Партнер");
		смартСервер.УстановитьОтображениеПризнакаВИП(Форма, Форма.Объект.Партнер);
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаСпискаДокументов" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма,
																		 "ДокументЗаявка", 
																		 "Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДокументЗаявка", 
																		 "ДокументЗаявка.Ссылка                       КАК Ссылка,",
																		 "Список",
																		 ,
																		 Ложь,
																		 "СписокПартнер");
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(Форма, Истина, "Партнер");
		смартСервер.УстановитьОтображениеПризнакаВИП(Форма, Форма.Объект.Партнер);
		
	ИначеЕсли Форма.ИмяФормы = "Документ.СчетНаОплатуКлиенту.Форма.ФормаСписка" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма,
																		 "СчетНаОплатуКлиенту", 
																		 "Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту", 
																		 "СчетНаОплатуКлиенту.Ссылка                       КАК Ссылка,",
																		 "Список",
																		 ,
																		 Ложь,
																		 "СписокПартнер");
		
	ИначеЕсли Форма.ИмяФормы = "Документ.СчетНаОплатуКлиенту.Форма.ФормаДокумента" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(Форма, Истина, "Партнер");
		смартСервер.УстановитьОтображениеПризнакаВИП(Форма, Форма.Объект.Партнер);
		
	ИначеЕсли Форма.ИмяФормы = "Документ.СчетФактураВыданный.Форма.ФормаСпискаДокументов" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма,
																		 "ДанныеКОформлению", 
																		 ") КАК ДанныеКОформлению", 
																		 "ДанныеКОформлению.Ссылка КАК Ссылка,",
																		 "СписокСчетовФактурыНаОформление",
																		 ,
																		 Ложь,
																		 "СписокСчетовФактурыНаОформлениеПартнер");
		
	КонецЕсли;
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #Б4754 смарт: Шляпников 28.10.2025 / Справочник Договоры Контрагентов. Добавить новые реквизиты. 
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаСписка"
		ИЛИ Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаСпискаПродажи"
		ИЛИ Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаСпискаЗакупки"
		ИЛИ Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора" Тогда
		
		смартОбщегоНазначения.СоздатьЭлементыНаличияФайловДляФормСпискаДоговоров(Форма);
		смартФормированиеИнтерфейса.СздПоле(Форма, "СписоксмартВидДоговораСервисногоОтдела", "Список",, 1, "Список.Ссылка.смартВидДоговораСервисногоОтдела");
		
	КонецЕсли;
	//-- #Б4754 смарт: Шляпников 28.10.2025
	
	//++ #6212 смарт: Тимофеева 25.03.2026 / Перевод запчастей на серийный учет. Изменение логики формирования Приходного ордера.
	Если Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		Если ТипЗнч(Форма.Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение")
			И смартСервер.ЭтоСкладФизическогоЛица(Форма.Объект.Отправитель)
			И НЕ смартСервер.ЭтоСкладФизическогоЛица(Форма.Объект.Склад) Тогда
			
			смартФормированиеИнтерфейса.СоздатьКоманду(Форма, "смартЗаполнитьПоРаспоряжению", "Заполнить по распоряжению", "смартЗаполнитьПоРаспоряжению");
			смартФормированиеИнтерфейса.СздКнопка(Форма, "смартЗаполнитьПоРаспоряжению", "ЗаполнитьПоРаспоряжению",, "смартЗаполнитьПоРаспоряжению", 1, Новый Структура);
		
		КонецЕсли;
	КонецЕсли;
	//-- #6212 смарт: Тимофеева 25.03.2026

КонецПроцедуры

&После("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//++ смарт:ММ #030 210 05.03.2020 - добавление Причины возврата товаров
	Если Форма.ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.ВозвратТоваровОтКлиента.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.смартПричинаВозврата) 
			И ТекущийОбъект.Дата > Дата(2020, 03, 01) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить причину возврата", ТекущийОбъект.Ссылка, "смартПричинаВозврата", "Объект", Отказ);
		КонецЕсли;

	КонецЕсли;
	//-- смарт:ММ 05.03.2020

	//++#1316 смарт: Лопато 06.10.2023 //Запретить использование в документах подразделения другой организации  
	Если НЕ ТекущийОбъект.ОбменДанными.Загрузка 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
		И Форма.Объект.Свойство("Ссылка") Тогда
	
		ОбъектМетаданных = Форма.Объект.Ссылка.Метаданные();
		
		Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда

			Если ОбъектМетаданных.Реквизиты.Найти("Организация") <> Неопределено 
				И ОбъектМетаданных.Реквизиты.Найти("Подразделение") <> Неопределено Тогда
				
				ПодразделениеОбязательно = Ложь;
				
				Если ОбъектМетаданных.Имя = "ЗаказКлиента" 
					ИЛИ ОбъектМетаданных.Имя = "РеализацияТоваровУслуг" Тогда
					
					ПодразделениеОбязательно = Истина;
					
				КонецЕсли;	
				
				смартОбщегоНазначения.смартПроверитьОрганизациюПодразделения(Отказ, ТекущийОбъект.Подразделение, ТекущийОбъект.Организация, ПодразделениеОбязательно);
				
			КонецЕсли;

			Для Каждого ОбъектМетаданныхТабЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл

				Если ОбъектМетаданныхТабЧасть.Реквизиты.Найти("Подразделение") <> Неопределено Тогда
					
                    РеквизитОрганизация = "";
					РеквизитОрганизацияВШапке = Ложь;
					ЗначениеРеквизитаОрганизация = Неопределено;
					
					Если ОбъектМетаданныхТабЧасть.Имя = "РасшифровкаПлатежа" И ОбъектМетаданныхТабЧасть.Реквизиты.Найти("АналитикаДоходов") <> Неопределено Тогда
						РеквизитОрганизация = "АналитикаДоходов";
					ИначеЕсли ОбъектМетаданныхТабЧасть.Имя = "РасшифровкаПлатежа" И ОбъектМетаданныхТабЧасть.Реквизиты.Найти("АналитикаРасходов") <> Неопределено Тогда
						РеквизитОрганизация = "АналитикаРасходов";
					ИначеЕсли ОбъектМетаданныхТабЧасть.Имя = "РасшифровкаПлатежа" И ОбъектМетаданных.Реквизиты.Найти("Организация") <> Неопределено Тогда	
						РеквизитОрганизация = "Организация";
						РеквизитОрганизацияВШапке = Истина;
					ИначеЕсли ОбъектМетаданныхТабЧасть.Реквизиты.Найти("Организация") <> Неопределено Тогда	
						РеквизитОрганизация = "Организация";
					Иначе
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(РеквизитОрганизация) Тогда

						Для Каждого СтрокаТабЧастиОбъекта Из ТекущийОбъект[ОбъектМетаданныхТабЧасть.Имя] Цикл
						
							Если РеквизитОрганизацияВШапке Тогда
								ЗначениеРеквизитаОрганизация = ТекущийОбъект[РеквизитОрганизация];
							Иначе
								Если ТипЗнч(СтрокаТабЧастиОбъекта[РеквизитОрганизация]) = Тип("СправочникСсылка.Организации") Тогда
									ЗначениеРеквизитаОрганизация = СтрокаТабЧастиОбъекта[РеквизитОрганизация];
								Иначе
									Продолжить;
								КонецЕсли;	
							КонецЕсли;
						
							смартОбщегоНазначения.смартПроверитьОрганизациюПодразделения(Отказ, СтрокаТабЧастиОбъекта.Подразделение, ЗначениеРеквизитаОрганизация);
						
						КонецЦикла;	
					
					КонецЕсли;	

				КонецЕсли;
					
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;
	//--#1316 смарт: Лопато 06.10.2023

	//++#1530 смарт: Лопато 27.10.2023 //Отмена напоминания при повторной записи Заявка на расходование ДС  
	Если Форма.ИмяФормы = "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента"
		И НЕ Отказ 
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ЗначениеЗаполнено(ТекущийОбъект.Ссылка)
		И ТекущийОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена
		И ТекущийОбъект.КтоЗаявил <> Пользователи.АвторизованныйПользователь()
		И ТекущийОбъект.смартОшибкиВРеквизитах.Количество() > 0
		Тогда
		
		ПредыдущийСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Статус");
		
		Если ТекущийОбъект.Статус <> ПредыдущийСтатус Тогда
			смартОбработкаПодписокНаСобытия.смартЗаявкаНаРасходованиеДСНапоминанияПриЗаписи(ТекущийОбъект);
		КонецЕсли;	
			
	КонецЕсли;
	//--#1530 смарт: Лопато 27.10.2023
	
	//++#1905 смарт: Лопато 09.07.2024 //Намотка. Ошибка преобразования строки к числу  
	Если Форма.ИмяФормы = "Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента" Тогда
		
		Если ТипЗнч(ТекущийОбъект.Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
			ВидНоменклатуры = ТекущийОбъект.Владелец;
		Иначе
			ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Владелец, "ВидНоменклатуры");
		КонецЕсли;
		
		ВидНоменклатурыТоварРулоныХарактеристики = 
			смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ВидНоменклатурыТоварРулоныХарактеристики", Ложь);
		
		Если НЕ ЗначениеЗаполнено(ВидНоменклатурыТоварРулоныХарактеристики) Тогда
			
			ВидНоменклатурыТоварРулоныХарактеристики = 
				Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварРулоныХарактеристики", Истина);
				
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидНоменклатурыТоварРулоныХарактеристики)
			И ВидНоменклатуры = ВидНоменклатурыТоварРулоныХарактеристики Тогда 
			
			Попытка
				
				Намотка = Число(СокрЛП(ТекущийОбъект.Наименование));
				
			Исключение
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Это характеристика номенклатуры с видом ""ТоварРулоныХарактеристики""." 
					+ Символы.ПС
					+ "Значение поля ""Рабочее наименование"" должно быть числом!'"), 
					, 
					"Наименование", 
					"Объект", 
					Отказ);
					
			КонецПопытки;	
				
		КонецЕсли;	

	КонецЕсли;	
	//--#1905 смарт: Лопато 09.07.2024
	
КонецПроцедуры

&После("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи)
    
	//++ смарт: #1438 Корбутов 04.09.2023  добавление выбора основного ЭДО контрагента 
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" 
	Тогда
		Если Форма.Модифицированность
		Тогда
			//Запишем выбор пользователя
			ВыбЗнач = Форма.ОсновнойЭДО;
			смартОбщегоНазначения.ЗаписатьВыборОсновногоЭДО(ТекущийОбъект.Ссылка,ВыбЗнач);
		Иначе
		КонецЕсли;	
	Иначе
	КонецЕсли;
	//++ смарт: #1438 Корбутов 04.09.2023
	
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	Если Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда  
		
		смартСервер.смартПеречитатьДанныеКонтейнеров(Форма.Объект);
		
	КонецЕсли;
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	
	//++ #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	//++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
	Если Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаВнутреннееПотребление.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
	//-- #Б-1434 смарт: Лопато 22.11.2024
		
		смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(Форма);
		
	КонецЕсли;
	//-- #1480 смарт: Ермаков 04.10.2023 //Чистка старых данных для корректности работы отчета Контроль сдачи на склад снятых З/Ч  
	
	//++ смарт: 24.08.2026 / Заполнить по назначению (вывод из оборота)
	Если Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("смартЗаполнитьПоНазначению");
		НоваяКоманда.Заголовок = "Заполнить по назначению";
		НоваяКоманда.Действие = "смартЗаполнитьПоНазначению";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗаполнитьПоНазначению", Тип("КнопкаФормы"), Форма.Элементы.ГруппаЗаполнить);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "смартЗаполнитьПоНазначению";
		НовыйЭлемент.Заголовок = "Заполнить по назначению";
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаВнутреннееПотребление.Форма.ФормаДокумента" Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("смартЗаполнитьПоНазначению");
		НоваяКоманда.Заголовок = "Заполнить по назначению";
		НоваяКоманда.Действие = "смартЗаполнитьПоНазначению";
		
		НовыйЭлемент = Форма.Элементы.Добавить("смартЗаполнитьПоНазначению", Тип("КнопкаФормы"), Форма.Элементы.ТоварыПодменюЗаполнить);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "смартЗаполнитьПоНазначению";
		НовыйЭлемент.Заголовок = "Заполнить по назначению";
		
	КонецЕсли;
	//-- смарт: 24.08.2026
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////

Функция смартИмеетПравоБлокироватьДокументы(Пользователь)
//смарт Вахов Владимир /426 / 18.06.2021   
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ИмеетПравоБлокироватьДокументы");
	ИмеетПравоБлокироватьДокументы = УправлениеСвойствами.ЗначениеСвойства(Пользователь,ДопСвойство);
	
	Возврат ?(ИмеетПравоБлокироватьДокументы = Неопределено, Ложь, ИмеетПравоБлокироватьДокументы);
	
КонецФункции	

//++ смарт:ММ #030 210 05.03.2020 - добавление Причины возврата товаров
Функция ПолучитьМассивПричинВозврата()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.смартПредопределенныеЗначения.ПричиныВозвратаТовара);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	
КонецФункции //-- смарт:ММ 05.03.2020

// Смарт Фролов+ Доп. расходы внесены
Процедура ДобавитьЭлементыУправленияНаФормыСписковДокументов(Форма, Отказ, СтандартнаяОбработка)
	// Команда
	КомандаДопРасходыВнесены = Форма.Команды.Добавить("смартДопРасходыВнесены");
	КомандаДопРасходыВнесены.Заголовок = "Доп. расходы";
	КомандаДопРасходыВнесены.Подсказка = "Все дополнительные расходы внесены";
	КомандаДопРасходыВнесены.Действие = "смартДопРасходыВнесены";
	
	// Кнопка
	КнопкаДопРасходыВнесены = Форма.Элементы.Добавить("ДопРасходыВнесены", Тип("КнопкаФормы"), Форма.Элементы.ГруппаГлобальныеКоманды);
	КнопкаДопРасходыВнесены.ИмяКоманды = "смартДопРасходыВнесены";
	КнопкаДопРасходыВнесены.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	КнопкаДопРасходыВнесены.Доступность = ПравоДоступа("Изменение",Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
КонецПроцедуры	
// Фролов-

//++ #5046 смарт: Тимофеева 27.11.2025 / Оператор ЭДО в карточке контрагента
Функция СформироватьТекстПодсказкиОператоровЭДО(Ссылка)	
	Результат = "";		
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)), 1, 3) КАК КодОператора,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)), 1, 3) = ""2BE""
		|			ТОГДА ""СБИС  (Тензор)""
		|		КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)), 1, 3) = ""2AE""
		|			ТОГДА ""1С ЭДО (Калуга Астрал)""
		|		КОГДА ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)), 1, 3) = ""2BM""
		|			ТОГДА ""Диадок (Контур)""
		|		ИНАЧЕ ОператорыЭДО.Представление
		|	КОНЕЦ КАК Оператор
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|		ПО (ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)), 1, 3) = ОператорыЭДО.ИдентификаторОператора)
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Контрагент
		|	И ДополнительныеСведения.Свойство.Имя = &ИмяСвойства"; 	
		Запрос.УстановитьПараметр("ИмяСвойства", "id_ЭДО");
		Запрос.УстановитьПараметр("Контрагент", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Оператор;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции  
//-- #5046 смарт: Тимофеева 27.11.2025
