
&ИзменениеИКонтроль("ПроверитьДоступКОбъекту")
Процедура смарт_ПроверитьДоступКОбъекту(Источник, ПередЗаписью, ЭтоПолноправныйПользователь,
			ИдентификаторТранзакции, ПараметрыОграничения, ПараметрыОграниченияДополнительные)
	
	ЭтоНовый = Не Источник.ДополнительныеСвойства.Свойство(
		"УправлениеДоступомЗначенияПолейДляПроверкиИзмененияПриЗаписи");
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПередЗаписью Тогда
		КлючДоступаОбновлен = Ложь;
		
		ОбновитьКлючДоступаОбъектаПриЗаписи(Источник, ЭтоНовый, ИдентификаторТранзакции,
			ПараметрыОграничения, КлючДоступаОбновлен);
		
		ОбновитьКлючДоступаОбъектаПриЗаписи(Источник, ЭтоНовый, ИдентификаторТранзакции,
			ПараметрыОграниченияДополнительные);
		
		Если Не КлючДоступаОбновлен Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыОграничения.ОграничениеОтключено Или ЭтоПолноправныйПользователь Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка
	//++ смарт:ММ 643 01.10.2021
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Заметки") Тогда
		Если ТипЗнч(Источник.Ссылка.Предмет) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов")
			И РольДоступна("смартРедактированиеЗаметокТехническоеОбслуживаниеОборудования") Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Источник.Ссылка.Предмет) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы")
			И РольДоступна("смартРедактированиеЗаметокРемонтныеРаботы") Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Источник.Ссылка.Предмет) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")
			И РольДоступна("смартРедактированиеЗаметокПусконаладочныеРаботы") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-- смарт:ММ 01.10.2021
	#КонецВставки
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПараметрыОграничения.ТекстЗапросаПроверкиПравЧтениеИзменение;
	
	ПроверкаДобавления = Ложь;
	Если Не ПередЗаписью Тогда
		УточнитьПравоДобавление(Запрос, ЭтоНовый, ПараметрыОграничения, ПроверкаДобавления);
	КонецЕсли;
	
	ОбновитьРазрешенныеНаборыВПараметрахСеанса();
	
	Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
	УстановитьРазрешенныеНаборыВПараметрыЗапроса(Запрос);
	
	Если ПараметрыОграничения.ИспользуетсяОграничениеПоВладельцу Тогда
		Запрос.УстановитьПараметр("ИдентификаторТаблицыНастроекПрав",
			ПараметрыОграничения.ИдентификаторТаблицыНастроекПрав);
	КонецЕсли;
	
	Если Не РезультатЗапросаПроверкиДоступа(Запрос, Источник).Пустой() Тогда
		Возврат; // Доступ разрешен.
	КонецЕсли;
	
	Если ПроверкаДобавления Тогда
		Запрос.Текст = ПараметрыОграничения.ТекстЗапросаПроверкиПравЧтениеИзменение;
		ПравоИзменения = Не Запрос.Выполнить().Пустой();
	Иначе
		ПравоИзменения = Ложь;
	КонецЕсли;
	
	Если ПараметрыОграничения.ОграничениеЧтенияОтключено Тогда
		ПравоЧтения = Истина;
	Иначе
		Запрос.Текст = ПараметрыОграничения.ТекстЗапросаПроверкиПраваЧтение;
		ПравоЧтения = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	УстановитьОтключениеБезопасногоРежима(Ложь);
	
	Данные = ?(ПередЗаписью, Источник.Ссылка, Источник);
	СообщитьОбОшибкеДоступа(Данные, ПередЗаписью, ПравоЧтения, ПравоИзменения, ЭтоНовый);
	
КонецПроцедуры
