#Область ДоработкиСмарт

// Фролов+
Функция смарт_ОчиститьНаименованиеПлательщика(Значение)
	Значение=СтрЗаменить(Значение,"ИНН","");
	Значение=СтрЗаменить(Значение,"КПП","");
	Значение=СтрЗаменить(Значение,"ООО","");
	Значение=СтрЗаменить(Значение,"Индивидуальный предприниматель","");

	М=СтрРазделить(Значение,"0123456789",Ложь);
	Значение=СтрСоединить(М,"");
	Значение=СтрЗаменить(Значение,"""","");
	Возврат СокрЛП(Значение);
КонецФункции // Фролов-
#КонецОбласти  

&ИзменениеИКонтроль("ЗагрузитьСекциюДокумента")
Процедура смарт_ЗагрузитьСекциюДокумента(СтрокаДокумента, ТекущаяСтрока, КоличествоСтрок, МассивСтрок)
	
	СекцияДокумента = "СЕКЦИЯДОКУМЕНТ=" + СтрокаДокумента.Операция + Символы.ПС;
	
	СтрокаРазбора = ПолучитьСтрокуИмпорта(ТекущаяСтрока, КоличествоСтрок, МассивСтрок);
	
	Пока Лев(Врег(СокрЛП(СтрокаРазбора)), 14) <> "КОНЕЦДОКУМЕНТА" Цикл
		Тег      = "";
		Значение = "";
		
		Если РазобратьТеговуюСтроку(СтрокаРазбора, Тег, Значение) Тогда
			
			СекцияДокумента = СекцияДокумента + СтрокаРазбора + Символы.ПС;
			
			Если СтрокаДокумента.Свойство(Тег) Тогда
				
				Если ЗначениеЗаполнено(Значение) И НЕ ЗначениеЗаполнено(СтрокаДокумента[Тег]) Тогда
					#Удаление
					СтрокаДокумента[Тег] = Значение;
					#КонецУдаления
					#Вставка
					// Фролов+
					//СтрокаДокумента[Тег] = Значение;  // Так было
					Если (Тег="ПЛАТЕЛЬЩИККПП" Или Тег="ПЛАТЕЛЬЩИКИНН" Или Тег="ПОЛУЧАТЕЛЬКПП" Или Тег="ПОЛУЧАТЕЛЬИНН") И Значение="0" Тогда
						СтрокаДокумента[Тег] = "";
						Если Не СтрокаДокумента.Свойство("НаименованиеОчищено") Тогда 
							СтрокаДокумента.ПЛАТЕЛЬЩИК=смарт_ОчиститьНаименованиеПлательщика(СтрокаДокумента.ПЛАТЕЛЬЩИК);
							СтрокаДокумента.Вставить("НаименованиеОчищено",Истина);
						КонецЕсли;
					Иначе	
						СтрокаДокумента[Тег] = Значение;
					КонецЕсли;						
					// Фролов-
					#КонецВставки
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаРазбора = ПолучитьСтрокуИмпорта(ТекущаяСтрока, КоличествоСтрок, МассивСтрок);
		
	КонецЦикла;
	
	СтрокаДокумента.ДанныеВыписки = СекцияДокумента + "КОНЕЦДОКУМЕНТА";
	
КонецПроцедуры

