#Область СобытияФормы

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Смарт:  Демичев №875 17.02.2022 ((
	КомандаСинхронизироватьНоменклатуру = Команды.Добавить("смартКомандаСинхронизироватьНоменклатуру");
	КомандаСинхронизироватьНоменклатуру.Действие = "смарт_КомандаСинхронизироватьНоменклатуру";
	КомандаСинхронизироватьНоменклатуру.Заголовок = "Синхронизировать номенклатуру";
	КомандаСинхронизироватьНоменклатуру.Подсказка = "Кнопка регистрирует номенклатуру для синхронизации. Доступна для пользователя с ролью ""Изменение финансовой группы номенклатуры""";
	
	Кнопка = Элементы.Добавить("смартКомандаСинхронизироватьНоменклатуру", Тип("КнопкаФормы"),Элементы.КоманднаяПанельСписокРасширенныйПоискНоменклатура);
	Кнопка.Заголовок = "Синхронизировать номенклатуру";	
	Кнопка.Картинка = БиблиотекаКартинок.ПланОбмена;
	Кнопка.ИмяКоманды = "смартКомандаСинхронизироватьНоменклатуру";	
	
	Кнопка.Доступность = РольДоступна("ИзменениеФинансовойГруппыНоменклатуры") или РольДоступна("ПолныеПрава");
	//-- Смарт:  Демичев №875 17.02.2022 ((

	//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
	Команда = Команды.Добавить("смартПоказатьАналоги");
	Команда.Действие = "смартПоказатьАналогиКлиент";
	Команда.Заголовок = "Подобрать аналог";
	
	Кнопка = Элементы.Добавить("смартПоказатьАналоги", Тип("КнопкаФормы"), Элементы.КоманднаяПанельСписокРасширенныйПоискНоменклатура);
	Кнопка.ИмяКоманды = "смартПоказатьАналоги";
	
	Кнопка = Элементы.Добавить("смартПоказатьАналоги1", Тип("КнопкаФормы"), Элементы.СписокСтандартныйПоискНоменклатураКоманднаяПанель);
	Кнопка.ИмяКоманды = "смартПоказатьАналоги";
	
	СписокНоменклатура.ТекстЗапроса = РегистрыСведений.смартАналогиНоменклатуры.МодифицироватьЗапросСпискаНоменклатуры(СписокНоменклатура.ТекстЗапроса);
	
	Элемент = Элементы.Добавить("смартКоличествоАналогов", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискНоменклатура);
	Элемент.ПутьКДанным = "СписокНоменклатура.КоличествоАналогов";
	Элемент.Заголовок = "Аналог";
	
	Элемент = Элементы.Добавить("смартКоличествоАналогов1", Тип("ПолеФормы"), Элементы.СписокСтандартныйПоискНоменклатура);
	Элемент.ПутьКДанным = "СписокНоменклатура.КоличествоАналогов";
	Элемент.Заголовок = "Аналог";
	//-- #Б3742 смарт: Шляпников 20.08.2025

	//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
	смартМаркировка.МодифицироватьФормуСпискаНоменклатуры(ЭтаФорма);
	//-- #Б4670 смарт: Шляпников 21.10.2025

КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытияЭлементов

&НаКлиенте
Процедура смарт_КомандаСинхронизироватьНоменклатуру(Команда)
	
	ВыбранныеСтроки = ПолучитьВыделенныеСтроки();
	Если ВыбранныеСтроки = Неопределено Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать номеклатуру к регистрации!",, "Ошибка");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ЗарегистрироватьКОбменуЗавершение", ЭтаФорма,ВыбранныеСтроки), "Зарегистрировать номенклатуру к обмену?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры  

&НаКлиенте
Процедура смарт_ЗарегистрироватьКОбменуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		смарт_ЗарегистрироватьНаУзлахОбменаОткрытьФормуРегистрации(ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры  

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
&НаКлиенте
Процедура смартПоказатьАналогиКлиент(Команда)
	
	Если Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискНоменклатура Тогда
		ТекущаяСтрока = Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока;
	ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискНоменклатура Тогда
		ТекущаяСтрока = Элементы.СписокСтандартныйПоискНоменклатура.ТекущаяСтрока;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", ТекущаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("смартПоказатьАналогиЗавершениеКлиент", ЭтаФорма);
	
	ОткрытьФорму("РегистрСведений.смартАналогиНоменклатуры.Форма.ФормаВыбораАналога", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
&НаКлиенте
Процедура смартПоказатьАналогиЗавершениеКлиент(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		//смена иерархии
		Элементы.ИерархияНоменклатуры.ТекущаяСтрока = ПолучитьРодителяНоменклатуры(Значение);
		
		Если ИспользоватьФильтры И (ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии")) Тогда
			ПодборТоваровКлиент.ОбработчикАктивизацииСтрокиИерархииНоменклатуры(ЭтаФорма);
		КонецЕсли;
		
		//смена вида номенклатуры
		Элементы.ВидыНоменклатуры.ТекущаяСтрока = ПолучитьВидНоменклатуры(Значение);
		
		Если ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам")
			Или ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам")
			Или ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидам") Тогда
			
			ТекущиеДанные = Элементы.ВидыНоменклатуры.ТекущиеДанные;
		
			Если НЕ ТекущиеДанные = Неопределено И ИспользоватьФильтры Тогда
				
				ВидНоменклатуры = ТекущиеДанные.Ссылка;
				ВидНоменклатурыПриИзмененииНаСервере();
			
			КонецЕсли;
			
		КонецЕсли;
		
		Если Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискНоменклатура Тогда
			
			Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока = Значение;
			Элементы.СписокРасширенныйПоискНоменклатура.Обновить();
			
		ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискНоменклатура Тогда
			
			Элементы.СписокСтандартныйПоискНоменклатура.ТекущаяСтрока = Значение;
			Элементы.СписокСтандартныйПоискНоменклатура.Обновить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
Функция ПолучитьРодителяНоменклатуры(Номенклатура)
	Возврат Номенклатура.Родитель;
КонецФункции

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
Функция ПолучитьВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.ВидНоменклатуры;
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("СписокПриАктивизацииСтроки")
Процедура смарт_СписокПриАктивизацииСтроки(Элемент)

	ПодборТоваровКлиент.ПриАктивизацииСтрокиСпискаНоменклатуры(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	#Вставка
	//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
	Если Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.КоличествоАналогов > 0 Тогда
		
		Элементы.смартПоказатьАналоги.Доступность = Истина;
		Элементы.смартПоказатьАналоги1.Доступность = Истина;
		Элементы.смартПоказатьАналоги1.ЦветФона = Новый Цвет(192, 220, 192);
		Элементы.смартПоказатьАналоги.ЦветФона = Новый Цвет(192, 220, 192);
		
	Иначе
		
		Элементы.смартПоказатьАналоги.Доступность = Ложь;
		Элементы.смартПоказатьАналоги1.Доступность = Ложь;
		Элементы.смартПоказатьАналоги1.ЦветФона = ПолучитьЦветФонаКнопкиПоУмолчанию();
		Элементы.смартПоказатьАналоги.ЦветФона = ПолучитьЦветФонаКнопкиПоУмолчанию();
		
	КонецЕсли;
	//-- #Б3742 смарт: Шляпников 20.08.2025
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область Служебные
//++ Смарт:  Демичев №875 17.02.2022 (( 
&НаСервере
Функция ПолучитьВыделенныеСтроки()
	
	ПЭНоменклаутраТаблица = Элементы.ГруппаСписокНоменклатуры.ПодчиненныеЭлементы;
	мВыделенныеСтроки = ПЭНоменклаутраТаблица.СписокРасширенныйПоискНоменклатура.ВыделенныеСтроки;
	
	Если мВыделенныеСтроки = Неопределено или мВыделенныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат мВыделенныеСтроки; 
	//СписокНоменклатура
	
КонецФункции

&НаКлиенте
Процедура смарт_ЗарегистрироватьНаУзлахОбменаОткрытьФормуРегистрации(МассивНоменклатуры) 
	
	Если МассивНоменклатуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	смПараметры = Новый Структура;
	смПараметры.Вставить("МассивНоменклатуры",МассивНоменклатуры);
	
	ПараметрыВыбораУзла = Новый Структура;
	ПараметрыВыбораУзла.Вставить("РежимВыбора",Истина);
	ПараметрыВыбораУзла.Вставить("СтруктураНоменклатурыМассив",смПараметры);
		
	ОткрытьФорму("Справочник.Номенклатура.Форма.смарт_ФормаСинхронизацииНоменклатуры",ПараметрыВыбораУзла,
	ЭтаФорма);
	
 
КонецПроцедуры  

//-- Смарт:  Демичев №875 17.02.2022 ((

//++ #Б4210 смарт: Шляпников 29.08.2025 / Доработка механизма Аналогов. 
&НаСервереБезКонтекста
Функция ПолучитьЦветФонаКнопкиПоУмолчанию()
	Возврат ЦветаСтиля.ЦветФонаКнопки;
КонецФункции

#КонецОбласти