
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НеВСписке") Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", Параметры.НеВСписке, Истина, ВидСравненияКомпоновкиДанных.НеВСписке);
	КонецЕсли;
	Если Параметры.Свойство("Подсказка") Тогда
		Элементы.Список.РасширеннаяПодсказка.Заголовок = Параметры.Подсказка;
		Элементы.Список.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Функция СписокПередНачаломДобавленияНаСервере()
	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ВариантПоставкиКОРП() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Функция доступна только для ""КОРП"" поставки конфигурации!';en='The function is only available for ""CORP"" configuration delivery!'");
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = СписокПередНачаломДобавленияНаСервере();
КонецПроцедуры

#КонецОбласти

