
#Область ПеренесеноСДоработками

//++#1311 смарт: Лопато 13.02.2023 //Рефакторинг. Перенесено из расширения (отмена &Вместо)  
//&Вместо("ЗаполнитьТабличныйДокументСчетаНаОплату")
//Процедура смарт_ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати)
//	
//	Перем КомплектПечатиПоСсылке;
//	
//	ШаблоныОшибок = Новый Структура;
//	ШаблоныОшибок.Вставить("Товары", НСтр("ru = 'В документе %1 отсутствуют товары. Печать счета на оплату не требуется'"));
//	ШаблоныОшибок.Вставить("ЗаменяющиеТовары", НСтр("ru = 'В документе %1 отсутствуют заменяющие товары. Печать счета на оплату не требуется'"));
//	ШаблоныОшибок.Вставить("Этапы", НСтр("ru = 'В документе %1 отсутствуют этапы оплаты. Печать счета на оплату не требуется'"));
//	
//	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
//	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
//	СтруктураИмяДопКолонки = Новый Структура("ИмяКолонкиКодов", ФормированиеПечатныхФорм.ИмяДополнительнойКолонки());	
//	
//	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
//	ЭтапыОплаты = ДанныеДляПечати.РезультатПоЭтапамОплаты.Выгрузить();
//	Товары = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
//	
//	ЭтапыЗалоговойТары = ЭтапыОплаты.НайтиСтроки(Новый Структура("ЭтоЗалогЗаТару", Истина));
//	ТолькоЗалогЗаТару = ЭтапыЗалоговойТары.Количество() = ЭтапыОплаты.Количество() И ЭтапыЗалоговойТары.Количество() > 0;
//	
//	Если Товары.Колонки.Найти("Содержание")=Неопределено Тогда
//		ЕстьСодержание = Ложь;
//	Иначе
//		ЕстьСодержание = Истина;
//	КонецЕсли;
//	
//	ПоказыватьНДС = Константы.ВыводитьДопКолонкиНДС.Получить();
//	ПервыйДокумент = Истина;
//	
//	Пока ДанныеПечати.Следующий() Цикл
//		
//		//Каратеев ++
//		СтруктураДанныхВалюта = Новый Структура;
//		Попытка
//			НадписьВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru='%1'"), ДанныеПечати.Валюта);
//		Исключение
//			НадписьВалюта = Строка("Валюта");
//		КонецПопытки;
//		СтруктураДанныхВалюта.Вставить("Валюта", НадписьВалюта);
//		//Каратеев --
//		
//		Отказ = Ложь;
//		
//		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
//		
//		ТаблицаТовары = Товары.НайтиСтроки(СтруктураПоиска);
//		ТаблицаЭтапыОплаты = ЭтапыОплаты.НайтиСтроки(СтруктураПоиска);
//		
//		ПроверкаЗаполненияДокумента(ДанныеПечати, ТаблицаТовары, ТаблицаЭтапыОплаты, ШаблоныОшибок, Отказ);
//		Если Отказ Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		Если ПервыйДокумент Тогда
//			ПервыйДокумент = Ложь;
//		Иначе
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		ЗаголовокСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);
//		ЕстьСкидки = ЗаголовокСкидки.ЕстьСкидки;
//		
//		СуффиксОбласти = ?(ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару И ПоказыватьНДС, "СНДС", "") + ?(ЕстьСкидки, "СоСкидкой", "");
//		
//		Макет = Новый ТабличныйДокумент;
//		ЗаполнитьРеквизитыШапкиСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, ТаблицаТовары);
//		
//		Если ДанныеПечати.ЧастичнаяОплата ИЛИ ТипЗнч(ДанныеПечати.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
//			
//			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыЧастичнаяОплата");
//			ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураИмяДопКолонки);
//			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
//			
//			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыЧастичнаяОплата");
//			ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеПечати);
//			ОбластьСтрокаТаблицы.Параметры.НомерСтроки = 1;
//			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
//			
//			ОбластьИтого = Макет.ПолучитьОбласть("ПодвалТаблицыЧастичнаяОплата");
//			СтруктураДанныхИтого = Новый Структура;
//			СтруктураДанныхИтого.Вставить("Всего", ДанныеПечати.СуммаДокумента);
//			ОбластьИтого.Параметры.Заполнить(СтруктураДанныхИтого);
//			ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
//			ТабличныйДокумент.Присоединить(ОбластьИтого);
//			
//			// Вывести ИтогоНДС
//			СоответствиеСтавокНДС = Новый Соответствие;
//			Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
//				ОбластьИтогоНДС = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
//				Для Каждого СтрокаТовара Из ТаблицаТовары Цикл
//					СуммаНДС = СоответствиеСтавокНДС[СтрокаТовара.СтавкаНДС];
//					Если СуммаНДС = Неопределено Тогда
//						СуммаНДС = СтрокаТовара.СуммаНДС;
//					Иначе
//						СуммаНДС = СуммаНДС + СтрокаТовара.СуммаНДС;
//					КонецЕсли;
//					СоответствиеСтавокНДС.Вставить(СтрокаТовара.СтавкаНДС, СуммаНДС);
//				КонецЦикла;
//				Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
//					СтруктураДанныхИтогоНДС = Новый Структура;
//					СтруктураДанныхИтогоНДС.Вставить("НДС", ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС));
//					Если ЗначениеЗаполнено(ТекСтавкаНДС.Значение) Тогда
//						СтруктураДанныхИтогоНДС.Вставить("ВсегоНДС", ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение /100 * ДанныеПечати.ПроцентОплаты));
//					Иначе
//						СтруктураДанныхИтогоНДС.Вставить("ВсегоНДС","-");
//					КонецЕсли;
//					ОбластьИтогоНДС.Параметры.Заполнить(СтруктураДанныхИтогоНДС);
//					ТабличныйДокумент.Вывести(ОбластьИтогоНДС);
//				КонецЦикла;
//				ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсего");
//				СтруктураДанныхПодвалСНДС = Новый Структура("ВсегоСНДС", ФормированиеПечатныхФорм.ФорматСумм(ДанныеПечати.СуммаДокумента));
//				ОбластьПодвалСНДС.Параметры.Заполнить(СтруктураДанныхПодвалСНДС);
//				ОбластьПодвалСНДС.Параметры.Заполнить(СтруктураДанныхВалюта); //Каратеев +-
//				ТабличныйДокумент.Вывести(ОбластьПодвалСНДС);
//			КонецЕсли;
//			
//			// Вывести Сумму прописью
//			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописьюЧастичныйСчет");
//			СуммаПрописью = НСтр("ru='Всего на сумму %СуммаПрописью%'");
//			СуммаПрописью = СтрЗаменить(СуммаПрописью, "%СуммаПрописью%", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта));
//			СтруктураДанныхСуммаПрописью = Новый Структура("СуммаПрописью", СуммаПрописью);
//			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхСуммаПрописью);
//			ТабличныйДокумент.Вывести(ОбластьМакета);
//			
//		Иначе
//		
//			// Таблица "Товары"
//			// Фролов+
//			Макет=ПолучитьМакет("смартПФ_MXL_СчетНаОплату");
//			// Фролов-
//			ОбластьШапкаТаблицы          = Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбласти);
//			ОбластьСтрокаТаблицыСтандарт = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбласти);
//			ОбластьПодвалТаблицы         = Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбласти);
//			ОбластьПодвалНДС             = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
//			
//			ИспользоватьНаборы = Ложь;
//			Если Товары.Колонки.Найти("ЭтоНабор") <> Неопределено Тогда
//				ИспользоватьНаборы = Истина;
//				
//				ОбластьСтрокаТаблицыНабор         = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбласти + "Набор");
//				ОбластьСтрокаТаблицыКомплектующие = Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбласти + "Комплектующие");
//			КонецЕсли;
//			
//			ПустыеДанные = НаборыСервер.ПустыеДанные();
//			ВыводШапки = 0;
//			
//			Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
//				СуффиксОбластиПодвал = "СНДС" + ?(ЕстьСкидки, "СоСкидкой", "");
//				ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсего" + СуффиксОбластиПодвал);
//			КонецЕсли;
//			
//			Если ЕстьСкидки Тогда
//				СтруктураЗаголовокСкидки = Новый Структура("Скидка, СуммаБезСкидки", 
//					ЗаголовокСкидки.Скидка,
//					ЗаголовокСкидки.СуммаСкидки);
//				ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураЗаголовокСкидки);
//			КонецЕсли; 
//			ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураИмяДопКолонки);
//			ОбластьСуммаПрописью = Макет.ПолучитьОбласть(?(ДанныеПечати.СчетКВозврату, "СуммаПрописьюКВозврату", "СуммаПрописью"));
//			
//			МассивПроверкиВывода = Новый Массив;
//			
//			Сумма = 0;
//			СуммаНДС = 0;
//			ВсегоСкидок = 0;
//			ВсегоБезСкидок = 0;
//			НомерСтроки = 0;
//			СоответствиеСтавокНДС = Новый Соответствие;
//			Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
//				
//				Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
//					ОбластьСтрокаТаблицы = ОбластьСтрокаТаблицыНабор;
//				ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
//					ОбластьСтрокаТаблицы = ОбластьСтрокаТаблицыКомплектующие;
//				Иначе
//					ОбластьСтрокаТаблицы = ОбластьСтрокаТаблицыСтандарт;
//				КонецЕсли;
//				
//				Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
//					НомерСтрокиПечать = "";
//				Иначе
//					НомерСтроки = НомерСтроки + 1;
//					НомерСтрокиПечать = НомерСтроки;
//				КонецЕсли;
//				
//				Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
//					ВыводШапки = 1;
//				КонецЕсли;
//				
//				ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(СтрокаТовары, ИспользоватьНаборы);
//				
//				ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
//				ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = СтрокаТовары.ЭтоВозвратнаяТара;
//				Если ЕстьСодержание Тогда
//					ДополнительныеПараметрыПолученияНаименованияДляПечати.Содержание = СтрокаТовары.Содержание;
//				КонецЕсли;
//				
//				Товар = ПрефиксИПостфикс.Префикс
//						+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
//															СтрокаТовары.НаименованиеПолное,
//															СтрокаТовары.Характеристика,
//															,
//															, // Серия
//															ДополнительныеПараметрыПолученияНаименованияДляПечати)
//						+ ПрефиксИПостфикс.Постфикс;
//						
//				СтруктураДанныхСтроки = Новый Структура;
//				СтруктураДанныхСтроки.Вставить("Товар", Товар);
//				СтруктураДанныхСтроки.Вставить("НомерСтроки", НомерСтрокиПечать);
//				ОбластьСтрокаТаблицы.Параметры.Заполнить(СтрокаТовары);
//				Если ЗаголовокСкидки.ЕстьСкидки Тогда
//					СтруктураДанныхСтроки.Вставить("СуммаСкидки",
//						?(ЗаголовокСкидки.ТолькоНаценка,- СтрокаТовары.СуммаСкидки,СтрокаТовары.СуммаСкидки));
//					// Фролов+
//					СтруктураДанныхСтроки.Вставить("ЦенаСоСкидкой",СтрокаТовары.Сумма/СтрокаТовары.Количество);
//					// Фролов-
//				КонецЕсли;
//				
//				Если ЗначениеЗаполнено(СтруктураИмяДопКолонки.ИмяКолонкиКодов) Тогда
//					СтруктураДанныхСтроки.Вставить("Артикул", СтрокаТовары[СтруктураИмяДопКолонки.ИмяКолонкиКодов]);
//				КонецЕсли;
//				
//				ОбластьСтрокаТаблицы.Параметры.Заполнить(СтруктураДанныхСтроки);
//				
//				Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
//					ОбластьСтрокаТаблицы.Параметры.Заполнить(ПустыеДанные);
//				КонецЕсли;
//				
//				МассивПроверкиВывода.Очистить();
//				МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);
//				Если НомерСтроки = ТаблицаТовары.Количество() Тогда
//					МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);
//					МассивПроверкиВывода.Добавить(ОбластьПодвалНДС);
//					МассивПроверкиВывода.Добавить(ОбластьСуммаПрописью);
//				КонецЕсли;
//				
//				ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураДанныхВалюта); //Каратеев +-
//				
//				Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
//					Если (НомерСтроки = 1 И ВыводШапки = 0) ИЛИ (НомерСтроки = 0 И ВыводШапки = 1) Тогда
//						ВыводШапки = 2;
//						ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
//					КонецЕсли;
//				Иначе
//					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
//				КонецЕсли;
//				// Фролов+ Добавлены условия по Виду номенклатуры
//				Если СтрокаТовары.Номенклатура.ВидНоменклатуры.Наименование="Товар (пр. ТМЦ)" Или СтрокаТовары.Номенклатура.ВидНоменклатуры.Наименование="ТоварРулоныХарактеристики" Тогда 
//					ОбластьСтрокаТаблицы.Параметры.Артикул="";
//				КонецЕсли;	
//				// Фролов-
//				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
//				
//				Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
//					
//					Сумма = Сумма + СтрокаТовары.Сумма;
//					СуммаНДС = СуммаНДС + СтрокаТовары.СуммаНДС;
//					
//					Если ЕстьСкидки Тогда
//						ВсегоСкидок = ВсегоСкидок + СтрокаТовары.СуммаСкидки;
//						ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
//					КонецЕсли;
//				
//					Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
//						СуммаНДСПоСтавке = СоответствиеСтавокНДС[СтрокаТовары.СтавкаНДС];
//						Если СуммаНДСПоСтавке = Неопределено Тогда
//							СуммаНДСПоСтавке = 0;
//						КонецЕсли;
//						СоответствиеСтавокНДС.Вставить(СтрокаТовары.СтавкаНДС, СуммаНДСПоСтавке + СтрокаТовары.СуммаНДС);
//					КонецЕсли;
//				
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//			СтруктураДанныхВсегоСкидки = Новый Структура;
//			
//			// Подвал таблицы "Товары"
//			Если ЕстьСкидки Тогда
//				СтруктураДанныхВсегоСкидки.Вставить("ВсегоСкидок", ?(ЗаголовокСкидки.ТолькоНаценка,-ВсегоСкидок, ВсегоСкидок));
//				СтруктураДанныхВсегоСкидки.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
//				Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
//					СтруктураДанныхВсегоСкидки.Вставить("ВсегоСуммаНДС", СуммаНДС);
//				КонецЕсли;
//			КонецЕсли;
//			СтруктураДанныхВсегоСкидки.Вставить("Всего", ФормированиеПечатныхФорм.ФорматСумм(Сумма));
//			ОбластьПодвалТаблицы.Параметры.Заполнить(СтруктураДанныхВсегоСкидки);
//			ОбластьПодвалТаблицы.Параметры.Заполнить(СтруктураДанныхВалюта); //Каратеев +-
//			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
//			
//			// Область "ПодвалТаблицыНДС"
//			Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
//				
//				Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
//					СтруктураДанныхПодвалНДС = Новый Структура;
//					//Каратеев ++
//					//Закомментирована строка типового функционала
//					//СтруктураДанныхПодвалНДС.Вставить("НДС", ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС));
//					СтруктураДанныхПодвалНДС.Вставить("НДС", ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС, НадписьВалюта));
//					//Каратеев --
//					СтруктураДанныхПодвалНДС.Вставить("ВсегоНДС", ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение, ,"-"));
//					ОбластьПодвалНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
//					ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
//					
//				КонецЦикла;
//				СтруктураДанныхПодвалВсегоСНДС = Новый Структура;
//				СтруктураДанныхПодвалНДС.Вставить("ВсегоСНДС", ФормированиеПечатныхФорм.ФорматСумм(Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС)));
//				ОбластьПодвалСНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
//				ОбластьПодвалСНДС.Параметры.Заполнить(СтруктураДанныхВалюта); //Каратеев +-
//				ТабличныйДокумент.Вывести(ОбластьПодвалСНДС);
//				
//			Иначе
//				СтруктураДанныхПодвалНДС = Новый Структура;
//				СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru='Без налога (НДС)'"));
//				СтруктураДанныхПодвалНДС.Вставить("ВсегоНДС", "-");
//				ОбластьПодвалНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
//				ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
//			КонецЕсли;
//			
//			// Вывести Сумму прописью
//			СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
//			ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
//			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
//			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
//			
//			СтруктураДанныхСуммаПрописью = Новый Структура;
//			Если ДанныеПечати.СчетКВозврату Тогда
//				
//				СуммаКВозврату = ДанныеПечати.СуммаКВозврату;
//				СуммаИтого = СуммаКПрописи-СуммаКВозврату;
//				Если СуммаИтого < 0 Тогда
//					СуммаИтого = 0;
//				КонецЕсли;
//				СтруктураДанныхСуммаПрописью.Вставить("СуммаВозврата", ФормированиеПечатныхФорм.ФорматСумм(СуммаКВозврату, ДанныеПечати.Валюта));
//				СтруктураДанныхСуммаПрописью.Вставить("СуммаИтогоКОплате", ФормированиеПечатныхФорм.ФорматСумм(СуммаИтого, ДанныеПечати.Валюта, "0"));
//				СтруктураДанныхСуммаПрописью.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтого, ДанныеПечати.Валюта));
//			Иначе
//				
//				СтруктураДанныхСуммаПрописью.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта));
//			КонецЕсли;
//			
//			СтруктураДанныхСуммаПрописью.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
//			ОбластьСуммаПрописью.Параметры.Заполнить(СтруктураДанныхСуммаПрописью);
//			ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
//		КонецЕсли;
//		ЗаполнитьРеквизитыПодвалаСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС, ПараметрыПечати);
//		
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
//		
//	КонецЦикла;
//	
//КонецПроцедуры
//--#1311 смарт: Лопато 13.02.2023

#КонецОбласти 

#Область ДоработкиСмарт

//Каратеев // Данная функция пока не используется, но не удалять!
Функция СформироватьИнформациюПоНДС(ДанныеПечати, ТаблицаТовары)

	Товары = ДанныеПечати.Ссылка.Товары.Выгрузить();
		ЭтапыОплаты = ДанныеПечати.Ссылка.ЭтапыГрафикаОплаты.Выгрузить();
		
		//ЭтапыЗалоговойТары = ЭтапыОплаты.НайтиСтроки(Новый Структура("СуммаЗалогаЗаТару", Истина));
		ТолькоЗалогЗаТару = Ложь; //ЭтапыЗалоговойТары.Количество() = ЭтапыОплаты.Количество() И ЭтапыЗалоговойТары.Количество() > 0;
		
		СуммаИСтавкаНДС = "";
		
		Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
			
			//Расситываем сумму НДС и СтавкуНДС по документу
			Сумма = 0;
			СуммаНДС = 0;
			ВсегоСкидок = 0;
			ВсегоБезСкидок = 0;
			НомерСтроки = 0;
			СоответствиеСтавокНДС = Новый Соответствие;
			
			ИспользоватьНаборы = Ложь;
			
			Если Товары.Колонки.Найти("ЭтоНабор") <> Неопределено Тогда
				ИспользоватьНаборы = Истина;
			КонецЕсли;
			
			ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
			ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
			ЗаголовокСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);
			ЕстьСкидки = ЗаголовокСкидки.ЕстьСкидки;
		
			Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
				
				Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
					
					Сумма = Сумма + СтрокаТовары.Сумма;
					СуммаНДС = СуммаНДС + СтрокаТовары.СуммаНДС;
					
					Если ЕстьСкидки Тогда
						ВсегоСкидок = ВсегоСкидок + СтрокаТовары.СуммаСкидки;
						ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
					КонецЕсли;
				
					Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
						СуммаНДСПоСтавке = СоответствиеСтавокНДС[СтрокаТовары.СтавкаНДС];
						Если СуммаНДСПоСтавке = Неопределено Тогда
							СуммаНДСПоСтавке = 0;
						КонецЕсли;
						СоответствиеСтавокНДС.Вставить(СтрокаТовары.СтавкаНДС, СуммаНДСПоСтавке + СтрокаТовары.СуммаНДС);
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
				СтавкаНДС = ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС);
				ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение, ,"-");
			КонецЦикла;
			ВсегоСНДС = ФормированиеПечатныхФорм.ФорматСумм(Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС));
		Иначе
			СтавкаНДС = НСтр("ru='Без налога (НДС)'");
			ВсегоНДС = "-";
		КонецЕсли;
		
		СуммаИСтавкаНДС = СтавкаНДС + " " + ВсегоНДС;
		
		Возврат СуммаИСтавкаНДС;

КонецФункции // СформироватьИнформациюПоНДС()

&ИзменениеИКонтроль("СформироватьПечатнуюФормуСчетНаОплату")
//++ #1794 смарт: Фролов 24.04.2024 //Запрет печати счета из Заказа клиента если в нем есть оборудование и он создан не на основании Интереса.
Функция смарт_СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СЧЕТНАОПЛАТУ";

	НомерТипаДокумента = 0;

	УстановитьПривилегированныйРежим(Истина);

	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл

		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыСчетаНаОплату(ПараметрыПечати, СтруктураОбъектов.Значение);
        #Удаление
		ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
		#КонецУдаления
		
		#Вставка
		Если ДанныеДляПечати <> Ложь Тогда
			
			ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
			
		КонецЕсли;	
		#КонецВставки
		
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ТабличныйДокумент;

КонецФункции //-- #1794 смарт: Фролов 24.04.2024

#КонецОбласти

//++#1311 смарт: Лопато 13.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
//&Вместо("ЗаполнитьРеквизитыШапкиСчетаНаОплату")
//Процедура смарт_ЗаполнитьРеквизитыШапкиСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, ТаблицаТовары)
//	
//	//++ смарт:ММ #042 222 28.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
//	//Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСчетовНаОплату.ПФ_MXL_СчетНаОплату");
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСчетовНаОплату.смартПФ_MXL_СчетНаОплатуВнимание"); //смартПФ_MXL_СчетНаОплату
//	//-- смарт:ММ 28.03.2020
//	
//	СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
//	ФормированиеПечатныхФорм.ВывестиЛоготипВТабличныйДокумент(Макет, ОбластьМакета, "ЗаголовокСчета", ДанныеПечати.Организация);
//	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
//	
//	Если ТаблицаЭтапыОплаты.Количество() = 0 Тогда
//		ДатаПлатежа = '00010101';
//	ИначеЕсли ТаблицаЭтапыОплаты.Количество() = 1 Тогда
//		ДатаПлатежа = ТаблицаЭтапыОплаты[0].ДатаПлатежа;
//	Иначе
//		ДатаПлатежа = ТаблицаЭтапыОплаты[ТаблицаЭтапыОплаты.Количество()-1].ДатаПлатежа;
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
//		СтруктураДанныхЗаголовок = Новый Структура;
//		НадписьСрокДействия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru='Счет действителен до %1.'"), Формат(ДатаПлатежа, "ДЛФ=D")) + " ";
//		СтруктураДанныхЗаголовок.Вставить("СрокДействия", НадписьСрокДействия);
//		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхЗаголовок);
//	КонецЕсли;
//	
//	ТабличныйДокумент.Вывести(ОбластьМакета);
//    
//   //++ смарт:Подкин #914 05.03.2022 9:52:04  
//    Попытка
//        ОбластьМакетаВнимание = Макет.ПолучитьОбласть("ОбластьВнимание");
//        ТабличныйДокумент.Вывести(ОбластьМакетаВнимание);    
//    Исключение
//    КонецПопытки;
//    //-- смарт:Подкин #914 05.03.2022 9:52:04 
//    
//	Если ДанныеПечати.ПлатежЗаРубеж Тогда
//		
//		ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияРеквизитыБанка");
//		СтруктураДанныхШапки = Новый Структура;
//		ПредставлениеПоставщикаДляПлатПоручения = "";
//		
//		Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
//			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателяПредставление", ДанныеПечати.НомерБанковскогоСчета);
//			СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", ДанныеПечати.НаименованиеБанкаМеждународное);
//			Если ПустаяСтрока(СтруктураДанныхШапки.БанкПолучателяПредставление) Тогда
//				СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", ДанныеПечати.НаименованиеБанка);
//			КонецЕсли; 
//			СтруктураДанныхШапки.Вставить("АдресБанкаПолучателяПредставление", ДанныеПечати.АдресБанка);
//			СтруктураДанныхШапки.Вставить("СВИФТБанка", ДанныеПечати.СВИФТБанка);
//			ПредставлениеПоставщикаДляПлатПоручения = ДанныеПечати.БанковскийСчетТекстКорреспондента;
//		КонецЕсли;
//		
//		Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
//			ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
//		КонецЕсли;
//		СтруктураДанныхШапки.Вставить("ПредставлениеПоставщикаДляПлатПоручения", ПредставлениеПоставщикаДляПлатПоручения);
//		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
//		ТабличныйДокумент.Вывести(ОбластьМакета);
//		
//		Если Не ПустаяСтрока(ДанныеПечати.НаименованиеБанкаДляРасчетовМеждународное) Тогда
//			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияРеквизитыБанкаКорреспондента");
//			
//			СтруктураДанныхШапки.Очистить();
//			СтруктураДанныхШапки.Вставить("БанкКорреспондентПолучателяПредставление",
//				ДанныеПечати.НаименованиеБанкаДляРасчетовМеждународное + " " + ДанныеПечати.АдресБанкаДляРасчетов);
//			СтруктураДанныхШапки.Вставить("СВИФТБанкаДляРасчетов", ДанныеПечати.СВИФТБанкаДляРасчетов);
//			СтруктураДанныхШапки.Вставить("СчетБанкаДляРасчетовПредставление", ДанныеПечати.СчетВБанкеДляРасчетов);
//			
//			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
//			ТабличныйДокумент.Вывести(ОбластьМакета);
//		КонецЕсли;
//		
//		ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияНазначениеПлатежа");
//		СтруктураДанныхШапки.Очистить();
//		Если Не ЗначениеЗаполнено(ДанныеПечати.НазначениеПлатежа)
//			И ТипЗнч(ДанныеПечати.Ссылка) <> Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда
//			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
//				ДанныеПечати.Номер, ДанныеПечати.Ссылка));
//		Иначе
//			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", ДанныеПечати.НазначениеПлатежа);
//		КонецЕсли;
//		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
//		ТабличныйДокумент.Вывести(ОбластьМакета);
//		
//	Иначе
//	
//		Если ДанныеПечати.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
//			И ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
//			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияППСКодом");
//		Иначе
//			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияПП");
//		КонецЕсли;
//		
//		СтруктураДанныхШапки = Новый Структура;
//		СтруктураДанныхШапки.Вставить("ИНН", СведенияОПоставщике.ИНН);
//		СтруктураДанныхШапки.Вставить("КПП",СведенияОПоставщике.КПП);
//		ПредставлениеПоставщикаДляПлатПоручения = "";
//		
//		СтруктураДанныхШапки.Вставить("ИдентификаторПлатежа", ДанныеПечати.ИдентификаторПлатежа);
//		
//		Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
//			
//			Если ЗначениеЗаполнено(ДанныеПечати.БИКБанкаДляРасчетов) Тогда
//				Банк		= ДанныеПечати.НаименованиеБанкаДляРасчетов;
//				БИК         = ДанныеПечати.БИКБанкаДляРасчетов;
//				КоррСчет    = ДанныеПечати.КоррСчетБанкаДляРасчетов;
//				ГородБанка  = ДанныеПечати.ГородБанкаДляРасчетов;
//				НомерСчета  = ДанныеПечати.КоррСчетБанка;
//			Иначе
//				Банк		= ДанныеПечати.НаименованиеБанка;
//				БИК         = ДанныеПечати.БИКБанк;
//				КоррСчет    = ДанныеПечати.КоррСчетБанка;
//				ГородБанка  = ДанныеПечати.ГородБанка;
//				НомерСчета  = ДанныеПечати.НомерБанковскогоСчета;
//			КонецЕсли;
//			
//			СтруктураДанныхШапки.Вставить("БИКБанкаПолучателя", БИК);
//			СтруктураДанныхШапки.Вставить("БанкПолучателя", Банк);
//			СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", СокрЛП(Банк) + " " + ГородБанка);
//			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателя", КоррСчет);
//			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателяПредставление", КоррСчет);
//			СтруктураДанныхШапки.Вставить("СчетПолучателяПредставление", НомерСчета);
//			СтруктураДанныхШапки.Вставить("СчетПолучателя", НомерСчета);
//			ПредставлениеПоставщикаДляПлатПоручения = ДанныеПечати.БанковскийСчетТекстКорреспондента;
//			
//		КонецЕсли;
//	
//		Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
//			ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
//		КонецЕсли;
//		
//		//++ смарт:ММ #101 05.04.2021 - обновление. В новом релизе всех этих строк нет. Пока оставлены, т.к. макет остался нетиповой 
//		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
//		//Каратеев ++	
//		//СуммаИСтавкаНДС = СформироватьИнформациюПоНДС(ДанныеПечати, ТаблицаТовары); //Каратеев // Закомментировал, так как по словам Владимировой НДС должен подписываться в момент создания платежки в банк-клиенте
//		
//		Если НЕ ДанныеПечати.Ссылка.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
//			//++ Станчев {335} от 26.10.2020 - вывод даты курса в зависимости от года документа с одновременным форматирование
//			//СтруктураДанныхШапки.Вставить("КурсНаДатуОплаты", НСтр("ru='По курсу ЦБ РФ ХХ,ХХХХ на дату __.__.2019'"));
//			СтруктураДанныхШапки.Вставить("КурсНаДатуОплаты", НСтр("ru='По курсу ЦБ РФ ХХ,ХХХХ на дату __.__.'")+Формат(Год(ДанныеПечати.Ссылка.Дата),"ЧГ=0"));
//			//-- Станчев (26.10.2020)
//		//Иначе
//		//	ОбластьМакета.УдалитьОбласть(ОбластьМакета.Область("ОбластьНазначениеПлатежаКурс"), ТипСмещенияТабличногоДокумента.ПоВертикали);
//		КонецЕсли;
//		//Каратеев --
//		//-- смарт:ММ 27.03.2020
//		//-- смарт:ММ 05.04.2021 #101
//		
//		Если Не ЗначениеЗаполнено(ДанныеПечати.НазначениеПлатежа)
//			И ТипЗнч(ДанныеПечати.Ссылка) <> Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда
//			
//			//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
//			//СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
//			//	ДанныеПечати.Номер, ДанныеПечати.Ссылка));
//			//Каратеев ++
//			Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") 
//				И ДанныеПечати.Ссылка.Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда
//				СтруктураДанныхШапки.Вставить("НазначениеПлатежа", 
//				"Оплата по договору № " + ДанныеПечати.Ссылка.Договор.Номер 
//				+ " от " + Формат(ДанныеПечати.Ссылка.Договор.ДатаНачалаДействия, "ДЛФ=D"));
//			Иначе
//				Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
//                    СтруктураДанныхШапки.Вставить("НазначениеПлатежа",  
//                    //++ смарт:Подкин # 16.05.2022 15:11:31 изменено в рамках перехода на другой банк
//                    //ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru='Оплата за _________________ по счету'")));//Каратеев +-// + " / " + СуммаИСтавкаНДС); // Закомментировал, так как по словам Владимировой НДС должен подписываться в момент создания платежки в банк-клиенте
//                   "Оплата по счету "+ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати,)+" за _______________________________________________________________________");
//                    //-- смарт:Подкин # 16.05.2022 15:11:31
//				Иначе
//					СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
//					ДанныеПечати.Номер, ДанныеПечати.Ссылка));
//				КонецЕсли;
//			КонецЕсли;
//			//Каратеев --	
//			//-- смарт:ММ 27.03.2020
//		Иначе
//			
//			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", ДанныеПечати.НазначениеПлатежа);
//			
//		КонецЕсли;
//		
//		СтруктураДанныхШапки.Вставить("ПредставлениеПоставщикаДляПлатПоручения", ПредставлениеПоставщикаДляПлатПоручения);
//		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
//		
//		Если ДанныеПечати.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
//			И ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
//			
//			РеквизитыПлатежа = РеквизитыПлатежаQRКод(СтруктураДанныхШапки);
//			РеквизитыПлатежа.СуммаЧислом = СуммаКОплатеПоСчету(ДанныеПечати, ТаблицаТовары);
//			
//			ВывестиQRКод(РеквизитыПлатежа, ДанныеПечати, ОбластьМакета);
//			
//		КонецЕсли;
//		
//		ТабличныйДокумент.Вывести(ОбластьМакета);
//	КонецЕсли;
//	
//	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
//	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
//	
//	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
//	ОбластьПервойКолонкиТоваров = Макет.Область("ПерваяКолонкаТовара");
//	Если НЕ ВыводитьКоды Тогда
//		ОбластьПервойКолонкиТоваров.ШиринаКолонки = ОбластьПервойКолонкиТоваров.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
//		Макет.УдалитьОбласть(Макет.Область("КолонкаКодов"), Смещать);
//	КонецЕсли;
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
//	
//	ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru='Счет на оплату'"));
//	
//	//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
//	//Каратеев ++
//	Если ЗначениеЗаполнено(ДатаПлатежа) 
//		И НЕ ДанныеПечати.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
//		
//		ДатаСрокаДействия = ДатаПлатежа;
//		
//	Иначе
//		// Фролов изменение по распоряжению Ларькова. не верно указывается срок действия счета
//		//ДатаСрокаДействия = ТекущаяДата() + 60 * 60 * 24;   // Так было
//		//++ смарт:ММ #101 05.04.2021 Обновление
//		ДатаСрокаДействия = смартСервер.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ДанныеПечати.Дата, 0);
//		//ДатаСрокаДействия = смартОбщегоНазначения.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ДанныеПечати.Дата, 1);
//		//-- смарт:ММ 05.04.2021
//		// Фролов -
//	КонецЕсли;
//	СрокДействия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru='действителен до %1'"), Формат(ДатаСрокаДействия, "ДЛФ=D"));
//	ТекстЗаголовка = ТекстЗаголовка + Строка(" ("+СрокДействия+")");
//	//Каратеев --
//	//-- смарт:ММ 27.03.2020
//	
//	СтруктураДанныхШапки = Новый Структура;
//	СтруктураДанныхШапки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
//	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
//	ТабличныйДокумент.Вывести(ОбластьМакета);
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
//	
//	СтруктураДанныхПоставщик = Новый Структура;
//	СтруктураДанныхПоставщик.Вставить("ПредставлениеПоставщика", 
//		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.ОрганизацияПоставщик, ДанныеПечати.Дата),
//			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
//	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПоставщик);
//	ТабличныйДокумент.Вывести(ОбластьМакета);
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
//	СтруктураДанныхПокупатель = Новый Структура;
//	СтруктураДанныхПокупатель.Вставить("ПредставлениеПолучателя", 
//		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
//			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
//	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупатель);
//	ТабличныйДокумент.Вывести(ОбластьМакета);
//	
//	Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда
//		ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
//		СтруктураДанныхГрузоотправитель = Новый Структура;
//		СтруктураДанныхГрузоотправитель.Вставить("ПредставлениеГрузоотправителя", ОписаниеОрганизации(ДанныеПечати, "Грузоотправитель"));
//		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхГрузоотправитель);
//		ТабличныйДокумент.Вывести(ОбластьМакета);
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда
//		ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
//		СтруктураДанныхГрузополучатель = Новый Структура;
//		СтруктураДанныхГрузополучатель.Вставить("ПредставлениеГрузополучателя", ОписаниеОрганизации(ДанныеПечати, "Грузополучатель"));
//		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхГрузополучатель);
//		ТабличныйДокумент.Вывести(ОбластьМакета);
//	КонецЕсли;
//	
//КонецПроцедуры
//--#1311 смарт: Лопато 13.02.2023
