
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ++ 01.12.2020
	БлокируемыеПоля = Новый Массив;
	БлокируемыеПоля.Добавить("Серия");
	БлокируемыеПоля.Добавить("ОборудованиеТЧ");
	
	Список.УстановитьОграниченияИспользованияВГруппировке(БлокируемыеПоля);
	Список.УстановитьОграниченияИспользованияВОтборе(БлокируемыеПоля);
	Список.УстановитьОграниченияИспользованияВПорядке(БлокируемыеПоля);
	
	Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборОборудование", Ложь);
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументсмартЗаявкаНаПускоНаладку", 
																		 "И (смартЗаявкаНаПускоНаладкуОборудование.НомерСтроки = 1)", 
																		 "ЕСТЬNULL(смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов, ЗНАЧЕНИЕ(Справочник.смартОборудованиеКлиентов.ПустаяСсылка)) КАК ОборудованиеКлиента",
																		 ,,, "Контрагент");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
	РасширенияПоддерживающиеПредпросмотр = РаботаСФайламиСлужебный.СписокРасширенийДляПредпросмотра();
	
	Элементы.PDFДокумент.Видимость = Ложь;
	Элементы.АдресДанныхФайла.Видимость = Истина;
	//-- #Б-6426 смарт: Фролов 17.04.2026
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

//++ смарт:ММ #084 407 01.12.2020 - Доработка Заявки на пусконаладку
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//++ #6750  смарт: Тимофеева 30.04.2026 / При попытке вывести список из журнала ПНР, выходит ошибка, и дальнейшие действия "Завершить" или "Закрыть" программу.
	КлючиСтрок = Строки.ПолучитьКлючи();
	Если КлючиСтрок.Количество() > 0 
		И НЕ Строки[КлючиСтрок[0]].Данные.Свойство("Серия")
		И НЕ Строки[КлючиСтрок[0]].Данные.Свойство("ОборудованиеТЧ") Тогда
	    Возврат;
	КонецЕсли;
	//-- #6750  смарт: Тимофеева 30.04.2026
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартЗаявкаНаПускоНаладкуОборудование.Оборудование КАК Оборудование,
	|	смартЗаявкаНаПускоНаладкуОборудование.Серия КАК Серия,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК смартЗаявкаНаПускоНаладкуОборудование
	|ГДЕ
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка В(&МассивДокументов)
	|ИТОГИ ПО
	|	Ссылка";
	
	//++ #6750  смарт: Тимофеева 30.04.2026 / При попытке вывести список из журнала ПНР, выходит ошибка, и дальнейшие действия "Завершить" или "Закрыть" программу.
	//Запрос.УстановитьПараметр("МассивДокументов", Строки.ПолучитьКлючи());
	Запрос.УстановитьПараметр("МассивДокументов", КлючиСтрок);
	//-- #6750  смарт: Тимофеева 30.04.2026
		
	ВыборкаСсылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		Серия = "";
		Оборудование = "";
		Выборка = ВыборкаСсылка.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Серия = "" + Серия + ?(ЗначениеЗаполнено(Серия), ", ", "") + Выборка.Серия;
			Оборудование = "" + Оборудование + ?(ЗначениеЗаполнено(Оборудование), ", ", "") + Выборка.Оборудование;
		КонецЦикла;
		
		Строка = Строки[ВыборкаСсылка.Ссылка];
		//++ #6750  смарт: Тимофеева 30.04.2026 / При попытке вывести список из журнала ПНР, выходит ошибка, и дальнейшие действия "Завершить" или "Закрыть" программу.
		//Строка.Данные.Серия = Серия;
		//Строка.Данные.ОборудованиеТЧ = Оборудование; 
		Если Строка.Данные.Свойство("Серия") Тогда
			Строка.Данные.Серия = Серия;
		КонецЕсли;
		Если Строка.Данные.Свойство("ОборудованиеТЧ") Тогда
			Строка.Данные.ОборудованиеТЧ = Оборудование;
		КонецЕсли;
		//-- #6750  смарт: Тимофеева 30.04.2026  		
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 01.12.2020

//++ смарт:ММ #084 407 01.12.2020 - Доработка Заявки на пусконаладку
&НаКлиенте
Процедура ОборудованиеОтборПриИзменении(Элемент)
		
	Если ЗначениеЗаполнено(Оборудование) Тогда
		МассивСсылок = ПолучитьДокументыПоОборудованию(Оборудование);
		Список.Параметры.УстановитьЗначениеПараметра("Ссылка", МассивСсылок);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборОборудование", Истина);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборОборудование", Ложь);
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 01.12.2020

//++ смарт:ММ #084 407 01.12.2020 - Доработка Заявки на пусконаладку
&НаСервереБезКонтекста
Функция ПолучитьДокументыПоОборудованию(Оборудование)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК смартЗаявкаНаПускоНаладкуОборудование
	|ГДЕ
	|	смартЗаявкаНаПускоНаладкуОборудование.Оборудование В(&Оборудование)";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции //-- смарт:ММ 01.12.2020


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
			
		ЭтаФорма.СписокФайлов.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ТекущиеДанные.Ссылка);
		
	Иначе
		
		ЭтаФорма.СписокФайлов.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ПредопределенноеЗначение("Документ.смартЗаявкаНаПускоНаладку.ПустаяСсылка"));
		
	КонецЕсли;
	
	Элементы.PDFДокумент.Видимость = Ложь;
	ЭтаФорма.АдресДанныхФайла = Неопределено;
	Элементы.АдресДанныхФайла.Видимость = Истина;
	
КонецПроцедуры //-- #Б-6426 смарт: Фролов 17.04.2026

&НаКлиенте
//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
Процедура СписокФайловПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И РасширенияПоддерживающиеПредпросмотр.НайтиПоЗначению(ТекущиеДанные.Расширение) <> Неопределено Тогда

		Попытка
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка, Неопределено, УникальныйИдентификатор,, АдресДанныхФайла);

			Если ДанныеФайла.Расширение = "pdf" Тогда
				
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
				Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
				ЭтаФорма.PDFДокумент.Прочитать(Поток);

				Элементы.PDFДокумент.Видимость = Истина; 
				Элементы.АдресДанныхФайла.Видимость = Ложь;
				Элементы.PDFДокумент.Документ = ЭтаФорма.PDFДокумент;
				
			Иначе
				
				Элементы.PDFДокумент.Видимость = Ложь;
				Элементы.АдресДанныхФайла.Видимость = Истина;
				АдресДанныхФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
				
			КонецЕсли;

		Исключение
			// Если файла не существует, то будет вызвано исключение.
			АдресДанныхФайла         = Неопределено;
			ТекстНевыбраннойКартинки = НСтр("ru = 'Предварительный просмотр недоступен по причине:'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

	Иначе

		АдресДанныхФайла         = Неопределено;
		ТекстНевыбраннойКартинки = НСтр("ru = 'Нет данных для предварительного просмотра'");

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресДанныхФайла) Тогда
		Элементы.АдресДанныхФайла.ТекстНевыбраннойКартинки = ТекстНевыбраннойКартинки;
	КонецЕсли;	

КонецПроцедуры //-- #Б-6426 смарт: Фролов 17.04.2026

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
