#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаказКлиента") Тогда
		ЗаказКлиента = Параметры.ЗаказКлиента;
	КонецЕсли;
	
	ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ЗаказКлиентаТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПередатьДанныеСтрокиВПодбор();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Выбрать(Команда)
	
	ПередатьДанныеСтрокиВПодбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормыВыбора(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаКлиенте
Процедура ПередатьДанныеСтрокиВПодбор()
	
	Если Элементы.ЗаказКлиентаТовары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ЗаказКлиентаТовары.ТекущиеДанные;
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
	РезультатВыбора.Вставить("Характеристика", ДанныеСтроки.Характеристика);
	РезультатВыбора.Вставить("Серия", ДанныеСтроки.Серия);
	РезультатВыбора.Вставить("Количество", ДанныеСтроки.Количество);
	
	ОповеститьОВыборе(РезультатВыбора, Истина);
	
КонецПроцедуры

#КонецОбласти