
//++ #4822 смарт: Тимофеева 02.04.2026 / Контроль дебиторской задолженности. Реализация блокировки клиента. Отгрузка с отсрочкой платежа (по договору). Этап 2
&НаСервере
Процедура смарт_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка) 
	Если смартКонтрольДебиторскойЗадолженности.ВедетсяКонтрольДебиторскойЗадолженности(ТекущаяДатаСеанса()) Тогда
		ТекстЗапроса 		= Список.ТекстЗапроса;
		Список.ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"ИЗ
								|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов",
								",
								|	ВЫБОР
								|		КОГДА СправочникДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
								|				И СправочникДоговорыКонтрагентов.ОграничиватьСуммуЗадолженности
								|				И СправочникДоговорыКонтрагентов.смартВидДоговора = ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.РасходныеМатериалыОтсрочка)
								|			ТОГДА СправочникДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности - (РасчетыСКлиентами.СуммаОстаток + РасчетыСКлиентами.ОтгружаетсяОстаток)
								|		ИНАЧЕ 0
								|	КОНЕЦ КАК смартКредитныйЛимит
								|ИЗ
								|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(
								|				,
								|				АналитикаУчетаПоПартнерам.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
								|					И АналитикаУчетаПоПартнерам.Договор.ОграничиватьСуммуЗадолженности
								|					И АналитикаУчетаПоПартнерам.Договор.смартВидДоговора = ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.РасходныеМатериалыОтсрочка)) КАК РасчетыСКлиентами
								|		ПО (СправочникДоговорыКонтрагентов.Ссылка = РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор)");

		смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартКредитныйЛимит", "Список", "Кредитный лимит (смарт)", 1, "Список.смартКредитныйЛимит"); 
	КонецЕсли;
КонецПроцедуры
//-- #4822 смарт: Тимофеева 02.04.2026