
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Партнер) Тогда
		КонтактноеЛицо	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Партнер, "CRM_ОсновноеКонтактноеЛицо");
	Иначе
		КонтактноеЛицо	= ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	Партнер	= CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(КонтактноеЛицо, "Владелец");
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда Возврат; КонецЕсли;
	СтандартнаяОбработка	= Ложь;
	СтруктураОтбора			= Новый Структура("Владелец", Партнер);
	ПараметрыФормы			= Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Закрыть(КонтактноеЛицо);
	ИначеЕсли ЗначениеЗаполнено(Партнер) Тогда
		Закрыть(Партнер);
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
