
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ИнициализироватьТаблицуСкидок(Запрос, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицуСкидок(Запрос, Регистры) Экспорт

	ИмяРегистра = "смартИндивидуальныеСкидкиКлиентов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСкидок = Новый Массив;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТЧСкидки.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТЧСкидки.Ссылка.Дата
		|		ИНАЧЕ ТЧСкидки.НачалоДействия
		|	КОНЕЦ КАК Период,
		|	ТЧСкидки.СрокДействия КАК СрокДействия,
		|	ТЧСкидки.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ТЧСкидки.ПроцентСкидки) КАК ПроцентСкидки,
		|	ТЧСкидки.Ссылка.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТ_ТЧСкидки
		|ИЗ
		|	Документ.смартУстановкаИндивидуальныхСкидокКлиентов.Скидки КАК ТЧСкидки
		|ГДЕ
		|	ТЧСкидки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ТЧСкидки.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТЧСкидки.Ссылка.Дата
		|		ИНАЧЕ ТЧСкидки.НачалоДействия
		|	КОНЕЦ,
		|	ТЧСкидки.СрокДействия,
		|	ТЧСкидки.Номенклатура,
		|	ТЧСкидки.Ссылка.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиент КАК Клиент
		|ПОМЕСТИТЬ ТЧ_Клиенты
		|ИЗ
		|	Документ.смартУстановкаИндивидуальныхСкидокКлиентов.Клиенты
		|ГДЕ
		|	Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТЧСкидки.Период КАК Период,
		|	ВТ_ТЧСкидки.СрокДействия КАК СрокДействия,
		|	ТЧ_Клиенты.Клиент КАК Клиент,
		|	ВТ_ТЧСкидки.Номенклатура КАК Номенклатура,
		|	ВТ_ТЧСкидки.ПроцентСкидки КАК ПроцентСкидки,
		|	ВТ_ТЧСкидки.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТ_ДокСкидки
		|ИЗ
		|	ТЧ_Клиенты КАК ТЧ_Клиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЧСкидки КАК ВТ_ТЧСкидки
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВТ_ТЧСкидки.Номенклатура ЕСТЬ NULL	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ИндСкидки.Период, НАЧАЛОПЕРИОДА(ВТ_ДокСкидки.Период, ДЕНЬ)), СЕКУНДА, 1)) КАК Период,
		|	ВТ_ДокСкидки.Клиент КАК Клиент,
		|	ВТ_ДокСкидки.Номенклатура КАК Номенклатура,
		|	ВТ_ДокСкидки.ПроцентСкидки КАК ПроцентСкидки,
		|	ВТ_ДокСкидки.Ответственный КАК Ответственный,
		|	ВТ_ДокСкидки.СрокДействия КАК СрокДействия
		|ИЗ
		|	ВТ_ДокСкидки КАК ВТ_ДокСкидки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИндивидуальныеСкидкиКлиентов КАК ИндСкидки
		|		ПО (ИндСкидки.Регистратор <> &Ссылка)
		|			И ВТ_ДокСкидки.Номенклатура = ИндСкидки.Номенклатура
		|			И ВТ_ДокСкидки.Клиент = ИндСкидки.Клиент
		|			И (НАЧАЛОПЕРИОДА(ИндСкидки.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТ_ДокСкидки.Период, ДЕНЬ))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДокСкидки.Период,
		|	ВТ_ДокСкидки.Клиент,
		|	ВТ_ДокСкидки.Номенклатура,
		|	ВТ_ДокСкидки.ПроцентСкидки,
		|	ВТ_ДокСкидки.Ответственный,
		|	ВТ_ДокСкидки.СрокДействия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ИндСкидки.Период, НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ДокСкидки.СрокДействия, ДЕНЬ, 1), ДЕНЬ)), СЕКУНДА, 1)),
		|	ВТ_ДокСкидки.Клиент,
		|	ВТ_ДокСкидки.Номенклатура,
		|	0,
		|	ВТ_ДокСкидки.Ответственный,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	ВТ_ДокСкидки КАК ВТ_ДокСкидки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИндивидуальныеСкидкиКлиентов КАК ИндСкидки
		|		ПО (ИндСкидки.Регистратор <> &Ссылка)
		|			И ВТ_ДокСкидки.Номенклатура = ИндСкидки.Номенклатура
		|			И ВТ_ДокСкидки.Клиент = ИндСкидки.Клиент
		|			И (НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ИндСкидки.Период, ДЕНЬ, 1), ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТ_ДокСкидки.СрокДействия, ДЕНЬ))
		|ГДЕ
		|	ВТ_ДокСкидки.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДокСкидки.СрокДействия,
		|	ВТ_ДокСкидки.Клиент,
		|	ВТ_ДокСкидки.Номенклатура,
		|	ВТ_ДокСкидки.Ответственный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	Номенклатура,
		|	Период
		|АВТОУПОРЯДОЧИВАНИЕ";

	РезультатЗапроса = Запрос.Выполнить();

	Регистры.Вставить("Таблица" + ИмяРегистра, РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли