
//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&После("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// в одной группе (у одного родителя) не должно быть незавершенных проектов с одинаковым партнером
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Партнер КАК Партнер,
	|	&Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроектыПартнерыИКонтактныеЛица.Партнер КАК Партнер,
	|	ПроектыПартнерыИКонтактныеЛица.Ссылка.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты.ПартнерыИКонтактныеЛица КАК ПроектыПартнерыИКонтактныеЛица
	|		ПО ВТ_ТЧ.Партнер = ПроектыПартнерыИКонтактныеЛица.Партнер
	|			И ВТ_ТЧ.Родитель = ПроектыПартнерыИКонтактныеЛица.Ссылка.Родитель
	|ГДЕ
	|	НЕ ПроектыПартнерыИКонтактныеЛица.Ссылка.Завершен
	|	И НЕ ПроектыПартнерыИКонтактныеЛица.Ссылка.ПометкаУдаления
	|	И ПроектыПартнерыИКонтактныеЛица.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Родитель", 	Родитель);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("ТЧ", 		ПартнерыИКонтактныеЛица.Выгрузить());
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = "Партнер " + Выборка.Партнер + " уже защищен менеджером " + Выборка.Ответственный + ".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "ПартнерыИКонтактныеЛица",
		                                                  ,
		                                                  Отказ);
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&Вместо("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)
	
	Если ЭтоГруппа Тогда 
		// Была ошибка при вызове кода Взаимодействия.УстановитьПризнакАктивен(Ссылка, (НЕ Завершен) И (Не ПометкаУдаления));
		Возврат;
	Иначе
		ПродолжитьВызов(Отказ);
КонецЕсли;

КонецПроцедуры //-- смарт:ММ 15.02.2020
