
Перем ДатаИзмененияКэш;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПеренесеноСДоработками

//Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 07.09.2021 12:10:22
//&Перед("ПередЗаписью")
//Процедура смарт_ПередЗаписью1(Отказ)
//	ДатаИзмененияКэш = ДатаИзменения; // - адаптация Малыгина 30.01.2020
//КонецПроцедуры
//Смарт }Подкин Алексей Иванович 07.09.2021 12:10:22

//Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 07.09.2021 12:21:13
&После("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда
		Если ЭтотОбъект.ЭтоНовый() Тогда
			ДатаЗаметки = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
	//++ #1981 смарт: Фролов 21.08.2024 //Показ заметок по результатам квалификации Интереса в карточке Партнера.
	Если ТипЗнч(Предмет) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		смартПартнер = Предмет.Партнер;	
		
	КонецЕсли;
	//-- #1981 смарт: Фролов 21.08.2024
	
КонецПроцедуры
//Смарт }Подкин Алексей Иванович 07.09.2021 12:21:13


//&Вместо("ПередЗаписью")
//Процедура смарт_ПередЗаписью(Отказ)
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	Если ДополнительныеСвойства.Свойство("ПометкаУдаленияЗаметки") И ДополнительныеСвойства.ПометкаУдаленияЗаметки Тогда
//		Возврат;
//	КонецЕсли;
//		
//	Если ЗначениеЗаполнено(Родитель) И Родитель.Автор <> Автор Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нельзя указывать группу другого пользователя.'"));
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;
//	
//	Если Не ЭтоГруппа Тогда
//		//Богус++
//		//ДатаИзменения = ТекущаяДатаСеанса();
//		Если ЭтотОбъект.ЭтоНовый() Тогда
//			ДатаЗаметки = ТекущаяДатаСеанса();
//		КонецЕсли;	
//		//Богус--
//		ПредставлениеПредмета = ОбщегоНазначения.ПредметСтрокой(Предмет);
//		
//		Позиция = СтрНайти(ТекстСодержания, Символы.ПС);
//		Если Позиция > 0 Тогда
//			Тема = Сред(ТекстСодержания, 1, Позиция - 1);
//		Иначе
//			Тема = ТекстСодержания;
//		КонецЕсли;
//		
//		Если ПустаяСтрока(Тема) Тогда 
//			Тема = "<" + НСтр("ru = 'Пустая заметка'") + ">";
//		КонецЕсли;
//		
//		МаксимальнаяДлинаНаименования = Метаданные().ДлинаНаименования;
//		Если СтрДлина(Тема) > МаксимальнаяДлинаНаименования Тогда
//			Тема = Лев(Наименование, МаксимальнаяДлинаНаименования - 3) + "...";
//		КонецЕсли;
//		
//		Наименование = Тема;
//	КонецЕсли;
//КонецПроцедуры

#КонецОбласти
#КонецЕсли