
#Область ДоработкиСмарт

#Область Команды

&НаКлиенте
Процедура смартВывестиРезультатЗапроса(Команда)
	смартВывестиРезультатЗапросаСервер();
КонецПроцедуры

&НаКлиенте
Процедура смартСохранитьРезультатЗапроса(Команда)
	смартСохранитьРезультатЗапросаСервер();
КонецПроцедуры

&НаКлиенте
Процедура смартОткрытьКонструкторЗапроса(Команда)
	ТекстЗапросаВФорме=смартТекстЗапроса.ПолучитьТекст();
	КонструкторЗапроса=Новый КонструкторЗапроса(ТекстЗапросаВФорме);
	КонструкторЗапроса.Показать(Новый ОписаниеОповещения("ПослеЗакрытияКонструктораЗапроса",ЭтотОбъект));
КонецПроцедуры

#КонецОбласти


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ПослеЗакрытияКонструктораЗапроса(Текст,ДопПараметры)Экспорт 
	Если Не Текст=Неопределено Тогда 
		смартТекстЗапроса.УстановитьТекст(Текст);
		смартТекстЗапросаПриИзменении(Неопределено);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура смартТекстЗапросаПриИзменении(Элемент)
	ТекстЗапроса=смартТекстЗапроса.ПолучитьТекст();
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Элементы.ГруппаПараметрыЗапроса.Скрыть();
		Возврат;
	КонецЕсли;
	смартЗаполнитьПараметрыЗапросаСервер(ТекстЗапроса);	
КонецПроцедуры

#КонецОбласти


#Область СерверныеПроцедурыФункции

&НаСервере
Процедура смартВывестиРезультатЗапросаСервер()
	смартРезультатЗапроса.Очистить();
	Построитель=Новый ПостроительОтчета;
	Построитель.Текст=смартТекстЗапроса.ПолучитьТекст();
	Отбор=смартКомпановка.Настройки.Отбор;
	Для Каждого Эл Из Отбор.Элементы Цикл 
		Построитель.Параметры.Вставить(?(Эл.ПредставлениеПользовательскойНастройки="",Эл.ЛевоеЗначение,Эл.ПредставлениеПользовательскойНастройки)
									,?(ТипЗнч(Эл.ПравоеЗначение)=Тип("СтандартнаяДатаНачала"),Эл.ПравоеЗначение.Дата,Эл.ПравоеЗначение));
	КонецЦикла;	
	Попытка
		Построитель.Выполнить();
		Построитель.Вывести(смартРезультатЗапроса);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,"смартТекстЗапроса");
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура смартСохранитьРезультатЗапросаСервер()
	Запрос=Новый Запрос(смартТекстЗапроса.ПолучитьТекст());
	Отбор=смартКомпановка.Настройки.Отбор;
	Для Каждого Эл Из Отбор.Элементы Цикл 
		Запрос.УстановитьПараметр(?(Эл.ПредставлениеПользовательскойНастройки="",Эл.ЛевоеЗначение,Эл.ПредставлениеПользовательскойНастройки)
									,?(ТипЗнч(Эл.ПравоеЗначение)=Тип("СтандартнаяДатаНачала"),Эл.ПравоеЗначение.Дата,Эл.ПравоеЗначение));
	КонецЦикла;
	Рез=Запрос.Выполнить().Выгрузить();
	//Если Не (Рез.Колонки.Найти("Контакт")=Неопределено И Рез.Колонки.Найти("КонтактнаяИнформация")=Неопределено) Тогда 
	//	Объект.ДополнительныеПолучатели.Загрузить(Рез);
	Если ТипЗнч(Рез[0][0])=Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Рез[0][0])=Тип("СправочникСсылка.КонтактныеЛицаПартнеров") 
		И ТипЗнч(Рез[0][1])=Тип("Строка") Тогда 
			
		Для Каждого Эл Из Рез Цикл 
			Стр=Объект.ДополнительныеПолучатели.Добавить();
			Стр.Контакт=Эл[0];
			Стр.КонтактнаяИнформация=Эл[1];
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В результате выполнения произвольного запроса должна быть сформирована таблица:
					|Колонка № 1, Наименование 'Контакт', типы: СправочникСсылка.Партнеры, СправочникСсылка.КонтактныеЛицаПартнеров
					|Колонка № 2, Наименование 'КонтактнаяИнформация', тип: Строка");
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура смартЗаполнитьПараметрыЗапросаСервер(ТекстЗапроса)
	МассивПараметровЗапроса=смартПолучитьПараметрыЗапроса(ТекстЗапроса);
	Если МассивПараметровЗапроса=Неопределено Тогда 
		Элементы.ГруппаПараметрыЗапроса.Скрыть();
	Иначе
		СКД=Новый СхемаКомпоновкиДанных;
		ИсточникДанных=СКД.ИсточникиДанных.Добавить();
		ИсточникДанных.Имя="Запрос";
		ИсточникДанных.ТипИсточникаДанных="Local";
		Данные=СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		Данные.Запрос=ТекстЗапроса;
		Данные.АвтоЗаполнениеДоступныхПолей=Истина;
		Данные.Имя="Запрос";
		Данные.ИсточникДанных="Запрос";
		
		Адрес=ПоместитьВоВременноеХранилище(СКД,УникальныйИдентификатор);
		ИсточникНастроек=Новый ИсточникДоступныхНастроекКомпоновкиДанных(Адрес);
		смартКомпановка.Инициализировать(ИсточникНастроек);
		
		Элементы.ГруппаПараметрыЗапроса.Показать();
		Отбор=смартКомпановка.Настройки.Отбор;
		Отбор.Элементы.Очистить();
		ПараметрыДанных=смартКомпановка.Настройки.ДоступныеПоляОтбора.Элементы.Найти(Новый ПолеКомпоновкиДанных("ПараметрыДанных")).Элементы;
		Для Каждого Эл Из МассивПараметровЗапроса Цикл
			Поле=ПараметрыДанных.Найти(Новый ПолеКомпоновкиДанных("ПараметрыДанных."+Эл.Имя));			
			ЭлементОтбора=Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных(Строка(Поле.Поле));
			ЭлементОтбора.ПредставлениеПользовательскойНастройки=Эл.Имя;
			ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение=ЗначениеИзСтрокиВнутр(Эл.Значение);	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция смартПолучитьПараметрыЗапроса(Текст)
	Запрос=Новый Запрос(Текст);
	ПараметрыЗапроса=Запрос.НайтиПараметры();
	Если ПараметрыЗапроса.Количество() Тогда
		МассивПараметров=Новый Массив;
		Для Каждого Стр Из ПараметрыЗапроса Цикл
			ЭлементПараметр=Новый Структура("Имя,Тип,Значение",Стр.Имя);
			ДоступныеТипы=Стр.ТипЗначения.Типы();
			
			Если ДоступныеТипы.Количество()=0 Тогда 
				ЭлементПараметр.Тип="Строка";
				ЭлементПараметр.Значение=ЗначениеВСтрокуВнутр("");
				МассивПараметров.Добавить(ЭлементПараметр);
				Продолжить;
			КонецЕсли;
			
			Массив=Новый Массив;
			Массив.Добавить(ДоступныеТипы.Получить(0));
			ОписаниеПипов=Новый ОписаниеТипов(Массив);
			
			Значение=ОписаниеПипов.ПривестиЗначение(Неопределено);
			ЭлементПараметр.Тип=Строка(ТипЗнч(Значение));
			ЭлементПараметр.Значение=ЗначениеВСтрокуВнутр(Значение);
			
			МассивПараметров.Добавить(ЭлементПараметр);
		КонецЦикла;
		Возврат МассивПараметров;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции	

#КонецОбласти

#КонецОбласти