//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 25.08.2020 13:42:27
&После("ПриКопировании")
Процедура смарт_ПриКопировании(Объект, ОбъектКопирования)
	  Объект.смартИдБитрикс="";
	  
	//++ #Б-1002 смарт: Лопато 30.09.2024 //Очищать поле серии в Заказе клиента при копировании  
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
		
		Для Каждого СтрокаТЧ Из Объект.Товары Цикл

			СтрокаТЧ.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
			
		КонецЦикла;

	КонецЕсли;
	//-- #Б-1002 смарт: Лопато 30.09.2024
	  
КонецПроцедуры      
//Смарт }Подкин Алексей Иванович 25.08.2020 13:42:27

&После("ДобавитьКомандыОтчетов")
Процедура смарт_ДобавитьКомандыОтчетовПосле(КомандыОтчетов, Параметры)

	//++#1323 смарт: Лопато 01.06.2024 //Восстановить и переделать механизм индивидуальных скидок  
	Отчеты.смартПрайсЛистИндивидуальныеСкидки.ДобавитьКомандуОтчета(КомандыОтчетов);
	//--#1323 смарт: Лопато 01.06.2024
	
КонецПроцедуры
