
#Область ПеренесеноСДоработками

&После("ПриКопировании")
Процедура смарт_ПриКопированииПосле(ОбъектКопирования)
	
	//++#1359 смарт: Лопато 13.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
	смартЗагруженИзАТС = Ложь;
	//--#1359 смарт: Лопато 13.09.2023
	
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка
	//++ #5296 смарт: Тимофеева 16.12.2025 / При перевыгрузке в Deeray, при указании партнера, необходимо рассчитывать теги.
	АбонентКонтактСсылки 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "АбонентКонтакт");
	ТегПодразделениеПартнера 	= ПланывидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", 
																						"ТегРечевойАналитики_ПодразделениеПартнера");
	ПодразделениеПартнера 		= УправлениеСвойствами.ЗначениеСвойства(Ссылка, ТегПодразделениеПартнера);
	ТегБизнесРегион			 	= ПланывидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", 
																						"ТегРечевойАналитики_БизнесРегион");
	БизнесРегион		 		= УправлениеСвойствами.ЗначениеСвойства(Ссылка, ТегБизнесРегион);

	Если НЕ АбонентКонтактСсылки = АбонентКонтакт 
		ИЛИ НЕ ЗначениеЗаполнено(ПодразделениеПартнера) 
		ИЛИ НЕ ЗначениеЗаполнено(БизнесРегион) Тогда		
		МассивТегов = Новый Массив;
		МассивТегов.Добавить(ТегПодразделениеПартнера);
		МассивТегов.Добавить(ТегБизнесРегион); 	
		ДополнительныеСвойства.Вставить("ПересчитатьТегиПриИзмененииПартнера", МассивТегов);
	КонецЕсли;
	//-- #5296 смарт: Тимофеева 16.12.2025
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Взаимодействия.ПриЗаписиДокумента(ЭтотОбъект);
	
	#Вставка
	//++ #5296 смарт: Тимофеева 16.12.2025 / При перевыгрузке в Deeray, при указании партнера, необходимо рассчитывать теги.
	МассивТегов = Неопределено;
	ДополнительныеСвойства.Свойство("ПересчитатьТегиПриИзмененииПартнера", МассивТегов);
	Если НЕ МассивТегов = Неопределено Тогда
		Для Каждого Тег Из МассивТегов Цикл
			смартИнтеграцияDeeray.РассчитатьТегУзлаТелефонногоЗвонка(Тег, Ссылка);
		КонецЦикла;
	КонецЕсли;
	//-- #5296 смарт: Тимофеева 16.12.2025
	#КонецВставки
КонецПроцедуры

#КонецОбласти
