
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  

// Возвращает КБК с учетом вида налогового обязательства
//
// Параметры:
//   ТипНалога                  - ПеречислениеСсылка.ТипыНалогов
//   ВидНалоговогоОбязательства - ПеречислениеСсылка.ВидыПлатежейВГосБюджет
//   Период                     - Дата
//
// Возвращаемое значение:
//   Строка
//
Функция КБКПоВидуНалоговогоОбязательства(ТипНалога, Знач ВидНалоговогоОбязательства = Неопределено, Знач Период = Неопределено) Экспорт
	
	КБК = КБКПоТипуНалога(ТипНалога);
	Если ПустаяСтрока(КБК) Тогда
		Возврат "";
	КонецЕсли;
	
	
	Возврат КБК;
	
КонецФункции
//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
Функция КБКПоТипуНалога(ТипНалога)
	
	КодБК = "";
	Если ТипНалога = ЕдиныйНалоговыйПлатеж Тогда
		КодБК = "18201061201010000510";	// ЕдиныйНалоговыйПлатеж
	
	
	КонецЕсли;
	
	Возврат КодБК;
	
КонецФункции
//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!

#КонецОбласти

#КонецЕсли

