
//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок
&НаСервере
Процедура ИспользоватьКвотыДляСтрокНаСервере(Пометка)
	Для Каждого Стр Из ЭтаФорма.ПодчиненныеЭлементы.Список.ВыделенныеСтроки Цикл
		МЗ=РегистрыСведений.смартОграничениеПродажиНоменклатурыПоКоличеству.СоздатьМенеджерЗаписи();
		МЗ.Номенклатура=Стр.Номенклатура;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.ИспользоватьКвотуДляДилера=Пометка;	
		КонецЕсли;
		МЗ.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры 

&НаСервере
Процедура УстановитьКвотыДляСтрокНаСервере(Результат)
    Если Не Результат = Неопределено Тогда
		Для Каждого Стр Из ЭтаФорма.ПодчиненныеЭлементы.Список.ВыделенныеСтроки Цикл
			МЗ=РегистрыСведений.смартОграничениеПродажиНоменклатурыПоКоличеству.СоздатьМенеджерЗаписи();
			МЗ.Номенклатура=Стр.Номенклатура;
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				МЗ.КвотаДляДилера=Результат;	
			КонецЕсли;
			МЗ.Записать(Истина);
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКвотыДляСтрок(Команда) 
	ИспользоватьКвотыДляСтрокНаСервере(Истина); 
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьКвотыДляСтрок(Команда)
	ИспользоватьКвотыДляСтрокНаСервере(Ложь); 
	Элементы.Список.Обновить();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьКвотыДляВыделенныхСтрок(Команда)
    Оповещение = Новый ОписаниеОповещения("ПослеВводаЧисла",ЭтаФорма);
    ПоказатьВводЧисла(Оповещение,,"Установите значение квоты",3, 0 ); 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВводаЧисла(Результат, Параметры) Экспорт
	УстановитьКвотыДляСтрокНаСервере(Результат);
	Элементы.Список.Обновить();
КонецПроцедуры
//-- #1319 смарт: Фролов 28.02.2023
     
   