
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Сегмент");
	Если Параметр <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(Параметр.Значение) ИЛИ Не Параметр.Использование Тогда
			Параметр.Значение = Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение;
			Параметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли