#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ВладелецКарточки);
	Если МетаданныеОбъекта <> Неопределено Тогда
		ВладелецКарточкиПредставление = МетаданныеОбъекта.Представление();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли