
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если ТипЗнч(ТекущиеДанные.Объект) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			Если ТипЗнч(ТекущиеДанные.Предмет) = Тип("СправочникСсылка.Партнеры") Тогда
				ПараметрыОткрытия = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ТекущиеДанные.Предмет, ТекущиеДанные.Объект);
				ОткрытьФорму("Справочник.Партнеры.ФормаОбъекта", ПараметрыОткрытия);
				//++ #Б-3640 смарт: Фролов 27.06.2025 //Добавление функционала работы с взаимодействиями в заявки СЦ.	
			ИначеЕсли ТипЗнч(ТекущиеДанные.Предмет) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку") Тогда
				ПараметрыОткрытия = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ТекущиеДанные.Предмет, ТекущиеДанные.Объект);
				ОткрытьФорму("Документ.смартЗаявкаНаПускоНаладку.Форма.ФормаДокумента", ПараметрыОткрытия);
			ИначеЕсли ТипЗнч(ТекущиеДанные.Предмет) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
				ПараметрыОткрытия = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ТекущиеДанные.Предмет, ТекущиеДанные.Объект);
				ОткрытьФорму("Документ.смартЗаявкаНаРемонтныеРаботы.Форма.ФормаДокумента", ПараметрыОткрытия);
				//-- #Б-3640 смарт: Фролов 27.06.2025
			Иначе
				ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаДокумента", Новый Структура("Ключ", ТекущиеДанные.Объект));
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Объект) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда	
			Если ТипЗнч(ТекущиеДанные.Предмет) = Тип("ДокументСсылка.CRM_Интерес") Тогда
				ПараметрыОткрытия = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ТекущиеДанные.Предмет, ТекущиеДанные.Объект);
				ОткрытьФорму("Документ.CRM_Интерес.ФормаОбъекта", ПараметрыОткрытия);
			ИначеЕсли ТипЗнч(ТекущиеДанные.Предмет) = Тип("СправочникСсылка.Партнеры") Тогда
				ПараметрыОткрытия = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ТекущиеДанные.Предмет, ТекущиеДанные.Объект);
				ОткрытьФорму("Справочник.Партнеры.ФормаОбъекта", ПараметрыОткрытия);
			ИначеЕсли ТипЗнч(ТекущиеДанные.ПредметСостояниеИнтереса) = Тип("СправочникСсылка.CRM_ТочкиМаршрутов") Тогда
				ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаДокумента", Новый Структура("Ключ", ТекущиеДанные.Предмет));
			Иначе	
				ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи", Новый Структура("Ключ", ТекущиеДанные.Объект));
			КонецЕсли;	
		Иначе	
			ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаДокументаНовая", Новый Структура("Ключ", ТекущиеДанные.Предмет));
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПоказателей()
	
	ТаблицаАвтор.Очистить();
	ТаблицаИсполнитель.Очистить();
	ТаблицаПоказателей.Очистить();
	//Взаимодействия_.Очистить();
	//Задачи_.Очистить();
	
	// Sma   
	ТаблицаОбщая.Очистить();
	
	ВзаимодействияТЗ = Новый ТаблицаЗначений();
	ВзаимодействияТЗ.Колонки.Добавить("Показатель");
	ВзаимодействияТЗ.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
	ВзаимодействияТЗ.Колонки.Добавить("КоличествоСегодня", Новый ОписаниеТипов("Число"));
	ВзаимодействияТЗ.Колонки.Добавить("КоличествоПросрочено", Новый ОписаниеТипов("Число"));
	ВзаимодействияТЗ.Колонки.Добавить("КоличествоЗавтра", Новый ОписаниеТипов("Число"));
	
	ЗадачиТЗ = Новый ТаблицаЗначений();
	ЗадачиТЗ.Колонки.Добавить("Показатель");
	ЗадачиТЗ.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
	ЗадачиТЗ.Колонки.Добавить("КоличествоСегодня", Новый ОписаниеТипов("Число"));
	ЗадачиТЗ.Колонки.Добавить("КоличествоПросрочено", Новый ОписаниеТипов("Число"));
	ЗадачиТЗ.Колонки.Добавить("КоличествоЗавтра", Новый ОписаниеТипов("Число"));
	
	Всего = 0;
	НаСегодня = 0;
	Просрочено = 0;
	ЗавершеноСегодня = 0;
	НаЗавтра = 0;
	
	Если ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
		
		Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартЖурналЗадачИВзаимодействий.Объект КАК Объект,
		|	смартЖурналЗадачИВзаимодействий.Дата КАК Дата,
		|	смартЖурналЗадачИВзаимодействий.Время КАК Время,
		|	смартЖурналЗадачИВзаимодействий.Предмет КАК Предмет,
		|	смартЖурналЗадачИВзаимодействий.Партнер КАК Партнер,
		|	смартЖурналЗадачИВзаимодействий.Контакт КАК Контакт,
		|	смартЖурналЗадачИВзаимодействий.Исполнитель КАК Исполнитель,
		|	смартЖурналЗадачИВзаимодействий.Автор КАК Автор,
		|	смартЖурналЗадачИВзаимодействий.Состояние КАК Состояние,
		|	смартЖурналЗадачИВзаимодействий.Вид КАК Вид,
		|	смартЖурналЗадачИВзаимодействий.Тип КАК Тип,
		|	смартЖурналЗадачИВзаимодействий.РучноеДобавление КАК РучноеДобавление,
		|	смартЖурналЗадачИВзаимодействий.ДатаЗавершения КАК ДатаЗавершения
		|ИЗ
		|	РегистрСведений.смартЖурналЗадачИВзаимодействий КАК смартЖурналЗадачИВзаимодействий
		|ГДЕ
		|	1 = 1
		|	И 2 = 2");
		
		Если ЗначениеЗаполнено(ЭтаФорма.Исполнитель) Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "смартЖурналЗадачИВзаимодействий.Исполнитель = &Исполнитель");
			Запрос.УстановитьПараметр("Исполнитель", ЭтаФорма.Исполнитель);
			
		КонецЕсли;
		
		Если ЭтаФорма.Состояние = "ВРаботе" Тогда
			
			СпсСостояний = Новый СписокЗначений;
			СпсСостояний.Добавить(Справочники.CRM_СостоянияСобытий.ВРаботе);
			СпсСостояний.Добавить(Справочники.CRM_СостоянияСобытий.Запланировано);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "смартЖурналЗадачИВзаимодействий.Состояние В (&СпсСостояний)");
			Запрос.УстановитьПараметр("СпсСостояний", СпсСостояний);
			
		КонецЕсли;
		Если ЭтаФорма.Состояние = "Завершено" Тогда
			
			СпсСостояний = Новый СписокЗначений;
			СпсСостояний.Добавить(Справочники.CRM_СостоянияСобытий.Завершено);
			СпсСостояний.Добавить(Справочники.CRM_СостоянияСобытий.Отменено);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "смартЖурналЗадачИВзаимодействий.Состояние В (&СпсСостояний)");
			Запрос.УстановитьПараметр("СпсСостояний", СпсСостояний);
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	//ПартнерЗадачи.Очистить();
	//ПартнерЗадачи.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Партнер"));
	//ПартнерЗадачи.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	//ПартнерЗадачи.ЗаполнитьПометки(Ложь);
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		Всего = Всего + 1;
		Если СтрРезультат.Тип = Перечисления.смартТипыДелСотрудников.Задача Тогда
			
			СтрокиЗадачи = ЗадачиТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
			Если СтрокиЗадачи.Количество() > 0 Тогда
				СтрокиЗадачи[0].КоличествоВсего = СтрокиЗадачи[0].КоличествоВсего + 1;
			Иначе	
				СтрЗадачи = ЗадачиТЗ.Добавить();
				СтрЗадачи.Показатель = СтрРезультат.Вид;
				СтрЗадачи.КоличествоВсего = 1;
			КонецЕсли;
			
		Иначе
			
			СтрокиВзаимодействия = ВзаимодействияТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
			Если СтрокиВзаимодействия.Количество() > 0 Тогда
				СтрокиВзаимодействия[0].КоличествоВсего = СтрокиВзаимодействия[0].КоличествоВсего + 1;
			Иначе	
				СтрВзаимодействия = ВзаимодействияТЗ.Добавить();
				СтрВзаимодействия.Показатель = СтрРезультат.Вид;
				СтрВзаимодействия.КоличествоВсего = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НачалоДня(СтрРезультат.Время) = НачалоДня(ТекущаяДата()) Тогда
			
			НаСегодня = НаСегодня + 1;
			
			Если СтрРезультат.Тип = Перечисления.смартТипыДелСотрудников.Задача Тогда
				
				СтрокиЗадачи = ЗадачиТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
				Если СтрокиЗадачи.Количество() > 0 Тогда
					СтрокиЗадачи[0].КоличествоСегодня = СтрокиЗадачи[0].КоличествоСегодня + 1;
				Иначе	
					СтрЗадачи = ЗадачиТЗ.Добавить();
					СтрЗадачи.Показатель = СтрРезультат.Вид;
					СтрЗадачи.КоличествоСегодня = 1;
				КонецЕсли;
				
			Иначе
				
				СтрокиВзаимодействия = ВзаимодействияТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
				Если СтрокиВзаимодействия.Количество() > 0 Тогда
					СтрокиВзаимодействия[0].КоличествоСегодня = СтрокиВзаимодействия[0].КоличествоСегодня + 1;
				Иначе	
					СтрВзаимодействия = ВзаимодействияТЗ.Добавить();
					СтрВзаимодействия.Показатель = СтрРезультат.Вид;
					СтрВзаимодействия.КоличествоСегодня = 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НачалоДня(СтрРезультат.Время) = НачалоДня(ТекущаяДата() + 86400) Тогда
			
			НаЗавтра = НаЗавтра + 1;
			
			Если СтрРезультат.Тип = Перечисления.смартТипыДелСотрудников.Задача Тогда
				
				СтрокиЗадачи = ЗадачиТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
				Если СтрокиЗадачи.Количество() > 0 Тогда
					СтрокиЗадачи[0].КоличествоЗавтра = СтрокиЗадачи[0].КоличествоЗавтра + 1;
				Иначе	
					СтрЗадачи = ЗадачиТЗ.Добавить();
					СтрЗадачи.Показатель = СтрРезультат.Вид;
					СтрЗадачи.КоличествоЗавтра = 1;
				КонецЕсли;
				
			Иначе
				
				СтрокиВзаимодействия = ВзаимодействияТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
				Если СтрокиВзаимодействия.Количество() > 0 Тогда
					СтрокиВзаимодействия[0].КоличествоЗавтра = СтрокиВзаимодействия[0].КоличествоЗавтра + 1;
				Иначе	
					СтрВзаимодействия = ВзаимодействияТЗ.Добавить();
					СтрВзаимодействия.Показатель = СтрРезультат.Вид;
					СтрВзаимодействия.КоличествоЗавтра = 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрРезультат.ДатаЗавершения) И СтрРезультат.Время < ТекущаяДата() Тогда
			
			Просрочено = Просрочено + 1;
			
			Если СтрРезультат.Тип = Перечисления.смартТипыДелСотрудников.Задача Тогда
				
				СтрокиЗадачи = ЗадачиТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
				Если СтрокиЗадачи.Количество() > 0 Тогда
					СтрокиЗадачи[0].КоличествоПросрочено = СтрокиЗадачи[0].КоличествоПросрочено + 1;
				Иначе	
					СтрЗадачи = ЗадачиТЗ.Добавить();
					СтрЗадачи.Показатель = СтрРезультат.Вид;
					СтрЗадачи.КоличествоПросрочено = 1;
				КонецЕсли;
				
			Иначе
				
				СтрокиВзаимодействия = ВзаимодействияТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Вид));
				Если СтрокиВзаимодействия.Количество() > 0 Тогда
					СтрокиВзаимодействия[0].КоличествоПросрочено = СтрокиВзаимодействия[0].КоличествоПросрочено + 1;
				Иначе	
					СтрВзаимодействия = ВзаимодействияТЗ.Добавить();
					СтрВзаимодействия.Показатель = СтрРезультат.Вид;
					СтрВзаимодействия.КоличествоПросрочено = 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НачалоДня(СтрРезультат.ДатаЗавершения) >= НачалоДня(ТекущаяДата()) 
			И КонецДня(СтрРезультат.ДатаЗавершения) <= КонецДня(ТекущаяДата()) Тогда
			ЗавершеноСегодня = ЗавершеноСегодня + 1;	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
			
			СтрокиТаблицаАвтор = ТаблицаАвтор.НайтиСтроки(Новый Структура("Автор", СтрРезультат.Автор));
			Если СтрокиТаблицаАвтор.Количество() > 0 Тогда
				СтрокиТаблицаАвтор[0].Количество = СтрокиТаблицаАвтор[0].Количество + 1;
			Иначе	
				СтрТаблицаАвтор = ТаблицаАвтор.Добавить();
				СтрТаблицаАвтор.Автор = СтрРезультат.Автор;
				СтрТаблицаАвтор.Количество = 1;
			КонецЕсли;
			
			СтрокиТаблицаИсполнитель = ТаблицаИсполнитель.НайтиСтроки(Новый Структура("Исполнитель", СтрРезультат.Исполнитель));
			Если СтрокиТаблицаИсполнитель.Количество() > 0 Тогда
				СтрокиТаблицаИсполнитель[0].Количество = СтрокиТаблицаИсполнитель[0].Количество + 1;
			Иначе	
				СтрТаблицаИсполнитель = ТаблицаИсполнитель.Добавить();
				СтрТаблицаИсполнитель.Исполнитель = СтрРезультат.Исполнитель;
				СтрТаблицаИсполнитель.Количество = 1;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЖурналЗадачИВзаимодействий.Объект КАК Объект,
	|	смартЖурналЗадачИВзаимодействий.ДатаЗавершения КАК ДатаЗавершения
	|ИЗ
	|	РегистрСведений.смартЖурналЗадачИВзаимодействий КАК смартЖурналЗадачИВзаимодействий
	|ГДЕ
	|	1 = 1
	|	И смартЖурналЗадачИВзаимодействий.ДатаЗавершения МЕЖДУ &ДатаНач И &ДатаКон");
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	
	Если ЗначениеЗаполнено(ЭтаФорма.Исполнитель) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "смартЖурналЗадачИВзаимодействий.Исполнитель = &Исполнитель");
		Запрос.УстановитьПараметр("Исполнитель", ЭтаФорма.Исполнитель);
		
	КонецЕсли;
	
	ЗавершеноСегодня = Запрос.Выполнить().Выбрать().Количество();
	
	Если  ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
		
		Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		Для Каждого СтрРезультат Из Результат Цикл
			
			СтрокиТаблицаАвтор = ТаблицаАвтор.НайтиСтроки(Новый Структура("Автор", СтрРезультат.Автор));
			Если СтрокиТаблицаАвтор.Количество() > 0 Тогда
				СтрокиТаблицаАвтор[0].Количество = СтрокиТаблицаАвтор[0].Количество + 1;
			Иначе	
				СтрТаблицаАвтор = ТаблицаАвтор.Добавить();
				СтрТаблицаАвтор.Автор = СтрРезультат.Автор;
				СтрТаблицаАвтор.Количество = 1;
			КонецЕсли;
			
			СтрокиТаблицаИсполнитель = ТаблицаИсполнитель.НайтиСтроки(Новый Структура("Исполнитель", СтрРезультат.Исполнитель));
			Если СтрокиТаблицаИсполнитель.Количество() > 0 Тогда
				СтрокиТаблицаИсполнитель[0].Количество = СтрокиТаблицаИсполнитель[0].Количество + 1;
			Иначе	
				СтрТаблицаИсполнитель = ТаблицаИсполнитель.Добавить();
				СтрТаблицаИсполнитель.Исполнитель = СтрРезультат.Исполнитель;
				СтрТаблицаИсполнитель.Количество = 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	СтрТаблицаПоказателей = ТаблицаПоказателей.Добавить();
	СтрТаблицаПоказателей.Показатель = "Всего";
	СтрТаблицаПоказателей.Количество = Всего;
	
	СтрТаблицаПоказателей = ТаблицаПоказателей.Добавить();
	СтрТаблицаПоказателей.Показатель = "На сегодня";
	СтрТаблицаПоказателей.Количество = НаСегодня; 
	
	СтрТаблицаПоказателей = ТаблицаПоказателей.Добавить();
	СтрТаблицаПоказателей.Показатель = "На завтра";
	СтрТаблицаПоказателей.Количество = НаЗавтра;
	
	СтрТаблицаПоказателей = ТаблицаПоказателей.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просрочено";
	СтрТаблицаПоказателей.Количество = Просрочено;
	
	СтрТаблицаПоказателей = ТаблицаПоказателей.Добавить();
	СтрТаблицаПоказателей.Показатель = "Завершено сегодня";
	СтрТаблицаПоказателей.Количество = ЗавершеноСегодня;
	
	ТаблицаИсполнитель.Сортировать("Исполнитель Возр");
	
	////////////////////////////////////////////////////////////////////////////
	
	// sma  
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = "Всего";
	СтрТаблицаПоказателей.КоличествоПросрочено = Всего;
	СтрТаблицаПоказателей.ВидСтроки = 1; 
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просрочено";
	СтрТаблицаПоказателей.КоличествоПросрочено = Просрочено;
	СтрТаблицаПоказателей.ВидСтроки = 1;
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = "На сегодня";
	СтрТаблицаПоказателей.КоличествоПросрочено = НаСегодня; 
	СтрТаблицаПоказателей.ВидСтроки = 1;
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = "На завтра";
	СтрТаблицаПоказателей.КоличествоПросрочено = НаЗавтра;
	СтрТаблицаПоказателей.ВидСтроки = 1;
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	
	СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
	СтрТаблицаПоказателей.Показатель = "Завершено сегодня";
	СтрТаблицаПоказателей.КоличествоПросрочено = ЗавершеноСегодня;
	СтрТаблицаПоказателей.ВидСтроки = 1;
	
	ТаблицаАвтор.Сортировать("Автор Возр");
	ТаблицаИсполнитель.Сортировать("Исполнитель Возр");
	
	//  
	Если ТекущаяСтраница = "МоиДела" Тогда
		ТаблицаЧастное.Очистить();
		
		Если ВзаимодействияТЗ.Количество() <> 0 Тогда
			
			ВзаимодействияТЗ.Сортировать("КоличествоПросрочено Убыв,КоличествоСегодня Убыв,КоличествоВсего Убыв");
			
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			СтрТаблицаПоказателей.Показатель = " ";
			СтрТаблицаПоказателей.ВидСтроки = 2;
			
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			СтрТаблицаПоказателей.Показатель = " Взаимодействия";
			СтрТаблицаПоказателей.ВидСтроки = 2;
			
			//СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
			//СтрТаблицаПоказателей.Показатель = " ";
			
			Для Каждого Стр Из ВзаимодействияТЗ Цикл
				СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТаблицаПоказателей,Стр);
				СтрТаблицаПоказателей.ВидСтроки = 3;
			КонецЦикла;	
			
		КонецЕсли;
		
		//
		
		Если ЗадачиТЗ.Количество() <> 0 Тогда
			
			ЗадачиТЗ.Сортировать("КоличествоПросрочено Убыв,КоличествоСегодня Убыв,КоличествоВсего Убыв");
			
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			СтрТаблицаПоказателей.Показатель = " ";
			СтрТаблицаПоказателей.ВидСтроки = 2;
			
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			СтрТаблицаПоказателей.Показатель = " Задачи";
			СтрТаблицаПоказателей.ВидСтроки = 2;
			
			//СтрТаблицаПоказателей = ТаблицаОбщая.Добавить();
			//СтрТаблицаПоказателей.Показатель = " ";
			
			Для Каждого Стр Из ЗадачиТЗ Цикл
				СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТаблицаПоказателей,Стр);
				СтрТаблицаПоказателей.ВидСтроки = 3;
			КонецЦикла;	
			
		КонецЕсли; 
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " ";
		СтрТаблицаПоказателей.ВидСтроки = 4;
		
	КонецЕсли;
	
	//
	
	ТЗКолВо = ТаблицаАвтор.Выгрузить(,"Количество");
	ТЗКолВо.Свернуть(,"Количество");
	
	НовСтр = ТаблицаАвтор.Добавить();
	НовСтр.Автор = "Все";
	Если ТЗКолВо.Количество() > 0 Тогда
		НовСтр.Количество = ТЗКолВо[0].Количество;
	Иначе
		НовСтр.Количество = 0;
	КонецЕсли;
	ТаблицаАвтор.Сортировать("Количество убыв");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПоказателейИнтерес()
	
	ТаблицаЧастное.Очистить();
	
	ИнтересыТЗ = Новый ТаблицаЗначений();
	ИнтересыТЗ.Колонки.Добавить("Показатель");
	ИнтересыТЗ.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
	ИнтересыТЗ.Колонки.Добавить("КоличествоСегодня", Новый ОписаниеТипов("Число"));
	ИнтересыТЗ.Колонки.Добавить("КоличествоПросрочено", Новый ОписаниеТипов("Число"));
	ИнтересыТЗ.Колонки.Добавить("КоличествоЗавтра", Новый ОписаниеТипов("Число"));
	
	КвалификацииТЗ = Новый ТаблицаЗначений();
	КвалификацииТЗ.Колонки.Добавить("Показатель");
	КвалификацииТЗ.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
	КвалификацииТЗ.Колонки.Добавить("КоличествоСегодня", Новый ОписаниеТипов("Число"));
	КвалификацииТЗ.Колонки.Добавить("КоличествоПросрочено", Новый ОписаниеТипов("Число"));
	КвалификацииТЗ.Колонки.Добавить("КоличествоЗавтра", Новый ОписаниеТипов("Число"));
	
	ПартнерыТЗ = Новый ТаблицаЗначений();
	ПартнерыТЗ.Колонки.Добавить("Показатель");
	ПартнерыТЗ.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
	ПартнерыТЗ.Колонки.Добавить("КоличествоСегодня", Новый ОписаниеТипов("Число"));
	ПартнерыТЗ.Колонки.Добавить("КоличествоПросрочено", Новый ОписаниеТипов("Число"));
	ПартнерыТЗ.Колонки.Добавить("КоличествоЗавтра", Новый ОписаниеТипов("Число"));
	
	Если ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
		
		Схема = Элементы.ДСИнтересы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.ДСИнтересы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	CRM_Интерес.Ссылка КАК Ссылка,
		|	CRM_Интерес.Ответственный КАК Ответственный,
		|	CRM_Интерес.Партнер КАК Партнер,
		|	CRM_Интерес.ТипУслуги КАК ТипУслуги,
		|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ВЫБОР
		|		КОГДА CRM_Интерес.смартИтоговаяКвалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка)
		|			ТОГДА CRM_Интерес.смартПредварительнаяКвалификация
		|		ИНАЧЕ CRM_Интерес.смартИтоговаяКвалификация
		|	КОНЕЦ КАК Квалификация,
		|	CRM_Интерес.Завершен КАК Завершен
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	1 = 1
		|	И 2 = 2");
		
		Если ЗначениеЗаполнено(ЭтаФорма.ОтветственныйИнтерес) Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "CRM_Интерес.Ответственный = &ОтветственныйИнтерес");
			Запрос.УстановитьПараметр("ОтветственныйИнтерес", ЭтаФорма.ОтветственныйИнтерес);
			
		КонецЕсли;
		Если ЭтаФорма.СостояниеИнтерес = "ВРаботе" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "НЕ CRM_Интерес.Завершен");
			
		КонецЕсли;
		Если ЭтаФорма.СостояниеИнтерес = "Завершен" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "CRM_Интерес.Завершен");
			
		КонецЕсли;
		
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		СтрокиИнтересы = ИнтересыТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.СостояниеИнтереса));
		Если СтрокиИнтересы.Количество() > 0 Тогда
			СтрокиИнтересы[0].КоличествоВсего = СтрокиИнтересы[0].КоличествоВсего + 1;
		Иначе	
			СтрокиИнтересы = ИнтересыТЗ.Добавить();
			СтрокиИнтересы.Показатель = СтрРезультат.СостояниеИнтереса;
			СтрокиИнтересы.КоличествоВсего = 1;
		КонецЕсли;
		
		СтрокиКвалификации = КвалификацииТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Квалификация));
		Если СтрокиКвалификации.Количество() > 0 Тогда
			СтрокиКвалификации[0].КоличествоВсего = СтрокиКвалификации[0].КоличествоВсего + 1;
		Иначе	
			СтрокиКвалификации = КвалификацииТЗ.Добавить();
			СтрокиКвалификации.Показатель = СтрРезультат.Квалификация;
			СтрокиКвалификации.КоличествоВсего = 1;
		КонецЕсли;
		
		СтрокиПартнеры = ПартнерыТЗ.НайтиСтроки(Новый Структура("Показатель", СтрРезультат.Партнер));
		Если СтрокиПартнеры.Количество() > 0 Тогда
			СтрокиПартнеры[0].КоличествоВсего = СтрокиПартнеры[0].КоличествоВсего + 1;
		Иначе	
			СтрокиПартнеры = ПартнерыТЗ.Добавить();
			СтрокиПартнеры.Показатель = СтрРезультат.Партнер;
			СтрокиПартнеры.КоличествоВсего = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	
	
	Схема = Элементы.ДСУДругихНаКонтроле.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.ДСУДругихНаКонтроле.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	РезультатДСУМеняНаКонтроле = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "МОИ ИНТЕРЕСЫ НА КОНТРОЛЕ";
	СтрТаблицаПоказателей.КоличествоВсего = РезультатДСУМеняНаКонтроле.Количество();
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	
	Если ИнтересыТЗ.Количество() <> 0 Тогда
		
		ИнтересыТЗ.Сортировать("КоличествоВсего Убыв");
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " ";
		СтрТаблицаПоказателей.ВидСтроки = 2;
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " Состояния интересов";
		СтрТаблицаПоказателей.ВидСтроки = 2;
		
		Для Каждого Стр Из ИнтересыТЗ Цикл
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТаблицаПоказателей,Стр);
			СтрТаблицаПоказателей.ВидСтроки = 3;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если КвалификацииТЗ.Количество() <> 0 Тогда
		
		КвалификацииТЗ.Сортировать("КоличествоВсего Убыв");
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " ";
		СтрТаблицаПоказателей.ВидСтроки = 2;
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " Квалификации";
		СтрТаблицаПоказателей.ВидСтроки = 2;
		
		Для Каждого Стр Из КвалификацииТЗ Цикл
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТаблицаПоказателей,Стр);
			СтрТаблицаПоказателей.ВидСтроки = 3;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ПартнерыТЗ.Количество() <> 0 Тогда
		
		ПартнерыТЗ.Сортировать("КоличествоВсего Убыв");
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " ";
		СтрТаблицаПоказателей.ВидСтроки = 2;
		
		СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
		СтрТаблицаПоказателей.Показатель = " Партнеры";
		СтрТаблицаПоказателей.ВидСтроки = 2;
		
		Для Каждого Стр Из ПартнерыТЗ Цикл
			СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТаблицаПоказателей,Стр);
			СтрТаблицаПоказателей.ВидСтроки = 3;
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПоказателейДокументыСЦ()
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьТаблицуПоказателейПартнеры()
	
	ТаблицаЧастное.Очистить();
	
	Закрепленные = 0;
	НеЗакрепленные = 0;
	ВзаимодействияЗапланированы = 0;
	ВзаимодействияНеЗапланированы = 0;
	ВзаимодействияЗапланированыНеЗакрепленные = 0;
	ВзаимодействияНеЗапланированыНеЗакрепленные = 0;
	ПросроченныеВзаимодействия = 0;
	ПросроченныеВзаимодействияНеЗакрепленные = 0;
	СтанутСвободнымиЧерез10Дн = 0;
	ЕстьАктивныйИнтерес = 0;
	Закрепленные = 0;
	НеЗакрепленные = 0;
	ВзаимодействияЗапланированыСИнтересом = 0;
	ВзаимодействияНеЗапланированыСИнтересом = 0;
	ПросроченныеВзаимодействияСИнтересом = 0;
	
	Если ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
		
		Схема = Элементы.ДСПартнеры.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.ДСПартнеры.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаказКлиента.Партнер КАК Партнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаказов
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	НЕ ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|	И ЗаказКлиента.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Партнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер КАК Партнер,
		|	МАКСИМУМ(смартИсторияЗакрепленияПартнеровСрезПоследних.Период) КАК Период,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер КАК Менеджер
		|ПОМЕСТИТЬ Закрепления
		|ИЗ
		|	РегистрСведений.смартИсторияЗакрепленияПартнеров.СрезПоследних(, ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаТоварыУслуги)) КАК смартИсторияЗакрепленияПартнеровСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Интерес.ДатаЗакрытия) КАК Дата
		|ПОМЕСТИТЬ Интересы
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.ПометкаУдаления
		|	И (CRM_Интерес.СостояниеИнтереса.ВидСостояния <> ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|			ИЛИ CRM_Интерес.СостояниеИнтереса.ВидСостояния <> ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение))
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.ОсновнойМенеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Партнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Интерес.Дата) КАК Дата
		|ПОМЕСТИТЬ НЕЗакрытыеИнтересы
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.ПометкаУдаления
		|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение)
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.ОсновнойМенеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	CRM_Интерес.Дата КАК Дата,
		|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса
		|ПОМЕСТИТЬ ПоследнийИнтересДанные
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НЕЗакрытыеИнтересы КАК НЕЗакрытыеИнтересы
		|		ПО CRM_Интерес.Партнер = НЕЗакрытыеИнтересы.Партнер
		|			И CRM_Интерес.Дата = НЕЗакрытыеИнтересы.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Партнер,
		|	Партнеры.ДатаРегистрации КАК ДатаРегистрации,
		|	Закрепления.Период КАК ПериодЗакрепления,
		|	Партнеры.БизнесРегион КАК БизнесРегион,
		|	Партнеры.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Заказы.КоличествоЗаказов, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктивныйЗаказ,
		|	смартСостояниеПартнеров.ДатаЗапланированногоВзаимодействия КАК ДатаЗапланированногоВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Закрепления.Период, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Закрепления.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	КОНЕЦ КАК Закреплен,
		|	ПоследнийИнтересДанные.Дата КАК ДатаАктивныйИнтерес,
		|	"""" КАК Р,
		|	ПоследнийИнтересДанные.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоследнийИнтересДанные.Дата, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АнализироватьВК,
		|	ВЫБОР
		|		КОГДА Закрепления.Период > ЕСТЬNULL(смартСостояниеПартнеров.ДатаПоследнегоВзаимодействия, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА Закрепления.Период
		|		ИНАЧЕ смартСостояниеПартнеров.ДатаПоследнегоВзаимодействия
		|	КОНЕЦ КАК ДатаКасания,
		|	ВЫБОР
		|		КОГДА Закрепления.Период > ЕСТЬNULL(Интересы.Дата, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА Закрепления.Период
		|		ИНАЧЕ Интересы.Дата
		|	КОНЕЦ КАК ДатаЗакреплениеИлиИнтерес,
		|	Интересы.Дата КАК ИнтересыДата,
		|	Партнеры.смартМенеджерПоРасходнымМатериалам КАК МенеджерПоРасходнымМатериалам,
		|	Партнеры.смартОсновнойМенеджерСервисЦентра КАК МенеджерСервисЦентра,
		|	смартСостояниеПартнеров.Состояние КАК Состояние,
		|	смартСостояниеПартнеров.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
		|	смартСостояниеПартнеров.СуммаПродажОборудования КАК СуммаПродажОборудования,
		|	смартСостояниеПартнеров.СуммаПродажЗапчастей КАК СуммаПродажЗапчастей,
		|	смартСостояниеПартнеров.СуммаПродажРасходников КАК СуммаПродажРасходников,
		|	смартСостояниеПартнеров.ДатаПоследнегоВзаимодействия КАК ДатаПоследнегоВзаимодействия,
		|	смартСостояниеПартнеров.ДатаПоследнегоЗвонка КАК ДатаПоследнегоЗвонка,
		|	смартСостояниеПартнеров.СтанетСвободнымЧерез КАК СтанетСвободнымЧерез
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заказы КАК Заказы
		|		ПО Партнеры.Ссылка = Заказы.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Закрепления КАК Закрепления
		|		ПО Партнеры.Ссылка = Закрепления.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийИнтересДанные КАК ПоследнийИнтересДанные
		|		ПО Партнеры.Ссылка = ПоследнийИнтересДанные.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Интересы КАК Интересы
		|		ПО Партнеры.Ссылка = Интересы.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
		|		ПО Партнеры.Ссылка = смартСостояниеПартнеров.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_Взаимодействие.Ссылка) КАК КоличествоЗавершенных
		|ПОМЕСТИТЬ ЗавершенныеВзаимодействия
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Партнер КАК Ссылка,
		|	ИтоговаяТаблица.ДатаРегистрации КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Закреплен
		|			ТОГДА ИтоговаяТаблица.ПериодЗакрепления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ПериодЗакрепления,
		|	ИтоговаяТаблица.БизнесРегион КАК БизнесРегион,
		|	ИтоговаяТаблица.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ИтоговаяТаблица.АктивныйЗаказ КАК АктивныйЗаказ,
		|	ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия КАК ДатаЗапланированногоВзаимодействия,
		|	ИтоговаяТаблица.Закреплен КАК Закреплен,
		|	ИтоговаяТаблица.ДатаАктивныйИнтерес КАК ДатаАктивныйИнтерес,
		|	ИтоговаяТаблица.Р КАК Р,
		|	ИтоговаяТаблица.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ИтоговаяТаблица.АнализироватьВК КАК АнализироватьВК,
		|	ИтоговаяТаблица.ДатаКасания КАК ДатаКасания,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 90)
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВзаимодействияЗапланированы,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 90)
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтанутСвободнымиЧерез10Дн,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|					И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|				ИЛИ ЕСТЬNULL(ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВзаимодействияНеЗапланированы,
		|	ЗавершенныеВзаимодействия.КоличествоЗавершенных КАК КоличествоКасаний,
		|	ИтоговаяТаблица.ДатаЗакреплениеИлиИнтерес КАК ДатаЗакреплениеИлиИнтерес,
		|	ИтоговаяТаблица.ИнтересыДата КАК ИнтересыДата,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПросроченноеВзаимодействие,
		|	ИтоговаяТаблица.МенеджерПоРасходнымМатериалам КАК МенеджерПоРасходнымМатериалам,
		|	ИтоговаяТаблица.МенеджерСервисЦентра КАК МенеджерСервисЦентра,
		|	ИтоговаяТаблица.Состояние КАК Состояние,
		|	ИтоговаяТаблица.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
		|	ИтоговаяТаблица.СуммаПродажОборудования КАК СуммаПродажОборудования,
		|	ИтоговаяТаблица.СуммаПродажЗапчастей КАК СуммаПродажЗапчастей,
		|	ИтоговаяТаблица.СуммаПродажРасходников КАК СуммаПродажРасходников,
		|	НАЧАЛОПЕРИОДА(ИтоговаяТаблица.ДатаПоследнегоВзаимодействия, ДЕНЬ) КАК ДатаПоследнегоВзаимодействия,
		|	ИтоговаяТаблица.СтанетСвободнымЧерез КАК СтанетСвободным,
		|	ИтоговаяТаблица.СтанетСвободнымЧерез КАК СтанетСвободнымДней,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Партнер.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтандартнаяКартинка1,
		|	НАЧАЛОПЕРИОДА(ИтоговаяТаблица.ДатаПоследнегоЗвонка, ДЕНЬ) КАК ДатаПоследнегоЗвонка
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенныеВзаимодействия КАК ЗавершенныеВзаимодействия
		|		ПО ИтоговаяТаблица.Партнер = ЗавершенныеВзаимодействия.Партнер
		|ГДЕ
		|	1 = 1");
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		Если ЗначениеЗаполнено(ЭтаФорма.ОтветственныйПартнеры) Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИтоговаяТаблица.ОсновнойМенеджер = &ОтветственныйПартнеры");
			Запрос.УстановитьПараметр("ОтветственныйПартнеры", ЭтаФорма.ОтветственныйПартнеры);
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;	
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		Если СтрРезультат.Закреплен Тогда
			Закрепленные = Закрепленные + 1;
		Иначе	
			НеЗакрепленные = НеЗакрепленные + 1;
		КонецЕсли;
		
		Если СтрРезультат.АнализироватьВК Тогда
			Если СтрРезультат.Закреплен Тогда
				
				Если СтрРезультат.ВзаимодействияЗапланированы Тогда
					ВзаимодействияЗапланированы = ВзаимодействияЗапланированы + 1;
				КонецЕсли;
				
				Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
					ВзаимодействияНеЗапланированы = ВзаимодействияНеЗапланированы + 1;
				КонецЕсли;	
				
				Если СтрРезультат.СтанутСвободнымиЧерез10Дн Тогда
					СтанутСвободнымиЧерез10Дн = СтанутСвободнымиЧерез10Дн + 1;
				КонецЕсли;
				
				Если СтрРезультат.ПросроченноеВзаимодействие Тогда
					ПросроченныеВзаимодействия = ПросроченныеВзаимодействия + 1;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ СтрРезультат.Закреплен Тогда
				
				Если СтрРезультат.ВзаимодействияЗапланированы Тогда
					ВзаимодействияЗапланированыНеЗакрепленные = ВзаимодействияЗапланированыНеЗакрепленные + 1;
				КонецЕсли;
				
				Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
					ВзаимодействияНеЗапланированыНеЗакрепленные = ВзаимодействияНеЗапланированыНеЗакрепленные + 1;
				КонецЕсли;
				
				Если СтрРезультат.ПросроченноеВзаимодействие Тогда
					ПросроченныеВзаимодействияНеЗакрепленные = ПросроченныеВзаимодействияНеЗакрепленные + 1;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			
			ЕстьАктивныйИнтерес = ЕстьАктивныйИнтерес + 1;
			
			Если СтрРезультат.ВзаимодействияЗапланированы Тогда
				ВзаимодействияЗапланированыСИнтересом = ВзаимодействияЗапланированыСИнтересом + 1;
			КонецЕсли;
			
			Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
				ВзаимодействияНеЗапланированыСИнтересом = ВзаимодействияНеЗапланированыСИнтересом + 1;
			КонецЕсли;
			
			Если СтрРезультат.ПросроченноеВзаимодействие Тогда
				ПросроченныеВзаимодействияСИнтересом = ПросроченныеВзаимодействияСИнтересом + 1;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " Воронка касаний";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = "Закреплленные клиенты";
	//СтрТаблицаПоказателей.КоличествоВсего = Закрепленные;
	//СтрТаблицаПоказателей.ВидСтроки = 5;
	//СтрТаблицаПоказателей.ПоказательДляФормул = "ЗакреплленныеКлиенты";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированы;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированы";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированы;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированы";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Станут свободными через 10 дней";
	СтрТаблицаПоказателей.КоличествоВсего = СтанутСвободнымиЧерез10Дн;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "СтанутСвободнымиЧерез10Дн";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействия;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействия";
	
	
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Не закреплленные клиенты";
	СтрТаблицаПоказателей.КоличествоВсего = НеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "НеЗакреплленныеКлиенты";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированыНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированыНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированыНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированыНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействияНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействияНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " Воронка продаж";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	//
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " ";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Есть активный интерес";
	СтрТаблицаПоказателей.КоличествоВсего = ЕстьАктивныйИнтерес;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "АнализироватьВК";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированыСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированыСИнтересом";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированыСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированыСИнтересом";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействияСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействияСИнтересом";
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьТаблицуПоказателейПартнерыСЦ()
	
	ТаблицаЧастное.Очистить();
	
	Закрепленные = 0;
	НеЗакрепленные = 0;
	ВзаимодействияЗапланированы = 0;
	ВзаимодействияНеЗапланированы = 0;
	ВзаимодействияЗапланированыНеЗакрепленные = 0;
	ВзаимодействияНеЗапланированыНеЗакрепленные = 0;
	ПросроченныеВзаимодействия = 0;
	ПросроченныеВзаимодействияНеЗакрепленные = 0;
	СтанутСвободнымиЧерез10Дн = 0;
	ЕстьАктивныйИнтерес = 0;
	Закрепленные = 0;
	НеЗакрепленные = 0;
	ВзаимодействияЗапланированыСИнтересом = 0;
	ВзаимодействияНеЗапланированыСИнтересом = 0;
	ПросроченныеВзаимодействияСИнтересом = 0;
	
	Если ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
		
		Схема = Элементы.ДСПартнерыСЦ.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.ДСПартнерыСЦ.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаказКлиента.Партнер КАК Партнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаказов
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	НЕ ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|	И ЗаказКлиента.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Партнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер КАК Партнер,
		|	МАКСИМУМ(смартИсторияЗакрепленияПартнеровСрезПоследних.Период) КАК Период,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер КАК Менеджер
		|ПОМЕСТИТЬ Закрепления
		|ИЗ
		|	РегистрСведений.смартИсторияЗакрепленияПартнеров.СрезПоследних(, ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаЗапасныеЧасти)) КАК смартИсторияЗакрепленияПартнеровСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Интерес.ДатаЗакрытия) КАК Дата
		|ПОМЕСТИТЬ Интересы
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.ПометкаУдаления
		|	И (CRM_Интерес.СостояниеИнтереса.ВидСостояния <> ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|			ИЛИ CRM_Интерес.СостояниеИнтереса.ВидСостояния <> ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение))
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.смартОсновнойМенеджерСервисЦентра
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Партнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Интерес.Дата) КАК Дата
		|ПОМЕСТИТЬ НЕЗакрытыеИнтересы
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.ПометкаУдаления
		|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение)
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.смартОсновнойМенеджерСервисЦентра
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	CRM_Интерес.Дата КАК Дата,
		|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса
		|ПОМЕСТИТЬ ПоследнийИнтересДанные
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НЕЗакрытыеИнтересы КАК НЕЗакрытыеИнтересы
		|		ПО CRM_Интерес.Партнер = НЕЗакрытыеИнтересы.Партнер
		|			И CRM_Интерес.Дата = НЕЗакрытыеИнтересы.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Партнер,
		|	Партнеры.ДатаРегистрации КАК ДатаРегистрации,
		|	Закрепления.Период КАК ПериодЗакрепления,
		|	Партнеры.БизнесРегион КАК БизнесРегион,
		|	Партнеры.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Заказы.КоличествоЗаказов, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктивныйЗаказ,
		|	смартСостояниеПартнеров.ДатаЗапланированногоВзаимодействияСЦ КАК ДатаЗапланированногоВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Закрепления.Период, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Закрепления.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	КОНЕЦ КАК Закреплен,
		|	ПоследнийИнтересДанные.Дата КАК ДатаАктивныйИнтерес,
		|	"""" КАК Р,
		|	ПоследнийИнтересДанные.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоследнийИнтересДанные.Дата, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АнализироватьВК,
		|	ВЫБОР
		|		КОГДА Закрепления.Период > ЕСТЬNULL(смартСостояниеПартнеров.ДатаПоследнегоВзаимодействияСЦ, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА Закрепления.Период
		|		ИНАЧЕ смартСостояниеПартнеров.ДатаПоследнегоВзаимодействияСЦ
		|	КОНЕЦ КАК ДатаКасания,
		|	ВЫБОР
		|		КОГДА Закрепления.Период > ЕСТЬNULL(Интересы.Дата, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА Закрепления.Период
		|		ИНАЧЕ Интересы.Дата
		|	КОНЕЦ КАК ДатаЗакреплениеИлиИнтерес,
		|	Интересы.Дата КАК ИнтересыДата,
		|	Партнеры.смартМенеджерПоРасходнымМатериалам КАК МенеджерПоРасходнымМатериалам,
		|	Партнеры.смартОсновнойМенеджерСервисЦентра КАК МенеджерСервисЦентра,
		|	смартСостояниеПартнеров.СостояниеСЦ КАК Состояние,
		|	смартСостояниеПартнеров.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
		|	смартСостояниеПартнеров.СуммаПродажОборудования КАК СуммаПродажОборудования,
		|	смартСостояниеПартнеров.СуммаПродажЗапчастей КАК СуммаПродажЗапчастей,
		|	смартСостояниеПартнеров.СуммаПродажРасходников КАК СуммаПродажРасходников,
		|	смартСостояниеПартнеров.ДатаПоследнегоВзаимодействияСЦ КАК ДатаПоследнегоВзаимодействия,
		|	смартСостояниеПартнеров.ДатаПоследнегоЗвонкаСЦ КАК ДатаПоследнегоЗвонка,
		|	Партнеры.Код КАК Код,
		|	смартСостояниеПартнеров.СтанетСвободнымЧерез КАК СтанетСвободнымЧерез
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заказы КАК Заказы
		|		ПО Партнеры.Ссылка = Заказы.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Закрепления КАК Закрепления
		|		ПО Партнеры.Ссылка = Закрепления.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийИнтересДанные КАК ПоследнийИнтересДанные
		|		ПО Партнеры.Ссылка = ПоследнийИнтересДанные.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Интересы КАК Интересы
		|		ПО Партнеры.Ссылка = Интересы.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
		|		ПО Партнеры.Ссылка = смартСостояниеПартнеров.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_Взаимодействие.Ссылка) КАК КоличествоЗавершенных
		|ПОМЕСТИТЬ ЗавершенныеВзаимодействия
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Партнер КАК Ссылка,
		|	ИтоговаяТаблица.ДатаРегистрации КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Закреплен
		|			ТОГДА ИтоговаяТаблица.ПериодЗакрепления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ПериодЗакрепления,
		|	ИтоговаяТаблица.БизнесРегион КАК БизнесРегион,
		|	ИтоговаяТаблица.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ИтоговаяТаблица.АктивныйЗаказ КАК АктивныйЗаказ,
		|	ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия КАК ДатаЗапланированногоВзаимодействия,
		|	ИтоговаяТаблица.Закреплен КАК Закреплен,
		|	ИтоговаяТаблица.ДатаАктивныйИнтерес КАК ДатаАктивныйИнтерес,
		|	ИтоговаяТаблица.Р КАК Р,
		|	ИтоговаяТаблица.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ИтоговаяТаблица.АнализироватьВК КАК АнализироватьВК,
		|	ИтоговаяТаблица.ДатаКасания КАК ДатаКасания,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 90)
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВзаимодействияЗапланированы,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 90)
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтанутСвободнымиЧерез10Дн,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|					И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|				ИЛИ ЕСТЬNULL(ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВзаимодействияНеЗапланированы,
		|	ЗавершенныеВзаимодействия.КоличествоЗавершенных КАК КоличествоКасаний,
		|	ИтоговаяТаблица.ДатаЗакреплениеИлиИнтерес КАК ДатаЗакреплениеИлиИнтерес,
		|	ИтоговаяТаблица.ИнтересыДата КАК ИнтересыДата,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПросроченноеВзаимодействие,
		|	ИтоговаяТаблица.МенеджерПоРасходнымМатериалам КАК МенеджерПоРасходнымМатериалам,
		|	ИтоговаяТаблица.МенеджерСервисЦентра КАК МенеджерСервисЦентра,
		|	ИтоговаяТаблица.Состояние КАК Состояние,
		|	ИтоговаяТаблица.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
		|	ИтоговаяТаблица.СуммаПродажОборудования КАК СуммаПродажОборудования,
		|	ИтоговаяТаблица.СуммаПродажЗапчастей КАК СуммаПродажЗапчастей,
		|	ИтоговаяТаблица.СуммаПродажРасходников КАК СуммаПродажРасходников,
		|	НАЧАЛОПЕРИОДА(ИтоговаяТаблица.ДатаПоследнегоВзаимодействия, ДЕНЬ) КАК ДатаПоследнегоВзаимодействия,
		|	ИтоговаяТаблица.СтанетСвободнымЧерез КАК СтанетСвободным,
		|	ИтоговаяТаблица.СтанетСвободнымЧерез КАК СтанетСвободнымДней,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Партнер.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтандартнаяКартинка1,
		|	НАЧАЛОПЕРИОДА(ИтоговаяТаблица.ДатаПоследнегоЗвонка, ДЕНЬ) КАК ДатаПоследнегоЗвонка,
		|	ИтоговаяТаблица.Код КАК Код
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенныеВзаимодействия КАК ЗавершенныеВзаимодействия
		|		ПО ИтоговаяТаблица.Партнер = ЗавершенныеВзаимодействия.Партнер
		|ГДЕ
		|	1 = 1");
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		Если ЗначениеЗаполнено(ЭтаФорма.ОтветственныйПартнерыЗапчасти) Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИтоговаяТаблица.МенеджерСервисЦентра = &ОтветственныйПартнерыЗапчасти");
			Запрос.УстановитьПараметр("ОтветственныйПартнерыЗапчасти", ЭтаФорма.ОтветственныйПартнерыЗапчасти);
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;	
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		Если СтрРезультат.Закреплен Тогда
			Закрепленные = Закрепленные + 1;
		Иначе	
			НеЗакрепленные = НеЗакрепленные + 1;
		КонецЕсли;
		
		Если СтрРезультат.АнализироватьВК Тогда
			Если СтрРезультат.Закреплен Тогда
				
				Если СтрРезультат.ВзаимодействияЗапланированы Тогда
					ВзаимодействияЗапланированы = ВзаимодействияЗапланированы + 1;
				КонецЕсли;
				
				Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
					ВзаимодействияНеЗапланированы = ВзаимодействияНеЗапланированы + 1;
				КонецЕсли;	
				
				Если СтрРезультат.СтанутСвободнымиЧерез10Дн Тогда
					СтанутСвободнымиЧерез10Дн = СтанутСвободнымиЧерез10Дн + 1;
				КонецЕсли;
				
				Если СтрРезультат.ПросроченноеВзаимодействие Тогда
					ПросроченныеВзаимодействия = ПросроченныеВзаимодействия + 1;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ СтрРезультат.Закреплен Тогда
				
				Если СтрРезультат.ВзаимодействияЗапланированы Тогда
					ВзаимодействияЗапланированыНеЗакрепленные = ВзаимодействияЗапланированыНеЗакрепленные + 1;
				КонецЕсли;
				
				Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
					ВзаимодействияНеЗапланированыНеЗакрепленные = ВзаимодействияНеЗапланированыНеЗакрепленные + 1;
				КонецЕсли;
				
				Если СтрРезультат.ПросроченноеВзаимодействие Тогда
					ПросроченныеВзаимодействияНеЗакрепленные = ПросроченныеВзаимодействияНеЗакрепленные + 1;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			
			ЕстьАктивныйИнтерес = ЕстьАктивныйИнтерес + 1;
			
			Если СтрРезультат.ВзаимодействияЗапланированы Тогда
				ВзаимодействияЗапланированыСИнтересом = ВзаимодействияЗапланированыСИнтересом + 1;
			КонецЕсли;
			
			Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
				ВзаимодействияНеЗапланированыСИнтересом = ВзаимодействияНеЗапланированыСИнтересом + 1;
			КонецЕсли;
			
			Если СтрРезультат.ПросроченноеВзаимодействие Тогда
				ПросроченныеВзаимодействияСИнтересом = ПросроченныеВзаимодействияСИнтересом + 1;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " Воронка касаний";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = "Закреплленные клиенты";
	//СтрТаблицаПоказателей.КоличествоВсего = Закрепленные;
	//СтрТаблицаПоказателей.ВидСтроки = 5;
	//СтрТаблицаПоказателей.ПоказательДляФормул = "ЗакреплленныеКлиенты";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированы;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированы";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированы;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированы";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Станут свободными через 10 дней";
	СтрТаблицаПоказателей.КоличествоВсего = СтанутСвободнымиЧерез10Дн;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "СтанутСвободнымиЧерез10Дн";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействия;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействия";
	
	
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Не закреплленные клиенты";
	СтрТаблицаПоказателей.КоличествоВсего = НеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "НеЗакреплленныеКлиенты";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированыНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированыНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированыНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированыНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействияНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействияНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " Воронка продаж";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	//
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " ";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Есть активный интерес";
	СтрТаблицаПоказателей.КоличествоВсего = ЕстьАктивныйИнтерес;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "АнализироватьВК";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированыСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированыСИнтересом";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированыСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированыСИнтересом";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействияСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействияСИнтересом";
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПоказателейПартнерыРМ()
	
	ТаблицаЧастное.Очистить();
	
	Закрепленные = 0;
	НеЗакрепленные = 0;
	ВзаимодействияЗапланированы = 0;
	ВзаимодействияНеЗапланированы = 0;
	ВзаимодействияЗапланированыНеЗакрепленные = 0;
	ВзаимодействияНеЗапланированыНеЗакрепленные = 0;
	ПросроченныеВзаимодействия = 0;
	ПросроченныеВзаимодействияНеЗакрепленные = 0;
	СтанутСвободнымиЧерез10Дн = 0;
	ЕстьАктивныйИнтерес = 0;
	Закрепленные = 0;
	НеЗакрепленные = 0;
	ВзаимодействияЗапланированыСИнтересом = 0;
	ВзаимодействияНеЗапланированыСИнтересом = 0;
	ПросроченныеВзаимодействияСИнтересом = 0;
	
	Если ЭтаФорма.ОтображатьПоказателиСУчетомОтборов Тогда
		
		Схема = Элементы.ДСПартнерыРМ.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.ДСПартнерыРМ.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаказКлиента.Партнер КАК Партнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаказов
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	НЕ ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|	И ЗаказКлиента.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Партнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер КАК Партнер,
		|	МАКСИМУМ(смартИсторияЗакрепленияПартнеровСрезПоследних.Период) КАК Период,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер КАК Менеджер
		|ПОМЕСТИТЬ Закрепления
		|ИЗ
		|	РегистрСведений.смартИсторияЗакрепленияПартнеров.СрезПоследних(, ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаРасходныеМатериалы)) КАК смартИсторияЗакрепленияПартнеровСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Интерес.ДатаЗакрытия) КАК Дата
		|ПОМЕСТИТЬ Интересы
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.ПометкаУдаления
		|	И (CRM_Интерес.СостояниеИнтереса.ВидСостояния <> ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|			ИЛИ CRM_Интерес.СостояниеИнтереса.ВидСостояния <> ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение))
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.смартМенеджерПоРасходнымМатериалам
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Партнер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Интерес.Дата) КАК Дата
		|ПОМЕСТИТЬ НЕЗакрытыеИнтересы
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.ПометкаУдаления
		|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
		|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение)
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.смартМенеджерПоРасходнымМатериалам
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Интерес.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Интерес.Партнер КАК Партнер,
		|	CRM_Интерес.Дата КАК Дата,
		|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса
		|ПОМЕСТИТЬ ПоследнийИнтересДанные
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НЕЗакрытыеИнтересы КАК НЕЗакрытыеИнтересы
		|		ПО CRM_Интерес.Партнер = НЕЗакрытыеИнтересы.Партнер
		|			И CRM_Интерес.Дата = НЕЗакрытыеИнтересы.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Партнер,
		|	Партнеры.ДатаРегистрации КАК ДатаРегистрации,
		|	Закрепления.Период КАК ПериодЗакрепления,
		|	Партнеры.БизнесРегион КАК БизнесРегион,
		|	Партнеры.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Заказы.КоличествоЗаказов, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктивныйЗаказ,
		|	смартСостояниеПартнеров.ДатаЗапланированногоВзаимодействияРМ КАК ДатаЗапланированногоВзаимодействия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Закрепления.Период, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Закрепления.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	КОНЕЦ КАК Закреплен,
		|	ПоследнийИнтересДанные.Дата КАК ДатаАктивныйИнтерес,
		|	"""" КАК Р,
		|	ПоследнийИнтересДанные.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоследнийИнтересДанные.Дата, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АнализироватьВК,
		|	ВЫБОР
		|		КОГДА Закрепления.Период > ЕСТЬNULL(смартСостояниеПартнеров.ДатаПоследнегоВзаимодействияРМ, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА Закрепления.Период
		|		ИНАЧЕ смартСостояниеПартнеров.ДатаПоследнегоВзаимодействияРМ
		|	КОНЕЦ КАК ДатаКасания,
		|	ВЫБОР
		|		КОГДА Закрепления.Период > ЕСТЬNULL(Интересы.Дата, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА Закрепления.Период
		|		ИНАЧЕ Интересы.Дата
		|	КОНЕЦ КАК ДатаЗакреплениеИлиИнтерес,
		|	Интересы.Дата КАК ИнтересыДата,
		|	Партнеры.смартМенеджерПоРасходнымМатериалам КАК МенеджерПоРасходнымМатериалам,
		|	Партнеры.смартОсновнойМенеджерСервисЦентра КАК МенеджерСервисЦентра,
		|	смартСостояниеПартнеров.СостояниеРМ КАК Состояние,
		|	смартСостояниеПартнеров.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
		|	смартСостояниеПартнеров.СуммаПродажОборудования КАК СуммаПродажОборудования,
		|	смартСостояниеПартнеров.СуммаПродажЗапчастей КАК СуммаПродажЗапчастей,
		|	смартСостояниеПартнеров.СуммаПродажРасходников КАК СуммаПродажРасходников,
		|	смартСостояниеПартнеров.ДатаПоследнегоВзаимодействияРМ КАК ДатаПоследнегоВзаимодействия,
		|	смартСостояниеПартнеров.ДатаПоследнегоЗвонкаРМ КАК ДатаПоследнегоЗвонка,
		|	Партнеры.Код КАК Код,
		|	смартСостояниеПартнеров.СтанетСвободнымЧерез КАК СтанетСвободнымЧерез
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заказы КАК Заказы
		|		ПО Партнеры.Ссылка = Заказы.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Закрепления КАК Закрепления
		|		ПО Партнеры.Ссылка = Закрепления.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийИнтересДанные КАК ПоследнийИнтересДанные
		|		ПО Партнеры.Ссылка = ПоследнийИнтересДанные.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Интересы КАК Интересы
		|		ПО Партнеры.Ссылка = Интересы.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
		|		ПО Партнеры.Ссылка = смартСостояниеПартнеров.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_Взаимодействие.Ссылка) КАК КоличествоЗавершенных
		|ПОМЕСТИТЬ ЗавершенныеВзаимодействия
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Партнер КАК Ссылка,
		|	ИтоговаяТаблица.ДатаРегистрации КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Закреплен
		|			ТОГДА ИтоговаяТаблица.ПериодЗакрепления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ПериодЗакрепления,
		|	ИтоговаяТаблица.БизнесРегион КАК БизнесРегион,
		|	ИтоговаяТаблица.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ИтоговаяТаблица.АктивныйЗаказ КАК АктивныйЗаказ,
		|	ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия КАК ДатаЗапланированногоВзаимодействия,
		|	ИтоговаяТаблица.Закреплен КАК Закреплен,
		|	ИтоговаяТаблица.ДатаАктивныйИнтерес КАК ДатаАктивныйИнтерес,
		|	ИтоговаяТаблица.Р КАК Р,
		|	ИтоговаяТаблица.СостояниеИнтереса КАК СостояниеИнтереса,
		|	ИтоговаяТаблица.АнализироватьВК КАК АнализироватьВК,
		|	ИтоговаяТаблица.ДатаКасания КАК ДатаКасания,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 90)
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВзаимодействияЗапланированы,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 90)
		|				И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтанутСвободнымиЧерез10Дн,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ИтоговаяТаблица.ДатаКасания
		|					И ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия > ДОБАВИТЬКДАТЕ(ИтоговаяТаблица.ДатаКасания, ДЕНЬ, 100)
		|				ИЛИ ЕСТЬNULL(ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВзаимодействияНеЗапланированы,
		|	ЗавершенныеВзаимодействия.КоличествоЗавершенных КАК КоличествоКасаний,
		|	ИтоговаяТаблица.ДатаЗакреплениеИлиИнтерес КАК ДатаЗакреплениеИлиИнтерес,
		|	ИтоговаяТаблица.ИнтересыДата КАК ИнтересыДата,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ДатаЗапланированногоВзаимодействия < &ТекущаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПросроченноеВзаимодействие,
		|	ИтоговаяТаблица.МенеджерПоРасходнымМатериалам КАК МенеджерПоРасходнымМатериалам,
		|	ИтоговаяТаблица.МенеджерСервисЦентра КАК МенеджерСервисЦентра,
		|	ИтоговаяТаблица.Состояние КАК Состояние,
		|	ИтоговаяТаблица.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
		|	ИтоговаяТаблица.СуммаПродажОборудования КАК СуммаПродажОборудования,
		|	ИтоговаяТаблица.СуммаПродажЗапчастей КАК СуммаПродажЗапчастей,
		|	ИтоговаяТаблица.СуммаПродажРасходников КАК СуммаПродажРасходников,
		|	НАЧАЛОПЕРИОДА(ИтоговаяТаблица.ДатаПоследнегоВзаимодействия, ДЕНЬ) КАК ДатаПоследнегоВзаимодействия,
		|	ИтоговаяТаблица.СтанетСвободнымЧерез КАК СтанетСвободным,
		|	ИтоговаяТаблица.СтанетСвободнымЧерез КАК СтанетСвободнымДней,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Партнер.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтандартнаяКартинка1,
		|	НАЧАЛОПЕРИОДА(ИтоговаяТаблица.ДатаПоследнегоЗвонка, ДЕНЬ) КАК ДатаПоследнегоЗвонка,
		|	ИтоговаяТаблица.Код КАК Код
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенныеВзаимодействия КАК ЗавершенныеВзаимодействия
		|		ПО ИтоговаяТаблица.Партнер = ЗавершенныеВзаимодействия.Партнер
		|ГДЕ
		|	1 = 1");
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		Если ЗначениеЗаполнено(ЭтаФорма.ОтветственныйПартнерыРасходка) Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИтоговаяТаблица.МенеджерПоРасходнымМатериалам = &ОтветственныйПартнерыРасходка");
			Запрос.УстановитьПараметр("ОтветственныйПартнерыРасходка", ЭтаФорма.ОтветственныйПартнерыРасходка);
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;	
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		Если СтрРезультат.Закреплен Тогда
			Закрепленные = Закрепленные + 1;
		Иначе	
			НеЗакрепленные = НеЗакрепленные + 1;
		КонецЕсли;
		
		Если СтрРезультат.АнализироватьВК Тогда
			Если СтрРезультат.Закреплен Тогда
				
				Если СтрРезультат.ВзаимодействияЗапланированы Тогда
					ВзаимодействияЗапланированы = ВзаимодействияЗапланированы + 1;
				КонецЕсли;
				
				Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
					ВзаимодействияНеЗапланированы = ВзаимодействияНеЗапланированы + 1;
				КонецЕсли;	
				
				Если СтрРезультат.СтанутСвободнымиЧерез10Дн Тогда
					СтанутСвободнымиЧерез10Дн = СтанутСвободнымиЧерез10Дн + 1;
				КонецЕсли;
				
				Если СтрРезультат.ПросроченноеВзаимодействие Тогда
					ПросроченныеВзаимодействия = ПросроченныеВзаимодействия + 1;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ СтрРезультат.Закреплен Тогда
				
				Если СтрРезультат.ВзаимодействияЗапланированы Тогда
					ВзаимодействияЗапланированыНеЗакрепленные = ВзаимодействияЗапланированыНеЗакрепленные + 1;
				КонецЕсли;
				
				Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
					ВзаимодействияНеЗапланированыНеЗакрепленные = ВзаимодействияНеЗапланированыНеЗакрепленные + 1;
				КонецЕсли;
				
				Если СтрРезультат.ПросроченноеВзаимодействие Тогда
					ПросроченныеВзаимодействияНеЗакрепленные = ПросроченныеВзаимодействияНеЗакрепленные + 1;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			
			ЕстьАктивныйИнтерес = ЕстьАктивныйИнтерес + 1;
			
			Если СтрРезультат.ВзаимодействияЗапланированы Тогда
				ВзаимодействияЗапланированыСИнтересом = ВзаимодействияЗапланированыСИнтересом + 1;
			КонецЕсли;
			
			Если СтрРезультат.ВзаимодействияНеЗапланированы Тогда
				ВзаимодействияНеЗапланированыСИнтересом = ВзаимодействияНеЗапланированыСИнтересом + 1;
			КонецЕсли;
			
			Если СтрРезультат.ПросроченноеВзаимодействие Тогда
				ПросроченныеВзаимодействияСИнтересом = ПросроченныеВзаимодействияСИнтересом + 1;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " Воронка касаний";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = "Закреплленные клиенты";
	//СтрТаблицаПоказателей.КоличествоВсего = Закрепленные;
	//СтрТаблицаПоказателей.ВидСтроки = 5;
	//СтрТаблицаПоказателей.ПоказательДляФормул = "ЗакреплленныеКлиенты";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированы;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированы";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированы;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированы";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Станут свободными через 10 дней";
	СтрТаблицаПоказателей.КоличествоВсего = СтанутСвободнымиЧерез10Дн;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "СтанутСвободнымиЧерез10Дн";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействия;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействия";
	
	
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Не закреплленные клиенты";
	СтрТаблицаПоказателей.КоличествоВсего = НеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "НеЗакреплленныеКлиенты";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированыНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированыНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированыНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированыНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействияНеЗакрепленные;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействияНеЗакрепленные";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " Воронка продаж";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	//
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " ";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Есть активный интерес";
	СтрТаблицаПоказателей.КоличествоВсего = ЕстьАктивныйИнтерес;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "АнализироватьВК";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияЗапланированыСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияЗапланированыСИнтересом";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Взаимодействия не запланированы";
	СтрТаблицаПоказателей.КоличествоВсего = ВзаимодействияНеЗапланированыСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ВзаимодействияНеЗапланированыСИнтересом";
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Просроченные взаимодействия";
	СтрТаблицаПоказателей.КоличествоВсего = ПросроченныеВзаимодействияСИнтересом;
	СтрТаблицаПоказателей.ВидСтроки = 5;
	СтрТаблицаПоказателей.ПоказательДляФормул = "ПросроченныеВзаимодействияСИнтересом";
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БезДублей = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДата(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСКонтактнаяИнформация, "Партнер", Справочники.Партнеры.ПустаяСсылка(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСОборудованиеЧернила, "Партнер", Справочники.Партнеры.ПустаяСсылка(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЧернилаОборудование, "Партнер", Справочники.Партнеры.ПустаяСсылка(), Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЗаметкиПартнерыИнтересы, "Предмет", Ложь, Истина);
	УстановитьПараметрыСпискаНоменклатуры(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	
	Исполнитель = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", Исполнитель, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОтветственныйИнтерес = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ответственный", ОтветственныйИнтерес, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОтветственныйПартнеры = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ОсновнойМенеджер", ОтветственныйПартнеры, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОтветственныйПартнерыЗапчасти = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыСЦ, "МенеджерСервисЦентра", ОтветственныйПартнерыЗапчасти, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОтветственныйПартнерыРасходка = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыРМ, "МенеджерПоРасходнымМатериалам", ОтветственныйПартнерыРасходка, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОтветственныйРекомендации = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСРекомендации, "Автор", ОтветственныйПартнеры, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
	
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("", "");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ЗакреплленныеКлиенты", "Закреплленные клиенты");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("НеЗакреплленныеКлиенты", "Не закреплленные клиенты");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ВзаимодействияЗапланированы", "Взаимодействия запланированы");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ПросроченныеВзаимодействия", "Просроченные взаимодействия");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ВзаимодействияЗапланированыНеЗакрепленные", "Взаимодействия запланированы не закрепленные");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ПросроченныеВзаимодействия", "Просроченные взаимодействия не закрепленные");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ВзаимодействияНеЗапланированы", "Взаимодействия не запланированы");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("ВзаимодействияНеЗапланированыНеЗакрепленные", "Взаимодействия не запланированы не закрепленные");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("СтанутСвободнымиЧерез10Дн", "Станут свободными через 10 дней");
	Элементы.СтатусВзаимодействий.СписокВыбора.Добавить("АнализироватьВК", "Есть активный Интерес");
	
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("", "");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ЗакреплленныеКлиенты", "Закреплленные клиенты");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("НеЗакреплленныеКлиенты", "Не закреплленные клиенты");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ВзаимодействияЗапланированы", "Взаимодействия запланированы");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ПросроченныеВзаимодействия", "Просроченные взаимодействия");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ВзаимодействияЗапланированыНеЗакрепленные", "Взаимодействия запланированы не закрепленные");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ПросроченныеВзаимодействия", "Просроченные взаимодействия не закрепленные");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ВзаимодействияНеЗапланированы", "Взаимодействия не запланированы");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("ВзаимодействияНеЗапланированыНеЗакрепленные", "Взаимодействия не запланированы не закрепленные");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("СтанутСвободнымиЧерез10Дн", "Станут свободными через 10 дней");
	Элементы.СтатусВзаимодействийСЦ.СписокВыбора.Добавить("АнализироватьВК", "Есть активный Интерес");
	
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("", "");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ЗакреплленныеКлиенты", "Закреплленные клиенты");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("НеЗакреплленныеКлиенты", "Не закреплленные клиенты");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ВзаимодействияЗапланированы", "Взаимодействия запланированы");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ПросроченныеВзаимодействия", "Просроченные взаимодействия");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ВзаимодействияЗапланированыНеЗакрепленные", "Взаимодействия запланированы не закрепленные");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ПросроченныеВзаимодействия", "Просроченные взаимодействия не закрепленные");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ВзаимодействияНеЗапланированы", "Взаимодействия не запланированы");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("ВзаимодействияНеЗапланированыНеЗакрепленные", "Взаимодействия не запланированы не закрепленные");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("СтанутСвободнымиЧерез10Дн", "Станут свободными через 10 дней");
	Элементы.СтатусВзаимодействийРМ.СписокВыбора.Добавить("АнализироватьВК", "Есть активный Интерес");
	
	Элементы.Состояние.СписокВыбора.Добавить("ВРаботе", "В работе");
	Элементы.Состояние.СписокВыбора.Добавить("Завершено", "Завершено");
	Элементы.Состояние.СписокВыбора.Добавить("Все", "Все");
	
	Состояние = "ВРаботе";
	
	СпсСостояний = Новый СписокЗначений;
	СпсСостояний.Добавить(Справочники.CRM_СостоянияСобытий.ВРаботе);
	СпсСостояний.Добавить(Справочники.CRM_СостоянияСобытий.Запланировано);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);	
	
	Элементы.СостояниеИнтерес.СписокВыбора.Добавить("ВРаботе", "В работе");
	Элементы.СостояниеИнтерес.СписокВыбора.Добавить("Завершен", "Завершен");
	Элементы.СостояниеИнтерес.СписокВыбора.Добавить("Все", "Все");
	
	СостояниеИнтерес = "ВРаботе";
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Завершен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
	//Если РольДоступна("смартИнженер") ИЛИ РольДоступна("смартИнженерДемозала") Тогда
	//Элементы.ГруппаТопПартнеры.Видимость = Ложь;
	//Элементы.ГруппаТопИнтересы.Видимость = Ложь;
	Если НЕ Пользователи.РолиДоступны("смартРуководительCRM") Тогда	
		Элементы.ГруппаТопРекомендации.Видимость = Ложь;
		Элементы.ГруппаТопДокументыСЦ.Видимость = Ложь;
		//Элементы.Исполнитель.ТолькоПросмотр = Истина;
		//Элементы.ОтветственныйПартнеры.ТолькоПросмотр = Истина;
		//Элементы.ОтветственныйИнтерес.ТолькоПросмотр = Истина;
		Элементы.ОтветственныйРекомендации.ТолькоПросмотр = Истина;
		Элементы.ОтображатьПоказателиСУчетомОтборов.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Автор = "Все";
	ВыбранныйВид = "Всего";
	ВидимостьАвторовИсполнителей = Истина;
	
	ТекущаяСтраница = "МоиДела";
	СтараяСтраница = "МоиДела";
	ТекущаяСтраницаИнтересы = "ИнтересыВОбработке";
	ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер";
	
	ОбновитьТаблицуПоказателей();
	
	ЛентаОтбор.Добавить("ВсеСобытия", "Все события", Истина);
	ЛентаОтбор.Добавить("Задачи", "Завершенные задачи", Истина);
	ЛентаОтбор.Добавить("ВзаимодействияВстречи", "Завершенные встречи", Истина);
	ЛентаОтбор.Добавить("Звонки", "Звонки", Истина);
	ЛентаОтбор.Добавить("ВходящиеЗвонки", "Входящие звонки", Истина);
	ЛентаОтбор.Добавить("ИсходящиеЗвонки", "Исходящие звонки", Истина);
	ЛентаОтбор.Добавить("Письма", "Письма", Истина);
	ЛентаОтбор.Добавить("ВходящиеПисьма", "Входящие письма", Истина);
	ЛентаОтбор.Добавить("ИсходящиеПисьма", "Исходящие письма", Истина);
	ЛентаОтбор.Добавить("ВзаимодействияПрочие", "Взаимодействия прочие", Истина);
	ЛентаОтбор.Добавить("Чаты", "Чаты", Истина);
	ЛентаОтбор.Добавить("ВходящиеЧаты", "Входящие чаты", Истина);
	ЛентаОтбор.Добавить("ИсходящиеЧаты", "Исходящие чаты", Истина);
	ЛентаОтбор.Добавить("SMS", "SMS", Истина);
	ЛентаОтбор.Добавить("ИзменениеСостояния", "Изменение состояния", Истина);
	ЛентаОтбор.Добавить("ИзменениеОтветственного", "Смена ответственного", Истина);
	ЛентаОтбор.Добавить("История", "Изменение поля", Истина);
	ЛентаОтбор.Добавить("Примечания", "Примечания", Истина);
	ЛентаОтбор.Добавить("Документы", "Документы", Истина);
	ЛентаОтбор.Добавить("Файлы", "Файлы", Ложь);
	
	Элементы.КонтактноеЛицоТекст.Видимость = Ложь;
	Элементы.КомпанияТекст.Видимость = Ложь;
	
	ЭтаФорма.ДСУМеняНаКонтроле.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	ЭтаФорма.ДСУДругихНаКонтроле.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	ЭтаФорма.ДСПартнеры.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ЭтаФорма.ДСПартнерыСЦ.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ЭтаФорма.ДСПартнерыРМ.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	//	ЭтаФорма.ДСПартнеры.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартСтатусыСотрудников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартСтатусыСотрудников КАК смартСтатусыСотрудников
	|ГДЕ
	|	смартСтатусыСотрудников.ВыбираетсяСотрудником
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартСтатусыСотрудников.Код"); 
	Элементы.ТекущийСтатусСотрудника.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	УстановитьЗаголовокДекорацииСтатусаСотрудника(); 
	
	//++ #Б-5494 смарт: Фролов 29.01.2026 //Рабочий стол сотрудника. Сильно тормозит при сортировке таблицы
	МассивКолонокБезСортировки = Новый Массив;
	МассивКолонокБезСортировки.Добавить("Предмет");
	МассивКолонокБезСортировки.Добавить("Объект");
	
	Список.УстановитьОграниченияИспользованияВПорядке(МассивКолонокБезСортировки);
	//-- #Б-5494 смарт: Фролов 29.01.2026
	
	//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
	РасширенияПоддерживающиеПредпросмотр = РаботаСФайламиСлужебный.СписокРасширенийДляПредпросмотра();
	
	Элементы.PDFДокумент.Видимость = Ложь;
	Элементы.АдресДанныхФайла.Видимость = Истина;
	//-- #Б-6510 смарт: Фролов 20.04.2026
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПраваВсеДела()
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат "Администратор";
	ИначеЕсли  РольДоступна("смартРуководительCRM") Тогда
		Возврат "Руководители";
	Иначе		
		Запрос = новый Запрос();	
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыПользователейСостав.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ГруппыПользователейСостав.Ссылка.Наименование ПОДОБНО ""%Менеджеры%""
		|			ТОГДА ""Менеджеры""
		|		КОГДА ГруппыПользователейСостав.Ссылка.Наименование ПОДОБНО ""%Руководство техцентра%""
		|			ТОГДА ""Руководители""
		|		КОГДА ГруппыПользователейСостав.Ссылка.Наименование ПОДОБНО ""%Комм. отдел техцентр%""
		|			ТОГДА ""Инженеры""
		|		КОГДА ГруппыПользователейСостав.Ссылка.Наименование ПОДОБНО ""%Руководители Комм отдела%""
		|			ТОГДА ""Руководители""
		|		ИНАЧЕ ""НеОпределено""
		|	КОНЕЦ КАК Получили
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		
		РезЗапрос = Запрос.Выполнить().Выбрать();
		
		Если РезЗапрос.Следующий() Тогда
			Возврат РезЗапрос.Получили; 
		Конецесли;		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ПроставитьДоступыКРазделам()
	
	Получили = ПолучитьПраваВсеДела();	
	
	Если Получили = "Администратор" Тогда
		ДоступАкции=Истина;
		ДоступИнтересы=Истина;
		ДоступМоиРекомендации=Истина;
		ДоступНастройки=Истина;
		ДоступПартнеры=Истина; 	
	ИначеЕсли Получили = "Менеджеры" Тогда
		ДоступАкции=Истина;
		ДоступИнтересы=Истина;
		ДоступМоиРекомендации=Ложь;
		ДоступНастройки=Ложь;
		ДоступПартнеры=Истина; 
		ЗапретЗакрытия = Истина;
	ИначеЕсли Получили = "Инженеры" Тогда	 
		ДоступАкции=Истина;
		ДоступИнтересы=Истина;
		ДоступМоиРекомендации=Истина;
		ДоступНастройки=Ложь;
		ДоступПартнеры=Истина;
		ЗапретЗакрытия = Истина;
	ИначеЕсли  Получили = "Руководители" Тогда	
		ДоступАкции=Истина;
		ДоступИнтересы=Истина;
		ДоступМоиРекомендации=Ложь;
		ДоступНастройки=Ложь;
		ДоступПартнеры=Истина; 	
	Конецесли;
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Элементы.ГруппаТопПартнеры.Видимость = ДоступПартнеры;
	Элементы.ГруппаТопИнтересы.Видимость = ДоступИнтересы;
	Элементы.ГруппаТопРекомендации.Видимость = ДоступМоиРекомендации;
	Элементы.ГруппаТопАкции.Видимость = ДоступАкции;
	Элементы.ГруппаТопНастройки.Видимость = ДоступНастройки;
	
КонецПроцедуры


&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Исполнитель) И НЕ ЗначениеЗаполнено(Автор) Тогда
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", Исполнитель, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Исполнитель) И ЗначениеЗаполнено(Автор) Тогда
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Автор, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", , , , Ложь);
		
	ИначеЕсли ЗначениеЗаполнено(Исполнитель) И ЗначениеЗаполнено(Автор) Тогда
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Автор, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", Исполнитель, ВидСравненияКомпоновкиДанных.Равно, , Истина);	
		
	ИначеЕсли НЕ (ЗначениеЗаполнено(Исполнитель) И ЗначениеЗаполнено(Автор)) Тогда 	
		
		Состояние = "ВРаботе";
		Элементы.Состояние.ТолькоПросмотр = Истина;
		
		СпсСостояний = Новый СписокЗначений;
		СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.ВРаботе"));
		СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Запланировано"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", , , , Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
		
	Иначе
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", , , , Ложь);
		
	КонецЕсли; 
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйИнтересПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтветственныйИнтерес) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ответственный", ОтветственныйИнтерес, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ЭтаФорма.ДСУМеняНаКонтроле.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ОтветственныйИнтерес);
		ЭтаФорма.ДСУДругихНаКонтроле.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ОтветственныйИнтерес);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ответственный", , , , Ложь);
		ЭтаФорма.ДСУМеняНаКонтроле.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПользователиКлиент.АвторизованныйПользователь());
		ЭтаФорма.ДСУДругихНаКонтроле.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПользователиКлиент.АвторизованныйПользователь());
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейИнтерес();
	
КонецПроцедуры


&НаКлиенте
Процедура КвалификацияИнтересыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(КвалификацияИнтерес) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Квалификация", КвалификацияИнтерес, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Квалификация", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейИнтерес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Партнер", Партнер, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Партнер", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейИнтерес();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеИнтересаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СостояниеИнтереса) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "СостояниеИнтереса", СостояниеИнтереса, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "СостояниеИнтереса", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейИнтерес();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПартнерыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтветственныйПартнеры) Тогда
		
		ДСПартнеры.Отбор.Элементы.Очистить();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ОсновнойМенеджер", ОтветственныйПартнеры, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ОсновнойМенеджер", , , , Ложь);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(БизнесРегионПартнеры) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "БизнесРегион", БизнесРегионПартнеры, ВидСравненияКомпоновкиДанных.ВИерархии, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "БизнесРегион", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейПартнеры();
	
КонецПроцедуры 

&НаКлиенте
Процедура БизнесРегионПартнерыПриИзменении(Элемент)
	
	ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ТекущийБизнесРегион = БизнесРегионПартнеры;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ТекущийБизнесРегион = БизнесРегионПартнерыСЦ;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ТекущийБизнесРегион = БизнесРегионПартнерыРМ;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущийБизнесРегион) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "БизнесРегион", ТекущийБизнесРегион, ВидСравненияКомпоновкиДанных.ВИерархии, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "БизнесРегион", , , , Ложь);
	КонецЕсли;
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ОбновитьТаблицуПоказателейПартнеры();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ОбновитьТаблицуПоказателейПартнерыСЦ();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ОбновитьТаблицуПоказателейПартнерыРМ();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйДокументыСЦПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтветственныйДокументыСЦ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСДокументыСЦ, "Ответственный", ОтветственныйДокументыСЦ, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСДокументыСЦ, "Ответственный", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейДокументыСЦ();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнженерДокументыСЦПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ИнженерДокументыСЦ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСДокументыСЦ, "Инженер", ИнженерДокументыСЦ, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСДокументыСЦ, "Инженер", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейДокументыСЦ();
	
КонецПроцедуры

&НаКлиенте
Процедура АвторПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Автор) И НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Автор, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", , , , Ложь);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Автор) И ЗначениеЗаполнено(Исполнитель) Тогда	
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", Исполнитель, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
		
	ИначеЕсли ЗначениеЗаполнено(Исполнитель) И ЗначениеЗаполнено(Автор) Тогда
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Автор, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", Исполнитель, ВидСравненияКомпоновкиДанных.Равно, , Истина);	
		
	ИначеЕсли НЕ (ЗначениеЗаполнено(Исполнитель) И ЗначениеЗаполнено(Автор)) Тогда 	
		
		Состояние = "ВРаботе";
		Элементы.Состояние.ТолькоПросмотр = Истина;
		
		СпсСостояний = Новый СписокЗначений;
		СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.ВРаботе"));
		СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Запланировано"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь); 
		
	Иначе
		
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
		
	КонецЕсли;
	
	Если ОтображатьПоказателиСУчетомОтборов Тогда
		ОбновитьТаблицуПоказателей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПоказателиСУчетомОтборовПриИзменении(Элемент)
	
	ОбновитьТаблицуПоказателей();
	
	Если ТекущаяСтраница = "Интересы" Тогда
		ОбновитьТаблицуПоказателейИнтерес();
	КонецЕсли;
	
	Если ТекущаяСтраница = "Партнеры" Тогда
		ОбновитьТаблицуПоказателейПартнеры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПоказателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныйПоказатель = Элемент.ТекущиеДанные.Показатель;
	
	Если ВыбранныйПоказатель = "Просрочено" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Истина, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
		
	ИначеЕсли ВыбранныйПоказатель = "Всего" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
		
	ИначеЕсли ВыбранныйПоказатель = "На сегодня" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Истина, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
		
	ИначеЕсли ВыбранныйПоказатель = "Завершено сегодня" Тогда	
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Истина, Истина);
		
	КонецЕсли;	
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныйВид = Элемент.ТекущиеДанные.Показатель;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", ВыбранныйВид, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныйВид = Элемент.ТекущиеДанные.Показатель;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", ВыбранныйВид, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсполнительВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Элементы.Исполнитель.ТолькоПросмотр Тогда
		
		Исполнитель = Элемент.ТекущиеДанные.Исполнитель;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", Исполнитель, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
		Если ОтображатьПоказателиСУчетомОтборов Тогда
			ОбновитьТаблицуПоказателей();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАвторВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Автор = Элемент.ТекущиеДанные.Автор;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", , , , Ложь);
	
	ВыбранныйВид = "";
	
	Если не Автор.Пустая() Тогда		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Автор, ВидСравненияКомпоновкиДанных.Равно, , Истина);	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
	Конецесли;
	
	Если ОтображатьПоказателиСУчетомОтборов Тогда
		ОбновитьТаблицуПоказателей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Партнер", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "СостояниеИнтереса", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Квалификация", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Партнер", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ссылка", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "Ссылка", , , , Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ПросроченныеВзаимодействия", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ПросроченныеВзаимодействияНеЗакрепленные", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ВзаимодействияЗапланированы", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ВзаимодействияНеЗапланированы", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ВзаимодействияЗапланированыНеЗакрепленные", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ВзаимодействияНеЗапланированыНеЗакрепленные", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "СтанутСвободнымиЧерез10Дн", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "АнализироватьВК", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "Закреплен", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "Ссылка", , , , Ложь);
	
	
	ВыбранныйВид = Неопределено;
	Автор = Неопределено;
	Показатель = Неопределено;
	СостояниеИнтереса = Неопределено;
	КвалификацияИнтерес = Неопределено;
	Партнер = Неопределено;
	ПартнерЗадачи = Неопределено;
	СтатусВзаимодействий = "";
	Состояние = "Все";
	
	Если НЕ Элементы.ОтветственныйИнтерес.ТолькоПросмотр Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ответственный", , , , Ложь);
		ОтветственныйИнтерес = Неопределено;
	КонецЕсли;	
	
	Если НЕ Элементы.Исполнитель.ТолькоПросмотр Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", , , , Ложь);
		Исполнитель = Неопределено;
	КонецЕсли;
	
	Если НЕ Элементы.ОтветственныйПартнеры.ТолькоПросмотр Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ОсновнойМенеджер", , , , Ложь);
		ОтветственныйПартнеры = Неопределено;
	КонецЕсли;	
	
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказатели(Команда)
	ОбновитьТаблицуПоказателей();
	Элементы.ТаблицаОбщая.ТекущаяСтрока = 0; //ТаблицаОбщая[ТаблицаОбщая.Количество()-1].ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбщаяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;    
	
	//++ #Б-4218 смарт: Фролов 08.09.2025 //Ошибка при работе с рабочим столом
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ВидСтроки = ТекущиеДанные.ВидСтроки;
		//-- #Б-4218 смарт: Фролов 08.09.2025
		
		Если ВидСтроки <> 2 Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДата(), Истина);
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "СостояниеИнтереса", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Квалификация", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Партнер", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ВзаимодействияЗапланированы", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "ВзаимодействияНеЗапланированы", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "СтанутСвободнымиЧерез10Дн", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "АнализироватьВК", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "Закреплен", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнеры, "Ссылка", , , , Ложь);
			
			//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", , , , Ложь);
			//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Исполнитель", , , , Ложь);
			
			ВыбранныйВид = Неопределено;		
			//Автор = Неопределено;
			//Исполнитель = Неопределено;
			Показатель = Неопределено;
			СостояниеИнтереса = Неопределено;
			КвалификацияИнтерес = Неопределено;
			Партнер = Неопределено;
			СтатусВзаимодействий = "";
			
			ВыбранныйВид = ТекущиеДанные.Показатель;
			
			СпсСостояний = Новый СписокЗначений;
			Если ЭтаФорма.Состояние = "ВРаботе" Тогда
				
				СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.ВРаботе"));
				СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Запланировано"));
				
			КонецЕсли;
			Если ЭтаФорма.Состояние = "Завершено" Тогда
				
				СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Завершено"));
				СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Отменено"));
				
			КонецЕсли;
			
			Если ВыбранныйВид = "Просрочено" Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Истина, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
				
			ИначеЕсли ВыбранныйВид = "Всего" Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
				
			ИначеЕсли ВыбранныйВид = "На сегодня" Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Истина, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
				
			ИначеЕсли ВыбранныйВид = "Завершено сегодня" Тогда	
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Истина, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
				
			ИначеЕсли ВыбранныйВид = "На завтра" Тогда	
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Истина, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
				
				//ИначеЕсли ВыбранныйВид = "Взаимодействия" или ВыбранныйВид = "Задачи" или ВыбранныйВид = " " Тогда	
				
			КонецЕсли;	
			
			
			Если ОтображатьПоказателиСУчетомОтборов Тогда
				ОбновитьТаблицуПоказателей();
				
				Если ТекущаяСтраница = "Интересы" Тогда
					ОбновитьТаблицуПоказателейИнтерес();
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекущаяСтраница = "Партнеры" Тогда
				ОбновитьТаблицуПоказателейПартнеры();
			КонецЕсли;
			
			Элементы.ТаблицаОбщая.ТекущаяСтрока = 0; //ТаблицаОбщая[ТаблицаОбщая.Количество()-1].ПолучитьИдентификатор();  
			
			СтараяСтраница = ТекущаяСтраница;
			ТекущаяСтраница = "МоиДела";
			ВидимостьОсновныхСтраниц(СтараяСтраница);
			
		КонецЕсли; 
		//++ #Б-4218 смарт: Фролов 08.09.2025 //Ошибка при работе с рабочим столом	
	КонецЕсли;	
	//-- #Б-4218 смарт: Фролов 08.09.2025
	
КонецПроцедуры

&НаСервере
Функция ВернутьМассивИнтересов(ИмяДинамическогоСписка)
	
	Схема = Элементы[ИмяДинамическогоСписка].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы[ИмяДинамическогоСписка].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат.ВыгрузитьКолонку("Интерес");
	
КонецФункции	

&НаКлиенте
Процедура ТаблицаЧастноеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;    
	ВидСтроки = Элемент.ТекущиеДанные.ВидСтроки;
	Показатель = Элемент.ТекущиеДанные.Показатель;
	НеОбновлятьДС = Ложь;
	
	Если ВидСтроки <> 2 Тогда
		
		ВыбранныйВид = Элемент.ТекущиеДанные.Показатель;
		
		Если ТекущаяСтраница = "МоиДела" Тогда  
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Просрочка", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаСегодня", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаЗавтра", Ложь, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЗавершеноСегодня", Ложь, Истина);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", ВыбранныйВид, ВидСравненияКомпоновкиДанных.Равно, , Истина);
			
		ИначеЕсли ТекущаяСтраница = "Интересы" Тогда
			
			Если Показатель = "БЕЗ ЗАМЕЧАНИЙ" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ЕстьЗамечания", Ложь);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "С ЗАМЕЧАНИЯМИ" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ЕстьЗамечания", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "В ПРОЦЕССЕ КВАЛИФИКАЦИИ" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ВПроцессеКвалификации", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "Не квалифицирован более 1 дня" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("НеКвалифицированБолее1Дня", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "Не квалифицирован более 5 дней" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("НеКвалифицированБолее5Дней", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "Не отправлено КП более 1 дня" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("НеОтправленоКПБолее1Дня", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "В процессе согласования КП" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ВПроцессеСогласованияКП", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "КП отправлено более 1 дня" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("КПОтправленоБолее1Дня", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "КП отправлено более 5 дней" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("КПОтправленоБолее5Дней", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "КП согласовано более 3 дней" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("КПСогласованоБолее3Дней", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "В процессе оплаты" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ВПроцессеОплаты", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "Счет  отправлен более 5 дней" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("СчетОтправленБолее5Дней", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "Без запланированных взаимодействий" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("БезЗапланированныхВзаимодействий", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "Последний контакт более 10 дней" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ПоследнийКонтактБолее10Дней", Истина);
				НеОбновлятьДС = Истина;
			ИначеЕсли Показатель = "ВСЕГО НЕ ЗАВЕРШЕННЫХ" Тогда
				Элементы.ТЗЭтапыОбработкиИнтересов.ОтборСтрок = Неопределено;
				НеОбновлятьДС = Истина;
				
			Иначе	
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ссылка", , , , Ложь);	
				
				Если ПроверитьТипОбъекта(ВыбранныйВид, "СправочникСсылка.смартКвалификацииМенеджеров") Тогда
					ЭтаФорма.КвалификацияИнтерес = ВыбранныйВид;
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Квалификация", ВыбранныйВид, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ИначеЕсли ПроверитьТипОбъекта(ВыбранныйВид, "СправочникСсылка.Партнеры") Тогда
					ЭтаФорма.Партнер = ВыбранныйВид;
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Партнер", ВыбранныйВид, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ИначеЕсли ВыбранныйВид = "МОИ ИНТЕРЕСЫ НА КОНТРОЛЕ" Тогда
					МасИнтересов = ВернутьМассивИнтересов("ДСУДругихНаКонтроле");
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Ссылка", МасИнтересов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
				Иначе	
					ЭтаФорма.СостояниеИнтереса = ВыбранныйВид;
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "СостояниеИнтереса", ВыбранныйВид, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущаяСтраница = "Партнеры" Тогда
			
			ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();
			
			ВыбранныйВид = Элемент.ТекущиеДанные.ПоказательДляФормул;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ПросроченноеВзаимодействие", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "СтанутСвободнымиЧерез10Дн", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", , , , Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Ссылка", , , , Ложь);
			
			Если ВыбранныйВид = "ВзаимодействияЗапланированы" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ВзаимодействияЗапланированы";
			ИначеЕсли ВыбранныйВид = "ВзаимодействияНеЗапланированы" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ВзаимодействияНеЗапланированы";
			ИначеЕсли ВыбранныйВид = "ПросроченныеВзаимодействия" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ПросроченноеВзаимодействие", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ПросроченныеВзаимодействия";
			ИначеЕсли ВыбранныйВид = "ПросроченныеВзаимодействияНеЗакрепленные" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ПросроченноеВзаимодействие", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ПросроченныеВзаимодействияНеЗакрепленные";
			ИначеЕсли ВыбранныйВид = "ВзаимодействияЗапланированыНеЗакрепленные" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ВзаимодействияЗапланированыНеЗакрепленные";
			ИначеЕсли ВыбранныйВид = "ВзаимодействияНеЗапланированыНеЗакрепленные" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ВзаимодействияНеЗапланированыНеЗакрепленные";
			ИначеЕсли ВыбранныйВид = "ЗакреплленныеКлиенты" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ЗакреплленныеКлиенты";
			ИначеЕсли ВыбранныйВид = "НеЗакреплленныеКлиенты" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "НеЗакреплленныеКлиенты";
			ИначеЕсли ВыбранныйВид = "СтанутСвободнымиЧерез10Дн" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "СтанутСвободнымиЧерез10Дн", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "СтанутСвободнымиЧерез10Дн";
			ИначеЕсли ВыбранныйВид = "АнализироватьВК" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", , , , Ложь);
				СтатусВзаимодействий = "АнализироватьВК";
			ИначеЕсли ВыбранныйВид = "ВзаимодействияЗапланированыСИнтересом" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ВзаимодействияЗапланированыСИнтересом";
			ИначеЕсли ВыбранныйВид = "ВзаимодействияНеЗапланированыСИнтересом" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ВзаимодействияНеЗапланированыСИнтересом";
			ИначеЕсли ВыбранныйВид = "ПросроченныеВзаимодействияСИнтересом" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ПросроченноеВзаимодействие", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				СтатусВзаимодействий = "ПросроченныеВзаимодействияСИнтересом";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ НеОбновлятьДС Тогда
		
		ОбновитьТаблицуПоказателей();
		
		Если ТекущаяСтраница = "Интересы" Тогда
			ОбновитьТаблицуПоказателейИнтерес();
		КонецЕсли;
		
		Если ТекущаяСтраница = "Партнеры" Тогда
			
			Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
				
				ОбновитьТаблицуПоказателейПартнеры();	
				
			ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
				
				ОбновитьТаблицуПоказателейПартнерыСЦ();
				
			ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда	
				
				ОбновитьТаблицуПоказателейПартнерыРМ();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТипОбъекта(Объект, ТипОбъекта)
	
	Возврат ТипЗнч(Объект) = Тип(ТипОбъекта);	
	
КонецФункции	

&НаКлиенте
Процедура ПоАвтору(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ВидимостьАвторовИсполнителей = Истина;
	ВидимостьАвторовИсполнителей();
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	ВидимостьАвторовИсполнителей = Ложь; 
	ВидимостьАвторовИсполнителей();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьАвторовИсполнителей()
	
	Если ВидимостьАвторовИсполнителей Тогда
		Элементы.ГруппаАвторы.ЦветФона = Новый Цвет(255,255,255);
		Элементы.ГруппаИсполнители.ЦветФона = Новый Цвет(215,240,199);
		Элементы.ТаблицаАвтор.Видимость = Истина;
		Элементы.ТаблицаИсполнитель.Видимость = Ложь;    
		Элементы.ДекорацияАвторы.Шрифт = Новый Шрифт("Arial",9 ,Истина,,Ложь); 
		Элементы.ДекорацияИсполнители.Шрифт = Новый Шрифт("Arial",9 ,Ложь,,Истина);
	Иначе
		Элементы.ГруппаАвторы.ЦветФона = Новый Цвет(215,240,199);
		Элементы.ГруппаИсполнители.ЦветФона = Новый Цвет(255,255,255);
		Элементы.ТаблицаАвтор.Видимость = Ложь;
		Элементы.ТаблицаИсполнитель.Видимость = Истина; 
		Элементы.ДекорацияАвторы.Шрифт = Новый Шрифт("Arial",9 ,Ложь,,Истина);
		Элементы.ДекорацияИсполнители.Шрифт = Новый Шрифт("Arial",9 ,Истина,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйВидОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Вид", , , , Ложь);
	
	ОбновитьТаблицуПоказателей();
	Элементы.ТаблицаОбщая.ТекущаяСтрока = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура БизнесРегионПартнерыОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "БизнесРегион", , , , Ложь);
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ОбновитьТаблицуПоказателейПартнеры();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ОбновитьТаблицуПоказателейПартнерыСЦ();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ОбновитьТаблицуПоказателейПартнерыРМ();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработкаОжиданияОбновления", 300);
	ВидимостьОсновныхСтраниц("МоиДела");
	ПроставитьДоступыКРазделам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияОбновления()
	
	Элементы.Список.Обновить();
	
	ОбновитьТаблицуПоказателей();
	
	Если ТекущаяСтраница = "Интересы" Тогда
		//ОбновитьТаблицуПоказателейИнтерес();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьФормуПослеСозданияОбъекта", ЭтаФорма);
	
	ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачиКраткая", , ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВзаимодействие(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьФормуПослеСозданияОбъекта", ЭтаФорма);
	
	ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаДокумента", , ЭтаФорма, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуПослеСозданияОбъекта(Ответ, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
	//ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТопНажатие(Элемент)
	
	СтараяСтраница = ?(ТекущаяСтраница = "", "МоиДела", ТекущаяСтраница);
	ТекущаяСтраница = СтрЗаменить(Элемент.Имя, "ДекорацияТоп", "");
	ВидимостьОсновныхСтраниц(СтараяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьОсновныхСтраниц(СтараяСтраница)
	
	Если ТекущаяСтраница <> "" Тогда
		
		Если Элементы["ГруппаСтраница" + ТекущаяСтраница].Имя = "ГруппаСтраницаПартнеры" Тогда
			ТекущаяСтраницаВременная = Элементы["ГруппаПартнерыИИнтересы"];
		ИначеЕсли Элементы["ГруппаСтраница" + ТекущаяСтраница].Имя = "ГруппаСтраницаИнтересы" Тогда	
			ТекущаяСтраницаВременная = Элементы["ГруппаПартнерыИИнтересы"];
		Иначе
			ТекущаяСтраницаВременная = Элементы["ГруппаСтраница" + ТекущаяСтраница];
		КонецЕсли;	
		
		Элементы.СтраницыЦентральные.ТекущаяСтраница = ТекущаяСтраницаВременная; 
		
		Элементы["ДекорацияТоп" + СтараяСтраница].ЦветФона = Новый Цвет(215,240,199);
		Элементы["ДекорацияТоп" + СтараяСтраница].Шрифт = Новый Шрифт("Arial",9,,,Ложь);
		Элементы["ДекорацияТоп" + СтараяСтраница].Гиперссылка = Истина; 
		
		Элементы["ГруппаТоп" + СтараяСтраница].ЦветФона = Новый Цвет(215,240,199);
		Элементы["ГруппаТоп" + СтараяСтраница].ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;		
		
		Элементы["ДекорацияТоп" + ТекущаяСтраница].ЦветФона = Новый Цвет(255,255,255);
		Элементы["ДекорацияТоп" + ТекущаяСтраница].Шрифт = Новый Шрифт("Arial",11,Истина,,Ложь);
		Элементы["ДекорацияТоп" + ТекущаяСтраница].Гиперссылка = Ложь; 
		
		Элементы["ГруппаТоп" + ТекущаяСтраница].ЦветФона = Новый Цвет(198, 221, 183);
		
		Если ТекущаяСтраница = "Интересы" Тогда
			
			Элементы.ГруппаСтраницаИнтересы.Видимость = Истина;
			Элементы.ГруппаСтраницаПартнеры.Видимость = Ложь;
			
			Если ТекущаяСтраницаИнтересы = "ИнтересыВОбработке" Тогда  
				Если не Ответственный.Пустая() Тогда
					ПоказатьЭтапыОбработкиИнтересовНаСервере(); 
				Иначе   
					ТаблицаЧастное.Очистить();
				КонецЕсли;
			Иначе 
				ОбновитьТаблицуПоказателейИнтерес();
			КонецЕсли;
			
			Элементы.ГруппаАвторИсполнитель.Видимость = Ложь;
			
		ИначеЕсли ТекущаяСтраница = "Партнеры" Тогда
			
			Элементы.ГруппаСтраницаИнтересы.Видимость = Ложь;
			Элементы.ГруппаСтраницаПартнеры.Видимость = Истина;
			
			Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
				
				ОбновитьТаблицуПоказателейПартнеры();
				
			ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
				
				ОбновитьТаблицуПоказателейПартнерыСЦ();
				
			ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
				
				ОбновитьТаблицуПоказателейПартнерыРМ();
				
			КонецЕсли;	
			
			Элементы.ГруппаАвторИсполнитель.Видимость = Ложь;
			
		ИначеЕсли ТекущаяСтраница = "Рекомендации" Тогда
			
			ТаблицаЧастное.Очистить();
			Элементы.ГруппаАвторИсполнитель.Видимость = Ложь;
			
		Иначе	
			
			ОбновитьТаблицуПоказателей();
			Элементы.ГруппаАвторИсполнитель.Видимость = Истина;
			
		КонецЕсли;
		
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРекомендацию(Команда)
	Элементы.ГруппаВсплывающаяРекомендации.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ДСРекомендацииПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДСРекомендации.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		//СформироватьЛентуИнтересаПартнера(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДСИнтересыПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДСИнтересы.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.Партнер) Тогда
		
		СформироватьЗаметкиВзаимодействияПартнера(ТекДанные.Партнер);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСКонтактнаяИнформация, "Партнер", ТекДанные.Партнер, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСОборудованиеЧернила, "Партнер", ТекДанные.Партнер, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЧернилаОборудование, "Партнер", ТекДанные.Партнер, Истина);
		CRM_СформироватьСтрокуРезультатаПоиска(ТекДанные.Партнер);
		
		ТекПартнер = ТекДанные.Партнер;
		
	Иначе
		
		ТекПартнер = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СформироватьЗаметкиВзаимодействияПартнера(Партнер)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_Взаимодействие.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|			ТОГДА CRM_Взаимодействие.ДатаЗавершенияВзаимодействия
	|		ИНАЧЕ CRM_Взаимодействие.ПлановаяДата
	|	КОНЕЦ КАК Дата,
	|	CRM_Взаимодействие.СтатусВзаимодействия КАК СтатусВзаимодействия,
	|	ВЫБОР
	|		КОГДА CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|			ТОГДА CRM_Взаимодействие.Результат
	|		ИНАЧЕ CRM_Взаимодействие.Тема + "" "" + (ВЫРАЗИТЬ(CRM_Взаимодействие.Содержание КАК СТРОКА(300)))
	|	КОНЕЦ КАК Описание,
	|	CRM_Взаимодействие.Ответственный КАК Ответственный,
	|	""Взаимодействие"" КАК Вид,
	|	CRM_Взаимодействие.Партнер КАК Партнер
	|ПОМЕСТИТЬ ЗаметкиВзаимодействия
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	CRM_Взаимодействие.Партнер = &Партнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заметки.Ссылка,
	|	Заметки.ДатаЗаметки,
	|	""Завершено"",
	|	Заметки.ТекстСодержания,
	|	Заметки.Автор,
	|	""Заметка"",
	|	Заметки.Предмет
	|ИЗ
	|	Справочник.Заметки КАК Заметки
	|ГДЕ
	|	(Заметки.Предмет = &Партнер
	|			ИЛИ Заметки.смартПартнер = &Партнер)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаметкиВзаимодействия.Ссылка КАК Ссылка,
	|	ЗаметкиВзаимодействия.Дата КАК Дата,
	|	ЗаметкиВзаимодействия.СтатусВзаимодействия КАК Статус,
	|	ЗаметкиВзаимодействия.Описание КАК Описание,
	|	ЗаметкиВзаимодействия.Ответственный КАК Отправитель,
	|	ЗаметкиВзаимодействия.Вид КАК Вид,
	|	ЗаметкиВзаимодействия.Партнер КАК Партнер
	|ИЗ
	|	ЗаметкиВзаимодействия КАК ЗаметкиВзаимодействия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CRM_Интерес.Ссылка,
	|	CRM_Интерес.Дата,
	|	CRM_Интерес.СостояниеИнтереса,
	|	CRM_Интерес.Описание,
	|	CRM_Интерес.Ответственный,
	|	""Интерес"",
	|	CRM_Интерес.Партнер
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Партнер = &Партнер
	|	И НЕ CRM_Интерес.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаметкиВзаимодействия.Ответственный КАК Ответственный,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаметкиВзаимодействия.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано)
	|				ТОГДА ЗаметкиВзаимодействия.Дата
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаЗапланировано,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗаметкиВзаимодействия.СтатусВзаимодействия, ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)) <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано)
	|				ТОГДА ЗаметкиВзаимодействия.Дата
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаЗавершено,
	|	ВЫБОР
	|		КОГДА ЗаметкиВзаимодействия.Партнер.ОсновнойМенеджер = ЗаметкиВзаимодействия.Ответственный
	|				ИЛИ ЗаметкиВзаимодействия.Партнер.Партнер.ОсновнойМенеджер = ЗаметкиВзаимодействия.Ответственный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оборудование,
	|	ВЫБОР
	|		КОГДА ЗаметкиВзаимодействия.Партнер.смартОсновнойМенеджерСервисЦентра = ЗаметкиВзаимодействия.Ответственный
	|				ИЛИ ЗаметкиВзаимодействия.Партнер.Партнер.смартОсновнойМенеджерСервисЦентра = ЗаметкиВзаимодействия.Ответственный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СЦ,
	|	ВЫБОР
	|		КОГДА ЗаметкиВзаимодействия.Партнер.смартМенеджерПоРасходнымМатериалам = ЗаметкиВзаимодействия.Ответственный
	|				ИЛИ ЗаметкиВзаимодействия.Партнер.Партнер.смартМенеджерПоРасходнымМатериалам = ЗаметкиВзаимодействия.Ответственный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Расходка,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЗаметкиВзаимодействия.СтатусВзаимодействия, ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)) <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано)
	|						ТОГДА ЗаметкиВзаимодействия.Дата
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ЕСТЬNULL(ЗаметкиВзаимодействия.СтатусВзаимодействия, ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)) <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано)
	|								ТОГДА ЗаметкиВзаимодействия.Дата
	|							ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|						КОНЕЦ, &ТекДата, ДЕНЬ)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДатаДней
	|ИЗ
	|	ЗаметкиВзаимодействия КАК ЗаметкиВзаимодействия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗаметкиВзаимодействия.Вид = ""Взаимодействие""
	|				ТОГДА ЗаметкиВзаимодействия.СтатусВзаимодействия = &СтатусВзаимодействия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ЗаметкиВзаимодействия.Вид <> ""Взаимодействие""
	|				ТОГДА ЗаметкиВзаимодействия.Дата < ДАТАВРЕМЯ(2024, 12, 16)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаметкиВзаимодействия.Ответственный,
	|	ВЫБОР
	|		КОГДА ЗаметкиВзаимодействия.Партнер.ОсновнойМенеджер = ЗаметкиВзаимодействия.Ответственный
	|				ИЛИ ЗаметкиВзаимодействия.Партнер.Партнер.ОсновнойМенеджер = ЗаметкиВзаимодействия.Ответственный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаметкиВзаимодействия.Партнер.смартОсновнойМенеджерСервисЦентра = ЗаметкиВзаимодействия.Ответственный
	|				ИЛИ ЗаметкиВзаимодействия.Партнер.Партнер.смартОсновнойМенеджерСервисЦентра = ЗаметкиВзаимодействия.Ответственный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаметкиВзаимодействия.Партнер.смартМенеджерПоРасходнымМатериалам = ЗаметкиВзаимодействия.Ответственный
	|				ИЛИ ЗаметкиВзаимодействия.Партнер.Партнер.смартМенеджерПоРасходнымМатериалам = ЗаметкиВзаимодействия.Ответственный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оборудование УБЫВ,
	|	СЦ УБЫВ,
	|	Расходка УБЫВ,
	|	ДатаЗавершено УБЫВ";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусВзаимодействия", Справочники.CRM_СостоянияСобытий.Завершено);
	
	Пакет = Запрос.ВыполнитьПакет();
	ТабЛента.Загрузить(Пакет[1].Выгрузить());
	ТабЛентаПартнерыОтветственные.Загрузить(Пакет[2].Выгрузить());
	
КонецПроцедуры	

&НаСервере
Процедура СформироватьЛентуИнтересаПартнера(ТекДанные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	ВключенныеТипыОбъектов = ТипыОбъектовЛентыПоОтбору(ЛентаОтбор);
	ВключеныДокументы = ВключенаНастройкаОтбораЛенты(ЛентаОтбор, "Документы");
	//Если ВключеныДокументы Тогда
	//	ПрочиеТипыОбъектов = CRM_ЛентаСобытийПовтИсп.ТипыОбъектовОтбораДокументов();
	//Иначе
	ПрочиеТипыОбъектов = Новый Массив;
	//КонецЕсли;
	ВключенныеТипыОбращений = ТипыОбращенийЛентыПоОтбору(ЛентаОтбор);
	
	ВключенныеВидыВзаимодействий = ВидыВзаимодействийЛентыПоОтбору(ЛентаОтбор); // Включают в себя направления.
	ВключенныеНаправленияЗвонков = НаправленияЗвонковПоОтбору(ЛентаОтбор);
	ВключенныеНаправленияЧатов = НаправленияЧатовПоОтбору(ЛентаОтбор);
	
	ВыведеноОбъектовИстории = 0;
	ВсегоОбъектовИстории = 0;
	
	ПараметрыЗапросаЛенты = Новый Структура;
	ПараметрыЗапросаЛенты.Вставить("Режим",					"ЛентаИнтереса");
	ПараметрыЗапросаЛенты.Вставить("ВключенаИстория",		ВключенаНастройкаОтбораЛенты(ЛентаОтбор, "История"));
	ПараметрыЗапросаЛенты.Вставить("ВключеныПримечания",	ВключенаНастройкаОтбораЛенты(ЛентаОтбор, "Примечания"));
	ПараметрыЗапросаЛенты.Вставить("ВключеныФайлы",			ВключенаНастройкаОтбораЛенты(ЛентаОтбор, "Файлы"));
	ПараметрыЗапросаЛенты.Вставить("ВключеноИзменениеСостояния",	ВключенаНастройкаОтбораЛенты(ЛентаОтбор, "ИзменениеСостояния"));
	ПараметрыЗапросаЛенты.Вставить("ВключеноИзменениеОтветственного",	ВключенаНастройкаОтбораЛенты(ЛентаОтбор, "ИзменениеОтветственного"));
	ПараметрыЗапросаЛенты.Вставить("ОбъектовИстории",		50);
	
	Запрос.Параметры.Вставить("ТекущаяДата",				ТекущаяДатаСеанса());
	Запрос.Параметры.Вставить("Объект",						ТекДанные.Ссылка);
	Запрос.Параметры.Вставить("ВключенныеТипыОбъектов",		ВключенныеТипыОбъектов);
	Запрос.Параметры.Вставить("ПрочиеТипыОбъектов",			ПрочиеТипыОбъектов);
	Запрос.Параметры.Вставить("ПустыеЗначенияКонтактов",	CRM_ЛентаСобытийПовтИсп.ПустыеЗначенияКонтактовВзаимодействий());
	Запрос.Параметры.Вставить("ТипИнтерес",					Тип("ДокументСсылка.CRM_Интерес"));
	Запрос.Параметры.Вставить("ВключенныеТипыОбращений",	ВключенныеТипыОбращений);
	Запрос.Параметры.Вставить("ВключенныеВидыВзаимодействий",	ВключенныеВидыВзаимодействий);
	Запрос.Параметры.Вставить("ВключенныеНаправленияЗвонков",	ВключенныеНаправленияЗвонков);
	Запрос.Параметры.Вставить("ВключенныеНаправленияЧатов",	ВключенныеНаправленияЧатов);
	
	ТекущийОбъект = ТекДанные.Ссылка;	
	
	МассивПредметов = Новый Массив;
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		Запрос.Текст = ВернутьТекстЗапроса();
		
		МассивПредметов.Добавить(ТекущийОбъект);
		Если ЗначениеЗаполнено(ТекущийОбъект.Партнер) Тогда
			МассивПредметов.Добавить(ТекущийОбъект.Партнер);
		КонецЕсли;
		
		ТелефонАбонента = "ХХХХХХХХХХ";
		
		
		ДокументОснование = ТекущийОбъект.ДокументОснование;
		
		Если ЗначениеЗаполнено(ДокументОснование) 
			И (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CRM_Заявка")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.смартЛид")) Тогда
			
			Если НЕ ДокументОснование.Телефон = "" Тогда
				
				ТелефонАбонента = ДокументОснование.Телефон;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Запрос.Параметры.Вставить("ТелефонАбонента", ТелефонАбонента);
		Запрос.УстановитьПараметр("МассивПредметов", МассивПредметов);
		Запрос.УстановитьПараметр("ДатаИнтереса", ТекущийОбъект.Дата);
		
	Иначе	
		
		Запрос.Текст = ВернутьТекстЗапросаПартнер();
		
		МассивПредметов.Добавить(ТекущийОбъект);
		Запрос.Параметры.Вставить("МассивПредметов", МассивПредметов);
		
		ЗапросКонтакты = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК Контакты
		|ГДЕ
		|	Контакты.Владелец = &Объект");
		ЗапросКонтакты.Параметры.Вставить("Объект", ТекущийОбъект);
		ДоступныеКонтакты = ЗапросКонтакты.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ДоступныеКонтакты.Добавить(Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
		Запрос.Параметры.Вставить("ДоступныеКонтакты", ДоступныеКонтакты);
		
	КонецЕсли;
	
	//ТабЛента.Загрузить(Запрос.Выполнить().Выгрузить());
	Пакет = Запрос.ВыполнитьПакет();
	ТабЛента.Загрузить(Пакет[12].Выгрузить());
	ТабЛентаПартнерыОтветственные.Загрузить(Пакет[11].Выгрузить());
	
	
	
	Для Каждого СтрТабЛента Из ТабЛента Цикл
		СтрТабЛента.Тип = ИзменитьНаименованиеТипа(СтрТабЛента.Тип);	
	КонецЦикла;		
	
	
	
	//ТЗПредварительнаяОтветственные = Новый ТаблицаЗначений();
	//ТЗПредварительнаяОтветственные.Колонки.Добавить("Ответственный");
	//ТЗПредварительнаяОтветственные.Колонки.Добавить("ДатаВзаимодействия");
	//
	//Для Каждого СтрТабЛента Из ТабЛента Цикл
	//	Если СтрТабЛента.Тип = "Заметка" или СтрТабЛента.Тип = "Завершенно взаимодействие" Тогда  
	//		ТЗПредварительнаяОтветственные.Добавить();
	//		ТЗПредварительнаяОтветственные.Ответственный = СтрТабЛента.Отправитель;
	//        ТЗПредварительнаяОтветственные.ДатаВзаимодействия = СтрТабЛента.Дата;
	//	Конецесли;
	//КонецЦикла;	
	
	//ТЗПредварительнаяОтветственные.Свернуть("Ответственный", 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПродажиРасходники(ТекДанные)
	Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	//|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	//|	РеализацияТоваровУслугТовары.СуммаСНДС КАК Сумма
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//|ГДЕ
	//|	РеализацияТоваровУслугТовары.Ссылка.Проведен
	//|	И РеализацияТоваровУслугТовары.Ссылка.Партнер = &Партнер
	//|	И 1 = 1
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	РеализацияТоваровУслугТовары.Ссылка.Дата УБЫВ
	//|ИТОГИ
	//|	СУММА(СуммаСНДС)
	//|ПО
	//|	ЗаказКлиента");
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК Количество,
	|	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиРеглОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			АналитикаУчетаПоПартнерам.Партнер = &Партнер
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = &Запчасти) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Дата УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК Количество,
	|	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиРеглОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			АналитикаУчетаПоПартнерам.Партнер = &Партнер
	|				И АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&Расходка)) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Дата УБЫВ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ЗаказКлиента");
	Запрос.УстановитьПараметр("Партнер", ТекДанные.Ссылка);
	Запрос.УстановитьПараметр("Запчасти", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Запчасти сервисного центра"));
	Запрос.УстановитьПараметр("Расходка", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007802"));
	
	Пакет = Запрос.ВыполнитьПакет();
	РезультатЗапчасти = Пакет[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(РезультатЗапчасти, "ДЗПродажиЗапчасти");
	РезультатДляКоличества = Пакет[0].Выгрузить();
	РезультатДляКоличества.Свернуть("ЗаказКлиента", "Количество");
	Элементы.ГруппаПродажиСЦ.Заголовок = "Продажи СЦ - " + РезультатДляКоличества.Количество();
	
	РезультатРасходка = Пакет[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(РезультатРасходка, "ДЗПродажиРасходников");
	РезультатДляКоличества = Пакет[1].Выгрузить();
	РезультатДляКоличества.Свернуть("ЗаказКлиента", "Количество");
	Элементы.ГруппаПродажиРасходников.Заголовок = "Продажи расходников - " + РезультатДляКоличества.Количество();
	
КонецПроцедуры	

&НаКлиенте
Процедура ДСПартнерыПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДСПартнеры.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		СформироватьЗаметкиВзаимодействияПартнера(ТекДанные.Ссылка);
		//СформироватьПродажиРасходники(ТекДанные);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСКонтактнаяИнформация, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСОборудованиеЧернила, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЧернилаОборудование, "Партнер", ТекДанные.Ссылка, Истина);
		CRM_СформироватьСтрокуРезультатаПоиска(ТекДанные.Ссылка);
		ТекПартнер = ТекДанные.Ссылка;
	Иначе
		ТекПартнер = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

#Область ЛентаИнтереса

&НаСервере
Функция ВернутьТекстЗапроса()
	Возврат "ВЫБРАТЬ
	|	ЖурналДокументов.Объект КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(ЖурналДокументов.Объект) КАК ТипОбъекта,
	|	ЖурналДокументов.Дата КАК Дата,
	|	ЖурналДокументов.Номер КАК Номер,
	|	ЖурналДокументов.Сумма КАК Сумма,
	|	ЖурналДокументов.Валюта КАК Валюта,
	|	ЖурналДокументов.Автор КАК Автор,
	|	ЖурналДокументов.Проведен КАК Проведен,
	|	"""" КАК ТемаИнтереса,
	|	НЕОПРЕДЕЛЕНО КАК ТипОбращенияИнтереса,
	|	НЕОПРЕДЕЛЕНО КАК Интерес,
	|	ИСТИНА КАК ОсновнойИнтерес,
	|	ПРЕДСТАВЛЕНИЕ(ЖурналДокументов.ТипОбъекта) КАК Вид
	|ПОМЕСТИТЬ ОбъектыЖурналаОтбор
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК ЖурналДокументов
	|ГДЕ
	|	ЖурналДокументов.CRM_Интерес = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	ОбъектыЖурнала.Сумма КАК Сумма,
	|	ОбъектыЖурнала.Валюта КАК Валюта,
	|	ОбъектыЖурнала.Автор КАК Автор,
	|	ОбъектыЖурнала.Проведен КАК Проведен,
	|	ОбъектыЖурнала.Вид КАК Вид
	|ПОМЕСТИТЬ УникальныеОбъектыЖурнала
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ИнтересыПоОбъектам
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|ГДЕ
	|	ОбъектыЖурнала.ОсновнойИнтерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	ОбъектыЖурнала.Сумма КАК Сумма,
	|	ОбъектыЖурнала.Валюта КАК Валюта,
	|	ОбъектыЖурнала.Автор КАК Автор,
	|	ОбъектыЖурнала.Проведен КАК Проведен,
	|	ОбъектыЖурнала.Вид КАК Вид,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТемаИнтереса, """") КАК ТемаИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТипОбращенияИнтереса, НЕОПРЕДЕЛЕНО) КАК ТипОбращенияИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.Интерес, НЕОПРЕДЕЛЕНО) КАК Интерес
	|ПОМЕСТИТЬ ВсеОбъектыЖурнала
	|ИЗ
	|	УникальныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнтересыПоОбъектам КАК ИнтересыПоОбъектам
	|		ПО ОбъектыЖурнала.Ссылка = ИнтересыПоОбъектам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата КАК Дата,
	|	ВсеОбъектыЖурнала.Номер КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ПрочиеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	ВсеОбъектыЖурнала.ТипОбъекта В(&ПрочиеТипыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата КАК Дата,
	|	ВсеОбъектыЖурнала.Номер КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ВыбранныеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	(ВсеОбъектыЖурнала.ТипОбъекта В (&ВключенныеТипыОбъектов)
	|			ИЛИ ВсеОбъектыЖурнала.ТипОбъекта = &ТипИнтерес
	|				И ВсеОбъектыЖурнала.ТипОбращенияИнтереса В (&ВключенныеТипыОбращений))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьКоманды,
	|	ЛОЖЬ КАК Группировка,
	|	ИСТИНА КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	Взаимодействие.ПлановаяДата КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	Взаимодействие.Тема КАК Тема,
	|	""ВзаимодействиеПланов"" КАК Тип,
	|	Взаимодействие.Ответственный КАК Отправитель,
	|	СтатусыВзаимодействий.ТипСостояния КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо КАК Получатель,
	|	ЛОЖЬ КАК Входящий,
	|	РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС) КАК Длительность,
	|	НЕОПРЕДЕЛЕНО КАК УчетнаяЗапись,
	|	0 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	Взаимодействие.Результат КАК Результат,
	|	Взаимодействие.ВидВзаимодействия КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовПланов
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодействий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодействий.Ссылка
	|			И (СтатусыВзаимодействий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Запланировано), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ВРаботе)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И (ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Исходящее))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ЗадачаИсполнителя.СрокИсполнения,
	|	ОбъектыЖурнала.Номер,
	|	ЗадачаИсполнителя.Наименование,
	|	""ЗадачаПланов"",
	|	ЗадачаИсполнителя.Автор,
	|	ЗадачаИсполнителя.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	РАЗНОСТЬДАТ(ЗадачаИсполнителя.СрокИсполнения, &ТекущаяДата, ЧАС),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗадачаИсполнителя.РезультатВыполнения,
	|	ЗадачаИсполнителя.CRM_Личная,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (НЕ(ЗадачаИсполнителя.Выполнена
	|					ИЛИ ЗадачаИсполнителя.ПометкаУдаления))
	|			И (НЕ(ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
	|					И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьКоманды,
	|	ЛОЖЬ КАК Группировка,
	|	ИСТИНА КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА Взаимодействие.ДатаЗавершенияВзаимодействия
	|		ИНАЧЕ Взаимодействие.ПлановаяДатаЗавершение
	|	КОНЕЦ КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	Взаимодействие.Тема КАК Тема,
	|	""ВзаимодействиеИстории"" КАК Тип,
	|	Взаимодействие.Ответственный КАК Отправитель,
	|	СтатусыВзаимодейтсвий.ТипСостояния КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо КАК Получатель,
	|	ВЫБОР
	|		КОГДА ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Входящий,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА РАЗНОСТЬДАТ(Взаимодействие.ДатаЗавершенияВзаимодействия, Взаимодействие.ПлановаяДатаЗавершение, ЧАС)
	|		ИНАЧЕ РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС)
	|	КОНЕЦ КАК Длительность,
	|	НЕОПРЕДЕЛЕНО КАК УчетнаяЗапись,
	|	0 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	Взаимодействие.Результат КАК Результат,
	|	Взаимодействие.ВидВзаимодействия КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИстории
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодейтсвий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодейтсвий.Ссылка
	|			И (СтатусыВзаимодейтсвий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Отменено)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И (ВидыВзаимодействий.Ссылка В (&ВключенныеВидыВзаимодействий))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.ПометкаУдаления
	|			ТОГДА ЗадачаИсполнителя.СрокИсполнения
	|		ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения
	|	КОНЕЦ,
	|	ОбъектыЖурнала.Номер,
	|	ЗадачаИсполнителя.Наименование,
	|	""ЗадачаИстории"",
	|	ЗадачаИсполнителя.Автор,
	|	ЗадачаИсполнителя.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗадачаИсполнителя.РезультатВыполнения,
	|	ЗадачаИсполнителя.CRM_Личная,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (ЗадачаИсполнителя.Выполнена
	|				ИЛИ ЗадачаИсполнителя.ПометкаУдаления)
	|			И (НЕ(ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
	|					И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПрисоединенныеФайлы.Ссылка,
	|	ПрисоединенныеФайлы.ДатаСоздания,
	|	"""",
	|	ПрисоединенныеФайлы.Наименование,
	|	""Файл"",
	|	ПрисоединенныеФайлы.Автор,
	|	ПрисоединенныеФайлы.ПометкаУдаления,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрисоединенныеФайлы.Размер,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрисоединенныеФайлы.Описание,
	|	ПрисоединенныеФайлы.Расширение,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.CRM_ИнтересПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	|ГДЕ
	|	ПрисоединенныеФайлы.ВладелецФайла = &Объект
	|	И НЕ ПрисоединенныеФайлы.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Заметка.Ссылка,
	|	Заметка.ДатаИзменения,
	|	"""",
	|	Заметка.ТекстСодержания,
	|	""Примечание"",
	|	Заметка.Автор,
	|	Заметка.ПометкаУдаления,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.Заметки КАК Заметка
	|ГДЕ
	|	(Заметка.Предмет В (&МассивПредметов)
	|			ИЛИ Заметка.смартПартнер В (&МассивПредметов))
	|	И Заметка.CRM_ЗаметкаЛенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ТелефонныйЗвонок.Ссылка,
	|	ТелефонныйЗвонок.Дата,
	|	ТелефонныйЗвонок.Номер,
	|	ТелефонныйЗвонок.Комментарий,
	|	""ТелефонныйЗвонок"",
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.АбонентПредставление
	|		ИНАЧЕ ТелефонныйЗвонок.Автор
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка,
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.Ответственный
	|		ИНАЧЕ ТелефонныйЗвонок.АбонентПредставление
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.Входящий,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|ГДЕ
	|	ТелефонныйЗвонок.АбонентКакСвязаться ПОДОБНО &ТелефонАбонента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ТелефонныйЗвонок.Ссылка,
	|	ТелефонныйЗвонок.Дата,
	|	ТелефонныйЗвонок.Номер,
	|	ТелефонныйЗвонок.Комментарий,
	|	""ТелефонныйЗвонок"",
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.АбонентПредставление
	|		ИНАЧЕ ТелефонныйЗвонок.Автор
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка,
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.Ответственный
	|		ИНАЧЕ ТелефонныйЗвонок.АбонентПредставление
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.Входящий,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТелефонныйЗвонок.АбонентКонтакт ССЫЛКА Справочник.Партнеры
	|				ТОГДА ТелефонныйЗвонок.АбонентКонтакт В (&МассивПредметов)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТелефонныйЗвонок.АбонентКонтакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|						ТОГДА ТелефонныйЗвонок.АбонентКонтакт.Владелец В (&МассивПредметов)
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ТелефонныйЗвонок.Комментарий,
	|	""ТелефонныйЗвонок"",
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.АбонентПредставление
	|		ИНАЧЕ ТелефонныйЗвонок.Автор
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка,
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.Ответственный
	|		ИНАЧЕ ТелефонныйЗвонок.АбонентПредставление
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.Входящий,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ТелефонныйЗвонок.Ссылка = ОбъектыЖурнала.Ссылка
	|ГДЕ
	|	ТелефонныйЗвонок.Входящий В(&ВключенныеНаправленияЗвонков)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоВходящее.ОтправительПредставление,
	|	НЕОПРЕДЕЛЕНО,
	|	ЭлектронноеПисьмоВходящее.СписокПолучателейПисьма,
	|	ИСТИНА,
	|	0,
	|	ЭлектронноеПисьмоВходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоВходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ВЫБОР
	|		КОГДА ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	|			ТОГДА ЭлектронноеПисьмоИсходящее.ДатаОтправления
	|		ИНАЧЕ ЭлектронноеПисьмоИсходящее.Дата
	|	КОНЕЦ,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоИсходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоИсходящее.Автор,
	|	ЭлектронноеПисьмоИсходящее.СтатусПисьма,
	|	ЭлектронноеПисьмоИсходящее.СписокПолучателейПисьма,
	|	ЛОЖЬ,
	|	0,
	|	ЭлектронноеПисьмоИсходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	CRM_СообщенияДиалоговПоследние.Дата,
	|	CRM_Диалоги.Код,
	|	CRM_СообщенияДиалоговПоследние.ТекстСокр,
	|	""Диалог"",
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Контакт В (&ПустыеЗначенияКонтактов)
	|			ТОГДА CRM_Диалоги.КонтактПредставление
	|		ИНАЧЕ CRM_Диалоги.Контакт
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА CRM_Диалоги.CRM_РольОтветственного
	|		ИНАЧЕ CRM_Диалоги.Ответственный
	|	КОНЕЦ,
	|	ИСТИНА,
	|	0,
	|	CRM_Диалоги.УчетнаяЗапись,
	|	0,
	|	CRM_Диалоги.Группа,
	|	CRM_Диалоги.ID_Пользователя,
	|	CRM_Диалоги.КонтактПредставление,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Справочник.CRM_Диалоги КАК CRM_Диалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО CRM_Диалоги.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СообщенияДиалоговПоследние КАК CRM_СообщенияДиалоговПоследние
	|		ПО (CRM_СообщенияДиалоговПоследние.Диалог = CRM_Диалоги.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	СообщениеSMS.Тема,
	|	""СообщениеSMS"",
	|	СообщениеSMS.Автор,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Доставлено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СообщениеSMS.СписокУчастников,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.SMS4B_ТипСообщения = ЗНАЧЕНИЕ(Перечисление.SMS4B_ТипыСообщений.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.СообщениеSMS КАК СообщениеSMS
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО СообщениеSMS.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	Заявка.Тема,
	|	""Заявка"",
	|	Заявка.Наименование,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА,
	|	0,
	|	Заявка.ИсточникПолучения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	Заявка.Организация,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Заявка КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Заявка.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ДокументИнтерес.Тема,
	|	""Интерес"",
	|	ДокументИнтерес.Ответственный,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ДокументИнтерес.ТипОбращения,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Интерес КАК ДокументИнтерес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ДокументИнтерес.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (ДокументИнтерес.ДокументОснование = &Объект)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""КоммерческоеПредложение"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО КоммерческоеПредложение.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""ПрочийДокумент"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	ПрочиеОбъектыЖурнала КАК ОбъектыЖурнала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ДокументИнтерес.Ссылка,
	|	ДокументИнтерес.Дата,
	|	ДокументИнтерес.Номер,
	|	ДокументИнтерес.Тема,
	|	""СозданиеОбъекта"",
	|	ДокументИнтерес.Автор,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ДокументИнтерес.ТипОбращения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.CRM_Интерес КАК ДокументИнтерес
	|ГДЕ
	|	ДокументИнтерес.Ссылка = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЗаписиИстории.Партнер,
	|	ЗаписиИстории.Период,
	|	"""",
	|	"""",
	|	""ЗаписьИстории"",
	|	ЗаписиИстории.СтароеЗначение,
	|	ЗаписиИстории.ЭтоНовый,
	|	ЗаписиИстории.Значение,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ЗаписиИстории.Автор,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
	|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
	|			И (ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес"")
	|ГДЕ
	|	ЗаписиИстории.Партнер = &Объект
	|	И НЕ ЗаписиИстории.ЭтоНовый
	|	И ЗаписиИстории.ПутьКДанным = ""СостояниеИнтереса""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЗаписиИстории.Партнер,
	|	ЗаписиИстории.Период,
	|	"""",
	|	"""",
	|	""ЗаписьИстории"",
	|	ЗаписиИстории.СтароеЗначение,
	|	ЗаписиИстории.ЭтоНовый,
	|	ЗаписиИстории.Значение,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ЗаписиИстории.Автор,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
	|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
	|			И (ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес"")
	|ГДЕ
	|	ЗаписиИстории.Партнер = &Объект
	|	И НЕ ЗаписиИстории.ЭтоНовый
	|	И ЗаписиИстории.ПутьКДанным = ""Ответственный""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ДокументИнтерес.Ссылка,
	|	ДокументИнтерес.ДатаЗакрытия,
	|	ДокументИнтерес.Номер,
	|	ДокументИнтерес.Тема,
	|	""ЗавершениеИнтереса"",
	|	ДокументИнтерес.Ответственный,
	|	ВЫБОР
	|		КОГДА ДокументИнтерес.ПричинаОтказа = ЗНАЧЕНИЕ(Справочник.CRM_ПричиныОтказаПоИнтересам.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ДокументИнтерес.ТипОбращения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.CRM_Интерес КАК ДокументИнтерес
	|ГДЕ
	|	ДокументИнтерес.Ссылка = &Объект
	|	И ДокументИнтерес.Завершен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЗаписиИстории.Партнер,
	|	ЗаписиИстории.Период,
	|	"""",
	|	"""",
	|	""ЗаписьИстории"",
	|	ЗаписиИстории.СтароеЗначение,
	|	ЗаписиИстории.ЭтоНовый,
	|	ЗаписиИстории.Значение,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаписиИстории.ВидЗаписи,
	|	ЗаписиИстории.Автор,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
	|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
	|			И (ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес"")
	|ГДЕ
	|	ЗаписиИстории.Партнер = &Объект
	|	И НЕ ЗаписиИстории.ЭтоНовый
	|	И НЕ ЗаписиИстории.ПутьКДанным В (""СостояниеИнтереса"", ""Ответственный"", ""ОсновнойМенеджер"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ДанныеОбъектов.ЕстьКоманды КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка КАК Группировка,
	|	ДанныеОбъектов.Тип КАК Тип,
	|	ДанныеОбъектов.Дата КАК Дата,
	|	ДанныеОбъектов.Номер КАК Номер,
	|	ДанныеОбъектов.Входящий КАК Входящий,
	|	ДанныеОбъектов.Отправитель КАК Отправитель,
	|	ДанныеОбъектов.Получатель КАК Получатель,
	|	ДанныеОбъектов.Состояние КАК Состояние,
	|	ДанныеОбъектов.Длительность КАК Длительность,
	|	ДанныеОбъектов.Тема КАК Тема,
	|	ДанныеОбъектов.Ссылка КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма КАК Сумма,
	|	ДанныеОбъектов.Валюта КАК Валюта,
	|	ДанныеОбъектов.Результат КАК Результат,
	|	ДанныеОбъектов.Вид КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИсторииСортировка
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|ГДЕ
	|	ДанныеОбъектов.Дата >= &ДатаИнтереса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДанныеОбъектов.Ссылка) КАК Количество
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|ГДЕ
	|	ДанныеОбъектов.Дата >= &ДатаИнтереса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК Раздел,
	|	ДанныеОбъектов.ЕстьКоманды КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка КАК Группировка,
	|	ДанныеОбъектов.Тип КАК Тип,
	|	ДанныеОбъектов.Дата КАК Дата,
	|	ДанныеОбъектов.Номер КАК Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ) КАК ДатаБезВремени,
	|	ГОД(ДанныеОбъектов.Дата) КАК Год,
	|	ДанныеОбъектов.Входящий КАК Входящий,
	|	ДанныеОбъектов.Отправитель КАК Отправитель,
	|	ДанныеОбъектов.Получатель КАК Получатель,
	|	ДанныеОбъектов.Состояние КАК Состояние,
	|	ДанныеОбъектов.Длительность КАК Длительность,
	|	ДанныеОбъектов.Тема КАК Тема,
	|	ДанныеОбъектов.Ссылка КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма КАК Сумма,
	|	ДанныеОбъектов.Валюта КАК Валюта,
	|	ДанныеОбъектов.Результат КАК Результат,
	|	ДанныеОбъектов.Вид КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес КАК Интерес
	|ИЗ
	|	ДанныеОбъектовПланов КАК ДанныеОбъектов
	|ГДЕ
	|	ДанныеОбъектов.Дата >= &ДатаИнтереса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ДанныеОбъектов.ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы,
	|	ДанныеОбъектов.Группировка,
	|	ДанныеОбъектов.Тип,
	|	ДанныеОбъектов.Дата,
	|	ДанныеОбъектов.Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ),
	|	ГОД(ДанныеОбъектов.Дата),
	|	ДанныеОбъектов.Входящий,
	|	ДанныеОбъектов.Отправитель,
	|	ДанныеОбъектов.Получатель,
	|	ДанныеОбъектов.Состояние,
	|	ДанныеОбъектов.Длительность,
	|	ДанныеОбъектов.Тема,
	|	ДанныеОбъектов.Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма,
	|	ДанныеОбъектов.Валюта,
	|	ДанныеОбъектов.Результат,
	|	ДанныеОбъектов.Вид,
	|	ДанныеОбъектов.ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес
	|ИЗ
	|	ДанныеОбъектовИсторииСортировка КАК ДанныеОбъектов
	|ГДЕ
	|	ДанныеОбъектов.Дата >= &ДатаИнтереса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	Дата УБЫВ,
	|	Тип";
КонецФункции	

&НаСервере
Функция ВернутьТекстЗапросаПартнер()
	
	Возврат "ВЫБРАТЬ
	|	ЖурналДокументов.Объект КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(ЖурналДокументов.Объект) КАК ТипОбъекта,
	|	ЖурналДокументов.Дата КАК Дата,
	|	ЖурналДокументов.Номер КАК Номер,
	|	ЖурналДокументов.Сумма КАК Сумма,
	|	ЖурналДокументов.Валюта КАК Валюта,
	|	ЖурналДокументов.Автор КАК Автор,
	|	ЖурналДокументов.Проведен КАК Проведен,
	|	ЖурналДокументов.CRM_Интерес.Тема КАК ТемаИнтереса,
	|	ЖурналДокументов.CRM_Интерес.ТипОбращения КАК ТипОбращенияИнтереса,
	|	ЖурналДокументов.CRM_Интерес КАК Интерес,
	|	ЖурналДокументов.ОсновнойИнтерес КАК ОсновнойИнтерес,
	|	ПРЕДСТАВЛЕНИЕ(ЖурналДокументов.ТипОбъекта) КАК Вид
	|ПОМЕСТИТЬ ОбъектыЖурналаОтбор
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК ЖурналДокументов
	|ГДЕ
	|	ЖурналДокументов.Клиент = &Объект
	|	И ЖурналДокументов.КонтактноеЛицо В(&ДоступныеКонтакты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	ОбъектыЖурнала.Сумма КАК Сумма,
	|	ОбъектыЖурнала.Валюта КАК Валюта,
	|	ОбъектыЖурнала.Автор КАК Автор,
	|	ОбъектыЖурнала.Проведен КАК Проведен,
	|	ОбъектыЖурнала.Вид КАК Вид
	|ПОМЕСТИТЬ УникальныеОбъектыЖурнала
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ИнтересыПоОбъектам
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|ГДЕ
	|	ОбъектыЖурнала.ОсновнойИнтерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	ОбъектыЖурнала.Сумма КАК Сумма,
	|	ОбъектыЖурнала.Валюта КАК Валюта,
	|	ОбъектыЖурнала.Автор КАК Автор,
	|	ОбъектыЖурнала.Проведен КАК Проведен,
	|	ОбъектыЖурнала.Вид КАК Вид,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТемаИнтереса, """") КАК ТемаИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТипОбращенияИнтереса, НЕОПРЕДЕЛЕНО) КАК ТипОбращенияИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.Интерес, НЕОПРЕДЕЛЕНО) КАК Интерес
	|ПОМЕСТИТЬ ВсеОбъектыЖурнала
	|ИЗ
	|	УникальныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнтересыПоОбъектам КАК ИнтересыПоОбъектам
	|		ПО ОбъектыЖурнала.Ссылка = ИнтересыПоОбъектам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата КАК Дата,
	|	ВсеОбъектыЖурнала.Номер КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ПрочиеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	ВсеОбъектыЖурнала.ТипОбъекта В(&ПрочиеТипыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата КАК Дата,
	|	ВсеОбъектыЖурнала.Номер КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ВыбранныеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	(ВсеОбъектыЖурнала.ТипОбъекта В (&ВключенныеТипыОбъектов)
	|			ИЛИ ВсеОбъектыЖурнала.ТипОбъекта = &ТипИнтерес
	|				И ВсеОбъектыЖурнала.ТипОбращенияИнтереса В (&ВключенныеТипыОбращений))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьКоманды,
	|	ЛОЖЬ КАК Группировка,
	|	ИСТИНА КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	Взаимодействие.ПлановаяДата КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	Взаимодействие.Тема КАК Тема,
	|	""ВзаимодействиеПланов"" КАК Тип,
	|	Взаимодействие.Ответственный КАК Отправитель,
	|	СтатусыВзаимодействий.ТипСостояния КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо КАК Получатель,
	|	ЛОЖЬ КАК Входящий,
	|	РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС) КАК Длительность,
	|	НЕОПРЕДЕЛЕНО КАК УчетнаяЗапись,
	|	0 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	Взаимодействие.Результат КАК Результат,
	|	Взаимодействие.ВидВзаимодействия КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовПланов
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодействий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодействий.Ссылка
	|			И (СтатусыВзаимодействий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Запланировано), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ВРаботе)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И (ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Исходящее))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ЗадачаИсполнителя.СрокИсполнения,
	|	ОбъектыЖурнала.Номер,
	|	ЗадачаИсполнителя.Наименование,
	|	""ЗадачаПланов"",
	|	ЗадачаИсполнителя.Автор,
	|	ЗадачаИсполнителя.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	РАЗНОСТЬДАТ(ЗадачаИсполнителя.СрокИсполнения, &ТекущаяДата, ЧАС),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗадачаИсполнителя.РезультатВыполнения,
	|	ЗадачаИсполнителя.CRM_Личная,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (НЕ(ЗадачаИсполнителя.Выполнена
	|					ИЛИ ЗадачаИсполнителя.ПометкаУдаления))
	|			И (НЕ(ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
	|					И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьКоманды,
	|	ЛОЖЬ КАК Группировка,
	|	ИСТИНА КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА Взаимодействие.ДатаЗавершенияВзаимодействия
	|		ИНАЧЕ Взаимодействие.ПлановаяДатаЗавершение
	|	КОНЕЦ КАК Дата,
	|	ОбъектыЖурнала.Номер КАК Номер,
	|	Взаимодействие.Тема КАК Тема,
	|	""ВзаимодействиеИстории"" КАК Тип,
	|	Взаимодействие.Ответственный КАК Отправитель,
	|	СтатусыВзаимодейтсвий.ТипСостояния КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо КАК Получатель,
	|	ВЫБОР
	|		КОГДА ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Входящий,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА РАЗНОСТЬДАТ(Взаимодействие.ДатаЗавершенияВзаимодействия, Взаимодействие.ПлановаяДатаЗавершение, ЧАС)
	|		ИНАЧЕ РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС)
	|	КОНЕЦ КАК Длительность,
	|	НЕОПРЕДЕЛЕНО КАК УчетнаяЗапись,
	|	0 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	Взаимодействие.Результат КАК Результат,
	|	Взаимодействие.ВидВзаимодействия КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИстории
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодейтсвий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодейтсвий.Ссылка
	|			И (СтатусыВзаимодейтсвий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Отменено)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И (ВидыВзаимодействий.Ссылка В (&ВключенныеВидыВзаимодействий))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.ПометкаУдаления
	|			ТОГДА ЗадачаИсполнителя.СрокИсполнения
	|		ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения
	|	КОНЕЦ,
	|	ОбъектыЖурнала.Номер,
	|	ЗадачаИсполнителя.Наименование,
	|	""ЗадачаИстории"",
	|	ЗадачаИсполнителя.Автор,
	|	ЗадачаИсполнителя.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗадачаИсполнителя.РезультатВыполнения,
	|	ЗадачаИсполнителя.CRM_Личная,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (ЗадачаИсполнителя.Выполнена
	|				ИЛИ ЗадачаИсполнителя.ПометкаУдаления)
	|			И (НЕ(ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
	|					И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПрисоединенныеФайлы.Ссылка,
	|	ПрисоединенныеФайлы.ДатаСоздания,
	|	"""",
	|	ПрисоединенныеФайлы.Наименование,
	|	""Файл"",
	|	ПрисоединенныеФайлы.Автор,
	|	ПрисоединенныеФайлы.ПометкаУдаления,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрисоединенныеФайлы.Размер,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрисоединенныеФайлы.Описание,
	|	ПрисоединенныеФайлы.Расширение,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.ПартнерыПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	|ГДЕ
	|	ПрисоединенныеФайлы.ВладелецФайла = &Объект
	|	И НЕ ПрисоединенныеФайлы.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Заметка.Ссылка,
	|	Заметка.ДатаИзменения,
	|	"""",
	|	Заметка.ТекстСодержания,
	|	""Примечание"",
	|	Заметка.Автор,
	|	Заметка.ПометкаУдаления,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.Заметки КАК Заметка
	|ГДЕ
	|	(Заметка.Предмет В (&МассивПредметов)
	|			ИЛИ Заметка.смартПартнер В (&МассивПредметов))
	|	И Заметка.CRM_ЗаметкаЛенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	смартЛид.Ссылка,
	|	смартЛид.Дата,
	|	"""",
	|	ВЫБОР
	|		КОГДА смартЛид.Продукт = """"
	|			ТОГДА (ВЫРАЗИТЬ(смартЛид.Тема КАК СТРОКА(100))) + "" Тип: "" + (ВЫРАЗИТЬ(смартЛид.ТипТовара КАК СТРОКА(100)))
	|		ИНАЧЕ (ВЫРАЗИТЬ(смартЛид.Тема КАК СТРОКА(100))) + "" Продукт: "" + (ВЫРАЗИТЬ(смартЛид.Продукт КАК СТРОКА(100)))
	|	КОНЕЦ,
	|	""Лид"",
	|	смартЛид.Ответственный,
	|	смартЛид.ПометкаУдаления,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.смартЛид КАК смартЛид
	|ГДЕ
	|	смартЛид.Партнер = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ТелефонныйЗвонок.Комментарий,
	|	""ТелефонныйЗвонок"",
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.АбонентПредставление
	|		ИНАЧЕ ТелефонныйЗвонок.Автор
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка,
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.Ответственный
	|		ИНАЧЕ ТелефонныйЗвонок.АбонентПредставление
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.Входящий,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ТелефонныйЗвонок.Ссылка = ОбъектыЖурнала.Ссылка
	|ГДЕ
	|	ТелефонныйЗвонок.Входящий В(&ВключенныеНаправленияЗвонков)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоВходящее.ОтправительПредставление,
	|	НЕОПРЕДЕЛЕНО,
	|	ЭлектронноеПисьмоВходящее.СписокПолучателейПисьма,
	|	ИСТИНА,
	|	0,
	|	ЭлектронноеПисьмоВходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоВходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ВЫБОР
	|		КОГДА ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	|			ТОГДА ЭлектронноеПисьмоИсходящее.ДатаОтправления
	|		ИНАЧЕ ЭлектронноеПисьмоИсходящее.Дата
	|	КОНЕЦ,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоИсходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоИсходящее.Автор,
	|	ЭлектронноеПисьмоИсходящее.СтатусПисьма,
	|	ЭлектронноеПисьмоИсходящее.СписокПолучателейПисьма,
	|	ЛОЖЬ,
	|	0,
	|	ЭлектронноеПисьмоИсходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	CRM_СообщенияДиалоговПоследние.Дата,
	|	CRM_Диалоги.Код,
	|	CRM_СообщенияДиалоговПоследние.ТекстСокр,
	|	""Диалог"",
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Контакт В (&ПустыеЗначенияКонтактов)
	|			ТОГДА CRM_Диалоги.КонтактПредставление
	|		ИНАЧЕ CRM_Диалоги.Контакт
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА CRM_Диалоги.CRM_РольОтветственного
	|		ИНАЧЕ CRM_Диалоги.Ответственный
	|	КОНЕЦ,
	|	ИСТИНА,
	|	0,
	|	CRM_Диалоги.УчетнаяЗапись,
	|	0,
	|	CRM_Диалоги.Группа,
	|	CRM_Диалоги.ID_Пользователя,
	|	CRM_Диалоги.КонтактПредставление,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Справочник.CRM_Диалоги КАК CRM_Диалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО CRM_Диалоги.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СообщенияДиалоговПоследние КАК CRM_СообщенияДиалоговПоследние
	|		ПО (CRM_СообщенияДиалоговПоследние.Диалог = CRM_Диалоги.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	СообщениеSMS.Тема,
	|	""СообщениеSMS"",
	|	СообщениеSMS.Автор,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Доставлено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СообщениеSMS.СписокУчастников,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.SMS4B_ТипСообщения = ЗНАЧЕНИЕ(Перечисление.SMS4B_ТипыСообщений.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.СообщениеSMS КАК СообщениеSMS
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО СообщениеSMS.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	Заявка.Тема,
	|	""Заявка"",
	|	Заявка.Наименование,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА,
	|	0,
	|	Заявка.ИсточникПолучения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	Заявка.Организация,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Заявка КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Заявка.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ДокументИнтерес.Тема,
	|	""Интерес"",
	|	ДокументИнтерес.Ответственный,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ДокументИнтерес.ТипОбращения,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Интерес КАК ДокументИнтерес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ДокументИнтерес.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""КоммерческоеПредложение"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО КоммерческоеПредложение.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""ПрочийДокумент"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	ПрочиеОбъектыЖурнала КАК ОбъектыЖурнала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Партнеры.Ссылка,
	|	Партнеры.ДатаРегистрации,
	|	"""",
	|	Партнеры.Наименование,
	|	""СозданиеОбъекта"",
	|	Партнеры.CRM_Автор,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЗаписиИстории.Партнер,
	|	ЗаписиИстории.Период,
	|	"""",
	|	"""",
	|	""ЗаписьИстории"",
	|	ЗаписиИстории.СтароеЗначение,
	|	ЗаписиИстории.ЭтоНовый,
	|	ЗаписиИстории.Значение,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ЗаписиИстории.Автор,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
	|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
	|			И (ОписаниеРеквизитов.Объект = ""Справочник.Партнеры"")
	|ГДЕ
	|	ЗаписиИстории.Партнер = &Объект
	|	И НЕ ЗаписиИстории.ЭтоНовый
	|	И ЗаписиИстории.ПутьКДанным = ""ОсновнойМенеджер""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЗаписиИстории.Партнер,
	|	ЗаписиИстории.Период,
	|	"""",
	|	"""",
	|	""ЗаписьИстории"",
	|	ЗаписиИстории.СтароеЗначение,
	|	ЗаписиИстории.ЭтоНовый,
	|	ЗаписиИстории.Значение,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаписиИстории.ВидЗаписи,
	|	ЗаписиИстории.Автор,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
	|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
	|			И (ОписаниеРеквизитов.Объект = ""Справочник.Партнеры"")
	|ГДЕ
	|	ЗаписиИстории.Партнер = &Объект
	|	И НЕ ЗаписиИстории.ЭтоНовый
	|	И НЕ ЗаписиИстории.ПутьКДанным В (""СостояниеИнтереса"", ""Ответственный"", ""ОсновнойМенеджер"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	ДанныеОбъектов.ЕстьКоманды КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка КАК Группировка,
	|	ДанныеОбъектов.Тип КАК Тип,
	|	ДанныеОбъектов.Дата КАК Дата,
	|	ДанныеОбъектов.Номер КАК Номер,
	|	ДанныеОбъектов.Входящий КАК Входящий,
	|	ДанныеОбъектов.Отправитель КАК Отправитель,
	|	ДанныеОбъектов.Получатель КАК Получатель,
	|	ДанныеОбъектов.Состояние КАК Состояние,
	|	ДанныеОбъектов.Длительность КАК Длительность,
	|	ДанныеОбъектов.Тема КАК Тема,
	|	ДанныеОбъектов.Ссылка КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма КАК Сумма,
	|	ДанныеОбъектов.Валюта КАК Валюта,
	|	ДанныеОбъектов.Результат КАК Результат,
	|	ДанныеОбъектов.Вид КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИсторииСортировка
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДанныеОбъектов.Ссылка) КАК Количество
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК Раздел,
	|	ДанныеОбъектов.ЕстьКоманды КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка КАК Группировка,
	|	ДанныеОбъектов.Тип КАК Тип,
	|	ДанныеОбъектов.Дата КАК Дата,
	|	ДанныеОбъектов.Номер КАК Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ) КАК ДатаБезВремени,
	|	ГОД(ДанныеОбъектов.Дата) КАК Год,
	|	ДанныеОбъектов.Входящий КАК Входящий,
	|	ДанныеОбъектов.Отправитель КАК Отправитель,
	|	ДанныеОбъектов.Получатель КАК Получатель,
	|	ДанныеОбъектов.Состояние КАК Состояние,
	|	ДанныеОбъектов.Длительность КАК Длительность,
	|	ВЫБОР
	|		КОГДА ДанныеОбъектов.Ссылка ССЫЛКА Документ.CRM_Взаимодействие
	|			ТОГДА ДанныеОбъектов.Результат
	|		ИНАЧЕ ДанныеОбъектов.Тема
	|	КОНЕЦ КАК Тема,
	|	ДанныеОбъектов.Ссылка КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма КАК Сумма,
	|	ДанныеОбъектов.Валюта КАК Валюта,
	|	ДанныеОбъектов.Результат КАК Результат,
	|	ДанныеОбъектов.Вид КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес КАК Интерес
	|ПОМЕСТИТЬ ВсеДанные
	|ИЗ
	|	ДанныеОбъектовПланов КАК ДанныеОбъектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ДанныеОбъектов.ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы,
	|	ДанныеОбъектов.Группировка,
	|	ДанныеОбъектов.Тип,
	|	ДанныеОбъектов.Дата,
	|	ДанныеОбъектов.Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ),
	|	ГОД(ДанныеОбъектов.Дата),
	|	ДанныеОбъектов.Входящий,
	|	ДанныеОбъектов.Отправитель,
	|	ДанныеОбъектов.Получатель,
	|	ДанныеОбъектов.Состояние,
	|	ДанныеОбъектов.Длительность,
	|	ВЫБОР
	|		КОГДА ДанныеОбъектов.Ссылка ССЫЛКА Документ.CRM_Взаимодействие
	|			ТОГДА ДанныеОбъектов.Результат
	|		ИНАЧЕ ДанныеОбъектов.Тема
	|	КОНЕЦ,
	|	ДанныеОбъектов.Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма,
	|	ДанныеОбъектов.Валюта,
	|	ДанныеОбъектов.Результат,
	|	ДанныеОбъектов.Вид,
	|	ДанныеОбъектов.ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес
	|ИЗ
	|	ДанныеОбъектовИсторииСортировка КАК ДанныеОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДанные.Отправитель КАК Ответственный,
	|	МАКСИМУМ(ВсеДанные.Дата) КАК Дата
	|ИЗ
	|	ВсеДанные КАК ВсеДанные
	|ГДЕ
	|	(ВсеДанные.Ссылка ССЫЛКА Документ.CRM_Взаимодействие
	|			ИЛИ ВсеДанные.Ссылка ССЫЛКА Справочник.Заметки)
	|	И ВсеДанные.Ссылка.СтатусВзаимодействия = ЗНАЧЕНИЕ(справочник.CRM_СостоянияСобытий.Завершено)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДанные.Отправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДанные.Раздел КАК Раздел,
	|	ВсеДанные.ЕстьКоманды КАК ЕстьКоманды,
	|	ВсеДанные.ЕстьФайлы КАК ЕстьФайлы,
	|	ВсеДанные.Группировка КАК Группировка,
	|	ВсеДанные.Тип КАК Тип,
	|	ВсеДанные.Дата КАК Дата,
	|	ВсеДанные.Номер КАК Номер,
	|	ВсеДанные.ДатаБезВремени КАК ДатаБезВремени,
	|	ВсеДанные.Год КАК Год,
	|	ВсеДанные.Входящий КАК Входящий,
	|	ВсеДанные.Отправитель КАК Отправитель,
	|	ВсеДанные.Получатель КАК Получатель,
	|	ВсеДанные.Состояние КАК Состояние,
	|	ВсеДанные.Длительность КАК Длительность,
	|	ВсеДанные.Тема КАК Тема,
	|	ВсеДанные.Ссылка КАК Ссылка,
	|	ВсеДанные.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ВсеДанные.Сумма КАК Сумма,
	|	ВсеДанные.Валюта КАК Валюта,
	|	ВсеДанные.Результат КАК Результат,
	|	ВсеДанные.Вид КАК Вид,
	|	ВсеДанные.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеДанные.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеДанные.Интерес КАК Интерес
	|ИЗ
	|	ВсеДанные КАК ВсеДанные";	
КонецФункции	

&НаСервере
Функция ТипыОбъектовЛентыПоОтбору(Знач ОтборЛенты)
	
	ТипыОбъектов = Новый Массив;
	
	Для Каждого НастройкаОтбора Из ОтборЛенты Цикл
		
		Если Не НастройкаОтбора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОтбора = НастройкаОтбора.Значение;
		Если ИмяОтбора = "Задачи" Тогда
			ТипыОбъектов.Добавить(Тип("ЗадачаСсылка.ЗадачаИсполнителя"));
		ИначеЕсли ИмяОтбора = "ВзаимодействияВстречи" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
		ИначеЕсли ИмяОтбора = "ВходящиеЗвонки" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.ТелефонныйЗвонок"));
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
		ИначеЕсли ИмяОтбора = "ИсходящиеЗвонки" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.ТелефонныйЗвонок"));
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
		ИначеЕсли ИмяОтбора = "ВходящиеПисьма" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
		ИначеЕсли ИмяОтбора = "ИсходящиеПисьма" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
		ИначеЕсли ИмяОтбора = "ВзаимодействияПрочие" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
		ИначеЕсли ИмяОтбора = "Чаты" Тогда
			// +Рарус alexpr
			//ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_СообщениеМессенджера"));
			ТипыОбъектов.Добавить(Тип("СправочникСсылка.CRM_Диалоги"));
			// -Рарус alexpr
		ИначеЕсли ИмяОтбора = "SMS" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.СообщениеSMS"));
		ИначеЕсли ИмяОтбора = "Примечания" Тогда
			ТипыОбъектов.Добавить(Тип("СправочникСсылка.Заметки"));
		ИначеЕсли ИмяОтбора = "Документы" Тогда
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Интерес"));
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Заявка"));
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту")); 
			ТипыОбъектов.Добавить(Тип("ДокументСсылка.CRM_Телемаркетинг"));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипыОбъектов);
	
КонецФункции

&НаСервере
Функция ТипыОбращенийЛентыПоОтбору(Знач ОтборЛенты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипыОбращений = Новый Массив;
	
	Для Каждого НастройкаОтбора Из ОтборЛенты Цикл
		
		Если Не НастройкаОтбора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОтбора = НастройкаОтбора.Значение;
		Если ИмяОтбора = "Интересы" Тогда
			
			ТипыОбращений.Добавить( Справочники.CRM_ТипыОбращений.Интерес );
			
		ИначеЕсли ИмяОтбора = "ИнтересыКакПоддержка" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТипыОбращений.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.CRM_ТипыОбращений КАК ТипыОбращений";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТипыОбращений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТипыОбращений;
	
КонецФункции

&НаСервере
Функция ВидыВзаимодействийЛентыПоОтбору(Знач ОтборЛенты)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыВзаимодействий.Ссылка КАК Ссылка,
	|	ВидыВзаимодействий.ВидСобытия КАК Тип,
	|	ВидыВзаимодействий.Направление КАК Направление
	|ИЗ
	|	Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий");
	
	ВсеВидыВзаимодействий = Запрос.Выполнить().Выгрузить();
	
	ВидыВзаимодействий = Новый Массив;
	
	Для Каждого НастройкаОтбора Из ОтборЛенты Цикл
		
		Если Не НастройкаОтбора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОтбора = НастройкаОтбора.Значение;
		Если ИмяОтбора = "ВзаимодействияВстречи" Тогда
			Для Каждого Строка Из ВсеВидыВзаимодействий Цикл
				Если Строка.Тип = Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда
					ВидыВзаимодействий.Добавить(Строка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяОтбора = "ВходящиеЗвонки" Тогда
			Для Каждого Строка Из ВсеВидыВзаимодействий Цикл
				Если Строка.Тип = Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок
					И Строка.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Входящее Тогда
					ВидыВзаимодействий.Добавить(Строка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяОтбора = "ИсходящиеЗвонки" Тогда
			Для Каждого Строка Из ВсеВидыВзаимодействий Цикл
				Если Строка.Тип = Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок
					И Строка.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее Тогда
					ВидыВзаимодействий.Добавить(Строка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяОтбора = "ВходящиеПисьма" Тогда
			Для Каждого Строка Из ВсеВидыВзаимодействий Цикл
				Если Строка.Тип = Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо
					И Строка.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Входящее Тогда
					ВидыВзаимодействий.Добавить(Строка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяОтбора = "ИсходящиеПисьма" Тогда
			Для Каждого Строка Из ВсеВидыВзаимодействий Цикл
				Если Строка.Тип = Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо
					И Строка.Направление = Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее Тогда
					ВидыВзаимодействий.Добавить(Строка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяОтбора = "ВзаимодействияПрочие" Тогда
			Для Каждого Строка Из ВсеВидыВзаимодействий Цикл
				Если Строка.Тип = Перечисления.CRM_ВидыСобытий.ПочтовоеПисьмо
					Или Строка.Тип = Перечисления.CRM_ВидыСобытий.Прочее Тогда
					ВидыВзаимодействий.Добавить(Строка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВидыВзаимодействий;
	
КонецФункции

&НаСервере
Функция НаправленияЗвонковПоОтбору(Знач ОтборЛенты)
	
	Направления = Новый Массив;
	
	Для Каждого НастройкаОтбора Из ОтборЛенты Цикл
		
		Если Не НастройкаОтбора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОтбора = НастройкаОтбора.Значение;
		Если ИмяОтбора = "ВходящиеЗвонки" Тогда
			Направления.Добавить(Истина);
		ИначеЕсли ИмяОтбора = "ИсходящиеЗвонки" Тогда
			Направления.Добавить(Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Направления;
	
КонецФункции

&НаСервере
Функция НаправленияЧатовПоОтбору(Знач ОтборЛенты)
	
	Направления = Новый Массив;
	
	Для Каждого НастройкаОтбора Из ОтборЛенты Цикл
		
		Если Не НастройкаОтбора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОтбора = НастройкаОтбора.Значение;
		Если ИмяОтбора = "ВходящиеЧаты" Тогда
			Направления.Добавить(Перечисления.CRM_ВидыСообщенияМессенджера.Входящее);
		ИначеЕсли ИмяОтбора = "ИсходящиеЧаты" Тогда
			Направления.Добавить(Перечисления.CRM_ВидыСообщенияМессенджера.Исходящее);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Направления;
	
КонецФункции

&НаСервере
Функция ВключенаНастройкаОтбораЛенты(Знач ОтборЛенты, Знач ИмяНастройки)
	
	ВключенаНастройка = Ложь;
	
	НастройкаВсеСобытия = ОтборЛенты.Получить(0);
	ПометкаВсеСобытия = НастройкаВсеСобытия.Пометка;
	Если ПометкаВсеСобытия Тогда
		ВключенаНастройка = Истина;
	Иначе
		НайденнаяНастройка = ОтборЛенты.НайтиПоЗначению(ИмяНастройки);
		Если НайденнаяНастройка = Неопределено Тогда
			ВключенаНастройка = Ложь;
		Иначе
			ВключенаНастройка = НайденнаяНастройка.Пометка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВключенаНастройка;
	
КонецФункции

&НаСервере
Функция ИзменитьНаименованиеТипа(ТипОбъекта)
	
	Если ТипОбъекта = "ВзаимодействиеПланов" Тогда
		Возврат "Запланироно взаимодействие";	
	ИначеЕсли ТипОбъекта = "ЗадачаПланов" Тогда
		Возврат "Запланирована задача";
	ИначеЕсли ТипОбъекта = "Примечание" Тогда
		Возврат "Заметка";
	ИначеЕсли ТипОбъекта = "Лид" Тогда
		Возврат "Лид";
	ИначеЕсли ТипОбъекта = "ВзаимодействиеИстории" Тогда
		Возврат "Завершенно взаимодействие";
	ИначеЕсли ТипОбъекта = "ЗадачаИстории" Тогда
		Возврат "Завершенна задача";
	ИначеЕсли ТипОбъекта = "ТелефонныйЗвонок" Тогда
		Возврат "Телефонный звонок";
	ИначеЕсли ТипОбъекта = "ЭлектронноеПисьмо" Тогда
		Возврат "Эл. письмо";
	ИначеЕсли ТипОбъекта = "Диалог" Тогда
		Возврат "Диалог";		
	ИначеЕсли ТипОбъекта = "СообщениеSMS" Тогда
		Возврат "SMS";
	ИначеЕсли ТипОбъекта = "Заявка" Тогда
		Возврат "Заявка";
	ИначеЕсли ТипОбъекта = "Интерес" Тогда
		Возврат "Интерес";
	ИначеЕсли ТипОбъекта = "КоммерческоеПредложение" Тогда
		Возврат "Коммерческое предложение";
	ИначеЕсли ТипОбъекта = "ПрочийДокумент" Тогда
		Возврат "Прочий документ";
	ИначеЕсли ТипОбъекта = "СозданиеОбъекта" Тогда
		Возврат "Создан интерес";
	ИначеЕсли ТипОбъекта = "ЗавершениеИнтереса" Тогда
		Возврат "Завершен интерес";
	ИначеЕсли ТипОбъекта = "ЗаписьИстории" Тогда
		Возврат "Запись истории";
	ИначеЕсли ТипОбъекта = "Файл" Тогда
		Возврат "Файл";
	Иначе	
		Возврат ТипОбъекта;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура НоваяКомпанияПриИзменении(Элемент)
	Элементы.Компания.Видимость = НЕ НоваяКомпания;
	Элементы.КомпанияТекст.Видимость = НоваяКомпания;
	Элементы.КонтактноеЛицо.Видимость = НЕ НоваяКомпания;
	Элементы.КонтактноеЛицоТекст.Видимость = НоваяКомпания;
КонецПроцедуры

&НаКлиенте
Процедура НовоеКонтактноеЛицоПриИзменении(Элемент)
	Элементы.КонтактноеЛицо.Видимость = НЕ НовоеКонтактноеЛицо;
	Элементы.КонтактноеЛицоТекст.Видимость = НовоеКонтактноеЛицо;
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	
	Если ТипЗнч(ЭтаФорма.ДокументСЦ) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт") Тогда
		
		ЭтаФорма.Компания = ЭтаФорма.ДокументСЦ.Клиент;
		ЭтаФорма.КомпанияТекст = "";
		ЭтаФорма.НоваяКомпания = Ложь;
		Элементы.Компания.ТолькоПросмотр = Истина;
		Элементы.НоваяКомпания.ТолькоПросмотр = Истина;
		ЭтаФорма.БизнесРегион = ЭтаФорма.ДокументСЦ.Клиент.БизнесРегион;
		
	ИначеЕсли ТипЗнч(ЭтаФорма.ДокументСЦ) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")
		ИЛИ ТипЗнч(ЭтаФорма.ДокументСЦ) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		ЭтаФорма.Компания = ЭтаФорма.ДокументСЦ.Партнер;
		ЭтаФорма.БизнесРегион = ЭтаФорма.ДокументСЦ.Партнер.БизнесРегион;
		ЭтаФорма.КомпанияТекст = "";
		ЭтаФорма.НоваяКомпания = Ложь;
		Элементы.Компания.ТолькоПросмотр = Истина;
		Элементы.НоваяКомпания.ТолькоПросмотр = Истина;
		Если ЭтаФорма.ДокументСЦ.КонтактныеЛица.Количество() > 0 Тогда
			ЭтаФорма.КонтактноеЛицо = ЭтаФорма.ДокументСЦ.КонтактныеЛица[0].КонтактноеЛицо;
			ЭтаФорма.КонтактноеЛицоТекст = "";
			ЭтаФорма.НовоеКонтактноеЛицо = Ложь;
			ЭтаФорма.Телефон = ЭтаФорма.ДокументСЦ.КонтактныеЛица[0].ТелефонКонтактногоЛица;
		КонецЕсли;	
		
	Иначе
		
		ЭтаФорма.Компания = Неопределено;
		ЭтаФорма.НоваяКомпания = Ложь;
		Элементы.Компания.ТолькоПросмотр = Ложь;
		Элементы.НоваяКомпания.ТолькоПросмотр = Ложь;
		
		ЭтаФорма.КонтактноеЛицо = Неопределено;
		ЭтаФорма.НовоеКонтактноеЛицо = Ложь;
		Элементы.КонтактноеЛицо.ТолькоПросмотр = Ложь;
		Элементы.НовоеКонтактноеЛицо.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДСПартнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекПартнер = Элемент.ТекущиеДанные.Ссылка;
	ОткрытьФорму("Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая", Новый Структура("Ключ", ТекПартнер));
КонецПроцедуры

&НаКлиенте
Процедура СтатусВзаимодействийОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "СтанутСвободнымиЧерез10Дн", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", , , , Ложь);
	
	Если ВыбранноеЗначение = "ВзаимодействияЗапланированы" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "ВзаимодействияНеЗапланированы" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "ВзаимодействияЗапланированыНеЗакрепленные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "ВзаимодействияНеЗапланированыНеЗакрепленные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "ЗакреплленныеКлиенты" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "НеЗакреплленныеКлиенты" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "СтанутСвободнымиЧерез10Дн" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "СтанутСвободнымиЧерез10Дн", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ВыбранноеЗначение = "АнализироватьВК" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ОбновитьТаблицуПоказателейПартнеры();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ОбновитьТаблицуПоказателейПартнерыСЦ();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ОбновитьТаблицуПоказателейПартнерыРМ();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусВзаимодействийОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияЗапланированы", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "ВзаимодействияНеЗапланированы", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "СтанутСвободнымиЧерез10Дн", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "АнализироватьВК", , , , Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Закреплен", , , , Ложь);
	
	СтатусВзаимодействий = "";
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ОбновитьТаблицуПоказателейПартнеры();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ОбновитьТаблицуПоказателейПартнерыСЦ();
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ОбновитьТаблицуПоказателейПартнерыРМ();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	СпсСостояний = Новый СписокЗначений;
	Если Не Состояние = "Все" Тогда
		Если Состояние = "ВРаботе" Тогда
			СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.ВРаботе"));
			СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Запланировано"));
		ИначеЕсли Состояние = "Завершено" Тогда
			СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Завершено"));
			СпсСостояний.Добавить(ПредопределенноеЗначение("Справочник.CRM_СостоянияСобытий.Отменено"));
		КонецЕсли;	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", СпсСостояний, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеИнтересыПриИзменении(Элемент)
	
	Если Не СостояниеИнтерес = "Все" Тогда
		Если СостояниеИнтерес = "ВРаботе" Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Завершен", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ИначеЕсли СостояниеИнтерес = "Завершен" Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Завершен", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСИнтересы, "Завершен", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейИнтерес();
	
КонецПроцедуры

&НаКлиенте
Процедура ДСКонтактнаяИнформацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДСКонтактнаяИнформацияПредставление" Тогда
		
		ТекущаяСтрокаКИ = Элемент.ТекущиеДанные;
		Контакт = ТекущаяСтрокаКИ.Контакт; 
		
		Если ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда Возврат; КонецЕсли;
			ДанныеЗаполнения	= Новый Структура;
			ДанныеЗаполнения.Вставить("Основание",	Контакт);	
			ДополнительныеПараметры	= Новый Структура;
			ДополнительныеПараметры.Вставить("ДанныеЗаполнения",	ДанныеЗаполнения);
			сфпСофтФонПроКлиент.сфпПозвонить(ТекущаяСтрокаКИ.Представление, Контакт, ДополнительныеПараметры);
		ИначеЕсли ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
			ПараметрыФормы = Новый Структура("Основание",Контакт);
			ПараметрыФормы.Вставить("ДанныеЗаполнения", Контакт);
			СписокАдресов = Новый СписокЗначений;
			СписокАдресов.Добавить(Контакт, ТекущаяСтрокаКИ.Представление);
			ПараметрыФормы.Вставить("Кому", СписокАдресов);
			ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		ИначеЕсли ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница") Тогда
			АдресСайтаКомпании = ТекущаяСтрокаКИ.Представление;
			Если Найти(АдресСайтаКомпании, "://") = 0 Тогда
				АдресСайтаКомпании = "http://" + АдресСайтаКомпании;
			КонецЕсли;	
			ОбщегоНазначенияКлиент.ОткрытьНавигационнуюСсылку(АдресСайтаКомпании);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДСУМеняНаКонтролеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.CRM_Интерес.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Интерес))
КонецПроцедуры

&НаКлиенте
Процедура ПартнерЗадачиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПартнерЗадачи) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Партнер", 
		ПартнерЗадачи, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Партнер", , , , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерЗадачиОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Партнер", , , , Ложь);
	
	ОбновитьТаблицуПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйРекомендацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтветственныйРекомендации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСРекомендации, "Автор", ОтветственныйРекомендации, ВидСравненияКомпоновкиДанных.Равно, , Истина);	
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСРекомендации, "Автор", , , , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступРазделыПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРекомендацию(Команда)
	СоздатьРекомендациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьРекомендациюНаСервере()
	
	ТекстОшибки = "Не заполнены следующие, обязательные реквизиты: " + Символы.пс;
	Отказ = Ложь;
	
	Если ТемаРекомендации = "" Тогда
		ТекстОшибки = ТекстОшибки + "Тема рекомендации" + Символы.пс;
		Отказ = Истина;
	КонецЕсли;
	
	Если ОписаниеРекомендации = "" Тогда
		ТекстОшибки = ТекстОшибки + "Описание рекомендации" + Символы.пс;
		Отказ = Истина;
	КонецЕсли;
	
	Если Квалификация.Пустая()  Тогда
		ТекстОшибки = ТекстОшибки + "Квалификация" + Символы.пс;	    
		Отказ = Истина;
	КонецЕсли;
	
	Если БизнесРегион.Пустая()  Тогда
		ТекстОшибки = ТекстОшибки + "Бизнес-регион" + Символы.пс;	    
		Отказ = Истина;
	КонецЕсли;
	
	Если Телефон = "" Тогда
		ТекстОшибки = ТекстОшибки + "Телефон" + Символы.пс;	    
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) И КонтактноеЛицоТекст = "" Тогда
		ТекстОшибки = ТекстОшибки + "Контактное лицо" + Символы.пс;	    
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		ОбЛид = Документы.смартЛид.СоздатьДокумент();
		ОбЛид.СостояниеЛида = Перечисления.смартСостоянияЛидов.Новый;
		НужныйРегион = НайтиРегионВерхнегоУровня(БизнесРегион);
		ОбЛид.БизнесРегион = НужныйРегион;
		ОбЛид.Квалификация = Квалификация;
		ОбЛид.Дата = ТекущаяДата();
		ОбЛид.БизнесРегионТекст = НужныйРегион;
		ОбЛид.Имя = КонтактноеЛицоТекст;
		ОбЛид.КонтактноеЛицо = КонтактноеЛицо;
		ОбЛид.Партнер = Компания;
		ОбЛид.Тема = ТемаРекомендации;
		ОбЛид.Телефон = Телефон;
		ОбЛид.ТекстИсточника = ОписаниеРекомендации;
		ОбЛид.Распределил = ПараметрыСеанса.ТекущийПользователь;
		ОбЛид.ИсточникПолученияЛида = Справочники.CRM_ИсточникиПолученияЛидов.НайтиПоНаименованию("Рекомендация сотрудника");
		ОбЛид.Записать(РежимЗаписиДокумента.Запись);
		
		Элементы.ГруппаВсплывающаяРекомендации.Скрыть();
		
	Иначе	
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиРегионВерхнегоУровня(Регион)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегионПоиска=Регион;
	
	Пока ЗначениеЗаполнено(РегионПоиска.Родитель) Цикл
		РегионПоиска=НайтиРегионВерхнегоУровня(РегионПоиска.Родитель);
	КонецЦикла;
	
	Возврат РегионПоиска;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗапретЗакрытия Тогда 
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АкцииДопГарантияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.АкцииДопГарантия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда  	
		УстановитьПараметрыСпискаНоменклатуры(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));		
	Иначе 		
		УстановитьПараметрыСпискаНоменклатуры(ТекущиеДанные.Оборудование);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаНоменклатуры(Оборудование)  
	
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Оборудование", Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискПартнерыПриИзменении(Элемент)
	
	ВыполнитьПоискCRM(Истина);
	
	//++ #Б-5658 смарт: Фролов 09.02.2026 //Оптимизация вкладки Партнеры в рабочем столе.
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ТекДанные = Элементы.ДСПартнеры.ТекущиеДанные;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ТекДанные = Элементы.ДСПартнерыСЦ.ТекущиеДанные;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ТекДанные = Элементы.ДСПартнерыРМ.ТекущиеДанные;
		
	КонецЕсли;	
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		СформироватьЗаметкиВзаимодействияПартнера(ТекДанные.Ссылка);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСКонтактнаяИнформация, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСОборудованиеЧернила, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЧернилаОборудование, "Партнер", ТекДанные.Ссылка, Истина);
		CRM_СформироватьСтрокуРезультатаПоиска(ТекДанные.Ссылка);
		ТекПартнер = ТекДанные.Ссылка;
		
	Иначе
		
		ТекПартнер = Неопределено;
		
	КонецЕсли;
	//-- #Б-5658 смарт: Фролов 09.02.2026

КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьПоискCRM(ОповещатьОбОшибках)
	
	ОбрабатыватьАктивизациюПоиска = Истина;
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ТекущСтрокаПоискПартнеры = СтрокаПоискПартнеры;
		ИмяСтрокиПоиска = "СтрокаПоискПартнеры";
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ТекущСтрокаПоискПартнеры = СтрокаПоискПартнерыСЦ;
		ИмяСтрокиПоиска = "СтрокаПоискПартнерыСЦ";
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ТекущСтрокаПоискПартнеры = СтрокаПоискПартнерыРМ;
		ИмяСтрокиПоиска = "СтрокаПоискПартнерыРМ";
		
	КонецЕсли;	
	
	ТекущСтрокаПоискПартнеры = СокрЛП(ТекущСтрокаПоискПартнеры);
	Для Сч = 1 По 3 Цикл
		ИмяПоля = "СтрокаПоискаДоп"+Строка(Сч);
		ЭтотОбъект[ИмяПоля] = СокрЛП(ЭтотОбъект[ИмяПоля]);
	КонецЦикла;
	
	// Проверка возможности поиска.
	Отказ = Ложь;
	ТекстСообщения = НСтр("ru='Минимальная длина строки поиска 3 символа.';en='Minimum length of the search line is 3 characters.'");
	Если ОповещатьОбОшибках И СтрДлина(ТекущСтрокаПоискПартнеры) < 3  И СтрДлина(ТекущСтрокаПоискПартнеры) > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяСтрокиПоиска, , Отказ);
	КонецЕсли;	
	Для Сч = 1 По 3 Цикл
		ИмяПоля = "СтрокаПоискаДоп"+Строка(Сч);
		Если ОповещатьОбОшибках И СтрДлина(ЭтотОбъект[ИмяПоля]) < 3  И СтрДлина(ЭтотОбъект[ИмяПоля]) > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяПоля, , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПоискCRMНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискCRMНаСервере(УсловияПоиска = Неопределено)
	
	CRM_ТаблицаНайденныхСсылок.Очистить();
	CRM_РезультатыПоиска = "";
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ТекущаяСтрокаПоискПартнеры = СтрокаПоискПартнеры;
		ИмяСтрокиПоиска = "СтрокаПоискПартнеры";
		ТекущийДСПартнеры = ДСПартнеры;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ТекущаяСтрокаПоискПартнеры = СтрокаПоискПартнерыСЦ;
		ИмяСтрокиПоиска = "СтрокаПоискПартнерыСЦ";
		ТекущийДСПартнеры = ДСПартнерыСЦ;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ТекущаяСтрокаПоискПартнеры = СтрокаПоискПартнерыРМ;
		ИмяСтрокиПоиска = "СтрокаПоискПартнерыРМ";
		ТекущийДСПартнеры = ДСПартнерыРМ;
		
	КонецЕсли;	
	
	Если УсловияПоиска = Неопределено Тогда
		
		// Анализ строк поиска, формализация условий и заполнение кэша.
		КэшПоиска = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		КэшЗаполнения = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		УсловияПоиска = Новый Массив;
		Если Не ПустаяСтрока(ТекущаяСтрокаПоискПартнеры) Тогда
			СтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(ТекущаяСтрокаПоискПартнеры, КэшПоиска, КэшЗаполнения);
			УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
		КонецЕсли;
		Для Сч = 1 По 3 Цикл
			ТекущаяСтрокаПоиска = ЭтотОбъект["СтрокаПоискаДоп" + Сч];
			Если Не ПустаяСтрока(ТекущаяСтрокаПоиска) Тогда
				СтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(ТекущаяСтрокаПоиска, КэшПоиска, КэшЗаполнения);
				УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Поиск.
	Если ПустаяСтрока(ТекущаяСтрокаПоискПартнеры) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Новый СписокЗначений, 
		ВидСравненияКомпоновкиДанных.ВСписке, , Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы[ИмяСтрокиПоиска].ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		Возврат;
	КонецЕсли;	
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	УстановитьПривилегированныйРежим(Истина);
	РезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоиска, СпособПоиска, Истина, Истина);
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(РезультатПоиска.КодОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Новый СписокЗначений, 
		ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы[ИмяСтрокиПоиска].ЦветФона = Новый Цвет(255, 200, 200);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Партнеры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тмпСсылки
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка В(&Массивссылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактныеЛицаПартнеров.Владелец
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Ссылка В(&Массивссылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	тмпСсылки.Ссылка КАК Ссылка
	|ИЗ
	|	тмпСсылки КАК тмпСсылки";
	Запрос.УстановитьПараметр("Массивссылок", РезультатПоиска.Элементы);
	СписоСсылокДляОтбора = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Ссылка", СписоСсылокДляОтбора, 
	ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Если СписоСсылокДляОтбора.Количество() = 0 Тогда
		Элементы[ИмяСтрокиПоиска].ЦветФона = Новый Цвет(255, 200, 200);
	Иначе
		Элементы[ИмяСтрокиПоиска].ЦветФона = Новый Цвет(255, 255, 255);
	КонецЕсли;
	
	CRM_ТаблицаНайденныхСсылок.Загрузить(РезультатПоиска.ТаблицаРезультатов);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискПартнерыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СпособыПоиска = Новый СписокЗначений;
	СпособыПоиска.Добавить(0, НСтр("ru = 'По началу строки'"));
	СпособыПоиска.Добавить(1, НСтр("ru = 'По части строки'"));
	СпособыПоиска.Добавить(2, НСтр("ru = 'По точному совпадению'"));
	
	НайденныйЭлемент = СпособыПоиска.НайтиПоЗначению(СпособПоиска);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Пометка = Истина;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СтрокаПоискПартнерыНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	ПоказатьВыборИзМеню(ОповещениеЗавершения, СпособыПоиска, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискПартнерыНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособПоиска <> ВыбранныйЭлемент.Значение Тогда
		СпособПоиска = ВыбранныйЭлемент.Значение;
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.СпособПоиска","СправочникПартнеры", СпособПоиска);
		ВыполнитьПоискCRM(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискПартнерыОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Ссылка", , , , Ложь);
	
КонецПроцедуры

&НаСервере
Процедура CRM_СформироватьСтрокуРезультатаПоиска(Партнер)
	CRM_РезультатыПоиска = "";
	СтруктураПоиска = Новый Структура("Партнер", Партнер);
	МассивСтрок = CRM_ТаблицаНайденныхСсылок.НайтиСтроки(СтруктураПоиска);
	CRM_НайденнаяСсылка = Неопределено;
	Если МассивСтрок.Количество() > 0 Тогда
		
		СтрокаНайденного = МассивСтрок[0];
		CRM_НайденнаяСсылка = СтрокаНайденного.Владелец;
		Если ТипЗнч(СтрокаНайденного.Владелец) = Тип("СправочникСсылка.Партнеры") Тогда
			ВидСправочника = "партнера";
		ИначеЕсли ТипЗнч(СтрокаНайденного.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда	
			ВидСправочника = "контрагента";
		ИначеЕсли ТипЗнч(СтрокаНайденного.Владелец) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
			ВидСправочника = "контактного лица";
		КонецЕсли;	
		CRM_РезультатыПоиска = "Найдено в реквизите " + ВидСправочника + " " + СтрокаНайденного.Владелец + " '" + СтрокаНайденного.ПолеПоиска + "': " + СтрокаНайденного.ЗначениеПоиска;// + СтрокаНайденного.Партнер+"/"+СтрокаНайденного.Владелец+"/"+СтрокаНайденного.ВидКонтактнойИнформации+"/"+СтрокаНайденного.ЗначениеПоиска+"/";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура CRM_РезультатыПоискаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(CRM_НайденнаяСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
		Открытьформу("Справочник.Партнеры.ФормаОбъекта", Новый Структура("Ключ", CRM_НайденнаяСсылка));
	ИначеЕсли ТипЗнч(CRM_НайденнаяСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда	
		Открытьформу("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", CRM_НайденнаяСсылка));
	ИначеЕсли ТипЗнч(CRM_НайденнаяСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
		Открытьформу("Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта", Новый Структура("Ключ", CRM_НайденнаяСсылка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПартнерыЗапчастиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтветственныйПартнерыЗапчасти) Тогда
		
		ДСПартнерыСЦ.Отбор.Элементы.Очистить();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыСЦ, "МенеджерСервисЦентра", ОтветственныйПартнерыЗапчасти, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыСЦ, "МенеджерСервисЦентра", , , , Ложь);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БизнесРегионПартнерыСЦ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыСЦ, "БизнесРегион", БизнесРегионПартнерыСЦ, ВидСравненияКомпоновкиДанных.ВИерархии, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыСЦ, "БизнесРегион", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейПартнерыСЦ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПартнерыРасходкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтветственныйПартнерыРасходка) Тогда
		
		ДСПартнерыРМ.Отбор.Элементы.Очистить();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыРМ, "МенеджерПоРасходнымМатериалам", ОтветственныйПартнерыРасходка, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыРМ, "МенеджерПоРасходнымМатериалам", , , , Ложь);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БизнесРегионПартнерыРМ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыРМ, "БизнесРегион", БизнесРегионПартнерыРМ, ВидСравненияКомпоновкиДанных.ВИерархии, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСПартнерыРМ, "БизнесРегион", , , , Ложь);
	КонецЕсли;
	
	ОбновитьТаблицуПоказателейПартнерыРМ();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьМоиЗвонкиНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	сфпИсторияЗвонков.Звонок КАК Звонок,
	|	МИНИМУМ(сфпИсторияЗвонков.ДатаНачала) КАК ДатаНачала,
	|	МИНИМУМ(сфпИсторияЗвонков.ДатаОкончания) КАК ДатаОкончания,
	|	МИНИМУМ(сфпИсторияЗвонков.ДатаОтвета) КАК ДатаОтвета,
	|	МАКСИМУМ(сфпИсторияЗвонков.ВнутреннийНомер) КАК ВнутреннийНомер,
	|	сфпИсторияЗвонков.Входящий КАК Входящий
	|ПОМЕСТИТЬ сфпИсторияЗвонков
	|ИЗ
	|	РегистрСведений.сфпИсторияЗвонков КАК сфпИсторияЗвонков
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НачалоПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|					И &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА сфпИсторияЗвонков.Звонок.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			КОГДА &НачалоПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА сфпИсторияЗвонков.Звонок.Дата >= &НачалоПериода
	|			КОГДА &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА сфпИсторияЗвонков.Звонок.Дата <= &КонецПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И сфпИсторияЗвонков.Звонок.Ответственный = &Ответственный
	|	И сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Отвеченный)
	|	И сфпИсторияЗвонков.Звонок.сфпДлительностьЗвонка >= &ДлительностьЗвонка
	|
	|СГРУППИРОВАТЬ ПО
	|	сфпИсторияЗвонков.Звонок,
	|	сфпИсторияЗвонков.Входящий
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Звонок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(сфпИсторияЗвонков.Звонок.Дата, ДЕНЬ) КАК ДатаЗвонка,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(сфпИсторияЗвонков.Звонок.АбонентКонтакт КАК Справочник.Партнеры) ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|		ИНАЧЕ сфпИсторияЗвонков.Звонок.АбонентКонтакт
	|	КОНЕЦ КАК Партнер,
	|	МИНИМУМ(сфпИсторияЗвонков.Звонок.Ссылка) КАК КоличествоЗвонков
	|ПОМЕСТИТЬ ЗвонкиГрупировкаПоПартнерам
	|ИЗ
	|	сфпИсторияЗвонков КАК сфпИсторияЗвонков
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(сфпИсторияЗвонков.Звонок.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(сфпИсторияЗвонков.Звонок.АбонентКонтакт КАК Справочник.Партнеры) ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|		ИНАЧЕ сфпИсторияЗвонков.Звонок.АбонентКонтакт
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗвонкиГрупировкаПоПартнерам.ДатаЗвонка КАК ДатаЗвонка,
	|	ЗвонкиГрупировкаПоПартнерам.Партнер КАК Партнер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗвонкиГрупировкаПоПартнерам.КоличествоЗвонков) КАК КоличествоЗвонков
	|ПОМЕСТИТЬ ЗвонкиПоДате
	|ИЗ
	|	ЗвонкиГрупировкаПоПартнерам КАК ЗвонкиГрупировкаПоПартнерам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗвонкиГрупировкаПоПартнерам.ДатаЗвонка,
	|	ЗвонкиГрупировкаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпДлительностьЗвонка = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(сфпИсторияЗвонков.Звонок.сфпДлительностьЗвонка / 60, 2)
	|	КОНЕЦ КАК ДлительностьЗвонка,
	|	сфпИсторияЗвонков.Звонок.АбонентКакСвязаться КАК НомерТелефона,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(сфпИсторияЗвонков.Звонок.АбонентКонтакт КАК Справочник.Партнеры) ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|		ИНАЧЕ сфпИсторияЗвонков.Звонок.АбонентКонтакт
	|	КОНЕЦ КАК Организация,
	|	сфпИсторияЗвонков.Звонок.Ответственный КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Пропущенный)
	|				И сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Пропущенный""
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Пропущенный)
	|				И НЕ сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Не дозвонились""
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Отвеченный)
	|				И НЕ сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Дозвонились""
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Отвеченный)
	|				И сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Отвеченный""
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР
	|		КОГДА сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Входящий""
	|		ИНАЧЕ ""Исходящий""
	|	КОНЕЦ КАК ВидЗвонка,
	|	МИНИМУМ(1) КАК Факт,
	|	МАКСИМУМ(сфпИсторияЗвонков.ВнутреннийНомер) КАК ВнутреннийНомер,
	|	сфпИсторияЗвонков.Звонок.Ответственный.Подразделение КАК Подразделение,
	|	НАЧАЛОПЕРИОДА(сфпИсторияЗвонков.Звонок.Дата, ДЕНЬ) КАК День,
	|	сфпИсторияЗвонков.ДатаОкончания КАК ДатаОкончания,
	|	сфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
	|	сфпИсторияЗвонков.Звонок.Дата КАК ЗвонокДата
	|ПОМЕСТИТЬ ВсеГруппир
	|ИЗ
	|	сфпИсторияЗвонков КАК сфпИсторияЗвонков
	|ГДЕ
	|	(&Направление = ""Все""
	|			ИЛИ ВЫБОР
	|				КОГДА сфпИсторияЗвонков.Звонок.Входящий
	|					ТОГДА ""Входящий""
	|				ИНАЧЕ ""Исходящий""
	|			КОНЕЦ = &Направление)
	|
	|СГРУППИРОВАТЬ ПО
	|	сфпИсторияЗвонков.Звонок.АбонентКакСвязаться,
	|	сфпИсторияЗвонков.Звонок.Ответственный,
	|	ВЫБОР
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Пропущенный)
	|				И сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Пропущенный""
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Пропущенный)
	|				И НЕ сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Не дозвонились""
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Отвеченный)
	|				И НЕ сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Дозвонились""
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпСостояниеЗвонка = ЗНАЧЕНИЕ(Перечисление.сфпСостоянияЗвонков.Отвеченный)
	|				И сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Отвеченный""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА сфпИсторияЗвонков.Звонок.Входящий
	|			ТОГДА ""Входящий""
	|		ИНАЧЕ ""Исходящий""
	|	КОНЕЦ,
	|	сфпИсторияЗвонков.Звонок.Ответственный.Подразделение,
	|	ВЫБОР
	|		КОГДА сфпИсторияЗвонков.Звонок.сфпДлительностьЗвонка = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(сфпИсторияЗвонков.Звонок.сфпДлительностьЗвонка / 60, 2)
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(сфпИсторияЗвонков.Звонок.Дата, ДЕНЬ),
	|	сфпИсторияЗвонков.ДатаОкончания,
	|	сфпИсторияЗвонков.ДатаНачала,
	|	сфпИсторияЗвонков.Звонок.Дата,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(сфпИсторияЗвонков.Звонок.АбонентКонтакт КАК Справочник.Партнеры) ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|		ИНАЧЕ сфпИсторияЗвонков.Звонок.АбонентКонтакт
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеГруппир.Организация КАК Организация,
	|	СУММА(ВсеГруппир.ДлительностьЗвонка) КАК ДлительностьЗвонка,
	|	ВсеГруппир.Сотрудник КАК Сотрудник,
	|	СУММА(ВсеГруппир.Факт) КАК Факт,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеГруппир.ВидЗвонка = ""Исходящий""
	|					И ВсеГруппир.Состояние = ""Дозвонились""
	|				ТОГДА ВсеГруппир.ДлительностьЗвонка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИсходящихМинут,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеГруппир.ВидЗвонка = ""Исходящий""
	|					И ВсеГруппир.Состояние = ""Дозвонились""
	|				ТОГДА ВсеГруппир.Факт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИсходящихЗвонков,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеГруппир.ВидЗвонка = ""Входящий""
	|					И ВсеГруппир.Состояние = ""Отвеченный""
	|				ТОГДА ВсеГруппир.ДлительностьЗвонка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВходящихМинут,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеГруппир.ВидЗвонка = ""Входящий""
	|					И ВсеГруппир.Состояние = ""Отвеченный""
	|				ТОГДА ВсеГруппир.Факт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВходящихЗвонков,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеГруппир.Состояние = ""Пропущенный""
	|				ТОГДА ВсеГруппир.Факт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Пропущенный,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеГруппир.Состояние = ""Не дозвонились""
	|				ТОГДА ВсеГруппир.Факт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеДозвонились,
	|	ВсеГруппир.День КАК День,
	|	МАКСИМУМ(ВсеГруппир.ДатаОкончания) КАК ДатаОкончания,
	|	МАКСИМУМ(ВсеГруппир.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ВсеГруппир.ЗвонокДата) КАК ЗвонокДата
	|ПОМЕСТИТЬ ВсеЗвонки
	|ИЗ
	|	ВсеГруппир КАК ВсеГруппир
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеГруппир.Организация,
	|	ВсеГруппир.Сотрудник,
	|	ВсеГруппир.День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(CRM_СообщениеМессенджера.Дата, ДЕНЬ) КАК Дата,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(CRM_СообщениеМессенджера.Контакт) = ТИП(Справочник.КонтактныеЛицаПартнеров)
	|			ТОГДА CRM_СообщениеМессенджера.Контакт.Владелец
	|		ИНАЧЕ CRM_СообщениеМессенджера.Контакт.Ссылка
	|	КОНЕЦ КАК Партнер,
	|	CRM_СообщениеМессенджера.Ответственный КАК Ответственный,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_СообщениеМессенджера.Диалог) КАК Количество
	|ПОМЕСТИТЬ СообщенияВацап
	|ИЗ
	|	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	|ГДЕ
	|	НЕ CRM_СообщениеМессенджера.ПометкаУдаления
	|	И CRM_СообщениеМессенджера.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И CRM_СообщениеМессенджера.Ответственный = &Ответственный
	|	И (ТИПЗНАЧЕНИЯ(CRM_СообщениеМессенджера.Контакт) = ТИП(Справочник.КонтактныеЛицаПартнеров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(CRM_СообщениеМессенджера.Контакт) = ТИП(Справочник.Партнеры))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(CRM_СообщениеМессенджера.Контакт) = ТИП(Справочник.КонтактныеЛицаПартнеров)
	|			ТОГДА CRM_СообщениеМессенджера.Контакт.Владелец
	|		ИНАЧЕ CRM_СообщениеМессенджера.Контакт.Ссылка
	|	КОНЕЦ,
	|	CRM_СообщениеМессенджера.Ответственный,
	|	НАЧАЛОПЕРИОДА(CRM_СообщениеМессенджера.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_Взаимодействие.Партнер КАК Партнер,
	|	НАЧАЛОПЕРИОДА(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия, ДЕНЬ) КАК ДеньВзаимодействия,
	|	МИНИМУМ(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия) КАК ДатаЗавершения
	|ПОМЕСТИТЬ ПервыеВзаимодействия
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|	И НЕ CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
	|	И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И CRM_Взаимодействие.Ответственный = &Ответственный
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_Взаимодействие.Партнер,
	|	НАЧАЛОПЕРИОДА(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_Взаимодействие.Партнер КАК Партнер,
	|	ПервыеВзаимодействия.ДеньВзаимодействия КАК ДатаЗавершения,
	|	CRM_Взаимодействие.Результат КАК Результат,
	|	CRM_Взаимодействие.Ссылка КАК Взаимодействие
	|ПОМЕСТИТЬ ВзаимодействиеТаб
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервыеВзаимодействия КАК ПервыеВзаимодействия
	|		ПО CRM_Взаимодействие.Партнер = ПервыеВзаимодействия.Партнер
	|			И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ПервыеВзаимодействия.ДатаЗавершения
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|	И НЕ CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
	|	И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И CRM_Взаимодействие.Ответственный = &Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_Взаимодействие.Партнер КАК Партнер,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(CRM_Взаимодействие.ПлановаяДата, ДЕНЬ)) КАК ДатаПлановая
	|ПОМЕСТИТЬ ВзаимодействияЗапланированныеТаб
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|	И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
	|	И CRM_Взаимодействие.Ответственный = &Ответственный
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_Взаимодействие.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсеЗвонки.День, 0) = 0
	|			ТОГДА ВзаимодействиеТаб.ДатаЗавершения
	|		ИНАЧЕ ВсеЗвонки.День
	|	КОНЕЦ КАК ДатаЗвонка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимодействиеТаб.Партнер, 0) = 0
	|			ТОГДА ВсеЗвонки.Организация
	|		ИНАЧЕ ВзаимодействиеТаб.Партнер
	|	КОНЕЦ КАК Партнер,
	|	СУММА(ВсеЗвонки.ДлительностьЗвонка) КАК ВсегоМинут,
	|	ВсеЗвонки.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА &БезДублей
	|				ТОГДА ЗвонкиПоДате.КоличествоЗвонков
	|			ИНАЧЕ ВсеЗвонки.Факт
	|		КОНЕЦ) КАК ВсегоЗвонков,
	|	СУММА(ВсеЗвонки.ИсходящихМинут) КАК ИсходящихМинут,
	|	СУММА(ВсеЗвонки.ИсходящихЗвонков) КАК ИсходящихЗвонков,
	|	СУММА(ВсеЗвонки.ВходящихМинут) КАК ВходящихМинут,
	|	СУММА(ВсеЗвонки.ВходящихЗвонков) КАК ВходящихЗвонков,
	|	СУММА(ВсеЗвонки.Пропущенный) КАК Пропущенно,
	|	СУММА(ВсеЗвонки.НеДозвонились) КАК НеДозвонились,
	|	ВзаимодействиеТаб.Взаимодействие КАК Взаимодействие,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВсеЗвонки.ЗвонокДата, 0) = 0
	|				ТОГДА ВзаимодействиеТаб.ДатаЗавершения
	|			ИНАЧЕ ВсеЗвонки.ЗвонокДата
	|		КОНЕЦ) КАК Время,
	|	"""" КАК Растяжка,
	|	СУММА(0) КАК Вацап
	|ПОМЕСТИТЬ ВзаимодИЗвонки
	|ИЗ
	|	ВсеЗвонки КАК ВсеЗвонки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВзаимодействиеТаб КАК ВзаимодействиеТаб
	|		ПО ВсеЗвонки.Организация = ВзаимодействиеТаб.Партнер
	|			И (ВсеЗвонки.День = НАЧАЛОПЕРИОДА(ВзаимодействиеТаб.ДатаЗавершения, ДЕНЬ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗвонкиПоДате КАК ЗвонкиПоДате
	|		ПО ВсеЗвонки.Организация = ЗвонкиПоДате.Партнер
	|			И ВсеЗвонки.День = ЗвонкиПоДате.ДатаЗвонка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЗвонки.Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимодействиеТаб.Партнер, 0) = 0
	|			ТОГДА ВсеЗвонки.Организация
	|		ИНАЧЕ ВзаимодействиеТаб.Партнер
	|	КОНЕЦ,
	|	ВзаимодействиеТаб.Взаимодействие,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсеЗвонки.День, 0) = 0
	|			ТОГДА ВзаимодействиеТаб.ДатаЗавершения
	|		ИНАЧЕ ВсеЗвонки.День
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимодействиеТаб.ДатаЗавершения,
	|	ВзаимодействиеТаб.Партнер,
	|	СУММА(0),
	|	ВзаимодействиеТаб.Взаимодействие.Ответственный,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	ВзаимодействиеТаб.Взаимодействие,
	|	МАКСИМУМ(ВзаимодействиеТаб.ДатаЗавершения),
	|	"""",
	|	СУММА(0)
	|ИЗ
	|	ВзаимодействиеТаб КАК ВзаимодействиеТаб
	|ГДЕ
	|	НЕ (ВзаимодействиеТаб.Партнер, НАЧАЛОПЕРИОДА(ВзаимодействиеТаб.ДатаЗавершения, ДЕНЬ)) В
	|				(ВЫБРАТЬ
	|					ВсеЗвонки.Организация,
	|					ВсеЗвонки.День
	|				ИЗ
	|					ВсеЗвонки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаимодействиеТаб.ДатаЗавершения,
	|	ВзаимодействиеТаб.Партнер,
	|	ВзаимодействиеТаб.Взаимодействие.Ответственный,
	|	ВзаимодействиеТаб.Взаимодействие
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СообщенияВацап.Дата,
	|	СообщенияВацап.Партнер,
	|	СУММА(0),
	|	СообщенияВацап.Ответственный,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	ВзаимодействиеТаб.Взаимодействие,
	|	МАКСИМУМ(СообщенияВацап.Дата),
	|	"""",
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияВацап.Количество)
	|ИЗ
	|	СообщенияВацап КАК СообщенияВацап
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимодействиеТаб КАК ВзаимодействиеТаб
	|		ПО СообщенияВацап.Партнер = ВзаимодействиеТаб.Партнер
	|			И (СообщенияВацап.Дата = НАЧАЛОПЕРИОДА(ВзаимодействиеТаб.ДатаЗавершения, ДЕНЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	СообщенияВацап.Дата,
	|	СообщенияВацап.Партнер,
	|	СообщенияВацап.Ответственный,
	|	ВзаимодействиеТаб.Взаимодействие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимодИЗвонки.ДатаЗвонка КАК ДатаЗвонка,
	|	ВзаимодИЗвонки.Партнер КАК Партнер,
	|	СУММА(ВзаимодИЗвонки.ВсегоМинут) КАК ВсегоМинут,
	|	ВзаимодИЗвонки.Сотрудник КАК Сотрудник,
	|	СУММА(ВзаимодИЗвонки.ВсегоЗвонков) КАК ВсегоЗвонков,
	|	СУММА(ВзаимодИЗвонки.ИсходящихМинут) КАК ИсходящихМинут,
	|	СУММА(ВзаимодИЗвонки.ИсходящихЗвонков) КАК ИсходящихЗвонков,
	|	СУММА(ВзаимодИЗвонки.ВходящихМинут) КАК ВходящихМинут,
	|	СУММА(ВзаимодИЗвонки.ВходящихЗвонков) КАК ВходящихЗвонков,
	|	СУММА(ВзаимодИЗвонки.Пропущенно) КАК Пропущенно,
	|	СУММА(ВзаимодИЗвонки.НеДозвонились) КАК НеДозвонились,
	|	ВзаимодИЗвонки.Взаимодействие КАК Взаимодействие,
	|	ВзаимодИЗвонки.Время КАК Время,
	|	ВзаимодИЗвонки.Растяжка КАК Растяжка,
	|	СУММА(ВзаимодИЗвонки.Вацап) КАК Вацап
	|ПОМЕСТИТЬ ПредварительныеИтоги
	|ИЗ
	|	ВзаимодИЗвонки КАК ВзаимодИЗвонки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаимодИЗвонки.ДатаЗвонка,
	|	ВзаимодИЗвонки.Партнер,
	|	ВзаимодИЗвонки.Сотрудник,
	|	ВзаимодИЗвонки.Взаимодействие,
	|	ВзаимодИЗвонки.Время,
	|	ВзаимодИЗвонки.Растяжка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныеИтоги.ДатаЗвонка КАК ДатаЗвонка,
	|	ПредварительныеИтоги.Партнер КАК Партнер,
	|	ПредварительныеИтоги.ВсегоМинут КАК ВсегоМинут,
	|	ПредварительныеИтоги.Сотрудник КАК Сотрудник,
	|	ПредварительныеИтоги.ВсегоЗвонков КАК ВсегоЗвонков,
	|	ПредварительныеИтоги.ИсходящихМинут КАК ИсходящихМинут,
	|	ПредварительныеИтоги.ИсходящихЗвонков КАК ИсходящихЗвонков,
	|	ПредварительныеИтоги.ВходящихМинут КАК ВходящихМинут,
	|	ПредварительныеИтоги.ВходящихЗвонков КАК ВходящихЗвонков,
	|	ПредварительныеИтоги.Пропущенно КАК Пропущенно,
	|	ПредварительныеИтоги.НеДозвонились КАК НеДозвонились,
	|	ПредварительныеИтоги.Взаимодействие КАК Взаимодействие,
	|	ПредварительныеИтоги.Время КАК Время,
	|	ПредварительныеИтоги.Растяжка КАК Растяжка,
	|	смартСостояниеПартнеров.Статус КАК Статус,
	|	МИНИМУМ(ВзаимодействияЗапланированныеТаб.ДатаПлановая) КАК Запланировано,
	|	ВЫРАЗИТЬ(ПредварительныеИтоги.Взаимодействие.Результат КАК СТРОКА(300)) КАК Результат,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныеИтоги.Взаимодействие, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РезультатНет,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныеИтоги.Взаимодействие, 0) <> 0
	|				И (ЕСТЬNULL(ПредварительныеИтоги.ВсегоМинут, 0) <> 0
	|					ИЛИ ЕСТЬNULL(ПредварительныеИтоги.Вацап, 0) <> 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РезультатЕсть,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныеИтоги.ВсегоМинут, 0) = 0
	|				И ЕСТЬNULL(ПредварительныеИтоги.Вацап, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БезЗвонка,
	|	ВЫБОР
	|		КОГДА ВзаимодействияЗапланированныеТаб.ДатаПлановая <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(&ТекДата, ВзаимодействияЗапланированныеТаб.ДатаПлановая, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗапланированоДней,
	|	ПредварительныеИтоги.Вацап КАК Вацап
	|ИЗ
	|	ПредварительныеИтоги КАК ПредварительныеИтоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВзаимодействияЗапланированныеТаб КАК ВзаимодействияЗапланированныеТаб
	|			ПО (ВзаимодействияЗапланированныеТаб.Партнер = смартСостояниеПартнеров.Партнер)
	|		ПО ПредварительныеИтоги.Партнер = смартСостояниеПартнеров.Партнер
	|ГДЕ
	|	ПредварительныеИтоги.Сотрудник = &Ответственный
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныеИтоги.Взаимодействие,
	|	ПредварительныеИтоги.Партнер,
	|	смартСостояниеПартнеров.Статус,
	|	ПредварительныеИтоги.ДатаЗвонка,
	|	ПредварительныеИтоги.Сотрудник,
	|	ПредварительныеИтоги.Растяжка,
	|	ПредварительныеИтоги.Время,
	|	ПредварительныеИтоги.ВсегоМинут,
	|	ПредварительныеИтоги.ВсегоЗвонков,
	|	ПредварительныеИтоги.ИсходящихМинут,
	|	ПредварительныеИтоги.ИсходящихЗвонков,
	|	ПредварительныеИтоги.ВходящихМинут,
	|	ПредварительныеИтоги.ВходящихЗвонков,
	|	ПредварительныеИтоги.Пропущенно,
	|	ПредварительныеИтоги.НеДозвонились,
	|	ВЫРАЗИТЬ(ПредварительныеИтоги.Взаимодействие.Результат КАК СТРОКА(300)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныеИтоги.Взаимодействие, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаимодействияЗапланированныеТаб.ДатаПлановая <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(&ТекДата, ВзаимодействияЗапланированныеТаб.ДатаПлановая, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныеИтоги.ВсегоМинут, 0) = 0
	|				И ЕСТЬNULL(ПредварительныеИтоги.Вацап, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныеИтоги.Взаимодействие, 0) <> 0
	|				И (ЕСТЬNULL(ПредварительныеИтоги.ВсегоМинут, 0) <> 0
	|					ИЛИ ЕСТЬNULL(ПредварительныеИтоги.Вацап, 0) <> 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ПредварительныеИтоги.Вацап
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗвонка,
	|	Время
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Партнер),
	|	СУММА(ВсегоМинут),
	|	СУММА(ВсегоЗвонков),
	|	СУММА(ИсходящихМинут),
	|	СУММА(ИсходящихЗвонков),
	|	СУММА(ВходящихМинут),
	|	СУММА(ВходящихЗвонков),
	|	СУММА(РезультатНет),
	|	СУММА(РезультатЕсть),
	|	СУММА(БезЗвонка),
	|	СУММА(Вацап)
	|ПО
	|	ОБЩИЕ,
	|	ДатаЗвонка");
	
	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Направление", "Все");
	Запрос.УстановитьПараметр("Ответственный", Исполнитель);
	Запрос.УстановитьПараметр("ДлительностьЗвонка", 30);
	Запрос.УстановитьПараметр("ПартнерЗвонки", ПартнерЗвонки);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("БезДублей", БезДублей);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	КоллекцияЭлементовДерева = ДЗМоиЗвонки.ПолучитьЭлементы();
	КоллекцияЭлементовДерева.Очистить();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, РезультатЗапроса);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМоиЗвонки(Команда)
	ПоказатьМоиЗвонкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьЭтапыОбработкиИнтересовНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	CRM_Интерес.Партнер КАК Партнер,
	|	ТелефонныйЗвонок.Ссылка КАК Звонок,
	|	CRM_Интерес.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТелефонныйЗвонок.сфпДлительностьЗвонка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(ТелефонныйЗвонок.сфпДлительностьЗвонка / 60, 2)
	|	КОНЕЦ КАК ДлительностьЗвонка,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка КАК ЗвонокВСек,
	|	МИНИМУМ(CRM_СостоянияВоронкиПродаж.ДатаНачала) КАК ДатаНачала,
	|	CRM_Интерес.Ответственный.Подразделение КАК Подразделение,
	|	МИНИМУМ(CRM_СостоянияВоронкиПродажТек.ДатаНачала) КАК ДатаНачалаТекЭтап,
	|	ТелефонныйЗвонок.Дата КАК ЗвонокДата,
	|	ВЫБОР
	|		КОГДА CRM_Интерес.смартИтоговаяКвалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка)
	|			ТОГДА CRM_Интерес.смартПредварительнаяКвалификация
	|		ИНАЧЕ CRM_Интерес.смартИтоговаяКвалификация
	|	КОНЕЦ КАК Квалификация
	|ПОМЕСТИТЬ ИнтересыЗвонки
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|		ПО CRM_Интерес.Партнер = ТелефонныйЗвонок.АбонентКонтакт
	|			И CRM_Интерес.Ответственный = ТелефонныйЗвонок.Ответственный
	|			И (НАЧАЛОПЕРИОДА(ТелефонныйЗвонок.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(CRM_Интерес.Дата, ДЕНЬ))
	|			И (ТелефонныйЗвонок.сфпДлительностьЗвонка <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
	|		ПО CRM_Интерес.Ссылка = CRM_СостоянияВоронкиПродаж.Объект
	|			И (CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания > 8)
	|			И (CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродажТек
	|		ПО CRM_Интерес.Ссылка = CRM_СостоянияВоронкиПродажТек.Объект
	|			И CRM_Интерес.СостояниеИнтереса = CRM_СостоянияВоронкиПродажТек.Этап
	|			И (CRM_СостоянияВоронкиПродажТек.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	НЕ CRM_Интерес.Завершен
	|	И CRM_Интерес.СостояниеИнтереса.Родитель = &Воронка
	|	И CRM_Интерес.Ответственный = &Ответственный
	|	И НЕ CRM_Интерес.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_Интерес.Ссылка,
	|	ТелефонныйЗвонок.Ссылка,
	|	CRM_Интерес.СостояниеИнтереса,
	|	CRM_Интерес.Партнер,
	|	CRM_Интерес.Ответственный,
	|	CRM_Интерес.Ответственный.Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТелефонныйЗвонок.сфпДлительностьЗвонка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(ТелефонныйЗвонок.сфпДлительностьЗвонка / 60, 2)
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	ТелефонныйЗвонок.Дата,
	|	ВЫБОР
	|		КОГДА CRM_Интерес.смартИтоговаяКвалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка)
	|			ТОГДА CRM_Интерес.смартПредварительнаяКвалификация
	|		ИНАЧЕ CRM_Интерес.смартИтоговаяКвалификация
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнтересыЗвонки.Ссылка КАК Ссылка,
	|	ИнтересыЗвонки.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ИнтересыЗвонки.Партнер КАК Партнер,
	|	ИнтересыЗвонки.Ответственный КАК Ответственный,
	|	1 КАК Звонок,
	|	CRM_СостоянияВоронкиПродаж.Этап КАК Этап,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(ИнтересыЗвонки.ДлительностьЗвонка / 60, 2)
	|	КОНЕЦ КАК ДлительностьЗвонка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) = 0
	|			ТОГДА ""0 - Нет звонка""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|					ТОГДА ""1 - Квалификация""
	|				КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|						И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|					ТОГДА ""2 - Согласование КП""
	|				КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания = 14
	|					ТОГДА ""3 - Оплата счета""
	|				ИНАЧЕ ""3 - Оплата счета""
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле1,
	|	CRM_ЖурналДокументов.Объект КАК ЗаказКлиента,
	|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
	|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки,
	|	СостоянияЗаказовКлиентов.ПроцентДолга КАК ПроцентДолга,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НетЗвонка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|						ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КвалификацияМинуты,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КвалификацияЗвонки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|							И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|						ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СогласованиеМинуты,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|							И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СогласованиеЗвонки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания = 14
	|						ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОплатаСчетаМинуты,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания = 14
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОплатаСчетаЗвонки,
	|	ИнтересыЗвонки.ДатаНачала КАК ДатаНачала,
	|	ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.ДатаНачала, ДЕНЬ, 5) КАК ДатаНачала5Дней,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.ДатаНачала И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.ДатаНачала, ДЕНЬ, 5)
	|						ТОГДА ВЫБОР
	|								КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|										И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|									ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СогласованиеМинутыВовремя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.ДатаНачала И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.ДатаНачала, ДЕНЬ, 5)
	|						ТОГДА ВЫБОР
	|								КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|										И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|									ТОГДА 1
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СогласованиеЗвонкиВовремя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.ДатаНачала И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.ДатаНачала, ДЕНЬ, 5)
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|									И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|								ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СогласованиеМинутыНеВовремя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.ДатаНачала И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.ДатаНачала, ДЕНЬ, 5)
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания >= 9
	|									И CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 13
	|								ТОГДА 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СогласованиеЗвонкиНеВовремя,
	|	ИнтересыЗвонки.Подразделение КАК Подразделение,
	|	ИнтересыЗвонки.ЗвонокВСек КАК ЗвонокВСек,
	|	ИнтересыЗвонки.ДатаНачалаТекЭтап КАК ДатаНачалаТекЭтап,
	|	ИнтересыЗвонки.ЗвонокДата КАК ЗвонокДата,
	|	ЗапланированныеАтивности.ПланируемаяДата КАК ЗапланированноеВзаимодействие,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.Ссылка.Дата И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.Ссылка.Дата, ДЕНЬ, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|									ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КвалификацияМинутыВовремя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.Ссылка.Дата И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.Ссылка.Дата, ДЕНЬ, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|									ТОГДА 1
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КвалификацияЗвонкиВовремя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.Ссылка.Дата И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.Ссылка.Дата, ДЕНЬ, 1)
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|								ТОГДА ИнтересыЗвонки.ДлительностьЗвонка
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КвалификацияМинутыНеВовремя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнтересыЗвонки.ДлительностьЗвонка, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ИнтересыЗвонки.Звонок.Дата МЕЖДУ ИнтересыЗвонки.Ссылка.Дата И ДОБАВИТЬКДАТЕ(ИнтересыЗвонки.Ссылка.Дата, ДЕНЬ, 1)
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА CRM_СостоянияВоронкиПродаж.Этап.РеквизитДопУпорядочивания <= 8
	|								ТОГДА 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КвалификацияЗвонкиНеВовремя,
	|	ИнтересыЗвонки.Квалификация КАК Квалификация
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ИнтересыЗвонки КАК ИнтересыЗвонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
	|		ПО ИнтересыЗвонки.Ссылка = CRM_СостоянияВоронкиПродаж.Объект
	|			И (ВЫБОР
	|				КОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИнтересыЗвонки.Звонок.Дата >= CRM_СостоянияВоронкиПродаж.ДатаНачала
	|				ИНАЧЕ ИнтересыЗвонки.Звонок.Дата МЕЖДУ CRM_СостоянияВоронкиПродаж.ДатаНачала И CRM_СостоянияВоронкиПродаж.ДатаЗавершения
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|			ПО CRM_ЖурналДокументов.Объект = СостоянияЗаказовКлиентов.Заказ
	|		ПО ИнтересыЗвонки.Ссылка = CRM_ЖурналДокументов.CRM_Интерес
	|			И (CRM_ЖурналДокументов.ГлавнаяЗапись)
	|			И (CRM_ЖурналДокументов.Объект ССЫЛКА Документ.ЗаказКлиента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			CRM_ЗапланированныеАктивности.Объект КАК Объект,
	|			МАКСИМУМ(CRM_ЗапланированныеАктивности.ПланируемаяДата) КАК ПланируемаяДата
	|		ИЗ
	|			РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	|		ГДЕ
	|			CRM_ЗапланированныеАктивности.ТипАктивности = ЗНАЧЕНИЕ(перечисление.CRM_ТипыАктивности.Взаимодействие)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			CRM_ЗапланированныеАктивности.Объект) КАК ЗапланированныеАтивности
	|		ПО ИнтересыЗвонки.Ссылка = ЗапланированныеАтивности.Объект
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Квалификация = ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИнтересыЗвонки.Квалификация = &Квалификация
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Ссылка КАК Интерес,
	|	ВременнаяТаблица.Партнер КАК Партнер,
	|	ВременнаяТаблица.Ответственный КАК Ответственный,
	|	СУММА(ВременнаяТаблица.Звонок) КАК Звонок,
	|	СУММА(ВременнаяТаблица.ДлительностьЗвонка) КАК ДлительностьЗвонка,
	|	ВременнаяТаблица.ЗаказКлиента КАК ЗаказКлиента,
	|	ВременнаяТаблица.ПроцентОплаты КАК ПроцентОплаты,
	|	ВременнаяТаблица.ПроцентОтгрузки КАК ПроцентОтгрузки,
	|	ВременнаяТаблица.ПроцентДолга КАК ПроцентДолга,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблица.Ссылка.Дата, МЕСЯЦ) КАК Месяц,
	|	СУММА(ВременнаяТаблица.НетЗвонка) КАК НетЗвонка,
	|	СУММА(ВременнаяТаблица.КвалификацияМинуты) КАК КвалификацияМинуты,
	|	СУММА(ВременнаяТаблица.КвалификацияЗвонки) КАК КвалификацияЗвонки,
	|	СУММА(ВременнаяТаблица.СогласованиеМинуты) КАК СогласованиеМинуты,
	|	СУММА(ВременнаяТаблица.СогласованиеЗвонки) КАК СогласованиеЗвонки,
	|	СУММА(ВременнаяТаблица.ОплатаСчетаМинуты) КАК ОплатаСчетаМинуты,
	|	СУММА(ВременнаяТаблица.ОплатаСчетаЗвонки) КАК ОплатаСчетаЗвонки,
	|	ВременнаяТаблица.СостояниеИнтереса КАК Этап,
	|	МИНИМУМ(ВременнаяТаблица.ДатаНачала) КАК ДатаНачала,
	|	СУММА(ВременнаяТаблица.СогласованиеМинутыВовремя) КАК СогласованиеМинутыВовремя,
	|	СУММА(ВременнаяТаблица.СогласованиеЗвонкиВовремя) КАК СогласованиеЗвонкиВовремя,
	|	СУММА(ВременнаяТаблица.СогласованиеМинутыНеВовремя) КАК СогласованиеМинутыНеВовремя,
	|	СУММА(ВременнаяТаблица.СогласованиеЗвонкиНеВовремя) КАК СогласованиеЗвонкиНеВовремя,
	|	ВременнаяТаблица.Подразделение КАК Подразделение,
	|	РАЗНОСТЬДАТ(ВременнаяТаблица.Ссылка.Дата, &ТекДата, ДЕНЬ) КАК ДнейОтСоздания,
	|	РАЗНОСТЬДАТ(ВременнаяТаблица.ДатаНачалаТекЭтап, &ТекДата, ДЕНЬ) КАК ДнейНаЭтапе,
	|	МАКСИМУМ(ВременнаяТаблица.ЗвонокДата) КАК ПоследнееВзаимодействие,
	|	ВременнаяТаблица.ЗапланированноеВзаимодействие КАК ЗапланированноеВзаимодействие,
	|	СУММА(ВременнаяТаблица.КвалификацияМинутыВовремя) КАК КвалификацияМинутыВовремя,
	|	СУММА(ВременнаяТаблица.КвалификацияЗвонкиВовремя) КАК КвалификацияЗвонкиВовремя,
	|	СУММА(ВременнаяТаблица.КвалификацияМинутыНеВовремя) КАК КвалификацияМинутыНеВовремя,
	|	СУММА(ВременнаяТаблица.КвалификацияЗвонкиНеВовремя) КАК КвалификацияЗвонкиНеВовремя,
	|	МАКСИМУМ(РАЗНОСТЬДАТ(ВременнаяТаблица.ЗвонокДата, &ТекДата, ДЕНЬ)) КАК ДнейСПоследнегоВзаимодействия,
	|	РАЗНОСТЬДАТ(&ТекДата, ВременнаяТаблица.ЗапланированноеВзаимодействие, ДЕНЬ) КАК ДнейДоВзаимодействия,
	|	ВременнаяТаблица.СостояниеИнтереса.РеквизитДопУпорядочивания КАК ПорядокЭтапа,
	|	ВременнаяТаблица.Ссылка.Дата КАК ДатаИнтереса,
	|	ВременнаяТаблица.ДатаНачалаТекЭтап КАК ДатаНачалаТекЭтап,
	|	ВременнаяТаблица.Ссылка.Избранный КАК Избранный,
	|	ВременнаяТаблица.Квалификация КАК Квалификация
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Ссылка,
	|	ВременнаяТаблица.СостояниеИнтереса,
	|	ВременнаяТаблица.Партнер,
	|	ВременнаяТаблица.Ответственный,
	|	ВременнаяТаблица.ЗаказКлиента,
	|	ВременнаяТаблица.ПроцентОплаты,
	|	ВременнаяТаблица.ПроцентОтгрузки,
	|	ВременнаяТаблица.ПроцентДолга,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблица.Ссылка.Дата, МЕСЯЦ),
	|	ВременнаяТаблица.Подразделение,
	|	РАЗНОСТЬДАТ(ВременнаяТаблица.Ссылка.Дата, &ТекДата, ДЕНЬ),
	|	РАЗНОСТЬДАТ(ВременнаяТаблица.ДатаНачалаТекЭтап, &ТекДата, ДЕНЬ),
	|	ВременнаяТаблица.ЗапланированноеВзаимодействие,
	|	ВременнаяТаблица.СостояниеИнтереса.РеквизитДопУпорядочивания,
	|	ВременнаяТаблица.Ссылка.Дата,
	|	ВременнаяТаблица.ДатаНачалаТекЭтап,
	|	ВременнаяТаблица.Ссылка.Избранный,
	|	ВременнаяТаблица.Квалификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДнейНаЭтапе УБЫВ";
	
	Запрос.УстановитьПараметр("Ответственный", Исполнитель);
	Запрос.УстановитьПараметр("Квалификация", КвалификацияИнтересВОбработке);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Воронка", Справочники.CRM_СостоянияИнтересов.НайтиПоНаименованию("Продажа Оборудования, Материалов, ЗЧ"));
	
	ТЗЭтапыОбработкиИнтересов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЕстьЗамечания = 0;
	ВПроцессеКвалификации = 0;
	НеКвалифицированБолее1Дня = 0;
	НеКвалифицированБолее5Дней = 0;
	НеОтправленоКПБолее1Дня = 0;
	ВПроцессеСогласованияКП = 0;
	КПОтправленоБолее1Дня = 0;
	КПОтправленоБолее5Дней = 0;
	КПСогласованоБолее3Дней = 0;
	ВПроцессеОплаты = 0;
	СчетОтправленБолее5Дней = 0;
	БезЗапланированныхВзаимодействий = 0;
	ПоследнийКонтактБолее10Дней = 0;
	
	Для Каждого СтрТЗЭтапыОбработкиИнтересов Из ТЗЭтапыОбработкиИнтересов Цикл
		
		Если СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа <= 4 Тогда
			
			ВПроцессеКвалификации = ВПроцессеКвалификации +1;
			СтрТЗЭтапыОбработкиИнтересов.ВПроцессеКвалификации = Истина;
			
			Если НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаИнтереса) + 86400 * 5 < НачалоДня(ТекущаяДата()) Тогда
				
				НеКвалифицированБолее5Дней = НеКвалифицированБолее5Дней + 1;
				СтрТЗЭтапыОбработкиИнтересов.НеКвалифицированБолее5Дней = Истина;
				
				СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
				
			КонецЕсли; 
			
			Если НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаИнтереса) + 86400 < НачалоДня(ТекущаяДата()) Тогда 
				
				НеКвалифицированБолее1Дня = НеКвалифицированБолее1Дня + 1;
				СтрТЗЭтапыОбработкиИнтересов.НеКвалифицированБолее1Дня = Истина;
				СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа = 8 
			И НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаНачалаТекЭтап) + 86400 < НачалоДня(ТекущаяДата()) Тогда
			
			НеОтправленоКПБолее1Дня = НеОтправленоКПБолее1Дня + 1;
			СтрТЗЭтапыОбработкиИнтересов.НеОтправленоКПБолее1Дня = Истина;
			СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
			
		КонецЕсли; 
		
		Если СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа >= 10 И СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа <= 12 Тогда
			
			ВПроцессеСогласованияКП = ВПроцессеСогласованияКП +1;
			СтрТЗЭтапыОбработкиИнтересов.ВПроцессеСогласованияКП = Истина;
			
			Если НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаНачалаТекЭтап) + 86400 * 5 < НачалоДня(ТекущаяДата()) Тогда
				
				КПОтправленоБолее5Дней = КПОтправленоБолее5Дней + 1;
				СтрТЗЭтапыОбработкиИнтересов.КПОтправленоБолее5Дней = Истина;
				СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
				
			КонецЕсли; 
			
			Если НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаНачалаТекЭтап) + 86400 < НачалоДня(ТекущаяДата()) Тогда 
				
				КПОтправленоБолее1Дня = КПОтправленоБолее1Дня + 1;
				СтрТЗЭтапыОбработкиИнтересов.КПОтправленоБолее1Дня = Истина;
				СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа = 13 
			И НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаНачалаТекЭтап) + 86400 * 3 < НачалоДня(ТекущаяДата()) Тогда
			
			КПСогласованоБолее3Дней = КПСогласованоБолее3Дней + 1;
			СтрТЗЭтапыОбработкиИнтересов.КПСогласованоБолее3Дней = Истина;
			СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
			
		КонецЕсли;
		
		Если СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа >= 14 
			И СтрТЗЭтапыОбработкиИнтересов.ПроцентОплаты < 100 Тогда
			
			ВПроцессеОплаты = ВПроцессеОплаты + 1;
			СтрТЗЭтапыОбработкиИнтересов.ВПроцессеОплаты = Истина;
			
		КонецЕсли;
		
		Если СтрТЗЭтапыОбработкиИнтересов.ПорядокЭтапа = 14
			И НачалоДня(СтрТЗЭтапыОбработкиИнтересов.ДатаНачалаТекЭтап) + 86400 * 5 < НачалоДня(ТекущаяДата())
			И СтрТЗЭтапыОбработкиИнтересов.ПроцентОплаты < 100 Тогда
			
			СчетОтправленБолее5Дней = СчетОтправленБолее5Дней + 1;
			СтрТЗЭтапыОбработкиИнтересов.СчетОтправленБолее5Дней = Истина;
			СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания = Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрТЗЭтапыОбработкиИнтересов.ЗапланированноеВзаимодействие) Тогда
			
			БезЗапланированныхВзаимодействий = БезЗапланированныхВзаимодействий + 1;
			СтрТЗЭтапыОбработкиИнтересов.БезЗапланированныхВзаимодействий = Истина;
			
		КонецЕсли;
		
		Если СтрТЗЭтапыОбработкиИнтересов.ДнейСПоследнегоВзаимодействия > 10 Тогда
			
			ПоследнийКонтактБолее10Дней = ПоследнийКонтактБолее10Дней + 1;
			СтрТЗЭтапыОбработкиИнтересов.ПоследнийКонтактБолее10Дней = Истина;
			
		КонецЕсли;
		
		Если СтрТЗЭтапыОбработкиИнтересов.ЕстьЗамечания Тогда
			
			ЕстьЗамечания = ЕстьЗамечания + 1;
			
		КонецЕсли; 
		
	КонецЦикла;	
	ТаблицаЧастное.Очистить();
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "ИНТЕРЕСЫ В ОБРАБОТКЕ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " ";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "ВСЕГО НЕ ЗАВЕРШЕННЫХ";
	СтрТаблицаПоказателей.КоличествоВсего = ТЗЭтапыОбработкиИнтересов.Количество();
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "БЕЗ ЗАМЕЧАНИЙ";
	СтрТаблицаПоказателей.КоличествоВсего = ТЗЭтапыОбработкиИнтересов.Количество() - ЕстьЗамечания;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "С ЗАМЕЧАНИЯМИ";
	СтрТаблицаПоказателей.КоличествоВсего = ЕстьЗамечания;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "В ПРОЦЕССЕ КВАЛИФИКАЦИИ";
	СтрТаблицаПоказателей.КоличествоВсего = ВПроцессеКвалификации;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Не квалифицирован более 1 дня";
	СтрТаблицаПоказателей.КоличествоВсего = НеКвалифицированБолее1Дня;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Не квалифицирован более 5 дней";
	СтрТаблицаПоказателей.КоличествоВсего = НеКвалифицированБолее5Дней;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Не отправлено КП более 1 дня";
	СтрТаблицаПоказателей.КоличествоВсего = НеОтправленоКПБолее1Дня;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "В процессе согласования КП";
	СтрТаблицаПоказателей.КоличествоВсего = ВПроцессеСогласованияКП;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "КП отправлено более 1 дня";
	СтрТаблицаПоказателей.КоличествоВсего = КПОтправленоБолее1Дня;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "КП отправлено более 5 дней";
	СтрТаблицаПоказателей.КоличествоВсего = КПОтправленоБолее5Дней;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	//СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	//СтрТаблицаПоказателей.Показатель = " ";
	//СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "КП согласовано более 3 дней";
	СтрТаблицаПоказателей.КоличествоВсего = КПСогласованоБолее3Дней;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "В процессе оплаты";
	СтрТаблицаПоказателей.КоличествоВсего = ВПроцессеОплаты;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Счет  отправлен более 5 дней";
	СтрТаблицаПоказателей.КоличествоВсего = СчетОтправленБолее5Дней;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = " ";
	СтрТаблицаПоказателей.ВидСтроки = 2;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Без запланированных взаимодействий";
	СтрТаблицаПоказателей.КоличествоВсего = БезЗапланированныхВзаимодействий;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
	СтрТаблицаПоказателей = ТаблицаЧастное.Добавить();
	СтрТаблицаПоказателей.Показатель = "Последний контакт более 10 дней";
	СтрТаблицаПоказателей.КоличествоВсего = ПоследнийКонтактБолее10Дней;
	СтрТаблицаПоказателей.ВидСтроки = 3;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЭтапыОбработкиИнтересов(Команда)
	ПоказатьЭтапыОбработкиИнтересовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтрок(Команда)
	
	Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура("ДнейОтСоздания", 37);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьОтбор(Команда)
	
	Элементы.ТЗЭтапыОбработкиИнтересов.отборСтрок = Новый ФиксированнаяСтруктура();		
	ТЗЭтапыОбработкиИнтересов.Сортировать("ТЗЭтапыОбработкиИнтересовДнейОтСоздания, Убыв");
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомпактноТЗПоЭтапамПриИзменении(Элемент)
	
	Элементы.ТЗЭтапыОбработкиИнтересовПодразделение.Видимость = не КомпактноТЗПоЭтапам;
	Элементы.ТЗЭтапыОбработкиИнтересовОтветственный.Видимость = не КомпактноТЗПоЭтапам;
	
КонецПроцедуры

&НаКлиенте
Процедура Группа42ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ИнтересыВОбработке Тогда 
		Если не Ответственный.Пустая() Тогда
			ПоказатьЭтапыОбработкиИнтересовНаСервере(); 
		Иначе   
			ТаблицаЧастное.Очистить();
		КонецЕсли;
		ТекущаяСтраницаИнтересы = "ИнтересыВОбработке";
	Иначе 
		ОбновитьТаблицуПоказателейИнтерес();
		ТекущаяСтраницаИнтересы = "ИнтересыСписком";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата()); 
КонецПроцедуры

&НаКлиенте
Процедура Вчера(Команда)
	НачалоПериода = НачалоДня(ТекущаяДата()-86400);
	КонецПериода = КонецДня(ТекущаяДата()-86400); 
КонецПроцедуры

&НаСервере
Процедура ПоказатьЗакрепленныеПартнерыНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартКвалификацииМенеджеровПользователи.Ссылка КАК Пользователь
	|ПОМЕСТИТЬ ПользователиКвалификаций
	|ИЗ
	|	Справочник.Пользователи КАК смартКвалификацииМенеджеровПользователи
	|ГДЕ
	|	смартКвалификацииМенеджеровПользователи.Ссылка = &Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер КАК Партнер,
	|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер КАК Менеджер,
	|	смартИсторияЗакрепленияПартнеровСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ ЗакрепленныеКлиенты
	|ИЗ
	|	РегистрСведений.смартИсторияЗакрепленияПартнеров.СрезПоследних КАК смартИсторияЗакрепленияПартнеровСрезПоследних
	|ГДЕ
	|	НЕ смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТелефонныйЗвонок.Ссылка КАК Звонок,
	|	ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер КАК Менеджер,
	|	ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТелефонныйЗвонок.сфпДлительностьЗвонка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ТелефонныйЗвонок.сфпДлительностьЗвонка / 60
	|	КОНЕЦ КАК ДлительностьЗвонка,
	|	НАЧАЛОПЕРИОДА(ТелефонныйЗвонок.Дата, МЕСЯЦ) КАК Период,
	|	ТелефонныйЗвонок.АбонентКонтакт.Ссылка КАК Абонент
	|ПОМЕСТИТЬ ЗвонкиМенеджеров
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|ГДЕ
	|	ТелефонныйЗвонок.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.Пустаяссылка)
	|	И ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер В
	|			(ВЫБРАТЬ
	|				ПользователиКвалификаций.Пользователь
	|			ИЗ
	|				ПользователиКвалификаций)
	|	И ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер = ТелефонныйЗвонок.Ответственный
	|	И ТелефонныйЗвонок.сфпДлительностьЗвонка > &ДлительностьЗвонка
	|	И ВЫБОР
	|			КОГДА &ТолькоЗакрепленные
	|				ТОГДА ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер В
	|						(ВЫБРАТЬ
	|							ЗакрепленныеКлиенты.Менеджер
	|						ИЗ
	|							ЗакрепленныеКлиенты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер
	|ПОМЕСТИТЬ ПартнерыСМаенеджерами
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	НЕ Партнеры.ОсновнойМенеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И Партнеры.ОсновнойМенеджер В
	|			(ВЫБРАТЬ
	|				ПользователиКвалификаций.Пользователь
	|			ИЗ
	|				ПользователиКвалификаций)
	|	И НЕ Партнеры.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ТолькоЗакрепленные
	|				ТОГДА Партнеры.ОсновнойМенеджер В
	|						(ВЫБРАТЬ
	|							ЗакрепленныеКлиенты.Менеджер
	|						ИЗ
	|							ЗакрепленныеКлиенты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоЗакрепленные
	|				ТОГДА Партнеры.Ссылка В
	|						(ВЫБРАТЬ
	|							ЗакрепленныеКлиенты.Партнер
	|						ИЗ
	|							ЗакрепленныеКлиенты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТелефонныйЗвонок.АбонентКонтакт.Ссылка КАК Абонент,
	|	МАКСИМУМ(ТелефонныйЗвонок.Дата) КАК Период
	|ПОМЕСТИТЬ ПоследнийЗвонок
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|ГДЕ
	|	НЕ ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.Пустаяссылка)
	|	И ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер В
	|			(ВЫБРАТЬ
	|				ПользователиКвалификаций.Пользователь
	|			ИЗ
	|				ПользователиКвалификаций)
	|	И ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер = ТелефонныйЗвонок.Ответственный
	|	И ТелефонныйЗвонок.сфпДлительностьЗвонка > &ДлительностьЗвонка
	|	И ВЫБОР
	|			КОГДА &ТолькоЗакрепленные
	|				ТОГДА ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер В
	|						(ВЫБРАТЬ
	|							ЗакрепленныеКлиенты.Менеджер
	|						ИЗ
	|							ЗакрепленныеКлиенты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТелефонныйЗвонок.АбонентКонтакт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_Взаимодействие.Партнер КАК Партнер,
	|	МАКСИМУМ(CRM_Взаимодействие.ПлановаяДата) КАК ПлановаяДата
	|ПОМЕСТИТЬ ПланируемыеВзаимодействия
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|	И CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_Взаимодействие.Партнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартСостояниеПартнеров.Партнер КАК Партнер,
	|	смартСостояниеПартнеров.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
	|	смартСостояниеПартнеров.СуммаПродажОборудования КАК СуммаПродажОборудования
	|ПОМЕСТИТЬ ПродажиПартнеров
	|ИЗ
	|	РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер.Подразделение КАК Подразделение,
	|	ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер КАК Ответственный,
	|	смартСостояниеПартнеров.Статус КАК Статус,
	|	ПартнерыСМаенеджерами.Партнер КАК Партнер,
	|	ПартнерыСМаенеджерами.Партнер.ДатаРегистрации КАК ДатаРегистрации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЕСТЬNULL(ЗакрепленныеКлиенты.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Закреплен,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЕСТЬNULL(ЗакрепленныеКлиенты.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|			ТОГДА ЗакрепленныеКлиенты.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаЗакреплления,
	|	СУММА(ЗвонкиМенеджеров.ДлительностьЗвонка) КАК ДлительностьЗвонка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоследнийЗвонок.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(ПоследнийЗвонок.Период, ДАТАВРЕМЯ(1, 1, 1)), &ТекущаяДата, ДЕНЬ)
	|	КОНЕЦ КАК ДнейСПоследнегоЗвонка,
	|	ПланируемыеВзаимодействия.ПлановаяДата КАК ЗапланированноеВзаимодействие,
	|	ПродажиПартнеров.КоличествоПродажОборудования КАК КоличествоПродажОборудования,
	|	ПродажиПартнеров.СуммаПродажОборудования КАК СуммаПродажОборудования,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЗвонкиМенеджеров.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)
	|					ИНАЧЕ ЗвонкиМенеджеров.Период
	|				КОНЕЦ = &ЭтотМесяц
	|				ТОГДА ЗвонкиМенеджеров.ДлительностьЗвонка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭтотМесяцМинуты,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ЗвонкиМенеджеров.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)
	|						ИНАЧЕ ЗвонкиМенеджеров.Период
	|					КОНЕЦ = &ЭтотМесяц
	|					И ЕСТЬNULL(ЗвонкиМенеджеров.ДлительностьЗвонка, 0) <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭтотМесяцЗвонки,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЗвонкиМенеджеров.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)
	|					ИНАЧЕ ЗвонкиМенеджеров.Период
	|				КОНЕЦ = &ЭтотМесяцМинус1
	|				ТОГДА ЗвонкиМенеджеров.ДлительностьЗвонка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭтотМесяцМинус1Минуты,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ЗвонкиМенеджеров.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)
	|						ИНАЧЕ ЗвонкиМенеджеров.Период
	|					КОНЕЦ = &ЭтотМесяцМинус1
	|					И ЕСТЬNULL(ЗвонкиМенеджеров.ДлительностьЗвонка, 0) <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭтотМесяцМинус1Звонки,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЗвонкиМенеджеров.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)
	|					ИНАЧЕ ЗвонкиМенеджеров.Период
	|				КОНЕЦ = &ЭтотМесяцМинус2
	|				ТОГДА ЗвонкиМенеджеров.ДлительностьЗвонка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭтотМесяцМинус2Минуты,
	|	СУММА(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ЗвонкиМенеджеров.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)
	|						ИНАЧЕ ЗвонкиМенеджеров.Период
	|					КОНЕЦ = &ЭтотМесяцМинус2
	|					И ЕСТЬNULL(ЗвонкиМенеджеров.ДлительностьЗвонка, 0) <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЭтотМесяцМинус2Звонки
	|ИЗ
	|	ПартнерыСМаенеджерами КАК ПартнерыСМаенеджерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗвонкиМенеджеров КАК ЗвонкиМенеджеров
	|		ПО ПартнерыСМаенеджерами.Партнер = ЗвонкиМенеджеров.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
	|		ПО ПартнерыСМаенеджерами.Партнер = смартСостояниеПартнеров.Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийЗвонок КАК ПоследнийЗвонок
	|		ПО ПартнерыСМаенеджерами.Партнер = ПоследнийЗвонок.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрепленныеКлиенты КАК ЗакрепленныеКлиенты
	|		ПО ПартнерыСМаенеджерами.Партнер = ЗакрепленныеКлиенты.Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланируемыеВзаимодействия КАК ПланируемыеВзаимодействия
	|		ПО ПартнерыСМаенеджерами.Партнер = ПланируемыеВзаимодействия.Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиПартнеров КАК ПродажиПартнеров
	|		ПО ПартнерыСМаенеджерами.Партнер = ПродажиПартнеров.Партнер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер.Подразделение,
	|	ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер,
	|	смартСостояниеПартнеров.Статус,
	|	ПартнерыСМаенеджерами.Партнер,
	|	ПартнерыСМаенеджерами.Партнер.ДатаРегистрации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЕСТЬNULL(ЗакрепленныеКлиенты.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПартнерыСМаенеджерами.Партнер.ОсновнойМенеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) = ЕСТЬNULL(ЗакрепленныеКлиенты.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|			ТОГДА ЗакрепленныеКлиенты.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоследнийЗвонок.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(ПоследнийЗвонок.Период, ДАТАВРЕМЯ(1, 1, 1)), &ТекущаяДата, ДЕНЬ)
	|	КОНЕЦ,
	|	ПланируемыеВзаимодействия.ПлановаяДата,
	|	ПродажиПартнеров.КоличествоПродажОборудования,
	|	ПродажиПартнеров.СуммаПродажОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статус УБЫВ
	|ИТОГИ ПО
	|	Ответственный,
	|	Статус";
	
	
	//ТекМесМинус3 = ДобавитьМесяц(ТекущаяДата(), -3);
	ТекМесМинус2 = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -2));
	ТекМесМинус1 = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	
	Элементы.ДЗЗакрепленныеПартнерыГруппаМесяц.Заголовок = Формат(ТекущаяДата(),"ДФ=MMMM.yyyy"); 
	Элементы.ДЗЗакрепленныеПартнерыГруппаМесяц2.Заголовок = Формат(ТекМесМинус1,"ДФ=MMMM.yyyy"); 
	Элементы.ДЗЗакрепленныеПартнерыГруппаМесяц3.Заголовок = Формат(ТекМесМинус2,"ДФ=MMMM.yyyy"); 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекМесМинус2));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));  
	Запрос.УстановитьПараметр("ДлительностьЗвонка", 30);  	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());  	
	Запрос.УстановитьПараметр("ТолькоЗакрепленные", Истина);
	Запрос.УстановитьПараметр("ЭтотМесяц", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЭтотМесяцМинус1", ТекМесМинус1);
	Запрос.УстановитьПараметр("ЭтотМесяцМинус2", ТекМесМинус2); 	
	Запрос.УстановитьПараметр("Ответственный", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КоллекцияЭлементовДерева = ДЗЗакрепленныеПартнеры.ПолучитьЭлементы();
	КоллекцияЭлементовДерева.Очистить();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, РезультатЗапроса);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗакрепленныеПартнеры(Команда)
	ПоказатьЗакрепленныеПартнерыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДЗМоиЗвонкиПриАктивизацииСтроки(Элемент)
	
	ДанныеСтроки = Элементы.ДЗМоиЗвонки.ТекущиеДанные; 
	
	Если ДанныеСтроки <> Неопределено И ТипЗнч(ДанныеСтроки.Партнер) = Тип("СправочникСсылка.Партнеры")  Тогда
		ЗаполнитьЗвонкиПоПартнеру(ДанныеСтроки.ДатаЗвонка, ДанныеСтроки.Партнер);
	Иначе
		ТЗЗвонкиПоПартнеру.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗвонкиПоПартнеру(ДатаЗвонка,ПартнерЗвонка)
	
	ТЗЗвонкиПоПартнеру.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТелефонныйЗвонок.Ссылка КАК ДокументЗвонка,
	|	ТелефонныйЗвонок.Дата КАК ДатаЗвонка,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка КАК ДлительностьЗвонка,
	|	ТелефонныйЗвонок.смартДлительностьЗвонка КАК смартДлительностьЗвонка,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка КАК Состояние
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|ГДЕ
	|	ТелефонныйЗвонок.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ТелефонныйЗвонок.АбонентКонтакт = &ПартнерЗвонка
	|	И ТелефонныйЗвонок.сфпДлительностьЗвонка > 30
	|	И ТелефонныйЗвонок.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаЗвонка));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаЗвонка));
	Запрос.УстановитьПараметр("ПартнерЗвонка", ПартнерЗвонка);
	Запрос.УстановитьПараметр("Ответственный", Исполнитель);
	
	ТЗЗвонкиПоПартнеру.Загрузить( Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗЗвонкиПоПартнеруВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Сообщить(ВыбраннаяСтрока);
	ПрослушатьЗаписьРазговора(Элемент.ТекущиеДанные.ДокументЗвонка);	       
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ПрослушатьЗаписьРазговора".
//
Процедура ПрослушатьЗаписьРазговора(ОбъектЗвонка)
	
	НужныеДанные = ПолучитьНужныеДанныеДляЗвонка(ОбъектЗвонка);
	
	ПараметрыЗвонка = Новый Структура("ИдентификаторЗвонка, ИдентификаторЗаписи, Ответственный, Входящий, НомерТелефона, ВнутреннийНомер, ДатаНачала, ДатаОкончания, Звонок",
	НужныеДанные.сфпИдентификаторЗвонка, НужныеДанные.сфпИдентификаторЗаписи, НужныеДанные.Ответственный, НужныеДанные.Входящий, НужныеДанные.АбонентКакСвязаться, НужныеДанные.сфпВнутреннийНомер, НужныеДанные.сфпДатаНачала, НужныеДанные.сфпДатаОкончания, НужныеДанные.Ссылка);
	сфпСофтФонПроКлиент.НачатьПрослушиваниеЗаписиРазговора(ПараметрыЗвонка, ЭтаФорма, Элементы.ТЗЗвонкиПоПартнеру);
	
КонецПроцедуры // ПрослушатьЗаписьРазговора()

Функция ПолучитьНужныеДанныеДляЗвонка(ОбъектЗвонка)
	
	Если НЕ ОбъектЗвонка.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	сфпИсторияЗвонков.ВнутреннийНомер КАК ВнутреннийНомер,
		|	сфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
		|	сфпИсторияЗвонков.ДатаОтвета КАК ДатаОтвета,
		|	сфпИсторияЗвонков.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.сфпИсторияЗвонков КАК сфпИсторияЗвонков
		|ГДЕ
		|	сфпИсторияЗвонков.Звонок = &Звонок
		|	И сфпИсторияЗвонков.ИдентификаторЗвонка = &ИдентификаторЗвонка");
		Запрос.УстановитьПараметр("Звонок", ОбъектЗвонка.Ссылка);
		Запрос.УстановитьПараметр("ИдентификаторЗвонка", ОбъектЗвонка.сфпИдентификаторЗвонка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда   			
			СтруктураНужныхДанных = Новый Структура();
			СтруктураНужныхДанных.Вставить("сфпВнутреннийНомер", Выборка.ВнутреннийНомер); 
			СтруктураНужныхДанных.Вставить("сфпДатаНачала", Выборка.ДатаНачала); 
			СтруктураНужныхДанных.Вставить("сфпДатаОтвета", Выборка.ДатаОтвета); 
			СтруктураНужныхДанных.Вставить("сфпДатаОкончания", Выборка.ДатаОкончания); 
			СтруктураНужныхДанных.Вставить("сфпИдентификаторЗвонка", ОбъектЗвонка.сфпИдентификаторЗвонка);
			СтруктураНужныхДанных.Вставить("сфпИдентификаторЗаписи", ОбъектЗвонка.сфпИдентификаторЗаписи);
			СтруктураНужныхДанных.Вставить("Ответственный", ОбъектЗвонка.Ответственный);
			СтруктураНужныхДанных.Вставить("Входящий", ОбъектЗвонка.Входящий);
			СтруктураНужныхДанных.Вставить("АбонентКакСвязаться", ОбъектЗвонка.АбонентКакСвязаться);
			СтруктураНужныхДанных.Вставить("Ссылка", ОбъектЗвонка.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураНужныхДанных;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПродажиПоПартнеру(Команда)
	
	ОбновитьПродажиПоПартнеруСервер();
	
	//ЭлементыДерева = ДЗПродажиОборудование.ПолучитьЭлементы();
	//Для каждого ЭлементДерева Из ЭлементыДерева Цикл
	//    Элементы.ДЗПродажиОборудование.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
	//КонецЦикла;
	
	РазвернутьВсеДерево(ДЗПродажиОборудование.ПолучитьЭлементы()); 
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеДерево(КоллекцияЭлементов) 
	
	Для каждого ЭлементКоллекции Из КоллекцияЭлементов Цикл
		Элементы.ДЗПродажиОборудование.Развернуть(ЭлементКоллекции.ПолучитьИдентификатор());
		
		ВложенныеЭлементыКоллекции = ЭлементКоллекции.ПолучитьЭлементы();
		Если (ВложенныеЭлементыКоллекции.Количество() > 0) Тогда
			РазвернутьВсеДерево(ВложенныеЭлементыКоллекции);
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьПродажиПоПартнеруСервер()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = &ТоварыПлоттерСерии
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&АппаратноеОбеспечение)
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&АппаратноеОбеспечениеАрх)
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&Комплектующие)
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&КомплектующиеАрх)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПродажОборудования,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = &ЗапчастиСЦ
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПродажЗапчастей,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&Расходка)
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&РасходкаАрх)
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПродажРасходников,
	|	ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК КоличествоОборот
	|ПОМЕСТИТЬ ПродажиПартнеров
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК ВыручкаИСебестоимостьПродажОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиПартнеров.Регистратор.Дата КАК Дата,
	|	ПродажиПартнеров.Регистратор КАК Реализация,
	|	ПродажиПартнеров.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
	|	ПродажиПартнеров.КоличествоОборот КАК Количество,
	|	ПродажиПартнеров.СуммаПродажОборудования КАК Сумма,
	|	ПродажиПартнеров.Регистратор.Подразделение КАК Подразделение,
	|	ПродажиПартнеров.Регистратор.ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	ПродажиПартнеров КАК ПродажиПартнеров
	|ГДЕ
	|	ПродажиПартнеров.СуммаПродажОборудования <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Дата,
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиПартнеров.Регистратор.Дата КАК Дата,
	|	ПродажиПартнеров.Регистратор КАК Реализация,
	|	ПродажиПартнеров.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
	|	ПродажиПартнеров.КоличествоОборот КАК Количество,
	|	ПродажиПартнеров.СуммаПродажЗапчастей КАК Сумма,
	|	ПродажиПартнеров.Регистратор.Подразделение КАК Подразделение,
	|	ПродажиПартнеров.Регистратор.ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	ПродажиПартнеров КАК ПродажиПартнеров
	|ГДЕ
	|	ПродажиПартнеров.СуммаПродажЗапчастей <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Дата,
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиПартнеров.Регистратор.Дата КАК Дата,
	|	ПродажиПартнеров.Регистратор КАК Реализация,
	|	ПродажиПартнеров.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
	|	ПродажиПартнеров.КоличествоОборот КАК Количество,
	|	ПродажиПартнеров.СуммаПродажРасходников КАК Сумма,
	|	ПродажиПартнеров.Регистратор.Подразделение КАК Подразделение,
	|	ПродажиПартнеров.Регистратор.ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	ПродажиПартнеров КАК ПродажиПартнеров
	|ГДЕ
	|	ПродажиПартнеров.СуммаПродажРасходников <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Дата,
	|	Реализация";
	
	Запрос.УстановитьПараметр("ТоварыПлоттерСерии", Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение);
	Запрос.УстановитьПараметр("АппаратноеОбеспечение", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007818"));
	Запрос.УстановитьПараметр("АппаратноеОбеспечениеАрх", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007399"));
	Запрос.УстановитьПараметр("Комплектующие", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007946"));
	Запрос.УстановитьПараметр("КомплектующиеАрх", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00016852"));
	Запрос.УстановитьПараметр("ЗапчастиСЦ", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Запчасти сервисного центра"));
	Запрос.УстановитьПараметр("Расходка", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007802"));
	Запрос.УстановитьПараметр("РасходкаАрх", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007524"));
	Запрос.УстановитьПараметр("Партнер", ТекПартнер);
	
	
	Пакет = Запрос.ВыполнитьПакет();
	РезультатОборудование = Пакет[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(РезультатОборудование, "ДЗПродажиОборудование");
	
	РезультатЗапчасти = Пакет[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(РезультатЗапчасти, "ДЗПродажиЗапчасти");
	
	РезультатРасходники = Пакет[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(РезультатРасходники, "ДЗПродажиРасходников");
	
	//РезультатДляКоличества = Пакет[0].Выгрузить();
	//РезультатДляКоличества.Свернуть("ЗаказКлиента", "Количество");
	//Элементы.ГруппаПродажиСЦ.Заголовок = "Продажи СЦ - " + РезультатДляКоличества.Количество();
	
	
	//Пакет = Запрос.ВыполнитьПакет();
	//ТабЛента.Загрузить(Пакет[1].Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОчиститьНажатие(Элемент)
	Элементы.ТабЛентаПартнер.ОтборСтрок = Новый ФиксированнаяСтруктура();
	ОтборСтрок = Ложь; 
	Элементы.ДекорацияОтборОтв.Заголовок = "Отбор: ";
	ОформлениеОтбораСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеОтбораСтрок()
	
	Если ОтборСтрок Тогда
		Элементы.ДекорацияОчистить.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		Элементы.ДекорацияОчистить.ЦветТекста = Новый Цвет(28,85,174);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЛентаПартнерыОтветственныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтр = Элементы.ТабЛентаПартнерыОтветственные.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда			
		Элементы.ТабЛентаПартнер.ОтборСтрок = Новый ФиксированнаяСтруктура("Отправитель", ТекСтр.Ответственный); 
		ОтборСтрок = Истина;
		Элементы.ДекорацияОтборОтв.Заголовок = "Отбор: " + ТекСтр.Ответственный;
	Иначе 
		ОтборСтрок = Ложь;
		Элементы.ДекорацияОтборОтв.Заголовок = "Отбор: ";
	КонецЕсли;
	
	ОформлениеОтбораСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПартнерыПриИзменении(Элемент) 
	
	ТекущийДСПартнеры = ВернутьТекущуюДинамическийСписокПартнеры();
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		ТекущееСостояниеПартнеры = СостояниеПартнеры;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		ТекущееСостояниеПартнеры = СостояниеПартнерыСЦ;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		ТекущееСостояниеПартнеры = СостояниеПартнерыРМ;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущееСостояниеПартнеры) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Состояние", ТекущееСостояниеПартнеры, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекущийДСПартнеры, "Состояние", , , , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДСПартнерыСЦПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДСПартнерыСЦ.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		СформироватьЗаметкиВзаимодействияПартнера(ТекДанные.Ссылка);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСКонтактнаяИнформация, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСОборудованиеЧернила, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЧернилаОборудование, "Партнер", ТекДанные.Ссылка, Истина);
		CRM_СформироватьСтрокуРезультатаПоиска(ТекДанные.Ссылка);
		
		ТекПартнер = ТекДанные.Ссылка;
		
	Иначе
		
		ТекПартнер = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДСПартнерыРМПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДСПартнерыРМ.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		СформироватьЗаметкиВзаимодействияПартнера(ТекДанные.Ссылка);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСКонтактнаяИнформация, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСОборудованиеЧернила, "Партнер", ТекДанные.Ссылка, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСЧернилаОборудование, "Партнер", ТекДанные.Ссылка, Истина);
		
		CRM_СформироватьСтрокуРезультатаПоиска(ТекДанные.Ссылка);
		ТекПартнер = ТекДанные.Ссылка;
		
	Иначе
		
		ТекПартнер = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Группа13ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаОсновнойМенеджер" Тогда
		
		ОбновитьТаблицуПоказателейПартнеры();
		ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер";
		
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаМенеджерСЦ" Тогда
		
		ОбновитьТаблицуПоказателейПартнерыСЦ();
		ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ";
		
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаМенеджерПоРМ" Тогда 
		
		ОбновитьТаблицуПоказателейПартнерыРМ();
		ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ";
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ВернутьТекущуюДинамическийСписокПартнеры()
	
	Если ТекущаяСтраницаПартнеры = "ГруппаОсновнойМенеджер" Тогда
		
		Возврат ДСПартнеры;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерСЦ" Тогда
		
		Возврат ДСПартнерыСЦ;
		
	ИначеЕсли ТекущаяСтраницаПартнеры = "ГруппаМенеджерПоРМ" Тогда 
		
		Возврат ДСПартнерыРМ;
		
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ТЗЭтапыОбработкиИнтересовПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ТЗЭтапыОбработкиИнтересов.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.Партнер) Тогда
		
		СформироватьЗаметкиВзаимодействияПартнера(ТекДанные.Партнер);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтсутствияНажатие(Элемент)
	
	Элементы.ГруппаОтсутствия.Показать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Статус КАК Статус,
	|	До КАК До,
	|	ДатаОтсрочкиПоОтпуску КАК ДатаОтсрочкиПоОтпуску
	|ИЗ
	|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(, Пользователь = &Пользователь)");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Статус = Справочники.смартСтатусыСотрудников.ВОтпуске Тогда
			
			ДатаОтсрочкиПоОтпуску = Выборка.ДатаОтсрочкиПоОтпуску;
			
		ИначеЕсли ТекущийСтатусСотрудника = Справочники.смартСтатусыСотрудников.ВОтпуске Тогда
			
			ДатаОтсрочкиПоОтпуску = ТекущаяДата() + 3600 * 24 * 2 * ((НачалоДня(ДатаСтатуса) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24));
			
		Иначе	
			
			ДатаОтсрочкиПоОтпуску = "";
			
		КонецЕсли;	
		
	Иначе
		
		Если ТекущийСтатусСотрудника = Справочники.смартСтатусыСотрудников.ВОтпуске Тогда
			
			ДатаОтсрочкиПоОтпуску = ТекущаяДата() + 3600 * 24 * 2 * ((НачалоДня(ДатаСтатуса) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24));
			
		Иначе
			
			ДатаОтсрочкиПоОтпуску = "";
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.смартИсторияСтатусовСотрудников.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Период = ТекущаяДата();
	ЗаписьРегистра.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьРегистра.Статус = ТекущийСтатусСотрудника;
	ЗаписьРегистра.До = ДатаСтатуса;
	ЗаписьРегистра.ДатаОтсрочкиПоОтпуску = ДатаОтсрочкиПоОтпуску;
	ЗаписьРегистра.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтсутствие(Команда)
	
	УстановитьСтатусНаСервере();
	Элементы.ГруппаОтсутствия.Скрыть();
	УстановитьЗаголовокДекорацииСтатусаСотрудника();
	
КонецПроцедуры

Процедура УстановитьЗаголовокДекорацииСтатусаСотрудника()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Статус КАК Статус,
	|	До КАК До
	|ИЗ
	|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(&ТекущаяДата, Пользователь = &Пользователь)");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Статус = Справочники.смартСтатусыСотрудников.НаРабочемМесте Тогда
			
			Элементы.ДекорацияОтсутствия.Заголовок = "На рабочем месте";
			Элементы.ДекорацияОтсутствия.ЦветТекста = Новый Цвет(0, 128, 0);
			Элементы.Группа68.ЦветФона = Новый Цвет(240, 255, 240);
			Элементы.Группа67.ЦветФона = Новый Цвет(153, 204, 0);
			
		Иначе
			
			Элементы.ДекорацияОтсутствия.Заголовок = "" + Выборка.Статус + "";
			//Элементы.ДекорацияОтсутствия.Заголовок = "" + Выборка.Статус + ?(ЗначениеЗаполнено(Выборка.До), 
			//	", до " + Выборка.До, "");
			Элементы.ДекорацияОтсутствия.ЦветТекста = Новый Цвет(220, 20, 60);
			Элементы.Группа68.ЦветФона = Новый Цвет(255, 245, 238);
			Элементы.Группа67.ЦветФона = Новый Цвет(236, 122, 68);
			
		КонецЕсли;	
		
	Иначе
		
		Элементы.ДекорацияОтсутствия.Заголовок = "На рабочем месте";
		Элементы.ДекорацияОтсутствия.ЦветТекста = Новый Цвет(0, 128, 0);
		Элементы.Группа68.ЦветФона = Новый Цвет(240, 255, 240);
		Элементы.Группа67.ЦветФона = Новый Цвет(153, 204, 0);
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Процедура СписокФайловПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И РасширенияПоддерживающиеПредпросмотр.НайтиПоЗначению(ТекущиеДанные.Расширение) <> Неопределено Тогда

		Попытка
			
			АдресДанныхФайла = ПоместитьФайлИзСправочникаВоВременноеХранилище(ТекущиеДанные.Ссылка);	

			
			Если ТекущиеДанные.Расширение = "pdf" Тогда
				
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
				Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
				ЭтаФорма.PDFДокумент.Прочитать(Поток);

				Элементы.PDFДокумент.Видимость = Истина; 
				Элементы.АдресДанныхФайла.Видимость = Ложь;
				Элементы.PDFДокумент.Документ = ЭтаФорма.PDFДокумент;
				
			Иначе
				
				Элементы.PDFДокумент.Видимость = Ложь;
				Элементы.АдресДанныхФайла.Видимость = Истина;
				АдресДанныхФайла = АдресДанныхФайла;
				
			КонецЕсли;

		Исключение
			// Если файла не существует, то будет вызвано исключение.
			АдресДанныхФайла         = Неопределено;
			ТекстНевыбраннойКартинки = НСтр("ru = 'Предварительный просмотр недоступен по причине:'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

	Иначе

		АдресДанныхФайла         = Неопределено;
		ТекстНевыбраннойКартинки = НСтр("ru = 'Нет данных для предварительного просмотра'");

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресДанныхФайла) Тогда
		Элементы.АдресДанныхФайла.ТекстНевыбраннойКартинки = ТекстНевыбраннойКартинки;
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-6510 смарт: Фролов 20.04.2026

&НаСервере
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Функция ПоместитьФайлИзСправочникаВоВременноеХранилище(СсылкаНаСправочник)
	
	ОбъектСправочника = СсылкаНаСправочник.ПолучитьОбъект();
	
	Если ОбъектСправочника = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ОбъектСправочника.ФайлХранилище = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ДвоичныеДанные = ОбъектСправочника.ФайлХранилище.Получить();
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;

КонецФункции //-- #Б-6510 смарт: Фролов 20.04.2026

&НаКлиенте
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Процедура СохранитьФайл(Команда)
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		АдресДанныхФайла = ПоместитьФайлИзСправочникаВоВременноеХранилище(ТекущиеДанные.Ссылка);
		
		ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохранения.Заголовок = "Укажите имя файла для сохранения";
		ДиалогСохранения.ПолноеИмяФайла = ТекущиеДанные.Наименование;
		ДиалогСохранения.Расширение = ТекущиеДанные.Расширение;
		
		ПараметрыСохранения = Новый Структура("АдресДанныхФайла", АдресДанныхФайла);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораСохранения", ЭтотОбъект, ПараметрыСохранения);
		
		ДиалогСохранения.Показать(Оповещение);

	КонецЕсли;	
	
КонецПроцедуры //-- #Б-6510 смарт: Фролов 20.04.2026

&НаКлиенте
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Процедура ПослеВыбораСохранения(ВыбранныеФайлы, ДопПараметр) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьПослеПолученияФайлов", ЭтотОбъект);
	ПолучаемыеФайлы = Новый Массив();
	ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ВыбранныеФайлы[0], ДопПараметр.АдресДанныхФайла));
	НачатьПолучениеФайлов(ОповещениеОЗавершении, ПолучаемыеФайлы, , Ложь);
	
КонецПроцедуры //-- #Б-6510 смарт: Фролов 20.04.2026

&НаКлиенте
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Процедура ВыполнитьПослеПолученияФайлов(ПолученныеФайлы, ДопПараметр) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		Сообщить("Не получилось сохранить файл");
	КонецЕсли;
	Для Каждого Файл Из ПолученныеФайлы Цикл
		Сообщить("Сохранен файл по адресу: " + Файл.ПолноеИмя);
	КонецЦикла;
	
КонецПроцедуры //-- #Б-6510 смарт: Фролов 20.04.2026

&НаКлиенте
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Процедура Группа39ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Заголовок = "Полезные файлы" Тогда
		
		ПодключитьОбработчикОжидания("РаскрытьДерево", 0.1, Истина);
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-6510 смарт: Фролов 20.04.2026

&НаКлиенте
//++ #Б-6510 смарт: Фролов 20.04.2026 //Добавить в Рабочий стол сотрудника раздел "Полезная информация"
Процедура РаскрытьДерево()
	
	Элементы.СписокФайлов.Развернуть(Элементы.СписокФайлов.ТекущаяСтрока, Истина);
	
КонецПроцедуры //-- #Б-6510 смарт: Фролов 20.04.2026

#КонецОбласти
