#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ТипЗнч(ДанныеЗаполнения.Объект) = Тип("Строка") Тогда
			Объект = ПолучитьИзВременногоХранилища(ДанныеЗаполнения.Объект).ОбъектЗначение;
		Иначе
			Объект = ДанныеЗаполнения.Объект;
		КонецЕсли;
		ИмяОбъекта = Объект.Метаданные().Имя;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли