
//++ Смарт:  Демичев №809 21.12.2021((Типовые процедуры обрботки номера для исключительных ситуаций префиксаций объектов
Функция НомерНаПечать_ТиповойМетодУТ(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт
	
	// {Обработчик: ПриПолученииНомераНаПечать} Начало
	СтандартнаяОбработка = Истина;
	
	ПрефиксацияОбъектовКлиентСерверПереопределяемый.ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка,
		УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат НомерОбъекта;
	КонецЕсли;
	// {Обработчик: ПриПолученииНомераНаПечать} Окончание
	
	НомерОбъекта = СокрЛП(НомерОбъекта);
	
	// Удаляем пользовательские префиксы из номера объекта.
	Если УдалитьПользовательскийПрефикс Тогда
		
		НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
		
	КонецЕсли;
	
	// Удаляем лидирующие нули из номера объекта.
	НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
	
	// Удаляем префикс организации и префикс информационной базы из номера объекта.
	НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Истина, УдалитьПрефиксИнформационнойБазы);
	
	Возврат НомерОбъекта;

КонецФункции
//-- Смарт:  Демичев №809 21.12.2021))

&ИзменениеИКонтроль("НомерНаПечать")
Функция смарт_НомерНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс)
	
	#Удаление
	// {Обработчик: ПриПолученииНомераНаПечать} Начало
	СтандартнаяОбработка = Истина;
	
	ПрефиксацияОбъектовКлиентСерверПереопределяемый.ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка,
		УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат НомерОбъекта;
	КонецЕсли;
	// {Обработчик: ПриПолученииНомераНаПечать} Окончание
	
	НомерОбъекта = СокрЛП(НомерОбъекта);
	
	// Удаляем пользовательские префиксы из номера объекта.
	Если УдалитьПользовательскийПрефикс Тогда
		
		НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
		
	КонецЕсли;
	
	// Удаляем лидирующие нули из номера объекта.
	НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
	
	// Удаляем префикс организации и префикс информационной базы из номера объекта.
	НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Истина, УдалитьПрефиксИнформационнойБазы);
	
	Возврат НомерОбъекта;
	#КонецУдаления
	#Вставка
	//++ Демичев №809 13.12.2021((
	//// {Обработчик: ПриПолученииНомераНаПечать} Начало
	//СтандартнаяОбработка = Истина;
	//
	//ПрефиксацияОбъектовКлиентСерверПереопределяемый.ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка,
	//	УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	//
	//Если СтандартнаяОбработка = Ложь Тогда
	//	Возврат НомерОбъекта;
	//КонецЕсли;
	//// {Обработчик: ПриПолученииНомераНаПечать} Окончание
	//
	//НомерОбъекта = СокрЛП(НомерОбъекта);
	//
	//// Удаляем пользовательские префиксы из номера объекта.
	//Если УдалитьПользовательскийПрефикс Тогда
	//	
	//	НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
	//	
	//КонецЕсли;
	//
	//// Удаляем лидирующие нули из номера объекта.
	//НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
	//
	//// Удаляем префикс организации и префикс информационной базы из номера объекта.
	//НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Истина, УдалитьПрефиксИнформационнойБазы);
	//
	//Возврат НомерОбъекта;
	
	
	//Переопределим печать номера у ПФ исходя из РС смартПрефиксыИнформационныхБаз.
	//УдалитьПрефиксИнформационнойБазы и УдалитьПользовательскийПрефикс будем брать непосредственно оттуда
	
	НомерОбъекта = СокрЛП(НомерОбъекта);
	
	Если Не НомерСодержитСтандартныйПрефикс(НомерОбъекта) Тогда
		Возврат НомерОбъекта;
	КонецЕсли;

	НомерСодержитПятизначныйПрефикс = НомерСодержитПятизначныйПрефикс(НомерОбъекта);
	
	ПрефиксОрганизации = Неопределено;
	ПрефиксИнформационнойБазы = Неопределено;
	
	Если НомерСодержитПятизначныйПрефикс Тогда
		ПрефиксОрганизации        = Лев(НомерОбъекта, 2);
		ПрефиксИнформационнойБазы = Сред(НомерОбъекта, 3, 2);
	Иначе
		ПрефиксОрганизации = "";
		ПрефиксИнформационнойБазы = Лев(НомерОбъекта, 2);
	КонецЕсли;
	
	Если ПрефиксОрганизации = "" Тогда
		
		Возврат НомерОбъекта; //Неизвестно для какой организации печатаем. Выводим номер как есть
		
	КонецЕсли;
	
		
	НастройкиПечатиНомера = смартОбщегоНазначения.ПолучитьНастройкиПечатиНомераПоОрганизацииИПрефиксу(ПрефиксОрганизации,ПрефиксИнформационнойБазы);
	
	Если НастройкиПечатиНомера = Неопределено Тогда
		
		Возврат  СокрЛП(НомерОбъекта); //Нет настроек
		
	КонецЕсли;	

	Если  Не НастройкиПечатиНомера.ПечататьПрефиксОрганизации и Не НастройкиПечатиНомера.ПечататьПрефиксИБ Тогда
	
		НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
        НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
	
		НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта,Истина,Истина);
		
	ИначеЕсли  НастройкиПечатиНомера.ПечататьПрефиксОрганизации и Не НастройкиПечатиНомера.ПечататьПрефиксИБ  Тогда
		
		НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
        НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
		
		
		НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта,Ложь,Истина);

	ИначеЕсли Не НастройкиПечатиНомера.ПечататьПрефиксОрганизации и  НастройкиПечатиНомера.ПечататьПрефиксИБ  Тогда
		
		НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
        НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
			
		НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта,Истина,Ложь);
			
	КонецЕсли;	
				
	Возврат НомерОбъекта;
	
	//-- Демичев №809 13.12.2021))
	#КонецВставки
КонецФункции
