#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПродолжительностьПериода(НачПериода, КонПериода, Календарь = Неопределено) Экспорт
	РабочееВремя = CRM_ОбщегоНазначенияСервер.ПолучитьСтруктуруРабочихВременПользователя(, Истина);
	Возврат CRM_ОбщегоНазначенияСервер.ПолучитьПродолжительностьПериода(НачПериода, КонПериода,, Календарь, РабочееВремя);
КонецФункции

Функция ВычислитьЗагрузку(РабочееВремяМесяцаЧасы, ТрудоемкостьЧасыТек) Экспорт
	ПроцентЗагрузкиТек = ?(РабочееВремяМесяцаЧасы = 0, 0, ТрудоемкостьЧасыТек / РабочееВремяМесяцаЧасы * 100);
	
	Если ПроцентЗагрузкиТек = 0 Тогда
		Возврат "";
	ИначеЕсли ПроцентЗагрузкиТек < 98 И Окр(РабочееВремяМесяцаЧасы) - Окр(ТрудоемкостьЧасыТек) > 4  Тогда
		Если ПроцентЗагрузкиТек > 75 Тогда
			Возврат "Недогрузка1";
		ИначеЕсли ПроцентЗагрузкиТек > 50 Тогда
			Возврат "Недогрузка2";
		ИначеЕсли ПроцентЗагрузкиТек > 25 Тогда
			Возврат "Недогрузка3";
		Иначе
			Возврат "Недогрузка4";
		КонецЕсли;
	ИначеЕсли ПроцентЗагрузкиТек > 102 И Окр(ТрудоемкостьЧасыТек) -  Окр(РабочееВремяМесяцаЧасы) > 4 Тогда
		Возврат "Перегрузка";
	Иначе
		Возврат "Норма";
	КонецЕсли;
		
КонецФункции

#КонецОбласти


#КонецЕсли