
//Вызывает формирование печатной формы по шаблону из команды печати
Функция ПечатьПоШаблону(ПараметрыПечати) Экспорт

	Для Каждого ОбъектПечати Из ПараметрыПечати.ОбъектыПечати Цикл
		
		//Получение шаблона печати
		Шаблон = смартШаблоныПечатныхФормСервер.ПолучитьШаблонПечатиПоИдентификаторуПечатнойФормы(ПараметрыПечати.Идентификатор);
		
		Если Шаблон <> Неопределено Тогда
			
			//Проверка условия печати
			Если смартШаблоныПечатныхФормСервер.ПроверитьУсловиеПечатиШаблона(ОбъектПечати, Шаблон) Тогда
				
				//Печать
				НапечататьОбъектПоШаблону(ОбъектПечати, Шаблон);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 

КонецФункции

//Формирует печатную форму по шаблону и открывает ее на экране
Процедура НапечататьОбъектПоШаблону(ОбъектПечати, Шаблон) Экспорт

	ОписаниеОшибки = "";
	
	Каталог = КаталогВременныхФайлов();
	
	ПечатнаяФорма = смартШаблоныПечатныхФормСервер.СформироватьПечатнуюФормуПоШаблону(ОбъектПечати, Шаблон);
	
	Если ТипЗнч(ПечатнаяФорма) = Тип("ТабличныйДокумент") Тогда
	
		ПечатнаяФорма.Показать();

	Иначе

		ДанныеФайла = ПолучитьИзВременногоХранилища(ПечатнаяФорма);

		ИмяФайла = СокрЛП(Шаблон) + ".docx";
		ПолныйПутьКФайлу = Каталог + ИмяФайла;    
		
		Попытка
			ДанныеФайла.Записать(ПолныйПутьКФайлу);
		Исключение
		КонецПопытки;

		ЗапуститьПриложение(ПолныйПутьКФайлу);
		
	КонецЕсли;
		
КонецПроцедуры

