#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер", Ложь);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер2", Ложь);
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийСтатус", Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПустаяСсылка());
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартСсылкаПроведен", Ложь);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер", Истина);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер2", Истина);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер", Справочники.Пользователи.ПустаяСсылка());
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер2", Справочники.Пользователи.ПустаяСсылка());
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийСтатус", Ссылка.Статус);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("смартСсылкаПроведен", Ссылка.Проведен);
		
		Если НазначенныйНаРемонтИнженер <> Ссылка.НазначенныйНаРемонтИнженер Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер", Истина);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер", Ссылка.НазначенныйНаРемонтИнженер);
		КонецЕсли;
		
		Если НазначенныйНаРемонтИнженер2 <> Ссылка.НазначенныйНаРемонтИнженер2 Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартИзменилсяИнженер2", Истина);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("смартПредыдущийИнженер2", Ссылка.НазначенныйНаРемонтИнженер2);
		КонецЕсли;

	КонецЕсли;
	
	//rnp 22.04.2021 для заявок, созданных вручную, нужна своя нумерация
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И Не ЗначениеЗаполнено(ЭтотОбъект.Номер) Тогда
		УстановитьНовыйНомер("Рем"); 
	КонецЕсли;
	
	//++ #1887 смарт: Мосолов 03.07.2024 //Доработать документы сервисного центра. Затраченное время.
	Если Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен
		ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПовторныйВыезд Тогда
	
		ДатаНачалаОтраженияВремени = Справочники.смартПредопределенныеЗначения.ДатаНачалаОтраженияЗатраченногоИнженерамиВремени.Значение;
					
		Если ЗначениеЗаполнено(ДатаНачалаОтраженияВремени) 
			И ДатаНачалаОтраженияВремени <= Дата Тогда
			
			Если (ЗначениеЗаполнено(НазначенныйНаРемонтИнженер) И ЗатраченоЧасов = 0)
				ИЛИ (ЗначениеЗаполнено(НазначенныйНаРемонтИнженер2) И ЗатраченоЧасов2 = 0) Тогда
				
				ВызватьИсключение НСтр("ru = 'Укажите затраченное инженерами время!'");
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	//-- #1887 смарт: Мосолов 03.07.2024
	
	//++ #Б-3532 смарт: Фролов 16.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗРР и ЗНП
	Если Командировка <> Ссылка.Командировка
		ИЛИ Командировка2 <> Ссылка.Командировка2 Тогда
		
		ДополнительныеСвойства.Вставить("ТребуетсяОформлениеКомандировки", Истина);
		
	КонецЕсли;
	//-- #Б-3532 смарт: Фролов 16.06.2025
	
	//++ #Б-3532 смарт: Фролов 19.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗРР и ЗНП
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ПредыдущийВидГарантии", Ссылка.ВидГарантии); 
	//-- #Б-3532 смарт: Фролов 18.06.2025
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	СтатусИзменился = Ложь; //rnp 614 27.08.2021
	Если ДополнительныеСвойства.Свойство("смартПредыдущийСтатус") = Истина 
				И (ДополнительныеСвойства.смартПредыдущийСтатус <> Статус) Тогда
		
		МассивСообщений = Новый Массив;
		Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеВЗависимостиОтСтатуса(Ссылка, МассивСообщений, Истина);
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
		СтатусИзменился = Истина; //rnp 614 27.08.2021
	КонецЕсли;
	
	//++ #Б-4738 смарт: Фролов 16.10.2025 //Создание отчета по эффективности обработки заявок СЦ.
	Если НЕ ДополнительныеСвойства.смартПредыдущийСтатус = Статус Тогда
		
		//++ #Б-5028 смарт: Фролов 24.11.2025 //Доработка документа Заявка на ремонтные работы, по новому регламенту
		Если ДополнительныеСвойства.Свойство("КомментарийЭтапа") Тогда
			
			КомментарийЭтапа = ДополнительныеСвойства.КомментарийЭтапа;
			
		Иначе
			
			КомментарийЭтапа = "";
			
		КонецЕсли;	
		
		Если ДополнительныеСвойства.Свойство("ТекущийЭтап") Тогда
			
			//СмартСервер.ЗафиксироватьИзменениеСтатусаЗаявокНаРемонтныеРаботыИПНР(Ссылка, ДополнительныеСвойства.смартПредыдущийСтатус, Статус);
			СмартСервер.ЗафиксироватьИзменениеСтатусаЗаявокНаРемонтныеРаботыИПНР(Ссылка, ДополнительныеСвойства.смартПредыдущийСтатус, 
				Статус, ДополнительныеСвойства.ТекущийЭтап, КомментарийЭтапа);
			//-- #Б-5028 смарт: Фролов 24.11.2025
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-4738 смарт: Фролов 16.10.2025
	
	ИнженерИзменился = Ложь;//rnp 614 27.08.2021
	Если ДополнительныеСвойства.Свойство("смартИзменилсяИнженер") = Истина
		И ДополнительныеСвойства.смартИзменилсяИнженер = Истина Тогда
		
		МассивСообщений = Новый Массив;
		
		Если ЗначениеЗаполнено(НазначенныйНаРемонтИнженер) Тогда
			//++ смарт:ММ 615 18.09.2021 СМС инженеру 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, НазначенныйНаРемонтИнженер, "Назначение", МассивСообщений, Истина);	
			//++ смарт:ММ 660 05.10.2021 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, НазначенныйНаРемонтИнженер, "Назначение", МассивСообщений, Истина, Истина);	
			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаРемонтаС", 	НазначеннаяДатаРемонтаС);
			Параметры.Вставить("НазначеннаяДатаРемонтаПо", 	НазначеннаяДатаРемонтаПо);
			Параметры.Вставить("Пользователь", 		НазначенныйНаРемонтИнженер);
			Параметры.Вставить("ВидУведомления", 	"Назначение");
			Параметры.Вставить("Ссылка", 			Ссылка);

			Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);	
			//-- смарт:ММ 05.10.2021
			//-- смарт:ММ 18.09.2021
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("смартПредыдущийИнженер") = Истина
			И ЗначениеЗаполнено(ДополнительныеСвойства.смартПредыдущийИнженер) Тогда
			//++ смарт:ММ 615 18.09.2021 СМС инженеру 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, ДополнительныеСвойства.смартПредыдущийИнженер, "Отмена", МассивСообщений, Истина);
			//++ смарт:ММ 660 05.10.2021 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, ДополнительныеСвойства.смартПредыдущийИнженер, "Отмена", МассивСообщений, Истина, Истина);
			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаРемонтаС", 	НазначеннаяДатаРемонтаС);
			Параметры.Вставить("НазначеннаяДатаРемонтаПо", 	НазначеннаяДатаРемонтаПо);
			Параметры.Вставить("Пользователь", 		ДополнительныеСвойства.смартПредыдущийИнженер);
			Параметры.Вставить("ВидУведомления",	"Отмена");
			Параметры.Вставить("Ссылка", 			Ссылка);

			Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);
			//-- смарт:ММ 05.10.2021
			//-- смарт:ММ 18.09.2021
		КонецЕсли;
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
		ИнженерИзменился = Истина;//rnp 614 27.08.2021
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("смартИзменилсяИнженер2") = Истина
		И ДополнительныеСвойства.смартИзменилсяИнженер2 = Истина Тогда
		
		МассивСообщений = Новый Массив;
		
		Если ЗначениеЗаполнено(НазначенныйНаРемонтИнженер2) Тогда
			//++ смарт:ММ 615 17.09.2021 СМС инженеру 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, НазначенныйНаРемонтИнженер2, "Назначение", МассивСообщений, Истина);	
			//++ смарт:ММ 660 05.10.2021 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, НазначенныйНаРемонтИнженер2, "Назначение", МассивСообщений, Истина, Истина);	
			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаРемонтаС", 	НазначеннаяДатаРемонтаС2);
			Параметры.Вставить("НазначеннаяДатаРемонтаПо", 	НазначеннаяДатаРемонтаПо2);
			Параметры.Вставить("Пользователь", 		НазначенныйНаРемонтИнженер2);
			Параметры.Вставить("ВидУведомления",	"Назначение");
			Параметры.Вставить("Ссылка", 			Ссылка);
			
			Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);	
			//-- смарт:ММ 05.10.2021
			//-- смарт:ММ 17.09.2021
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("смартПредыдущийИнженер2") = Истина
			И ЗначениеЗаполнено(ДополнительныеСвойства.смартПредыдущийИнженер2) Тогда
			
			//++ смарт:ММ 615 17.09.2021 СМС инженеру 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, ДополнительныеСвойства.смартПредыдущийИнженер2, "Отмена", МассивСообщений, Истина);
			//++ смарт:ММ 660 05.10.2021 
			//Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Ссылка, ДополнительныеСвойства.смартПредыдущийИнженер2, "Отмена", МассивСообщений, Истина, Истина);
			Параметры = Новый Структура;
			Параметры.Вставить("НазначеннаяДатаРемонтаС", 	НазначеннаяДатаРемонтаС2);
			Параметры.Вставить("НазначеннаяДатаРемонтаПо", 	НазначеннаяДатаРемонтаПо2);
			Параметры.Вставить("Пользователь", 		ДополнительныеСвойства.смартПредыдущийИнженер2);
			Параметры.Вставить("ВидУведомления",	"Отмена");
			Параметры.Вставить("Ссылка", 			Ссылка);
			
			Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеИнженеру(Параметры, МассивСообщений, Истина, Истина);
			//-- смарт:ММ 05.10.2021
			//-- смарт:ММ 18.09.2021
		КонецЕсли;
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
		ИнженерИзменился = Истина;//rnp 614 27.08.2021
	КонецЕсли;
	//rnp 614 27.08.2021
	Если Не СтатусИзменился и ИнженерИзменился Тогда
		 МассивСообщений = Новый Массив;
		Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеВЗависимостиОтСтатуса(Ссылка, МассивСообщений, Истина, "Для выполнения работ по вашей заявке № "+ Номер +" изменен назначенный инженер. ");
		
		Для Каждого Сообщение Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		КонецЦикла;
	КонецЕсли;
	
	//++ #Б-3532 смарт: Фролов 09.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗРР и ЗНП
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_Интерес.Дата КАК Дата,
	|	CRM_Интерес.Номер КАК Номер,
	|	CRM_Интерес.Тема КАК Тема,
	|	CRM_Интерес.Партнер КАК Партнер,
	|	CRM_Интерес.Ответственный КАК Ответственный,
	|	CRM_Интерес.Подразделение КАК Подразделение,
	|	CRM_Интерес.Организация КАК Организация,
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ИСТИНА КАК ВведенНаОсновании,
	|	ЛОЖЬ КАК ОсновнойИнтерес,
	|	CRM_Интерес.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	НЕ CRM_Интерес.ПометкаУдаления
	|	И CRM_Интерес.ДокументОснование = &ЗРР");
	Запрос.УстановитьПараметр("ЗРР", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		
		ОбИнтерес = Результат[0].Ссылка.ПолучитьОбъект();
		
		ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов", Результат);
		
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Тогда
		
		//++ #Б-4358 смарт: Фролов 16.09.2025 //Отключение автоматического создание Интересов из заявок (ЗРР, ЗПНР)
		//ОбИнтерес = Документы.CRM_Интерес.СоздатьДокумент();	
		//ОбИнтерес.Дата = ТекущаяДата();
		//ОбИнтерес.ДокументОснование = Ссылка;
		//ОбИнтерес.КонтактноеЛицо = ?(КонтактныеЛица.Количество() > 0, КонтактныеЛица[0].КонтактноеЛицо, Неопределено);
		//ОбИнтерес.смартИнтересКанал = Справочники.смартПредопределенныеЗначения.Настройки.КаналДляРемонтныхРабот;
		//ОбИнтерес.смартИнтересИсточник = Справочники.смартПредопределенныеЗначения.Настройки.ИсточникДляРемонтныхРабот;
		//ОбИнтерес.ЦенаВключаетНДС = Истина;
		//ОбИнтерес.Партнер = Ссылка.Партнер;
		//ОбИнтерес.РучнойВводДатыПродажи = Истина;

		//Если ВидГарантии = Перечисления.смартВидыГарантии.Гарантия Тогда
		//	ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.РемонтГарантийный;
		//Иначе	
		//	ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.РемонтПлатный;
		//КонецЕсли;
		//
		//ОбИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		//ОбИнтерес.смартВоронкаНовые = Истина;
		//ОбИнтерес.Тема = ОписаниеНеисправности;
		//ОбИнтерес.Организация = Ссылка.Организация;
		//ОбИнтерес.СостояниеИнтереса = Справочники.смартПредопределенныеЗначения.Настройки.СтартовыйЭтапИнтересаПоЗРР;
		//
		//Если ЗначениеЗаполнено(Ссылка.Ответственный) Тогда
		//	
		//	ОбИнтерес.Ответственный = Ссылка.Ответственный;
		//	ОбИнтерес.Подразделение = Ссылка.Ответственный.Подразделение;
		//	ОбИнтерес.Офис = Ссылка.Ответственный.Подразделение.CRM_офис;
		//	
		//КонецЕсли;
		//
		//ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
		//-- #Б-4358 смарт: Фролов 16.09.2025
		
	ИначеЕсли ТипЗнч(ОбИнтерес) = Тип("ДокументОбъект.CRM_Интерес") Тогда
		
		НужноЗаписатьИнтерес = Ложь;
		
		Если НЕ Ссылка.Ответственный = ОбИнтерес.Ответственный Тогда
			
			ОбИнтерес.Ответственный = Ссылка.Ответственный;
			ОбИнтерес.Подразделение = Ссылка.Ответственный.Подразделение;
			ОбИнтерес.Офис = Ссылка.Ответственный.Подразделение.CRM_офис;
			
			НужноЗаписатьИнтерес = Истина;
			
		КонецЕсли;
		
		Если НЕ ВидГарантии = ДополнительныеСвойства.ПредыдущийВидГарантии Тогда
			
			Если ВидГарантии = Перечисления.смартВидыГарантии.Гарантия Тогда
				ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.РемонтГарантийный;
			Иначе	
				ОбИнтерес.ТипУслуги = Справочники.CRM_ТипУслуги.РемонтПлатный;
			КонецЕсли;
			
			НужноЗаписатьИнтерес = Истина;
			
		КонецЕсли;
		
		Если НЕ Статус = ДополнительныеСвойства.смартПредыдущийСтатус Тогда
			
			Если Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен Тогда
				
				ОбИнтерес.смартВариантУспешногоЗавершения = Справочники.смартВариантыУспешногоЗавершенияИнтереса.РемонтЗавершен;
				НужноЗаписатьИнтерес = Истина;
				
			ИначеЕсли Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтОсуществленПоТелефону Тогда
				
				ОбИнтерес.смартВариантУспешногоЗавершения = Справочники.смартВариантыУспешногоЗавершенияИнтереса.РемонтОсуществленПоТелефону;
				НужноЗаписатьИнтерес = Истина;
				
			КонецЕсли;	
		
		КонецЕсли;
		
		Если НужноЗаписатьИнтерес Тогда
			
			ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ТребуетсяОформлениеКомандировки") И ЗначениеЗаполнено(Представительство) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			//++ #Б-3668 смарт: Фролов 01.07.2025 //Ошибка. Неверная адресация задач по оформлению командировок.
			//Временно отключена постановка задач в регионы
			Если Представительство = Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение Тогда
				
				РольИсполнителя = Справочники.РолиИсполнителей.ОформлениеКомандировокГоловнойОфис;
				
				//Иначе	
				//	
				//	РольИсполнителя = Представительство.смартИсполнительОтПодразделения; 
				
				//КонецЕсли;
				
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	Исполнитель КАК Исполнитель
				|ИЗ
				|	РегистрСведений.ИсполнителиЗадач
				|ГДЕ
				|	РольИсполнителя = &РольИсполнителя");
				Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителя);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
					ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
					ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
					ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.ОформлениеКомандировки;
					ЗадачаОбъект.CRM_Личная = Истина;
					
					ЗадачаОбъект.Исполнитель = Выборка.Исполнитель;
					
					ЗадачаОбъект.Предмет = Ссылка;
					
					ЗадачаОбъект.Описание = "Необходимо оформить командировку по заявке на ремонтные работы " + Ссылка;
					ЗадачаОбъект.Наименование = "Необходимо оформить командировку по заявке на ремонтные работы";
					ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
					ЗадачаОбъект.СрокИсполнения = ЗадачаОбъект.Дата + 86400;
					ЗадачаОбъект.Записать();
					
				КонецЦикла;
				
			КонецЕсли;
			//-- #Б-3668 смарт: Фролов 01.07.2025
			
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-3532 смарт: Фролов 09.06.2025
	
	//++ #6302 смарт: Тимофеева 17.04.2026 / Создать оповещение о незаконченной заявке на гарантийный ремонт
	Если НЕ ДополнительныеСвойства.смартПредыдущийСтатус = Статус 
		И Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен Тогда 	
		ДатаЗавершенияРемонта = ТекущаяДатаСеанса();	
	КонецЕсли;
	//-- #6302 смарт: Тимофеева 17.04.2026
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Если ДополнительныеСвойства.Свойство("смартПредыдущийСтатус") = Истина 
	//			И (ДополнительныеСвойства.смартПредыдущийСтатус <> Статус
	//					ИЛИ (ДополнительныеСвойства.Свойство("смартСсылкаПроведен") = Истина
	//					И ДополнительныеСвойства.смартСсылкаПроведен = Ложь)) Тогда
	//	
	//	МассивСообщений = Новый Массив;
	//	Документы.смартЗаявкаНаРемонтныеРаботы.ОтправитьУведомлениеВЗависимостиОтСтатуса(Ссылка, МассивСообщений);
	//	
	//	Для Каждого Сообщение Из МассивСообщений Цикл
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	//	КонецЦикла;

	//	//	Если Статус = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ОтправленаВПредставительство Тогда
	////		
	////		// Уведомление руководителю подразделения (представительства)
	////		Успех = ОтправитьУведомление("ПроведениеСоСтатусомОтправленаВПредставительство");
	////		
	////	КонецЕсли;
	////	
	////КонецЕсли;
	////
	////Если НЕ УведомлениеОтправлено Тогда
	////	Успех = ОтправитьУведомление("Проведение");
	////	Если Успех Тогда
	////		// Повторная запись объекта для изменения реквизита
	////		УведомлениеОтправлено = Истина;
	////		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
	////		ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	////	КонецЕсли;
	//КонецЕсли;
	
	//++ #1366 смарт: Фролов 02.06.2023 //Отслеживать появление на складах запчастей, требуемых для выполнения заявок со статусом  
	Движения.смартОжидаемыеЗапчасти.Записывать = Истина;
	Если Статус=Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ЖдемЗапчасти ТОгда 
		ТабОжидаемыеЗапчасти=ОжидаемыеЗапчасти.Выгрузить(); 
		ТабОжидаемыеЗапчасти.Свернуть("Номенклатура,Сотрудник","Количество");
		Для Каждого ТекСтрока Из ОжидаемыеЗапчасти Цикл
			Движение = Движения.смартОжидаемыеЗапчасти.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрока.Номенклатура; 
			Движение.Сотрудник = ТекСтрока.Сотрудник; 
			Движение.Организация = Организация;
			Движение.Партнер = Партнер;
			Движение.ВидГарантии = ВидГарантии;
			Движение.Количество = ТекСтрока.Количество;
		КонецЦикла;
	КонецЕсли;
    //-- #1366 смарт: Фролов 02.06.2023
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Если НЕ ПометкаУдаления Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка не отменена. Для отмены пометьте заявку на удаление");	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		НезаполняемыеСвойства = "Дата, Номер, ПервичнаяЗаявка, НазначеннаяДатаРемонтаС, НазначеннаяДатаРемонтаПо, Командировка, НазначенныйНаРемонтИнженер, НазначенныйНаРемонтИнженер2, Статус,НазначеннаяДатаРемонтаС2, НазначеннаяДатаРемонтаПо2";
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , НезаполняемыеСвойства);
		ПервичнаяЗаявка = ДанныеЗаполнения;
		Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПовторныйВыезд;
		
		Для Каждого Строка Из ДанныеЗаполнения.КонтактныеЛица Цикл
			НоваяСтрока = КонтактныеЛица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
		
		Для Каждого Строка Из ДанныеЗаполнения.Оборудование Цикл
			НоваяСтрока = Оборудование.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;

		//++ #Б-2908 смарт: Лопато 01.04.2025 //Ошибка ТГ Бота. При копировании заявки на ремонтные работы не очищаются реквизиты.  
		ОчиститьРеквизитыЗаполняемыеИнженером(ЭтотОбъект);
		//-- #Б-2908 смарт: Лопато 01.04.2025
		
	//++ смарт:ММ 596 30.08.2021
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда
		
		ДокументОснование 	= ДанныеЗаполнения;
		Статус 				= Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.НоваяЗаявка;
		Партнер 			= ДанныеЗаполнения.Клиент;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		
		ЗаявкаНаПНР = ДанныеЗаполнения.ДокументОснование;
		
		Если ЗначениеЗаполнено(ЗаявкаНаПНР) Тогда
			
			Организация = ЗаявкаНаПНР.Организация;
			АдресВыезда = ЗаявкаНаПНР.АдресВыезда;
			АдресВыездаЗначение 		= ЗаявкаНаПНР.АдресВыездаЗначение;
			АдресВыездаЗначенияПолей 	= ЗаявкаНаПНР.АдресВыездаЗначенияПолей;
			Представительство = ЗаявкаНаПНР.Представительство;
			ПостроениеЦветовыхПрофилей = ЗаявкаНаПНР.ПостроениеЦветовыхПрофилей;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ОборудованиеКлиентов", ДанныеЗаполнения.Оборудование);
			Отбор.Вставить("Серия", ДанныеЗаполнения.Серия);
			НайденныеСтроки = ЗаявкаНаПНР.Оборудование.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				СтрокаОборудование = Оборудование.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОборудование, НайденнаяСтрока);
			КонецЕсли;
			
			Для Каждого СтрокаКЛ Из ЗаявкаНаПНР.КонтактныеЛица Цикл
				СтрокаКонтактноеЛицо = КонтактныеЛица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаКонтактноеЛицо, СтрокаКЛ);
			КонецЦикла;
			
		Иначе
			НоваяСтрокаОборудование = Оборудование.Добавить();
			НоваяСтрокаОборудование.ОборудованиеКлиентов = ДанныеЗаполнения.Оборудование;
			НоваяСтрокаОборудование.Серия = ДанныеЗаполнения.Серия;			
		КонецЕсли;
		
		//++ #1940 смарт: Мосолов 18.09.2024 //Изменения статусов в Заявках на ремонт Представительствами. 
		Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПолученаВРаботу;  
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Подразделение) Тогда  
			Представительство = ДанныеЗаполнения.Подразделение;
		Иначе
			Представительство = Партнер.смартОсновнойМенеджерСервисЦентра;
		КонецЕсли;
		//-- #1940 смарт: Мосолов 18.09.2024  
		
	//-- смарт:ММ 30.08.2021
	//++ #1259 смарт: Фролов 29.11.2022 //Заявка на ПНР и ремонтные работы (смарт) - доработка форм заявок  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку") Тогда	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		ДокументОснование 	= ДанныеЗаполнения;
		Дата=ТекущаяДатаСеанса();
		УстановитьНовыйНомер("ПНР");
		ВидГарантии=Перечисления.смартВидыГарантии.Гарантия;
		Для Каждого СтрокаКЛ Из ДанныеЗаполнения.КонтактныеЛица Цикл
			СтрокаКонтактноеЛицо = КонтактныеЛица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКонтактноеЛицо, СтрокаКЛ);
		КонецЦикла; 
		Для Каждого СтрокаОб Из ДанныеЗаполнения.Оборудование Цикл
			СтрокаОборудование = Оборудование.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОборудование, СтрокаОб);
		КонецЦикла;
	//-- #1259 смарт: Фролов 29.11.2022
	//++ #1259 смарт: Фролов 08.12.2022 //Дополнение  
		КомментарийМенеджера="";
		ДокументыОтКлиента="";
		ДанныеИзПисьмаОснования="";
		КтоОплачиваетВыездСИ="";
		ПереченьНеобходимыхРабот="";
		ПостроениеЦветовыхПрофилей=0;
	//-- #1259 смарт: Фролов 08.12.2022
	// ++ 28.02.2021    
	
		//++ #1940 смарт: Мосолов 18.09.2024 //Изменения статусов в Заявках на ремонт Представительствами. 
		Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПолученаВРаботу;  
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Представительство) Тогда  
			Представительство = ДанныеЗаполнения.Представительство;
		Иначе
			Представительство = ДанныеЗаполнения.Партнер.смартОсновнойМенеджерСервисЦентра;
		КонецЕсли;
		//-- #1940 смарт: Мосолов 18.09.2024  
		
		//++ #Б-2908 смарт: Лопато 01.04.2025 //Ошибка ТГ Бота. При копировании заявки на ремонтные работы не очищаются реквизиты.  
		ОчиститьРеквизитыЗаполняемыеИнженером(ЭтотОбъект);
		//-- #Б-2908 смарт: Лопато 01.04.2025
		
	//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ДокументОснование 	= ДанныеЗаполнения;
		Партнер 			= ДанныеЗаполнения.Партнер;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		Организация 		= ДанныеЗаполнения.Организация;   
	//-- #1646 смарт: Мосолов 20.02.2024 	
	
	//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
	//-- #1989 смарт: Лопато 15.08.2024
	
	Иначе
		ВидГарантии = Перечисления.смартВидыГарантии.Платная;
	// --
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УведомлениеОтправлено = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//ДокументОснование = Неопределено;
	Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПустаяСсылка();
	НазначенныйНаРемонтИнженер = Неопределено;
	НазначенныйНаРемонтИнженер2 = Неопределено;
	ЖелаемаяДатаРемонта = Неопределено;
	Командировка = Ложь;
	НазначеннаяДатаРемонтаС = Неопределено;
	НазначеннаяДатаРемонтаПо = Неопределено;

	//++ #Б-2908 смарт: Лопато 01.04.2025 //Ошибка ТГ Бота. При копировании заявки на ремонтные работы не очищаются реквизиты.  
	ОчиститьРеквизитыЗаполняемыеИнженером(ЭтотОбъект);
	//-- #Б-2908 смарт: Лопато 01.04.2025
	
КонецПроцедуры

//++ #Б-2908 смарт: Лопато 01.04.2025 //Ошибка ТГ Бота. При копировании заявки на ремонтные работы не очищаются реквизиты.  
Процедура ОчиститьРеквизитыЗаполняемыеИнженером(ДокОбъект)

	ДокОбъект.СостояниеЗаявки = Неопределено;
	ДокОбъект.НеобходимыеЗапчасти = "";
	ДокОбъект.ЗаключениеОВыезде = "";
	ДокОбъект.РезультатОтправлен = Ложь;
	ДокОбъект.РТО = Ложь;
	ДокОбъект.ОСКлиента = Неопределено;
	ДокОбъект.ЗаключениеИнженераОВозможностиДопГарантии = Неопределено;
	ДокОбъект.КомментарийОВозможномПредоставленииДопГарантии = "";
	ДокОбъект.ПричиныВыездаСервисногоИнженера.Очистить();

КонецПроцедуры //-- #Б-2908 смарт: Лопато 01.04.2025

//////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьРеквизитыПоКонтрагенту() Экспорт
	
	АдресВыезда = "";
	АдресВыездаЗначенияПолей = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияАдрес.Представление, """") КАК АдресВыезда,
	|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияАдрес.ЗначенияПолей, """") КАК АдресВыездаЗначенияПолей
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияАдрес
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформацияАдрес.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформацияАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтрагентыКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		АдресВыезда = Выборка.АдресВыезда;
		АдресВыездаЗначенияПолей = Выборка.АдресВыездаЗначенияПолей;
	КонецЕсли;

КонецПроцедуры

Функция ОтправитьУведомление(ВидУведомления)
	
	//МассивСообщений = Новый Массив;
	//Успех = Документы.смартЗаявкаНаПускоНаладку.ОтправитьПисьма(Ссылка, ВидУведомления, МассивСообщений);
	//
	//Для Каждого Сообщение Из МассивСообщений Цикл
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	//КонецЦикла;
	//
	//Возврат Успех;
	
КонецФункции

Функция ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо) Экспорт
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("Телефон", "");
	СтруктураВозврат.Вставить("ЭлПочта", "");
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Телефон.Представление КАК Телефон,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыТелефонов
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Телефон
	|ГДЕ
	|	Телефон.Ссылка = &КонтактноеЛицо
	|	И Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Мобильный.Представление,
	|	2
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК Мобильный
	|ГДЕ
	|	Мобильный.Ссылка = &КонтактноеЛицо
	|	И Мобильный.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Мобильный.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ПриоритетыТелефонов.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныйПриоритет
	|ИЗ
	|	ВТ_ПриоритетыТелефонов КАК ВТ_ПриоритетыТелефонов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ПриоритетыТелефонов.Телефон КАК Телефон
	|ПОМЕСТИТЬ ВТ_Телефон
	|ИЗ
	|	ВТ_МинимальныйПриоритет КАК ВТ_МинимальныйПриоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыТелефонов КАК ВТ_ПриоритетыТелефонов
	|		ПО ВТ_МинимальныйПриоритет.Приоритет = ВТ_ПриоритетыТелефонов.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЭлАдрес.Представление) КАК ЭлПочта
	|ПОМЕСТИТЬ ВТ_ЭлПочта
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ЭлАдрес
	|ГДЕ
	|	ЭлАдрес.Ссылка = &КонтактноеЛицо
	|	И ЭлАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ЭлАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Телефон.Телефон, """") КАК Телефон,
	|	ЕСТЬNULL(ВТ_ЭлПочта.ЭлПочта, """") КАК ЭлПочта
	|ИЗ
	|	ВТ_Телефон КАК ВТ_Телефон
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЭлПочта КАК ВТ_ЭлПочта
	|		ПО (ИСТИНА)";
		
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураВозврат.Телефон = Выборка.Телефон;
		СтруктураВозврат.ЭлПочта = Выборка.ЭлПочта;
		
	КонецЕсли;

	Возврат СтруктураВозврат;
	
КонецФункции

Функция ЭтоПлоттер(Оборудование) 
	//
	//ТоварыПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	//
	//Возврат Оборудование.ВидНоменклатуры = ТоварыПлоттерыСерии;
	
КонецФункции

Функция ПолучитьТекстЗапросаОборудованиеИзЗаказаКлиента() Экспорт
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	//|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	////++ смарт:ММ 04.10.2020
	//|	ЗаказКлиентаТовары.Серия КАК Серия,
	////-- смарт:ММ 04.10.2020
	//|	ЕСТЬNULL(РасходныйОрдерНаТовары.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтгрузки
	//|ИЗ
	//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	//|			ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТовары.Ссылка
	//|		ПО ЗаказКлиентаТовары.Ссылка = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	//|			И ЗаказКлиентаТовары.Номенклатура = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураСпр.Ссылка
	//|ГДЕ
	//|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	//|	И ВЫБОР
	//|			КОГДА &ОтборНоменклатура
	//|				ТОГДА НоменклатураСпр.Ссылка = &Номенклатура
	//|			ИНАЧЕ НоменклатураСпр.ВидНоменклатуры = &ТоварПлоттерыСерии
	//|		КОНЕЦ";
	//
	//Возврат ТекстЗапроса;
	
КонецФункции

//rnp 22.04.2021 закоментированно, используется функция ПолучитьДанныеПоСерии по аналогии с заявкой на гарантийный ремонт

// ++ 10.02.2021
//Функция ПодобратьОборудованиеКлиентов(ОборудованиеКлиента, Серия = Неопределено) Экспорт
//	
//	Если НЕ ЗначениеЗаполнено(ОборудованиеКлиента) Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	Номенклатура.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.Номенклатура КАК Номенклатура
//	|ГДЕ
//	|	Номенклатура.смартСоответствиеСОбрудованиемИЧерниламиКлиентов = &смартСоответствиеСОбрудованиемИЧерниламиКлиентов
//	|	И НЕ Номенклатура.ПометкаУдаления";
//	
//	Запрос.УстановитьПараметр("смартСоответствиеСОбрудованиемИЧерниламиКлиентов", ОборудованиеКлиента);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Если Выборка.Количество() = 1 Тогда
//		Выборка.Следующий();
//		Возврат Выборка.Ссылка;
//	Иначе
//		// Доп. поиск по серии
//		МассивНоменклатуры = Новый Массив;
//		Пока Выборка.Следующий() Цикл
//			МассивНоменклатуры.Добавить(Выборка.Ссылка);
//		КонецЦикла;
//		
//		Возврат ПолучитьОборудованиеПоСерии(МассивНоменклатуры, Серия);
//	КонецЕсли;
//	
//КонецФункции // --

// ++ 10.02.2021
//Функция ПолучитьОборудованиеПоСерии(МассивНоменклатуры, мСерия)
//	
//	Если НЕ ЗначениеЗаполнено(мСерия) 
//		ИЛИ МассивНоменклатуры.Количество() = 0 Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//		
//	ТекстЗапроса =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
//	|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура
//	|ИЗ
//	|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
//	|ГДЕ
//	|	ДвиженияСерийТоваров.Серия = &Серия
//	|	И ДвиженияСерийТоваров.Номенклатура В (&МассивНоменклатуры)
//	|	И ВЫБОР
//	|			КОГДА ДвиженияСерийТоваров.Получатель ССЫЛКА Справочник.Склады
//	|				ТОГДА ИСТИНА
//	|			КОГДА ДвиженияСерийТоваров.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ДвиженияСерийТоваров.Период УБЫВ";
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//		
//	Запрос.УстановитьПараметр("Серия", мСерия);
//	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
//	
//	Результат = Запрос.Выполнить();
//	
//	Если Результат.Пустой() Тогда		
//		Возврат Неопределено;		
//	КонецЕсли;
//	
//	Выборка = Результат.Выбрать();
//	Выборка.Следующий();
//	
//	Возврат Выборка.Номенклатура;
//			
//КонецФункции

// ++ 10.02.2021
Функция ПолучитьДанныеСтрокиПоУмолчанию(ТекОборудование) Экспорт
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ГарантийныйСрокНаОборудование", "");
	СтруктураВозврат.Вставить("ГарантийныйСрокНаПечатающиеГоловки", "");
	СтруктураВозврат.Вставить("РастровыйПроцессор", "");
	СтруктураВозврат.Вставить("ДатаОтгрузки", "");
	
	Если НЕ ЗначениеЗаполнено(ТекОборудование) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	//Об = РеквизитФормыВЗначение("Объект");
	
	//ЗапросОборудование = Новый Запрос;
	//ЗапросОборудование.Текст = Об.ПолучитьТекстЗапросаОборудованиеИзЗаказаКлиента();
	//ЗапросОборудование.УстановитьПараметр("ТоварПлоттерыСерии", Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение);
	////ЗапросОборудование.УстановитьПараметр("ЗаказКлиента", Объект.ДокументОснование);
	//ЗапросОборудование.УстановитьПараметр("ОтборНоменклатура", Истина);
	//ЗапросОборудование.УстановитьПараметр("Номенклатура", ТекОборудование);
	//
	//Выборка = ЗапросОборудование.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда // Если несколько отгрузок по выбранной номенклатуре, то выбирается первая попавшаяся
	//	
	//	СтруктураВозврат.Вставить("ДатаОтгрузки", Выборка.ДатаОтгрузки);
	//	
	//КонецЕсли;

	Если НЕ смартОбщегоНазначения.ЭтоПлоттер(ТекОборудование) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	//++ #Б-2768 смарт: Лопато 21.03.2025 //Заполнение корректного срока гарантии на оборудование и ПГ при формировании ПНР.  
	СтруктураГарантияНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекОборудование, "смартГарантияНаОборудование, смартГарантияНаПечатающиеГоловки");
	
	СтруктураВозврат.Вставить("ГарантийныйСрокНаОборудование", ?(ЗначениеЗаполнено(СтруктураГарантияНоменклатуры.смартГарантияНаОборудование), 
																 СтруктураГарантияНоменклатуры.смартГарантияНаОборудование, 
																 Справочники.смартПредопределенныеЗначения.ГарантийныйСрокНаОборудованиеПоУмолчанию.Значение));

	СтруктураВозврат.Вставить("ГарантийныйСрокНаПечатающиеГоловки", ?(ЗначениеЗаполнено(СтруктураГарантияНоменклатуры.смартГарантияНаПечатающиеГоловки), 
																	  СтруктураГарантияНоменклатуры.смартГарантияНаПечатающиеГоловки, 
																	  Справочники.смартПредопределенныеЗначения.ГарантийныйСрокНаПечатающиеГоловкиПоУмолчанию.Значение));
	//-- #Б-2768 смарт: Лопато 21.03.2025
	
	СтруктураВозврат.Вставить("РастровыйПроцессор", Справочники.смартПредопределенныеЗначения.РастровыйПроцессорПоУмолчанию.Значение);
	
	Возврат СтруктураВозврат;
	
КонецФункции

//rnp 22.04.2021 добавлено из заявки на гарантийный ремонт
Функция ПолучитьДанныеПоСерии(мСерия) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	СтруктураВозврата.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураВозврата.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
	СтруктураВозврата.Вставить("ДатаОтгрузки", Неопределено);
	СтруктураВозврата.Вставить("смартСоответствиеСОбрудованиемИЧерниламиКлиентов", Справочники.смартОборудованиеКлиентов.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(мСерия) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ТекстЗапроса =	
	//++ #1305 смарт: Фролов 16.02.2023 //Отчет Стоимость использования оборудования  
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	//|	ДвиженияСерийТоваров.Номенклатура.смартСоответствиеСОбрудованиемИЧерниламиКлиентов КАК смартСоответствиеСОбрудованиемИЧерниламиКлиентов,
	//|	ВЫБОР
	//|		КОГДА ДвиженияСерийТоваров.Получатель ССЫЛКА Справочник.Партнеры
	//|			ТОГДА ДвиженияСерийТоваров.Получатель
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	//|	КОНЕЦ КАК Партнер,
	//|	ВЫБОР
	//|		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	//|			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Контрагент
	//|		ИНАЧЕ ДвиженияСерийТоваров.Получатель
	//|	КОНЕЦ КАК Контрагент,
	//|	ДвиженияСерийТоваров.Период КАК ДатаОтгрузки,
	//|	ДвиженияСерийТоваров.Регистратор КАК Регистратор
	//|ИЗ
	//|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	//|		ПО ДвиженияСерийТоваров.Регистратор = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	//|			И ДвиженияСерийТоваров.Документ = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	//|			И ДвиженияСерийТоваров.Серия = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия
	//|ГДЕ
	//|	ДвиженияСерийТоваров.Серия = &Серия
	//|	И ДвиженияСерийТоваров.ЭтоСкладскоеДвижение И НЕ ДвиженияСерийТоваров.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДвиженияСерийТоваров.Период УБЫВ"; 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК смартСоответствиеСОбрудованиемИЧерниламиКлиентов,
	|	ВЫБОР
	|		КОГДА ДвиженияСерийТоваров.Получатель ССЫЛКА Справочник.Партнеры
	|			ТОГДА ДвиженияСерийТоваров.Получатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	КОНЕЦ КАК Партнер,
	|	ВЫБОР
	|		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Контрагент
	|		ИНАЧЕ ДвиженияСерийТоваров.Получатель
	|	КОНЕЦ КАК Контрагент,
	|	ДвиженияСерийТоваров.Период КАК ДатаОтгрузки,
	|	ДвиженияСерийТоваров.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ДвиженияСерийТоваров.Регистратор = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	|			И ДвиженияСерийТоваров.Документ = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	|			И ДвиженияСерийТоваров.Серия = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|		ПО ДвиженияСерийТоваров.Номенклатура = смартОборудованиеЧернилаКлиентов.Номенклатура
	|ГДЕ
	|	ДвиженияСерийТоваров.Серия = &Серия
	|	И ДвиженияСерийТоваров.ЭтоСкладскоеДвижение
	|	И НЕ ДвиженияСерийТоваров.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	|	И смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДвиженияСерийТоваров.Период УБЫВ";
	//-- #1305 смарт: Фролов 16.02.2023
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Серия", мСерия);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда		
		Возврат СтруктураВозврата;		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	
	Возврат СтруктураВозврата;
			
КонецФункции

//++ смарт:ММ 596 30.08.2021
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда
		Префикс = "ТО"; 
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ #Б-1136 смарт: Мосолов 15.10.2024 //Доработка Воронки РТО
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//++ #Б-2486 смарт: Лопато 24.02.2025 //Отключить обязательное к заполнению поле "Возможность предоставления доп. гарантии"
	//										в разделе "Заключение инженера" в Заявках на ремонтные работы  
	//Закомментировал код
	//Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов")
	//	И ЗначениеЗаполнено(ДокументОснование)
	//	И НЕ ЗначениеЗаполнено(ЗаключениеИнженераОВозможностиДопГарантии)
	//	И Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен Тогда
	//
	//	Сообщение = Новый СообщениеПользователю();
	//	Сообщение.Текст = "Не указан вариант заключения инженера о возможности предоставления дополнительной гарантии!";
	//	Сообщение.Поле = "ЗаключениеИнженераОВозможностиДопГарантии";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	//-- #Б-2486 смарт: Лопато 24.02.2025
	
КонецПроцедуры //-- #Б-1136 смарт: Мосолов 15.10.2024

#КонецЕсли







