
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если CRM_ОбщегоНазначенияКлиент.ЭтоМобильныйКлиент() Тогда   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно отправить Коммерческое предложение в сообщении мессенджера (MS Word/OpenOffice) на мобильном устройстве.'"));
		Возврат;
	КонецЕсли;
	
	ТекущийДокумент = ПараметрКоманды;
	
	Если ЕстьПодходящиеКонтакты(ТекущийДокумент) Тогда
		СписокВыбораВарианта = ПолучитьСписокВариантовКоммерческогоПредложения(ТекущийДокумент);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Варианты", СписокВыбораВарианта);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКомандыПродолжение", ЭтотОбъект, Новый Структура("ПараметрыВыполненияКоманды, ТекущийДокумент",ПараметрыВыполненияКоманды, ТекущийДокумент));
		ОткрытьФорму("Документ.КоммерческоеПредложениеКлиенту.Форма.CRM_ФормаНастройкаПередОправкой", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не найдено подходящих контактов мессенджеров.'");
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыПродолжение(НастройкиСохранения, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(НастройкиСохранения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыНазначения = Новый СписокЗначений;
	ОбъектыНазначения.Добавить(ДополнительныеПараметры.ТекущийДокумент);
	
	МассивДокументов = Новый Массив();
	МассивДокументов.Добавить(ДополнительныеПараметры.ТекущийДокумент);
	
	СтруктураДокументыИВариант = Новый Структура("МассивДокументов", МассивДокументов);
	
	СписокИменФайлов = Новый СписокЗначений();
	
	МассивФайлов_ODT = Новый Массив();
	МассивФайлов_DOC = Новый Массив();
	
	Если НастройкиСохранения.ФорматODT Тогда
		
		СтруктураДокументыИВариант.Вставить("НомерВарианта", НастройкиСохранения.НомерВарианта);
		
		ТекстСообщения = НСтр("ru='Выполняется формирование документа...';en='Formation of the document are fulfill...'");
			
		Состояние(ТекстСообщения);
		
		МакетOpenOffice = НастройкиСохранения.МакетOpenOffice;
		
		Если МакетOpenOffice	= "CRM_ПФ_ODT_КоммерческоеПредложение" Тогда
			МакетИДанныеОбъекта = CRM_ОбщегоНазначенияСервер.CRM_ПолучитьМакетыИДанныеОбъектов(МакетOpenOffice, ОбъектыНазначения, НастройкиСохранения.НомерВарианта);
		Иначе
			МакетИДанныеОбъекта = CRM_ОбщегоНазначенияСервер.CRM_ПолучитьВнешниеМакетыИДанныеОбъектов(МакетOpenOffice, ОбъектыНазначения, НастройкиСохранения.НомерВарианта);
		КонецЕсли;
		
		//МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.ПолучитьМакетыИДанныеОбъектов("Документ.КоммерческоеПредложениеКлиенту",
		// "КоммерческоеПредложение(ODT)",
		// СтруктураДокументыИВариант);
		
		//СформироватьДокументOpenOffice(ТекущийДокумент, МакетИДанныеОбъекта, "КоммерческоеПредложение(ODT)", МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, МассивФайлов_ODT);
		СформироватьДокументOpenOffice(ДополнительныеПараметры.ТекущийДокумент, МакетИДанныеОбъекта, "CRM_ПФ_ODT_КоммерческоеПредложение", МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, МассивФайлов_ODT);
		
		#Если Не ВебКлиент Тогда
		Если МассивФайлов_ODT.Количество() > 0 Тогда
			Для Каждого ИмяФайлаСтруктура Из МассивФайлов_ODT Цикл
				Если НастройкиСохранения.ЗапаковатьZIP Тогда
					СписокИменФайлов.Добавить(ИмяФайлаСтруктура.ИмяФайла);
				Иначе
					СписокИменФайлов.Добавить(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаСтруктура.ИмяФайла),
						ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор), НСтр("ru='Коммерческое предложение';en='Quote'") + ".odt");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Для н = 0 По МассивФайлов.ВГраница() Цикл
		//	Попытка УдалитьФайлы(МассивФайлов[н].ИмяФайла);
		//	Исключение КонецПопытки;
		//КонецЦикла;
		#КонецЕсли
	КонецЕсли;
	
	Если НастройкиСохранения.ФорматDOC Тогда
		
		СтруктураДокументыИВариант.Вставить("НомерВарианта", НастройкиСохранения.НомерВарианта);
		
		ТекстСообщения = НСтр("ru='Выполняется формирование документа...';en='Formation of the document are fulfill...'");
			
		Состояние(ТекстСообщения);
		
		МакетMS = НастройкиСохранения.МакетMS;
		
		Если МакетMS = "CRM_ПФ_DOC_КоммерческоеПредложение" Тогда
			МакетИДанныеОбъекта = CRM_ОбщегоНазначенияСервер.CRM_ПолучитьМакетыИДанныеОбъектов(МакетMS, ОбъектыНазначения, НастройкиСохранения.НомерВарианта);
		Иначе
			МакетИДанныеОбъекта = CRM_ОбщегоНазначенияСервер.CRM_ПолучитьВнешниеМакетыИДанныеОбъектов(МакетMS, ОбъектыНазначения, НастройкиСохранения.НомерВарианта);
		КонецЕсли;
		
		//МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.ПолучитьМакетыИДанныеОбъектов("Документ.КоммерческоеПредложениеКлиенту",
		// "КоммерческоеПредложение(MSWord)",
		// СтруктураДокументыИВариант);
		
		//СформироватьДокумент(ТекущийДокумент, МакетИДанныеОбъекта, "КоммерческоеПредложение(MSWord)", МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, МассивФайлов_DOC);
		СформироватьДокумент(ДополнительныеПараметры.ТекущийДокумент, МакетИДанныеОбъекта, МакетMS, МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, МассивФайлов_DOC);
		
		#Если Не ВебКлиент Тогда
		Если МассивФайлов_DOC.Количество() > 0 Тогда
			Для Каждого ИмяФайлаСтруктура Из МассивФайлов_DOC Цикл
				Если НастройкиСохранения.ЗапаковатьZIP Тогда
					СписокИменФайлов.Добавить(ИмяФайлаСтруктура.ИмяФайла);
				Иначе
					СписокИменФайлов.Добавить(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаСтруктура.ИмяФайла),
						ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор), НСтр("ru='Коммерческое предложение';en='Quote'") + ".doc");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		#КонецЕсли
	КонецЕсли;
	
#Если Не ВебКлиент Тогда
	Если СписокИменФайлов.Количество() > 0 Тогда
		
		СписокФайловВложений = Новый Массив;
		ЗаписьZipФайла = Неопределено;
		ИмяАрхива = Неопределено;
		
		Если НастройкиСохранения.ЗапаковатьZIP Тогда
			СтруктураВложения = ПолучитьАрхив(СписокИменФайлов, ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
			СтруктураВложения = Новый Структура("АдресВоВременномХранилище, Представление", СтруктураВложения.ПутьВоВременномХранилище, НСтр("ru='Коммерческое предложение';en='Quote'") + ".zip");
			СписокФайловВложений.Добавить(СтруктураВложения);
		Иначе
			Для Каждого ЭлементСписка Из СписокИменФайлов Цикл
				СтруктураВложения = Новый Структура("АдресВоВременномХранилище, Представление", ЭлементСписка.Значение, ЭлементСписка.Представление);
				СписокФайловВложений.Добавить(СтруктураВложения);
			КонецЦикла;
		КонецЕсли;
			
		ПараметрыДиалога = ПолучитьПараметрыОткрытияДляМессенджера(ДополнительныеПараметры.ТекущийДокумент);
		ПараметрыДиалога.Вставить("Вложения", СписокФайловВложений);
		ОткрытьФорму("Обработка.CRM_Мессенджер.Форма", ПараметрыДиалога, ЭтотОбъект);
		
	КонецЕсли;
	
	Для НомерСтроки = 0 По МассивФайлов_ODT.ВГраница() Цикл
		Попытка УдалитьФайлы(МассивФайлов_ODT[НомерСтроки].ИмяФайла);
		Исключение КонецПопытки;
	КонецЦикла;
	
	Для НомерСтроки = 0 По МассивФайлов_DOC.ВГраница() Цикл
		Попытка УдалитьФайлы(МассивФайлов_DOC[НомерСтроки].ИмяФайла);
		Исключение КонецПопытки;
	КонецЦикла;
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьПодходящиеКонтакты(ТекущийДокумент)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ПараметрыДиалога = ПолучитьПараметрыОткрытияДляМессенджера(ТекущийДокумент);
	СписокКонтактов = Новый СписокЗначений;
	Если ТипЗнч(ПараметрыДиалога.ПараметрОткрытия) = Тип("СправочникСсылка.Партнеры") Тогда
		СписокКонтактов.ЗагрузитьЗначения(CRM_ОбщегоНазначенияСервер.ПолучитьКонтактныхЛицКонтрагента(ПараметрыДиалога.ПараметрОткрытия).ВыгрузитьКолонку("КонтактноеЛицо"));
		СписокКонтактов.Добавить(ПараметрыДиалога.ПараметрОткрытия);
	ИначеЕсли ТипЗнч(ПараметрыДиалога.ПараметрОткрытия) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		СписокКонтактов.Добавить(ПараметрыДиалога.ПараметрОткрытия.Владелец);
		СписокКонтактов.Добавить(ПараметрыДиалога.ПараметрОткрытия);
	КонецЕсли;

	
	СписокФильтровПоТипуМессенджера = Новый Массив;
	СписокФильтровПоТипуМессенджера.Добавить("Instagram");
	СписокФильтровПоТипуМессенджера.Добавить("Viber");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_СообщениеМессенджера.ID_Пользователя КАК ID_Пользователя,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА CRM_СообщениеМессенджера.Контакт <> НЕОПРЕДЕЛЕНО
	|				ТОГДА CRM_СообщениеМессенджера.Контакт
	|			ИНАЧЕ CRM_СообщениеМессенджера.КонтактПредставление
	|		КОНЕЦ) КАК Контакт,
	|	МАКСИМУМ(CRM_СообщениеМессенджера.Контакт.Владелец) КАК ВладелецКонтакта,
	|	CRM_СообщениеМессенджера.Группа КАК Группа,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА CRM_СообщениеМессенджера.ID_Пользователя <> CRM_СообщениеМессенджера.Группа
	|				ТОГДА CRM_СообщениеМессенджера.ГруппаПредставление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ГруппаПредставление,
	|	CRM_СообщениеМессенджера.УчетнаяЗапись КАК УчетнаяЗапись,
	|	МАКСИМУМ(CRM_СообщениеМессенджера.УчетнаяЗапись.Включена) КАК Включена,
	|	МАКСИМУМ(CRM_СообщениеМессенджера.Дата) КАК ДатаПоследнего,
	|	МАКСИМУМ(CRM_УчетныеЗаписиМессенджеров.Наименование) КАК ПредставлениеУчетнойЗаписи,
	|	МАКСИМУМ(ВложенныйЗапрос.Новых) КАК Новых
	|ИЗ
	|	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров1
	|			ПО CRM_УчетныеЗаписиМессенджеров.Ссылка = CRM_УчетныеЗаписиМессенджеров1.УчетнаяЗапись
	|				И (CRM_УчетныеЗаписиМессенджеров1.Пользователь = &ТекущийПользователь)
	|		ПО CRM_СообщениеМессенджера.УчетнаяЗапись = CRM_УчетныеЗаписиМессенджеров.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_СообщениеМессенджера.Ссылка) КАК Новых,
	|			CRM_СообщениеМессенджера.УчетнаяЗапись КАК УчетнаяЗапись,
	|			CRM_СообщениеМессенджера.Группа КАК Группа,
	|			CRM_СообщениеМессенджера.ID_Пользователя КАК ID_Пользователя
	|		ИЗ
	|			Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|				ПО CRM_СообщениеМессенджера.УчетнаяЗапись = CRM_УчетныеЗаписиМессенджеров.УчетнаяЗапись
	|					И (CRM_УчетныеЗаписиМессенджеров.Пользователь = &ТекущийПользователь)
	|		ГДЕ
	|			НЕ CRM_СообщениеМессенджера.Прочитано
	|			И CRM_СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	|			И (CRM_СообщениеМессенджера.УчетнаяЗапись.РазрешитьПросмотрСообщенийВсемПользователям
	|					ИЛИ НЕ CRM_УчетныеЗаписиМессенджеров.УчетнаяЗапись ЕСТЬ NULL)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			CRM_СообщениеМессенджера.УчетнаяЗапись,
	|			CRM_СообщениеМессенджера.Группа,
	|			CRM_СообщениеМессенджера.ID_Пользователя) КАК ВложенныйЗапрос
	|		ПО CRM_СообщениеМессенджера.Группа = ВложенныйЗапрос.Группа
	|			И CRM_СообщениеМессенджера.УчетнаяЗапись = ВложенныйЗапрос.УчетнаяЗапись
	|			И CRM_СообщениеМессенджера.ID_Пользователя = ВложенныйЗапрос.ID_Пользователя
	|ГДЕ
	|	CRM_СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	|	И (CRM_СообщениеМессенджера.УчетнаяЗапись.РазрешитьПросмотрСообщенийВсемПользователям
	|			ИЛИ НЕ CRM_УчетныеЗаписиМессенджеров1.УчетнаяЗапись ЕСТЬ NULL)
	|	И НЕ CRM_СообщениеМессенджера.УчетнаяЗапись.ТипМессенджера В (&СписокФильтровПоТипуМессенджера)
	|	И НЕ CRM_УчетныеЗаписиМессенджеров.ТипМессенджера В (&СписокФильтровПоТипуМессенджера)
	|	//ОтборПоКонтактам
	|
	|СГРУППИРОВАТЬ ПО
	|	CRM_СообщениеМессенджера.ID_Пользователя,
	|	CRM_СообщениеМессенджера.Группа,
	|	CRM_СообщениеМессенджера.УчетнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоследнего УБЫВ,
	|	Контакт");
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("СписокФильтровПоТипуМессенджера", СписокФильтровПоТипуМессенджера);

	Условие = "";
	Если СписокКонтактов.Количество()>0 Тогда
		Условие = Условие+"И CRM_СообщениеМессенджера.Контакт В(&СписокКонтактов)";
		Запрос.УстановитьПараметр("СписокКонтактов", СписокКонтактов);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ОтборПоКонтактам", Условие);
	
	ТаблицаКонтактов = Запрос.Выполнить().Выгрузить();
	
	Возврат (ТаблицаКонтактов.Количество() > 0);
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОткрытияДляМессенджера(ОбъектСсылка)
	ПараметрыДиалога = Новый Структура;
	Если ТипЗНЧ(ОбъектСсылка) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Если НЕ ОбъектСсылка.КонтактноеЛицо.Пустая() Тогда
				ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка.Партнер);
			ИначеЕсли НЕ ОбъектСсылка.Партнер.Пустая() Тогда	
				ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка.Партнер);
			КонецЕсли;
		Иначе	
			Если НЕ ОбъектСсылка.КонтактноеЛицо.Пустая() Тогда
				ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка.Клиент);
			ИначеЕсли НЕ ОбъектСсылка.Клиент.Пустая() Тогда	
				ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка.Клиент);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
    Возврат ПараметрыДиалога;
КонецФункции

&НаСервере
Функция ПолучитьСписокВариантовКоммерческогоПредложения(КоммерческоеПредложение)
	
	СписокВыбораВарианта = CRM_МетодыМодулейМенеджеровДокументов.КППолучитьВарианты(КоммерческоеПредложение);
	
	Если СписокВыбораВарианта.Количество() > 1 Тогда
		СписокВыбораВарианта.Вставить(0, -1, "Все варианты");
	КонецЕсли;
	
	Возврат СписокВыбораВарианта;
	
КонецФункции// ПолучитьСписокВариантовКоммерческогоПредложения(КоммерческоеПредложение)

&НаКлиенте
Процедура СформироватьДокумент(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета, ЛокальныйКаталогФайловПечати, МассивФайлов)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	
	ДанныеОбъекта = МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Попытка
		Макет		  = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
		ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		ИмяВременногоФайла = КаталогВременныхФайлов() + "Коммерческое предложение.doc";
		
		Если ПечатнаяФорма <> Неопределено И Макет <> Неопределено Тогда
			
			
			// Вывод колонтитулов документа.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ВерхнийКолонтитул"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["НижнийКолонтитул"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбласть(ПечатнаяФорма, Область);
			
			// Вывод верхней части документа - обычная область с параметрами.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			// Выведем варианты
			ВыводитьСтрокуВарианта = (ДанныеОбъекта["Варианты"].Количество() > 1);
			
			Для Каждого ДанныеВарианта Из ДанныеОбъекта["Варианты"] Цикл
				Если ВыводитьСтрокуВарианта Тогда
					Попытка
						Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОписаниеВарианта"]);
						УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеВарианта, Ложь);
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ШапкаТаблицыТовары"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбласть(ПечатнаяФорма, Область, Ложь);
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаТаблицаТовары"]);
				
				Попытка
					
					ОбластьРазделитель = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаРазделительТаблицаТовары"]);
					ОбластьИтогиПоРазделу = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаИтогиПоРазделуТаблицаТовары"]);				
					
					ТоварыЕстьРазделители = ДанныеВарианта.ЕстьРазделители;
					
				Исключение
					
					ТоварыЕстьРазделители = Ложь;
					
				КонецПопытки;				
				
				Если ТоварыЕстьРазделители Тогда
					
					// выводим построчно
					КоличествоНеВыведенныхСтрок = ДанныеВарианта.Товары.Количество();
					
					Для Каждого СтрокаТовары Из ДанныеВарианта.Товары Цикл
						
						МассивСтрокиТовары = Новый Массив;
						МассивСтрокиТовары.Добавить(СтрокаТовары);
						
						Если СтрокаТовары["ТипСтроки"] = "Разделитель" Тогда
							
							УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, ОбластьРазделитель, МассивСтрокиТовары, КоличествоНеВыведенныхСтрок = 1);
							
						ИначеЕсли СтрокаТовары["ТипСтроки"] = "ИтогПоРазделу" Тогда
							
							УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, ОбластьИтогиПоРазделу, МассивСтрокиТовары, КоличествоНеВыведенныхСтрок = 1);
							
						Иначе
							
							УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, МассивСтрокиТовары, КоличествоНеВыведенныхСтрок = 1);
							
						КонецЕсли;
						
						КоличествоНеВыведенныхСтрок = КоличествоНеВыведенныхСтрок - 1;
						
					КонецЦикла;
					
				Иначе
					
					УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ДанныеВарианта.Товары);
					
				КонецЕсли;
				
				Попытка // Для совместимости с предыдущей версией
					// вывод итогов табличной части.
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ИтогиТаблицаТовары"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеВарианта, Ложь);
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
			// Вывод нижней части документа - обычная область с параметрами.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["НижняяЧасть"]);
			//ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеВарианта, Ложь);
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);

			COMСоединение = ПечатнаяФорма.COMСоединение;
			COMСоединение.Application.Visible = Ложь;
			COMСоединение.Application.Selection.Collapse();
			//COMСоединение.ActiveDocument.Save();
			COMСоединение.ActiveDocument.SaveAs(ИмяВременногоФайла,0);
			COMСоединение.ActiveDocument.Close();
			COMСоединение.Quit();

			МассивФайлов.Добавить(Новый Структура("ИмяФайла,ДокументСсылка", ИмяВременногоФайла, ДокументСсылка));
			
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма);
		УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
		Возврат;
	КонецПопытки;
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма,Ложь);
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументOpenOffice(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета, ЛокальныйКаталогФайловПечати, МассивФайлов)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	
	ДанныеОбъекта = МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Попытка
		Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
		ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
		
		ИмяВременногоФайла = КаталогВременныхФайлов() + "Коммерческое предложение.odt";
		
		Если Не ПечатнаяФорма = Неопределено И Не Макет = Неопределено Тогда
			
			// Вывод колонтитулов документа.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ВерхнийКолонтитул"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта);
			
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["НижнийКолонтитул"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбласть(ПечатнаяФорма, Область);
			
			// Вывод верхней части документа - обычная область с параметрами.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			// Выведем варианты
			ВыводитьСтрокуВарианта = (ДанныеОбъекта["Варианты"].Количество() > 1);
			
			Для Каждого ДанныеВарианта Из ДанныеОбъекта["Варианты"] Цикл
				Если ВыводитьСтрокуВарианта Тогда
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ОписаниеВарианта"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеВарианта, Ложь);
				КонецЕсли;
				
				// Вывод коллекции данных из информационной базы в виде таблицы.
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ШапкаТаблицыТовары"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбласть(ПечатнаяФорма, Область, Ложь);
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаТаблицаТовары"]);
				
				Попытка
					
					ОбластьРазделитель = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаРазделительТаблицаТовары"]);
					ОбластьИтогиПоРазделу = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаИтогиПоРазделуТаблицаТовары"]);
					
					ТоварыЕстьРазделители = ДанныеВарианта.ЕстьРазделители;
					
				Исключение
					
					ТоварыЕстьРазделители = Ложь;
					
				КонецПопытки;
				
				Если ТоварыЕстьРазделители Тогда
					
					// выдим построчно
					КоличествоНеВыведенныхСтрок = ДанныеВарианта.Товары.Количество();
					
					Для Каждого СтрокаТовары Из ДанныеВарианта.Товары Цикл
						
						МассивСтрокиТовары = Новый Массив;
						МассивСтрокиТовары.Добавить(СтрокаТовары);
						
						Если СтрокаТовары["ТипСтроки"] = "Разделитель" Тогда
							
							УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, ОбластьРазделитель, МассивСтрокиТовары, КоличествоНеВыведенныхСтрок = 1);
							
						ИначеЕсли СтрокаТовары["ТипСтроки"] = "ИтогПоРазделу" Тогда
							
							УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, ОбластьИтогиПоРазделу, МассивСтрокиТовары, КоличествоНеВыведенныхСтрок = 1);
							
						Иначе
							
							УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, МассивСтрокиТовары, КоличествоНеВыведенныхСтрок = 1);
							
						КонецЕсли;
						
						КоличествоНеВыведенныхСтрок = КоличествоНеВыведенныхСтрок - 1;
						
					КонецЦикла;
					
				Иначе
					
					УправлениеПечатьюКлиент.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ДанныеВарианта.Товары);
					
				КонецЕсли;
				
				Попытка // Для совместимости с предыдущей версией
				// вывод итогов табличной части.
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ИтогиТаблицаТовары"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеВарианта, Ложь);
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
			// Вывод нижней части документа - обычная область с параметрами.
			Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["НижняяЧасть"]);
			УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
			Args = Новый COMSafeArray("VT_VARIANT",1);
			ПечатнаяФорма.Document.storeToURL(ПривестиФайлКУРЛ(ИмяВременногоФайла),Args);
			#КонецЕсли
			МассивФайлов.Добавить(Новый Структура("ИмяФайла,ДокументСсылка", ИмяВременногоФайла, ДокументСсылка));
			
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма);
		УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
		Возврат;
	КонецПопытки;
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
	ПечатнаяФорма.Document.Close(0);
	ПечатнаяФорма.Desktop.terminate();
	ПечатнаяФорма.Document = Неопределено;
	ПечатнаяФорма.Desktop = Неопределено;
	ПечатнаяФорма.ServiceManager = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция ПривестиФайлКУРЛ(ЗНАЧ ПутьКФайлу = "")

	ПутьКФайлу = СтрЗаменить(ПутьКФайлу," ","%20");
	ПутьКФайлу = СтрЗаменить(ПутьКФайлу,"\","/");
	Возврат "file:/" + "/localhost/" + ПутьКФайлу;

КонецФункции 

&НаКлиенте
Функция ПолучитьАрхив(СписокИменФайлов, ЗНАЧ Ид)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	Для Каждого ЭлементСписка Из СписокИменФайлов Цикл
		ЗаписьZipФайла.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	ЗаписьZipФайла.Записать();
	ФайлАрхива = Новый Файл(ИмяАрхива);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
	ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Ид);
	Возврат Новый Структура("ПутьВоВременномХранилище, Имя", ПутьВоВременномХранилище, ФайлАрхива.Имя);
	#КонецЕсли
	
КонецФункции

#КонецОбласти

