#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ТекстВыбораПроцентаНДС")
Функция смарт_ТекстВыбораПроцентаНДС(ИсточникСтавкаНДС)

	Возврат СтрШаблон(
	"ВЫБОР %1
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		ТОГДА 20
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		ТОГДА 20
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|		ТОГДА 18
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|		ТОГДА 18
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		ТОГДА 10
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		ТОГДА 10
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|		ТОГДА 5
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|		ТОГДА 5
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|		ТОГДА 7
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|		ТОГДА 7
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|		ТОГДА 22
	|	КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)
	|		ТОГДА 22
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|	ИНАЧЕ 0
	|КОНЕЦ", ИсточникСтавкаНДС);


КонецФункции

&ИзменениеИКонтроль("ПолучитьПартии")
Процедура смарт_ПолучитьПартии(ПараметрыРасчета)

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.МоментВремени КАК МоментВремени,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаПартий.Контрагент КАК Контрагент,
	|	Партии.ДокументПоступления КАК СчетФактура,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоступления,
	|	ВЫБОР 
	|		КОГДА Партии.ДокументПоступления ССЫЛКА Документ.СчетФактураПолученныйНалоговыйАгент
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТоварыНалоговыйАгент)
	|		КОГДА Партии.ДокументПоступления ССЫЛКА Документ.СчетФактураНалоговыйАгент ТОГДА
	|			ВЫБОР 
	|				КОГДА ВЫРАЗИТЬ(Партии.ДокументПоступления КАК Документ.СчетФактураНалоговыйАгент).ВидАгентскогоДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыАгентскихДоговоров.Аренда)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентАренда)
	|				КОГДА ВЫРАЗИТЬ(Партии.ДокументПоступления КАК Документ.СчетФактураНалоговыйАгент).ВидАгентскогоДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыАгентскихДоговоров.РеализацияИмущества)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентРеализацияИмущества)
	|				КОГДА ВЫРАЗИТЬ(Партии.ДокументПоступления КАК Документ.СчетФактураНалоговыйАгент).ВидАгентскогоДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги)
	|				КОГДА ВЫРАЗИТЬ(Партии.ДокументПоступления КАК Документ.СчетФактураНалоговыйАгент).ВидАгентскогоДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыАгентскихДоговоров.Нерезидент)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентИностранцы)
	|			КОНЕЦ
	|		КОГДА Партии.ДокументПоступления ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|		КОГДА Партии.ДокументПоступления ССЫЛКА Документ.ЗаявлениеОВвозеТоваров 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныйСоюз)
	|		ИНАЧЕ Партии.ВидЦенности 
	|	КОНЕЦ КАК ВидЦенности,
	|	Партии.АналитикаУчетаПартий.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА Партии.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|			И  ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ Партии.НалогообложениеПартии
	|	КОНЕЦ КАК ВидДеятельностиНДС,
	|
	|	ВЫБОР
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|			И  ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ Партии.НалогообложениеНДС
	|	КОНЕЦ КАК КорВидДеятельностиНДС,
	|	
	|	Партии.СтатьяСписанияНДС КАК СтатьяСписанияНДС,
	|	ВЫБОР 
	|		КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) 
	|			ТОГДА Партии.АналитикаСписанияНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаСписанияНДС,
	|	ВЫБОР 
	|		КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) 
	|			ТОГДА Партии.НаправлениеДеятельности
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НаправлениеДеятельностиСписанияНДС,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаУчетаНДСПоНаправлениямДеятельности
	|			ТОГДА Партии.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаУчетаНДСПоНаправлениямДеятельности
	|			ТОГДА Партии.КорНаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|	ВЫБОР 
	|		КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) 
	|			ТОГДА Партии.ПодразделениеСписанияНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПодразделениеСписанияНДС,
	|	
	|	Партии.ДокументРеализации КАК ДокументРеализации,
	|	
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Партии.ДокументПоступления) В 
	|			(ТИП(Документ.ЗаявлениеОВвозеТоваров),
	|			 ТИП(Документ.СчетФактураПолученныйНалоговыйАгент),
	|			 ТИП(Документ.СчетФактураНалоговыйАгент)) ТОГДА 
	|			0
	|		ИНАЧЕ
	|			Партии.СтоимостьРегл 
	|	КОНЕЦ КАК СуммаБезНДС,
	|	Партии.НДСРегл КАК НДС,
	|	Партии.НДСУпр КАК НДСУпр
	|
	|ПОМЕСТИТЬ ПартииПредварительная
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьРегл,
	|		Партии.НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаПартий,
	|		ВЫБОР 
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|				ЕСТЬNULL(Партии.ВидЗапасов.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
	|			ИНАЧЕ ЕСТЬNULL(Партии.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС ,ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) 
	|		КОНЕЦ КАК ВидЦенности,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ПодразделениеСписанияНДС,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО 
	|			АналитикаПартий.Ссылка = Партии.АналитикаУчетаПартий
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО 
	|			АналитикаНоменклатуры.Ссылка = Партии.АналитикаУчетаНоменклатуры
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0.
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Партии.МоментВремени КАК МоментВремени,
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.СтоимостьРегл КАК СтоимостьРегл,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.ДокументПоступления КАК ДокументПоступления,
	|		Партии.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		ВЫБОР КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|						ЕСТЬNULL(Партии.ВидЗапасов.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
	|					ИНАЧЕ ЕСТЬNULL(Партии.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) 
	|				КОНЕЦ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги) 
	|		КОНЕЦ КАК ВидЦенности,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС КАК НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО 
	|			АналитикаПартий.Ссылка = Партии.АналитикаУчетаПартий
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО 
	|			АналитикаНоменклатуры.Ссылка = Партии.АналитикаУчетаНоменклатуры
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Партии.МоментВремени КАК МоментВремени,
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		(ВЫБОР
	|			КОГДА Партии.ДокументПоступления ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт ТОГДА
	|				(ВЫБОР Партии.АналитикаУчетаПартий.СтавкаНДС
	|					КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20) ТОГДА Партии.НДСРегл * 100 / 20
	|					КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18) ТОГДА Партии.НДСРегл * 100 / 18
	|					КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10) ТОГДА Партии.НДСРегл * 100 / 10
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|					КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5) ТОГДА Партии.НДСРегл * 100 / 5
	|					КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7) ТОГДА Партии.НДСРегл * 100 / 7
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|					КОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22) ТОГДА Партии.НДСРегл * 100 / 22
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|					ИНАЧЕ 0 КОНЕЦ)
	|			ИНАЧЕ Партии.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.ДокументПоступленияРасходов КАК ДокументПоступления,
	|		Партии.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		ВЫБОР 
	|			КОГДА НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL 
	|				ТОГДА СтатьиРасходов.ВидЦенностиНДС
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|				ТОГДА 
	|					ВЫБОР 
	|						КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|							ЕСТЬNULL(Партии.ВидЗапасов.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
	|						ИНАЧЕ ЕСТЬNULL(Партии.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) 
	|					КОНЕЦ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		КОНЕЦ КАК ВидЦенности,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС КАК НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО 
	|			АналитикаПартий.Ссылка = Партии.АналитикаУчетаПартий
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО 
	|			АналитикаНоменклатуры.Ссылка = Партии.АналитикаУчетаНоменклатуры
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО 
	|			Партии.СтатьяРасходов = СтатьиРасходов.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступленияРасходов
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени КАК МоментВремени,
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.СтоимостьРегл КАК СтоимостьРегл,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступленияРасходов КАК ДокументПоступления,
	|		Партии.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаПартий.ВидЦенности <> ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|				ТОГДА Партии.АналитикаУчетаПартий.ВидЦенности        // Версия ПартионногоУчета 2.2
	|			ИНАЧЕ ЕСТЬNULL(СтатьиРасходов.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги))
	|		КОНЕЦ КАК ВидЦенности,
	|		ВЫБОР
	|			КОГДА Партии.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|				ТОГДА Партии.ВидДеятельностиНДС // Версия ПартионногоУчета 2.2
	|			ИНАЧЕ Партии.АналитикаУчетаПартий.НалогообложениеНДС     // Версия ПартионногоУчета 2.1
	|		КОНЕЦ                     КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС КАК НалогообложениеНДС,
	|		Партии.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Партии.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО КАК ПодразделениеСписанияНДС,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
	|		Партии.ДокументРеализации КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ПартииПрочихРасходов КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступленияРасходов
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО 
	|			Партии.СтатьяРасходов = СтатьиРасходов.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО
	|			Партии.АналитикаУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьРегл,
	|		Партии.НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаПартий,
	|		ВЫБОР КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары) 
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги) 
	|		КОНЕЦ КАК ВидЦенности,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьРегл,
	|		Партии.НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаПартий,
	|		ВЫБОР КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|						ЕСТЬNULL(Партии.ВидЗапасов.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
	|					ИНАЧЕ ЕСТЬNULL(Партии.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) 
	|				КОНЕЦ 
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги) 
	|		КОНЕЦ КАК ВидЦенности,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО КАК ПодразделениеСписанияНДС,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (
	|					ТИП(Документ.ОтчетКомиссионера), 
	|					ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями))
	|				ТОГДА Партии.Регистратор
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Партии.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаПартий,
	|		ЕСТЬNULL(Партии.АналитикаУчетаПартий.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Партии.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		И НЕ Партии.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		-Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		-Партии.НДС КАК НДСРегл,
	|		-Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаПартий,
	|		ЕСТЬNULL(Партии.АналитикаУчетаПартий.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		ВЫБОР 
	|			КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ИНАЧЕ Партии.КорВидДеятельностиНДС
	|		КОНЕЦ КАК НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) //Корректировка приобретения
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Партии.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаПартий,
	|		ЕСТЬNULL(Партии.АналитикаУчетаПартий.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		ВЫБОР 
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|			КОГДА Партии.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				ТОГДА Партии.АналитикаУчетаНоменклатуры.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Партии.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		И НЕ Партии.ВидДеятельностиНДС В (&ВидыДеятельностиНДСУчитываетсяВСтоимости)
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаДокументаПоступления,
	|		ЕСТЬNULL(Партии.АналитикаУчетаДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		НЕОПРЕДЕЛЕНО,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И НЕ Партии.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		-Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		-Партии.НДС КАК НДСРегл,
	|		-Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаДокументаПоступления,
	|		ЕСТЬNULL(Партии.АналитикаУчетаДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		ВЫБОР 
	|			КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ИНАЧЕ Партии.КорВидДеятельностиНДС
	|		КОНЕЦ КАК НалогообложениеНДС,
	|		Партии.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		НЕОПРЕДЕЛЕНО,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) //корректировка приобретения
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаДокументаПоступления,
	|		ЕСТЬNULL(Партии.АналитикаУчетаДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		НЕОПРЕДЕЛЕНО,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И НЕ Партии.ВидДеятельностиНДС В (&ВидыДеятельностиНДСУчитываетсяВСтоимости)
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.МоментВремени,
	|		Партии.Период,
	|		Партии.Регистратор,
	|		Партии.Организация,
	|		Партии.СтоимостьБезНДС КАК СтоимостьРегл,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.ДокументПоступления,
	|		Партии.АналитикаУчетаДокументаПоступления,
	|		ЕСТЬNULL(Партии.АналитикаУчетаДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) КАК ВидЦенности,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.НаправлениеДеятельности,
	|		ЕСТЬNULL(Партии.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,Партии.КорНаправлениеДеятельности),
	|		НЕОПРЕДЕЛЕНО,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ВЫБОР 
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) В (&ТипыДокументовЭкспорта)
	|				ТОГДА Партии.Регистратор
	|			КОГДА ТИПЗНАЧЕНИЯ(Партии.Регистратор) = ТИП(Документ.КорректировкаРеализации)
	|				ТОГДА ВЫРАЗИТЬ(Партии.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ДокументРеализации
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Партии
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Задания КАК Задания
	|		ПО
	|			Задания.Организация = Партии.Организация
	|			И Задания.СчетФактура = Партии.ДокументПоступления
	|	ГДЕ
	|		Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДС <> 0
	|		И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И Партии.Регистратор <> Партии.Партия
	|	) КАК Партии
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация.ГоловнаяОрганизация = Партии.Организация.ГоловнаяОрганизация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступления
	|	
	|ГДЕ
	|	Партии.НалогообложениеПартии <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Партии.МоментВремени КАК МоментВремени,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.Поставщик КАК Контрагент,
	|	Партии.ДокументПоступленияРасходов КАК СчетФактура,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоступления,
	|	Партии.ВидЦенности КАК ВидЦенности,
	|	Партии.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|			И  ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ Партии.ВидДеятельностиНДС
	|	КОНЕЦ КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|			И  ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ Партии.КорВидДеятельностиНДС
	|	КОНЕЦ КАК КорВидДеятельностиНДС,
	|	Партии.СтатьяОтраженияРасходов КАК СтатьяСписанияНДС,
	|	Партии.АналитикаОтраженияРасходов КАК АналитикаСписанияНДС,
	|	Партии.НаправлениеДеятельности КАК НаправлениеДеятельностиСписанияНДС,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаУчетаНДСПоНаправлениямДеятельности
	|			ТОГДА Партии.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаУчетаНДСПоНаправлениямДеятельности
	|			ТОГДА Партии.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|	Партии.Подразделение КАК ПодразделениеСписанияНДС,
	|	Партии.ДокументРеализации КАК ДокументРеализации,
	|	Партии.СтоимостьРегл КАК СуммаБезНДС,
	|	Партии.НДСРегл КАК НДС,
	|	Партии.НДСУпр КАК НДСУпр
	|ИЗ
	|	РегистрНакопления.ПартииНДСКРаспределению КАК Партии
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Задания КАК Задания
	|	ПО
	|		Задания.Организация = Партии.Организация
	|		И Задания.СчетФактура = Партии.ДокументПоступленияРасходов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация.ГоловнаяОрганизация = Партии.Организация.ГоловнаяОрганизация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступленияРасходов
	|		
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Партии.НДСРегл <> 0
	|	И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.МоментВремени КАК МоментВремени,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.Контрагент КАК Контрагент,
	|	Партии.СчетФактура КАК СчетФактура,
	|	Партии.ДатаПоступления КАК ДатаПоступления,
	|	Партии.ВидЦенности КАК ВидЦенности,
	|	Партии.СтавкаНДС КАК СтавкаНДС,
	|	Партии.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Партии.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Партии.СтатьяСписанияНДС КАК СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС КАК АналитикаСписанияНДС,
	|	Партии.НаправлениеДеятельностиСписанияНДС КАК НаправлениеДеятельностиСписанияНДС,
	|	ЕСТЬNULL(Партии.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(Партии.КорНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	|	Партии.ПодразделениеСписанияНДС КАК ПодразделениеСписанияНДС,
	|	Партии.ДокументРеализации КАК ДокументРеализации,
	|	СУММА(Партии.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(Партии.НДС) КАК НДС,
	|	СУММА(Партии.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ Партии
	|ИЗ
	|	ПартииПредварительная КАК Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.МоментВремени,
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.Контрагент,
	|	Партии.СчетФактура,
	|	Партии.ДатаПоступления,
	|	Партии.ВидЦенности,
	|	Партии.СтавкаНДС,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.КорВидДеятельностиНДС,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.НаправлениеДеятельностиСписанияНДС,
	|	ЕСТЬNULL(Партии.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ЕСТЬNULL(Партии.КорНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	Партии.ПодразделениеСписанияНДС,
	|	Партии.ДокументРеализации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПартииПредварительная
	|";

	Запрос.УстановитьПараметр("НачалоПериода",           ПараметрыРасчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",            ПараметрыРасчета.КонецПериода);
	Запрос.УстановитьПараметр("МассивОрганизаций",       ПараметрыРасчета.МассивОрганизаций);
	Запрос.УстановитьПараметр("ДатаНачалаДействия150ФЗ", УчетНДСУП.НастройкиУчета().ДатаРазделенияЭкспорта);
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	Запрос.УстановитьПараметр("ДатаНачалаУчетаНДСПоНаправлениямДеятельности", УчетНДСУП.НастройкиУчета().ДатаНачалаУчетаНДСПоНаправлениямДеятельности);
	Запрос.УстановитьПараметр("ДатаВозможностиВычетаПриОказанииУслугНеВРФ", Дата("20190701"));
	Запрос.УстановитьПараметр("ТипыДокументовЭкспорта",  Метаданные.РегистрыНакопления.НДСПредъявленный.Измерения.РеализацияЭкспорт.Тип.Типы());
	Запрос.УстановитьПараметр("ВидыДеятельностиНДСУчитываетсяВСтоимости", УчетНДСУП.ВидыДеятельностиНДСУчитываетсяВСтоимости());

	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьНДСЗаписиКнигиПокупокПоНДСПредъявленный")
Функция смарт_РассчитатьНДСЗаписиКнигиПокупокПоНДСПредъявленный(ПараметрыРасчета)

	Запрос = Новый Запрос;
	Запрос.Текст =
	// Записи по событию НДСПринятКВычету
	"ВЫБРАТЬ
	|	НДСПредъявленный.Приоритет                                      КАК Приоритет,
	|	НДСПредъявленный.Период                                         КАК Период,
	|	НДСПредъявленный.Регистратор                                    КАК Регистратор,
	|	НДСПредъявленный.Организация                                    КАК Организация,
	|	НДСПредъявленный.Поставщик                                      КАК Поставщик,
	|	НДСПредъявленный.СчетФактура                                    КАК СчетФактура,
	|	НДСПредъявленный.ВидЦенности                                    КАК ВидЦенности,
	|	НДСПредъявленный.СтавкаНДС                                      КАК СтавкаНДС,
	|	ДАТАВРЕМЯ(1,1,1)                                                КАК ДатаОплаты,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДокументОплаты, НЕОПРЕДЕЛЕНО)    КАК ДокументОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету) КАК Событие,
	|	КОНЕЦПЕРИОДА(НДСПредъявленный.Период, КВАРТАЛ)                  КАК ДатаСобытия,
	|	ЕСТЬNULL(ИСФ.ЗаписьДополнительногоЛиста, ЛОЖЬ)                  КАК ЗаписьДополнительногоЛиста,
	|	ЕСТЬNULL(ИСФ.КорректируемыйПериод, ДАТАВРЕМЯ(1,1,1))            КАК КорректируемыйПериод,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДоговорКонтрагента, НЕОПРЕДЕЛЕНО) КАК ДоговорКонтрагента,
	|	НДСПредъявленный.ИсправленныйСчетФактура                        КАК ИсправленныйСчетФактура,
	|	ВЫБОР
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 20
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 20
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 18
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 18
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 10
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 5
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 5
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 7
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 7
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 22
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 22
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ НДСПредъявленный.СуммаБезНДС
	|	КОНЕЦ                                                           КАК СуммаБезНДС,
	|	НДСПредъявленный.НДС                                            КАК НДС,
	|	НДСПредъявленный.НДСУпр                                         КАК НДСУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеНДСкВычету) КАК ХозяйственнаяОперация,
	|	""""                                                            КАК НомерДокументаОплаты,
	|	""""                                                            КАК ДатаДокументаОплаты,
	|	ВЫБОР 
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|			ТОГДА ""20""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныйСоюз)
	|			ТОГДА ""19""
	|		ИНАЧЕ """"
	|	КОНЕЦ                                                           КАК КодВидаОперации,
	|	НДСПредъявленный.РегламентнаяОперация                           КАК РегламентнаяОперация,
	|	НДСПредъявленный.РеализацияЭкспорт                              КАК ДокументОтгрузки,
	|	НДСПредъявленный.ВидДеятельностиНДС                             КАК ВидДеятельностиНДС,
	|	НДСПредъявленный.КорНаправлениеДеятельности                     КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ НДСЗаписиКнигиПокупокПоНДСПредъявленный
	|ИЗ
	|	НДСПредъявленныйПринятиеКВычету КАК НДСПредъявленный
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СчетаФактурыДокументы КАК СчетаФактурыДокументы
	|	ПО
	|		НДСПредъявленный.Организация = СчетаФактурыДокументы.Организация
	|		И НДСПредъявленный.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ИсправительныеСчетаФактуры КАК ИСФ
	|	ПО
	|		НДСПредъявленный.Организация = ИСФ.Организация
	|		И НДСПредъявленный.СчетФактура = ИСФ.СчетФактура
	|		И НДСПредъявленный.ИсправленныйСчетФактура = ИСФ.ИсправительныйСчетФактура
	|	
	|ГДЕ
	|	НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПринятКВычету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Записи по событиям ПодтвержденаСтавка0 и НеПодтвержденаСтавка0
	|ВЫБРАТЬ
	|	НДСПредъявленный.Приоритет                                      КАК Приоритет,
	|	НДСПредъявленный.Период                                         КАК Период,
	|	НДСПредъявленный.Регистратор                                    КАК Регистратор,
	|	НДСПредъявленный.Организация                                    КАК Организация,
	|	НДСПредъявленный.Поставщик                                      КАК Поставщик,
	|	НДСПредъявленный.СчетФактура                                    КАК СчетФактура,
	|	НДСПредъявленный.ВидЦенности                                    КАК ВидЦенности,
	|	НДСПредъявленный.СтавкаНДС                                      КАК СтавкаНДС,
	|	ДАТАВРЕМЯ(1,1,1)                                                КАК ДатаОплаты,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДокументОплаты, НЕОПРЕДЕЛЕНО)    КАК ДокументОплаты,
	|	ВЫБОР 
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПоДЦПринятКВычету)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету)
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.ПодтвержденаСтавка0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НеПодтвержденаСтавка0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.НеПодтвержденаСтавка0)
	|	КОНЕЦ                                                           КАК Событие,
	|	КОНЕЦПЕРИОДА(НДСПредъявленный.Период, КВАРТАЛ)                  КАК ДатаСобытия,
	|	ВЫБОР 
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НеПодтвержденаСтавка0)
	|			И КОНЕЦПЕРИОДА(НДСПредъявленный.Период, КВАРТАЛ) > ЕСТЬNULL(КОНЕЦПЕРИОДА(ДанныеПервичныхДокументов.ДатаРегистратора, КВАРТАЛ), ДАТАВРЕМЯ(2100,1,1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			ЕСТЬNULL(ИСФ.ЗаписьДополнительногоЛиста, ЛОЖЬ)
	|	КОНЕЦ                                                           КАК ЗаписьДополнительногоЛиста,
	|	ВЫБОР 
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НеПодтвержденаСтавка0)
	|			И КОНЕЦПЕРИОДА(НДСПредъявленный.Период, КВАРТАЛ) > ЕСТЬNULL(КОНЕЦПЕРИОДА(ДанныеПервичныхДокументов.ДатаРегистратора, КВАРТАЛ), ДАТАВРЕМЯ(2100,1,1))
	|			ТОГДА ДанныеПервичныхДокументов.ДатаРегистратора
	|		ИНАЧЕ
	|			ЕСТЬNULL(ИСФ.КорректируемыйПериод, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                            КАК КорректируемыйПериод,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДоговорКонтрагента, НЕОПРЕДЕЛЕНО) КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(НДСПредъявленный.ИсправленныйСчетФактура, НЕОПРЕДЕЛЕНО) КАК ИсправленныйСчетФактура,
	|	НДСПредъявленный.СуммаБезНДС                                     КАК СуммаБезНДС,
	|	НДСПредъявленный.НДС                                             КАК НДС,
	|	НДСПредъявленный.НДСУпр                                          КАК НДСУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеНДСкВычету) КАК ХозяйственнаяОперация,
	|	""""                                                            КАК НомерДокументаОплаты,
	|	""""                                                            КАК ДатаДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСПредъявленный.ПовторныйВычет
	|			ТОГДА ""25""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|			ТОГДА ""20""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныйСоюз)
	|			ТОГДА ""19""
	|		ИНАЧЕ """"
	|	КОНЕЦ                                                           КАК КодВидаОперации,
	|	НДСПредъявленный.РегламентнаяОперация                           КАК РегламентнаяОперация,
	|	НДСПредъявленный.РеализацияЭкспорт                              КАК ДокументОтгрузки,
	|	НДСПредъявленный.ВидДеятельностиНДС                             КАК ВидДеятельностиНДС,
	|	НДСПредъявленный.КорНаправлениеДеятельности                     КАК НаправлениеДеятельности
	|ИЗ
	|	НДСПредъявленныйПринятиеКВычету КАК НДСПредъявленный
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СчетаФактурыДокументы КАК СчетаФактурыДокументы
	|	ПО
	|		НДСПредъявленный.Организация = СчетаФактурыДокументы.Организация
	|		И НДСПредъявленный.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ИсправительныеСчетаФактуры КАК ИСФ
	|	ПО
	|		НДСПредъявленный.Организация = ИСФ.Организация
	|		И НДСПредъявленный.ИсправленныйСчетФактура = ИСФ.ИсправительныйСчетФактура
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО 
	|		ДанныеПервичныхДокументов.Организация = НДСПредъявленный.Организация
	|		И ДанныеПервичныхДокументов.Документ = НДСПредъявленный.РеализацияЭкспорт
	|ГДЕ
	|	НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НДСПредъявленный.Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.ПодтвержденаСтавка0),
	|				      ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НеПодтвержденаСтавка0),
	|				      ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПоДЦПринятКВычету))
	|	И НДСПредъявленный.НДС > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Регистрация документов оплаты
	|ВЫБРАТЬ
	|	НДСПредъявленный.Приоритет                                      КАК Приоритет,
	|	НДСПредъявленный.Период                                         КАК Период,
	|	НДСПредъявленный.Регистратор                                    КАК Регистратор,
	|	НДСПредъявленный.Организация                                    КАК Организация,
	|	НДСПредъявленный.Поставщик                                      КАК Поставщик,
	|	НДСПредъявленный.СчетФактура                                    КАК СчетФактура,
	|	НДСПредъявленный.ВидЦенности                                    КАК ВидЦенности,
	|	НДСПредъявленный.СтавкаНДС                                      КАК СтавкаНДС,
	|	ДАТАВРЕМЯ(1,1,1)                                                КАК ДатаОплаты,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДокументОплаты, НЕОПРЕДЕЛЕНО)    КАК ДокументОплаты,
	|	ВЫБОР 
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПринятКВычету)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету)
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПоДЦПринятКВычету)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету)
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.ПодтвержденаСтавка0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)
	|		КОГДА НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НеПодтвержденаСтавка0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.НеПодтвержденаСтавка0)
	|	КОНЕЦ                                                          КАК Событие,
	|	НДСПредъявленный.Период                                        КАК ДатаСобытия,
	|	ЕСТЬNULL(ИСФ.ЗаписьДополнительногоЛиста, ЛОЖЬ)                 КАК ЗаписьДополнительногоЛиста,
	|	ЕСТЬNULL(ИСФ.КорректируемыйПериод, ДАТАВРЕМЯ(1,1,1))           КАК КорректируемыйПериод,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДоговорКонтрагента, НЕОПРЕДЕЛЕНО) КАК ДоговорКонтрагента,
	|	НДСПредъявленный.ИсправленныйСчетФактура                       КАК ИсправленныйСчетФактура,
	|	0                                                              КАК СуммаБезНДС,
	|	0                                                              КАК НДС,
	|	0                                                              КАК НДСУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеНДСкВычету) КАК ХозяйственнаяОперация,
	|	ДокументыОплатыГрафа7.НомерДокументаОплаты                      КАК НомерДокументаОплаты,
	|	ДокументыОплатыГрафа7.ДатаДокументаОплаты                       КАК ДатаДокументаОплаты,
	|	ВЫБОР
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|			ТОГДА ""20""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныйСоюз)
	|			ТОГДА ""19""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентАренда)
	|			ТОГДА ""06""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентРеализацияИмущества)
	|			ТОГДА ""06""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентИностранцы)
	|			ТОГДА ""06""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги)
	|			ТОГДА ""06""
	|		КОГДА НДСПредъявленный.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НалоговыйАгентКомитент)
	|			ТОГДА ""06""
	|		ИНАЧЕ """"
	|	КОНЕЦ                                                           КАК КодВидаОперации,
	|	НДСПредъявленный.РегламентнаяОперация                           КАК РегламентнаяОперация,
	|	НДСПредъявленный.РеализацияЭкспорт                              КАК ДокументОтгрузки,
	|	НДСПредъявленный.ВидДеятельностиНДС                             КАК ВидДеятельностиНДС,
	|	НДСПредъявленный.КорНаправлениеДеятельности                     КАК НаправлениеДеятельности
	|ИЗ
	|	НДСПредъявленныйПринятиеКВычету КАК НДСПредъявленный
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СчетаФактурыДокументы КАК СчетаФактурыДокументы
	|	ПО
	|		НДСПредъявленный.Организация = СчетаФактурыДокументы.Организация
	|		И НДСПредъявленный.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыОплатыГрафа7 КАК ДокументыОплатыГрафа7
	|	ПО
	|		НДСПредъявленный.Организация = ДокументыОплатыГрафа7.Организация
	|		И НДСПредъявленный.СчетФактура = ДокументыОплатыГрафа7.СчетФактура
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ИсправительныеСчетаФактуры КАК ИСФ
	|	ПО
	|		НДСПредъявленный.Организация = ИСФ.Организация
	|		И НДСПредъявленный.ИсправленныйСчетФактура = ИСФ.ИсправительныйСчетФактура
	|
	|ГДЕ
	|	НЕ НДСПредъявленный.ПовторныйВычет
	|	И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НДСПредъявленный.Событие В (
	|			ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПринятКВычету),
	|			ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.ПодтвержденаСтавка0),
	|			ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НеПодтвержденаСтавка0),
	|			ЗНАЧЕНИЕ(Перечисление.СобытияНДСПредъявленный.НДСПоДЦПринятКВычету))
	|";

	Запрос.УстановитьПараметр("НачалоПериода",     ПараметрыРасчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",      ПараметрыРасчета.КонецПериода);
	Запрос.УстановитьПараметр("МассивОрганизаций", ПараметрыРасчета.МассивОрганизаций);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;

	Запрос.Выполнить();

	Возврат "НДСЗаписиКнигиПокупокПоНДСПредъявленный";

КонецФункции

&ИзменениеИКонтроль("РассчитатьНДСЗаписиКнигиПродажПоНДСПредъявленный")
Функция смарт_РассчитатьНДСЗаписиКнигиПродажПоНДСПредъявленный(ПараметрыРасчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1                                                            КАК Приоритет,
	|	НДСПредъявленный.Период                                      КАК Период,
	|	НДСПредъявленный.Регистратор                                 КАК Регистратор,
	|	НДСПредъявленный.Организация                                 КАК Организация,
	|	НДСПредъявленный.Поставщик                                   КАК Покупатель,
	|	НДСПредъявленный.СчетФактура                                 КАК СчетФактура,
	|	НДСПредъявленный.ВидЦенности                                 КАК ВидЦенности,
	|	НДСПредъявленный.СтавкаНДС                                   КАК СтавкаНДС,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК ДатаОплаты,
	|	НЕОПРЕДЕЛЕНО                                                 КАК ДокументОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ВосстановлениеНДС) КАК Событие,
	|	НДСПредъявленный.Период                                      КАК ДатаСобытия,
	|	ЛОЖЬ                                                         КАК ЗаписьДополнительногоЛиста,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК КорректируемыйПериод,
	|	НЕОПРЕДЕЛЕНО                                                 КАК ДоговорКонтрагента,
	|	ЛОЖЬ                                                         КАК СторнирующаяЗаписьДопЛиста,
	|	НДСПредъявленный.ИсправленныйСчетФактура                     КАК ИсправленныйСчетФактура,
	|	ЛОЖЬ                                                         КАК Исправление,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК ДатаСчетаФактурыКомиссионера,
	|	ВЫБОР
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 20
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 20
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 18
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 18
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 10
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 5
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 5
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 7
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 7
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 22
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 22
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ НДСПредъявленный.СуммаБезНДС
	|	КОНЕЦ                                                        КАК СуммаБезНДС,
	|	НДСПредъявленный.НДС                                         КАК НДС,
	|	НДСПредъявленный.НДСУпр                                      КАК НДСУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)    КАК ХозяйственнаяОперация,
	|	""""                                                         КАК НомерДокументаОплаты,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК ДатаДокументаОплаты,
	|	""21""                                                       КАК КодВидаОперации,
	|	ИСТИНА                                                       КАК РегламентнаяОперация,
	|	НДСПредъявленный.ВидДеятельностиНДС                          КАК ВидДеятельностиНДС,
	|	НДСПредъявленный.НаправлениеДеятельности                     КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ НДСЗаписиКнигиПродажПоНДСПредъявленный
	|ИЗ
	|	НДСПредъявленныйВосстановлениеПодВидДеятельности КАК НДСПредъявленный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1                                                            КАК Приоритет,
	|	НДСПредъявленный.Период                                      КАК Период,
	|	НДСПредъявленный.Регистратор                                 КАК Регистратор,
	|	НДСПредъявленный.Организация                                 КАК Организация,
	|	НДСПредъявленный.Поставщик                                   КАК Покупатель,
	|	НДСПредъявленный.СчетФактура                                 КАК СчетФактура,
	|	НДСПредъявленный.ВидЦенности                                 КАК ВидЦенности,
	|	НДСПредъявленный.СтавкаНДС                                   КАК СтавкаНДС,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК ДатаОплаты,
	|	НЕОПРЕДЕЛЕНО                                                 КАК ДокументОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ВосстановлениеНДС) КАК Событие,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(СчетаФактурыДокументы.ДатаЗаписиКнигиПродаж, КВАРТАЛ) < НДСПредъявленный.Период
	|			ТОГДА СчетаФактурыДокументы.ДатаЗаписиКнигиПродаж
	|		ИНАЧЕ
	|			НДСПредъявленный.Период
	|	КОНЕЦ                                                        КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(СчетаФактурыДокументы.ДатаЗаписиКнигиПродаж, КВАРТАЛ) < НДСПредъявленный.Период
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ                                                        КАК ЗаписьДополнительногоЛиста,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(СчетаФактурыДокументы.ДатаЗаписиКнигиПродаж, КВАРТАЛ) < НДСПредъявленный.Период
	|			ТОГДА СчетаФактурыДокументы.ДатаЗаписиКнигиПродаж
	|		ИНАЧЕ
	|			ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ                                                        КАК КорректируемыйПериод,
	|	НЕОПРЕДЕЛЕНО                                                 КАК ДоговорКонтрагента,
	|	ЛОЖЬ                                                         КАК СторнирующаяЗаписьДопЛиста,
	|	НДСПредъявленный.ИсправленныйСчетФактура                     КАК ИсправленныйСчетФактура,
	|	ЛОЖЬ                                                         КАК Исправление,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК ДатаСчетаФактурыКомиссионера,
	|	ВЫБОР 
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 20
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 18
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 5
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 7
	//-- #1744 смарт: Шляпников 19.12.2024 
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА НДСПредъявленный.СуммаБезНДС = 0 И НДСПредъявленный.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)
	|			ТОГДА НДСПредъявленный.НДС * 100 / 22
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ НДСПредъявленный.СуммаБезНДС
	|	КОНЕЦ                                                        КАК СуммаБезНДС,
	|	НДСПредъявленный.НДС                                         КАК НДС,
	|	НДСПредъявленный.НДСУпр                                      КАК НДСУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)    КАК ХозяйственнаяОперация,
	|	""""                                                         КАК НомерДокументаОплаты,
	|	ДАТАВРЕМЯ(1,1,1)                                             КАК ДатаДокументаОплаты,
	|	СчетаФактурыДокументы.КодВидаОперацииНаУменьшение     КАК КодВидаОперации,
	|	ИСТИНА                                                       КАК РегламентнаяОперация,
	|	НДСПредъявленный.ВидДеятельностиНДС                          КАК ВидДеятельностиНДС,
	|	НДСПредъявленный.НаправлениеДеятельности                     КАК НаправлениеДеятельности
	|ИЗ
	|	НДСПредъявленныйВосстановлениеПоКСФ КАК НДСПредъявленный
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СчетаФактурыДокументы КАК СчетаФактурыДокументы
	|	ПО
	|		НДСПредъявленный.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|		И НДСПредъявленный.Организация = СчетаФактурыДокументы.Организация
	|";

	Запрос.УстановитьПараметр("НачалоПериода",      ПараметрыРасчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",       ПараметрыРасчета.КонецПериода);
	Запрос.УстановитьПараметр("МассивОрганизаций",  ПараметрыРасчета.МассивОрганизаций);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.Выполнить();

	Возврат "НДСЗаписиКнигиПродажПоНДСПредъявленный";

КонецФункции

#КонецОбласти