
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторСтрокиПолучателя;

&НаКлиенте
Перем ИмяЭлемента;

&НаКлиенте
Перем ПроверкаСуществованияФайлов;

&НаКлиенте
Перем ТекущийНомерВложения;

&НаКлиенте
Перем ПолучаемыеФайлы;

&НаКлиенте
Перем ПолученныеФайлы;

&НаКлиенте
Перем КонтекстВыбора;

&НаКлиенте
Перем CRM_ОбновитьАРМПослеЗаписи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СозданИзЭтапаСделки") Тогда
		СозданИзЭтапаСделки = Параметры.СозданИзЭтапаСделки;
	Иначе
		СозданИзЭтапаСделки = Ложь;
	КонецЕсли;
	
	// Запретим создание новых
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Запретим изменение документа пользователям, которых нет в учетной записи.
	ВключитьТолькоПросмотр = Ложь;
	
	Если ЗначениеЗаполнено(Объект.УчетнаяЗапись) Тогда // Если нет учетной записи, то открываем вложение типа EML.
		
		// Ответственному разрешено открывать письмо независимо от прочих проверок.
		Если НЕ Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь() Тогда
			
			// Проверим наличие доступа в учетной записи.
			Если НЕ Объект.УчетнаяЗапись.CRM_ЭтоОбщаяУчетнаяЗапись И НЕ CRM_ОбщегоНазначенияСервер.НайтиПользователяВУчетнойЗаписи(Объект.УчетнаяЗапись, Пользователи.ТекущийПользователь()) Тогда
				
				Если НЕ Объект.УчетнаяЗапись.CRM_РазрешитьПросмотрПисемВсемПользователям Тогда
					
					// Проверяем, открывается ли письмо из другого документа, задачи, БП и пр., если да, то письмо ставим в режим
					// "Только чтение".
					Если Параметры.Свойство("ОткрытиеИзФормы") И Параметры.ОткрытиеИзФормы Тогда
						ВключитьТолькоПросмотр = Истина;
					
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Недостаточно прав для работы с письмами учетной записи %1!"
"Текущий пользователь должен быть добавлен в список пользователей учетной записи либо"
"являться Ответственным данного письма либо"
"в учетной записи должен стоять флаг ""Разрешить просмотр писем всем пользователям системы"""
"';en='Insufficient rights for operation with letters account %1!"
"Current user needs to be added to the list"
"of users account or be"
"Responsible the letters or in account has the flag ""Messages Available for All Users""'"), Объект.УчетнаяЗапись.Наименование));
						Отказ = Истина;
						Возврат;
					КонецЕсли;		
				
				Иначе	
					ВключитьТолькоПросмотр = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключитьТолькоПросмотр Тогда
		ТолькоПросмотр = Истина;
		Элементы.КоманднаяПанельАтрибуты.Доступность = Ложь;
		Элементы.ГруппаИнтерес.Доступность = Ложь;
		Элементы.Документ_ЭлектронноеПисьмоВходящее_Команда_Ответить.Доступность = Ложь;
		Элементы.ДокументЭлектронноеПисьмоВходящееОтветитьВсем.Доступность = Ложь;
		Элементы.ДокументЭлектронноеПисьмоВходящееПереслать.Доступность = Ложь;
		Элементы.ФормаCRM_ОтклонитьОбращение.Доступность = Ложь;
		Элементы.ГруппаКомандаОтменитьОтклонение.Доступность = Ложь;
		Элементы.СписокПисемПереместитьВПапку.Доступность = Ложь;
	ИначеЕсли НЕ CRM_УправлениеЭлектроннойПочтой.ТекущийПользовательПолучитьПравоУчетнойЗаписи(Объект.УчетнаяЗапись, "Запись") Тогда	
		Элементы.Документ_ЭлектронноеПисьмоВходящее_Команда_Ответить.Доступность = Ложь;
		Элементы.ДокументЭлектронноеПисьмоВходящееОтветитьВсем.Доступность = Ложь;
		Элементы.ДокументЭлектронноеПисьмоВходящееПереслать.Доступность = Ложь;
	КонецЕсли;
	
	// Сформируем представление отправителя.
	ОтправительПредставление = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Объект.ОтправительПредставление, Объект.ОтправительАдрес, Объект.ОтправительКонтакт);
	
	// Сформируем представление Кому и Копии.
	ПолучателиПредставление            = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(Объект.ПолучателиПисьма);
	ПолучателиКопийПредставление       = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(Объект.ПолучателиКопий);
	ПолучателиОтветаПредставление      = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(Объект.ПолучателиОтвета);
	
	ДополнительнаяИнформацияОПисьме = НСтр("ru='Создано:'") + "   " + Объект.Дата + НСтр("ru='"
"Получено:'") + "  " + Объект.ДатаПолучения + НСтр("ru='"
"Важность:'") + "  " + Объект.Важность + НСтр("ru='"
"Кодировка:'") + " " + Объект.Кодировка;
	
	CRM_СформироватьЗаголовок(Объект.Тема, Папка, Объект.УчетнаяЗапись);
	
	Если ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		
		Если ЗначениеЗаполнено(Объект.ОтправительКонтакт) Тогда
			ОтправительВладелец = Объект.ОтправительКонтакт.Владелец;
			Элементы.ОтправительВладелец.Видимость = Истина;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ОтправительКонтакт) Тогда
		
		Объект.ОтправительКонтакт = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		
	КонецЕсли;
	
	Элементы.СоздатьКонтакт.Видимость = Не ЗначениеЗаполнено(Объект.ОтправительКонтакт);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьТекстHTML();
	КонецЕсли;
	// -CRM
	
	ТекущийПользователь  = Пользователи.АвторизованныйПользователь();
	ТекущееПодразделение = ТекущийПользователь.Подразделение;
	
	ЭтотОбъект.СкрытоеПолеHTML = "<HTML><BODY onResize='interactionButton.click()' onLoad='interactionButton.click()'>
		|<button id='interactionButton' style='display: none'>Кнопка взаимодействия</button></BODY></HTML>";	
	Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.ОбластьНастроек;
	CRM_Теги.УстановитьПараметрыВыбора(Элементы);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ИспользоватьБизнесПроцессы = Константы.CRM_ИспользоватьБизнесПроцессы.Получить();
	ДобавитьУдалитьКомандуСозданияБизнесПроцесса();
	ПредметПредставление = CRM_ОбщегоНазначенияСервер.ПолучитьПредставлениеПредметаДокумента(Предмет);
	
	Элементы.ПредметПредставление.Видимость = ЗначениеЗаполнено(ПредметПредставление);
	Элементы.ИзменитьПредмет.Видимость = Истина;
	Элементы.ПредметИзменение.Видимость = Ложь;
	
	CRM_МетодыФормДокументовСервер.СоздатьНеобходимыеРеквизитыИЭлементыДляГруппыИнтерес(ЭтотОбъект, "ГруппаИнтерес");
				
	Если ЗначениеЗаполнено(Объект.ОтправительКонтакт) И
		(ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")) Тогда
		ОтображатьКаналИсточник = Истина;
		Партнер = ?(ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры"),Объект.ОтправительКонтакт,Объект.ОтправительКонтакт.Владелец);
	КонецЕсли;
	
	// +ПанельБП
	ЗаполнитьГруппуГиперссылок();
	// -ПанельБП
	
	СформироватьОписаниеКаналаИсточника();
	
	НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере();
	
	ЗаполнятьПервичныйИнтерес = Константы.CRM_ЗаполнятьПервичныйИнтерес.Получить();
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.РанееЗарегистрированныйИнтерес.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьТаблицыПолучателей();
		
	
	НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	
	ОткрытоИзФормыНапоминаний = Ложь;
	Параметры.Свойство("ОткрытоИзФормыНапоминаний", ОткрытоИзФормыНапоминаний); 
	
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();	
	УстановитьПоложениеТумблераСтатусПисьма();
	
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// Лиды
	АдресНастройкиЭлементовСостоянияОбращения = CRM_МетодыФормДокументовСервер.СохранитьНастройкиЭлементовСостоянияОбращения(ЭтаФорма,
																															МассивЭлементовСостоянияОбращения());
	ОбновитьСостояниеОбращения();
	Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.CRM_РольОтветственного) И Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.CRM_РольОтветственного.Видимость = Истина;
	КонецЕсли;
	
	// Показать/скрыть свойства по умолчанию	
	CRM_ПоказатьСкрытьСвойстваНаСервере(Истина);
	CRM_ОбновитьДатуПисьма();
	
	ВсеВложенияПометка = ХранилищеОбщихНастроекЗагрузить("ПоказыватьВсеВложения", "ПоказыватьВсеВложения", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОткрытоИзФормыНапоминаний Тогда
		//Оповестить("ПисьмоУспешноОткрытоИзНапоминания",Новый Структура("Ссылка", Объект.Ссылка));
		Оповестить("ПисьмоУспешноОткрытоИзНапоминания",Новый Структура("Ссылка, Пользователь", Объект.Ссылка, ТекущийПользователь));
	КонецЕсли;
	
	ДоступностьПервичногоИнтереса();
	
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если CRM_НапоминанияСервер.CRM_ПроверитьНапоминанияОПисьме(Объект.Ссылка) Тогда
	
		Оповестить("ОбновитьНапоминания", Новый Структура("ОбновитьНапоминанияОВходящихПисьмах", Истина));
	
	КонецЕсли; 
	
	УстановитьПометкуОПрочтении();
	
	ОформлениеИзбранного();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтруктураРеквизитов = Взаимодействия.СтруктураРеквизитовВзаимодействия(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураРеквизитов, "Предмет, Рассмотрено, РассмотретьПосле, Папка");
	ОбработатьНеобходимостьУведомленияОПрочтении();
	
	ПараметрыТегов	= ПараметрыТегов();
	CRM_Теги.ПриЧтенииНаСервере(ЭтотОбъект, Элементы, ПараметрыТегов);
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// CRM_УправлениеДоступом
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступомУровниДоступа");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец CRM_УправлениеДоступом
	
	// +CRM в БСП 2.2 это уже есть!
	// Установим текст и вид текста.
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
		Элементы.ТекстПисьма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// -CRM
	
	// Заполним вложения
	ВложенияОчищеныПоНастройке = Ложь;
	
	Вложения.Очистить();
	
	табВложения = CRM_УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(Объект.Ссылка);
	
	Для Каждого Стр Из табВложения Цикл
		
		новСтр = Вложения.Добавить();
		новСтр.Ссылка			= Стр.Ссылка;
		новСтр.ИмяФайла			= Стр.ИмяФайла;
		новСтр.ИндексКартинки	= Стр.ИндексКартинки;
		новСтр.Размер			= Стр.Размер;
		РазмерВложения			= Цел(Стр.Размер/1024);
		новСтр.РазмерСтрокой	= ?(РазмерВложения > 0, Строка(РазмерВложения) + " кб", Строка(Стр.Размер) + " байт");
		новСтр.ИДФайлаЭлектронногоПисьмаОтбор = ?(Стр.ИДФайлаЭлектронногоПисьма = "", "###", Стр.ИДФайлаЭлектронногоПисьма);
		
		Если Не ВложенияОчищеныПоНастройке И Стр.ОчищенПоНастройке Тогда
			ВложенияОчищеныПоНастройке = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаленноеВложение Из Объект.НепринятыеВложения Цикл
		
		НовоеВложение = Вложения.Добавить();
		НовоеВложение.ИмяФайла = УдаленноеВложение.ИмяВложение;
		НовоеВложение.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(".msg") + 1;
		НовоеВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#";
		
	КонецЦикла;
	
	Вложения.Сортировать("ИДФайлаЭлектронногоПисьмаОтбор");
	
	Элементы.CRM_ЗагрузитьВложения.Видимость = ВложенияОчищеныПоНастройке;
	Элементы.СохранитьВсеВложения.Доступность = Не ВложенияОчищеныПоНастройке;
	
	ОбработатьТекстHTML();
	
	СформироватьСсылкиВложений();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// +CRM
	Если НЕ Настройки["CRM_ПоказатьСкрытьСвойства"] = Неопределено Тогда
		CRM_ПоказатьСкрытьСвойстваНаСервере(Настройки["CRM_ПоказатьСкрытьСвойства"]);
	КонецЕсли;
	// -CRM
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
		ИЛИ ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Если НЕ ИмяЭлемента = "" Тогда
			Если ИмяЭлемента = "ОтправительКонтакт" Тогда
				Объект[ИмяЭлемента] = НовыйОбъект;
				ОбработкаВыбораКонтактаОтправителя();
			Иначе
				ТекДанные			= ЭтотОбъект[ИмяЭлемента].НайтиПоИдентификатору(ИдентификаторСтрокиПолучателя);
				ТекДанные.Контакт	= НовыйОбъект;
			КонецЕсли;
			ИмяЭлемента			= "";
			ТекущееДействие		= Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(НовыйОбъект) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		Если МодульУправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбновитьЭлементыДополнительныхРеквизитов();
			МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	Если ИмяСобытия = "Создан новый партнер из письма" Тогда
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			КонтактноеЛицо	= Параметр;
			Клиент			= CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Параметр, "Владелец");
		Иначе	
			Клиент			= Параметр;
			КонтактноеЛицо	= ПолучитьОсновноеКонтактноеЛицо(Клиент);
		КонецЕсли;	
		Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			Объект.ОтправительКонтакт = КонтактноеЛицо;
			ОтправительВладелец = Клиент;
			ОтправительПредставление = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Объект.ОтправительПредставление, Объект.ОтправительАдрес, Объект.ОтправительКонтакт);
			Элементы.ОтправительВладелец.Видимость = Истина;
		Иначе
			Объект.ОтправительКонтакт = Клиент;
			ОтправительПредставление = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Объект.ОтправительПредставление, Объект.ОтправительАдрес, Объект.ОтправительКонтакт);
			Элементы.ОтправительВладелец.Видимость = Ложь;
		КонецЕсли;
		ЗадатьВопросОСохраненииКИ(Истина);
		Модифицированность = Истина;
		
		// +ПанельБП
	ИначеЕсли ИмяСобытия = "ЗадачаВыполнена" ИЛИ ИмяСобытия = "Запись_ЗадачаИсполнителя" ИЛИ ИмяСобытия = "СохраненаЛичнаяЗадача" Тогда
		Если ИмяСобытия = "СохраненаЛичнаяЗадача" Тогда
			Если ОбновитьДанныеДокументаПоСсылке() Тогда
				ОбновитьОтображениеДанных();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьГруппуГиперссылок();
		НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
		УстановитьПоложениеТумблераСтатусПисьма();	
		
		// -ПанельБП
		
	ИначеЕсли ИмяСобытия = "Создан новый партнер" ИЛИ  ИмяСобытия = "Создано новое контактное лицо" ИЛИ  ИмяСобытия = "НовыйПотенциальныйКлиентЗаписан" Тогда
		
		Если НЕ ИмяЭлемента = "" Тогда
			Если ((ИмяСобытия = "Создан новый партнер" ИЛИ ИмяСобытия = "НовыйПотенциальныйКлиентЗаписан") И ТекущееДействие = 0) ИЛИ (ИмяСобытия = "Создано новое контактное лицо" И ТекущееДействие = 1) Тогда
				Если ИмяЭлемента = "ОтправительКонтакт" Тогда
					Объект[ИмяЭлемента] = Параметр;
					ОбработкаВыбораКонтактаОтправителя();
				Иначе
					ТекДанные			= ЭтотОбъект[ИмяЭлемента].НайтиПоИдентификатору(ИдентификаторСтрокиПолучателя);
					ТекДанные.Контакт	= Параметр;
				КонецЕсли;
				ИмяЭлемента			= "";
				ТекущееДействие		= Неопределено;
			КонецЕсли;
			Модифицированность = Истина;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "CRM_УстановленФлагОбработано" И Источник = ЭтотОбъект Тогда
		
		Если ЭтотОбъект.Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ПринятиеОбращения" И Источник = Объект.Ссылка Тогда
		
		Закрыть();
		
	ИначеЕсли ИмяСобытия = "СтартованНовыйНезависимыйБП" И Объект.Ссылка = Параметр Тогда
		
		Прочитать();
		
	ИначеЕсли ИмяСобытия = "СозданПредметВзаимодействия" И Объект.Ссылка = Параметр Тогда
		
		Прочитать();
		
	ИначеЕсли ИмяСобытия = "ОбновитьОблакоТегов" И (ЭтотОбъект = Параметр) Тогда
		
		ОбновитьОблакоТегов();
		
	КонецЕсли;
	
	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	НаличиеУчастников = ?(ЗначениеЗаполнено(Партнер), Истина,Ложь);
	Если ЗаполнятьПервичныйИнтерес Тогда
		
		Если НаличиеУчастников Тогда
			Если ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
				Если ТипЗнч(КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
					УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"ИсточникПервичногоИнтереса");
				КонецЕсли;
			Иначе
				УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"ИсточникПервичногоИнтереса");
			КонецЕсли;
		Иначе
			УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"КаналПервичногоИнтереса");
			УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"ИсточникПервичногоИнтереса");
		КонецЕсли;
		
	Иначе
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"КаналПервичногоИнтереса");
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"ИсточникПервичногоИнтереса");
	КонецЕсли;
	
	ТабПервичныйИнтерес = Неопределено;
	Попытка
		ТабПервичныйИнтерес = ПервичныйИнтерес.Получить(0);
	Исключение	КонецПопытки;
	Если ТабПервичныйИнтерес <> Неопределено 
		И ЗначениеЗаполнено(ТабПервичныйИнтерес.КаналПервичногоИнтереса) 
		И ТабПервичныйИнтерес.Актуальность = Истина Тогда 
		
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"КаналПервичногоИнтереса");
		УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,"ИсточникПервичногоИнтереса");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Рассмотрено И ТребуетсяЗапросУведомленияОПрочтении Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Отправитель запросил уведомление о прочтении. Отправить?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Да,
			НСтр("ru='Запрос уведомления'"));
		
	КонецЕсли;
	
	ПроверитьСкорректироватьПолучателейПисьма();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		CRM_УправлениеЭлектроннойПочтой.УстановитьПризнакОтправкиУведомления(Объект.Ссылка, Истина);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		CRM_УправлениеЭлектроннойПочтой.УстановитьПризнакОтправкиУведомления(Объект.Ссылка, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Взаимодействия.ПередЗаписьюВзаимодействияИзФормы(ЭтотОбъект, ТекущийОбъект, ИзменилисьКонтакты);
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	Если Рассмотрено И ТребуетсяУстановкаФлагаОтправкиУведомления Тогда
		УправлениеЭлектроннойПочтой.УстановитьПризнакОтправкиУведомления(Объект.Ссылка, Истина);
	КонецЕсли;
	
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Взаимодействия.ПриЗаписиВзаимодействияИзФормы(ТекущийОбъект, ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		// Зафиксировать актуальный источник привлечения.
		НаборРегистра = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
		НаборРегистра.Отбор.Сделка.Установить(ТекущийОбъект.Ссылка);
		НаборРегистра.Прочитать();
		НаборРегистра.Очистить();
		
		Если ЗначениеЗаполнено(Партнер) И (ЗначениеЗаполнено(КаналПервичногоИнтереса) ИЛИ ЗначениеЗаполнено(ИсточникПервичногоИнтереса)) Тогда
			Запись								= НаборРегистра.Добавить();
			Запись.Период						= ?(ЗначениеЗаполнено(ТекущийОбъект.ДатаПолучения), ТекущийОбъект.ДатаПолучения, ТекущийОбъект.Дата);
			Запись.Партнер						= Партнер;
			Запись.Сделка						= ТекущийОбъект.Ссылка;
			Запись.ИсточникПервичногоИнтереса	= ИсточникПервичногоИнтереса;
			Запись.КаналПервичногоИнтереса		= КаналПервичногоИнтереса;
		КонецЕсли;
		
		НаборРегистра.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленыДанныеЭлектронногоПисьмаВходящего", Объект.Ссылка);
	
	Если CRM_ОбновитьАРМПослеЗаписи = Истина Тогда
		CRM_ОбновитьАРМПослеЗаписи = Неопределено;
		Оповестить("ОбновитьКолонкуАРМ", "НеРазобрано");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.УточнениеКонтактов") Тогда
		
		//Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//ЗаполнитьУточненныеКонтакты(ВыбранноеЗначение);
		//ИзменилисьКонтакты = Истина;
		//Модифицированность = Истина;
		
	// +CRM	
	ИначеЕсли КонтекстВыбора = "ВыборПредмета" Тогда
		
		Предмет = ВыбранноеЗначение;
		Модифицированность = Истина;
		КонтекстВыбора = Неопределено;
	// -CRM	
	Иначе
		
		ВзаимодействияКлиент.ФормаОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора, КонтекстВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

// +CRM
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	CRM_ТрудозатратыКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	CRM_ТрудозатратыКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры
// -CRM

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкрытоеПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Попытка
		clientWidth	= ДанныеСобытия.Document.children[0].clientWidth;
	Исключение
		clientWidth	= 0;
	КонецПопытки;
	Если clientWidth > 0 Тогда
		ШиринаТегов	= Окр(clientWidth / 10, 0, РежимОкругления.Окр15как20) - 6;
		ОбновитьОблакоТегов();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Ответственный".
//
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если Объект.Ответственный = Неопределено Тогда
		Объект.Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	ВыбранПользователь = (ТипЗнч(Объект.Ответственный) = Тип("СправочникСсылка.Пользователи"));
	
	Если ВыбранПользователь Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ТекущийПользователь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОтветственныйПриИзменении()

&НаКлиенте
Процедура CRM_РольОтветственногоПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.CRM_РольОтветственного) Тогда
		
		Объект.Ответственный = ТекущийПользователь;
		
		Элементы.Ответственный.Видимость = Истина;
		Элементы.CRM_РольОтветственного.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметИзменениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВзаимодействияКлиент.ПредметНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметИзменениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ПредметИзменение.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	// откроем форму предмета
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Предмет) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", 
			Новый Структура("Ключ, ОткрытиеИзФормы", Предмет, Истина),,,,,,РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли ТипЗнч(Предмет) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда			
		ОткрытьФорму("Документ.ЭлектронноеПисьмоВходящее.Форма.CRM_ФормаДокумента", 
			Новый Структура("Ключ, ОткрытиеИзФормы", Предмет, Истина),,,,,,РежимОткрытияОкнаФормы.Независимый);		

	Иначе			
		ПоказатьЗначение(, Предмет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ГиперссылкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.Имя = "_ЛичнаяЗадачаСтрокой" Тогда
		ПоказатьЗначение(, ЭтотОбъект._ЛичнаяЗадача);
	ИначеЕсли Элемент.Имя = "_ПоручениеСтрокой" Тогда
		ПоказатьЗначение(, ЭтотОбъект._Поручение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительВладелецНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ОтправительВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметИзменениеПриИзменении(Элемент)
	
	ПредметПредставление = CRM_ОбщегоНазначенияСервер.ПолучитьПредставлениеПредметаДокумента(Предмет);
	
КонецПроцедуры

&НаКлиенте
Процедура КаналПервичногоИнтересаПриИзменении(Элемент)
	
	ИсточникПервичногоИнтереса = Неопределено;
	ДоступностьПервичногоИнтереса();
	Если ИсточникПервичногоИнтереса = Неопределено ИЛИ ИсточникПервичногоИнтереса.Пустая() Тогда
		Элементы.ИсточникПервичногоИнтереса.ПодсказкаВвода = Строка(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(КаналПервичногоИнтереса, "ТипЗначения"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПервичногоИнтересаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(КаналПервичногоИнтереса) 
		И ТипКаналаПервичногоИнтереса(КаналПервичногоИнтереса)= Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекущаяСтрока", ИсточникПервичногоИнтереса);
		ПараметрыФормы.Вставить("СкрытьПодменюВид", Истина);
		
		ФормаВыбора = ПолучитьФорму("Справочник.МаркетинговыеМероприятия.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
		
		ЭлементОтбора					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Завершено");
		ЭлементОтбора.ПравоеЗначение	= Истина;
		ЭлементОтбора.Использование		= Истина;
		
		ГруппаОтбора					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы			= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ЭлементОтбора					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ДатаОкончания");
		ЭлементОтбора.ПравоеЗначение	= Дата("00010101");
		ЭлементОтбора.Использование		= Истина;
		
		ЭлементОтбора					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("CRM_ДатаАктуальности");
		ЭлементОтбора.ПравоеЗначение	= НачалоДня(ТекущаяДата());
		ЭлементОтбора.Использование		= Истина;
		
		ФормаВыбора.Открыть();
	КонецЕсли;
	
	ДоступностьПервичногоИнтереса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактПриИзменении(Элемент)
	
	ОбработкаВыбораКонтактаОтправителя();
	ПерезаполнитьПодсказкуОбАктивныхИнтересах();		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение.Свойство("ТекущееДействие") Тогда
			ТекущееДействие = ВыбранноеЗначение.ТекущееДействие;
		Иначе
			ТекущееДействие = Неопределено;
		КонецЕсли;
		
		ОткрытьФорму(ВыбранноеЗначение.ИмяФормы,ВыбранноеЗначение.ПараметрыФормы,?(ВыбранноеЗначение.РежимВыбора,Элемент,ЭтотОбъект),,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты", Объект.ОтправительАдрес);
	ПараметрыНового.Вставить("Наименование", СокрЛП(СтрЗаменить(Объект.ОтправительПредставление, "<"+Объект.ОтправительАдрес+">", "")));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"				,Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"		,Истина);
	ПараметрыФормыВыбора.Вставить("ПараметрыНового"	,ПараметрыНового);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Клиенты");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.CRM_ПотенциальныеКлиенты.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Потенциальные клиенты");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Контактные лица");
	
КонецПроцедуры

&НаКлиенте
// Процедура, вызываемая после ответа пользователя по выбору создания типа контакта
// 
// Параметры:
//   Результат 					- ЭлементСпискаЗначений - Тип выбранного контакта для создания
//   ДополнительныеПараметры 	- Структура - Структура с передаваемыми доп. параметрами
//
Процедура СоздатьКонтактПослеВыбораТипаКонтакта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ВыбранноеЗначение = Результат.Значение;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение.Свойство("ТекущееДействие") Тогда
			ТекущееДействие = ВыбранноеЗначение.ТекущееДействие;
		Иначе
			ТекущееДействие = Неопределено;
		КонецЕсли;
		
		ОткрытьФорму(ВыбранноеЗначение.ИмяФормы,ВыбранноеЗначение.ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
	//Если Результат = Неопределено Тогда
	//	Возврат
	//КонецЕсли;
	//
	//Если Результат.Значение = "КонтактныеЛицаПартнеров" Тогда
	//	ПараметрыФормы = Новый Структура("Основание", Новый Структура("НомерТелефона", Объект.АбонентКакСвязаться));
	//	ИмяФормыВыбора = ".Форма.CRM_ФормаБыстрогоВвода";
	//			
	//ИначеЕсли Результат.Значение = "Партнеры" Тогда
	//	СтруктураПараметрыНового = Новый Структура;
	//	СтруктураПараметрыНового.Вставить("Телефон", Объект.АбонентКакСвязаться);
	//	СтруктураПараметрыНового.Вставить("Наименование" , ?(СтрНайти(Объект.АбонентПредставление, "!!!") = 0, Объект.АбонентПредставление, ""));
	//	ПараметрыФормы = Новый Структура("Основание, ПараметрыНового", Объект.Ссылка, СтруктураПараметрыНового);
	//	ИмяФормыВыбора = ".ФормаОбъекта";
	//Иначе
	//	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	//	ИмяФормыВыбора = ".ФормаОбъекта";
	//КонецЕсли;
	//ОткрытьФорму("Справочник." + Результат.Значение + ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "СоздатьКонтактВыполнить".
//
Процедура СоздатьКонтактВыполнить()
	
	ИмяЭлемента						= "ОтправительКонтакт";
	ИдентификаторСтрокиПолучателя	= "";
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты", Объект.ОтправительАдрес);
	ПараметрыНового.Вставить("Наименование", СокрЛП(СтрЗаменить(Объект.ОтправительПредставление, "<"+Объект.ОтправительАдрес+">", "")));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПараметрыНового",ПараметрыНового);
	
	СписокИнтерактивноСоздаваемыхКонтактов = Новый СписокЗначений();
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",0);
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить(СтруктураДанныхВыбора,"Создать 'Клиента'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.CRM_ПотенциальныеКлиенты.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",0);
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить(СтруктураДанныхВыбора,"Создать 'Потенциального клиента'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаБыстрогоВвода");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",1);
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить(СтруктураДанныхВыбора,"Создать 'Контактное лицо'");
	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьКонтактПослеВыбораТипаКонтакта", ЭтотОбъект);
	ПоказатьВыборИзМеню(НовоеОповещение, СписокИнтерактивноСоздаваемыхКонтактов, Элементы.СоздатьКонтакт);
	
КонецПроцедуры // СоздатьКонтактВыполнить()

&НаКлиенте
Процедура ОтправительКонтактАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПолучателиКонтактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение.Свойство("ТекущееДействие") Тогда
			ТекущееДействие = ВыбранноеЗначение.ТекущееДействие;
		Иначе
			ТекущееДействие = Неопределено;
		КонецЕсли;
		
		ОткрытьФорму(ВыбранноеЗначение.ИмяФормы,ВыбранноеЗначение.ПараметрыФормы,?(ВыбранноеЗначение.РежимВыбора,Элемент,ЭтотОбъект),,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПолучателиКонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты"	,ТекДанные.Адрес);
	ПараметрыНового.Вставить("Наименование"	,ТекДанные.Представление);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"				,Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"		,Истина);
	ПараметрыФормыВыбора.Вставить("ПараметрыНового"	,ПараметрыНового);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Клиенты");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Контактные лица");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Пользователи.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Пользователи");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.ФизическиеЛица.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Физические лица");
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПолучателиКонтактАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ИмяЭлемента						= "Получатели";
	ИдентификаторСтрокиПолучателя	= Элементы.Получатели.ТекущаяСтрока;
	
	Элемент.СписокВыбора.Очистить();
	
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты"	,ТекДанные.Адрес);
	ПараметрыНового.Вставить("Наименование"	,ТекДанные.Представление);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПараметрыНового",ПараметрыНового);
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",0);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Клиента'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаБыстрогоВвода");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",1);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Контактное лицо'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Пользователи.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",2);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Пользователя'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.ФизическиеЛица.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",3);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Физическое лицо'");
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	CRM_ОбщегоНазначенияКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element, Объект.Ссылка, Элемент.Документ);
	
КонецПроцедуры

// +CRM

&НаКлиенте
Процедура СостояниеЛидаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ Элементы.ГруппаСостояниеЛида.Видимость Тогда
		Элементы.ГруппаСостояниеЛида.Видимость = Истина;
		ПодключитьОбработчикОжидания("ВывестиГруппаСостояниеЛида", 0.1, Истина);
		ПодключитьОбработчикОжидания("ЗакрытьГруппаСостояниеЛида", 1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВывестиГруппаСостояниеЛида()
	Элементы.ГруппаСостояниеЛида.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьГруппаСостояниеЛида()
	
	Если Элементы.ГруппаСостояниеЛида.Скрыта() Тогда
		Если Элементы.ГруппаСостояниеЛида.Видимость Тогда
			Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ЗакрытьГруппаСостояниеЛида");
			#Если ВебКлиент Тогда
				ПодключитьОбработчикОжидания("ЗакрытьГруппаСостояниеЛида", 0.1, Истина);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// -CRM

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучателиКопии

&НаКлиенте
Процедура ПолучателиКопииКонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ПолучателиКопии.ТекущиеДанные;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты"	,ТекДанные.Адрес);
	ПараметрыНового.Вставить("Наименование"	,ТекДанные.Представление);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"				,Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"		,Истина);
	ПараметрыФормыВыбора.Вставить("ПараметрыНового"	,ПараметрыНового);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Клиенты");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Контактные лица");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Пользователи.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Пользователи");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Истина);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.ФизическиеЛица.ФормаВыбора");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормыВыбора);
	ДанныеВыбора.Добавить(СтруктураДанныхВыбора,"Физические лица");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиКопииКонтактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение.Свойство("ТекущееДействие") Тогда
			ТекущееДействие = ВыбранноеЗначение.ТекущееДействие;
		Иначе
			ТекущееДействие = Неопределено;
		КонецЕсли;
		
		ОткрытьФорму(ВыбранноеЗначение.ИмяФормы,ВыбранноеЗначение.ПараметрыФормы,?(ВыбранноеЗначение.РежимВыбора,Элемент,ЭтотОбъект),,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиКопииКонтактАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ИмяЭлемента						= "ПолучателиКопии";
	ИдентификаторСтрокиПолучателя	= Элементы.ПолучателиКопии.ТекущаяСтрока;
	
	Элемент.СписокВыбора.Очистить();
	
	ТекДанные = Элементы.ПолучателиКопии.ТекущиеДанные;
	
	ПараметрыНового = Новый Структура();
	ПараметрыНового.Вставить("АдресПочты"	,ТекДанные.Адрес);
	ПараметрыНового.Вставить("Наименование"	,ТекДанные.Представление);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПараметрыНового",ПараметрыНового);
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Партнеры.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",0);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Клиента'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаБыстрогоВвода");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",1);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Контактное лицо'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.Пользователи.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",2);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Пользователя'");
	
	СтруктураДанныхВыбора = Новый Структура;
	СтруктураДанныхВыбора.Вставить("РежимВыбора"	,Ложь);
	СтруктураДанныхВыбора.Вставить("ИмяФормы"		,"Справочник.ФизическиеЛица.ФормаОбъекта");
	СтруктураДанныхВыбора.Вставить("ПараметрыФормы"	,ПараметрыФормы);
	СтруктураДанныхВыбора.Вставить("ТекущееДействие",3);
	Элемент.СписокВыбора.Добавить(СтруктураДанныхВыбора,"Создать 'Физическое лицо'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ответить(Команда)
	
	Если Не ПроверитьНаВозможностьОтпавкиПисьма(Объект.УчетнаяЗапись) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Учетная запись не предназначена для отправки писем'"));
		Возврат;
		
	КонецЕсли;
	
	Записать();
	
	Основание = Новый Структура("Основание, Команда", Объект.Ссылка, "Ответить");
	ПараметрыОткрытия = Новый Структура("Основание, Ключ", Основание,ПолучитьСсылкуНовогоДокумента());
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьВсем(Команда)
	
	Если Не ПроверитьНаВозможностьОтпавкиПисьма(Объект.УчетнаяЗапись) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Учетная запись не предназначена для отправки писем'"));
		Возврат;
		
	КонецЕсли;
	
	Основание = Новый Структура("Основание, Команда", Объект.Ссылка, "ОтветитьВсем");
	ПараметрыОткрытия = Новый Структура("Основание, Ключ", Основание,ПолучитьСсылкуНовогоДокумента());
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Переслать(Команда)
	
	Если Не ПроверитьНаВозможностьОтпавкиПисьма(Объект.УчетнаяЗапись) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Учетная запись не предназначена для отправки писем'"));
		Возврат;
		
	КонецЕсли;
	
	Основание = Новый Структура("Основание, Команда", Объект.Ссылка, "Переслать");
	ПараметрыОткрытия = Новый Структура("Основание, Ключ", Основание,ПолучитьСсылкуНовогоДокумента());
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПредмет(Команда)
	
	Элементы.ПредметПредставление.Видимость = Ложь;
	Элементы.ПредметИзменение.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПисьма(Команда)
	
	ТекстЗаголовкиИнтернета = Новый ТекстовыйДокумент;
	ТекстЗаголовкиИнтернета.ДобавитьСтроку(Объект.ВнутреннийЗаголовок);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Создано", Объект.Дата);
	СтруктураПараметры.Вставить("Получено", Объект.ДатаПолучения);
	СтруктураПараметры.Вставить("УведомитьОДоставке", Объект.УведомитьОДоставке);
	СтруктураПараметры.Вставить("УведомитьОПрочтении", Объект.УведомитьОПрочтении);
	СтруктураПараметры.Вставить("ЗаголовкиИнтернета", ТекстЗаголовкиИнтернета);
	СтруктураПараметры.Вставить("Письмо", Объект.Ссылка);
	СтруктураПараметры.Вставить("ТипПисьма", "ЭлектронноеПисьмоВходящее");
	СтруктураПараметры.Вставить("Кодировка", Объект.Кодировка);
	СтруктураПараметры.Вставить("ВнутреннийНомер", Объект.Номер);
	СтруктураПараметры.Вставить("УчетнаяЗапись", Объект.УчетнаяЗапись);
	СтруктураПараметры.Вставить("Папка", Папка);	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПараметрыПисьмаЗавершение", ЭтотОбъект);
	Результат = ОткрытьФорму("Обработка.CRM_МенеджерПочты.Форма.ПараметрыЭлектронногоПисьма",
		СтруктураПараметры, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПисьмаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Объект.Кодировка <> Результат.Кодировка Тогда
			Объект.Кодировка = Результат.Кодировка;
			ПреобразоватьКодировкуПисьма(Объект.Кодировка);			
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачу(Команда)
	
	CRM_БизнесПроцессыИЗадачиВызовСервера.Выполнить_Задачу(ЭтотОбъект._ЛичнаяЗадача, Истина);
	ПоказатьОповещениеПользователя(
	НСтр("ru='Задача выполнена'"),
	ПолучитьНавигационнуюСсылку(ЭтотОбъект._ЛичнаяЗадача),
	Строка(ЭтотОбъект._ЛичнаяЗадача));	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ВыполнитьЗадачуЗавершение", ЭтотОбъект);
	CRM_УправлениеЭлектроннойПочтойКлиент.ВопросПеренестиПисьмоВПапкуОбработанные(Объект.УчетнаяЗапись, Папка, ОписаниеОповещения);		
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуЗавершение(ПапкаОтработанные, ДополнительныеПараметры) Экспорт
	
	Рассмотрено = Истина;
	УстановитьПоложениеТумблераСтатусПисьма();	
	Модифицированность = Истина;
	Если НЕ ПапкаОтработанные = ПредопределенноеЗначение("Справочник.ПапкиЭлектронныхПисем.ПустаяСсылка") Тогда
		Папка = ПапкаОтработанные;
		Попытка
			Записать();
			УстановитьПапкуЭлектронногоПисьма(Объект.Ссылка, Папка, Ложь);
			Оповестить("CRM_УстановленФлагОбработано");
			Закрыть();
			Возврат;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось перенести письмо'"));
		КонецПопытки;
	КонецЕсли;
	
	ЗаполнитьГруппуГиперссылок();
		
	НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	
	Оповестить("ЗадачаВыполнена");
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьПолучателей(Команда)
	
	Элементы.СкрытьПоказатьПолучателей.Пометка = НЕ Элементы.СкрытьПоказатьПолучателей.Пометка;
	Элементы.ТабПолучатели.Видимость = Элементы.СкрытьПоказатьПолучателей.Пометка;
	Если Элементы.ТабПолучатели.Видимость = Истина Тогда
		Для каждого Элемент Из Получатели Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.Контакт) Тогда
				Элемент.Контакт = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьПолучателейКопии(Команда)
	
	Элементы.СкрытьПоказатьПолучателейКопии.Пометка = НЕ Элементы.СкрытьПоказатьПолучателейКопии.Пометка;
	Элементы.ТабПолучателиКопии.Видимость = Элементы.СкрытьПоказатьПолучателейКопии.Пометка;
	Если Элементы.ТабПолучатели.Видимость = Истина Тогда
		Для каждого Элемент Из ПолучателиКопии Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.Контакт) Тогда
				Элемент.Контакт = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПеренестиВОбработанные()
	
	ТекущееСостояние = Неопределено;
	CRM_МетодыФормДокументовСервер.ОбращениеНельзяОтклонить(Объект.Ссылка, ТекущееСостояние);
	
	Если ТекущееСостояние = ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Новый") Тогда
		ДополнительныеПараметры = Новый Структура("ПропуститьВопрос", Истина);
		CRM_ВыполнитьОтклонениеОбращения(ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	CRM_ПеренестиВОбработанныеКлиент(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПеренестиВОбработанныеКлиент(ПропуститьВопрос = Ложь)
	
	Если НЕ ПропуститьВопрос И CRM_НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
		CRM_ЗадатьВопросПриПереносеВОбработанные();
	Иначе
		CRM_ВопросПриПереносеВОбработанныеЗавершение(CRM_ОтветПереноситьВОбработанные());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ОтклонитьОбращение(Команда)
	
	CRM_ВыполнитьОтклонениеОбращения();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ВыполнитьОтклонениеОбращения(ДополнительныеПараметры = Неопределено)
	
	ТекущееСостояние = Неопределено;
	НельзяОтклонить = CRM_МетодыФормДокументовСервер.ОбращениеНельзяОтклонить(Объект.Ссылка, ТекущееСостояние);
	
	Если ТекущееСостояние = ПредопределенноеЗначение("Справочник.CRM_СостоянияЛидов.Повторный") Тогда
		
		CRM_ОбработатьПовторноНаСервере(Объект.Ссылка);
		CRM_ПеренестиВОбработанныеКлиент(Истина);
		Оповестить("ОбновитьАРМ");
		
	Иначе
		
		Если НельзяОтклонить Тогда
			CRM_МетодыФормДокументовКлиент.ПоказатьПредупреждениеОбращениеОбработано(ТекущееСостояние);
			Возврат;
		КонецЕсли;
		
		Если ДополнительныеПараметры = Неопределено Тогда
			ДополнительныеПараметры = Новый Структура;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("Ссылка", Объект.Ссылка);
		
		Если УказыватьПричинуОтклонения(Объект.Ссылка) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("CRM_ОтклонитьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", , ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	
			CRM_ОтклонитьЗавершение(Истина, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ОтклонитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("ПричинаОтказа")
			И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
			
		CRM_ОтклонитьОбращениеНаСервере(ДополнительныеПараметры.Ссылка, Результат.ПричинаОтказа, Результат.Комментарий);
	Иначе
		CRM_ОтклонитьОбращениеНаСервере(ДополнительныеПараметры.Ссылка, Неопределено, "");
	КонецЕсли;
	
	ПропуститьВопрос = ?(ДополнительныеПараметры.Свойство("ПропуститьВопрос"), ДополнительныеПараметры.ПропуститьВопрос, Ложь);
	CRM_ПеренестиВОбработанныеКлиент(ПропуститьВопрос);
	
КонецПроцедуры

&НаСервере
Процедура CRM_ОтклонитьОбращениеНаСервере(Ссылка, ПричинаОтказа, Комментарий)
	Если РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(Ссылка) И РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка) Тогда
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Ссылка, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа, Комментарий); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура CRM_ОбработатьПовторноНаСервере(Ссылка)
	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка) Тогда
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Ссылка, Справочники.CRM_СостоянияЛидов.ПовторныйОбработанный);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьНаРоль(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект), Тип("СправочникСсылка.РолиИсполнителей"));

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьОтклонение(Команда)
	CRM_МетодыФормДокументовКлиент.ОтменитьОтклонение(Объект.Ссылка, Элементы.ГруппаКомандаОтменитьОтклонение);
	ОбновитьСостояниеОбращения();
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПоказатьСкрытьСвойства(Команда)
	
	CRM_ПоказатьСкрытьСвойстваНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура CRM_ПоказатьСкрытьСвойстваНаСервере(НовоеЗначениеВидимость = Неопределено)
	
	Если НовоеЗначениеВидимость = Неопределено Тогда	
		НовоеЗначениеВидимость = НЕ Элементы.ГруппаНастройкиПраваяКолонка.Видимость;
	КонецЕсли;
		
	Элементы.ГруппаНастройкиПраваяКолонка.Видимость = НовоеЗначениеВидимость;
	
	CRM_ПоказатьСкрытьСвойства = Элементы.ГруппаНастройкиПраваяКолонка.Видимость;
	
	Если CRM_ПоказатьСкрытьСвойства Тогда
		Элементы.CRM_ПоказатьСкрытьСвойства.Заголовок = НСтр("ru = 'Скрыть свойства'; en = 'Hide properties'");
	Иначе
		Элементы.CRM_ПоказатьСкрытьСвойства.Заголовок = НСтр("ru = 'Показать свойства'; en = 'Show properties'");
	КонецЕсли;
	
	Элементы.ГруппаНастройкиПраваяКолонка.Ширина = ?(НовоеЗначениеВидимость, 40, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_Избранный(Команда)
	
	Объект.CRM_Избранный = НЕ Объект.CRM_Избранный;
	
	ОформлениеИзбранного();
	
	Модифицированность = Истина;
	
	CRM_ОбновитьАРМПослеЗаписи = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеИзбранного()
	
	Если Объект.CRM_Избранный Тогда
		Элементы.CRM_Избранный.Картинка = БиблиотекаКартинок.CRM_ЗвездочкаГолубая;
		Элементы.CRM_Избранный.Заголовок = НСтр("ru='Снять пометку'");
	Иначе
		Элементы.CRM_Избранный.Картинка = БиблиотекаКартинок.CRM_ЗвездочкаСерая;
		Элементы.CRM_Избранный.Заголовок = НСтр("ru='Установить пометку'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПереместитьВПапку(Команда)

	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюПереместитьВПапку", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(Оповещение, СписокПереместитьВПапку(), Элементы.СписокПисемПереместитьВПапку);

КонецПроцедуры

&НаКлиенте
Функция СписокПереместитьВПапку()
	
	Возврат СписокПереместитьВПапкуНаСервере();
	
КонецФункции

&НаСервере
Функция СписокПереместитьВПапкуНаСервере()
	
	ДеревоУчетныхЗаписей = Новый ДеревоЗначений;
	
	МассивУчетныхЗаписей = Новый Массив;
	МассивУчетныхЗаписей.Добавить(Объект.УчетнаяЗапись);	
	
	ЗаполнитьДеревоУчетныхЗаписей(МассивУчетныхЗаписей, ДеревоУчетныхЗаписей);
	
	
	ИсключаемыеВидыПапок = Новый Массив;
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие"));
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные"));
	ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики"));
	Если НЕ Папка.CRM_Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Входящие Тогда
		ИсключаемыеВидыПапок.Добавить(ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные"));
	КонецЕсли;
	
	МассивПапокСИерархией = Новый Массив;
	ДеревоПапок = ДеревоУчетныхЗаписей.Строки;
	Для Каждого СтрокаДереваПапок Из ДеревоПапок Цикл
		
		Если СтрокаДереваПапок.УчетнаяЗапись <> Объект.УчетнаяЗапись Тогда Продолжить; КонецЕсли;
		МассивПапокУчетнойЗаписиСИерархией(СтрокаДереваПапок.Строки, МассивПапокСИерархией, ИсключаемыеВидыПапок);
		
	КонецЦикла;
	
	
	Список = Новый СписокЗначений;	
	
	Для Каждого ЭлементСтуктура Из МассивПапокСИерархией Цикл
		
		Если ЭлементСтуктура.ВнизСписка Тогда Продолжить; КонецЕсли;
		
		Список.Добавить(ЭлементСтуктура.Ссылка, ЭлементСтуктура.Имя,,);
		
	КонецЦикла;
	
	Для Каждого ЭлементСтуктура Из МассивПапокСИерархией Цикл
		
		Если НЕ ЭлементСтуктура.ВнизСписка Тогда Продолжить; КонецЕсли;
		
		Список.Добавить(ЭлементСтуктура.Ссылка, ЭлементСтуктура.Имя,,);
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораИзМенюПереместитьВПапку(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно переместить незаписанное письмо'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	
	СсылкаНаПапку = ВыбранныйЭлемент.Значение;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаПапку) Тогда Возврат; КонецЕсли;
	
	// действие	
	СтруктураПапки = СтруктураПапки(СсылкаНаПапку);
	
	Если СтруктураПапки.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные") Тогда
		ВыполняетсяПереносВПапку = Истина;
		CRM_ПеренестиВОбработанные();
		ВыполняетсяПереносВПапку = Ложь;
	Иначе	
	
		УстановитьПапкуЭлектронногоПисьма(Объект.Ссылка, СсылкаНаПапку, Ложь);
		
		// В подписке CRM_РегистрыСведенийПриЗаписи идет изменение объекта, поэтому необходимо повторное чтение из базы данных.
		Прочитать();
		
		ОбновитьРеквизитыПисьма("Папка");
		CRM_СформироватьЗаголовок(Объект.Тема, Папка, Объект.УчетнаяЗапись);
		
		Оповестить("CRM_ПисьмоПеремещеноВПапку");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыПисьма(СтрокаРеквизитов)
	
	СтруктураРеквизитов = Взаимодействия.СтруктураРеквизитовВзаимодействия(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураРеквизитов, СтрокаРеквизитов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураПапки(СсылкаНаПапку)
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Папка", СсылкаНаПапку);
	СтруктураРезультат.Вставить("УчетнаяЗапись", СсылкаНаПапку.Владелец);
	СтруктураРезультат.Вставить("ВидПапки", СсылкаНаПапку.CRM_Вид);
	
	Возврат СтруктураРезультат;
	
КонецФункции

// +CRM
#Область Настройки

&НаКлиенте
Процедура ОткрытьПерсональныеНастройки(Команда)
	
	ОписаниеОповещенияНастроек = Новый ОписаниеОповещения("ОткрытьПерсональныеНастройкиЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АРМПочта");
	ПараметрыОткрытия.Вставить("ТекущаяСтраница", "ЭлектроннаяПочта");
	ОткрытьФорму("ОбщаяФорма.CRM_ПерсональныеНастройки", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПерсональныеНастройкиЗавершение(Результат, ДопПараметры) Экспорт
			
	ВсеВложенияПометка = ХранилищеОбщихНастроекЗагрузить("ПоказыватьВсеВложения", "ПоказыватьВсеВложения", Ложь);
	СформироватьСсылкиВложений();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СохранитьВсеВложениеВыполнить(Команда)
	ПолучаемыеФайлы = Новый Массив;
	ПолученныеФайлы = Новый Массив;	
	ПроверкаСуществованияФайлов = Истина;
	СохранитьВложения();
КонецПроцедуры

&НаСервере
Процедура СформироватьСсылкиВложений()
	
	ГруппаСсылокВложений = Элементы.ГруппаСсылкиВложений;
	
	МаксимальнаяДлинаИмениВложения = 35;
	МаксимальнаяДлинаСтроки = 105;
	
	МассивЭкранов = ПолучитьИнформациюЭкрановКлиента();
	// Защита от Толстого клиента - в нем ПолучитьИнформациюЭкрановКлиента() возвращает Неопределено и падает ошибка
	Если МассивЭкранов <> Неопределено Тогда
		ШиринаЭкрана = ПолучитьИнформациюЭкрановКлиента()[0].Ширина;
	Иначе
		ШиринаЭкрана = 1440;
	КонецЕсли;
	МаксимальнаяДлинаСтроки = МаксимальнаяДлинаСтроки*(ШиринаЭкрана/1920);
	
	// Удаление предыдущих элементов
	МассивУдаляемыхЭлементов = Новый Массив;
	Для Каждого Элемент Из ГруппаСсылокВложений.ПодчиненныеЭлементы Цикл
		МассивУдаляемыхЭлементов.Добавить(Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	МассивУдаляемыхКоманд = Новый Массив;
	Для Каждого КомандаФормы Из Команды Цикл
		Если СтрЧислоВхождений(КомандаФормы.Имя, "Команда_Сохранить_СсылкаВложения_") > 0 Тогда
			МассивУдаляемыхКоманд.Добавить(КомандаФормы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КомандаФормы Из МассивУдаляемыхКоманд Цикл
		Команды.Удалить(КомандаФормы);
	КонецЦикла;
		
	НомерЭлемента = 0;
	НомерСтрокиЭлементов = 0;
	ТекущаяДлинаСтроки = 0;
	
	Для Каждого ЭлементТаблицы Из Вложения Цикл
		ПредставлениеСсылки = "";
		Если НЕ ВсеВложенияПометка И ЭлементТаблицы.ИДФайлаЭлектронногоПисьмаОтбор = "#" Тогда
			ПредставлениеСсылки = ЭлементТаблицы.ИмяФайла;
		ИначеЕсли ВсеВложенияПометка Тогда
			ПредставлениеСсылки = ЭлементТаблицы.ИмяФайла;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеСсылки) Тогда
			Продолжить;
		КонецЕсли;
		
		// Расчет длины текущей строки
		Если СтрДлина(ПредставлениеСсылки) > МаксимальнаяДлинаИмениВложения Тогда
			ПредставлениеСсылки = Лев(ПредставлениеСсылки, МаксимальнаяДлинаИмениВложения) + "...";
		КонецЕсли;
		ШиринаЭлемента = СтрДлина(ПредставлениеСсылки);
		Если ШиринаЭлемента > 8 Тогда 
			ШиринаЭлемента = ШиринаЭлемента*0.8;
		КонецЕсли;
		ТекущаяДлинаСтроки = ТекущаяДлинаСтроки + ШиринаЭлемента;
		
		// Создание следующей горизонтальной группы
		Если НомерСтрокиЭлементов = 0 Или ТекущаяДлинаСтроки > МаксимальнаяДлинаСтроки Тогда
			
			ТекущаяДлинаСтроки = СтрДлина(ПредставлениеСсылки) + 2;
			НомерСтрокиЭлементов = НомерСтрокиЭлементов + 1;
			
			ГруппаСтрокаВложений = Элементы.Добавить("СтрокаВложений" + НомерСтрокиЭлементов, Тип("ГруппаФормы"), ГруппаСсылокВложений);
			ГруппаСтрокаВложений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтрокаВложений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаСтрокаВложений.ОтображатьЗаголовок = Ложь;
			ГруппаСтрокаВложений.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСтрокаВложений.РастягиватьПоВертикали = Ложь;
			ГруппаСтрокаВложений.Высота = 1;
			ГруппаСтрокаВложений.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
			ГруппаСтрокаВложений.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			
		КонецЕсли;
		
		ИдентификаторСсылкиВложения = ЭлементТаблицы.ПолучитьИдентификатор();
		
		// Вывод иконки типа вложения
		ДекорацияИконкаВложения = Элементы.Добавить("ИконкаВложения_" + ИдентификаторСсылкиВложения, Тип("ДекорацияФормы"), ГруппаСтрокаВложений);
		ДекорацияИконкаВложения.Вид = ВидДекорацииФормы.Картинка;
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ЭлементТаблицы.ИмяФайла);
		ИндексКартинки	= РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(РасширениеФайла);
		//ДекорацияИконкаВложения.Картинка = БиблиотекаКартинок["CRM_ИконкаТипаФайла_"+ИндексКартинки];
		ДекорацияИконкаВложения.Картинка = СписокИконокФайлов[ИндексКартинки/2].Значение;
		
		
		// Создание элемента-вложения
		ДекорацияСсылкаВложения = Элементы.Добавить("СсылкаВложения_" + ИдентификаторСсылкиВложения, Тип("ДекорацияФормы"), ГруппаСтрокаВложений);
		ДекорацияСсылкаВложения.Заголовок = ПредставлениеСсылки;
		ДекорацияСсылкаВложения.Гиперссылка = Не ВложенияОчищеныПоНастройке;
		ДекорацияСсылкаВложения.ЦветТекста = ?(ВложенияОчищеныПоНастройке, ЦветаСтиля.CRM_ЦветДополнительногоТекста, ЦветаСтиля.CRM_ОсновнойГолубой);
		
		ДекорацияСсылкаВложения.УстановитьДействие("Нажатие", "ДекорацияСсылкаВложенияНажатие");
		
		// Формирование контекстного меню декорации:
		ИмяЭлементаКнопки = "Сохранить_" + ДекорацияСсылкаВложения.Имя;
		КнопкаСохранитьВложение = Элементы.Найти(ИмяЭлементаКнопки);
		Если КнопкаСохранитьВложение = Неопределено Тогда
			
			КнопкаСохранитьВложение = Элементы.Добавить(ИмяЭлементаКнопки, Тип("КнопкаФормы"), ДекорацияСсылкаВложения.КонтекстноеМеню);
			
			ИмяКоманды = "Команда_" + ИмяЭлементаКнопки;
			
			Команда = Команды.Добавить(ИмяКоманды);
			Команда.Заголовок = НСтр("ru='Сохранить';en='Save'");
			Команда.Подсказка = НСтр("ru='Сохранить';en='Save'");
			Команда.Картинка = БиблиотекаКартинок.CRM_СохранитьКак;
			Команда.Действие = "Подключаемый_СохранитьВложениеКонтекстноеМеню";
			Команда.ИзменяетСохраняемыеДанные = Ложь;
			
			КнопкаСохранитьВложение.ИмяКоманды = Команда.Имя;
			
			
		КонецЕсли;
		КнопкаСохранитьВложение.Видимость = Истина;
		
		НомерЭлемента = НомерЭлемента + 1;
		
	КонецЦикла;
	
	Если ГруппаСсылокВложений.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.СохранитьВсеВложения.Видимость = Ложь;
		Элементы.ГруппаРаботаСВложениями.Видимость = Ложь;
	Иначе
		Элементы.СохранитьВсеВложения.Видимость = Истина;
		Элементы.ГруппаРаботаСВложениями.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаВложенияНажатие(Элемент)
	
	ИдентификаторСсылкиВложения = СтрЗаменить(Элемент.Имя, "СсылкаВложения_", "");
	ОткрытьВложениеПоИдентификатору(ИдентификаторСсылкиВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложениеПоИдентификатору(ИдентификаторСсылкиВложения)
	
	ТекущиеДанные = Вложения.НайтиПоИдентификатору(ИдентификаторСсылкиВложения);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВзаимодействияКлиентСервер.ЭтоФайлПисьмо(ТекущиеДанные.ИмяФайла) Тогда
			
		ПараметрыВложения = ВзаимодействияКлиент.ПустаяСтруктураПараметровПисьмаВложения();
		ПараметрыВложения.ДатаПисьмаОснования = Объект.ДатаПолучения;
		ПараметрыВложения.ПисьмоОснование     = Объект.Ссылка;
		ПараметрыВложения.ТемаПисьмаОснования = Объект.Тема;

		ВзаимодействияКлиент.ОткрытьВложениеПисьмо(ТекущиеДанные.Ссылка, ПараметрыВложения, ЭтотОбъект);
		
	Иначе
		
		УправлениеЭлектроннойПочтойКлиент.ОткрытьВложение(ТекущиеДанные.Ссылка, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьВложениеКонтекстноеМеню(Команда)
	
	ИдентификаторСсылкиВложения = СтрЗаменить(Команда.Имя, "Команда_Сохранить_СсылкаВложения_", "");
	СохранитьВложениеПоИдентификатору(ИдентификаторСсылкиВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеПоИдентификатору(ИдентификаторСсылкиВложения)
	
	ТекущиеДанные = Вложения.НайтиПоИдентификатору(ИдентификаторСсылкиВложения);
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	CRM_УправлениеЭлектроннойПочтойКлиент.СохранитьВложение(ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ЗагрузитьВложения(Команда)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("CRM_ЗагрузитьВложенияЗавершение", ЭтотОбъект);
	CRM_УправлениеЭлектроннойПочтойКлиент.ЗагрузитьВложения(Объект.Ссылка, ЭтотОбъект, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ЗагрузитьВложенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Возврат;
	КонецЕсли;
	
	Прочитать();
	
	Если ВложенияОчищеныПоНастройке Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось загрузить вложения с почтового сервера! Возможно письмо удалено на сервере.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_СохранитьНаДиск(Команда)
	Если ВложенияОчищеныПоНастройке Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("CRM_СохранитьНаДискПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Вложения письма были очищены! Перед сохранением письма, вложения будут загруженны с сервера.
                                                |Продолжить?'"), РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ВзаимодействияКлиент.СохранитьПисьмоНаДиск(Объект.Ссылка, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура CRM_СохранитьНаДискПродолжение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("CRM_СохранитьНаДискЗавершение", ЭтотОбъект);
		CRM_УправлениеЭлектроннойПочтойКлиент.ЗагрузитьВложения(Объект.Ссылка, ЭтотОбъект, ОповещениеЗавершения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура CRM_СохранитьНаДискЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Возврат;
	КонецЕсли;
	
	Прочитать();
	
	Если ВложенияОчищеныПоНастройке Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось загрузить вложения с почтового сервера! Возможно письмо удалено на сервере.
                                                         |Сохранить письмо на диск не удалось!'"));
	Иначе
		ВзаимодействияКлиент.СохранитьПисьмоНаДиск(Объект.Ссылка, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// -CRM

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Перечитывает данные по ссылке в форму.
//
&НаСервере
Функция ОбновитьДанныеДокументаПоСсылке()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Попытка
			Если Объект.ВерсияДанных <> Объект.Ссылка.ВерсияДанных Тогда
				ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
				ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
// Функция загружает настройку из хранилища общих настроек.
//
// Параметры:
//   Соответствуют методу ХранилищеОбщихНастроек.Загрузить,
//   подробнее - см. параметры функции ХранилищеЗагрузить().
//
Функция ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек = "", ЗначениеПоУмолчанию = Неопределено, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено)
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию, ОписаниеНастроек, ИмяПользователя);
КонецФункции // ХранилищеОбщихНастроекЗагрузить()

&НаСервере
// Процедура сохраняет настройку в хранилище общих настроек.
// 
// Параметры:
//   Соответствуют методу ХранилищеОбщихНастроекСохранить.Сохранить, 
//   подробнее - см. параметры процедуры ХранилищеСохранить().
// 
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек = "", Значение, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено, НужноОбновитьПовторноИспользуемыеЗначения = Ложь)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, Значение, ОписаниеНастроек, ИмяПользователя, НужноОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры // ХранилищеОбщихНастроекСохранить()

&НаСервере
Процедура ОбработатьНеобходимостьУведомленияОПрочтении()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УведомленияОПрочтении.Письмо
	|ИЗ
	|	РегистрСведений.УведомленияОПрочтении КАК УведомленияОПрочтении
	|ГДЕ
	|	УведомленияОПрочтении.Письмо = &Письмо
	|	И (НЕ УведомленияОПрочтении.ТребуетсяОтправка)";
	
	Запрос.УстановитьПараметр("Письмо",Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НеобходимоеДействие = Взаимодействия.ПолучитьПараметрыРаботыПользователяДляВходящегоЭлектронногоПисьма();
	
	Если НеобходимоеДействие = Перечисления.ПорядокОтветовНаЗапросыУведомленийОПрочтении.ВсегдаОтправлятьУведомление Тогда
		
		ТребуетсяУстановкаФлагаОтправкиУведомления = Истина;
		
	ИначеЕсли НеобходимоеДействие = 
		Перечисления.ПорядокОтветовНаЗапросыУведомленийОПрочтении.НикогдаНеОтправлятьУведомление Тогда
		
		УправлениеЭлектроннойПочтой.УстановитьПризнакОтправкиУведомления(Объект.Ссылка,Ложь);
		
	ИначеЕсли НеобходимоеДействие = 
		Перечисления.ПорядокОтветовНаЗапросыУведомленийОПрочтении.ЗапрашиватьПередТемКакОтправитьУведомление Тогда
		
		ТребуетсяЗапросУведомленияОПрочтении = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаВозможностьОтпавкиПисьма(УчетнаяЗаписьСсылка) 
	
	Если НЕ УчетнаяЗаписьСсылка.ИспользоватьДляОтправки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Выполняет перекодировку текстов  электронного сообщения.
&НаСервере
Процедура ПреобразоватьКодировкуПисьма(ВыбраннаяКодировка)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла,Объект.Кодировка);
	ЗаписьТекста.Записать(?(Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML,Объект.ТекстHTML,Объект.Текст));
	ЗаписьТекста.Закрыть();
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяВременногоФайла,ВыбраннаяКодировка);
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда	
		Объект.ТекстHTML = ЧтениеТекста.Прочитать();
		ТекстПисьма = Объект.ТекстHTML;
	Иначе
		Объект.Текст = ЧтениеТекста.Прочитать();
		ТекстПисьма = Объект.Текст;
	КонецЕсли;
	ЧтениеТекста.Закрыть();
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла,Объект.Кодировка);
	ЗаписьТекста.ЗаписатьСтроку(ОтправительПредставление);
	ЗаписьТекста.ЗаписатьСтроку(ПолучателиКопийПредставление);
	ЗаписьТекста.ЗаписатьСтроку(ПолучателиОтветаПредставление);
	ЗаписьТекста.ЗаписатьСтроку(ПолучателиПредставление);
	ЗаписьТекста.ЗаписатьСтроку(Объект.Тема);
	ЗаписьТекста.Закрыть();
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяВременногоФайла,ВыбраннаяКодировка);
	ОтправительПредставление = ЧтениеТекста.ПрочитатьСтроку();
	ПолучателиКопийПредставление = ЧтениеТекста.ПрочитатьСтроку();
	ПолучателиОтветаПредставление = ЧтениеТекста.ПрочитатьСтроку();
	ПолучателиПредставление = ЧтениеТекста.ПрочитатьСтроку();
	Объект.Тема = ЧтениеТекста.ПрочитатьСтроку();
	ЧтениеТекста.Закрыть();
	
	Объект.Кодировка = ВыбраннаяКодировка;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОснованияБизнесПроцесса(Знач ИмяКоманды = Неопределено)
	СтруктураРезультат = Новый Структура("Основание,КартаМаршрута,ИспользоватьВИнтересах", Объект.Ссылка, Объект.CRM_Проект.CRM_КартаМаршрута, Объект.CRM_Проект.CRM_КартаМаршрута.ИспользоватьВИнтересах);
	
	Если ИмяКоманды <> Неопределено Тогда
		Если Найти(ИмяКоманды, "КомандаТочкаСтартаБизнесПроцесса_") > 0 Тогда
			ИдентификаторСсылки = Новый УникальныйИдентификатор(СтрЗаменить(СтрЗаменить(ИмяКоманды, "КомандаТочкаСтартаБизнесПроцесса_", ""), "_", "-"));
			ТочкаМаршрутаСсылка = Справочники.CRM_ТочкиМаршрутов.ПолучитьСсылку(ИдентификаторСсылки);
			Если ЗначениеЗаполнено(ТочкаМаршрутаСсылка) Тогда
				СтруктураРезультат.Вставить("ТочкаСтарта", ТочкаМаршрутаСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступностьФормы(Форма)
	
	Форма.Элементы.ФормаОбщаяКомандаCRM_СоздатьЛичнуюЗадачу.Доступность = НЕ ЗначениеЗаполнено(Форма._ЛичнаяЗадача);
	//Форма.Элементы.КаналПервичногоИнтереса.Доступность		= ОтображатьКаналИсточник;
	//Форма.Элементы.ИсточникПервичногоИнтереса.Доступность	= ОтображатьКаналИсточник;
	Форма.Элементы.ГруппаПервичныйИнтерес.Видимость = Форма.ОтображатьКаналИсточник;
	
	Форма.Элементы.ДекорацияКопия.Видимость					= ЗначениеЗаполнено(Форма.ПолучателиКопийПредставление);
	Форма.Элементы.ПолучателиКопийПредставление.Видимость	= ЗначениеЗаполнено(Форма.ПолучателиКопийПредставление);
	Форма.Элементы.СкрытьПоказатьПолучателейКопии.Видимость	= ЗначениеЗаполнено(Форма.ПолучателиКопийПредставление);
	Форма.Элементы.ТабПолучатели.Видимость					= Форма.Элементы.СкрытьПоказатьПолучателей.Пометка;
	Форма.Элементы.ТабПолучателиКопии.Видимость				= Форма.Элементы.СкрытьПоказатьПолучателейКопии.Пометка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельца(КонтактноеЛицо)
	
	Возврат КонтактноеЛицо.Владелец;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновноеКонтактноеЛицо(Клиент)
	
	Возврат Клиент.CRM_ОсновноеКонтактноеЛицо;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипКаналаПервичногоИнтереса(Канал)
	Возврат ТипЗнч(Канал.ТипЗначения.ПривестиЗначение());
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты,ИмяРеквизита)
	Индекс = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПолучателей()
	
	Для Каждого СтрокаПолучателя Из Объект.ПолучателиПисьма Цикл
		НоваяСтрока = Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);
	КонецЦикла;
	
	Для Каждого СтрокаПолучателя Из Объект.ПолучателиКопий Цикл
		НоваяСтрока = ПолучателиКопии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСкорректироватьПолучателейПисьма()
	
	Если Получатели.Количество() > 0 Тогда
		Объект.ПолучателиПисьма.Очистить();
		Для Каждого СтрокаПолучателя Из Получатели Цикл
			НоваяСтрока = Объект.ПолучателиПисьма.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);
		КонецЦикла;
	КонецЕсли;
	
	Если ПолучателиКопии.Количество() > 0 Тогда
		Объект.ПолучателиКопий.Очистить();
		Для Каждого СтрокаПолучателя Из ПолучателиКопии Цикл
			НоваяСтрока = Объект.ПолучателиКопий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоложениеТумблераСтатусПисьма()
	
	Если Рассмотрено Тогда
		СтатусПисьма = "Обработано";
	Иначе		
		СтатусПисьма = "ВРаботе";
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПодсказкуОбАктивныхИнтересах()
	CRM_МетодыФормДокументовСервер.ЗаполнитьНадписьВСтрокеИнтереса(ЭтотОбъект, Объект);	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНовогоДокумента()
	
	НоваяСсылка = Документы.ЭлектронноеПисьмоВходящее.ПолучитьСсылку();
	
	Возврат НоваяСсылка;
	
КонецФункции

&НаКлиенте
Процедура СохранитьВложения()
	ВыделенныеВложения = Новый Массив;
	КоличествоВложений = Вложения.Количество();
	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(Неопределено);
	СтруктураДанных = Новый Структура("ВыделенныеВложения, КоличествоВложений, ТолькоВыделенные", 
		ВыделенныеВложения, КоличествоВложений, Ложь);
	Оповещение = Новый ОписаниеОповещения("СохранитьВложенияПодключеноРасширение", ЭтотОбъект, СтруктураДанных);
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияПодключеноРасширение(Подключено, ДополнительныеПараметры) Экспорт
	
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТолькоВыделенные = ДополнительныеПараметры.ТолькоВыделенные;
		
	Если Подключено Тогда
		КаталогСохранения = ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПапкаДляСохранитьКак");
		Если НЕ ЗначениеЗаполнено(КаталогСохранения) Тогда
			КаталогСохранения = "";
			КаталогСохранения = РаботаСФайламиСлужебныйКлиент.КаталогВыгрузки();
		КонецЕсли;
		ВыборКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ВыборКаталога.МножественныйВыбор = Ложь;
		ВыборКаталога.Каталог = КаталогСохранения;
		ДополнительныеПараметры.Вставить("ВыборКаталога", ВыборКаталога);
		ДополнительныеПараметры.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);
		Оповещение = Новый ОписаниеОповещения("СохранитьВложенияПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
		ВыборКаталога.Показать(Оповещение);
        Возврат;
	Иначе
		#Если ВебКлиент Тогда
			Для НомерВложения = 0 По КоличествоВложений Цикл
				Если ТолькоВыделенные Тогда
					Если ВыделенныеВложения.Найти(НомерВложения) = Неопределено Тогда Продолжить; КонецЕсли;
				КонецЕсли;	
				ТекущееВложение = Вложения[НомерВложения];
				// Разрешаем сохранять картинки, вставленные в текст письма через вставку картинки, а также через интернет.
				//Если НЕ (ТекущееВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#") Тогда Продолжить; КонецЕсли;
				// 
				ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущееВложение.Ссылка, УникальныйИдентификатор);
				РасширениеВложения = ВРег(СокрЛП(ДанныеФайла.Расширение));
				Если РасширениеВложения = "EML" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
					Продолжить;
				КонецЕсли;
				ПолучитьФайл(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ДанныеФайла.ИмяФайла, Истина);
			КонецЦикла;	
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ВыборКаталога = ДополнительныеПараметры.ВыборКаталога;
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТолькоВыделенные = ДополнительныеПараметры.ТолькоВыделенные;
	ПроверкаСуществованияФайлов = ДополнительныеПараметры.ПроверкаСуществованияФайлов;
		
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда Возврат; КонецЕсли;
	КаталогСохранения = ВыборКаталога.Каталог;
	Если НЕ ЗначениеЗаполнено(КаталогСохранения) Тогда Возврат; КонецЕсли;
	Если НЕ (Прав(КаталогСохранения, 1) = "\") Тогда
		КаталогСохранения = КаталогСохранения + "\";
	КонецЕсли;
	
	Если ПроверкаСуществованияФайлов Тогда
		ДополнительныеПараметры.Вставить("КаталогСохранения", КаталогСохранения);
		ДополнительныеПараметры.Вставить("ТекущийНомерВложения", 0);
		ПроверитьНаличиеФайловНаДиске(ВыбранныеФайлы, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;		
	
	ПерезаписатьВсе		= ?(ДополнительныеПараметры.Свойство("ПерезаписатьВсе"),ДополнительныеПараметры.ПерезаписатьВсе, Ложь);
	ПереименоватьВсе	= ?(ДополнительныеПараметры.Свойство("ПереименоватьВсе"),ДополнительныеПараметры.ПереименоватьВсе, Ложь);
	Если ДополнительныеПараметры.Свойство("ТекущийНомерВложения") Тогда
		ТекущийНомерВложения = ДополнительныеПараметры.ТекущийНомерВложения + 1;
	Иначе 
		ТекущийНомерВложения = 0;
	КонецЕсли;
	Если ТекущийНомерВложения <= КоличествоВложений - 1 Тогда			
		Если ТолькоВыделенные Тогда
			Если ВыделенныеВложения.Найти(ТекущийНомерВложения) = Неопределено Тогда Возврат; КонецЕсли;
		КонецЕсли;	
		ТекущееВложение = Вложения[ТекущийНомерВложения];
		Если НЕ ЗначениеЗаполнено(ТекущееВложение.Ссылка) Тогда 						
			// Разрешаем сохранять картинки, вставленные в текст письма через вставку картинки, а также через интернет.
			//Если НЕ (ТекущееВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#") Тогда Продолжить; КонецЕсли;
			// 
			Если ТекущееВложение.Расположение = 4 Тогда
				ДанныеФайла = ТекущееВложение.ИмяФайлаНаКомпьютере;
				Файл = Новый Файл(ТекущееВложение.ИмяФайла);				
				РасширениеВложения = ВРег(СокрЛП(Файл.Расширение));
				Если РасширениеВложения = ".EML" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
					Возврат;
				КонецЕсли;
				ДополнительныеПараметры.Вставить("РазмерФайла", ТекущееВложение.Размер);
				ДополнительныеПараметры.Вставить("ДанныеФайла", ТекущееВложение.ИмяФайлаНаКомпьютере);												
			КонецЕсли;	
		Иначе
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущееВложение.Ссылка, УникальныйИдентификатор);
			РасширениеВложения = ВРег(СокрЛП(ДанныеФайла.Расширение));
			Если РасширениеВложения = "EML" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
				Возврат;
			КонецЕсли;	
			ДополнительныеПараметры.Вставить("ДанныеФайла", ДанныеФайла);							
		КонецЕсли;
		ПолноеИмяФайла = КаталогСохранения + ТекущееВложение.ИмяФайла;
		
		// Проверяем файл на существование, и, если он существует, то выбираем дальнейшее действие.
		ДополнительныеПараметры.Вставить("КаталогСохранения", КаталогСохранения);
		ДополнительныеПараметры.Вставить("ПерезаписатьВсе",   ПерезаписатьВсе);
		ДополнительныеПараметры.Вставить("ПереименоватьВсе",  ПереименоватьВсе);
		ДополнительныеПараметры.Вставить("ПолноеИмяФайла",    ПолноеИмяФайла);		
		ДополнительныеПараметры.Вставить("ВыбранныеФайлы",    ВыбранныеФайлы);				
		Оповещение = Новый ОписаниеОповещения("ФайлПослеИнициализации", ЭтотОбъект, ДополнительныеПараметры); 		
		Файл = Новый Файл();
		Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеФайловНаДиске(ВыбранныеФайлы, ДополнительныеПараметры)
	
	КаталогСохранения = ДополнительныеПараметры.КаталогСохранения;
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТекущийНомерВложения = ДополнительныеПараметры.ТекущийНомерВложения;
	Если ТекущийНомерВложения <= КоличествоВложений - 1 Тогда			
		ТекущееВложение = Вложения[ТекущийНомерВложения];
		Если НЕ ЗначениеЗаполнено(ТекущееВложение.Ссылка) Тогда 
			Если ТекущееВложение.Расположение = 4 Тогда 
				ПолноеИмяФайла = КаталогСохранения + ТекущееВложение.ИмяФайла;
				Файл = Новый Файл(ПолноеИмяФайла);				
				РасширениеВложения = ВРег(СокрЛП(Файл.Расширение));
				Если РасширениеВложения = ".EML" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Вложение '") + ТекущееВложение.ИмяФайла + НСтр("ru=' не может быть сохранено.'"));
					Возврат;
				КонецЕсли;
				ДополнительныеПараметры.Вставить("ПолноеИмяФайла",    ПолноеИмяФайла);
				ДополнительныеПараметры.Вставить("ДанныеФайла",       ТекущееВложение.ИмяФайлаНаКомпьютере);								
				ДополнительныеПараметры.Вставить("ВыбранныеФайлы",    ВыбранныеФайлы);						
				Оповещение = Новый ОписаниеОповещения("ФайлПроверитьПослеИнициализации", ЭтотОбъект, ДополнительныеПараметры); 		
				Файл = Новый Файл();
				Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);						
				Возврат;
			Иначе				
				Возврат; 
			КонецЕсли;				
		КонецЕсли;						
		// Если картинка из текста письма, то ее пропускаем.
		// Разрешаем сохранять картинки, вставленные в текст письма через вставку картинки, а также через интернет.
		//Если НЕ (ТекущееВложение.ИДФайлаЭлектронногоПисьмаОтбор = "#") Тогда Продолжить; КонецЕсли;
		// 			
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущееВложение.Ссылка, УникальныйИдентификатор);
		РасширениеВложения = ВРег(СокрЛП(ДанныеФайла.Расширение));		
		ПолноеИмяФайла = КаталогСохранения + ТекущееВложение.ИмяФайла;
		ДополнительныеПараметры.Вставить("ПолноеИмяФайла",    ПолноеИмяФайла);		
		ДополнительныеПараметры.Вставить("ДанныеФайла",       ДанныеФайла);				
		ДополнительныеПараметры.Вставить("ВыбранныеФайлы",    ВыбранныеФайлы);						
		Оповещение = Новый ОписаниеОповещения("ФайлПроверитьПослеИнициализации", ЭтотОбъект, ДополнительныеПараметры); 		
		Файл = Новый Файл();
		Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);		
	Иначе
		ПроверкаСуществованияФайлов = Ложь;
		ДополнительныеПараметры.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);		
		ДополнительныеПараметры.Удалить("ТекущийНомерВложения");
		СохранитьВложенияПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлПроверитьПослеИнициализации(Файл, ПараметрыВложения) Экспорт
	 ФайлПроверитьНаСуществование(Файл, ПараметрыВложения);
КонецПроцедуры	

&НаКлиенте
Процедура ФайлПроверитьНаСуществование(Файл, ПараметрыВложения)
	ПараметрыВложения.Вставить("Файл", Файл);				
	Оповещение = Новый ОписаниеОповещения("ПроверкаНаСуществованиеФайлаДляВопроса", ЭтотОбъект, ПараметрыВложения);
	Файл.НачатьПроверкуСуществования(Оповещение);
КонецПроцедуры	

&НаКлиенте
Процедура ПроверкаНаСуществованиеФайлаДляВопроса(Существует, ПараметрыВложения) Экспорт
	Если Существует Тогда
		ПроверкаСуществованияФайлов = Ложь;
		ПараметрыВложения.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);
		СохранитьВложенияВопрос(ПараметрыВложения);
		ПараметрыВложения.Удалить("ТекущийНомерВложения");
		Возврат;
	ИначеЕсли ПараметрыВложения.ТекущийНомерВложения = ПараметрыВложения.КоличествоВложений Тогда
		ПроверкаСуществованияФайлов = Ложь;
		ПараметрыВложения.Вставить("ПроверкаСуществованияФайлов", ПроверкаСуществованияФайлов);
		ПараметрыВложения.Удалить("ТекущийНомерВложения");
		СохранитьВложенияПослеВыбораКаталога(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения);
	Иначе		
		ПараметрыВложения.Вставить("ТекущийНомерВложения", ПараметрыВложения.ТекущийНомерВложения + 1);
		ПроверитьНаличиеФайловНаДиске(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения)
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ФайлПослеИнициализации(Файл, ПараметрыВложения) Экспорт
	СохранитьВложенияПослеВыбораКаталогаФрагмент(Файл, ПараметрыВложения);
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияПослеВыбораКаталогаФрагмент(Файл, ПараметрыВложения)
	
	ПараметрыВложения.Вставить("Файл", Файл);				
	Оповещение = Новый ОписаниеОповещения("ПроверкаНаСуществованиеФайла", ЭтотОбъект, ПараметрыВложения);
	Файл.НачатьПроверкуСуществования(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНаСуществованиеФайла(Существует, ПараметрыВложения) Экспорт
	
	Если Существует Тогда
		СохранитьВложенияПослеВыбораКаталогаФрагментУсловие(ПараметрыВложения);				
	Иначе
		ПослеУдаленияПереименованияФайла(ПараметрыВложения);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияПослеВыбораКаталогаФрагментУсловие(ПараметрыВложения)
		
	Если ПараметрыВложения.ПерезаписатьВсе Тогда
		Оповещение = Новый ОписаниеОповещения("УстановкаТолькоЧтенияУФайла", ЭтотОбъект, ПараметрыВложения);
		Файл = ПараметрыВложения.Файл;
		Файл.НачатьУстановкуТолькоЧтения(Оповещение, Ложь);
	ИначеЕсли ПараметрыВложения.ПереименоватьВсе Тогда
		НомерПоПорядку		= "";
		ИмяБезРасширения	= ПараметрыВложения.Файл.ИмяБезРасширения;
		Расширение			= ПараметрыВложения.Файл.Расширение;
		ПараметрыВложения.Вставить("НомерПоПорядку", НомерПоПорядку);
		ПараметрыВложения.Вставить("Расширение", 	 Расширение);
		ПараметрыВложения.Вставить("ИмяБезРасширения", ИмяБезРасширения);		
		СохранитьВложенияФрагментУсловие(ПараметрыВложения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановкаТолькоЧтенияУФайла(ПараметрыВложения) Экспорт
	Оповещение = Новый ОписаниеОповещения("ПослеУдаленияПереименованияФайла", ЭтотОбъект, ПараметрыВложения);
	НачатьУдалениеФайлов(Оповещение, ПараметрыВложения.ПолноеИмяФайла);	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеУдаленияПереименованияФайла(ПараметрыВложения) Экспорт
	
	ПолноеИмяФайла	= ПараметрыВложения.ПолноеИмяФайла;
	Если ПараметрыВложения.Свойство("РазмерФайла") Тогда
		СсылкаНаДвоичныеДанныеФайла	= ПараметрыВложения.ДанныеФайла;
		ИмяФайла					= ПараметрыВложения.Файл.Имя;			
	Иначе	
		ДанныеФайла	= ПараметрыВложения.ДанныеФайла;
		СсылкаНаДвоичныеДанныеФайла = ПараметрыВложения.ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		ИмяФайла	= ДанныеФайла.ИмяФайла;
	КонецЕсли;		
	
	Если ПараметрыВложения.Свойство("РазмерФайла") Тогда
		РазмерВМб = ПараметрыВложения.РазмерФайла;
		ПараметрыВложения.Удалить("РазмерФайла");
	Иначе		
		РазмерВМб = ДанныеФайла.Размер / (1024 * 1024);
	КонецЕсли;	
	ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='Сохраняется файл ""%1"" (%2 Мб)"
"Пожалуйста, подождите...'"), ИмяФайла, 
	РаботаСФайламиСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб));
	Состояние(ТекстПояснения);
	ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, СсылкаНаДвоичныеДанныеФайла);
	ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	Если ТекущийНомерВложения = ПараметрыВложения.КоличествоВложений - 1 Тогда
		
		// Выполняем проверку на дубли и меняем дублям имена сохраняемых файлов.
		СписокИменФайлов = Новый СписокЗначений;
		Для Каждого ПолучаемыйФайл Из ПолучаемыеФайлы Цикл
			ЭлементСписка = СписокИменФайлов.НайтиПоЗначению(ПолучаемыйФайл.Имя);
			Если ЭлементСписка = Неопределено Тогда
				СписокИменФайлов.Добавить(ПолучаемыйФайл.Имя, "0");
			Иначе
				Файл = Новый Файл(ПолучаемыйФайл.Имя);
				ЭлементСписка.Представление = Строка(Число(ЭлементСписка.Представление) + 1);
				ПолучаемыйФайл.Имя = Файл.Путь + Файл.ИмяБезРасширения + "(" + ЭлементСписка.Представление + ")" + Файл.Расширение;
			КонецЕсли;
		КонецЦикла;
		// Выполняем сохранение файлов.
		Оповещение = Новый ОписаниеОповещения("СохранитьВложенияЗавершение", ЭтотОбъект, ПараметрыВложения);
		НачатьПолучениеФайлов(Оповещение, ПолучаемыеФайлы, ПараметрыВложения.ВыборКаталога.Каталог, Ложь);
	Иначе
		ПараметрыВложения.Вставить("ТекущийНомерВложения", ТекущийНомерВложения);
		СохранитьВложенияПослеВыбораКаталога(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения);	
	КонецЕсли;		
	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияФрагментУсловие(ПараметрыВложения)
	
	Если ПараметрыВложения.НомерПоПорядку = "" Тогда
		ПолноеИмяФайла = ПараметрыВложения.КаталогСохранения + ПараметрыВложения.ИмяБезРасширения 
			+ ПараметрыВложения.Расширение;
	Иначе			
		ПолноеИмяФайла = ПараметрыВложения.КаталогСохранения + ПараметрыВложения.ИмяБезРасширения 
			+ "(" + Формат(ПараметрыВложения.НомерПоПорядку, "ЧРГ=") + ")" + ПараметрыВложения.Расширение;			
		КонецЕсли;
	ПараметрыВложения.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);	
	Оповещение = Новый ОписаниеОповещения("ФайлПерезаписиПослеИнициализации", ЭтотОбъект, ПараметрыВложения);
	Файл = Новый Файл();
	Файл.НачатьИнициализацию(Оповещение,ПолноеИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ФайлПерезаписиПослеИнициализации (Файл, ПараметрыВложения) Экспорт
	ПараметрыВложения.Вставить("Файл",       Файл);				
	СохранитьВложенияУсловиеЗавершениеЦикла(ПараметрыВложения);	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияУсловиеЗавершениеЦикла(ПараметрыВложения)
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьНаСуществованиеФайлаПередСохранением", ЭтотОбъект, ПараметрыВложения);
	Файл = ПараметрыВложения.Файл;
	Файл.НачатьПроверкуСуществования(Оповещение);	

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаСуществованиеФайлаПередСохранением(Существует, ПараметрыВложения) Экспорт
	Если Существует Тогда
		НомерПоПорядку = ПараметрыВложения.НомерПоПорядку;
		ПараметрыВложения.Вставить("НомерПоПорядку", ?(НЕ ЗначениеЗаполнено(НомерПоПорядку),1,НомерПоПорядку + 1));
		СохранитьВложенияФрагментУсловие(ПараметрыВложения);
	Иначе
		ПослеУдаленияПереименованияФайла(ПараметрыВложения);
	КонецЕсли;			
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВложенияЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	ВыделенныеВложения = ДополнительныеПараметры.ВыделенныеВложения;
	КаталогСохранения = ДополнительныеПараметры.КаталогСохранения;
	КоличествоВложений = ДополнительныеПараметры.КоличествоВложений;
	ТолькоВыделенные = ДополнительныеПараметры.ТолькоВыделенные;
		
	Если ПолученныеФайлы.Количество() > 0  Тогда
		ХранилищеОбщихНастроекСохранить("НастройкиПрограммы", "ПапкаДляСохранитьКак",  КаталогСохранения);
		Состояние(НСтр("ru='Файлы успешно сохранены.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияВопрос(ПараметрыВложения)
	
	Перем ОтветНаВопрос, СписокКнопок, ТекстВопроса;
	
	ШаблонТекстаВопроса	= НСтр("ru='Файл %1 уже существует.%2Выберите действие для всех существующих файлов:'");
	ТекстВопроса	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаВопроса, ПараметрыВложения.ПолноеИмяФайла, Символы.ПС);
	СписокКнопок	= Новый СписокЗначений;
	СписокКнопок.Добавить("Перезаписать",	НСтр("ru='Перезаписать'"));
	СписокКнопок.Добавить("Переименовать",	НСтр("ru='Переименовать'"));
	СписокКнопок.Добавить("Отмена",			НСтр("ru='Отмена'"));
	Оповещение = Новый ОписаниеОповещения("СохранитьВложенияВопросЗавершение", ЭтотОбъект, ПараметрыВложения);
	ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, , "Отмена");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияВопросЗавершение(РезультатВопроса, ПараметрыВложения) Экспорт
	
	ТолькоВыделенные = ПараметрыВложения.ТолькоВыделенные;
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = "Перезаписать" Тогда
		ПараметрыВложения.Вставить("ПерезаписатьВсе", Истина);
		ПараметрыВложения.Вставить("ПереименоватьВсе", Ложь);
	ИначеЕсли ОтветНаВопрос = "Переименовать" Тогда
		ПараметрыВложения.Вставить("ПерезаписатьВсе", Ложь);
		ПараметрыВложения.Вставить("ПереименоватьВсе", Истина);
	Иначе
		ПараметрыВложения.Вставить("ПерезаписатьВсе", Ложь);
		ПараметрыВложения.Вставить("ПереименоватьВсе", Ложь);		
		Возврат;
	КонецЕсли;
	СохранитьВложенияПослеВыбораКаталога(ПараметрыВложения.ВыбранныеФайлы, ПараметрыВложения);

КонецПроцедуры

// +CRM

////////////////////////////////////////////////////////////////////////////////
// Выполнение команд подключаемых отчетов и обработок.

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// -CRM

&НаСервереБезКонтекста
Функция ТипПВХ(ПВХСсылка)
	Возврат ТипЗнч(ПВХСсылка.ТипЗначения.ПривестиЗначение());
КонецФункции

&НаСервере
Процедура ПолучитьПредыдущийПервичныйИнтересПоПартнеру(ДатаАктуальности)
	
	ПервичныйИнтерес.Очистить();
	ВыводитьНадпись = Ложь;
	пПартнер = Неопределено;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		пПартнер = Партнер;
	Иначе
		пПартнер = Объект.Партнер;
	КонецЕсли;
	Если ЗначениеЗаполнено(пПартнер) Тогда
		Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(Объект.Дата,,пПартнер);
		Если ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
			
			СтрокаПервичногоИнтереса = ПервичныйИнтерес.Вставить(0);
			ЗаполнитьЗначенияСвойств(СтрокаПервичногоИнтереса,Интерес);
			СтрокаПервичногоИнтереса.Актуальность = Истина;
			
			Если ТипЗнч(Интерес.КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) = Тип("СправочникСсылка.МаркетинговыеМероприятия") 
			   И ЗначениеЗаполнено(Интерес.ИсточникПервичногоИнтереса) Тогда
				СтрокаПервичногоИнтереса.Актуальность = Интерес.ИсточникПервичногоИнтереса.CRM_ДатаАктуальности >= НачалоДня(Объект.Дата);
				ДатаАктуальности = Интерес.ИсточникПервичногоИнтереса.CRM_ДатаАктуальности;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОписаниеКаналаИсточника()
	
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		
		КаналПервичногоИнтереса = Неопределено;
		ИсточникПервичногоИнтереса = Неопределено;
		Элементы.РанееЗарегистрированныйИнтерес.Видимость = ЗначениеЗаполнено(Партнер);
		ПервичныйИнтерес.Очистить();
		ВыводитьНадпись = Ложь;
		пПартнер = Неопределено;
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
			пПартнер = Партнер;
		Иначе
			пПартнер = Объект.Партнер;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пПартнер) Тогда
			
			АктуальноДо = '00010101';
			ПолучитьПредыдущийПервичныйИнтересПоПартнеру(АктуальноДо);
			
			Интерес = Неопределено;
			Попытка
				
				Интерес = ПервичныйИнтерес.Получить(0);
				
			Исключение	КонецПопытки;
			
			РанееНеЗарегистровано = Ложь;
			Если Интерес <> Неопределено И ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
				ВыводитьНадпись = Истина;
					Надпись = "";
					CRM_МаркетингСервер.СформироватьНадписьПервичногоИнтереса(Объект.Ссылка, Интерес, АктуальноДо, Надпись, ВыводитьНадпись);
					Элементы.РанееЗарегистрированныйИнтерес.Заголовок = Надпись;
			КонецЕсли;
			
			Элементы.РанееЗарегистрированныйИнтерес.Видимость = ВыводитьНадпись;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере()
	
	// Определить канал и источник первичного интереса.
	пПартнер = Неопределено;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		пПартнер = Партнер;
	Иначе
		пПартнер = Объект.Партнер;
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		Если НЕ Объект.Ссылка.Пустая() Тогда
			
			Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(?(ЗначениеЗаполнено(Объект.ДатаПолучения), Объект.ДатаПолучения, Объект.Дата), Объект.Ссылка, пПартнер);
			
			КаналПервичногоИнтереса    = Интерес.КаналПервичногоИнтереса;
			ИсточникПервичногоИнтереса = Интерес.ИсточникПервичногоИнтереса;
			Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = НЕ ЗначениеЗаполнено(КаналПервичногоИнтереса);
			
		КонецЕсли;
	Иначе
		Элементы.ГруппаПервичныйИнтерес.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПервичногоИнтереса()
	
	Актуальность = Ложь;
	ПредыдущийИсточник = Неопределено;
	Попытка
		ПредыдущийИсточник = ПервичныйИнтерес.Получить(0);
	Исключение КонецПопытки;
	Если ПредыдущийИсточник <> Неопределено Тогда
		
		Актуальность = ПредыдущийИсточник.Актуальность;
		
	КонецЕсли;
	пПартнер = Партнер;
	
	НаличиеУчастников = ?(ЗначениеЗаполнено(пПартнер),Истина,Ложь);
	
	Если НаличиеУчастников Тогда
		Элементы.КаналПервичногоИнтереса.Доступность = Истина;
		Элементы.КаналПервичногоИнтереса.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.КаналПервичногоИнтереса.Доступность = Ложь;
		Элементы.КаналПервичногоИнтереса.ТолькоПросмотр = Истина;
		Элементы.ИсточникПервичногоИнтереса.Доступность = Ложь;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаналПервичногоИнтереса) 
		И ТипПВХ(КаналПервичногоИнтереса) <> Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.ИсточникПервичногоИнтереса.Доступность = Истина;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ИсточникПервичногоИнтереса.Доступность = Ложь;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Отметки незаполненного
	Если Актуальность = Истина И Не ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
	ИначеЕсли Актуальность = Ложь 
		И Не ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		// Если обязательно заполнять актуальный источник привлечения, тогда подсвечиваем канал актуального источника
		// привлечения.
		Если ЗаполнятьПервичныйИнтерес Тогда
			
			Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Истина;
			Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Истина;
			
		Иначе
			
			Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
			Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ИсточникПервичногоИнтереса.Доступность = Истина 
		// И ЗаполнятьПервичныйИнтерес 
		И Не ЗначениеЗаполнено(ИсточникПервичногоИнтереса) Тогда
		Элементы.ИсточникПервичногоИнтереса.АвтоОтметкаНезаполненного = Истина;
		Элементы.ИсточникПервичногоИнтереса.ОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаналПервичногоИнтереса) 
		И ТипПВХ(КаналПервичногоИнтереса) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.ИсточникПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ИсточникПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция EMailКонтактаСуществует(Контакт, EMail)
	
	Если НЕ ЗначениеЗаполнено(Контакт) Тогда
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Контакт) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСуществует = Ложь;
	
	Для Каждого СтрокаКИ Из Контакт.КонтактнаяИнформация Цикл
		
		Если НЕ (СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) Тогда
			Продолжить;
		ИначеЕсли СтрокаКИ.Представление = EMail Тогда	
			АдресСуществует = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат АдресСуществует;
	
КонецФункции

&НаСервере
// Функция добавляет адрес электронной почты выбранному контакту.
//
// Параметры:
//	Контакт	- СправочникСсылка	- Контакт
//	EMail	- Строка			- Адрес электронной почты.
//
// Возвращаемое значение:
//	Булево	- Результат добавления.
//
Функция ДобавитьEMailКонтакту(Контакт, EMail)
	
	АдресСуществует = EMailКонтактаСуществует(Контакт, EMail);
	
	Если АдресСуществует = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли АдресСуществует Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EmailПартнера;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.Пользователи") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КонтактОбъект = Контакт.ПолучитьОбъект();
	НоваяСтрока = КонтактОбъект.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Вид	= ВидКИ;
	НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	
	НоваяСтрока.Представление	= EMail;
	НоваяСтрока.АдресЭП			= EMail;
	Поз = Найти(EMail, "@");
	Если Поз > 0 Тогда
		НоваяСтрока.ДоменноеИмяСервера = Сред(EMail, Поз + 1);
	КонецЕсли;
	
	НоваяСтрока.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(EMail, НоваяСтрока.Вид);
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрока.Значение, НоваяСтрока.Представление, НоваяСтрока.Вид);
	
	АдресЗаписан = Истина;
	Попытка
		КонтактОбъект.Записать();
	Исключение
		АдресЗаписан = Ложь;
	КонецПопытки;	
	Возврат АдресЗаписан;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораКонтактаОтправителя()
	
	Если ЗначениеЗаполнено(Объект.ОтправительКонтакт) И НЕ ТипЗнч(Объект.ОтправительКонтакт) = Тип("Тип") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКонтактаОтправителяЗавершение", ЭтотОбъект);
		ЗадатьВопросОСохраненииКИ(Ложь, ОписаниеОповещения);
		Возврат;
	Иначе
		ОтправительВладелец = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Элементы.ОтправительВладелец.Видимость = Ложь;
		Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ОтображатьКаналИсточник = Ложь;
	КонецЕсли;
	
	ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(Истина);
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	
	СформироватьОписаниеКаналаИсточника();
	ДоступностьПервичногоИнтереса();
	НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	
	Элементы.СоздатьКонтакт.Видимость = Не ЗначениеЗаполнено(Объект.ОтправительКонтакт);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКонтактаОтправителяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ОтправительВладелец = ПолучитьВладельца(Объект.ОтправительКонтакт);
		ОтправительПредставление = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Объект.ОтправительПредставление, Объект.ОтправительАдрес, Объект.ОтправительКонтакт);
		Элементы.ОтправительВладелец.Видимость = Истина;
	Иначе
		ОтправительВладелец = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Элементы.ОтправительВладелец.Видимость = Ложь;
	КонецЕсли;
	
	Если (ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") ИЛИ ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры")) Тогда
		Партнер = ?(ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры"),Объект.ОтправительКонтакт,ПолучитьВладельца(Объект.ОтправительКонтакт));
		ОтображатьКаналИсточник = Истина;
	Иначе
		Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ОтображатьКаналИсточник = Ложь;
	КонецЕсли;
	
	ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(Истина);
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	
	СформироватьОписаниеКаналаИсточника();
	ДоступностьПервичногоИнтереса();
	НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	
	Элементы.СоздатьКонтакт.Видимость = Не ЗначениеЗаполнено(Объект.ОтправительКонтакт);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОСохраненииКИ(ЗаписыватьОбъект, ОповещениеПриЗавершении = Неопределено)
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗаписыватьОбъект", ЗаписыватьОбъект);
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	
	АдресСуществует = EMailКонтактаСуществует(Объект.ОтправительКонтакт, Объект.ОтправительАдрес);
	Если АдресСуществует = Неопределено ИЛИ АдресСуществует = Истина Тогда
		ЗадатьВопросОСохраненииКИЗавершение(Неопределено, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ШаблонВопроса = НСтр("ru = 'Сохранить в карточке контакта email: %1?'");
	ТекстВопроса = СтрШаблон(ШаблонВопроса, Объект.ОтправительАдрес);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗадатьВопросОСохраненииКИЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОСохраненииКИЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если НЕ ДобавитьEMailКонтакту(Объект.ОтправительКонтакт, Объект.ОтправительАдрес) Тогда
			Сообщение = НСтр("ru='Для автоматического связывания писем с данным контактом укажите текущий email в его карточке'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Истина);
	КонецЕсли;
		
	Если ДополнительныеПараметры.ЗаписыватьОбъект Тогда
		Записать();
	КонецЕсли;	
		
КонецПроцедуры

// +ПанельБП

&НаСервереБезКонтекста
Функция ПроверитьДубликатБизнесПроцесса(Предмет)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_БизнесПроцесс.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
	|ГДЕ
	|	НЕ CRM_БизнесПроцесс.ПометкаУдаления
	|	И НЕ CRM_БизнесПроцесс.Завершен
	|	И CRM_БизнесПроцесс.Предмет = &Предмет");
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцесс(Команда)
	
	Если ПроверитьДубликатБизнесПроцесса(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru='Уже создан бизнес-процесс."
"Создать новый?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_КомандаНачатьБизнесПроцессЗавершение", ЭтотОбъект, Команда.Имя);	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Подключаемый_КомандаНачатьБизнесПроцессЗавершение(Неопределено, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцессЗавершение(Ответ, КомандаИмя) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	СтруктураОснования = ПолучитьСтруктуруОснованияБизнесПроцесса(КомандаИмя);
	ПараметрыФормы = Новый Структура("Основание",СтруктураОснования);
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.ФормаОбъекта",ПараметрыФормы,ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдалитьКомандуСозданияБизнесПроцесса()
	
	Если ИспользоватьБизнесПроцессы И ЗначениеЗаполнено(Объект.CRM_Проект) И ЗначениеЗаполнено(Объект.CRM_Проект.CRM_КартаМаршрута) Тогда
		CRM_БизнесПроцессыСервер.ДобавитьУдалитьКомандуСозданияБизнесПроцессаНаКоманднуюПанель(ЭтотОбъект, Элементы.СоздатьНаОснованииПодменю, Объект.CRM_Проект.CRM_КартаМаршрута, Ложь);
	Иначе
		CRM_БизнесПроцессыСервер.ДобавитьУдалитьКомандуСозданияБизнесПроцессаНаКоманднуюПанель(ЭтотОбъект,,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПроектПриИзменении(Элемент)
	ДобавитьУдалитьКомандуСозданияБизнесПроцесса();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуГиперссылок()
	
	ТекстКоманда = Команды.Найти("_ВыполнитьЗадачу");
	Если ТекстКоманда = Неопределено Тогда
		НоваяКомандаФормы 			= Команды.Добавить("_ВыполнитьЗадачу");
		НоваяКомандаФормы.Заголовок	= "Выполнить";
		НоваяКомандаФормы.Подсказка	= "Отметить задачу как выполненную";
		НоваяКомандаФормы.Действие	= "Подключаемый_ВыполнитьЗадачу";
	КонецЕсли;
	
	МассивДобавляемыхРеквизитов = Новый Массив();
	
	Попытка
		ЭтотОбъект["_ЛичнаяЗадача"] 	   = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
		ЭтотОбъект["_ЛичнаяЗадачаСтрокой"] = "";
	Исключение
		ОписаниеТиповЗадача = Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя");
		НовыйРеквизит 		= Новый РеквизитФормы("_ЛичнаяЗадача", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		ОписаниеТиповЗадача = Новый ОписаниеТипов("Строка");
		НовыйРеквизит 		= Новый РеквизитФормы("_ЛичнаяЗадачаСтрокой", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецПопытки;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	|	0 КАК ВидСсылки
	|ПОМЕСТИТЬ ЛичныеЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	(НЕ ЗадачаИсполнителя.ПометкаУдаления)
	|	И ЗадачаИсполнителя.CRM_Личная
	|	И (НЕ ЗадачаИсполнителя.Выполнена)
	|	И ЗадачаИсполнителя.Предмет = &Предмет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ЛичныеЗадачи.Ссылка,
	|	ЛичныеЗадачи.ВидСсылки
	|ИЗ
	|	ЛичныеЗадачи КАК ЛичныеЗадачи";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Предмет",Объект.Ссылка);
	
	ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаб Из ТаблицаОбъектов Цикл
		Если СтрокаТаб.ВидСсылки = 0 Тогда
			ЭтотОбъект._ЛичнаяЗадача = СтрокаТаб.Ссылка;
			ЭтотОбъект._ЛичнаяЗадачаСтрокой	= Строка(СтрокаТаб.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Отрисуем гиперссылки
	// Гиперссылка на Задачу
	Если НЕ Элементы.Найти("_ЛичнаяЗадачаСтрокой") = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект._ЛичнаяЗадача) Тогда
			Элементы.Удалить(Элементы["_ЛичнаяЗадачаЗаголовок"]);
			Элементы.Удалить(Элементы["_ЛичнаяЗадачаСтрокой"]);
			Элементы.Удалить(Элементы["Кнопка_ВыполнитьЗадачу"]);
		КонецЕсли;
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект._ЛичнаяЗадача) Тогда
			
			НовыйЭлемент = Элементы.Добавить("_ЛичнаяЗадачаЗаголовок", Тип("ДекорацияФормы"), Элементы.ГиперссылкаЗаголовок);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= "Задача: ";
			
			НовыйЭлемент = Элементы.Добавить("_ЛичнаяЗадачаСтрокой", Тип("ДекорацияФормы"), Элементы.ЗначениеГиперСсылкиЗадача);
			НовыйЭлемент.Заголовок	= СокрЛП(ЭтотОбъект._ЛичнаяЗадача);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Гиперссылка= Истина;
			НовыйЭлемент.УстановитьДействие("Нажатие",	"Подключаемый_ГиперссылкаНажатие");
			
			НовыйЭлемент = Элементы.Добавить("Кнопка_ВыполнитьЗадачу",Тип("КнопкаФормы"), Элементы.ЗначениеГиперСсылкиЗадача);
			НовыйЭлемент.ИмяКоманды			= "_ВыполнитьЗадачу";
			НовыйЭлемент.Заголовок			= "Выполнить";
			// +CRM
			//НовыйЭлемент.Картинка			= БиблиотекаКартинок.ВыполнитьЗадачу;
			//НовыйЭлемент.Отображение		= ОтображениеКнопки.КартинкаИТекст;
			НовыйЭлемент.Картинка			= БиблиотекаКартинок.CRM_КИсполнению;
			НовыйЭлемент.Отображение		= ОтображениеКнопки.Картинка;
			НовыйЭлемент.ОтображениеФигуры	= ОтображениеФигурыКнопки.Нет;
			// -CRM
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// -ПанельБП

#Область ОбработчикиТегов

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Тег".
//
Процедура ТегПриИзменении(Элемент)
	CRM_ТегиКлиент.ТегПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Создание" элемента формы "Тег".
//
Процедура ТегСоздание(Элемент, СтандартнаяОбработка)
	CRM_ТегиКлиент.ТегСоздание(Элемент, СтандартнаяОбработка, ТекущееПодразделение);
КонецПроцедуры

// Процедура - обработчик события "ОбработкаНавигационнойСсылки" элемента формы "Тег".
&НаКлиенте
Процедура Подключаемый_ТегОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)	
	CRM_ТегиКлиент.ТегОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
// Процедура обновляет отображение тегов на форме.
//
Процедура ОбновитьОблакоТегов()
	
	ПараметрыТегов	= ПараметрыТегов();
	CRM_Теги.ОбновитьОблакоТегов(ЭтотОбъект, ПараметрыТегов);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыТегов()
	
	Если ШиринаТегов = 0 Тогда
		ШиринаТегов	= Элементы.ГруппаНастройкиПраваяКолонка.Ширина;
	КонецЕсли;	
	ПараметрыТегов = Новый Структура;
	ПараметрыТегов.Вставить("МаксДлинаПервойСтроки", ШиринаТегов - Элементы.Тег.Ширина);
	ПараметрыТегов.Вставить("ДобавитьКСтроке", Элементы.Тег.Ширина);
	Возврат ПараметрыТегов;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаСервере
Функция УказыватьПричинуОтклонения(Ссылка)
	
	Возврат РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(Ссылка) 
		И РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка, Истина);
	
КонецФункции

// +CRM
&НаСервере
Процедура ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(ИзмененКлиентКонтакт = Ложь)
	
	CRM_МетодыФормДокументовСервер.ЗаполнитьГруппуИнтересаВФормеДокумента(Объект, ЭтотОбъект, , ИзмененКлиентКонтакт, ТипЗнч(Объект.Ссылка), Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеНовыйЛидНаСервере()
	
	РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Объект.Ссылка, Справочники.CRM_СостоянияЛидов.Новый);
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ВопросПриПереносеВОбработанныеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	CRM_ПереноситьПисьмаВОбработанные = (Результат = КодВозвратаДиалога.Да);
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Если CRM_ОбработатьНаСервере(Истина) Тогда
			Оповестить("CRM_УстановленФлагОбработано");
		КонецЕсли;
		
		Закрыть();
		
	КонецЕсли;
	
	Оповестить("ОбновитьАРМ");
	
КонецПроцедуры

&НаСервере
Функция CRM_ОбработатьНаСервере(Записывать = Ложь)
	
	Рассмотрено = Истина;
	Объект.CRM_СкрытьВАРМ = Истина;
	УстановитьПоложениеТумблераСтатусПисьма();		
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		Элементы.Ответственный.Видимость = Истина;
		Элементы.CRM_РольОтветственного.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ Записывать ИЛИ Записать() Тогда
		CRM_ПеренестиПисьмоВОбработанные();
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура CRM_ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры = Неопределено)
	ТекстВопроса = НСтр("ru = 'Перенести письмо в папку обработанные?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("CRM_ВопросПриПереносеВОбработанныеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,,);
КонецПроцедуры

&НаСервере
Функция CRM_НеобходимоЗадатьВопросПриПереносеВОбработанные()

	Если CRM_ПисьмоВПапкеОбработанные() Тогда Возврат Ложь; КонецЕсли;
	
	УчетнаяЗапись = Объект.УчетнаяЗапись;
	Если УчетнаяЗапись.CRM_ЗадаватьВопросПриПереносеВОбработанные Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаСервере
Функция CRM_ПисьмоВПапкеОбработанные()

	Результат = (Папка.CRM_Вид = Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные);
		
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция CRM_ОтветПереноситьВОбработанные()
	
	Ответ = ?( CRM_ПисьмоВПапкеОбработанные(), КодВозвратаДиалога.Нет, КодВозвратаДиалога.Да);
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура CRM_ПеренестиПисьмоВОбработанные()
	
	// Перенос в обработанные осуществляется, если учетная запись конкретного письма разрешает данное действие,
	// а при наличии необходимости задавать вопрос о переносе - на него был дан утвердительный ответ ранее на стороне Клиента.
	Если ВыполняетсяПереносВПапку ИЛИ (Объект.УчетнаяЗапись.CRM_ПереноситьВОбработанные И CRM_ПереноситьПисьмаВОбработанные) Тогда
		Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Объект.УчетнаяЗапись, Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные);
		УстановитьПапкуЭлектронногоПисьма(Объект.Ссылка, Папка, Ложь);
		
		// В подписке CRM_РегистрыСведенийПриЗаписи идет изменение объекта, поэтому необходимо повторное чтение из базы данных.
		Прочитать();
		
		ПрочитанныеПисьма = Новый Массив;
		ПрочитанныеПисьма.Добавить(Объект.Ссылка);
		CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(ПрочитанныеПисьма, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОбращение(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПисьмоВходящее", Объект.Ссылка);
	МассивСсылок = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ОтправительКонтакт) Тогда
		МассивСсылок.Добавить(Объект.ОтправительКонтакт);
	КонецЕсли;
	Для Каждого СтрокаДанных Из ЭтотОбъект.CRM_ТаблицаИнтересов Цикл
		МассивСсылок.Добавить(СтрокаДанных.Ссылка);
	КонецЦикла;
	ПараметрыФормы.Вставить("МассивСсылок", МассивСсылок);
	ПараметрыФормы.Вставить("АдресЭП", Объект.ОтправительАдрес);
	ПараметрыФормы.Вставить("ТемаПисьма", Объект.Тема);
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма", ПараметрыФормы, ЭтотОбъект, Объект.ОтправительАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	CRM_СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	ОбновитьСостояниеОбращения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуОПрочтении()
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Объект.Ссылка);
	CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(МассивСсылок, Истина);
КонецПроцедуры

&НаСервере
Функция МассивЭлементовСостоянияОбращения()
	
	ИспользоватьЗаявки = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьЗаявки") И (Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("CRM_ДобавлениеИзменениеЗаявок"));
	
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить(Элементы.ГруппаСостояниеЛида);
	МассивЭлементов.Добавить(Элементы.ПричинаОтклонения);
	МассивЭлементов.Добавить(Элементы.КомментарийСостоянияЛида);
	МассивЭлементов.Добавить(Элементы.ЛидСконвертированВОбъект);
	МассивЭлементов.Добавить(Элементы.ФормаCRM_ОтклонитьОбращение);
	Если ИспользоватьЗаявки Тогда
		МассивЭлементов.Добавить(Элементы.ФормаДокументCRM_ЗаявкаСоздатьНаОсновании);
	КонецЕсли;
	
	Возврат МассивЭлементов;
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеОбращения()
	
	// Установка значений по умолчанию:
	СостояниеЛида = Неопределено;
	ПричинаОтклоненияЛида = Неопределено;
	КомментарийСостоянияЛида = Неопределено;
	ЛидСконвертированВОбъект = Неопределено;
	
	CRM_МетодыФормДокументовСервер.ВосстановитьНастройкиЭлементовСостоянияОбращения(АдресНастройкиЭлементовСостоянияОбращения,
																					МассивЭлементовСостоянияОбращения());

	ИспользоватьЗаявки = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьЗаявки") И (Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("CRM_ДобавлениеИзменениеЗаявок"));
	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Объект.Ссылка) Тогда
		СтруктураСостоянияЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Объект.Ссылка);
		Если СтруктураСостоянияЛида = Неопределено Тогда
			Элементы.СостояниеЛида.Гиперссылка = Ложь;
			Элементы.ФормаCRM_ОтклонитьОбращение.Видимость = Ложь;
		Иначе
			СостояниеЛида = СтруктураСостоянияЛида.Состояние;
			Если СостояниеЛида = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
				Элементы.СостояниеЛида.Гиперссылка = Истина;
				ПричинаОтклоненияЛида = СтруктураСостоянияЛида.ПричинаОтклонения;
				КомментарийСостоянияЛида = СтруктураСостоянияЛида.Комментарий;
				Элементы.СостояниеЛида.Подсказка = "Причина: " + ПричинаОтклоненияЛида + Символы.ПС +
												   "Комментарий: " + КомментарийСостоянияЛида;
				CRM_МетодыФормДокументовСервер.ДобавитьКомандуОтменитьОтклонение(ЭтаФорма, Элементы.ГруппаКомандаОтменитьОтклонение);
			Иначе
				Если СостояниеЛида = Справочники.CRM_СостоянияЛидов.Повторный Тогда
					Элементы.ФормаCRM_ОтклонитьОбращение.Заголовок = НСтр("ru = 'Обработать'");
				КонецЕсли;
				ЛидСконвертированВОбъект = СтруктураСостоянияЛида.СконвертированВОбъект;
				Элементы.ПричинаОтклонения.Видимость = Ложь;
				Элементы.КомментарийСостоянияЛида.Видимость = Ложь;
				Элементы.СостояниеЛида.Гиперссылка = ЗначениеЗаполнено(ЛидСконвертированВОбъект);
			КонецЕсли;
			
			Элементы.ЛидСконвертированВОбъект.Видимость = ЗначениеЗаполнено(ЛидСконвертированВОбъект);			
			ОбновитьДанныеОбработкиОбращения(СтруктураСостоянияЛида.ДатаОбработки,
											СтруктураСостоянияЛида.ОтветственныйЗаОбработку,
											СтруктураСостоянияЛида.Состояние);
			
		КонецЕсли;
		Если ИспользоватьЗаявки Тогда
			Элементы.ФормаДокументCRM_ЗаявкаСоздатьНаОсновании.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.СостояниеЛида.Гиперссылка = Ложь;
		Элементы.ФормаCRM_ОтклонитьОбращение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОбработкиОбращения(ДатаОбработки, ОтветственныйЗаОбработку, СостояниеПараметр)
	
	РеквизитыВидимы = НЕ (СостояниеПараметр = Справочники.CRM_СостоянияЛидов.Новый
						ИЛИ СостояниеПараметр = Справочники.CRM_СостоянияЛидов.Повторный);
	
	ШаблонЗаголовкаДата = НСтр("ru = 'Дата обработки: %1'; en = 'Processing Date: %1'");
	Элементы.ДатаОбработкиОбращения.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовкаДата, Формат(ДатаОбработки,"ДФ='dd.MM.yyyy HH:mm'"));
	Элементы.ДатаОбработкиОбращения.Видимость = ЗначениеЗаполнено(ДатаОбработки) И РеквизитыВидимы;	
	
	
	ОтветственныйЗаОбработкуОбращения = ОтветственныйЗаОбработку;
	Элементы.ГруппаОтветственныйЗаОбработку.Видимость = ЗначениеЗаполнено(ОтветственныйЗаОбработку) И РеквизитыВидимы;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПапкуЭлектронногоПисьма(Письмо, Папка, РассчитыватьРассмотрено)
	
	Взаимодействия.УстановитьПапкуЭлектронногоПисьма(Письмо, Папка, РассчитыватьРассмотрено);
	
КонецПроцедуры// УстановитьПапкуЭлектронногоПисьма()

&НаСервере
Процедура CRM_ОбновитьДатуПисьма()
	
	ДатаПриведенная = "";
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
		И Объект["СтатусПисьма"] = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Отправлено Тогда
		ДатаПриведенная = Объект["ДатаОтправления"];
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
		И Объект["CRM_СмещениеДатыОтправленияЗаполнено"] Тогда
		CRM_СмещениеДатыТекущегоСеанса = СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
		ДатаПриведенная = Объект.Дата - Объект["CRM_СмещениеДатыОтправления"] + CRM_СмещениеДатыТекущегоСеанса;
	Иначе
		ДатаПриведенная = Объект.Дата;
	КонецЕсли;

	
	Элементы.CRM_ДекорацияДата.Заголовок = Формат(ДатаПриведенная, "ДЛФ=DD") + ", " + Формат(ДатаПриведенная, "ДФ=ЧЧ:мм");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУчетныхЗаписей(УчетныеЗаписи, Дерево)
	
	// заполнение дерева папок
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПапкиЭлектронныхПисем.Ссылка КАК Ссылка,
		|	ПапкиЭлектронныхПисем.Владелец КАК Владелец,
		|	ПапкиЭлектронныхПисем.CRM_Вид КАК Вид
		|ИЗ
		|	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
		|ГДЕ
		|	ПапкиЭлектронныхПисем.Владелец В(&УчетныеЗаписи)
		|	И ПапкиЭлектронныхПисем.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ПапкиЭлектронныхПисем.Владелец.CRM_ОтображатьТолькоПодписанныеПапки
		|				ТОГДА ПапкиЭлектронныхПисем.CRM_Подписаться
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПапкиЭлектронныхПисем.Ссылка,
		|	ПапкиЭлектронныхПисем.Владелец,
		|	ПапкиЭлектронныхПисем.CRM_Вид
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПапкиЭлектронныхПисем.Владелец.Наименование,
		|	ПапкиЭлектронныхПисем.РеквизитДопУпорядочивания
		|ИТОГИ ПО
		|	Владелец,
		|	Ссылка ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("УчетныеЗаписи", УчетныеЗаписи);

	Результат = Запрос.Выполнить();
	
	Дерево.Колонки.Добавить("Наименование");
	Дерево.Колонки.Добавить("УчетнаяЗапись");
	Дерево.Колонки.Добавить("Папка");
	Дерево.Колонки.Добавить("ВидПапки");
	Дерево.Строки.Очистить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаУЗ = Дерево.Строки.Добавить();
		СтрокаУЗ.Наименование	= ВыборкаДетальныеЗаписи.Владелец.Наименование;
		СтрокаУЗ.УчетнаяЗапись	= ВыборкаДетальныеЗаписи.Владелец;
		
		ДобавитьСтрокуВДеревоПапок(СтрокаУЗ, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	// Удалим дубли строк (ошибка платформы).
	УбратьОшибкиИтоговПоИерархии(Дерево.Строки);

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВДеревоПапок(Дерево, знач ВыборкаДетальныеЗаписи)
	
	ВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.Наименование	= ВыборкаДетальныеЗаписи.Ссылка.Наименование;
		НоваяСтрока.УчетнаяЗапись	= ВыборкаДетальныеЗаписи.Владелец;
		НоваяСтрока.Папка = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.ВидПапки = ВыборкаДетальныеЗаписи.Вид;		
		
		ДобавитьСтрокуВДеревоПапок(НоваяСтрока,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция УбратьОшибкиИтоговПоИерархии(Строки, Поле="Папка", Родитель=Неопределено)
    // Убираем все элементы, равные текущему.
    Всего=Строки.Количество();
    Для Инд=1 По Всего Цикл
        Стр=Строки[Всего-Инд];
        Зн=Стр[Поле];
        Если Родитель<>Неопределено И Зн=Родитель Тогда
            Строки.Удалить(Стр);
        Иначе
            УбратьОшибкиИтоговПоИерархии(Стр.Строки, Поле, Зн);
        КонецЕсли;
    КонецЦикла;
КонецФункции

&НаСервере
Процедура МассивПапокУчетнойЗаписиСИерархией(СтрокиДерева, МассивПапок, ИсключаемыеВидыПапок = Неопределено, Иерархия = "", ПолучатьГУИД = Ложь)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ТипЗнч(ИсключаемыеВидыПапок) = Тип("Массив") Тогда
			
			ПапкаИсключена = Ложь;
			
			Для Каждого ВидПапкиКИсключение Из ИсключаемыеВидыПапок Цикл
				Если СтрокаДерева.ВидПапки = ВидПапкиКИсключение Тогда
					ПапкаИсключена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ПапкаИсключена Тогда Продолжить; КонецЕсли;
			
		КонецЕсли;
		
		СтруктураЭлемента = Новый Структура;
		СтруктураЭлемента.Вставить("Имя", Иерархия + СтрокаДерева.Папка);
		
		Если ПолучатьГУИД Тогда
			СтруктураЭлемента.Вставить("Ссылка", СтрокаДерева.Папка.УникальныйИдентификатор());
		Иначе
			СтруктураЭлемента.Вставить("Ссылка", СтрокаДерева.Папка);
		КонецЕсли;

		Если СтрокаДерева.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта")
			ИЛИ СтрокаДерева.ВидПапки = ПредопределенноеЗначение("Перечисление.CRM_ВидыПапокЭлектроннойПочты.Удаленные") Тогда
			СтруктураЭлемента.Вставить("ВнизСписка", Истина);
		Иначе
			СтруктураЭлемента.Вставить("ВнизСписка", Ложь);
		КонецЕсли;
		
		МассивПапок.Добавить(СтруктураЭлемента);
		
		МассивПапокУчетнойЗаписиСИерархией(СтрокаДерева.Строки,МассивПапок, ИсключаемыеВидыПапок, Иерархия + "  ", ПолучатьГУИД);
		
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Процедура CRM_СформироватьЗаголовок(ТемаПисьма, ПапкаПисьма, УчетнаяЗаписьПисьма)
	
	СтруктураЗаголовкаФормы = Новый Структура;
	СтруктураЗаголовкаФормы.Вставить("Тема", ТемаПисьма);
	СтруктураЗаголовкаФормы.Вставить("Папка", ПапкаПисьма);
	СтруктураЗаголовкаФормы.Вставить("УчетнаяЗапись", УчетнаяЗаписьПисьма);
	Заголовок = CRM_ОбщегоНазначенияСервер.ПолучитьЗаголовокФормыДокумента(Объект.Ссылка, СтруктураЗаголовкаФормы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТекстHTML()
	
	// Заполняем массив с картинками расширений файлов
	СписокИконокФайлов.Очистить();
	Для ИндексКартинки = 0 По 38 Цикл
		СписокИконокФайлов.Добавить(БиблиотекаКартинок["CRM_ИконкаТипаФайла_"+ИндексКартинки*2]);
	КонецЦикла;
	
	// Установим текст и вид текста.
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
		
		ТекстПисьма = Объект.ТекстHTML;
		Элементы.ТекстПисьма.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		
	Иначе
		
		ТекстПисьма = Объект.Текст;
		Элементы.ТекстПисьма.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
		
	КонецЕсли;
	
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML 
		ИЛИ Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
		
		Объект_ТекстHTML = Объект.ТекстHTML;
		
		Для Каждого СтрокаВложения Из Вложения Цикл
			Если ЗначениеЗаполнено(СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор)
			   И СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор <> "#" Тогда
				
				Если ЗначениеЗаполнено(СтрокаВложения.Ссылка) Тогда
					// +CRM
					ДвоичныеДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(СтрокаВложения.Ссылка, Ложь);
					//Если ДвоичныеДанныеКартинки = Неопределено Тогда
					//	Продолжить;
					//КонецЕсли;
					// -CRM
					АдресКартинки = ПоместитьВоВременноеХранилище(Новый Картинка(ДвоичныеДанныеКартинки),УникальныйИдентификатор);
					
				Иначе
					
					АдресКартинки = СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор;
					
				КонецЕсли; 	
				
				Если Найти(Объект_ТекстHTML, "cid:"+СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор) > 0 Тогда
					Объект_ТекстHTML = СтрЗаменить(Объект_ТекстHTML, "cid:"+СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор, АдресКартинки);
				Иначе
					Объект_ТекстHTML = СтрЗаменить(Объект_ТекстHTML, СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор, АдресКартинки);
				КонецЕсли;
				
				Если СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор = "###" Тогда
					СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор = "#";
				КонецЕсли;
				// +CRM показывать будем только файлы-вложения, изображения из текста во вложениях не показываем.
			Иначе
				
				СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор = "#";
				
				// -CRM	
			КонецЕсли;	
		КонецЦикла;
		
		// У некоторых писем отсутсвует заголовок.
		
		Если  Найти(Объект_ТекстHTML,"<head>") = 0 Тогда
			
			Начало = "
			|<html>
			|<head>  
			|<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
			|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
			|<body scroll=""auto"">";
			
			Конец = "
			|</body>
			|</html>";
			
			Объект_ТекстHTML = Начало + Объект_ТекстHTML + Конец;
		КонецЕсли;	
		
		ТекстПисьма = Объект_ТекстHTML;
	Иначе	
		Для Каждого СтрокаВложения Из Вложения Цикл
			СтрокаВложения.ИДФайлаЭлектронногоПисьмаОтбор = "#";
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#Область УчетРабочегоВремени

&НаКлиенте
Процедура Подключаемый_Команда_CRM_УказатьТрудозатраты(Команда)
	
	Подключаемый_Команда_CRM_УказатьТрудозатратыНаСервере();
	CRM_ТрудозатратыКлиент.УказатьТрудозатраты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатраты(Команда)
	
	Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатратыНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатратыНаСервере(ИмяКоманды)
	
	CRM_ТрудозатратыСервер.ВыполнитьДействиеНадТаблицейЗаписейТрудозатраты(ЭтотОбъект, ИмяКоманды);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_Команда_CRM_УказатьТрудозатратыНаСервере()
	
	CRM_ТрудозатратыСервер.УказатьТрудозатратыНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиПанельТрудозатрат()
	
	CRM_ТрудозатратыКлиент.ВывестиПанельТрудозатрат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьПанельТрудозатрат()
	
	CRM_ТрудозатратыКлиент.ЗакрытьПанельТрудозатрат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_РабочееВремяПользователейПриИзменении(Элемент)
	
	Отказ = Ложь;
	CRM_ТрудозатратыКлиент.РабочееВремяПользователейПриИзменении(ЭтотОбъект, Элемент, Отказ);
	
	Если НЕ Отказ Тогда
		Подключаемый_CRM_РабочееВремяПользователейПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_РабочееВремяПользователейПриИзмененииНаСервере()
	
	CRM_ТрудозатратыСервер.ТаблицаЗаписейПриИзмененииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавленияНаСервере()
	
	CRM_ТрудозатратыСервер.ТаблицаЗаписейПередНачаломДобавленияНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

// -CRM

#КонецОбласти