
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++#1316 смарт: Лопато 09.03.2023 //Запретить использование в документах подразделения другой организации  
	смартДобавитьЭлементыПрограммно();
	//--#1316 смарт: Лопато 09.03.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1316 смарт: Лопато 09.03.2023 //Запретить использование в документах подразделения другой организации  
&НаСервере
Процедура смартДобавитьЭлементыПрограммно()
	
	//++ смарт:ММ #048 234 08.06.2020 - Заявка на пусконаладку  
	Если Элементы.Найти("смартРуководительСервисногоЦентра") = Неопределено Тогда
		
		НовыйЭлемент = Элементы.Вставить("смартРуководительСервисногоЦентра", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаРеквизиты, ЭтаФорма.Элементы.CRM_ФормулаРасчетаПотенциала);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.смартРуководительСервисногоЦентра";
		
	КонецЕсли;
	//-- смарт:ММ 08.06.2020
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаОрганизацияВладелец", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаРеквизиты, ЭтаФорма.Элементы.CRM_ФормулаРасчетаПотенциала);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОрганизацияВладелец", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаОрганизацияВладелец);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОрганизацияВладелец";
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.Ширина = 0;
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартОрганизацияВладелец", "поле ""Организация - владелец""", 
													 ЭтаФорма.Элементы.смартГруппаОрганизацияВладелец, ЭтаФорма);

	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаПодразделениеНеИспользуется", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаРеквизиты, ЭтаФорма.Элементы.CRM_ФормулаРасчетаПотенциала);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
													 
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартПодразделениеНеИспользуется", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаПодразделениеНеИспользуется);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартПодразделениеНеИспользуется";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартПодразделениеНеИспользуется", "поле ""Подразделение не используется""", 
													 ЭтаФорма.Элементы.смартГруппаПодразделениеНеИспользуется, ЭтаФорма);
													 
	//++ #Б-958 смарт: Фролов 03.10.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам
	НовыйЭлемент = Элементы.Вставить("смартПодразделениеДляПланирования", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаРеквизиты, ЭтаФорма.Элементы.ТекущийРуководитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартПодразделениеДляПланирования";
	//-- #Б-958 смарт: Фролов 03.10.2024
	
	//++ #Б-2208 смарт: Фролов 24.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	НовыйЭлемент = Элементы.Вставить("смартИсполнительОтПодразделения", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаРеквизиты, ЭтаФорма.Элементы.ТекущийРуководитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартИсполнительОтПодразделения";
	//-- #Б-2208 смарт: Фролов 24.02.2025
	
	//++ #Б-3548 смарт: Фролов 11.06.2025 //Изменение подписи в печатной форме КП для региональных представительств.
	НовыйЭлемент = Элементы.Вставить("смартАдресПодразделения", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаРеквизиты, ЭтаФорма.Элементы.ТекущийРуководитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресПодразделения";
	//-- #Б-3548 смарт: Фролов 11.06.2025
													 
КонецПроцедуры //--#1316 смарт: Лопато 09.03.2023

//++#1316 смарт: Лопато 09.03.2023 //Запретить использование в документах подразделения другой организации  
&НаКлиенте
Процедура смартДействиеПоказатьИнформацию(Команда)
	
	Если СтрНайти(Команда.Имя, "смартОрганизацияВладелец") <> 0 Тогда

		ИнформацияЗаголовок = "Организация - владелец";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'В поле <b>Организация - владелец</b> указывается организация - владелец подразделения'")
			);

	ИначеЕсли СтрНайти(Команда.Имя, "смартПодразделениеНеИспользуется") <> 0 Тогда

		ИнформацияЗаголовок = "Подразделение не используется";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			    НСтр("ru = 'Флажок <b>Подразделение не используется</b> устанавливается для недействующего подразделения'")
			  + Символы.ПС
			  + НСтр("ru = 'и скрывает подразделение в форме выбора в документах: <b>Заказ клиента, Релизация товаров и услуг, Перемещение товаров, Заявка на расходование денежных средств</b>'")
			);

	Иначе
		ИнформацияЗаголовок = "";
		ИнформацияТекст = "";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры //--#1316 смарт: Лопато 09.03.2023

#КонецОбласти