
#Область ДоработкиСмарт

//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерийТовары()

	смартЗаполнитьСтатусыУказанияСерийТоварыСервер();
	
КонецПроцедуры //--#1775 смарт: Лопато 12.04.2024					

//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
&НаСервере
Процедура смартЗаполнитьСтатусыУказанияСерийТоварыСервер()

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры //--#1775 смарт: Лопато 12.04.2024					
	
#КонецОбласти