
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ДатаОтгрузки = ТекущаяДатаСеанса() + 24 * 60 * 60; 
	ГрузКоличествоГрузовыхМест = 1; 
	ИспользоватьРазличныхПлательщиков = Истина; 
	ФормаОплатыПредставление = "noncash";
	ВремяДоставкиС = '00010101090000';
	ВремяДоставкиПо = '00010101180000';	
	ВремяОтгрузкиС = '00010101090000';
	ВремяОтгрузкиПо = '00010101180000'; 
	ЗаказчикКонтрагентСсылка = Константы.ДЛ_Заказчик.Получить();
	НашаРольВПеревозке = Константы.ДЛ_РольВЗаказе.Получить(); 
	ФайловыйВариант = ДЛ_ДеловыеЛинииПовтИсп.ФайловыйРежимЗапускаБазы();
	
	Объект.ДокументыОснования.Очистить();
	
	Если Параметры.Свойство("ДокументОснование") Тогда 		
		 
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.Документ = Параметры.ДокументОснование;
		
	КонецЕсли; 
	
	Если Параметры.Свойство("ДанныеЗаказаСтрокой") Тогда 
		
		ЗаполнитьПоДаннымСуществующегоЗаказа(ДЛ_ДеловыеЛинии.ДесериализоватьСтруктуруПараметров(Параметры.ДанныеЗаказаСтрокой));	
		
	КонецЕсли;
	
	ЗаполнитьПоДокументамОснованиям();	
	ЗаполнитьДополнительныеУслуги();
	ЗаполнитьДополнительныеТребования(); 
	ЗаполнитьПервичноРезультатПредрсчета();
	ЗаполнитьСписокПоследнихШаблонов();
	
	ВосстановитьИзЧерновика();
	
	ВремяОткрытияФормы = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеОбязательныхРеквизитов(НомерШага, Отказ, ВыводитьПредупреждения = Истина, ПолучитьТарифыАвтоматически = Ложь)
	
	ОчиститьСообщения();
	
	Если НомерШага <= 1 Тогда
		Возврат;
	КонецЕсли;
	
	ОбязательныеРеквизиты = ОбязательныеРеквизитыДляПереходаНаСтраницу(НомерШага);
	
	ТекстОшибки = НСтр("ru = 'Поле ""%1"" на шаге ""%2"" не заполнено';
						|en = 'Field ""%1"" is not filled in on the step ""%2""'");
	
	ШагОшибки = 10;
	
	ПроверитьЗаполнениеРеквизитовНаСервере(ШагОшибки, Отказ, ВыводитьПредупреждения);
	
	ЕстьОшибки = Ложь;
	ПроверитьТелефоныКонтактныхЛиц(ЕстьОшибки, ВыводитьПредупреждения);
	Если ЕстьОшибки Тогда
		Отказ = Истина;
		ШагОшибки = 0;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПроверитьEmailКонтактныхЛиц(ЕстьОшибки, ВыводитьПредупреждения);
	Если ЕстьОшибки Тогда
		Отказ = Истина;
		ШагОшибки = 0;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Если НомерШага = 4 Тогда
		ЕстьОшибки = Ложь;
		ТекущийШагОшибки = ПроверитьВремяОтгрузки(ЕстьОшибки, Истина);
		Если ЕстьОшибки Тогда
			ШагОшибки = Мин(ШагОшибки, ТекущийШагОшибки);
			Отказ = Истина;
		КонецЕсли;		
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПроверитьВГХ("",ЕстьОшибки, ВыводитьПредупреждения);
	Если ЕстьОшибки Тогда
		Отказ = Истина;
		ШагОшибки = 1;
	КонецЕсли;	
	
	Для Каждого ТекущийРеквизит Из ОбязательныеРеквизиты Цикл
		
		ПараметрыРеквизита = СтрРазделить(ТекущийРеквизит.Значение, ".");
		ШагТекущейОшибки = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыРеквизита[0]);
		Значение = ПараметрыРеквизита[1];
		
		Если ШагТекущейОшибки > ШагОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект[Значение]) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, 
										ТекущийРеквизит.Представление, 
										Элементы.ГруппаСтраницы.ПодчиненныеЭлементы[ШагТекущейОшибки].Заголовок);
										
			Отказ = Истина;
			Если ВыводитьПредупреждения Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Значение,,Отказ);
			КонецЕсли;
			
			ШагОшибки = Мин(ШагОшибки, ШагТекущейОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НомерШага = 5 И НЕ Отказ Тогда
		ТекущийШагОшибки = ПроверитьВремяОтгрузки(ЕстьОшибки, Истина);
		
		Если ЕстьОшибки Тогда
			ШагОшибки = Мин(ШагОшибки, ТекущийШагОшибки);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеРеквизитыДляПереходаНаСтраницу(НомерШага)
	
	ОбязательныеРеквизиты = Новый СписокЗначений();
	
	Если НомерШага <= 1 Тогда
		Возврат ОбязательныеРеквизиты;
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("0.ОтправительКонтрагентНаименование", НСтр("ru = 'Отправитель';
																				|en = 'Sender'"));
	
	Если ЗначениеЗаполнено(ОтправительКонтрагентНаименование) Тогда
		Если НомерШага > 3  Тогда
			ОбязательныеРеквизиты.Добавить("0.ОтправительКонтактноеЛицоНаименование",
				НСтр("ru = 'Контактное лицо отправителя';
					|en = 'Sender contact person'"));
			ОбязательныеРеквизиты.Добавить("0.ОтправительКонтактноеЛицоТелефонПредставление",
				НСтр("ru = 'Телефон контактного лица отправителя';
					|en = 'Phone number of sender contact person'"));			
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("0.ПолучательКонтрагентНаименование", НСтр("ru = 'Получатель';
																				|en = 'Recipient'"));
	
	Если ЗначениеЗаполнено(ПолучательКонтрагентНаименование) Тогда
		Если НомерШага > 3 Тогда
			ОбязательныеРеквизиты.Добавить("0.ПолучательКонтактноеЛицоНаименование",
				НСтр("ru = 'Контактное лицо получателя';
					|en = 'Recipient contact person'"));
			ОбязательныеРеквизиты.Добавить("0.ПолучательКонтактноеЛицоТелефонПредставление",
				НСтр("ru = 'Телефон контактного лица получателя';
					|en = 'Phone number of recipient contact person'"));  		
				
		КонецЕсли;
		
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("0.ПлательщикРоль", НСтр("ru = 'Роль плательщика';
															|en = 'Payer role'"));

	Если ПлательщикРоль = 3 Тогда
		ОбязательныеРеквизиты.Добавить("0.ПлательщикКонтрагентНаименование", НСтр("ru = 'Плательщик';
																					|en = 'Payer'"));
		Если ЗначениеЗаполнено(ПлательщикКонтрагентНаименование) Тогда
			Если НомерШага > 3 Тогда
				ОбязательныеРеквизиты.Добавить("0.ПлательщикКонтактноеЛицоНаименование",
					НСтр("ru = 'Контактное лицо плательщика';
						|en = 'Payer contact person'"));
				ОбязательныеРеквизиты.Добавить("0.ПлательщикКонтактноеЛицоТелефонПредставление",
					НСтр("ru = 'Телефон контактного лица плательщика';
						|en = 'Phone number of payer contact person'"));
					
				Если ПлательщикКонтактноеЛицоТелефонДополнительныйДоступен Тогда
					ОбязательныеРеквизиты.Добавить("0.ПлательщикКонтактноеЛицоТелефонДополнительныйПредставление",
						НСтр("ru = 'Дополнительный телефон контактного лица плательщика';
							|en = 'Additional phone number of payer contact person'"));
				КонецЕсли;
					
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	ОбязательныеРеквизиты.Добавить("0.ДатаОтгрузки", НСтр("ru = 'Дата отгрузки';
															|en = 'Shipment date'"));		
	
	ОбязательныеРеквизиты.Добавить("1.ГрузКоличествоГрузовыхМест", НСтр("ru = 'Количество мест';
																		|en = 'Unit load quantity'"));
	Если ГрузКоличествоГрузовыхМест > 1 Тогда
		ОбязательныеРеквизиты.Добавить("1.ГрузВес", НСтр("ru = 'Общий вес';
														|en = 'Total weight'"));
	КонецЕсли;	
	
	ОбязательныеРеквизиты.Добавить("1.ГрузМаксимальныйВес", НСтр("ru = 'Вес';
																|en = 'Weight'"));
	ОбязательныеРеквизиты.Добавить("1.ГрузОбъем", НСтр("ru = 'Объем';
														|en = 'Volume'"));
	ОбязательныеРеквизиты.Добавить("1.ГрузМаксимальнаяВысота", НСтр("ru = 'Высота';
																	|en = 'Height'"));
	ОбязательныеРеквизиты.Добавить("1.ГрузМаксимальнаяШирина", НСтр("ru = 'Ширина';
																	|en = 'Width'"));
	ОбязательныеРеквизиты.Добавить("1.ГрузМаксимальнаяДлина", НСтр("ru = 'Длина';
																	|en = 'Length'"));	
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеРеквизитовНаСервере(ШагОшибки, Отказ, ВыводитьПредупреждения = Истина)
	
	ЕстьОшибки = Ложь;
	ПроверитьРеквизитыКонтрагентов(ЕстьОшибки, ВыводитьПредупреждения);
	Если ЕстьОшибки Тогда
		Отказ = Истина;
		ШагОшибки = 0;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПроверитьРеквизитыАдресов(ЕстьОшибки, ВыводитьПредупреждения);
	Если ЕстьОшибки Тогда
		Отказ = Истина;
		ШагОшибки = 0;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПроверитьДатуОтгрузки(ЕстьОшибки, ВыводитьПредупреждения);
	Если ЕстьОшибки Тогда
		Отказ = Истина;
		ШагОшибки = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТелефоныКонтактныхЛиц(ЕстьОшибки, ВыводитьПредупреждения)
	
	ПроверитьНомерТелефона("ОтправительКонтактноеЛицоТелефон", ЕстьОшибки, ВыводитьПредупреждения); 

	ПроверитьНомерТелефона("ПолучательКонтактноеЛицоТелефон", ЕстьОшибки, ВыводитьПредупреждения); 	
	
	Если ПлательщикРоль = 3 Тогда
		ПроверитьНомерТелефона("ПлательщикКонтактноеЛицоТелефон", ЕстьОшибки, ВыводитьПредупреждения);
		
		Если ПлательщикКонтактноеЛицоТелефонДополнительныйДоступен Тогда
			ПроверитьНомерТелефона("ПлательщикКонтактноеЛицоТелефонДополнительный", ЕстьОшибки, ВыводитьПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьEmailКонтактныхЛиц(ЕстьОшибки, ВыводитьПредупреждения)
	
	ПроверитьEmail("ПлательщикКонтактноеЛицоEmail", ЕстьОшибки, ВыводитьПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРеквизитыКонтрагентов(ЕстьОшибки, ВыводитьПредупреждения = Истина)
	
	ПроверитьРеквизитыКонтрагента("ОтправительКонтрагент", ЕстьОшибки, ВыводитьПредупреждения);
	ПроверитьРеквизитыКонтрагента("ПолучательКонтрагент", ЕстьОшибки, ВыводитьПредупреждения);
	
	Если ПлательщикРоль = 3 Тогда
		ПроверитьРеквизитыКонтрагента("ПлательщикКонтрагент", ЕстьОшибки, ВыводитьПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРеквизитыКонтрагента(Префикс, ЕстьОшибки, ВыводитьПредупреждения = Истина)   
	
	Если ЭтотОбъект[Префикс + "Иностранец"] Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяРеквизита = Префикс + "Наименование";
	КонтрагентСсылка = ЭтотОбъект[Префикс + "Ссылка"];
	КонтрагентНаименование = ЭтотОбъект[Префикс + "Наименование"];
	КонтрагентЮрФизЛицо = ЭтотОбъект[Префикс + "ЮрФизЛицо"];
	КонтрагентИНН = ЭтотОбъект[Префикс + "ИНН"];
	КонтрагентКПП = ЭтотОбъект[Префикс + "КПП"];
	
	ЭтоОтправитель = (СтрНайти(Префикс, "Отправитель") > 0);
	
	Если Не ЗначениеЗаполнено(КонтрагентСсылка) 
		И КонтрагентНаименование = "" Тогда
		Возврат;
	КонецЕсли;
	
	УчастникГрузоперевозки = СтрЗаменить(Префикс, "Контрагент", "");
	
	ТекстОшибки = НСтр("ru = 'Некорректный реквизит ""%1"" у участника грузоперевозки в поле ""%2"".';
						|en = 'Cargo transportation participant has Incorrect attributes ""%1"" in the field ""%2""'");
	
	Если ЗначениеЗаполнено(КонтрагентСсылка) 
		И КонтрагентНаименование = "" Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			НСтр("ru = 'Наименование';
				|en = 'Description'"),
			УчастникГрузоперевозки);
		
		ЕстьОшибки = Истина;
		Если ВыводитьПредупреждения Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,ИмяРеквизита);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если КонтрагентЮрФизЛицо <> 2 Тогда
	
		Если Не ЗначениеЗаполнено(КонтрагентИНН) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибки,
				НСтр("ru = 'ИНН';
					|en = 'TIN'"),
				УчастникГрузоперевозки);
			
			ЕстьОшибки = Истина;
			Если ВыводитьПредупреждения Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,ИмяРеквизита);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
				
				ТекстСообщения = "";
				Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(КонтрагентИНН, КонтрагентЮрФизЛицо = 1,
					ТекстСообщения) Тогда
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ТекстОшибки,
						НСтр("ru = 'ИНН';
							|en = 'TIN'"),
						УчастникГрузоперевозки)
						+ Символы.ПС + ТекстСообщения;
				
					ЕстьОшибки = Истина;
					Если ВыводитьПредупреждения Тогда
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,ИмяРеквизита);
					КонецЕсли;
					
				КонецЕсли;
			
			Иначе 
				
				ТекстСообщения = "";
				Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(КонтрагентИНН, Ложь,
					ТекстСообщения) Тогда 
					
					ТекстСообщения = ""; 
					Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(КонтрагентИНН, Истина,
						ТекстСообщения) Тогда
					
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							ТекстОшибки,
							НСтр("ru = 'ИНН';
								|en = 'TIN'"),
							УчастникГрузоперевозки)
							+ Символы.ПС + ТекстСообщения;
					
						ЕстьОшибки = Истина;
						Если ВыводитьПредупреждения Тогда
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,ИмяРеквизита);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	КонтрагентЮридическийАдрес = ЭтотОбъект[Префикс + "ЮридическийАдресПредставление"];  		
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПаспортныеДанные(КонтрагентСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			,
	|			Физлицо = &Физлицо
	|				И ВидДокумента = &ВидДокумента) КАК ДокументыФизическихЛицСрезПоследних"; 
	Запрос.УстановитьПараметр("Физлицо", КонтрагентСсылка);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Новый Структура("Серия, Номер", "", "");
		
	Иначе
		
		Возврат Результат.Выгрузить()[0];
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПроверитьРеквизитыАдресов(ЕстьОшибки, ВыводитьПредупреждения)
	
	ПроверитьРеквизитыАдреса("ОтправительАдрес", ЕстьОшибки, ВыводитьПредупреждения);
	ПроверитьРеквизитыАдреса("ПолучательАдрес", ЕстьОшибки, ВыводитьПредупреждения);
	Если ПлательщикРоль = 3 Тогда
		ПроверитьРеквизитыАдреса("ПлательщикАдрес", ЕстьОшибки, ВыводитьПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРеквизитыАдреса(ИмяРеквизита, ЕстьОшибки, ВыводитьПредупреждения)	
	
	ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита + "Значение"];
	ЗначениеПредставление = ЭтотОбъект[ИмяРеквизита + "Представление"];
	
	ИмяПоля = ИмяРеквизита;
	ЗаголовокПоля = ИмяРеквизита;
	ПутьКДанным = "";
	
	Если Найти(ИмяРеквизита, "ЮридическийАдрес") Тогда
		ИмяПоля = СтрЗаменить(ИмяРеквизита, "ЮридическийАдрес", "");
		ВладелецАдреса = ЭтотОбъект[ИмяПоля + "Наименование"];
		
		ТекстОшибкиПустогоАдреса = НСтр("ru = 'Не заполнен юридический адрес у участника грузоперевозки ""%1"".
										|Добавьте юридический адрес участнику ""%1"".';
										|en = 'The legal address of the cargo transportation participant is not filled in. ""%1"".
										|Add legal address to the participant ""%1"".'");
		
		ТекстОшибкиНекорректногоАдреса = НСтр("ru = 'Некорректный формат юридического адреса у участника грузоперевозки ""%1"". 
											|Проверьте корректность адреса вручную.';
											|en = 'Incorrect format of the legal address of the cargo transportation participant ""%1"". 
											|Check address manually.'");
		
		Если Найти(ИмяРеквизита, "Отправитель") Тогда
			ЗаголовокПоля = "Отправитель";
		ИначеЕсли Найти(ИмяРеквизита, "Получатель") Тогда
			ЗаголовокПоля = "Получатель";
		ИначеЕсли Найти(ИмяРеквизита, "Плательщик") Тогда
			ЗаголовокПоля = "Плательщик";
		КонецЕсли;
		
		ЭлементФормы = ЭтотОбъект.Элементы.Найти(ИмяПоля);
		Если ЭлементФормы <> Неопределено Тогда
			ПутьКДанным = ЭлементФормы.ПутьКДанным;
		КонецЕсли;
		
	Иначе
		ВладелецАдреса = ЭтотОбъект[ИмяРеквизита + "Владелец"];
		
		ТекстОшибкиПустогоАдреса = НСтр("ru = 'У выбранного в поле ""%1"" владельца адреса не заполнен адрес доставки/склада.
										|Добавьте адрес доставки/склада для этого владельца или введите произвольный адрес.';
										|en = 'Warehouse/delivery address is not filled in the field ""%1"" of selected owner.
										|Add a delivery/warehouse address for this owner or enter arbitrary address.'");
		
		ТекстОшибкиНекорректногоАдреса = НСтр("ru = 'Некорректный формат адреса в поле ""%1"". 
											|Проверьте корректность адреса вручную.';
											|en = 'Incorrect address format in the field ""%1"". 
											|Check address manually.'");
		
		ЭлементФормы = ЭтотОбъект.Элементы.Найти(ИмяПоля);
		
		Если ЭлементФормы <> Неопределено Тогда
			ЗаголовокПоля = ЭлементФормы.Заголовок;
			ПутьКДанным = ЭлементФормы.ПутьКДанным;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецАдреса)
		И Не ЗначениеЗаполнено(ЗначениеПредставление) Тогда
		ЕстьОшибки = Истина;
		Если ВыводитьПредупреждения Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибкиПустогоАдреса,
				ЗаголовокПоля)
				,,ПутьКДанным);
		КонецЕсли;
		Возврат;
	КонецЕсли;
				
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		
		ЕстьОшибки = Истина;
		Если ЗначениеЗаполнено(ЗначениеПредставление) Тогда
			
			Если ВыводитьПредупреждения Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстОшибкиНекорректногоАдреса,
					ЗаголовокПоля)
					,,ПутьКДанным);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураАдреса = Адрес_ЗначениеИзСтрокиJSON(ЗначениеРеквизита);
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса) Тогда
		ЕстьОшибки = Истина;
		Если ВыводитьПредупреждения Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибкиНекорректногоАдреса,
				ЗаголовокПоля)
				,,ПутьКДанным);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СписокОшибок = РаботаСАдресами.ПроверитьАдрес(ЗначениеРеквизита).СписокОшибок;
	
	Если СписокОшибок.Количество() <> 0 Тогда
		ЕстьОшибки = Истина;
		
		Если НЕ СписокОшибок[0].Пометка Тогда
			Если ВыводитьПредупреждения Тогда
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибкиНекорректногоАдреса,
					ЗаголовокПоля)
					,,ПутьКДанным);
			КонецЕсли;
				
		Иначе
			
			Если ВыводитьПредупреждения Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстОшибкиНекорректногоАдреса,
					ЗаголовокПоля);
					
				Для Каждого ТекущаяОшибка Из СписокОшибок Цикл
					ТекстОшибки = ТекстОшибки + Символы.ПС + ТекущаяОшибка.Представление;
				КонецЦикла;
				
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,ПутьКДанным);
			КонецЕсли;
			
		КонецЕсли;                                  
	ИначеЕсли СтруктураАдреса.Свойство("Id") И Не ЗначениеЗаполнено(СтруктураАдреса.Id) Тогда
		
		ЕстьОшибки = Истина;
		
		Если ВыводитьПредупреждения Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибкиНекорректногоАдреса,
				ЗаголовокПоля)
				,,ПутьКДанным);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДатуОтгрузки(ЕстьОшибки, ВыводитьПредупреждения)
	
	Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
	
		ТекущаяДата = '00010101';
		УстановитьДатуОтгрузки(ТекущаяДата);
		
		Если ТекущаяДата > ДатаОтгрузки Тогда
			
			ЕстьОшибки = Истина;
			Если ВыводитьПредупреждения Тогда
				ТекстОшибки = НСтр("ru = 'Выбранная дата отгрузки недоступна. Укажите актуальную дату.';
									|en = 'Selected shipment date is not available. Specify actual date.'");
				ТекстСообщения = ТекстОшибки;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"ДатаОтгрузки");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура УстановитьДатуОтгрузки(ДатаОтгрузки)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ДатаОтгрузки = НачалоДня(ДатаОтгрузки);
	
	Если ДатаОтгрузки < НачалоДня(ТекущаяДата) Тогда
		ДатаОтгрузки = НачалоДня(ТекущаяДата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВремяОтгрузки(ЕстьОшибки, ВыводитьПредупреждения)
	
	ШагОшибки = 0;
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	НачалоТекущегоДня = НачалоДня(ТекущаяДата);
	ТекущееВремя = Дата(1,1,1) + (ТекущаяДата - НачалоТекущегоДня);
	НачалоДняОтгрузки = НачалоДня(ДатаОтгрузки); 
	
	Если НачалоТекущегоДня = НачалоДняОтгрузки
		И ВремяОтгрузкиПо <> Дата(1,1,1,0,0,0)
		И ТекущееВремя > ВремяОтгрузкиПо Тогда
		ЕстьОшибки = Истина;
		Если ВыводитьПредупреждения Тогда
			ТекстОшибки = НСтр("ru = 'Невозможно оформить доставку на указанное время отгрузки. Время отгрузки меньше, чем текущее.';
			|en = 'Cannot register delivery for the specified shipment time. The shipment time is less than the current one.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,"ОтправительВремяПлановойОтгрузки");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ШагОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНомерТелефона(Префикс, ЕстьОшибки, ВыводитьПредупреждения = Истина)
	
	ИмяРеквизита = Префикс + "Представление";
	
	ИмяГруппы = "";
	Если СтрНайти(ИмяРеквизита, "Отправитель") > 0 Тогда
		ИмяГруппы = "Отправитель";
	ИначеЕсли СтрНайти(ИмяРеквизита, "Получатель") > 0 Тогда
		ИмяГруппы = "Получатель";
	ИначеЕсли СтрНайти(ИмяРеквизита, "Плательщик") > 0 Тогда
		ИмяГруппы = "Плательщик";
	КонецЕсли;
	
	Представление = ЭтотОбъект[ИмяРеквизита];
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибок = ОшибкиЗаполненияТелефона(Префикс);
	
	ЕстьОшибки = СписокОшибок.Количество();
	
	ТекстСообщения = "";
	Для Каждого ТекущаяОшибка Из СписокОшибок Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + ТекущаяОшибка.Представление;
	КонецЦикла;
	
	ТекстСообщения = СокрЛП(ТекстСообщения);
	
	Если ВыводитьПредупреждения 
		И ЕстьОшибки Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Некорректный формат номера телефона в поле ""Телефон"" группы ""%1"".';
				|en = 'Incorrect format of phone number in the ""Phone"" field of the ""%1"" group.'"),
			ИмяГруппы);
		ТекстСообщения = ТекстОшибки + Символы.ПС + ТекстСообщения;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьEmail(Префикс, ЕстьОшибки, ВыводитьПредупреждения = Истина)
	
	ИмяРеквизита = Префикс;
	ЭтоEmailОтправителя = (СтрНайти(ИмяРеквизита, "Отправитель") > 0);
	
	Представление = ЭтотОбъект[ИмяРеквизита];
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Представление);
	
	ТекстСообщения = "";
	
	Если ВыводитьПредупреждения 
		И ЕстьОшибки Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Адрес электронной почты группы ""%1"" содержит ошибки.';
				|en = 'The group ""%1"" email address contains errors.'"),
			?(ЭтоEmailОтправителя, "Отправитель", "Получатель"));
		ТекстСообщения = ТекстОшибки + Символы.ПС + ТекстСообщения;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОшибкиЗаполненияТелефона(Префикс)
	
	Представление = ЭтотОбъект[Префикс + "Представление"];
	Значение = ЭтотОбъект[Префикс + "Значение"];
	
	СписокОшибок = Новый СписокЗначений;
	
	Если Представление = "" Тогда
		Возврат СписокОшибок;
	КонецЕсли;
	
	СтруктураТелефона = Неопределено;
	
	Если Значение <> "" Тогда
		
		Отказ = Ложь;
		ТекстОшибки = "";
		СтруктураТелефона = ЗначениеИзСтрокиJSON(Значение, Отказ, ТекстОшибки);
		
	КонецЕсли;
	
	Если СтруктураТелефона = Неопределено Тогда
		
		Значение = КонтактнаяИнформацияПоПредставлению(Представление, "Телефон");
		ЭтотОбъект[Префикс + "Значение"] = Значение;
		Отказ = Ложь;
		ТекстОшибки = "";
		СтруктураТелефона = ЗначениеИзСтрокиJSON(Значение, Отказ, ТекстОшибки);
		
	КонецЕсли;
	
	ПолныйНомерТелефона = "";
	Если СтруктураТелефона.Свойство("countryCode") Тогда
		ПолныйНомерТелефона = ПолныйНомерТелефона + СтруктураТелефона.countryCode;
	КонецЕсли;
	
	Если СтруктураТелефона.Свойство("areaCode") Тогда
		ПолныйНомерТелефона = ПолныйНомерТелефона + СтруктураТелефона.areaCode;
	КонецЕсли;
	
	Если СтруктураТелефона.Свойство("number") Тогда
		ПолныйНомерТелефона = ПолныйНомерТелефона + СтруктураТелефона.number;
	КонецЕсли;
	
	НомерТелефонаТолькоЦифры = ТолькоЦифры(ПолныйНомерТелефона);
	
	Если СтрДлина(НомерТелефонаТолькоЦифры) < 10 Тогда
		СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'Номер телефона слишком короткий (менее 10 цифр)';
													|en = 'Too short phone number (less than 10 digits)'"));
	КонецЕсли;
	
	Если СтрДлина(НомерТелефонаТолькоЦифры) > 15 Тогда
		СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'Номер телефона слишком длинный';
													|en = 'Phone number is too long.'"));
	КонецЕсли;
	
	Если НомерТелефонаСодержитНедопустимыеСимволы(ПолныйНомерТелефона) Тогда
		СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'Номер телефона содержит недопустимые символы';
													|en = 'Phone number contains illegal characters.'"));
	КонецЕсли;
	
	Возврат СписокОшибок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиJSON(Значение, Отказ, ТекстОшибки)	
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	ПервыйСимвол = Лев(Значение, 1);
	Если ПервыйСимвол <> "[" И ПервыйСимвол <> "{" Тогда
		Возврат Значение;
	КонецЕсли;
	
	Результат = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Попытка
		ЧтениеJSON.УстановитьСтроку(Значение);
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ЕстьОшибка = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сервис доставки.Преобразование данных.';
										|en = 'Delivery service. Data conversion.'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТолькоЦифры(Знач СтрокаДляПроверки)
	
	ЛишниеСимволы = СтрСоединить(СтрРазделить(СтрокаДляПроверки, "0123456789"), "");
	Результат     = СтрСоединить(СтрРазделить(СтрокаДляПроверки, ЛишниеСимволы), "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НомерТелефонаСодержитНедопустимыеСимволы(Знач СтрокаПроверки)
	
	СписокДопустимыхСимволов = "+-.,() wp1234567890";
	Возврат СтрРазделить(СтрокаПроверки, СписокДопустимыхСимволов, Ложь).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВГХ(ИмяРеквизита = "", ЕстьОшибки = Ложь, ВыводитьПредупреждения = Истина)
	
	ПроверитьВсе = (ИмяРеквизита = "");  	 
	
	Если (ПроверитьВсе ИЛИ ИмяРеквизита = "ГрузВес")
		И ЗначениеЗаполнено(ГрузВес) 
		И ЗначениеЗаполнено(ГрузМаксимальныйВес)
		И ГрузМаксимальныйВес > ГрузВес Тогда
		
		ЕстьОшибки = Истина;
		Если ВыводитьПредупреждения Тогда
			ТекстОшибки = НСтр("ru = 'Общий вес меньше значения самого тяжелого места';
								|en = 'General weight is less than the value of the most heavy place'");
			ТекстСообщения = ТекстОшибки;
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ГрузВес");
		КонецЕсли;
		
	КонецЕсли;  			
	
	Если ПереключательРасшифровки = 1 Тогда
	
		Если (ИмяРеквизита = "ГрузМаксимальныйВес")
			И ЗначениеЗаполнено(ГрузВес) 
			И ЗначениеЗаполнено(ГрузМаксимальныйВес)
			И ГрузМаксимальныйВес > ГрузВес Тогда
			
			ЕстьОшибки = Истина;
			Если ВыводитьПредупреждения Тогда
				ТекстОшибки = НСтр("ru = 'Общий вес меньше значения самого тяжелого места.';
									|en = 'General weight is less than the value of the most heaviest place.'");
				ТекстСообщения = ТекстОшибки;
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ГрузМаксимальныйВес");
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	НачалоВыбораУчастникаГрузоперевозки("ОтправительКонтрагентСсылка");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	НачалоВыбораУчастникаГрузоперевозки("ПолучательКонтрагентСсылка");	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПлательщикКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	НачалоВыбораУчастникаГрузоперевозки("ПлательщикКонтрагентСсылка");	
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораУчастникаГрузоперевозки(УчастникГрузоперевозки)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Организация", 	"Справочник: Организации"); 
	СписокВыбора.Добавить("Контрагент",		"Справочник: Контрагенты");	
	
	Если УчастникГрузоперевозки <> "ПлательщикКонтрагентСсылка" Тогда
		
		СписокВыбора.Добавить("ВручнуюЮЛ",		"Ввести данные юр. лица");
		СписокВыбора.Добавить("ВручнуюФЛ",		"Ввести данные физ. лица");
		
	КонецЕсли;
	
	ОО = Новый ОписаниеОповещения("НачалоВыбораУчастникаГрузоперевозкиПродолжить", ЭтаФорма, УчастникГрузоперевозки);  
	
	СписокВыбора.ПоказатьВыборЭлемента(ОО, "Выберите способ заполнения данных");	
	
КонецПроцедуры  

&НаКлиенте
Процедура НачалоВыбораУчастникаГрузоперевозкиПродолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ИмяРеквизита = СтрЗаменить(ДополнительныеПараметры, "Ссылка", ""); 
		ИмяРеквизитаИНН = ИмяРеквизита + "ИНН";
		Префикс = СтрЗаменить(ИмяРеквизита, "Контрагент", "");		
		
		Если Результат.Значение = "ВручнуюЮЛ" Или Результат.Значение = "ВручнуюФЛ" Тогда 			
			
			ЭтаФорма[Префикс + "КонтрагентИностранец"] = Ложь;
			ЭтаФорма[ДополнительныеПараметры] = Неопределено; 
			ЭтаФорма[Префикс + "РучнойВвод"] = ?(Результат.Значение = "ВручнуюЮЛ", 1, 2);
			ЭтаФорма[Префикс + "КонтрагентЮрФизЛицо"] = ЭтаФорма[Префикс + "РучнойВвод"]; 			
			
			Если Не ЗначениеЗаполнено(ЭтаФорма[Префикс + "КонтрагентСтрана"]) Тогда
				
				ЭтаФорма[Префикс + "КонтрагентСтрана"] = ПолучитьСтрануПоУмолчанию();
				
			КонецЕсли;
			
			Если ЭтаФорма[Префикс + "РучнойВвод"] = 2 Тогда
				
				Если Не ЗначениеЗаполнено(ЭтаФорма[Префикс + "КонтрагентОПФ"]) Тогда
					
					ЭтаФорма[Префикс + "КонтрагентОПФ"] = ПолучитьОПФПоУмолчанию();
					
				КонецЕсли;
				
				УстановитьВидимостьГруппаЭлектронныйЧек();
				
			КонецЕсли; 	
			
			УстановитьВидимостьРучнойВводКонтрагентов(Префикс);
			
		Иначе 			
					
			Если Префикс <> "Плательщик" Тогда
				
				ЭтаФорма[Префикс + "РучнойВвод"] = 0; 
				
				УстановитьВидимостьРучнойВводКонтрагентов(Префикс);	
				
			КонецЕсли;
			
			ПараметрыОткрытия = Новый Структура;			
			ПараметрыОткрытия.Вставить("РежимВыбора", Истина); 
			
			ОО = Новый ОписаниеОповещения("ОбработатьВыборЗначения", ЭтотОбъект, ДополнительныеПараметры);
			
			Если Результат.Значение = "Организация" Тогда 
				
				ИмяФормыВыбора = "Справочник.Организации.ФормаВыбора";				
				
			ИначеЕсли Результат.Значение = "Контрагент" Тогда
				
				ИмяФормыВыбора = "Справочник.Контрагенты.ФормаВыбора";
				
			Иначе
				
				Возврат;
				
			КонецЕсли; 
			
			ОткрытьФорму(ИмяФормыВыбора, ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументамОснованиям()
	
	Если Объект.ДокументыОснования.Количество() > 0 Тогда
		
		Документ = Объект.ДокументыОснования[0].Документ;
		ДокументТип = ТипЗнч(Документ); 
		
		ЭтоПеремещение = Ложь;
		ЭтоТранспортнаяНакладная = Ложь;  		
		РольСклада = ""; 	
		
		Если ДокументТип = Тип("ДокументСсылка.ЗаказКлиента") Или
			ДокументТип = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Или				 
			ДокументТип = Тип("ДокументСсылка.КорректировкаПриобретения") Или                          
			ДокументТип = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Отправитель = Документ.Организация;				
			Получатель = Документ.Контрагент; 
			РольСклада = "Отправитель";
			
		ИначеЕсли ДокументТип = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Или
			ДокументТип = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Или				 
			ДокументТип = Тип("ДокументСсылка.КорректировкаРеализации") Или
			ДокументТип = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			Отправитель = Документ.Контрагент; 				
			Получатель = Документ.Организация; 
			РольСклада = "Получатель";
			
		ИначеЕсли ДокументТип = Тип("ДокументСсылка.ЗаказНаПеремещение") Или
			ДокументТип = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			
			Отправитель = Документ.Организация; 				
			Получатель = Документ.Организация; 
			
			ЭтоПеремещение = Истина; 
			
		ИначеЕсли ДокументТип = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
			
			Отправитель = Документ.Грузоотправитель; 				
			Получатель = Документ.Грузополучатель;	 
			
			ЭтоТранспортнаяНакладная = Истина;    
			
		ИначеЕсли ДокументТип = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда	
			
			РольСклада = "Отправитель";
			
			Если Документ.ТоварыПоРаспоряжениям.Количество() > 0 Тогда
				
				Распоряжение = Документ.ТоварыПоРаспоряжениям[0].Распоряжение;
				
				Если Распоряжение <> Неопределено Тогда				
					
					Попытка 
						
						Отправитель = Распоряжение.Организация;				
						Получатель = Распоряжение.Контрагент;											
						
					Исключение	
						
						Отправитель = Справочники.Организации.ПустаяСсылка();				
						Получатель = Справочники.Организации.ПустаяСсылка();
						
					КонецПопытки;
					
				КонецЕсли;	
				
			КонецЕсли; 
			
		ИначеЕсли ДокументТип = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			
			РольСклада = "Получатель";
			
			Распоряжение = Документ.Распоряжение;
			
			Если Распоряжение <> Неопределено Тогда 			
				
				Попытка 
					
					Отправитель = Распоряжение.Контрагент;				
					Получатель = Распоряжение.Организация;								
					
				Исключение 
					
					Отправитель = Справочники.Организации.ПустаяСсылка();				
					Получатель = Справочники.Организации.ПустаяСсылка();
					
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;			
		
		ЗаполнитьУчастникаПеревозки("Отправитель", Отправитель);
		ЗаполнитьУчастникаПеревозки("Получатель", Получатель);
		
		Если ЭтоПеремещение Тогда			
			
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Документ.СкладОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада, ТекущаяДата(), Ложь);
			
			Если КонтактнаяИнформация.Количество() Тогда					
				
				ЭтаФорма["ОтправительАдресПредставление"] = КонтактнаяИнформация[0].Представление;
				ЭтаФорма["ОтправительАдресЗначение"] = КонтактнаяИнформация[0].Значение; 			
				
			КонецЕсли;
			
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Документ.СкладПолучатель, Справочники.ВидыКонтактнойИнформации.АдресСклада, ТекущаяДата(), Ложь);
			
			Если КонтактнаяИнформация.Количество() Тогда					
				
				ЭтаФорма["ПолучательАдресПредставление"] = КонтактнаяИнформация[0].Представление;
				ЭтаФорма["ПолучательАдресЗначение"] = КонтактнаяИнформация[0].Значение; 			
				
			КонецЕсли;
			
		ИначеЕсли ЭтоТранспортнаяНакладная Тогда
			
			Если ЗначениеЗаполнено(Документ.АдресПогрузки) Тогда
				
				ЭтаФорма["ОтправительАдресПредставление"] = Документ.АдресПогрузки;
				ЭтаФорма["ОтправительАдресЗначение"] = Документ.АдресПогрузкиЗначенияПолей;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Документ.АдресДоставки) Тогда
				
				ЭтаФорма["ПолучательАдресПредставление"] = Документ.АдресДоставки;
				ЭтаФорма["ПолучательАдресЗначение"] = Документ.АдресДоставкиЗначенияПолей; 	
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(РольСклада) Тогда
			
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Документ.Склад, Справочники.ВидыКонтактнойИнформации.АдресСклада, ТекущаяДата(), Ложь);
			
			Если КонтактнаяИнформация.Количество() Тогда					
				
				ЭтаФорма[РольСклада + "АдресПредставление"] = КонтактнаяИнформация[0].Представление;
				ЭтаФорма[РольСклада + "АдресЗначение"] = КонтактнаяИнформация[0].Значение; 			
				
			КонецЕсли;				
			
		КонецЕсли; 				
		
	КонецЕсли; 	
	
	ВариантЗаполненияВГХ = Константы.ДЛ_ЗаполнениеВГХ.Получить(); 
	
	Если ЗначениеЗаполнено(ВариантЗаполненияВГХ) Тогда
		
		ЗаполнитьВГХПоДокументамОснованиям(ВариантЗаполненияВГХ);	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьУчастникаПеревозки(Префикс, Участник)  
	
	Если ТипЗнч(Участник) = Тип("СправочникСсылка.Организации") Тогда 			
		
		Наименование = Участник.НаименованиеСокращенное;
		ЭтоОрганизация = Истина;  
		
	ИначеЕсли ТипЗнч(Участник) = Тип("СправочникСсылка.Контрагенты") Тогда			
		
		Наименование = Участник.НаименованиеПолное;
		ЭтоОрганизация = Ложь;  
		
	Иначе
		
		Возврат; 
		
	КонецЕсли;
	
	ЭтаФорма[Префикс + "КонтрагентСсылка"] = Участник;
	ЭтаФорма[Префикс + "КонтрагентНаименование"] = Наименование;
	ЭтаФорма[Префикс + "КонтрагентИНН"] = Участник.ИНН;
	ЭтаФорма[Префикс + "КонтрагентКПП"] = Участник.КПП;
	ЭтаФорма[Префикс + "КонтрагентЭтоОрганизация"] = ЭтоОрганизация;
	
	ЮрФизЛицо = 0;
	
	Если Участник.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
		
		ЮрФизЛицо = 1;
		
	ИначеЕсли Участник.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда  
		
		ЮрФизЛицо = 2;
		
	ИначеЕсли Участник.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда  
		
		ЮрФизЛицо = 3;
		
	КонецЕсли;
	
	ЭтаФорма[Префикс + "КонтрагентЮрФизЛицо"] = ЮрФизЛицо; 
	
	Если ЮрФизЛицо <> 2 Тогда 
		
		ВидКИ = ?(ЭтоОрганизация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Участник, ВидКИ, ТекущаяДата(), Ложь);
		
		Если КонтактнаяИнформация.Количество() Тогда			
			
			ЭтаФорма[Префикс + "АдресПредставление"] = КонтактнаяИнформация[0].Представление;
			ЭтаФорма[Префикс + "АдресЗначение"] = КонтактнаяИнформация[0].Значение;  
			
		Иначе
			
			ВидКИ = ?(ЭтоОрганизация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Участник, ВидКИ, ТекущаяДата(), Ложь);
			
			Если КонтактнаяИнформация.Количество() Тогда
				
				ЭтаФорма[Префикс + "КонтрагентЮридическийАдресПредставление"] = КонтактнаяИнформация[0].Представление; 				
				ЭтаФорма[Префикс + "АдресПредставление"] = КонтактнаяИнформация[0].Представление;
				ЭтаФорма[Префикс + "АдресЗначение"] = КонтактнаяИнформация[0].Значение; 			
				
			КонецЕсли;	
			
		КонецЕсли; 			
		
	КонецЕсли;
	
	Если ЭтоОрганизация Тогда  
		
		ЭтотОбъект[Префикс + "КонтактноеЛицоНаименование"] = СокрЛП(ПараметрыСеанса.ТекущийПользователь);	
		ЭтотОбъект[Префикс + "КонтактноеЛицоТелефонПредставление"] = ПолучитьТелефоныКонтактногоЛица(ПараметрыСеанса.ТекущийПользователь);	
		
	Иначе
		
		ЭтаФорма[Префикс + "КонтрагентИностранец"] = Участник.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент; 
		
		СписокКонтактныхЛиц = ПолучитьСписокКонтактныхЛиц(Префикс + "КонтрагентСсылка");
		
		Если СписокКонтактныхЛиц.Количество() > 0 Тогда
			
			ЭтотОбъект[Префикс + "КонтактноеЛицоНаименование"] = СокрЛП(СписокКонтактныхЛиц[0].Значение);	
			ЭтотОбъект[Префикс + "КонтактноеЛицоТелефонПредставление"] = ПолучитьТелефоныКонтактногоЛица(СписокКонтактныхЛиц[0].Значение);	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеУслуги()	
	
	
	НаименованияИсключаемыхУслуг = Новый Массив;
	НаименованияИсключаемыхУслуг.Добавить("заезд на второй адрес");  
	НаименованияИсключаемыхУслуг.Добавить("страхование груза и срока"); 
	НаименованияИсключаемыхУслуг.Добавить("страхование груза");
	НаименованияИсключаемыхУслуг.Добавить("доставка груза до дверей получателя");  
	НаименованияИсключаемыхУслуг.Добавить("погрузка у отправителя"); 
	НаименованияИсключаемыхУслуг.Добавить("разгрузка у получателя");	
	НаименованияИсключаемыхУслуг.Добавить("отправка сопроводительных документов");
	НаименованияИсключаемыхУслуг.Добавить("возврат сопроводительных документов");	
	НаименованияИсключаемыхУслуг.Добавить("забор груза от дверей отправителя");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованияИсключаемыхУслуг", НаименованияИсключаемыхУслуг);
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_ДополнительныеУслуги.Ссылка КАК Услуга,
	|	ЛОЖЬ КАК Использовать,
	|	1 КАК Количество,
	|	(ВЫРАЗИТЬ(ВРЕГ(ЛЕВ(ДЛ_ДополнительныеУслуги.Наименование, 1)) КАК СТРОКА(1))) + (ВЫРАЗИТЬ(НРЕГ(ПРАВ(ДЛ_ДополнительныеУслуги.Наименование, ДЛИНАСТРОКИ(ДЛ_ДополнительныеУслуги.Наименование) - 1)) КАК СТРОКА(254))) КАК Наименование
	|ИЗ
	|	Справочник.ДЛ_ДополнительныеУслуги КАК ДЛ_ДополнительныеУслуги
	|ГДЕ
	|	НЕ ДЛ_ДополнительныеУслуги.Наименование В (&НаименованияИсключаемыхУслуг)"; 				   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеУслуги.Загрузить(Результат);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДополнительныеТребования()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_СпециальныеТребования.Наименование КАК Наименование,
	|	ДЛ_СпециальныеТребования.UID КАК UID
	|ИЗ
	|	Справочник.ДЛ_СпециальныеТребования КАК ДЛ_СпециальныеТребования
	|ГДЕ
	|	ДЛ_СпециальныеТребования.Наименование <> ""Растентовка""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДЛ_ВидыЗагрузки.Наименование,
	|	ДЛ_ВидыЗагрузки.UID
	|ИЗ
	|	Справочник.ДЛ_ВидыЗагрузки КАК ДЛ_ВидыЗагрузки";  
	
	Результат = Запрос.Выполнить().Выгрузить();              
	
	ЗаполнитьСписокВыбораДополнительныеТребования("Отгрузка", Результат);  
	ЗаполнитьСписокВыбораДополнительныеТребования("Доставка", Результат);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьДоступностьНаСтраницеОсновная()  
	
	Если ФайловыйВариант Тогда
		
		Элементы.ПредварительныйРасчет.Видимость = Истина;
		Элементы.ВидДоставки.Видимость = Истина;
		Элементы.ГруппаПраваяПанель.Видимость = Ложь;
		
	КонецЕсли;
	
	ДоставкаОтАдреса = СпособОтгрузки = 0;  
	ДоставкаДоАдреса = СпособДоставки = 0;
	
	Элементы.ОтправительКонтрагент.Заголовок = ?(ОтправительКонтрагентЭтоОрганизация, НСтр("ru = 'Организация';
																							|en = 'Company'"),
		НСтр("ru = 'Контрагент';
			|en = 'Counterparty'"));
	Элементы.ПолучательКонтрагент.Заголовок = ?(ПолучательКонтрагентЭтоОрганизация, НСтр("ru = 'Организация';
																						|en = 'Company'"),
		НСтр("ru = 'Контрагент';
			|en = 'Counterparty'"));
	Элементы.ПлательщикКонтрагент.Заголовок = ?(ПолучательКонтрагентЭтоОрганизация, НСтр("ru = 'Организация';
																						|en = 'Company'"),
		НСтр("ru = 'Контрагент';
			|en = 'Counterparty'"));  			 
	
	Элементы.ГруппаПлательщикВидимость.Видимость = (ПлательщикРоль = 3) Или (ИспользоватьРазличныхПлательщиков И ((ОтправительПлательщикРоль = 3) Или (ПолучательПлательщикРоль = 3))); 
	
	Элементы.ГруппаОтправительАдрес.Видимость = ДоставкаОтАдреса;	
	Элементы.ГруппаОтправительТерминал.Видимость = Не ДоставкаОтАдреса;   
	Элементы.ГруппаПолучательАдрес.Видимость = ДоставкаДоАдреса; 	
	Элементы.ГруппаПолучательТерминал.Видимость = Не ДоставкаДоАдреса; 
	Элементы.ГруппаОтгрузка.Видимость = ДоставкаОтАдреса;
	Элементы.ГруппаДоставка.Видимость = ДоставкаДоАдреса;
	Элементы.ОтправительПлательщикРольПредставление.Видимость = ДоставкаОтАдреса;
	
	Если ОтправительРучнойВвод = 0 Тогда
		
		УстановитьВидимостьЭлементовИностранец("Отправитель"); 
		
	Иначе
		
		УстановитьВидимостьРучнойВводКонтрагентов("Отправитель");
		
	КонецЕсли;
	
	Если ПолучательРучнойВвод = 0 Тогда
		
		УстановитьВидимостьЭлементовИностранец("Получатель");  
		
	Иначе
		
		УстановитьВидимостьРучнойВводКонтрагентов("Получатель");	
		
	КонецЕсли;
	
	УстановитьВидимостьГруппаЭлектронныйЧек();
	УстановитьВидимостьНаложенногоПлатежа(); 
	УстановитьВидимостьУпрощеннаяДоставка();
		
	Элементы.ГруппаОтправительПолучательПлательщикРоль.Видимость = ИспользоватьРазличныхПлательщиков;
	Элементы.ПлательщикРоль.Заголовок = ?(ИспользоватьРазличныхПлательщиков, "Основной плательщик", "Плательщик");
	
	УстановитьВидимостьЭлементовИностранец("Плательщик");	
	 
	Элементы.ПогрузочноРазгрузочныеРаботы.Видимость = ДоставкаОтАдреса;	 
	Элементы.ДоставкаПогрузочноРазгрузочныеРаботы.Видимость = ДоставкаДоАдреса;
	ПогрузочноРазгрузочныеРаботыПриИзменении(Неопределено);
	ДоставкаПогрузочноРазгрузочныеРаботыПриИзменении(Неопределено); 	
	
	УстановитьДоступностьВидовДоставки();
	
	УстановитьВидимостьЭлементовУпрощеннаяФормаЗаказа(); 	
	
	ЗаголовокГородПодсказка = "Населенный пункт (нужен для подсказок ввода адреса)";
	ЗаголовокГородБезПодсказки = "Населенный пункт"; 
	Элементы.ДЛ_ОтправительГород.Заголовок = ?(ДоставкаОтАдреса, ЗаголовокГородПодсказка, ЗаголовокГородБезПодсказки); 
	Элементы.ДЛ_ОтправительГород.ОтображениеПодсказки = ?(ДоставкаОтАдреса, ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет);
	Элементы.ДЛ_ПолучательГород.Заголовок = ?(ДоставкаДоАдреса, ЗаголовокГородПодсказка, ЗаголовокГородБезПодсказки);	
	Элементы.ДЛ_ПолучательГород.ОтображениеПодсказки = ?(ДоставкаДоАдреса, ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет);  
	
	Элементы.СопроводительныеДокументыПлательщик.ТолькоПросмотр = Не ЗначениеЗаполнено(СопроводительныеДокументы);
		
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьЭлементовИностранец(Префикс)
	
	Элементы["гр" + Префикс + "Иностранец"].Видимость = Не ЭтаФорма[Префикс + "КонтрагентЭтоОрганизация"] 
		И ЭтаФорма[Префикс + "КонтрагентЮрФизЛицо"] = 2
		И ?(Префикс = "Получатель", Не УпрощеннаяДоставка, Истина);     	
	
	КонтрагентИностранецПриИзменении(Префикс);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГруппаЭлектронныйЧек()
	
	ВидимостьГруппыЧекПлательщик = (ПлательщикРоль = 3 И ПлательщикКонтрагентЮрФизЛицо = 2) Или 
		(ИспользоватьРазличныхПлательщиков И ПлательщикКонтрагентЮрФизЛицо = 2 
		И (ПолучательПлательщикРоль = 3 Или ОтправительПлательщикРоль = 3));  
	
	ВидимостьГруппыЧекОтправитель = (ПлательщикРоль = 1 И ОтправительКонтрагентЮрФизЛицо = 2) Или 
		(ИспользоватьРазличныхПлательщиков И ОтправительКонтрагентЮрФизЛицо = 2 
		И (ПолучательПлательщикРоль = 1 Или ОтправительПлательщикРоль = 1));  
		
	ВидимостьГруппыЧекПолучатель = (ПлательщикРоль = 2 И (ПолучательКонтрагентЮрФизЛицо = 2 Или УпрощеннаяДоставка)) Или 
		(ИспользоватьРазличныхПлательщиков И (ПолучательКонтрагентЮрФизЛицо = 2 Или УпрощеннаяДоставка) 
		И (ПолучательПлательщикРоль = 2 Или ОтправительПлательщикРоль = 2));			
		
	Элементы.ГруппаЭлектронныйЧек.Видимость = ВидимостьГруппыЧекПлательщик Или ВидимостьГруппыЧекПолучатель Или ВидимостьГруппыЧекОтправитель;	
	Элементы.ГруппаЭлектронныйЧекПлательщик.Видимость = ВидимостьГруппыЧекПлательщик;  
	Элементы.ГруппаЭлектронныйЧекПолучатель.Видимость = ВидимостьГруппыЧекПолучатель;
	Элементы.ГруппаЭлектронныйЧекОтправитель.Видимость = ВидимостьГруппыЧекОтправитель;  
	
	Если ВидимостьГруппыЧекПлательщик = Ложь Тогда
		
		ПлательщикСогласиеНаПолучениеЭлектронногоЧека = Ложь;
		
	КонецЕсли;   
	
	Если ВидимостьГруппыЧекОтправитель = Ложь Тогда
		
		ОтправительСогласиеНаПолучениеЭлектронногоЧека = Ложь;
		
	КонецЕсли;
	
	Если ВидимостьГруппыЧекПолучатель = Ложь Тогда
		
		ПолучательСогласиеНаПолучениеЭлектронногоЧека = Ложь;
		
	КонецЕсли;
	
	ВидимостьАдресовЭлектронногоЧека("Плательщик");
	ВидимостьАдресовЭлектронногоЧека("Отправитель");
	ВидимостьАдресовЭлектронногоЧека("Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизит(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИмяРеквизита = Элемент.Имя + "Ссылка";
	ЭтотОбъект[ИмяРеквизита] = Неопределено;
	ОбработатьИзменениеРеквизитаФормы(ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная(); 
	ПереключательРасшифровкиПриИзменении(Неопределено); 
	УправлениеДоступностьюОтправкиЗаказа();
	
	СтрахованиеСрокаДоставкиГруза = Истина;
	
	Если Не ИзЧерновика Тогда	
		
		ЗаполнитьНаселенныйПунктПоАдресу1С("Отправитель");
		ЗаполнитьНаселенныйПунктПоАдресу1С("Получатель");
		
	КонецЕсли;
	
	СформироватьПредставлениеВремениОтгрузки();
	СформироватьПредставлениеВремениДоставки();
		
КонецПроцедуры  

&НаСервереБезКонтекста
Функция Адрес_ЗначениеИзСтрокиJSON(Значение, ЕстьОшибка=Ложь, ТекстОшибки="") Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	ПервыйСимвол = Лев(Значение, 1);
	Если ПервыйСимвол <> "[" И ПервыйСимвол <> "{" Тогда
		Возврат Значение;
	КонецЕсли;
	
	Результат = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Попытка
		ЧтениеJSON.УстановитьСтроку(Значение);
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ЕстьОшибка = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сервис доставки.Преобразование данных.';
										|en = 'Delivery service. Data conversion.'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитаФормы(ИмяРеквизита)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	ОбработатьИзменениеРеквизитаФормыНаСервере(ИмяРеквизита, Отказ);
	
	Если Отказ Тогда
		
		Возврат; 
		
	КонецЕсли;	
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРеквизитаФормыНаСервере(ИмяРеквизита, Отказ = Ложь)
	
	Модифицированность = Истина;
	
	Если ИмяРеквизита = "ОтправительКонтрагентСсылка" 
		ИЛИ ИмяРеквизита = "ПолучательКонтрагентСсылка"
		ИЛИ ИмяРеквизита = "ПлательщикКонтрагентСсылка" Тогда
		
		ПараметрыУчастника = ПараметрыУчастникаГрузоперевозки(ЭтотОбъект[ИмяРеквизита]);		
		
		ОбработатьПараметры(ПараметрыУчастника, СтрЗаменить(ИмяРеквизита, "КонтрагентСсылка", ""));		
		
		ИмяЭлемента = СтрЗаменить(ИмяРеквизита, "Ссылка", "");
		ЕстьОшибки = Ложь;
		ПроверитьРеквизитыКонтрагента(ИмяЭлемента, ЕстьОшибки, Истина);	
		
		Если ЕстьОшибки Тогда  
			
			ЭтотОбъект[ИмяЭлемента + "Ссылка"] = Неопределено;
			ЭтотОбъект[ИмяЭлемента + "ИНН"] = "";
			ЭтотОбъект[ИмяЭлемента + "Наименование"] = "";
			
		КонецЕсли;		
			
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция КонтактнаяИнформацияПоПредставлению(Представление, ТипКонтактнойИнформацииИмя) Экспорт
	
	Если ТипКонтактнойИнформацииИмя = "Телефон" Тогда
		ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Иначе
		ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	КонецЕсли;
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Представление, ТипКонтактнойИнформации);
	
КонецФункции

&НаСервере
Функция ПараметрыУчастникаГрузоперевозки(Значение)
	
	ПараметрыУчастника = НовыйПараметрыУчастникаГрузоперевозки();
	
	ПараметрыУчастника.Контрагент = ПараметрыКонтрагента(Значение);		
		
	Возврат ПараметрыУчастника;
	
КонецФункции 

&НаСервере
Функция НовыйПараметрыУчастникаГрузоперевозки() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Контрагент", НовыйПараметрыКонтрагента());	
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Процедура ОбработатьПараметры(Параметры, Префикс = "")
	
	ПараметрыДляФормы = Новый Структура;
	
	ЗаполнитьЛинейныеДанныеПоСтруктуре(Параметры, ПараметрыДляФормы, Префикс);		
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыДляФормы);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛинейныеДанныеПоСтруктуре(Параметры, Данные, Префикс = "") Экспорт
	
	Для Каждого Параметр Из Параметры Цикл  
		
		ИмяКолонки = Префикс + Параметр.Ключ;   
		
		Если ТипЗнч(Параметр.Значение) = Тип("Структура") Тогда
			
			ЗаполнитьЛинейныеДанныеПоСтруктуре(Параметр.Значение, Данные, ИмяКолонки); 
			
		Иначе 
			
			Данные.Вставить(ИмяКолонки, Параметры[Параметр.Ключ]);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыКонтрагента(Значение)
	
	ПараметрыКонтрагента = НовыйПараметрыКонтрагента();
	ПараметрыКонтрагента.Ссылка = Значение;
	
	Если ЗначениеЗаполнено(Значение) Тогда 
		
		ЗаполнитьПараметрыКонтрагента(ПараметрыКонтрагента);		
		
	КонецЕсли;
	
	Возврат ПараметрыКонтрагента;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыКонтрагента(ПараметрыКонтрагента) Экспорт
	
	ИмяСправочника = Неопределено;
	Если ТипЗнч(ПараметрыКонтрагента.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяСправочника = "Организации";
		РеквизитНаименования = "ОсновнаяТаблица.НаименованиеСокращенное";
		ПараметрыКонтрагента.ЭтоОрганизация = Истина;
	ИначеЕсли ТипЗнч(ПараметрыКонтрагента.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяСправочника = "Контрагенты";
		РеквизитНаименования = "ОсновнаяТаблица.НаименованиеПолное";
		ПараметрыКонтрагента.ЭтоОрганизация = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОсновнаяТаблица.Ссылка КАК Ссылка,
	|	ОсновнаяТаблица.ИНН КАК ИНН,
	|	ОсновнаяТаблица.КПП КАК КПП,
	|	&РеквизитНаименования КАК Наименование,
	|	ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент) КАК Иностранец,
	|	ВЫБОР
	|		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА 1
	|		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА 2
	|		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЮрФизЛицо
	|ИЗ
	|	&ТаблицаДляЗапроса КАК ОсновнаяТаблица
	|ГДЕ
	|	ОсновнаяТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыКонтрагента.Ссылка);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаДляЗапроса", "Справочник." + ИмяСправочника);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитНаименования", РеквизитНаименования);  
	
	Если ИмяСправочника = "Организации" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)", "Ложь");	
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		
		ЗаполнитьЗначенияСвойств(ПараметрыКонтрагента, РезультатЗапроса.Выгрузить()[0]);		
		
		Если ПараметрыКонтрагента.ЮрФизЛицо <> 2 Тогда
			
			ВидКИ = ?(ИмяСправочника = "Организации", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
				
			ПараметрыКонтрагента.ЮридическийАдресПредставление = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыКонтрагента.Ссылка, ВидКИ, ТекущаяДата(), Истина); 
					
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйПараметрыКонтрагента() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("Наименование", "");
	Результат.Вставить("ЮрФизЛицо", 0);
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ЮридическийАдресПредставление", "");
	Результат.Вставить("ЭтоОрганизация", Ложь);
	Результат.Вставить("Иностранец", Ложь); 
	Результат.Вставить("Страна", Неопределено);
	Результат.Вставить("ОПФ", Неопределено);
	Результат.Вставить("НомерИностранногоПаспорта", "");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйПараметрыТелефона()

	Результат = Новый Структура;
	Результат.Вставить("Представление", "");
	Результат.Вставить("Значение", "");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначенияАдреса(Объект, ИмяРеквизита, ЕстьИзменения = Ложь) Экспорт
	
	ИмяРеквизитаПредставление = ИмяРеквизита + "Представление";
	ИмяРеквизитаАдресЗначение = ИмяРеквизита + "Значение";
	
	Если ЗначениеЗаполнено(Объект[ИмяРеквизитаПредставление])
		И НЕ ЗначениеЗаполнено(Объект[ИмяРеквизитаАдресЗначение]) Тогда
			ЗначениеВJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект[ИмяРеквизитаПредставление]
																,Перечисления.ТипыКонтактнойИнформации.Адрес);
																
			Объект[ИмяРеквизитаАдресЗначение] = ЗначениеВJSON;
			
			ЕстьИзменения = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект[ИмяРеквизитаАдресЗначение]) Тогда
		
		СтруктураАдреса = Адрес_ЗначениеИзСтрокиJSON(Объект[ИмяРеквизитаАдресЗначение]);
		
		Если Не ЗначениеЗаполнено(СтруктураАдреса) Тогда
			Возврат;
		КонецЕсли;
			
		СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Объект[ИмяРеквизитаАдресЗначение], Новый Структура("КодыАдреса, ПроверитьАдрес", Истина, Истина));
		
		Если СведенияОбАдресе.ТипАдреса <> "ВСвободнойФорме" Тогда 
			Объект[ИмяРеквизитаАдресЗначение] = РаботаСАдресами.ПоляАдресаВJSON(СведенияОбАдресе);
			ЕстьИзменения = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыДляПересчета()
	Возврат СтрРазделить(
		"Вес,Объем,МаксимальнаяВысота,МаксимальнаяДлина,МаксимальнаяШирина,МаксимальныйВес,Содержимое,Стоимость", ",");
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборЗначения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Или
		(ТипЗнч(Результат) = Тип("КодВозвратаДиалога")
		И Результат = КодВозвратаДиалога.Отмена) Тогда
		
		Возврат;
		
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда	
		
		ЭтотОбъект[ДополнительныеПараметры] = Результат;
		
		ОбработатьИзменениеРеквизитаФормы(ДополнительныеПараметры);
		
	КонецЕсли;	
	
	УстановитьВидимостьНаложенногоПлатежа(); 		 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтрагентОткрытие(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент)
	
	ИмяРеквизита = Элемент.Имя + "Ссылка";
	ИмяРеквизитаЭтоОрганизация = Элемент.Имя + "ЭтоОрганизация";
	
	ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита];
	ЭтоОрганизация = ЭтотОбъект[ИмяРеквизитаЭтоОрганизация];
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда  
		
		ПараметрыОткрытия = Новый Структура("Ключ", ЭтотОбъект[ИмяРеквизита]);
		ОО = Новый ОписаниеОповещения("ОбработатьИзменениеРеквизитовОбъекта", ЭтотОбъект, ИмяРеквизита);		
		
		Если ЭтоОрганизация Тогда
			
			ИмяФормыКонтрагента = "Справочник.Организации.ФормаОбъекта"; 
			
		Иначе                                                      
			
			ИмяФормыКонтрагента = "Справочник.Контрагенты.ФормаОбъекта";
			
		КонецЕсли; 	
		
		ОткрытьФорму(ИмяФормыКонтрагента, ПараметрыОткрытия, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитовОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();	
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		
		ИмяРеквизита = СтрЗаменить(ДополнительныеПараметры, "Ссылка", "");
		ИмяРеквизита = ИмяРеквизита + "Реквизиты";
		ОбработатьИзменениеРеквизитаФормы(ИмяРеквизита);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПлательщикРольОчистка(Элемент, СтандартнаяОбработка)
	
	ПлательщикРоль = 0;
	ПлательщикРольПредставление = "";
	ПлательщикКонтрагентСсылка = Неопределено;
	ОчиститьРеквизит(Элементы.ПлательщикКонтрагент, Ложь);
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРасшифровкиПриИзменении(Элемент) 
	
	Если УпрощеннаяФормаЗаказа Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПересчетВГХПриИзмененииУсловийДоставки();
	УстановитьДоступностьВидовДоставки(); 
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьГруппыВГХ()
	
	ОдноМесто = (ПереключательРасшифровки = 0);
	
	Элементы.ГруппаОдноМестоВГХ.Видимость = ОдноМесто;
	Элементы.ГруппаНесколькоМест.Видимость = Не ОдноМесто;
	Элементы.ОдинаковыеМеста.Видимость = Не ОдноМесто;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбъем()
	
	Если ГрузКоличествоГрузовыхМест = 1 Тогда
		
		ГрузОбъемРасчетный = ГрузМаксимальнаяВысота * КоэффициентЕдиницы(ЕдиницаВысота) *
			ГрузМаксимальнаяДлина * КоэффициентЕдиницы(ЕдиницаДлина) *
			ГрузМаксимальнаяШирина * КоэффициентЕдиницы(ЕдиницаШирина); 
			
		Если ГрузОбъемРасчетный > 0 Тогда 
				
			ГрузОбъем = Макс(ГрузОбъемРасчетный, 0.01); 
			
		КонецЕсли;
		
		Если ГрузНегабаритныйОбъем > 0 Или ГрузНегабаритныйВес > 0 Тогда
			
			ГрузНегабаритныйОбъем = ГрузОбъем;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВес()
	
	Если ГрузКоличествоГрузовыхМест = 1 
		И ГрузМаксимальныйВес > 0 Тогда
		ГрузВес = Мин(ГрузВес, ГрузМаксимальныйВес);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоВесПриИзменении(Элемент)
	
	ГрузМаксимальныйВес = ГрузВес;
	ПроверитьВГХ("ГрузВес");	
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаОбъявленнойЦенностиПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузСтоимость");	
	
	ЗаблокироватьОтправкуЗаказа();	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОбщийВесПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузВес");
	Элементы.ГрузНегабаритныйВес.МаксимальноеЗначение = ГрузВес;	
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОбщийОбъемПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузОбъем");	
	Элементы.ГрузНегабаритныйОбъем.МаксимальноеЗначение = ГрузОбъем;
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоВысотаПриИзменении(Элемент)
	
	РассчитатьОбъем();
	ПроверитьВГХ("ГрузМаксимальнаяВысота");	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоШиринаПриИзменении(Элемент)
	
	РассчитатьОбъем();
	ПроверитьВГХ("ГрузМаксимальнаяШирина");	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоДлинаПриИзменении(Элемент)
	
	РассчитатьОбъем();
	ПроверитьВГХ("ГрузМаксимальнаяДлина");  

КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальнаяВысотаПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузМаксимальнаяВысота");
	РассчитатьОбщиеВГХНесколькихМест();
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальнаяШиринаПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузМаксимальнаяШирина");	
	РассчитатьОбщиеВГХНесколькихМест();
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальнаяДлинаПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузМаксимальнаяДлина");	
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальныйВесПриИзменении(Элемент)
	
	ПроверитьВГХ("ГрузМаксимальныйВес");
	РассчитатьОбщиеВГХНесколькихМест();
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораВремениИДаты(1, Элемент.ТолькоПросмотр);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораВремениИДаты(2, Элемент.ТолькоПросмотр);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуВыбораВремениИДаты(ВариантВыбораВремени, ТолькоПросмотр)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборДатыВремени", ЭтаФорма);
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	Если ВариантВыбораВремени = 1 Тогда
		
		ПараметрыОткрытияФормы.Вставить("Дата", ДатаОтгрузки);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыС", ВремяОтгрузкиС);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыПо", ВремяОтгрузкиПо);
		ПараметрыОткрытияФормы.Вставить("ВремяОбедС", ВремяОтгрузкиОбедС);  
		ПараметрыОткрытияФормы.Вставить("ВремяОбедПо", ВремяОтгрузкиОбедПо);
		ПараметрыОткрытияФормы.Вставить("ВариантВыбораВремени", 1);		
		ПараметрыОткрытияФормы.Вставить("ФиксированноеВремя", ОтправительФиксированноеВремя);		
		
	ИначеЕсли ВариантВыбораВремени = 2 Тогда
		
		ПараметрыОткрытияФормы.Вставить("Дата", ДатаДоставки);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыС", ВремяДоставкиС);
		ПараметрыОткрытияФормы.Вставить("ВремяРаботыПо", ВремяДоставкиПо);
		ПараметрыОткрытияФормы.Вставить("ВремяОбедС", ВремяДоставкиОбедС);  
		ПараметрыОткрытияФормы.Вставить("ВремяОбедПо", ВремяДоставкиОбедПо);
		ПараметрыОткрытияФормы.Вставить("ВариантВыбораВремени", 2);		
		ПараметрыОткрытияФормы.Вставить("ФиксированноеВремя", ПолучательФиксированноеВремя);		
		
	КонецЕсли;
	
	ПараметрыОткрытияФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);	
	
	ОткрытьФорму(
		"Документ.ДЛ_ЗаявкаНаДоставку.Форма.ВыборВремениПередачиГруза",
		ПараметрыОткрытияФормы,
		ЭтаФорма,,,,ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДатыВремени(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ВариантВыбораВремени = 0;
	Если Результат.Свойство("ВариантВыбораВремени", ВариантВыбораВремени) Тогда 
		Если ВариантВыбораВремени = 1 Тогда
			
			Результат.Свойство("ВремяРаботыС", ВремяОтгрузкиС);
			Результат.Свойство("ВремяРаботыПо", ВремяОтгрузкиПо);
			Результат.Свойство("ВремяОбедС", ВремяОтгрузкиОбедС);  
			Результат.Свойство("ВремяОбедПо", ВремяОтгрузкиОбедПо);			
			Результат.Свойство("ФиксированноеВремя", ОтправительФиксированноеВремя);			
			
			СформироватьПредставлениеВремениОтгрузки();
			
		ИначеЕсли ВариантВыбораВремени = 2 Тогда

			Результат.Свойство("ВремяРаботыС", ВремяДоставкиС);
			Результат.Свойство("ВремяРаботыПо", ВремяДоставкиПо);
			Результат.Свойство("ВремяОбедС", ВремяДоставкиОбедС);  
			Результат.Свойство("ВремяОбедПо", ВремяДоставкиОбедПо);			
			Результат.Свойство("ФиксированноеВремя", ПолучательФиксированноеВремя);			
			
			СформироватьПредставлениеВремениДоставки();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПроверитьВремяОтгрузки(ЕстьОшибки, Истина); 
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеВремениОтгрузки()
	
	ВремяОтгрузкиПредставление = ПредставлениеДатыВремени(ДатаОтгрузки, 
									ВремяОтгрузкиС, 
									ВремяОтгрузкиПо, 
									ВремяОтгрузкиОбедС, 
									ВремяОтгрузкиОбедПо, 1);
									
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеВремениДоставки()
	
	ВремяДоставкиПредставление = ПредставлениеДатыВремени(ДатаДоставки, 
									ВремяДоставкиС, 
									ВремяДоставкиПо, 
									ВремяДоставкиОбедС, 
									ВремяДоставкиОбедПо, 2);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеДатыВремени(ДатаДоставки, ВремяРаботыС, ВремяРаботыПо, ВремяОбедС, ВремяОбедПо, Режим)
	
	СтрокаПредставления = "";
	
	Если ЗначениеЗаполнено(ВремяРаботыС) ИЛИ ЗначениеЗаполнено(ВремяРаботыПо) Тогда
		СтрокаПредставления = СтрокаПредставления + Формат(ВремяРаботыС, "ДФ='ЧЧ:мм'; ДП=00:00")
			+ "-" + Формат(ВремяРаботыПо, "ДФ='ЧЧ:мм'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВремяОбедС) ИЛИ ЗначениеЗаполнено(ВремяОбедПо) Тогда
		СтрокаПредставления = СтрокаПредставления + " (обед " + Формат(ВремяОбедС, "ДФ='ЧЧ:мм'; ДП=00:00")
			+ "-" + Формат(ВремяОбедПо, "ДФ='ЧЧ:мм'") + ")";
	КонецЕсли;
	
	Возврат СтрокаПредставления;
	
КонецФункции

&НаКлиенте
Процедура ПлательщикРольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;	
	СписокВыбора.Добавить(1, "Совпадает с отправителем");
	СписокВыбора.Добавить(2, "Совпадает с получателем");
	СписокВыбора.Добавить(3, "Третье лицо"); 
	
	ОО = Новый ОписаниеОповещения("ПлательщикРольНачалоВыбораЗавершение", ЭтаФорма);  
	
	СписокВыбора.ПоказатьВыборЭлемента(ОО, "Выберите роль плательщика");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПлательщикРольНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПлательщикРольСтарое = ПлательщикРоль;
	
	Если Результат = Неопределено Тогда	
		
		ПлательщикРоль = 0;
		ПлательщикРольПредставление = ""; 
		
	Иначе  
		
		ПлательщикРоль = Результат.Значение;  
		
		Если ПлательщикРольСтарое <> ПлательщикРоль Тогда  
			
			ПлательщикКонтрагентСсылка = Неопределено; 
			ПлательщикРольПредставление = Результат.Представление;
			ОчиститьРеквизит(Элементы.ПлательщикКонтрагент, Ложь);  
			
		КонецЕсли;  
		
	КонецЕсли;
	
	Если ПлательщикРольСтарое <> ПлательщикРоль Тогда 
		
		Модифицированность = Истина; 
		
	КонецЕсли; 	
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();	

КонецПроцедуры

&НаКлиенте
Процедура СпособОтгрузкиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ОтправительТерминалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораТерминала = Новый Массив; 
	ПараметрыВыбораТерминала.Добавить(Новый ПараметрВыбора("Отбор.Приемка", Истина));
	
	Если ЗначениеЗаполнено(ОтправительГород) Тогда
		
		ПараметрыВыбораТерминала.Добавить(Новый ПараметрВыбора("Отбор.Город", ОтправительГород));
				
	КонецЕсли;
	
	Элементы.ДЛ_ОтправительТерминал.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораТерминала); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ОтправительТерминалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтправительТерминал) Тогда
		
		ЗаполнитьГородПоТерминалу("Отправитель");	
		
	КонецЕсли; 
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьГородПоТерминалу(ПрефиксРеквизита)
	
	ЭтаФорма[ПрефиксРеквизита + "Город"] = ЭтаФорма[ПрефиксРеквизита + "Терминал"].Город;	
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент) 
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ПолучательТерминалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораТерминала = Новый Массив;
	ПараметрыВыбораТерминала.Добавить(Новый ПараметрВыбора("Отбор.Выдача", Истина));
	
	Если ЗначениеЗаполнено(ПолучательГород) Тогда
		
		ПараметрыВыбораТерминала.Добавить(Новый ПараметрВыбора("Отбор.Город", ПолучательГород));
				
	КонецЕсли;
	
	Элементы.ДЛ_ПолучательТерминал.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораТерминала);
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ПолучательТерминалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПолучательТерминал) Тогда
		
		ЗаполнитьГородПоТерминалу("Получатель");	
		
	КонецЕсли; 
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ОтправительГородПриИзменении(Элемент)
	
	ГородПриИзменении("Отправитель");
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьНеобходимостьОчисткиТерминала(ПрефиксРеквизита)
	
	Если ЭтаФорма[ПрефиксРеквизита + "Город"] <> ЭтаФорма[ПрефиксРеквизита + "Терминал"].Город Тогда
		
		ЭтаФорма[ПрефиксРеквизита + "Терминал"] = Справочники.ДЛ_Терминалы.ПустаяСсылка();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ПолучательГородПриИзменении(Элемент)  
	
	ГородПриИзменении("Получатель");  
	
КонецПроцедуры

&НаСервере 
Процедура ОчиститьГрафикПеревозки() 
	   
	Элементы.ГруппаГрафикПеревозки.Скрыть(); 
	
	ГруппаДинамическихЭлементовГрафика = Элементы.Найти("ГруппаДинамическихЭлементовГрафика");
	
	Если ГруппаДинамическихЭлементовГрафика <> Неопределено Тогда
		
		Элементы.Удалить(ГруппаДинамическихЭлементовГрафика); 		 		
		
	КонецЕсли;  
	
	ГруппаДинамическихЭлементовГрафика = Элементы.Добавить("ГруппаДинамическихЭлементовГрафика", Тип("ГруппаФормы"), Элементы.ГруппаГрафикПеревозки); 		
	ГруппаДинамическихЭлементовГрафика.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДинамическихЭлементовГрафика.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДинамическихЭлементовГрафика.ОтображатьЗаголовок = Ложь; 
	ГруппаДинамическихЭлементовГрафика.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьГрафикПеревозки(ГрафикПеревозки)  
	
	Сч = 1;  
	
	КоличествоЗаписей = ГрафикПеревозки.Количество();
	
	Для Каждого Запись Из ГрафикПеревозки Цикл  
		
		ГруппаГрафика = Элементы.Добавить("ГруппаГрафика" + Сч, Тип("ГруппаФормы"), Элементы["ГруппаДинамическихЭлементовГрафика"]); 		
		ГруппаГрафика.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаГрафика.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаГрафика.ОтображатьЗаголовок = Ложь; 
		ГруппаГрафика.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
		
		КартинкаГрафик = ЭтаФорма.Элементы.Добавить("КартинкаТовара" + Сч, Тип("ДекорацияФормы"), ГруппаГрафика);
		КартинкаГрафик.Вид = ВидДекорацииФормы.Картинка;   
		
		Если Сч = 1 Тогда
			
			КартинкаГрафик.Картинка = БиблиотекаКартинок.ДЛ_График1; 
			
		ИначеЕсли Сч = КоличествоЗаписей Тогда 
			
			КартинкаГрафик.Картинка = БиблиотекаКартинок.ДЛ_График3;
			
		Иначе
			
			КартинкаГрафик.Картинка = БиблиотекаКартинок.ДЛ_График2;
			
		КонецЕсли;	   
		
		ЗначениеГрафикТекст1 = Новый ФорматированнаяСтрока(Формат(Запись.Значение, "ДФ='дд.ММ.гггг'"), Новый Шрифт(,, Истина));
		ЗначениеГрафикТекст2 = Символы.ПС + Запись.Представление;
		
		ЗначениеГрафик = ЭтаФорма.Элементы.Добавить("ЗначениеГрафик" + Сч, Тип("ДекорацияФормы"), ГруппаГрафика);
		ЗначениеГрафик.Вид = ВидДекорацииФормы.Надпись;
		ЗначениеГрафик.Заголовок = Новый ФорматированнаяСтрока(ЗначениеГрафикТекст1, ЗначениеГрафикТекст2);  
		
		Сч = Сч + 1;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеПредварительногоРасчета(ДанныеЗапроса) 		
	
	Если ДанныеЗапроса["foundAddresses"] <> Неопределено И ДанныеЗапроса["foundAddresses"].Количество() > 0 Тогда 
		
		Элементы.ГруппаНайденныеАдреса.Видимость = Истина;
		Элементы.ГруппаНайденныйАдресОтправитель.Видимость = Ложь;
		Элементы.ГруппаНайденныйАдресПолучатель.Видимость = Ложь;  
		
		Для Каждого НайденныйАдрес Из ДанныеЗапроса["foundAddresses"] Цикл
			
			Если СтрНайти(НайденныйАдрес["field"], "derival") > 0 Тогда  
				
				Элементы.ГруппаНайденныйАдресОтправитель.Видимость = Истина;
				Элементы.днНайденныйАдресОтправитель.Заголовок = НайденныйАдрес["result"]; 
				
			ИначеЕсли СтрНайти(НайденныйАдрес["field"], "arrival") > 0 Тогда
				
				Элементы.ГруппаНайденныйАдресПолучатель.Видимость = Истина;
				Элементы.днНайденныйАдресПолучатель.Заголовок = НайденныйАдрес["result"];
				
			КонецЕсли; 			
			
		КонецЦикла;		 
		
	Иначе
		
		Элементы.ГруппаНайденныеАдреса.Видимость = Ложь;
		
	КонецЕсли; 	
	
	ВерхнийУровень = РезультатПредрасчета.ПолучитьЭлементы();  
	
	Для Каждого РезультатПоВидуДоставки Из ВерхнийУровень Цикл  
		
		Если ВидДоставки = РезультатПоВидуДоставки.ИД Тогда
			
			РезультатПоВидуДоставки.Выбрано = Истина; 				
			РезультатПоВидуДоставки.Сумма = ?(УпрощеннаяФормаЗаказа, "доступно", СтрокаСумма(ДанныеЗапроса["price"]));  
			
			Если Не УпрощеннаяФормаЗаказа Тогда 
			
				ЗаполнитьРасшифровкуРезультатаВыбранногоВидаДоставки(РезультатПоВидуДоставки.ПолучитьЭлементы(), ДанныеЗапроса); 
				
				ВидДоставкиДеревоИдентификатор = РезультатПоВидуДоставки.ПолучитьИдентификатор();
				
			КонецЕсли;	
			
		Иначе
			
			Если ДанныеЗапроса["availableDeliveryTypes"][РезультатПоВидуДоставки.ИД] = Неопределено Тогда
				
				РезультатПоВидуДоставки.Сумма = ?(УпрощеннаяФормаЗаказа, "не доступно", "-");
				
			Иначе 
				
				РезультатПоВидуДоставки.Сумма = ?(УпрощеннаяФормаЗаказа, "доступно", "от " + СтрокаСумма(ДанныеЗапроса["availableDeliveryTypes"][РезультатПоВидуДоставки.ИД]));	
				
			КонецЕсли;
			
		КонецЕсли;		
				
	КонецЦикла; 
	
	ОчиститьГрафикПеревозки();	
	
	ГрафикПеревозки = ДЛ_ДеловыеЛинии.ПрочитатьДанныеГрафикаПеревозки(ДанныеЗапроса["orderDates"], ?(СпособДоставки = 0, ДанныеЗапроса["deliveryTerm"], -1)); 
	
	ЗаполнитьГрафикПеревозки(ГрафикПеревозки);
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьДокументВБазе(НомерЗаказа, Результат)     
	
	Объект.НомерЗаказа = НомерЗаказа; 	
		
	Записать();  
	
	РегистрЧерновиков = РегистрыСведений.ДЛ_ДанныеЧерновиков.СоздатьМенеджерЗаписи();
	РегистрЧерновиков.Заявка = Объект.Ссылка;
	РегистрЧерновиков.Удалить();
	
	Результат.Успешно = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатРасчетаИСозданияЗаказа(РезультатЗапроса, ПредварительныйРасчет, Результат = Неопределено)
	
	Если РезультатЗапроса["data"] <> Неопределено Тогда  
		
		Если ПредварительныйРасчет Тогда 			
			
			Элементы.ГруппаГрафикПеревозки.Видимость = Истина;  
			Элементы.ГруппаРазмещениеЗаказа.Видимость = Истина;
			Элементы.ГруппаПредрасчетОшибки.Видимость = Ложь;
			
			ВывестиДанныеПредварительногоРасчета(РезультатЗапроса["data"]);		
						
			Если ДоступностьОтправкиЗаказа = 1 Тогда
				
				ДоступностьОтправкиЗаказа = 2;	
				
			Конецесли;
			
		Иначе
			
			НомерЗаказа = СтрЗаменить(РезультатЗапроса["data"]["requestID"], Символы.НПП, "");
			
			СоздатьДокументВБазе(НомерЗаказа, Результат); 
			
			Если Результат.Успешно Тогда 			
				
				ОтправитьМетрикуРазмещенияЗаказа(НомерЗаказа);
				СохранитьАдресаВАдреснуюКнигу();
				
			КонецЕсли;
			
		КонецЕсли;		
		
	ИначеЕсли РезультатЗапроса["errors"] <> Неопределено Тогда
		
		ТаблицаОшибок = ЗаполнитьТаблицуОшибок(РезультатЗапроса["errors"]);		
		
		Если ПредварительныйРасчет Тогда
			
			УстановитьВидимостьЭлементовПриОшибкеПредварительногоРасчета();			
			
			ОшибкиПредрасчета = "";
			
			Для Каждого ОшибкаЗапроса Из ТаблицаОшибок Цикл
				
				ОшибкиПредрасчета = ОшибкиПредрасчета + СообщениеОбОшибкеЗаказа(ОшибкаЗапроса) + Символы.ПС + Символы.ПС;	
				
			КонецЦикла;  
			
			Элементы.днОшибкиПредрасчета.Заголовок = ОшибкиПредрасчета;			
			
		Иначе	
		
			Для Каждого ОшибкаЗапроса Из ТаблицаОшибок Цикл				
				
				ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибкеЗаказа(ОшибкаЗапроса)); 
				
			КонецЦикла; 
		
		КонецЕсли;
		
	Иначе
		
		ОшибкаЗапроса = "Ошибка выполнения запроса. Попробуйте еще раз";
		
		Если ПредварительныйРасчет Тогда  
			
			УстановитьВидимостьЭлементовПриОшибкеПредварительногоРасчета();
			
			Элементы.днОшибкиПредрасчета.Заголовок = ОшибкаЗапроса;			
			
		Иначе	
		
			ОбщегоНазначения.СообщитьПользователю(ОшибкаЗапроса);
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РасчетИСозданиеЗаказа(ПредварительныйРасчет = Ложь, Мультизаказ = Ложь)	 
	
	Результат = Новый Структура("Успешно", Ложь);
	
	СтруктураПараметровЗаказа = Новый Структура;
	СтруктураПараметровЗаказа.Вставить("appkey");
	СтруктураПараметровЗаказа.Вставить("sessionID"); 
	
	Если Мультизаказ Тогда
		
		СтруктураПараметровЗаказа.Вставить("inOrder", Ложь);
		
	КонецЕсли;
	
	СтруктураПараметровЗаказа.Вставить("delivery", ЗаполнитьПараметрИнформацияОПреревозке(ПредварительныйРасчет));
	СтруктураПараметровЗаказа.Вставить("members", ЗаполнитьПараметрУчастникиПеревозки(ПредварительныйРасчет));
	СтруктураПараметровЗаказа.Вставить("cargo", ЗаполнитьПараметрСтруктураГруза());  
	СтруктураПараметровЗаказа.Вставить("payment", ЗаполнитьПараметрСруктураОплаты(ПредварительныйРасчет)); 
	СтруктураПараметровЗаказа.Вставить("productInfo", ЗаполнитьПараметрСтруктураИнформацияПоПродукту()); 
	
	Если ПредварительныйРасчет Тогда  
		
		Если ФайловыйВариант Тогда			
			
			РезультатЗапроса = ДЛ_ДеловыеЛинии.ПолучитьРасчетКалькулятораОформитьЗаказ(СтруктураПараметровЗаказа, "Калькулятор", Ложь);   
			
			ОбработатьРезультатРасчетаФайловыйВариант(РезультатЗапроса, Результат);
			
		Иначе
			
			ОчиститьРезультатПедрасчета(); 
			
			СтруктураПараметровЗаказа.appkey = ДЛ_ДеловыеЛинии.AppKey();
			СтруктураПараметровЗаказа.sessionID = ДЛ_ДеловыеЛинии.SessionID(); 
			
			Возврат ДлительныеОперации.ВыполнитьФункцию(ЭтаФорма.УникальныйИдентификатор, "ДЛ_ДеловыеЛинии.ПолучитьРасчетКалькулятораОформитьЗаказ", СтруктураПараметровЗаказа, "Калькулятор", Истина);		
			
		КонецЕсли;	
		
	Иначе
		
		ВремяРазмещенияЗаказа = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
		РезультатЗапроса = ДЛ_ДеловыеЛинии.ПолучитьРасчетКалькулятораОформитьЗаказ(СтруктураПараметровЗаказа, "РазмещениеЗаказа", Ложь);				
	
		ОбработатьРезультатРасчетаИСозданияЗаказа(РезультатЗапроса, Ложь, Результат);
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПредварительныйРасчет(Команда) 	  
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.ГруппаГрафикПеревозки.Видимость = Ложь; 
	Элементы.ГруппаНайденныеАдреса.Видимость = Ложь;
	Элементы.кнОбновлениеДанных.Видимость = Истина;
	Элементы.кнОбновитьДанныеПредрасчета.Видимость = Ложь;
	
	ДлительнаяОперация = РасчетИСозданиеЗаказа(Истина);		
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	АдресРезультатаПредварительногоРасчета = ДлительнаяОперация.АдресРезультата; 
	
	ДоступностьОтправкиЗаказа = 1;
	УправлениеДоступностьюОтправкиЗаказа();
	
	ПодключитьОбработчикОжидания("ПроверитьГотовностьПредварительногоРасчета", 1, Ложь);  	
	
КонецПроцедуры 

&НаКлиенте	
Процедура ПредварительныйРасчетОкончание(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Структура") И Результат.ОтправитьЗаказ = Истина Тогда  
		
		ОформитьЗаказ(Неопределено); 		
	
	ИначеЕсли Результат <> Неопределено И ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("РазместитьДляМультизаказа") и Результат.РазместитьДляМультизаказа Тогда	
		
		РазместитьДляМультизаказа(Неопределено);	
		
	Иначе
		
		ИзменитьЗаказ(Неопределено);	
	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыПриИзменении(Элемент)
	
	Элементы.ГруппаОтгрузкаПогрузочноРазгрузочныеРаботы.Видимость = ОтгрузкаПогрузочноРазгрузочныеРаботы И СпособОтгрузки = 0;
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыПриИзменении(Элемент)
	
	Элементы.ГруппаДоставкаПогрузочноРазгрузочныеРаботы.Видимость = ДоставкаПогрузочноРазгрузочныеРаботы И СпособДоставки = 0;	
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрВремя(ИдентификаторРеквизита)  

	Результат = Новый Структура;	
	Результат.Вставить("worktimeStart", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "С"], "ДФ='ЧЧ:мм'"));
	Результат.Вставить("worktimeEnd", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "По"], "ДФ='ЧЧ:мм'"));
	
	Если ЗначениеЗаполнено(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедС"]) И 
		ЗначениеЗаполнено(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедПо"]) Тогда
	
		Результат.Вставить("breakStart", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедС"], "ДФ='ЧЧ:мм'"));
		Результат.Вставить("breakEnd", Формат(ЭтаФорма["Время" + ИдентификаторРеквизита + "ОбедПо"], "ДФ='ЧЧ:мм'"));
		
	КонецЕсли;	
	
	Результат.Вставить("exactTime", ЭтаФорма[?(ИдентификаторРеквизита = "Отгрузки", "Отправитель", "Получатель") + "ФиксированноеВремя"]);		
	
	Возврат Результат;
	
КонецФункции  

&НаСервере
Функция ЗаполнитьПараметрПогрузоРазгрузочныеРаботы(Префикс)  

	Результат = Новый Структура;
	Результат.Вставить("freightLift", ЭтаФорма[Префикс + "ПогрузочноРазгрузочныеРаботыЛифт"]);
	Результат.Вставить("toFloor", ЭтаФорма[Префикс + "ПогрузочноРазгрузочныеРаботыДоЭтажа"]);
	Результат.Вставить("carry", ЭтаФорма[Префикс + "ПогрузочноРазгрузочныеРаботыРасстояниеПроноса"]); 
	
	Плательщик = ЭтаФорма[Префикс + "ПогрузочноРазгрузочныеРаботыПлательщик"];   
	
	Если Плательщик = "Отправитель" Тогда 
		
		Результат.Вставить("payer", "sender");
		
	ИначеЕсли Плательщик = "Получатель" Тогда
		
		Результат.Вставить("payer", "receiver");	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьПараметрДополнительныеТребования(Префикс)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ЭтаФорма[Префикс + "ДополнительныеТребованияТС"]) Тогда
		
		Результат.Добавить(ЭтаФорма[Префикс + "ДополнительныеТребованияТС"]);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ДополнительныеУслугиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеУслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Функция  ЗаполнитьПараметрДополнительныеУслуги()
	
	Результат = Новый Массив; 	
	
	ПлательщикДополнительныхУслугОтличается = Ложь;
	
	Если ДополнительныеУслугиПлательщик = "Отправитель" Тогда
		
		ПлательщикДополнительныхУслугОтличается = Истина;
		Плательщик = "sender";
		
	ИначеЕсли ДополнительныеУслугиПлательщик = "Получатель" Тогда  
		
		ПлательщикДополнительныхУслугОтличается = Истина;
		Плательщик = "receiver"
		
	КонецЕсли;
	
	Для Каждого ДополнительнаяУслуга Из ДополнительныеУслуги Цикл
		
		Если ДополнительнаяУслуга.Использовать Тогда
			
			СтруктураУслуги = Новый Структура;
			СтруктураУслуги.Вставить("uid", ДополнительнаяУслуга.Услуга.UID); 
			СтруктураУслуги.Вставить("count", ДополнительнаяУслуга.Количество); 
			
			Если ПлательщикДополнительныхУслугОтличается Тогда
				
				СтруктураУслуги.Вставить("payer", Плательщик);	
				
			КонецЕсли;
			
			Результат.Добавить(СтруктураУслуги);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция  ЗаполнитьПараметрСопроводительныеДокументы()
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(СопроводительныеДокументы) Тогда
		
		Если СопроводительныеДокументы = "both" Тогда 
			
			Если ЗначениеЗаполнено(СопроводительныеДокументыПлательщик) Тогда
				
				Результат.Добавить(Новый Структура("action, payer", "send", СопроводительныеДокументыПлательщик));
				Результат.Добавить(Новый Структура("action, payer", "return", СопроводительныеДокументыПлательщик));	
				
			Иначе
			
				Результат.Добавить(Новый Структура("action", "send"));
				Результат.Добавить(Новый Структура("action", "return"));
			
			КонецЕсли;
			
		Иначе 
			
			Если ЗначениеЗаполнено(СопроводительныеДокументыПлательщик) Тогда 
				
				Результат.Добавить(Новый Структура("action, payer", СопроводительныеДокументы, СопроводительныеДокументыПлательщик));
				
			Иначе	
			
				Результат.Добавить(Новый Структура("action", СопроводительныеДокументы));
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьПараметрИнформацияОПреревозке(ПредварительныйРасчет) 		
	
	Результат = Новый Структура;	
	Результат.Вставить("deliveryType", Новый Структура("type", ВидДоставки)); 
	Результат.Вставить("derival", ПолучитьСтруктуруОтправленияПолучение("Отправитель"));
	Результат.Вставить("arrival", ПолучитьСтруктуруОтправленияПолучение("Получатель")); 	
	Результат.Вставить("packages", ЗаполнитьПараметрДополнительныеУслуги());
	Результат.Вставить("accompanyingDocuments", ЗаполнитьПараметрСопроводительныеДокументы());  
	
	Если ЗначениеЗаполнено(ДополнительнаяИнформация) Тогда
	
		Результат.Вставить("comment", Лев(СокрЛП(ДополнительнаяИнформация), 500));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОтправленияПолучение(Префикс) 
	
	Результат = Новый Структура; 
	
	Если Префикс = "Отправитель" Тогда
		
		Результат.Вставить("produceDate", Формат(ДатаОтгрузки, "ДФ='гггг-ММ-дд'"));  
		
		Идентификатор1 = "Отгрузки";
		Идентификатор2 = "Отгрузка";
		
	Иначе  
		
		Идентификатор1 = "Доставки";
		Идентификатор2 = "Доставка";		
		
	КонецЕсли;  
	
	Если Этаформа["Способ" + Идентификатор1] = 0 Тогда
		
		Результат.Вставить("variant", "address"); 
		Результат.Вставить("address", Новый Структура("search", ЭтаФорма[Префикс + "АдресПредставление"])); 		
		Результат.Вставить("time", ЗаполнитьПараметрВремя(Идентификатор1)); 
		Результат.Вставить("requirements", ЗаполнитьПараметрДополнительныеТребования(Идентификатор2));
		
		Если ЭтаФорма[Идентификатор2 + "ПогрузочноРазгрузочныеРаботы"] Тогда
			
			Результат.Вставить("handling", ЗаполнитьПараметрПогрузоРазгрузочныеРаботы(Идентификатор2));	
			
		КонецЕсли; 		
		
	ИначеЕсли Этаформа["Способ" + Идентификатор1] = 1 Тогда 
		
		Результат.Вставить("variant", "terminal"); 
		Результат.Вставить("terminalID", ЭтаФорма[Префикс + "Терминал"].ИДтерминала);
		
	КонецЕсли;
	
	Если ИспользоватьРазличныхПлательщиков И 
		Не (Префикс = "Отправитель" И СпособОтгрузки = 1) Тогда
	
		Если ЭтаФорма[Префикс + "ПлательщикРоль"] = 1 Тогда
			
			Результат.Вставить("payer", "sender"); 
			
		ИначеЕсли ЭтаФорма[Префикс + "ПлательщикРоль"] = 2 Тогда 
			
			Результат.Вставить("payer", "receiver");
			
		ИначеЕсли ЭтаФорма[Префикс + "ПлательщикРоль"] = 3 Тогда
			
			Результат.Вставить("payer", "third"); 
			
		КонецЕсли;	
	
	КонецЕсли;
	
	Возврат Результат;	 
	
КонецФункции 

&НаСервере
Функция ЗаполнитьПараметрСтруктураГруза()  	 
	
	Результат = Новый Структура;  
	
	Если УпрощеннаяФормаЗаказа Тогда 
		
		МинВГХ = ПолучитьМинимальныеЗначенияВГХ();					
		
		Результат.Вставить("length", МинВГХ.МинимальнаяДлина);
		Результат.Вставить("width", МинВГХ.МинимальнаяШирина);
		Результат.Вставить("height", МинВГХ.МинимальнаяВысота);
		Результат.Вставить("weight", МинВГХ.МинимальныйВес);
		Результат.Вставить("totalVolume", МинВГХ.МинимальныйОбъем);
		Результат.Вставить("totalWeight", МинВГХ.МинимальныйВес);
		Результат.Вставить("oversizedWeight", 0);
		Результат.Вставить("oversizedVolume", 0); 
		Результат.Вставить("insurance",  Новый Структура("statedValue", ?(ЗначениеЗаполнено(ГрузСтоимость), ГрузСтоимость, 1000)));		
		
	Иначе	
		
		Результат.Вставить("length", ГрузМаксимальнаяДлина * КоэффициентЕдиницы(ЕдиницаДлина));
		Результат.Вставить("width", ГрузМаксимальнаяШирина * КоэффициентЕдиницы(ЕдиницаШирина));
		Результат.Вставить("height", ГрузМаксимальнаяВысота * КоэффициентЕдиницы(ЕдиницаВысота));
		Результат.Вставить("weight", ГрузМаксимальныйВес);
		Результат.Вставить("totalVolume", ГрузОбъем);
		Результат.Вставить("totalWeight", ГрузВес);
		Результат.Вставить("oversizedWeight", ГрузНегабаритныйВес);
		Результат.Вставить("oversizedVolume", ГрузНегабаритныйОбъем); 
		
		Если ЗначениеЗаполнено(ГрузСтоимость) Тогда
		
			Результат.Вставить("insurance",  Новый Структура("statedValue", ГрузСтоимость));
			
		КонецЕсли;	
		
	КонецЕсли; 
	
	Результат.Вставить("freightUID", ХарактерГруза.UID);
	Результат.Вставить("quantity", ГрузКоличествоГрузовыхМест);
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьПараметрСтруктураИнформацияПоПродукту()  	 
	
	Результат = Новый Структура;
	Результат.Вставить("type", 7);
	Результат.Вставить("productType", 19);
	
	Массивinfo = Новый Массив;
	
	ПараметрыТекущейВерсии = ДЛ_ДеловыеЛинииПовтИсп.ПолучитьПараметрыТекцущейВерсии();
	
	Если ПараметрыТекущейВерсии.Свойство("Версия") Тогда
		
		Массивinfo.Добавить(Новый Структура("param, value","module version", Лев(ПараметрыТекущейВерсии.Идентификатор, 1) + "_" + ПараметрыТекущейВерсии.Версия));	
		
	КонецЕсли;
	
	Результат.Вставить("info", Массивinfo); 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьПараметрСруктураОплаты(ПредварительныйРасчет)  
	
	Результат = Новый Структура;
	Результат.Вставить("type", ФормаОплатыПредставление);
	//Результат.Вставить("paymentCity", МестоОплаты.КодКЛАДР);
	Результат.Вставить("paymentCity", "7700000000000000000000000"); //Всегда Москва
	
	Если Не ПредварительныйРасчет Тогда
		
		ПараметрПлательщик = "";
		
		Если ПлательщикРоль = 1 Тогда
			
			ПараметрПлательщик = "sender";
			
		ИначеЕсли ПлательщикРоль = 2 Тогда
			
			ПараметрПлательщик = "receiver";
			
		ИначеЕсли ПлательщикРоль = 3 Тогда 
			
			ПараметрПлательщик = "third";
			
		КонецЕсли;
		
		Результат.Вставить("primaryPayer", ПараметрПлательщик);  
		
		Если НаложенныйПлатеж Тогда
			
			Результат.Вставить("cashOnDelivery", ЗаполнитьПараметрНаложенныйПлатеж());
			
		ИначеЕсли ЗначениеЗаполнено(НаложенныйПлатежНомерЗаказа) Тогда
			
			Результат.Вставить("cashOnDelivery", ЗаполнитьПараметрВнутреннийНомерЗаказа());	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьПараметрНаложенныйПлатеж()
	
	Результат = Новый Массив;	
	СтруктураРезультата = Новый Структура;  
	
	СтруктураРезультата.Вставить("orderNumber", НаложенныйПлатежНомерЗаказа); 
	СтруктураРезультата.Вставить("orderDate", Формат(НаложенныйПлатежДатаЗаказа, "ДФ='гггг-ММ-дд'"));	
	СтруктураРезультата.Вставить("products", ЗаполнитьПараметрНаложенныйПлатежТовары());
	
	Результат.Добавить(СтруктураРезультата);  
	
	Возврат Результат;
	
КонецФункции   

&НаСервере
Функция ЗаполнитьПараметрНаложенныйПлатежТовары()
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТовар Из НаложенныйПлатежТовары Цикл
		
		СтруктураРезультата = Новый Структура;  
		
		СтруктураРезультата.Вставить("productName", СтрокаТовар.Номенклатура.Наименование);  
		СтруктураРезультата.Вставить("productCode", СтрокаТовар.Номенклатура.Артикул);
		СтруктураРезультата.Вставить("productAmount", СтрокаТовар.Количество);
		СтруктураРезультата.Вставить("costWithVAT", СтрокаТовар.Цена);  
		
		Если СтрокаТовар.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда 
		
			СтруктураРезультата.Вставить("VATRate", СтрокаТовар.СтавкаНДС.Ставка);
			
		КонецЕсли;
		
		Результат.Добавить(СтруктураРезультата);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьПараметрУчастникиПеревозки(ПредварительныйРасчет)
	
	Результат = Новый Структура; 
	
	СтруктураОтправительзапроса = Новый Структура;
	
	Если ЗначениеЗаполнено(НашаРольВПеревозке) Тогда
		
		СтруктураОтправительзапроса.Вставить("role", НашаРольВПеревозке);
		
	КонецЕсли; 
	
	НашИД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказчикКонтрагентСсылка, "UID");
	
	Если ЗначениеЗаполнено(НашИД) Тогда 
		
		СтруктураОтправительзапроса.Вставить("uid", НашИД);
		
	КонецЕсли;
	
	Если Не ПредварительныйРасчет Тогда 				
		
		Результат.Вставить("sender", ЗаполнитьПараметрУчастникПеревозки("Отправитель"));		
		Результат.Вставить("receiver", ЗаполнитьПараметрУчастникПеревозки("Получатель"));
		
		Если (ПлательщикРоль = 3) Или (ИспользоватьРазличныхПлательщиков И ((ОтправительПлательщикРоль = 3) Или (ПолучательПлательщикРоль = 3))) Тогда
			
			Результат.Вставить("third", ЗаполнитьПараметрУчастникПеревозки("Плательщик"));
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Результат.Вставить("requester", СтруктураОтправительзапроса);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ОтгрузкаДополнительныеТребованияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаДополнительныеТребованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаДополнительныеТребованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаДополнительныеТребованияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗаказ(Команда)	
	
	УстановитьДоступностьФормы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказ(Команда)	
	
	Результат = РасчетИСозданиеЗаказа(); 
	
	Если Результат.Успешно Тогда
		
		Закрыть(); 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ваш заказ успешно создан и принят в обработку.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтрагентОткрытие(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентОткрытие(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	КонтрагентОткрытие(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрУчастникПеревозки(Префикс)
	
	Результат = Новый Структура;
	
	КонтрагентСсылка = ЭтотОбъект[Префикс + "КонтрагентСсылка"];
	КонтрагентНаименование = ЭтотОбъект[Префикс + "КонтрагентНаименование"];
	КонтрагентЮрФизЛицо = ЭтотОбъект[Префикс + "КонтрагентЮрФизЛицо"];
	КонтрагентИНН = ЭтотОбъект[Префикс + "КонтрагентИНН"];
	КонтрагентЮридическийАдрес = ЭтотОбъект[Префикс + "КонтрагентЮридическийАдресПредставление"];
	КонтактноеЛицо = ЭтотОбъект[Префикс + "КонтактноеЛицоНаименование"]; 
	Телефон = ЭтотОбъект[Префикс + "КонтактноеЛицоТелефонПредставление"];	
	Иностранец = ЭтотОбъект[Префикс + "КонтрагентИностранец"];
	ОПФ = ЭтотОбъект[Префикс + "КонтрагентОПФ"];
	НомерИностранногоПаспорта = СокрЛП(ЭтотОбъект[Префикс + "КонтрагентНомерИностранногоПаспорта"]);  
	СогласиеНаПолучениеЭлектронногоЧека = ЭтотОбъект[Префикс + "СогласиеНаПолучениеЭлектронногоЧека"]; 
	КонтактноеЛицоEmail = ЭтотОбъект[Префикс + "КонтактноеЛицоEmail"]; 
	КонтактноеЛицоТелефонДляЧека = ЭтотОбъект[Префикс + "КонтактноеЛицоТелефонДляЧека"];
	
	ПараметрыКонтрагента = Новый Структура;		 
	
	Если  Префикс = "Получатель" И УпрощеннаяДоставка Тогда
		
		ПараметрыКонтрагента.Вставить("isAnonym", Истина);
		ПараметрыКонтрагента.Вставить("name", ПолучательКонтактноеЛицоНаименование); 
		ПараметрыКонтрагента.Вставить("form", "0xAB91FEEA04F6D4AD48DF42161B6C2E7A");
		ПараметрыКонтрагента.Вставить("phone", ТолькоЦифры(Телефон));  
		
		Результат.Вставить("counteragent", ПараметрыКонтрагента);  
		
		Возврат Результат;
		
	КонецЕсли; 		 
	
	Если Элементы["ГруппаЭлектронныйЧек" + Префикс].Видимость Тогда
		
		ДанныеДляЭлектронногоЧека = Новый Структура;
		ДанныеДляЭлектронногоЧека.Вставить("send", СогласиеНаПолучениеЭлектронногоЧека); 		  
		
		Если ЗначениеЗаполнено(КонтактноеЛицоEmail) Тогда  
			
			ДанныеДляЭлектронногоЧека.Вставить("email", КонтактноеЛицоEmail);	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактноеЛицоТелефонДляЧека) Тогда  
			
			ДанныеДляЭлектронногоЧека.Вставить("phone", КонтактноеЛицоТелефонДляЧека);	
			
		КонецЕсли;
		
		Результат.Вставить("dataForReceipt", ДанныеДляЭлектронногоЧека);
		
	КонецЕсли;
	
	Если КонтрагентЮрФизЛицо = 2 Тогда
		
		ПараметрыКонтрагента.Вставить("form", ?(Иностранец Или ЭтаФорма[Префикс + "РучнойВвод"] = 2, ОПФ.UID, "0xAB91FEEA04F6D4AD48DF42161B6C2E7A")); 
		
		Если Не УпрощеннаяДоставка Или Префикс <> "Получатель" Тогда 			
			
			Паспорт = Новый Структура;
			Паспорт.Вставить("type", "passport"); 
			
			Если Иностранец  Или ЭтаФорма[Префикс + "РучнойВвод"] = 2 Тогда 
				
				ПаспортныеДанные = ?(Иностранец, НомерИностранногоПаспорта, КонтрагентИНН);
				
				СерияНомер = СтрРазделить(ПаспортныеДанные, " ", Ложь);
				
				Если СерияНомер.Количество() > 1 Тогда
					
					Паспорт.Вставить("serial", СерияНомер[0]); 
					Паспорт.Вставить("number", СерияНомер[1]);	
					
				Иначе	
				
					Паспорт.Вставить("number", ПаспортныеДанные);	
					
				КонецЕсли;	
				
			Иначе
				
				Если ЗначениеЗаполнено(КонтрагентНаименование) И Не ЗначениеЗаполнено(КонтрагентСсылка) И ЗначениеЗаполнено(ЭтотОбъект[Префикс + "КонтрагентНомерИностранногоПаспорта"]) Тогда
					
					СерияНомер = СтрРазделить(ЭтотОбъект[Префикс + "КонтрагентНомерИностранногоПаспорта"], "~", Ложь); 
					
					Если СерияНомер.Количество() > 1 Тогда
						
						Паспорт.Вставить("serial", СерияНомер[0]); 
						Паспорт.Вставить("number", СерияНомер[1]);	
						
					Иначе	
						
						Паспорт.Вставить("number", КонтрагентСсылка.ДокументУдостоверяющийЛичность);	
						
					КонецЕсли;
					
				Иначе
					
					ПаспортныеДанные = ПолучитьПаспортныеДанные(КонтрагентСсылка);
					Паспорт.Вставить("serial", СтрЗаменить(ПаспортныеДанные.Серия, " ", "")); 
					Паспорт.Вставить("number", ПаспортныеДанные.Номер);  
					
				КонецЕсли;
				
			КонецЕсли;
			
			ПараметрыКонтрагента.Вставить("document", Паспорт); 
			
		КонецЕсли;
		
	Иначе 
		
		Если Префикс = "Плательщик" Тогда
			
			ПараметрыКонтрагента.Вставить("form", ?(Иностранец, ОПФ.UID, ДЛ_ДеловыеЛинии.ПолучитьОПФпоИНН(КонтрагентИНН)));		
			ПараметрыКонтрагента.Вставить("inn", ?(Иностранец, ДЛ_ДеловыеЛинии.ПолучитьЗначениеРеквизита(КонтрагентСсылка, "НалоговыйНомер"), КонтрагентИНН)); 
			
		Иначе	
			
			ПараметрыКонтрагента.Вставить("form", ?(Иностранец Или (ЭтаФорма[Префикс + "РучнойВвод"] = 1 И СокрЛП(ЭтаФорма[Префикс + "КонтрагентСтрана"]) <> "Россия"), ОПФ.UID, ДЛ_ДеловыеЛинии.ПолучитьОПФпоИНН(КонтрагентИНН)));		
			ПараметрыКонтрагента.Вставить("inn", ?(Иностранец И ЭтаФорма[Префикс + "РучнойВвод"] = 0, ДЛ_ДеловыеЛинии.ПолучитьЗначениеРеквизита(КонтрагентСсылка, "НалоговыйНомер"), КонтрагентИНН)); 
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентЮридическийАдрес) Тогда
		
			ПараметрыКонтрагента.Вставить("juridicalAddress", Новый Структура("search", КонтрагентЮридическийАдрес));
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ПараметрыКонтрагента.Вставить("name", КонтрагентНаименование); 
	
	КонтактныеЛица = Новый Массив;
	КонтактныеЛица.Добавить(Новый Структура("name", КонтактноеЛицо));
	
	Телефоны = Новый Массив;
	
	Если ЗначениеЗаполнено(Телефон) Тогда	
		
		МассивТелефонов = СтрРазделить(Телефон, ";");
		ТелефоновДобавлено = 0;
		
		Для Каждого НомерТелефона Из МассивТелефонов Цикл
			
			Если ТелефоновДобавлено = 3 Тогда
				
				Прервать;
				
			КонецЕсли;
			
			НомерТелефонаСДобавочным = СтрРазделить(СтрЗаменить(СтрЗаменить(НомерТелефона, Символы.ПС, ""), ", доб. ", Символы.ПС), Символы.ПС, Ложь);
			
			НомерТелефонаОчищенный = ТолькоЦифры(НомерТелефонаСДобавочным[0]);
			
			Если ЗначениеЗаполнено(НомерТелефонаОчищенный) Тогда
				
				СтруктураТелефона = Новый Структура;
				СтруктураТелефона.Вставить("number", НомерТелефонаОчищенный);
				
				Если НомерТелефонаСДобавочным.Количество() = 2  Тогда
					
					СтруктураТелефона.Вставить("ext", ТолькоЦифры(НомерТелефонаСДобавочным[1]));	
					
				КонецЕсли; 
				
				Телефоны.Добавить(СтруктураТелефона);
				
				ТелефоновДобавлено = ТелефоновДобавлено + 1;	
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;	 
	
	Результат.Вставить("counteragent", ПараметрыКонтрагента); 
	Результат.Вставить("contactPersons", КонтактныеЛица); 
	Результат.Вставить("phoneNumbers", Телефоны); 	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КоэффициентЕдиницы(ЕдиницаИмерения)
	
	Если ЕдиницаИмерения = "" Тогда 
		
		Возврат 0.01;
		
	ИначеЕсли ЕдиницаИмерения = "мм" Тогда
		
		Возврат 0.001; 
		
	Иначе
		
		Возврат 1;	
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЕдиницаДлинаОдноМестоПриИзменении(Элемент)
	
	РассчитатьОбъем(); 

КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаШиринаОдноМестоПриИзменении(Элемент)
	
	РассчитатьОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаВысотаОдноМестоПриИзменении(Элемент)
	
	РассчитатьОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаДлинаМаксПриИзменении(Элемент)
	
	РассчитатьОбщиеВГХНесколькихМест();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаШиринаМаксПриИзменении(Элемент)
	
	РассчитатьОбщиеВГХНесколькихМест();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаВысотаМаксПриИзменении(Элемент)
	
	РассчитатьОбщиеВГХНесколькихМест();
	
КонецПроцедуры 

&НаСервере
Функция СообщениеОбОшибкеЗаказа(ОшибкаЗаказа) 
	
	Сообщение = "";  
	
	Если ТипЗнч(ОшибкаЗаказа["fields"]) = Тип("Массив") И ОшибкаЗаказа["fields"].Количество() > 0 Тогда
		
		ПолеСОшибкой = ОшибкаЗаказа["fields"][0];	
		
		Если ОшибкаЗаказа["title"] = "Ошибка типизации" Тогда 
			
			Если ПолеСОшибкой = "delivery.deliveryType.type" Тогда
				
				Сообщение = "Не заполнен Вид доставки";
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.time.worktimeStart" Тогда
				
				Сообщение = "Не заполнено Время начала работы Отправителя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.time.worktimeEnd" Тогда
				
				Сообщение = "Не заполнено Время окончания работы Отправителя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.produceDate" Тогда
				
				Сообщение = "Дата отгрузки заполнена некорректно";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.time.worktimeStart" Тогда
				
				Сообщение = "Не заполнено Время начала работы Получателя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.time.worktimeEnd" Тогда
				
				Сообщение = "Не заполнено Время окончания работы Получателя";	
				
			ИначеЕсли ПолеСОшибкой = "payment.type" Тогда
				
				Сообщение = "Не заполнена Форма оплаты";	
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document.serial" Тогда
				
				Сообщение = "Проверьте правильность заполнения паспортных данных Получателя";	
				
			ИначеЕсли ПолеСОшибкой = "payment.primaryPayer" Тогда
				
				Сообщение = "Не заполнен Плательщик";
				
			ИначеЕсли ПолеСОшибкой = "payment.cashOnDelivery.cashOnDeliveryItem.orderDate" Тогда
				
				Сообщение = "Не заполнена Дата внутреннего заказа";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.terminalID" Тогда
				
				Сообщение = "Не заполнен Терминал Отправителя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.terminalID" Тогда
				
				Сообщение = "Не заполнен Терминал Получателя";	 
				
			ИначеЕсли ПолеСОшибкой = "delivery.packages.package.count" Тогда
				
				Сообщение = "Убедитесь, что количество грузовых мест больше или равно 1";
				
			ИначеЕсли ПолеСОшибкой = "members.sender.phoneNumbers.phoneNumber.number" Тогда
				
				Сообщение = "Убедитесь, что в номере телефона Отправителя не больше 15 символов.";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.phoneNumbers.phoneNumber.number" Тогда
				
				Сообщение = "Убедитесь, что в номере телефона Получателя не больше 15 символов.";
				
			ИначеЕсли ПолеСОшибкой = "produce_date" Тогда
				
				Сообщение = "Неправильный формат даты. Используйте формат YYYY-MM-DD";
				
			ИначеЕсли ПолеСОшибкой = "time.worktimeStart" Тогда
				
				Сообщение = "Неправильный формат времени. Используйте один формат hh:mm.";
				
			ИначеЕсли ПолеСОшибкой = "time.worktimeEnd" Тогда
				
				Сообщение = "Неправильный формат времени. Используйте один формат hh:mm.";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document.number" Тогда
				
				Сообщение = ОшибкаЗаказа["detail"];	
				
			КонецЕсли;  
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Отсутствует обязательный параметр" Тогда
			
			Если ПолеСОшибкой = "delivery.derival.address.search" Тогда
				
				Сообщение = "Не заполнен Адрес доставки Отправителя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.address.search" Тогда
				
				Сообщение = "Не заполнен Адрес доставки Получателя";
				
			ИначеЕсли ПолеСОшибкой = "cargo.freightUID" Тогда
				
				Сообщение = "Не заполнен Характер груза";
				
			ИначеЕсли ПолеСОшибкой = "payment.paymentCity" Тогда
				
				Сообщение = "Не заполнено Место оплаты";
				
			ИначеЕсли ПолеСОшибкой = "members.requester.role" Тогда
				
				Сообщение = "Не заполнена роль Заказчика";
				
			ИначеЕсли ПолеСОшибкой = "members.sender.contactPersons.contactPerson.name" Тогда
				
				Сообщение = "Не заполнено Контактное лицо Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "members.sender.phoneNumbers" Тогда
				
				Сообщение = "Не заполнен Номер телефона Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.contactPersons.contactPerson.name" Тогда
				
				Сообщение = "Не заполнено Контактное лицо Получателя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.phoneNumbers" Тогда
				
				Сообщение = "Не заполнен Номер телефона Получателя"; 
				
			ИначеЕсли ПолеСОшибкой = "delivery.comment" Тогда
				
				Сообщение = "Не заполнен Комментарий";
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.juridicalAddress.search" Тогда
				
				Сообщение = "Не заполнен юридический адрес Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.juridicalAddress.search" Тогда
				
				Сообщение = "Не заполнен юридический адрес Получателя";	
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.form" Тогда
				
				Сообщение = "Некорректный ИНН Отправителя";     
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.form" Тогда
				
				Сообщение = "Некорректный ИНН Получателя";	
				
			ИначеЕсли ПолеСОшибкой = "members.sender.dataForReceipt" Тогда
				
				Сообщение = "Не заполнены контактные данные для отправки электронного чека плательщику-физическому лицу";					
			
			ИначеЕсли ПолеСОшибкой = "members.requester.uid" Тогда
				
				Сообщение = "Не заполнен Заказчик";	
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.dataForReceipt.phone" Тогда
				
				Сообщение = "Не заполнен Номер телефона для электронного чека";	
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.dataForReceipt.email" Тогда
				
				Сообщение = "Не заполнен Email для электронного чека";	
				
			ИначеЕсли ПолеСОшибкой = "payment.cashOnDelivery.cashOnDeliveryItem.orderNumber" Тогда
				
				Сообщение = "Не заполнен Внутренний номер заказа";	
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document.serial" Тогда
				
				Сообщение = "Не заполнена серия документа Получателя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document.number" Тогда
				
				Сообщение = "Не заполнен номер документа Получателя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.dataForReceipt" Тогда
				
				Сообщение = "Не заполнены контактные данные для отправки электронного чека плательщику-физическому лицу";
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.document.serial" Тогда
				
				Сообщение = "Не заполнена серия документа Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.document.number" Тогда
				
				Сообщение = "Не заполнен номер документа Отправителя";	
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.document" Тогда
				
				Сообщение = "Отсутсвует документ Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document" Тогда
				
				Сообщение = "Отсутсвует документ Получателя";
				
			ИначеЕсли ПолеСОшибкой = "sessionID" Тогда
				
				Сообщение = "Не удалось выполнить Авторизацию. Неверные Логин или Пароль.";	
				
			ИначеЕсли ПолеСОшибкой = "members.third.counteragent.form" Тогда
				
				Сообщение = "Не заполнен Плательщик - Третье лицо";	  
				
			ИначеЕсли ПолеСОшибкой = "members.third.counteragent.name" Тогда
				
				Сообщение = "Не заполнено название Плательщика - Третьего лица";
				
			ИначеЕсли ПолеСОшибкой = "members.third.counteragent.inn" Тогда
				
				Сообщение = "Не заполнен ИНН Плательщика - Третьего лица";	
				
			ИначеЕсли ПолеСОшибкой = "members.third.dataForReceipt" Тогда
				
				Сообщение = "Не заполнены данные для отправки чека";
				
			ИначеЕсли ПолеСОшибкой = "members.third.contactPersons.contactPerson.name" Тогда
				
				Сообщение = "Не заполнены данные контактного лица Плательщика - Третьего лица";	  
				
			ИначеЕсли ПолеСОшибкой = "members.third.phoneNumbers" Тогда
				
				Сообщение = "Не заполнен номер телефона контактного лица Плательщика - Третьего лица";	
				
			ИначеЕсли ПолеСОшибкой = "address.search" Тогда
				
				Сообщение = "Не заполнен Адрес";   
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.name" Тогда
				
				Сообщение = "Не заполнен Получатель";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.inn" Тогда
				
				Сообщение = "Не заполнен ИНН Получателя";	
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Услуга недоступна" Тогда	
			
			Если ПолеСОшибкой = "delivery.arrival.terminalID" Тогда
				
				Сообщение = "Перевозка при Самовывозе и Самопривозе в рамках населенного пункта недоступна";
				
			ИначеЕсли ПолеСОшибкой = "delivery.deliveryType" 
				Или ПолеСОшибкой = "delivery.deliveryType.type" Тогда
				
				Сообщение = "Выбранный вид доставки недоступен при выбранных параметрах перевозки";   
				
			ИначеЕсли СтрНайти(ПолеСОшибкой, "cargo.insurance") > 0 Тогда
				
				Сообщение = "Страховка недоступна для указанных параметров перевозки";
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.address.search" Тогда
				
				Сообщение = ОшибкаЗаказа["detail"];			
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.variant" Тогда
					
				Сообщение = "Выбранная услуга недоступна для выбранного Способа доставки";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.packages" Тогда
					
				Сообщение = "Выбранная услуга недоступна для указанных параметров перевозки";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.accompanyingDocuments" Тогда
					
				Сообщение = "Действия с Сопроводительными документами не доступны при выбранных параметрах доставки";
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.requirements" Тогда
					
				Сообщение = "Услуга не доступна на Терминале Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.requirements" Тогда
					
				Сообщение = "Услуга не доступна  на Терминале Получателя";
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.handling" Тогда
					
				Сообщение = "Выбранная услуга не доступна для указанных параметров перевозки при отгрузке";	   
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.handling" Тогда
					
				Сообщение = "Выбранная услуга не доступна для указанных параметров перевозки при доставке";	
				
			КонецЕсли;	
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Указан некорректный адрес" Тогда  
			
			Если ПолеСОшибкой = "delivery.arrival.address.search" Тогда
				
				Сообщение = "Город или населенный пункт Получателя не найдены";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.address.search" Тогда	
				
				Сообщение = "Указан некорректный адрес Отправителя";	
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Выбранная дата недоступна" Тогда	 
			
			Если ПолеСОшибкой = "delivery.derival.produceDate" Тогда
				
				Сообщение = "Выбранная Дата отгрузки недоступна";	
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Ошибка оформления услуги" Тогда	
			
			Если ПолеСОшибкой = "delivery.arrival.requirements" 
				Или ПолеСОшибкой = "delivery.derival.requirements" Тогда
				
				Сообщение = "Перечисленные спец.требования к транспорту недоступны для одновременного заказа";
				
			ИначеЕсли ПолеСОшибкой = "delivery.packages" Тогда
				
				Сообщение = "Перечисленные упаковки недоступны на выбранном терминале";
				
			КонецЕсли;	
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Ошибка в параметрах запроса" Тогда 
			
			Если ПолеСОшибкой = "cargo.oversizedWeight" Тогда
				
				Сообщение = "Не заполнен Вес негабаритной части груза на вкладке параметры груза";
				
			ИначеЕсли ПолеСОшибкой = "cargo.oversizedVolume" Тогда	
				
				Сообщение = "Не заполнен Объём негабаритной части груза на вкладке параметры груза";
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Значение превышает допустимое" Тогда	
			
			Если СтрНайти(ПолеСОшибкой, "cargo.") > 0 Тогда
				
				Сообщение = ОшибкаЗаказа["detail"];	
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Выбран недопустимый терминал" Тогда
			
			Если ПолеСОшибкой = "delivery.arrival.terminalID" Тогда
				
				Сообщение = "Выбранный терминал не оказывает услуги по выдаче груза";
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.terminalID" Тогда
				
				Сообщение = "Выбранный терминал не может принять груз с указанными ВГХ";	
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Невозможно оформить заявку на указанное время" Тогда	 
			
			Если ПолеСОшибкой = "delivery.derival.time.worktimeStart" Тогда
				
				Сообщение = "Невозможно оформить заявку на указанное время. Укажите другое время начало работы Отправителя";
				
			ИначеЕсли ПолеСОшибкой = "delivery.derival.time.worktimeEnd" Тогда
				
				Сообщение = "Невозможно оформить заявку на указанное время. Укажите другое время окончания работы Отправителя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.time.worktimeStart" Тогда
				
				Сообщение = "Невозможно оформить заявку на указанное время. Укажите другое время начало работы Получателя";	
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.time.worktimeEnd" Тогда
				
				Сообщение = "Невозможно оформить заявку на указанное время. Укажите другое время окончания работы Получателя";						
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Неверный формат параметра" Тогда	
			
			Если ПолеСОшибкой = "delivery.packages.package.uid" Тогда
				
				Сообщение = "Неверный формат UID'а упаковки. Обратитесь к администратору";    
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.phone" Тогда
				
				Сообщение = "Укажите номер телефона Получателя в формате +7(9XX)XXXXXXX"; 
				
			ИначеЕсли ПолеСОшибкой = "members.sender.phoneNumbers.phoneNumber.number" Тогда
				
				Сообщение = "Укажите номер телефона Отправителя в формате +7(9XX)XXXXXXX";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.phoneNumbers.phoneNumber.number" Тогда
				
				Сообщение = "Укажите номер телефона Получателя в формате +7(9XX)XXXXXXX";	
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.dataForReceipt.phone" Тогда
				
				Сообщение = "Укажите номер телефона в формате +79XXXXXXXXX (9 цифр после +79, плюс обязателен)";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.dataForReceipt.email" Тогда
				
				Сообщение = "Введите корректный адрес электронной почты";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document.serial" Тогда
				
				Сообщение = "Неверный формат серии паспорта Получателя";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.document.number" Тогда	
				
				Сообщение = "Неверный формат номера паспорта Получателя";    
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.document.serial" Тогда
				
				Сообщение = "Неверный формат серии паспорта Отправителя"; 
				
			ИначеЕсли ПолеСОшибкой = "members.sender.counteragent.document.number" Тогда
				
				Сообщение = "Неверный формат номера паспорта Отправителя";	
				
			КонецЕсли; 	
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Недопустимое значение параметра" Тогда	
			
			Если ПолеСОшибкой = "members.requester.uid" Тогда
				
				Сообщение = "Заказчик не является клиентом ДЛ";	 
				
			ИначеЕсли ПолеСОшибкой = "cargo.weight" Тогда 							
				
				Сообщение = СтрЗаменить(ОшибкаЗаказа["detail"], "Характеристики груза превышают", "Вес превышает"); 
				
			ИначеЕсли ПолеСОшибкой = "cargo.length" Тогда
					
				Сообщение = СтрЗаменить(ОшибкаЗаказа["detail"], "Характеристики груза превышают", "Длина превышает");
					
			ИначеЕсли ПолеСОшибкой = "cargo.width" Тогда
					
				Сообщение = СтрЗаменить(ОшибкаЗаказа["detail"], "Характеристики груза превышают", "Ширина превышает");
					
			ИначеЕсли ПолеСОшибкой = "cargo.height" Тогда
					
				Сообщение = СтрЗаменить(ОшибкаЗаказа["detail"], "Характеристики груза превышают", "Высота превышает");	
				
			ИначеЕсли ПолеСОшибкой ="cargo.totalWeight" Тогда
				
				Сообщение = "Не заполнен Общий вес груза";	
				
			КонецЕсли;			 
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Ошибка упрощенной отправки" Тогда	
			
			Если ПолеСОшибкой = "delivery.accompanyingDocuments.accDoc.action" Тогда
				
				Сообщение = "Действия с Сопроводительными документами не доступны при выбранных параметрах доставки";
				
			ИначеЕсли ПолеСОшибкой = "members.receiver.counteragent.phone" Тогда
				
				Сообщение = "Укажите номер телефона анонимного получателя в формате +7(9ХХ)ХХХХХХ";
				
			ИначеЕсли ПолеСОшибкой = "delivery.arrival.address.search" Тогда
				
				Сообщение = "Упрощенная доставка не доступна вне территории РФ";	
				
			КонецЕсли;	
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Ошибка наложенного платежа" Тогда
			
			Если ОшибкаЗаказа["detail"] = "Для получения разрешения на использование услуги необходимо обратиться к персональному менеджеру" Тогда
				
				Сообщение = "Для подключения услуги 'Наложенный платеж' обратитесь к вашему персональному менеджеру по телефону 8-800-100-8000.  Подробная информация об услуге - https://www.dellin.ru/articles/1146";
				
			Иначе
				
				Сообщение = ОшибкаЗаказа["detail"];	
				
			КонецЕсли;				 
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Не передан ни один из обязательных параметров" Тогда	
			
			Если ПолеСОшибкой = "members.receiver.dataForReceipt.phone" Тогда
				
				Сообщение = "В запросе должен присутствовать хотя бы один параметр Телефон, Email для электронного чека";
				
			ИначеЕсли ПолеСОшибкой = "length" Или ПолеСОшибкой = "width" Или ПолеСОшибкой = "height" Тогда	
				
				Сообщение = "В запросе должен присутствовать хотя бы один параметр из: Длина, Ширина, Высота";
				
			КонецЕсли;
			
		ИначеЕсли ОшибкаЗаказа["title"] = "Ошибка параметров оплаты" Тогда
			
			Если ОшибкаЗаказа["detail"] = "Не допускается указание более двух плательщиков" Тогда
				
				Сообщение = "Не допускается указание более двух плательщиков";				
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ОшибкаЗаказа["title"] = "Ошибка выполнения запроса" 
		Или ОшибкаЗаказа["title"] = "Указан некорректный документ, удостоверяющий личность" Тогда 
		
		Сообщение = ОшибкаЗаказа["detail"];
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сообщение) Тогда 
		
		Сообщение = СтрШаблон("Ошибка: %1
			|Описание: %2
			|Поле запроса: %3",
			ОшибкаЗаказа["title"],
			ОшибкаЗаказа["detail"],
			ПолеСОшибкой);		
		
	КонецЕсли; 	 
	
	Возврат "• " + Сообщение; 
	
КонецФункции  	

&НаКлиенте
Процедура ОтправительАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораАдреса("Отправитель");
	
КонецПроцедуры 
                                                                   
&НаКлиенте
Процедура ОткрытьФормуВыбораАдреса(Префикс)
	
	ИмяРеквизитаАдреса = Префикс + "Адрес";	
	
	ДополнительныеПараметры = Новый Структура;	
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдреса", ИмяРеквизитаАдреса);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", 
		ЭтаФорма, ДополнительныеПараметры);
	
	ВидКонтактнойИнформации = Новый Структура;
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ВидКонтактнойИнформации.Вставить("ТолькоНациональныйАдрес", Ложь);
	ВидКонтактнойИнформации.Вставить("ВключатьСтрануВПредставление", Ложь);
	ВидКонтактнойИнформации.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
	
	ПараметрыФормыКонтактнойИнформации = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформации,
		ЭтаФорма[ИмяРеквизитаАдреса + "Значение"],
		ЭтаФорма[ИмяРеквизитаАдреса + "Представление"]);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,, Оповещение);
	
КонецПроцедуры   

&НаКлиенте	
Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда  
		
		Возврат; 
		
	КонецЕсли;
	
	ИмяРеквизитаАдреса = ДополнительныеПараметры.ИмяРеквизитаАдреса;
	
	ЭтаФорма[ИмяРеквизитаАдреса + "Представление"] = Результат.Представление;
	ЭтаФорма[ИмяРеквизитаАдреса + "Значение"] = Результат.Значение; 
	
	ЗаполнитьНаселенныйПунктПоАдресу1С(СтрЗаменить(ИмяРеквизитаАдреса, "Адрес", ""));
	
	ЗаблокироватьОтправкуЗаказа();

КонецПроцедуры

&НаКлиенте
Процедура ПолучательАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораАдреса("Получатель");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючиХранилищаНастроек()
	
	СтруктураКлючей = Новый Структура;
	
	СтруктураКлючей.Вставить("ШаблоныЗаказов", "ШаблоныЗаказов");	
	
	Возврат СтруктураКлючей;
	
КонецФункции

&НаКлиенте
Процедура СохранитьШаблон(Команда)	
	
	ОО = Новый ОписаниеОповещения("СохранитьШаблонПродолжение", ЭтаФорма);
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить("Создать новый");
	КнопкиВопроса.Добавить("Перезаписать существующий");
	
	ПоказатьВопрос(ОО, "Выберите способ сохранения", КнопкиВопроса);
	
КонецПроцедуры  

&НаКлиенте
Функция СобратьСтруктуруДанныхДляШаблона()
	
	СтруктураДанных = Новый Структура;	
	СтруктураДанных.Вставить("НашаРольВПеревозке", НашаРольВПеревозке); 
	СтруктураДанных.Вставить("ОтправительКонтрагентНаименование", ОтправительКонтрагентНаименование);
	СтруктураДанных.Вставить("ОтправительКонтрагентСсылка", ОтправительКонтрагентСсылка);
	СтруктураДанных.Вставить("ОтправительКонтрагентИНН", ОтправительКонтрагентИНН);
	СтруктураДанных.Вставить("ОтправительКонтрагентЭтоОрганизация", ОтправительКонтрагентЭтоОрганизация);
    СтруктураДанных.Вставить("ОтправительКонтрагентЮрФизЛицо", ОтправительКонтрагентЮрФизЛицо);
	СтруктураДанных.Вставить("ОтправительКонтактноеЛицоНаименование", ОтправительКонтактноеЛицоНаименование);    
	СтруктураДанных.Вставить("ОтправительКонтрагентЮридическийАдресПредставление", ОтправительКонтрагентЮридическийАдресПредставление);
	СтруктураДанных.Вставить("ОтправительКонтактноеЛицоТелефонПредставление", ОтправительКонтактноеЛицоТелефонПредставление);
	СтруктураДанных.Вставить("СпособОтгрузки", СпособОтгрузки);
	СтруктураДанных.Вставить("ОтправительАдресПредставление", ОтправительАдресПредставление);
	СтруктураДанных.Вставить("ОтправительАдресЗначение", ОтправительАдресЗначение);
	СтруктураДанных.Вставить("ОтправительГород", ОтправительГород);
	СтруктураДанных.Вставить("ОтправительТерминал", ОтправительТерминал);
	СтруктураДанных.Вставить("ВремяОтгрузкиПредставление", ВремяОтгрузкиПредставление);    
	СтруктураДанных.Вставить("ВремяОтгрузкиОбедПо", ВремяОтгрузкиОбедПо);
	СтруктураДанных.Вставить("ВремяОтгрузкиОбедС", ВремяОтгрузкиОбедС);
	СтруктураДанных.Вставить("ВремяОтгрузкиПо", ВремяОтгрузкиПо);
	СтруктураДанных.Вставить("ВремяОтгрузкиС", ВремяОтгрузкиС);	
	СтруктураДанных.Вставить("ПолучательКонтрагентНаименование", ПолучательКонтрагентНаименование);
	СтруктураДанных.Вставить("ПолучательКонтрагентСсылка", ПолучательКонтрагентСсылка); 
	СтруктураДанных.Вставить("ПолучательКонтрагентИНН", ПолучательКонтрагентИНН);
	СтруктураДанных.Вставить("ПолучательКонтрагентЭтоОрганизация", ПолучательКонтрагентЭтоОрганизация);
    СтруктураДанных.Вставить("ПолучательКонтрагентЮрФизЛицо", ПолучательКонтрагентЮрФизЛицо);
	СтруктураДанных.Вставить("ПолучательКонтактноеЛицоНаименование", ПолучательКонтактноеЛицоНаименование); 
	СтруктураДанных.Вставить("ПолучательКонтрагентЮридическийАдресПредставление", ПолучательКонтрагентЮридическийАдресПредставление);
	СтруктураДанных.Вставить("ПолучательКонтактноеЛицоТелефонПредставление", ПолучательКонтактноеЛицоТелефонПредставление);
	СтруктураДанных.Вставить("СпособДоставки", СпособДоставки);  
	СтруктураДанных.Вставить("ПолучательАдресПредставление", ПолучательАдресПредставление);
	СтруктураДанных.Вставить("ПолучательАдресЗначение", ПолучательАдресЗначение);
	СтруктураДанных.Вставить("ПолучательГород", ПолучательГород);
	СтруктураДанных.Вставить("ПолучательТерминал", ПолучательТерминал); 
	СтруктураДанных.Вставить("ВремяДоставкиПредставление", ВремяДоставкиПредставление);	
	СтруктураДанных.Вставить("ВремяДоставкиОбедПо", ВремяДоставкиОбедПо);
	СтруктураДанных.Вставить("ВремяДоставкиОбедС", ВремяДоставкиОбедС);
	СтруктураДанных.Вставить("ВремяДоставкиПо", ВремяДоставкиПо);
	СтруктураДанных.Вставить("ВремяДоставкиС", ВремяДоставкиС);
	СтруктураДанных.Вставить("ПлательщикРольПредставление", ПлательщикРольПредставление);
	СтруктураДанных.Вставить("ПлательщикРоль", ПлательщикРоль);   
	СтруктураДанных.Вставить("ПлательщикКонтрагентНаименование", ПлательщикКонтрагентНаименование);
	СтруктураДанных.Вставить("ПлательщикКонтрагентСсылка", ПлательщикКонтрагентСсылка); 
	СтруктураДанных.Вставить("ПлательщикКонтрагентИНН", ПлательщикКонтрагентИНН);
	СтруктураДанных.Вставить("ПлательщикКонтрагентЭтоОрганизация", ПлательщикКонтрагентЭтоОрганизация);
    СтруктураДанных.Вставить("ПлательщикКонтрагентЮрФизЛицо", ПлательщикКонтрагентЮрФизЛицо);   
	СтруктураДанных.Вставить("ПлательщикКонтрагентЮридическийАдресПредставление", ПлательщикКонтрагентЮридическийАдресПредставление);
	СтруктураДанных.Вставить("ПлательщикКонтактноеЛицоНаименование", ПлательщикКонтактноеЛицоНаименование);
	СтруктураДанных.Вставить("ПлательщикКонтактноеЛицоТелефонПредставление", ПлательщикКонтактноеЛицоТелефонПредставление);	
	СтруктураДанных.Вставить("ПлательщикСогласиеНаПолучениеЭлектронногоЧека", ПлательщикСогласиеНаПолучениеЭлектронногоЧека);
	СтруктураДанных.Вставить("ПлательщикКонтактноеЛицоEmail", ПлательщикКонтактноеЛицоEmail);
	СтруктураДанных.Вставить("ПлательщикКонтактноеЛицоТелефонДляЧека", ПлательщикКонтактноеЛицоТелефонДляЧека);
	СтруктураДанных.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация); 
	СтруктураДанных.Вставить("ГрузСтоимость", ГрузСтоимость);
	СтруктураДанных.Вставить("СтрахованиеСрокаДоставкиГруза", СтрахованиеСрокаДоставкиГруза);
	СтруктураДанных.Вставить("ХарактерГруза", ХарактерГруза);
	СтруктураДанных.Вставить("ПереключательРасшифровки", ПереключательРасшифровки);
	СтруктураДанных.Вставить("ГрузКоличествоГрузовыхМест", ГрузКоличествоГрузовыхМест);
	СтруктураДанных.Вставить("ГрузВес", ГрузВес); 
	СтруктураДанных.Вставить("ГрузОбъем", ГрузОбъем);
	СтруктураДанных.Вставить("ГрузМаксимальнаяДлина", ГрузМаксимальнаяДлина);
	СтруктураДанных.Вставить("ГрузМаксимальнаяШирина", ГрузМаксимальнаяШирина);
	СтруктураДанных.Вставить("ГрузМаксимальнаяВысота", ГрузМаксимальнаяВысота);
	СтруктураДанных.Вставить("ГрузМаксимальныйВес", ГрузМаксимальныйВес);
	СтруктураДанных.Вставить("ЕдиницаДлина", ЕдиницаДлина);
	СтруктураДанных.Вставить("ЕдиницаШирина", ЕдиницаШирина);
	СтруктураДанных.Вставить("ЕдиницаВысота", ЕдиницаВысота);
	СтруктураДанных.Вставить("ГрузНегабаритныйВес", ГрузНегабаритныйВес);
	СтруктураДанных.Вставить("ГрузНегабаритныйОбъем", ГрузНегабаритныйОбъем); 	
	СтруктураДанных.Вставить("ВидДоставки", ВидДоставки);
	СтруктураДанных.Вставить("ФормаОплатыПредставление", ФормаОплатыПредставление);
	СтруктураДанных.Вставить("МестоОплаты", МестоОплаты);
	СтруктураДанных.Вставить("СопроводительныеДокументы", СопроводительныеДокументы);
	СтруктураДанных.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботы", ОтгрузкаПогрузочноРазгрузочныеРаботы);
	СтруктураДанных.Вставить("ДоставкаПогрузочноРазгрузочныеРаботы", ДоставкаПогрузочноРазгрузочныеРаботы);
	СтруктураДанных.Вставить("ДополнительныеУслугиПлательщик", ДополнительныеУслугиПлательщик);
	СтруктураДанных.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыДоЭтажа", ОтгрузкаПогрузочноРазгрузочныеРаботыДоЭтажа);
	СтруктураДанных.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыЛифт", ОтгрузкаПогрузочноРазгрузочныеРаботыЛифт);
	СтруктураДанных.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса", ОтгрузкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса);
	СтруктураДанных.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыПлательщик", ОтгрузкаПогрузочноРазгрузочныеРаботыПлательщик);
	СтруктураДанных.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыДоЭтажа", ДоставкаПогрузочноРазгрузочныеРаботыДоЭтажа);
	СтруктураДанных.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыЛифт", ДоставкаПогрузочноРазгрузочныеРаботыЛифт);
	СтруктураДанных.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса", ДоставкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса);
	СтруктураДанных.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыПлательщик", ДоставкаПогрузочноРазгрузочныеРаботыПлательщик); 		
	СтруктураДанных.Вставить("ОтправительФиксированноеВремя", ОтправительФиксированноеВремя); 	
	СтруктураДанных.Вставить("ПолучательФиксированноеВремя", ПолучательФиксированноеВремя);	
	СтруктураДанных.Вставить("ОтправительПлательщикРольПредставление", ОтправительПлательщикРольПредставление);
	СтруктураДанных.Вставить("ОтправительПлательщикРоль", ОтправительПлательщикРоль);   
	СтруктураДанных.Вставить("ПолучательПлательщикРольПредставление", ПолучательПлательщикРольПредставление);
	СтруктураДанных.Вставить("ПолучательПлательщикРоль", ПолучательПлательщикРоль);   
	СтруктураДанных.Вставить("ИспользоватьРазличныхПлательщиков", ИспользоватьРазличныхПлательщиков);   
	СтруктураДанных.Вставить("ЗаказчикКонтрагентСсылка", ЗаказчикКонтрагентСсылка);   	
	СтруктураДанных.Вставить("НаложенныйПлатеж", НаложенныйПлатеж);   
	СтруктураДанных.Вставить("НаложенныйПлатежВидОплаты", НаложенныйПлатежВидОплаты);   
	СтруктураДанных.Вставить("НаложенныйПлатежДатаЗаказа", НаложенныйПлатежДатаЗаказа);   
	СтруктураДанных.Вставить("НаложенныйПлатежНомерЗаказа", НаложенныйПлатежНомерЗаказа);   
	СтруктураДанных.Вставить("УпрощеннаяДоставка", УпрощеннаяДоставка); 
	СтруктураДанных.Вставить("ОтправительКонтрагентИностранец", ОтправительКонтрагентИностранец); 
	СтруктураДанных.Вставить("ПолучательКонтрагентИностранец", ПолучательКонтрагентИностранец); 
	СтруктураДанных.Вставить("ПлательщикКонтрагентИностранец", ПлательщикКонтрагентИностранец); 
	СтруктураДанных.Вставить("ОтправительКонтрагентСтрана", ОтправительКонтрагентСтрана); 
	СтруктураДанных.Вставить("ПолучательКонтрагентСтрана", ПолучательКонтрагентСтрана); 
	СтруктураДанных.Вставить("ПлательщикКонтрагентСтрана", ПлательщикКонтрагентСтрана); 
	СтруктураДанных.Вставить("ОтправительКонтрагентОПФ", ОтправительКонтрагентОПФ);
	СтруктураДанных.Вставить("ПолучательКонтрагентОПФ", ПолучательКонтрагентОПФ);
	СтруктураДанных.Вставить("ПлательщикКонтрагентОПФ", ПлательщикКонтрагентОПФ);
	СтруктураДанных.Вставить("ОтправительКонтрагентНомерИностранногоПаспорта", ОтправительКонтрагентНомерИностранногоПаспорта);
	СтруктураДанных.Вставить("ПолучательКонтрагентНомерИностранногоПаспорта", ПолучательКонтрагентНомерИностранногоПаспорта);
	СтруктураДанных.Вставить("ПлательщикКонтрагентНомерИностранногоПаспорта", ПлательщикКонтрагентНомерИностранногоПаспорта);
	СтруктураДанных.Вставить("ОтправительСогласиеНаПолучениеЭлектронногоЧека", ОтправительСогласиеНаПолучениеЭлектронногоЧека);
	СтруктураДанных.Вставить("ОтправительКонтактноеЛицоEmail", ОтправительКонтактноеЛицоEmail);
	СтруктураДанных.Вставить("ОтправительКонтактноеЛицоТелефонДляЧека", ОтправительКонтактноеЛицоТелефонДляЧека);
	СтруктураДанных.Вставить("ПолучательСогласиеНаПолучениеЭлектронногоЧека", ПолучательСогласиеНаПолучениеЭлектронногоЧека);
	СтруктураДанных.Вставить("ПолучательКонтактноеЛицоEmail", ПолучательКонтактноеЛицоEmail);
	СтруктураДанных.Вставить("ПолучательКонтактноеЛицоТелефонДляЧека", ПолучательКонтактноеЛицоТелефонДляЧека);  
	СтруктураДанных.Вставить("УпрощеннаяФормаЗаказа", УпрощеннаяФормаЗаказа); 	   
	СтруктураДанных.Вставить("СопроводительныеДокументыПлательщик", СопроводительныеДокументыПлательщик);
	СтруктураДанных.Вставить("ПолучательРучнойВвод", ПолучательРучнойВвод);
	СтруктураДанных.Вставить("ОтправительРучнойВвод", ОтправительРучнойВвод);
	СтруктураДанных.Вставить("ДоставкаДополнительныеТребованияТС", ДоставкаДополнительныеТребованияТС);
	СтруктураДанных.Вставить("ОтгрузкаДополнительныеТребованияТС", ОтгрузкаДополнительныеТребованияТС);
		
	МассивДополнительныеУслуги = Новый Массив; 
	
	Для Каждого СтрТЗ Из ДополнительныеУслуги Цикл
		
		ЭлементМассива = Новый Структура("Услуга, Использовать, Количество, Наименование");
		ЗаполнитьЗначенияСвойств(ЭлементМассива, СтрТЗ); 
		МассивДополнительныеУслуги.Добавить(ЭлементМассива);	
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("Таблица_ДополнительныеУслуги", МассивДополнительныеУслуги); 	
	
	МассивНаложенныйПлатежТовары = Новый Массив; 
	
	Для Каждого СтрТЗ Из НаложенныйПлатежТовары Цикл
		
		ЭлементМассива = Новый Структура("Номенклатура, Количество, Цена, СтавкаНДС");
		ЗаполнитьЗначенияСвойств(ЭлементМассива, СтрТЗ); 
		МассивНаложенныйПлатежТовары.Добавить(ЭлементМассива);	
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("Таблица_НаложенныйПлатежТовары", МассивНаложенныйПлатежТовары);
		
	Возврат СтруктураДанных;
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	
	Если Шаблон = "ОткрытьВсеШаблоны" Тогда
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина); 	
		ОО = Новый ОписаниеОповещения("ПриВыбореШаблона", ЭтаФорма);
		
		ОткрытьФорму("РегистрСведений.ДЛ_Шаблоны.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  	
		
	ИначеЕсли ЗначениеЗаполнено(Шаблон) Тогда
		
		ЗаполнитьПоШаблонуНаСервере();
		ОбновитьФормуПриВыбореШаблона(); 	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ВосстановитьЗначенияТаблицы(СтруктураДанных, ИмяТаблицы)
	
	Таблица = ЭтаФорма[ИмяТаблицы];
	Таблица.Очистить();
	
	Попытка
		
		МассивЗначений = СтруктураДанных["Таблица_" + ИмяТаблицы]; 
		
	Исключение 
		
		Возврат;
		
	КонецПопытки;	
	
	Для Каждого ЭлементМассива Из МассивЗначений Цикл
		
		НоваяСтрока = Таблица.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура СохранитьЧерновик(Команда)
	
	СтруктураДокумета = СобратьСтруктуруДанныхДляШаблона();	
	СохранитьЧерновикНаСервере(СтруктураДокумета); 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Черновик сохранен в разделе 'Неотправленные заказы'");
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьЧерновикНаСервере(СтруктураДокумета)	 
	
	Записать(); 
	
	МассивДокументовОснований = Новый Массив;
	
	Для Каждого СтрокаДокументыОснования Из Объект.ДокументыОснования Цикл   
		
		МассивДокументовОснований.Добавить(СтрокаДокументыОснования.Документ);
		
	КонецЦикла;
	
	СтруктураДокумета.Вставить("МассивДокументовОснований", МассивДокументовОснований);
	
	ЗаписьРегистра = РегистрыСведений.ДЛ_ДанныеЧерновиков.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Заявка = Объект.Ссылка;
	ЗаписьРегистра.Данные = Новый ХранилищеЗначения(СтруктураДокумета);   
	ЗаписьРегистра.Записать(Истина);	
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьИзЧерновика()
	
	ЗаписьРегистра = РегистрыСведений.ДЛ_ДанныеЧерновиков.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Заявка = Объект.Ссылка;
	ЗаписьРегистра.Прочитать();
	
	Если ЗначениеЗаполнено(ЗаписьРегистра.Заявка) Тогда
		
		СтруктураДокумета = ЗаписьРегистра.Данные.Получить();	
		
		ЗаполнитьДокументПоСтруктуреШаблона(СтруктураДокумета, 0);  
		
		ИзЧерновика = Истина;
		
		Объект.ДокументыОснования.Очистить();
		
		Для Каждого ЭлементМассива Из СтруктураДокумета["МассивДокументовОснований"] Цикл
			
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.Документ = ЭлементМассива;
			
		КонецЦикла;		
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьДляМультизаказа(Команда)
	
	Результат = РасчетИСозданиеЗаказа(, Истина);        
	
	Если Результат.Успешно Тогда
		
		Закрыть();  
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ваш заказ успешно создан и принят в обработку.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительВремяПлановойОтгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	ВремяОтгрузкиС = Неопределено;
	ВремяОтгрузкиПо = Неопределено;
	ВремяОтгрузкиОбедС = Неопределено;
	ВремяОтгрузкиОбедПо = Неопределено;
	ОтправительФиксированноеВремя = Неопределено;  
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательВремяПлановойДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	ВремяДоставкиС = Неопределено;
	ВремяДоставкиПо = Неопределено;
	ВремяДоставкиОбедС = Неопределено;
	ВремяДоставкиОбедПо = Неопределено;
	ПолучательФиксированноеВремя = Неопределено;  
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ИспользоватьРазличныхПлательщиковПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПлательщикРольПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьСписокВыбораРолиПлательщика("Отправитель"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПлательщикРольПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьСписокВыбораРолиПлательщика("Получатель"); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораРолиПлательщика(ИдентификаторРоли)

	СписокВыбора = Новый СписокЗначений;	
	СписокВыбора.Добавить(1, "Совпадает с отправителем");
	СписокВыбора.Добавить(2, "Совпадает с получателем");
	СписокВыбора.Добавить(3, "Третье лицо"); 
	
	ОО = Новый ОписаниеОповещения("ОтправительПолучательПлательщикРольНачалоВыбораЗавершение", ЭтаФорма, ИдентификаторРоли);  
	
	СписокВыбора.ПоказатьВыборЭлемента(ОО, "Выберите роль плательщика");

КонецПроцедуры

&НаКлиенте
Процедура ОтправительПолучательПлательщикРольНачалоВыбораЗавершение(Результат, ИдентификаторРоли) Экспорт
	
	ПлательщикРольСтарое = ЭтаФорма[ИдентификаторРоли + "ПлательщикРоль"];
	
	Если Результат = Неопределено Тогда	
		
		ЭтаФорма[ИдентификаторРоли + "ПлательщикРоль"] = 0;
		ЭтаФорма[ИдентификаторРоли + "ПлательщикРольПредставление"] = ""; 
		
	Иначе  
		
		ЭтаФорма[ИдентификаторРоли + "ПлательщикРоль"]  = Результат.Значение;  
		
		Если ПлательщикРольСтарое <> ЭтаФорма[ИдентификаторРоли + "ПлательщикРоль"] Тогда  
			
			ЭтаФорма[ИдентификаторРоли + "ПлательщикРольПредставление"] = Результат.Представление; 
			
		КонецЕсли;  
		
	КонецЕсли;
	
	Если ПлательщикРольСтарое <> ПлательщикРоль Тогда 
		
		Модифицированность = Истина; 
		
	КонецЕсли; 	
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();	

КонецПроцедуры

&НаКлиенте
Процедура ОтправительПлательщикРольПредставлениеОчистка(Элемент, СтандартнаяОбработка)   
	
	ОчиститьРоль("Отправитель"); 
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПлательщикРольПредставлениеОчистка(Элемент, СтандартнаяОбработка) 
	
	ОчиститьРоль("Получатель");
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРоль(ИдентификаторРоли)

	ЭтаФорма[ИдентификаторРоли + "ПлательщикРоль"] = Неопределено;
	ЭтаФорма[ИдентификаторРоли + "ПлательщикРольПредставление"] = Неопределено; 

КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеГруза()
	
	СтруктураВозврата = Новый Структура;
	
	ГрузМаксимальнаяДлинаМетры = ГрузМаксимальнаяДлина * КоэффициентЕдиницы(ЕдиницаДлина);
	ГрузМаксимальнаяШиринаМетры = ГрузМаксимальнаяШирина * КоэффициентЕдиницы(ЕдиницаШирина);
	ГрузМаксимальнаяВысотаМетры = ГрузМаксимальнаяВысота * КоэффициентЕдиницы(ЕдиницаВысота);
	
	//Проверка на превышение максимальных параметров
	
	ПревышениеДопустимыхПараметров = Ложь;
	ТекстПредупрежденияПревышенияПараметров = "Допустимые параметры: вес — не более 20000 кг, стороны (Д × Ш × В) не превышают 13,5 × 2,42 ×  2,45 м, объем  — не более 80 м^3";
	
	Если ГрузМаксимальнаяДлинаМетры > 13.5 Тогда
		ПревышениеДопустимыхПараметров = Истина;
		ТекстПредупрежденияПревышенияПараметров = ТекстПредупрежденияПревышенияПараметров + Символы.ПС + "Текущая максимальная длина: " + ГрузМаксимальнаяДлинаМетры + " м."
	КонецЕсли;
	
	Если ГрузМаксимальнаяШиринаМетры > 2.42 Тогда
		ПревышениеДопустимыхПараметров = Истина;
		ТекстПредупрежденияПревышенияПараметров = ТекстПредупрежденияПревышенияПараметров + Символы.ПС + "Текущая максимальная ширина: " + ГрузМаксимальнаяШиринаМетры + " м."
	КонецЕсли;
	
	Если ГрузМаксимальнаяВысотаМетры > 2.45 Тогда
		ПревышениеДопустимыхПараметров = Истина;	
		ТекстПредупрежденияПревышенияПараметров = ТекстПредупрежденияПревышенияПараметров + Символы.ПС + "Текущая максимальная высота: " + ГрузМаксимальнаяВысотаМетры + " м."
	КонецЕсли;
	
	Если ГрузВес > 20000 Тогда
		ПревышениеДопустимыхПараметров = Истина;	
		ТекстПредупрежденияПревышенияПараметров = ТекстПредупрежденияПревышенияПараметров + Символы.ПС + "Текущий вес: " + ГрузВес + " кг."
	КонецЕсли;
	
	Если ГрузОбъем > 80 Тогда
		ПревышениеДопустимыхПараметров = Истина;	
		ТекстПредупрежденияПревышенияПараметров = ТекстПредупрежденияПревышенияПараметров + Символы.ПС + "Текущий объем: " + ГрузОбъем + " м^3"
	КонецЕсли;
	
    СтруктураВозврата.Вставить("ПревышениеДопустимыхПараметров",ПревышениеДопустимыхПараметров);
	Если ПревышениеДопустимыхПараметров Тогда
		ТекстПредупрежденияПревышенияПараметров = ТекстПредупрежденияПревышенияПараметров + Символы.ПС + "Параметры груза превышают параметры еврофуры. Для оформления заказа просьба связаться с менеджером по телефону +78124488888";	
   	 	СтруктураВозврата.Вставить("ТекстПредупрежденияПревышенияПараметров",ТекстПредупрежденияПревышенияПараметров);
	КонецЕсли;
	
	//Проверка на малогабаритный груз
	
	ЭтоМалогабаритныйГруз = Ложь;
	ТекстВопросаМалогабаритногоГруза = "";
	//ТекстВопросаМалогабаритногоГруза = "Параметры малогабаритного груза: вес — не более 30 кг, стороны (Д × Ш × В) не превышают 0,54 × 0,39 × 0,39 м, объем  — не более 0,1 м^3";
	
	Если ГрузМаксимальнаяДлинаМетры <= 0.54 и ГрузМаксимальнаяШиринаМетры <= 0.39 и ГрузМаксимальнаяВысотаМетры <= 0.39 и ГрузВес <= 30 и ГрузОбъем <= 0.1  и ГрузКоличествоГрузовыхМест = 1 Тогда
		ЭтоМалогабаритныйГруз = Истина;
		//ТекстВопросаМалогабаритногоГруза = ТекстВопросаМалогабаритногоГруза + Символы.ПС + "Текущие параметры (Д х Ш х В): " + ГрузМаксимальнаяДлинаМетры + " х " +  ГрузМаксимальнаяШиринаМетры + " х " + ГрузМаксимальнаяВысотаМетры
		//+ " м. Вес: " + ГрузВес + " кг. Объем: " + ГрузОбъем + " м^3";
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ЭтоМалогабаритныйГруз",ЭтоМалогабаритныйГруз);	
	
	Если ЭтоМалогабаритныйГруз Тогда
		ТекстВопросаМалогабаритногоГруза = ТекстВопросаМалогабаритногоГруза + Символы.ПС + "Параметры груза соответствуют малогабаритному грузу. Рекомендуем изменить Вид доставки на Малогабаритный груз, чтобы снизить стоимость доставки.Изменить?";	
	    СтруктураВозврата.Вставить("ТекстВопросаМалогабаритногоГруза",ТекстВопросаМалогабаритногоГруза);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ()  

&НаСервере
Процедура УстановитьДоступностьФормы(БлокироватьФорму)

	Элементы.ОформитьЗаказ.Доступность = БлокироватьФорму;   
	Элементы.РазместитьДляМультизаказа.Доступность = БлокироватьФорму;
	//Элементы.ИзменитьЗаказ.Видимость = БлокироватьФорму;
	ЭтаФорма.ТолькоПросмотр = БлокироватьФорму;
	Элементы.ГруппаСтраницы.ТолькоПросмотр = БлокироватьФорму;	

КонецПроцедуры

&НаКлиенте
Процедура ОтправительЗаполнитьАдрес(Команда)

	НачатьЗаполнениеАдреса("Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательЗаполнитьАдрес(Команда)
	
	НачатьЗаполнениеАдреса("Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеАдреса(Префикс)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗаполнениеАдресаПродолжение", ЭтотОбъект, Префикс);
	
	КнопкиВопросаАдреса = Новый СписокЗначений;
	КнопкиВопросаАдреса.Добавить(Префикс);
	КнопкиВопросаАдреса.Добавить("Адресная книга");
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, КнопкиВопросаАдреса); 
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеАдресаЗавершение(Результат,Префикс) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		ТипОтправителяПолучателя = Результат.Значение;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
		ТипОтправителяПолучателя = Результат; 
	Иначе
		ТипОтправителяПолучателя = "";
	КонецЕсли;
	
	ИнформацияОбАдресе = Неопределено;
	СсылкаНаСправочник = ЭтаФорма[Префикс + "КонтрагентСсылка"]; 
	
	Если ТипОтправителяПолучателя = "Контрагент" Или ТипОтправителяПолучателя = "Организация" Тогда
		ИнформацияОбАдресе = ПолучитьИнформациюОбАдресеОтправителяПолучателя(СсылкаНаСправочник);	
	ИначеЕсли ТипОтправителяПолучателя = "Партнер" Тогда
		ПартнерСсылка = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СсылкаНаСправочник, "Партнер");
		ИнформацияОбАдресе = ПолучитьИнформациюОбАдресеОтправителяПолучателя(ПартнерСсылка);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбАдресе) Тогда
		ЭтаФорма[Префикс + "АдресПредставление"] = ИнформацияОбАдресе.Представление;	
		ЭтаФорма[Префикс + "АдресЗначение"] = ИнформацияОбАдресе.Значение;	
	Иначе
		ЭтаФорма[Префикс + "АдресПредставление"] = "";	
		ЭтаФорма[Префикс + "АдресЗначение"] = "";	
	КонецЕсли;
	
	Если Префикс = "Отправитель" Тогда
		СпособОтгрузки = 0;	
	ИначеЕсли Префикс = "Получатель" Тогда	
		СпособДоставки = 0;
	КонецЕсли; 
	
	ЗаполнитьНаселенныйПунктПоАдресу1С(Префикс);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОбАдресеОтправителяПолучателя(Ссылка)

	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ТаблицаАдресов = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка,Перечисления.ТипыКонтактнойИнформации.Адрес,ТекущаяДата(),Ложь);	
		
		Если ТаблицаАдресов.Количество() > 0 Тогда
			
			ИнформацияобАдресе = ПолучитьСтруктуруАдресаОтправителяПолучателя(Ссылка,ТаблицаАдресов);			
			Возврат ИнформацияобАдресе;
			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруАдресаОтправителяПолучателя(Ссылка,ТаблицаАдресов)
	
	ИнформацияОФактическомАдресе = Новый Структура;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ОтборАдреса = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		ИнформацияОФактическомАдресе = НайтиАдресПоОтбору(ТаблицаАдресов,ОтборАдреса);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда
		
		ВидАдресДоставкиСсылка = ПолучитьВидАдресДоставкиПартнера();
		Если ЗначениеЗаполнено(ВидАдресДоставкиСсылка) Тогда
			ОтборАдреса = Новый Структура("Вид",ВидАдресДоставкиСсылка);
			ИнформацияОФактическомАдресе = НайтиАдресПоОтбору(ТаблицаАдресов,ОтборАдреса);

			Если Не ЗначениеЗаполнено(ИнформацияОФактическомАдресе) Тогда
				ОтборАдреса = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресПартнера);
				ИнформацияОФактическомАдресе = НайтиАдресПоОтбору(ТаблицаАдресов,ОтборАдреса);
			КонецЕсли;
			
		Иначе 	
			ОтборАдреса = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресПартнера);
			ИнформацияОФактическомАдресе = НайтиАдресПоОтбору(ТаблицаАдресов,ОтборАдреса);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		ОтборАдреса = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		ИнформацияОФактическомАдресе = НайтиАдресПоОтбору(ТаблицаАдресов,ОтборАдреса);
		
	КонецЕсли;	
	
	Возврат ИнформацияОФактическомАдресе;
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьВидАдресДоставкиПартнера()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Наименование = ""Адрес доставки""
	|	И НЕ ВидыКонтактнойИнформации.ПометкаУдаления
	|	И ВидыКонтактнойИнформации.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель",Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;	
	КонецЕсли;

КонецФункции // ()

&НаСервереБезКонтекста
Функция НайтиАдресПоОтбору(ТаблицаАдресов,ОтборАдреса)

	ИнформацияобАдресе = Неопределено;
	
	ИнформацияОФактическомАдресе = ТаблицаАдресов.НайтиСтроки(ОтборАдреса);
	Если ИнформацияОФактическомАдресе.Количество() > 0 Тогда
		ИнформацияобАдресе = Новый Структура;
		ИнформацияобАдресе.Вставить("Значение",ИнформацияОФактическомАдресе[0].Значение);		
		ИнформацияобАдресе.Вставить("Представление",ИнформацияОФактическомАдресе[0].Представление);		
	КонецЕсли;
	
	//Если фактический адрес у контрагента или организации пуст, подставляем юридический.
	Если Не ЗначениеЗаполнено(ИнформацияобАдресе) или Не ЗначениеЗаполнено(ИнформацияобАдресе.Представление) и 
		(ОтборАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента или ОтборАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации) Тогда
	
		ОтборЮрАдреса = Новый Структура;
		ВидАдреса = ?(ОтборАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ОтборЮрАдреса.Вставить("Вид",ВидАдреса);
		
		ИнформацияОЮрАдресе = ТаблицаАдресов.НайтиСтроки(ОтборЮрАдреса);
		Если ИнформацияОЮрАдресе.Количество() > 0 Тогда
			ИнформацияобАдресе = Новый Структура;
			ИнформацияобАдресе.Вставить("Значение",ИнформацияОЮрАдресе[0].Значение);		
			ИнформацияобАдресе.Вставить("Представление",ИнформацияОЮрАдресе[0].Представление);		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИнформацияобАдресе;
	
КонецФункции // ()

&НаКлиенте
Процедура ОбновитьСписокКонтрагентов(Команда)

	ДЛ_ДеловыеЛинии.ОбновитьСправочникДЛ_Контрагенты();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	УстановитьВидимостьНаложенногоПлатежа(); 
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНаложенногоПлатежа()            
	
	Элементы.НаложенныйПлатеж.Видимость = (НашаРольВПеревозке = "sender") 
		И (ПолучательКонтрагентЮрФизЛицо = 2) 
		И (ПлательщикРоль = 1 Или ПлательщикРоль = 2)
		И (ФормаОплатыПредставление = "cash");
	Элементы.грДекорацииНаложенныйПлатеж.Видимость = Элементы.НаложенныйПлатеж.Видимость;
	Элементы.днГруппаНаложенныПлатеж.Видимость = Элементы.НаложенныйПлатеж.Видимость;
	
	НаложенныйПлатеж = ?(Элементы.НаложенныйПлатеж.Видимость = Ложь, Ложь, НаложенныйПлатеж);	
	
	Элементы.грНаложенныйПлатеж.Видимость = НаложенныйПлатеж;
	
	Если НаложенныйПлатеж Тогда
		
		ПлательщикСогласиеНаПолучениеЭлектронногоЧека = Истина;		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НашаРольВПеревозкеПриИзменении(Элемент)
	
	УстановитьВидимостьНаложенногоПлатежа(); 
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура НаложенныйПлатежПриИзменении(Элемент)
	
	УстановитьВидимостьНаложенногоПлатежа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	КонтактноеЛицоНачалоВыбора(Элемент.Имя);  
	
КонецПроцедуры   

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(ИмяРеквизита) 
	
	ИмяРеквизитаКонтрагента = СтрЗаменить(ИмяРеквизита, "КонтактноеЛицо", "КонтрагентСсылка"); 
	
	ТипКонтрагента = ТипЗнч(ЭтотОбъект[ИмяРеквизитаКонтрагента]); 
	
	ОО = Новый ОписаниеОповещения("ВыборКонтактноеЛицоЗавершение", ЭтаФорма, ИмяРеквизита);
	
	ПараметрыОткрытия = Новый Структура;			
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина); 
	
	Если ТипКонтрагента = Тип("СправочникСсылка.Контрагенты") Тогда		 
		
		ПараметрыОтбора = Новый Структура("Владелец", ДЛ_ДеловыеЛинии.ПолучитьЗначениеРеквизита(ЭтотОбъект[ИмяРеквизитаКонтрагента], "Партнер"));
		
		ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипКонтрагента = Тип("СправочникСсылка.Организации") Тогда 				
		
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСписокКонтактныхЛиц(ИмяРеквизита)
	
	Результат = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]) И ЗначениеЗаполнено(ЭтотОбъект[СтрЗаменить(ИмяРеквизита, "Ссылка", "Наименование")]) 
		И ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита].Партнер) Тогда  		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	НЕ КонтактныеЛицаПартнеров.ПометкаУдаления
		| 	И КонтактныеЛицаПартнеров.Владелец = &Владелец";   
		Запрос.УстановитьПараметр("Владелец", ЭтотОбъект[ИмяРеквизита].Партнер); 
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Результат.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")); 		 		
		
	КонецЕсли; 
	
	Возврат Результат;
	
Конецфункции 

&НаКлиенте
Процедура ВыборКонтактноеЛицоЗавершение(Результат, ИмяРеквизита) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
			
			Результат = Результат.Значение;	
			
		КонецЕсли;	
		
		ЭтотОбъект[ИмяРеквизита + "Наименование"] = СокрЛП(Результат);		
		ЭтотОбъект[ИмяРеквизита + "ТелефонПредставление"] = ПолучитьТелефоныКонтактногоЛица(Результат); 
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьТелефоныКонтактногоЛица(КонтактноеЛицо)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		
		Телефоны = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтактноеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон, ТекущаяДата(), Ложь); 	  
		
		Результат = СтрСоединить(Телефоны.ВыгрузитьКолонку("Представление"), "; ");		 		 		
		
	КонецЕсли; 
	
	Возврат Результат;
	
Конецфункции

&НаКлиенте
Процедура ПолучательКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтактноеЛицоНачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтактноеЛицоНачалоВыбора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УпрощеннаяДоставкаПриИзменении(Элемент)	
	
	ПлательщикРоль = ?(УпрощеннаяДоставка, 2, 0);
	ПлательщикРольПредставление = ?(УпрощеннаяДоставка, "Совпадает с получателем", ""); 
	ОчиститьРеквизит(Элементы.ПлательщикКонтрагент, Ложь);
	ПолучательКонтрагентЮрФизЛицо =  ?(УпрощеннаяДоставка, 2, 0);
	ПолучательКонтрагентНаименование = "";
	ПолучательКонтрагентИНН = ""; 
	ПолучательКонтактноеЛицоТелефонПредставление = "";
	ПолучательКонтрагентСсылка = Неопределено;   	
	ПолучательКонтрагентИностранец = Ложь;
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();   
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьУпрощеннаяДоставка()            
	
	Элементы.ПолучательКонтрагент.Видимость = Не УпрощеннаяДоставка;
	Элементы.ПолучательКонтрагентИНН.Видимость = Не УпрощеннаяДоставка;  	
	Элементы.ПолучательКонтактноеЛицо.Заголовок = ?(УпрощеннаяДоставка, "ФИО", "Контактное лицо");    
	Элементы.ПолучательКонтактноеЛицо.КнопкаВыбора = Не УпрощеннаяДоставка;
	Элементы.ПолучательКонтактноеЛицоТелефон.Маска = ?(УпрощеннаяДоставка, "+7(\999)9999999", ""); 
	Элементы.ПолучательКонтактноеЛицоТелефон.ОтображениеПодсказки = ?(УпрощеннаяДоставка, ОтображениеПодсказки.Нет, ОтображениеПодсказки.Кнопка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьЛогиapiЗапросов(Команда)
	
	ДЛ_ДеловыеЛинииКлиент.ОткрытьЛоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)  	
	
	Если ВидДоставки = "letter" Тогда		
		
		ПереключательРасшифровки = 0;		
		ЕдиницаДлина = "м";
		ЕдиницаШирина = "м"; 
		ЕдиницаВысота = "м"; 
		ГрузМаксимальнаяДлина = 0.3;
		ГрузМаксимальнаяШирина = 0.21;
		ГрузМаксимальнаяВысота = 0.01;
		ГрузВес = 0.5; 
		ГрузСтоимость = 0;
		
		ПересчетВГХПриИзмененииУсловийДоставки();
		ДоступностьЭлементовВГХ(Ложь, Ложь); 
		
	ИначеЕсли ВидДоставки = "small" Тогда
		
		ПереключательРасшифровки = 0; 		
		ЕдиницаДлина = "м";
		ЕдиницаШирина = "м"; 
		ЕдиницаВысота = "м"; 
		ГрузМаксимальнаяДлина = 0.54;
		ГрузМаксимальнаяШирина = 0.39;
		ГрузМаксимальнаяВысота = 0.39;
		ГрузВес = ?(ГрузВес < 0.01, 1, ГрузВес); 
		
		ПересчетВГХПриИзмененииУсловийДоставки();
		ДоступностьЭлементовВГХ(Ложь, Истина); 
		
	Иначе	
			
		ДоступностьЭлементовВГХ(Истина, Истина); 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДоступностьЭлементовВГХ(ЗначениеБлокировки, ЗначениеБлокировки2) 
	
	Элементы.ПереключательРасшифровки.Доступность = ЗначениеБлокировки;
	Элементы.ГрузОдноМестоВес.Доступность = ЗначениеБлокировки;
	Элементы.ГрузОдноМестоДлина.Доступность = ЗначениеБлокировки; 
	Элементы.ЕдиницаДлинаОдноМесто.Доступность = ЗначениеБлокировки;
	Элементы.ГрузОдноМестоШирина.Доступность = ЗначениеБлокировки;
	Элементы.ЕдиницаШиринаОдноМесто.Доступность = ЗначениеБлокировки;
	Элементы.ГрузОдноМестоВысота.Доступность = ЗначениеБлокировки;
	Элементы.ЕдиницаВысотаОдноМесто.Доступность = ЗначениеБлокировки;
	Элементы.ГрузОдноМестоВес.Доступность = ЗначениеБлокировки2; 
	Элементы.СуммаОбъявленнойЦенности.Доступность = ЗначениеБлокировки2;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВГХПоДокументамОснованиям(СпособГруппировкиТоваров)   
	
	ТаблицаТовары = ИнициализироватьТаблицуТоваров(); 	
	
	Для Каждого Документ Из Объект.ДокументыОснования Цикл
		
		Если ЗначениеЗаполнено(Документ.Документ) Тогда
		
			ДополнитьТаблицуТоваровПоДокументуОснованию(ТаблицаТовары, Документ.Документ);		
			
		КонецЕсли;		
		
	КонецЦикла;	 
	
	Если ТаблицаТовары.Количество() > 0 Тогда
		
		ГрузВес = ТаблицаТовары.Итог("Вес");
		
		Если СпособГруппировкиТоваров = 1 Тогда
			
			ПереключательРасшифровки = 0;
			ГрузКоличествоГрузовыхМест = 1; 
			ГрузМаксимальныйВес = ГрузВес;
			
		Иначе	
			
			ГрузКоличествоГрузовыхМест = ?(СпособГруппировкиТоваров = 2, ТаблицаТовары.Количество(), ТаблицаТовары.Итог("Количество"));
			ПереключательРасшифровки = ?(ГрузКоличествоГрузовыхМест > 1, 1, 0); 			
			ТаблицаТовары.Сортировать("Вес Убыв"); 
			ГрузМаксимальныйВес = ТаблицаТовары[0].Вес;
			
		КонецЕсли; 		
		
		ГрузОбъем = ТаблицаТовары.Итог("Объем");
		ГрузСтоимость = ТаблицаТовары.Итог("Стоимость");  	
		ТаблицаТовары.Сортировать("Длина Убыв"); 
		ГрузМаксимальнаяДлина = ТаблицаТовары[0].Длина;
		ЕдиницаДлина = "м"; 		
		ТаблицаТовары.Сортировать("Ширина Убыв"); 
		ГрузМаксимальнаяШирина = ТаблицаТовары[0].Ширина;
		ЕдиницаШирина = "м";		
		ТаблицаТовары.Сортировать("Высота Убыв"); 
		ГрузМаксимальнаяВысота = ТаблицаТовары[0].Высота;
		ЕдиницаВысота = "м"; 
		
		ГрузНегабаритныйВес = 0;
		ГрузНегабаритныйОбъем = 0;
		
		Для Каждого СтрокаТовар Из ТаблицаТовары Цикл
			
			Если СтрокаТовар.Длина > 3 Или СтрокаТовар.Ширина > 3  Или СтрокаТовар.Высота > 3 Или СтрокаТовар.Вес > 800 Тогда
				
				ГрузНегабаритныйВес = ГрузНегабаритныйВес + СтрокаТовар.Вес;
				ГрузНегабаритныйОбъем = ГрузНегабаритныйОбъем + СтрокаТовар.Объем;
				
			КонецЕсли;
			
		КонецЦикла; 			
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнициализироватьТаблицуТоваров() 
	
	Строка250 = ОбщегоНазначения.ОписаниеТипаСтрока(250);
	Число15_3 = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3); 
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Товар", Строка250);
	Результат.Колонки.Добавить("Количество", Число15_3);
	Результат.Колонки.Добавить("Длина", Число15_3);
	Результат.Колонки.Добавить("Ширина", Число15_3);
	Результат.Колонки.Добавить("Высота", Число15_3); 
	Результат.Колонки.Добавить("Объем", Число15_3);
	Результат.Колонки.Добавить("Вес", Число15_3);
	Результат.Колонки.Добавить("Стоимость", Число15_3);
	
	Возврат Результат;
	
КонецФункции  

&НаСервереБезКонтекста
Процедура ДополнитьТаблицуТоваровПоДокументуОснованию(ТаблицаТовары, Документ)
		
	ДокументОбъект = Документ.ПолучитьОбъект();	
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	ИмяДокумента = МетаданныеОбъекта.Имя; 
	
	МинВГХ = ПолучитьМинимальныеЗначенияВГХ();
	
	Если ИмяДокумента = "ВозвратТоваровПоставщику" 
		Или ИмяДокумента = "ЗаказКлиента"
		Или ИмяДокумента = "РеализацияТоваровУслуг"
		Или ИмяДокумента = "ЗаказПоставщику"
		Или ИмяДокумента = "ЗаявкаНаВозвратТоваровОтКлиента"
		Или ИмяДокумента = "ПриобретениеТоваровУслуг"
		Или ИмяДокумента = "ПоступлениеТоваровНаСклад"
		Или ИмяДокумента = "ЗаказНаПеремещение"
		Или ИмяДокумента = "КорректировкаРеализации"
		Или ИмяДокумента = "КорректировкаПриобретения"
		Или ИмяДокумента = "РасходныйОрдерНаТовары" 
		Или ИмяДокумента = "ПриходныйОрдерНаТовары"
		Или ИмяДокумента = "ПеремещениеТоваров" Тогда
		
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Ссылка", Документ); 
		Запрос.УстановитьПараметр("ЗаполненаЕдиницаИзмеренияВеса",   ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить()));
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаТоваров.Ссылка КАК Ссылка, 
		|	ТаблицаТоваров.Номенклатура.Наименование КАК Товар,
		|	ТаблицаТоваров.Количество КАК Количество, 
		|	ТаблицаТоваров.Количество * &ТекстЗапросаВес КАК МассаНетто,
		|	ВЫБОР
		|		КОГДА &ЗаполненаЕдиницаИзмеренияВеса
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL 
		|						ТОГДА ТаблицаТоваров.Количество * &ТекстЗапросаВес1
		|					ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок * &ТекстЗапросаВес1
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Вес,
		|	ТаблицаТоваров.Упаковка.Глубина КАК Длина,
		|	ТаблицаТоваров.Упаковка.Ширина КАК Ширина,
		|	ТаблицаТоваров.Упаковка.Высота КАК Высота,
		|	ТаблицаТоваров.Количество * &ТекстЗапросаОбъем КАК Объем,
		|	ТаблицаТоваров.СуммаСНДС КАК Стоимость
		|ИЗ
		|	Документ.&Документ.Товары КАК ТаблицаТоваров
		|ГДЕ
		|   ТаблицаТоваров.Ссылка = &Ссылка
		|	И  ТаблицаТоваров.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И  ТаблицаТоваров.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";
		
		Если ИмяДокумента = "ЗаказНаПеремещение"
			Или ИмяДокумента = "ПеремещениеТоваров" 
			Или ИмяДокумента = "ПриходныйОрдерНаТовары"	Тогда	
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваров.СуммаСНДС", "0");
			
		ИначеЕсли ИмяДокумента = "КорректировкаРеализации" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.&Документ.Товары", "Документ.&Документ.Расхождения");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваров.Ссылка = &Ссылка", "ТаблицаТоваров.Ссылка = &Ссылка
				|И (ТаблицаТоваров.ВариантОтражения = ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализацию) 
				|ИЛИ ТаблицаТоваров.ВариантОтражения = ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации))");
			
		ИначеЕсли ИмяДокумента = "КорректировкаПриобретения" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.&Документ.Товары", "Документ.&Документ.Расхождения");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваров.Ссылка = &Ссылка", "ТаблицаТоваров.Ссылка = &Ссылка
				|И (ТаблицаТоваров.ВариантОтражения = ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУменьшитьСкладскиеОстатки) 
				|ИЛИ ТаблицаТоваров.ВариантОтражения = ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУчестьПриИнвентаризации))");
			
		ИначеЕсли ИмяДокумента = "РасходныйОрдерНаТовары" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.&Документ.Товары", "Документ.&Документ.ОтгружаемыеТовары");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваров.СуммаСНДС", "0");
			
		ИначеЕсли ИмяДокумента = "ЗаявкаНаВозвратТоваровОтКлиента" Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.&Документ.Товары", "Документ.&Документ.ВозвращаемыеТовары");	
			
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", ИмяДокумента);	
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ТекстЗапросаВес1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
				"ТаблицаТоваров.Упаковка",
				"ТаблицаТоваров.Номенклатура"));	
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ТекстЗапросаВес",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
				"ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения",
				"ТаблицаТоваров.Номенклатура"));
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ТекстЗапросаОбъем",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
				"ТаблицаТоваров.Упаковка",
				"ТаблицаТоваров.Номенклатура")); 		
			
	ИначеЕсли ИмяДокумента = "ТранспортнаяНакладная" Тогда 
		
		Для Каждого ДокументОснованиеТН Из Документ.ДокументыОснования Цикл
			
			ДополнитьТаблицуТоваровПоДокументуОснованию(ТаблицаТовары, ДокументОснованиеТН.ДокументОснование);	
			
		КонецЦикла;   
		
		Возврат;
		
	Иначе
		
		Возврат;			
		
	КонецЕсли; 
	
	ПересчитыватьВалютуДокумента = Ложь;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", МетаданныеОбъекта) Тогда  		
		
		ВалютаРегламентированногоУчета 	= ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		Если Документ.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			СтруктурыКурсов = ВзаиморасчетыСервер.КурсыВалютДляПересчета(
				ДокументОбъект, 
				Документ.Валюта, 
				ВалютаРегламентированногоУчета, 
				ВалютаРегламентированногоУчета, 
				Документ.Дата);
			
			ПересчитыватьВалютуДокумента = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаТовара = ТаблицаТовары.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаТовара, Выборка);
		СтрокаТовара.Стоимость = Макс(СтрокаТовара.Стоимость, - СтрокаТовара.Стоимость);
		
		Если ПересчитыватьВалютуДокумента Тогда
			
			СтрокаТовара.Стоимость = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(
				СтрокаТовара.Стоимость,
				СтруктурыКурсов.СтруктураКурсовСтаройВалюты,
				СтруктурыКурсов.СтруктураКурсовНовойВалюты);
			
		КонецЕсли;
		
		НезаполненныеХарактеристики = Новый Массив;  
		
		Если Не ЗначениеЗаполнено(Выборка.Длина) Тогда 
			
			СтрокаТовара.Длина = МинВГХ.МинимальнаяДлина;
			
			НезаполненныеХарактеристики.Добавить("Глубина/Длина");
			
		КонецЕсли;  
		
		Если Не ЗначениеЗаполнено(Выборка.Ширина) Тогда 
			
			СтрокаТовара.Ширина = МинВГХ.МинимальнаяШирина;
			
			НезаполненныеХарактеристики.Добавить("Ширина");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Высота) Тогда  
			
			СтрокаТовара.Высота = МинВГХ.МинимальнаяВысота;
			
			НезаполненныеХарактеристики.Добавить("Высота");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Объем) Тогда 
			
			СтрокаТовара.Объем = МинВГХ.МинимальныйОбъем;
			
			НезаполненныеХарактеристики.Добавить("Объем");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Вес) Тогда  
			
			СтрокаТовара.Вес = МинВГХ.МинимальныйВес;
			
			НезаполненныеХарактеристики.Добавить("Вес"); 				
			
		КонецЕсли; 			
		
		Если НезаполненныеХарактеристики.Количество() Тогда
			
			СтрокаСообщения = СтрШаблон("⚠ В документе %1 не заполнены ВГХ (%2) для позиции: %3. Будут использованы Значения по умолчанию.",
				Документ,
				СтрСоединить(НезаполненныеХарактеристики, ", "),
				Выборка.Товар);
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);	
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры  

&НаКлиенте
Процедура ПерезаполнитьВГХ_ОдноМесто(Команда)	
	
	ЗаполнитьВГХПоДокументамОснованиям(1);	
	
	ПереключательРасшифровкиПриИзменении(Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьВГХ_ПоСтроке(Команда)
	
	ЗаполнитьВГХПоДокументамОснованиям(2);	
	
	ПереключательРасшифровкиПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьВГХ_КоличествоВСтроке(Команда) 
		
	ЗаполнитьВГХПоДокументамОснованиям(3);	
	
	ПереключательРасшифровкиПриИзменении(Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентИностранецПриИзменении(Элемент)	
	
	КонтрагентИностранецПриИзменении("Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентИностранецПриИзменении(Элемент)	
	
	КонтрагентИностранецПриИзменении("Получатель"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентИностранецПриИзменении(Элемент)  
	
	КонтрагентИностранецПриИзменении("Плательщик"); 	
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентИностранецПриИзменении(Префикс)
	
	КонтрагентИностранец = ЭтаФорма[Префикс + "КонтрагентИностранец"];
	ЭтоФизЛицо = ЭтаФорма[Префикс + "КонтрагентЮрФизЛицо"] = 2;
	
	Элементы[Префикс + "КонтрагентСтрана"].Видимость = КонтрагентИностранец И ЭтоФизЛицо;
	Элементы[Префикс + "КонтрагентОПФ"].Видимость = КонтрагентИностранец И Не ЭтоФизЛицо;
	Элементы[Префикс + "КонтрагентНомерИностранногоПаспорта"].Видимость = КонтрагентИностранец И ЭтоФизЛицо;
	
	Если Не КонтрагентИностранец И (Префикс = "Плательщик" Или ЭтаФорма[Префикс + "РучнойВвод"] = 0) Тогда
		
		ЭтаФорма[Префикс + "КонтрагентСтрана"] = Неопределено;
		ЭтаФорма[Префикс + "КонтрагентОПФ"] = Неопределено;
		ЭтаФорма[Префикс + "КонтрагентНомерИностранногоПаспорта"] = "";
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентСтранаНачалоВыбора(Префикс, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь; 
	
	ОО = Новый ОписаниеОповещения("КонтрагентСтранаНачалоВыбораЗавершение", ЭтаФорма, Префикс);
	
	ОткрытьФорму("Справочник.ДЛ_Страны.Форма.ФормаВыбораСтрана",, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентСтранаНачалоВыбораЗавершение(Результат, Префикс) Экспорт  	 
	
	Если Результат <> Неопределено Тогда 	
		
		ЭтаФорма[Префикс + "КонтрагентОПФ"] = Результат;
		ЭтаФорма[Префикс + "КонтрагентСтрана"] = ПолучитьСтрануПоОПФ(Результат);
		
		УстановитьМаскуПаспорта(Префикс);
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьСтрануПоОПФ(ОПФ) 
	
	Возврат Справочники.ДЛ_Страны.НайтиПоРеквизиту("UID", ОПФ.СтранаUID); 
	
КонецФункции

&НаКлиенте
Процедура ПолучательКонтрагентСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КонтрагентСтранаНачалоВыбора("Получатель", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КонтрагентСтранаНачалоВыбора("Отправитель", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КонтрагентСтранаНачалоВыбора("Плательщик", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительАдресОчистка(Элемент, СтандартнаяОбработка)
	
	ОтправительАдресЗначение = "";
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательАдресОчистка(Элемент, СтандартнаяОбработка)
	
	ПолучательАдресЗначение = "";
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ОтправительКонтрагентОПФ = Неопределено;
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ПолучательКонтрагентОПФ = Неопределено;
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ПлательщикКонтрагентОПФ = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервичноРезультатПредрсчета()
	
	ВерхнийУровень = РезультатПредрасчета.ПолучитьЭлементы();
	
	ВидДоставки = "auto";
	
	Элемент = ВерхнийУровень.Добавить();	 
	Элемент.ИД = "express";
	Элемент.Представление = "Экспресс-перевозка";
	Элемент.ВерхнийУровень = Истина;
	Элемент = ВерхнийУровень.Добавить(); 
	Элемент.ИД = "auto";
	Элемент.Представление = "Автоперевозка"; 
	Элемент.ВерхнийУровень = Истина; 
	Элемент.Выбрано = Истина;
	Элемент = ВерхнийУровень.Добавить();	 
	Элемент.ИД = "avia";
	Элемент.Представление = "Авиаперевозка";
	Элемент.ВерхнийУровень = Истина;
	Элемент = ВерхнийУровень.Добавить();	
	Элемент.ИД = "letter";
	Элемент.Представление = "Доставка документов";
	Элемент.ВерхнийУровень = Истина;
	Элемент = ВерхнийУровень.Добавить();	
	Элемент.ИД = "small";
	Элемент.Представление = "Доставка малогабаритного груза"; 
	Элемент.ВерхнийУровень = Истина; 	 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРезультатПедрасчета()
	
	ВерхнийУровень = РезультатПредрасчета.ПолучитьЭлементы();
	
	Для Каждого ЭлементВерхнегоУровня Из ВерхнийУровень Цикл
		
		ЭлементВерхнегоУровня.Сумма = ""; 		
		ВторойУровень = ЭлементВерхнегоУровня.ПолучитьЭлементы();
		ВторойУровень.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуРезультатаВыбранногоВидаДоставки(СтрокиРезультата, ДанныеЗапроса) 
	
	Если ДанныеЗапроса["intercity"] <> Неопределено Тогда 
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["intercity"], "Автоперевозка"); 	
		
	КонецЕсли;   
	
	Если ДанныеЗапроса["small"] <> Неопределено Тогда 
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["small"], "Малогабаритный груз");		
		
	КонецЕсли;
	
	Если ДанныеЗапроса["air"] <> Неопределено Тогда	
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["air"], "Авиаперевозка");
				
	КонецЕсли; 
	
	Если ДанныеЗапроса["express"] <> Неопределено Тогда	
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["express"], "Экспресс-перевозка");
		
	КонецЕсли; 
	
	Если ДанныеЗапроса["letter"] <> Неопределено Тогда  
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["letter"], "Письмо");
		
	КонецЕсли;
	
	Если ДанныеЗапроса["derival"] <> Неопределено Тогда	
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["derival"], "Доставка от отправителя");
		
	КонецЕсли;  
	
	Если ДанныеЗапроса["arrival"] <> Неопределено Тогда	
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["arrival"], "Доставка до получателя");
		
	КонецЕсли;
	
	Если ДанныеЗапроса["accompanyingDocuments"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["accompanyingDocuments"]["send"] <> Неопределено Тогда				 
			
			ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["accompanyingDocuments"]["send"], "Отправка сопроводительных документов");
			
		КонецЕсли;
		
		Если ДанныеЗапроса["accompanyingDocuments"]["return"] <> Неопределено Тогда 			 
			
			ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["accompanyingDocuments"]["return"], "Возврат сопроводительных документов");
						
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ДанныеЗапроса["notify"] <> Неопределено Тогда		 
		
		ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса["notify"], "Услуга 'Информация о статусе заказа'");
		
	КонецЕсли;
	
	Если ДанныеЗапроса["packages"] <> Неопределено Тогда 
		
		Цена = 0;
		Скидка = 0;
		Наценка = 0;
		
		Для Каждого Упаковка Из ДанныеЗапроса["packages"] Цикл 						
			 
			Если НЕ Упаковка.Значение["contractPrice"] Тогда								  			
				
				Цена = Цена + Упаковка.Значение["price"]; 				
				Наценка = Наценка + ПолучитьСуммуСкидокНаценокПоМассиву(Упаковка.Значение["premiumDetails"]);
				Скидка = Скидка + ПолучитьСуммуСкидокНаценокПоМассиву(Упаковка.Значение["discountDetails"]); 			
				
			КонецЕсли;    
			
		КонецЦикла;
		
		Если Цена > 0 Тогда	
			
			СтрокаРезультата = ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРезультата, "		Упаковка", СтрокаСумма(Цена));			 
			
			Если Наценка > 0 Или Скидка > 0 Тогда
				
				СтрокиРасшифровки = СтрокаРезультата.ПолучитьЭлементы();
				
				БазоваяЦена = Цена + Скидка - Наценка;	
				
				Если БазоваяЦена <> Цена Тогда
					
					ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРасшифровки, "			Базовая стоимость", СтрокаСумма(БазоваяЦена));	
					
				КонецЕсли;   
				
				Если Скидка > 0 Тогда
					
					ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРасшифровки, "			Скидка", СтрокаСумма(- Скидка));	
					
				КонецЕсли;
				
				Если Наценка > 0 Тогда
					
					ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРасшифровки, "			Надбавка", СтрокаСумма(Наценка));	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДанныеЗапроса["insurance"]) Тогда 
		
		ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРезультата, "		Страховка", СтрокаСумма(ДанныеЗапроса["insurance"]));				
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПредварительныйРасчетЗавершение()
	
	РезультатЗапроса = ПолучитьИзВременногоХранилища(АдресРезультатаПредварительногоРасчета);
	
	ОбработатьРезультатРасчетаИСозданияЗаказа(РезультатЗапроса, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьГотовностьПредварительногоРасчета()  
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		
		ОтключитьОбработчикОжидания("ПроверитьГотовностьПредварительногоРасчета");
		
		Возврат;
		
	КонецЕсли;
	
	Если ПроверкаФоновогоЗаданияНаСервере() Тогда 		
		
		Элементы.кнОбновлениеДанных.Видимость = Ложь; 
		Элементы.кнОбновитьДанныеПредрасчета.Видимость = Истина; 
		
		Элементы.РезультатПредрасчета.Развернуть(ВидДоставкиДеревоИдентификатор, Ложь);
		
		УправлениеДоступностьюОтправкиЗаказа();
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ОтменитьФоновыйПроцесс() 
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Задание.Отменить();	
	
КонецПроцедуры  

&НаСервере
Функция ПроверкаФоновогоЗаданияНаСервере()  
	
	Результат = Истина;
		
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);	
	
	Если Задание = Неопределено Тогда 
		
		ИдентификаторЗадания = Неопределено;	
		
	Иначе	
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда 			  
			
			ПредварительныйРасчетЗавершение(); 
			
			ИдентификаторЗадания = Неопределено;
			
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			
			Результат = Ложь;  
			
		Иначе
			
			ИдентификаторЗадания = Неопределено;
			
			УстановитьВидимостьЭлементовПриОшибкеПредварительногоРасчета();						  
			
			Элементы.днОшибкиПредрасчета.Заголовок = "• Ошибка получения данных. Повторите попытку.";
			
		КонецЕсли;						
	
	КонецЕсли;

	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция СтрокаСумма(Сумма)
	
	Возврат "" + Сумма + " ₽ ";  
	
КонецФункции   

&НаКлиенте
Процедура УправлениеДоступностьюОтправкиЗаказа()
	
	Элементы.ГруппаРазмещениеЗаказа.Доступность = ДоступностьОтправкиЗаказа = 2;
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗаблокироватьОтправкуЗаказа() 
	
	ДоступностьОтправкиЗаказа = 0;
	
	УправлениеДоступностьюОтправкиЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПредрасчетаВыбраноПриИзменении(Элемент)  
	
	ТекущаяСтрока = Элемент.Родитель.ТекущиеДанные; 
	
	Если ТекущаяСтрока.Выбрано Тогда
		
		ВидДоставки = ТекущаяСтрока.ИД;
		
		ОбновитьВыбранныеВидыДоставки(); 
		ВидДоставкиПриИзменении(Неопределено);
		
		ПредварительныйРасчет(Неопределено);		
		
	Иначе  	
		
		ТекущаяСтрока.Выбрано = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВыбранныеВидыДоставки()
	
	ВерхнийУровень = РезультатПредрасчета.ПолучитьЭлементы();	
	
	Для Каждого СтрокаРезультатПредрасчета Из ВерхнийУровень Цикл
		
		Если СтрокаРезультатПредрасчета.ИД <> ВидДоставки И СтрокаРезультатПредрасчета.Выбрано Тогда
			
			СтрокаРезультатПредрасчета.Выбрано = Ложь;
			
		ИначеЕсли СтрокаРезультатПредрасчета.ИД = ВидДоставки И Не СтрокаРезультатПредрасчета.Выбрано Тогда	
			
			СтрокаРезультатПредрасчета.Выбрано = Истина;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьЭлементовПриОшибкеПредварительногоРасчета()
	
	Элементы.ГруппаПредрасчетОшибки.Видимость = Истина;	 
	Элементы.ГруппаГрафикПеревозки.Видимость = Ложь;
	Элементы.ГруппаНайденныеАдреса.Видимость = Ложь;  
	Элементы.ГруппаРазмещениеЗаказа.Видимость = Ложь;
			
КонецПроцедуры

&НаКлиенте
Процедура РезультатПредрасчетаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПредрасчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НашаРольВПеревозкеОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьВидимостьНаложенногоПлатежа(); 
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентОПФПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентСтранаПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентСтранаПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентОПФПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ОтправительТерминалОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДЛ_ПолучательТерминалОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура длНаложенныйПлатежВидОплатыПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура длНаложенныйПлатежВидОплатыОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоОплатыПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоОплатыОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительДатаПлановойОтгрузкиПриИзменении(Элемент)	
	
	ЗаблокироватьОтправкуЗаказа();  
	
	Сегодня = НачалоДня(ТекущаяДата()); 
	
	Если ДатаОтгрузки < Сегодня Тогда
		
		ДатаОтгрузки = Сегодня;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата отгрузки не может меньше текущей");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительДатаПлановойОтгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаОбъявленнойЦенностиОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоДлинаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоШиринаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоВысотаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальнаяДлинаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальнаяШиринаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальнаяВысотаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузМаксимальныйВесОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОбщийОбъемОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОбщийВесОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузКоличествоГрузовыхМестОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузОдноМестоВесОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузКоличествоГрузовыхМестПриИзменении(Элемент)
	
	РассчитатьОбщиеВГХНесколькихМест();
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузНегабаритныйВесПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузНегабаритныйВесОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузНегабаритныйОбъемПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузНегабаритныйОбъемОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
	Элементы.СопроводительныеДокументыПлательщик.ТолькоПросмотр = Не ЗначениеЗаполнено(СопроводительныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа();
	
	Элементы.СопроводительныеДокументыПлательщик.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаДополнительныеТребованияПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
	ДополнительныеТребованияЗаблокироватьНесовместимыеПоля("Отгрузка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаДополнительныеТребованияПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа();
	
	ДополнительныеТребованияЗаблокироватьНесовместимыеПоля("Доставка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеУслугиПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыДоЭтажаПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыДоЭтажаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыЛифтПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыРасстояниеПроносаПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыРасстояниеПроносаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыДоЭтажаПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыДоЭтажаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыЛифтПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыРасстояниеПроносаПриИзменении(Элемент)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыРасстояниеПроносаОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхЗаглушка(Команда)
	
	//Заглушка
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВидовДоставки()       	
	
	ДоступностьМелкихГрузов = СпособОтгрузки = 0 И СпособДоставки = 0 И ПереключательРасшифровки = 0;    
	
	ПереключитьНаАвтодоставку = Ложь;
	
	ВерхнийУровень = РезультатПредрасчета.ПолучитьЭлементы(); 	
	
	Для Каждого СтрокаДоставки Из ВерхнийУровень Цикл  
		
		Если СтрокаДоставки.ИД = "letter" Или СтрокаДоставки.ИД = "small" Тогда  
			
			СтрокаДоставки.Заблокировано = Не ДоступностьМелкихГрузов;
			
			Если СтрокаДоставки.Выбрано Тогда
				
				СтрокаДоставки.Выбрано = Ложь;
				ПереключитьНаАвтодоставку = Истина;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаДоставки.ИД = "auto" Тогда 	
			
			СтрокаАвтодоставки = СтрокаДоставки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПереключитьНаАвтодоставку Тогда
		
		ВидДоставки = "auto";
		СтрокаАвтодоставки.Выбрано = Истина;
		
		ВидДоставкиПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияНегабаритныйГруз(Команда)
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ПараметрыНегабаритногоГруза");
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикСогласиеНаПолучениеЭлектронногоЧекаПриИзменении(Элемент)
	
	ВидимостьАдресовЭлектронногоЧека("Плательщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьАдресовЭлектронногоЧека(Префикс)
	
	Элементы[Префикс + "КонтактноеЛицоEmail"].Видимость = ЭтаФорма[Префикс + "СогласиеНаПолучениеЭлектронногоЧека"]; 
	Элементы[Префикс + "КонтактноеЛицоТелефонДляЧека"].Видимость = ЭтаФорма[Префикс + "СогласиеНаПолучениеЭлектронногоЧека"];
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительСогласиеНаПолучениеЭлектронногоЧекаПриИзменении(Элемент)
	
	ВидимостьАдресовЭлектронногоЧека("Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательСогласиеНаПолучениеЭлектронногоЧекаПриИзменении(Элемент)
	
	ВидимостьАдресовЭлектронногоЧека("Получатель");
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеТребованияЗаблокироватьНесовместимыеПоля(Префикс) 
	
	ТЗ_ДополнительныеТребования = ЭтотОбъект[Префикс + "ДополнительныеТребования"]; 
	                                     
	ТЗ = ТЗ_ДополнительныеТребования.Выгрузить();
	ТЗ.ЗаполнитьЗначения(Ложь, "Заблокировано");
	ТЗ_ДополнительныеТребования.Загрузить(ТЗ);	
	
	Для Каждого СтрТЗ Из ТЗ_ДополнительныеТребования Цикл 
		
		Если СтрТЗ.Использовать Тогда
			
			Для Каждого Несовместимость Из СтрТЗ.ДополнительноеТребование.Несовместимость Цикл
				
				Для Каждого СтрТЗ_Блокировка Из ТЗ_ДополнительныеТребования Цикл		
					
					Если СтрТЗ_Блокировка.ДополнительноеТребование.UID = Несовместимость.UID Тогда
						
						СтрТЗ_Блокировка.Заблокировано = Истина;	
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПовернутьГруз(Команда)
	
	СтараяДлина = ГрузМаксимальнаяДлина;
	СтараяДлинаЕдиница = ЕдиницаДлина; 
	ГрузМаксимальнаяДлина = ГрузМаксимальнаяВысота;
	ЕдиницаДлина = ЕдиницаВысота;	
	ГрузМаксимальнаяВысота = ГрузМаксимальнаяШирина;
	ЕдиницаВысота = ЕдиницаШирина;	
	ГрузМаксимальнаяШирина =  СтараяДлина;
	ЕдиницаШирина = СтараяДлинаЕдиница;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСписокПоследнихШаблонов() 
	
	Элементы.Шаблон.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	|	ДЛ_Шаблоны.Автор КАК Автор,
	|	ДЛ_Шаблоны.ДатаСоздания КАК ДатаСоздания,
	|	ДЛ_Шаблоны.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ДЛ_Шаблоны КАК ДЛ_Шаблоны
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДЛ_Шаблоны.ДатаИспользования УБЫВ";   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		Элементы.Шаблон.СписокВыбора.Добавить(СформироватьКлючШаблонаСтрокой(Выборка), СтрШаблон("%1 Дата создания: %2", Выборка.Наименование, Выборка.ДатаСоздания));
		
	КонецЦикла;
	
	Элементы.Шаблон.СписокВыбора.Добавить("ОткрытьВсеШаблоны", "--- Открыть все шаблоны ---");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()	
	
	УпрощеннаяФормаЗаказа = Ложь;
	
	ЗаполнитьПоКлючуШаблона(ПолучитьСтруктуруКлючаШаблона(Шаблон));	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКлючуШаблона(СтруктураКлюча) 
	
	ШаблонРегистра = РегистрыСведений.ДЛ_Шаблоны.СоздатьМенеджерЗаписи();
	ШаблонРегистра.Автор = СтруктураКлюча.Автор;
	ШаблонРегистра.ДатаСоздания = СтруктураКлюча.ДатаСоздания;
	ШаблонРегистра.Прочитать();   
	
	СтруктураДокумета = ШаблонРегистра.Данные.Получить();
	
	Если ЗначениеЗаполнено(СтруктураДокумета) Тогда
	
		ЗаполнитьДокументПоСтруктуреШаблона(СтруктураДокумета, ШаблонРегистра.СпособЗаполнения);
		
	КонецЕсли;
	
	ШаблонРегистра.ДатаИспользования = ТекущаяДатаСеанса();
	ШаблонРегистра.Записать(Истина);
	
	ЗаполнитьСписокПоследнихШаблонов();  			
		
	Шаблон = СформироватьКлючШаблонаСтрокой(СтруктураКлюча);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументПоСтруктуреШаблона(СтруктураШаблона, СпособЗаполнения)  	
	
	Если СпособЗаполнения = 0 Тогда 
	
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураШаблона);
		ВосстановитьЗначенияТаблицы(СтруктураШаблона, "ДополнительныеУслуги");
		ВосстановитьЗначенияТаблицы(СтруктураШаблона, "ДоставкаДополнительныеТребования");
		ВосстановитьЗначенияТаблицы(СтруктураШаблона, "ОтгрузкаДополнительныеТребования");
		ВосстановитьЗначенияТаблицы(СтруктураШаблона, "НаложенныйПлатежТовары");
		
	ИначеЕсли СпособЗаполнения = 1 Тогда 
		
		Для Каждого ЭлементШаблона Из СтруктураШаблона Цикл  
			
			Если Лев(ЭлементШаблона.Ключ, 8) = "Таблица_" Тогда
				
				ИмяТаблицы = СтрЗаменить(ЭлементШаблона.Ключ, "Таблица_", "");
				
				Если Не ЭтоТаблицаСДанными(ЭтаФорма, ИмяТаблицы) Тогда  
					
					ВосстановитьЗначенияТаблицы(СтруктураШаблона, ИмяТаблицы);
					
				КонецЕсли;
				
			ИначеЕсли Не ЗначениеЗаполнено(ЭтаФорма[ЭлементШаблона.Ключ]) Тогда 
				
				ЭтаФорма[ЭлементШаблона.Ключ] = ЭлементШаблона.Значение;	
				
			КонецЕсли;		
			
		КонецЦикла;
		
	ИначеЕсли СпособЗаполнения = 2 Тогда
		
		Для Каждого ЭлементШаблона Из СтруктураШаблона Цикл 
			
			Если Лев(ЭлементШаблона.Ключ, 8) = "Таблица_" Тогда				
				
				Если ЭтоТаблицаСДанными(СтруктураШаблона, ЭлементШаблона.Ключ) Тогда  
					
					ВосстановитьЗначенияТаблицы(СтруктураШаблона, СтрЗаменить(ЭлементШаблона.Ключ, "Таблица_", ""));
					
				КонецЕсли; 
				
			ИначеЕсли ЗначениеЗаполнено(ЭлементШаблона.Значение) Тогда 
				
				ЭтаФорма[ЭлементШаблона.Ключ] = ЭлементШаблона.Значение;	
				
			КонецЕсли; 	
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриВыбореШаблона(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Возврат;
		
	КонецЕсли; 	
	
	ЗаполнитьПоКлючуШаблона(Результат); 	
		
	ОбновитьФормуПриВыбореШаблона();
	
	ШаблонПриИзменении(Неопределено);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьФормуПриВыбореШаблона() 
		
	УстановитьВидимостьДоступностьНаСтраницеОсновная();  
	УстановитьВидимостьДоступностьГруппыВГХ();
	ВидДоставкиПриИзменении(Неопределено);
	ПогрузочноРазгрузочныеРаботыПриИзменении(Неопределено);
	ДоставкаПогрузочноРазгрузочныеРаботыПриИзменении(Неопределено);
	ДополнительныеТребованияЗаблокироватьНесовместимыеПоля("Отгрузка");
	ДополнительныеТребованияЗаблокироватьНесовместимыеПоля("Доставка");
	УстановитьВидимостьРучнойВводКонтрагентов("Отправитель");
	УстановитьВидимостьРучнойВводКонтрагентов("Получатель");
	
	ОбновитьВыбранныеВидыДоставки(); 
	
	Если Не ФайловыйВариант Тогда
		
		ПредварительныйРасчет(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры 
                                    
&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Шаблон) Тогда 
		
		Элементы.ЗаполнитьПоШаблону.Видимость = Ложь;  
		Элементы.Шаблон.КнопкаОткрытия = Ложь;
		
	ИначеЕсли Шаблон = "ОткрытьВсеШаблоны" Тогда
		
		Элементы.ЗаполнитьПоШаблону.Видимость = Истина;
		Элементы.ЗаполнитьПоШаблону.Заголовок = "Открыть"; 
		Элементы.Шаблон.КнопкаОткрытия = Ложь;
		
	Иначе 
		
		Элементы.ЗаполнитьПоШаблону.Видимость = Истина; 
		Элементы.ЗаполнитьПоШаблону.Заголовок = "Заполнить";
		Элементы.Шаблон.КнопкаОткрытия = Истина;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ШаблонОчистка(Элемент, СтандартнаяОбработка)
	
	ШаблонПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ЭтоТаблицаСДанными(Источник, ИмяТаблицы)
	
	Результат = Ложь;
	
	Если ИмяТаблицы = "НаложенныйПлатежТовары" Тогда
		
		Результат = Источник[ИмяТаблицы].Количество() > 0;
		
	Иначе 
		
		Для Каждого СтрокаДанных Из Источник[ИмяТаблицы] Цикл
			
			Если СтрокаДанных["Использовать"] = Истина Тогда
				
				Результат = Истина;
				
				Прервать;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции    

&НаКлиенте
Процедура ШаблонОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураКлюча = ПолучитьСтруктуруКлючаШаблона(Шаблон); 	
	ПарметрыОткрытия = Новый Структура("Ключ", СтруктураКлюча.КлючЗаписи);
	
	ОткрытьФорму("РегистрСведений.ДЛ_Шаблоны.ФормаЗаписи", ПарметрыОткрытия);
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруКлючаШаблона(Шаблон)
	
	Результат = Новый Структура("Автор, ДатаСоздания");
	
	СтруктураКлюча = ДЛ_ДеловыеЛинии.ДесериализоватьСтруктуруПараметров(Шаблон);  
	
	Результат.Автор = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураКлюча["Автор"]));
	Результат.ДатаСоздания = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(СтруктураКлюча["ДатаСоздания"]); 
	
	КлючЗаписи = РегистрыСведений.ДЛ_Шаблоны.СоздатьКлючЗаписи(Результат);
	
	Результат.Вставить("КлючЗаписи", КлючЗаписи);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СформироватьКлючШаблонаСтрокой(ДанныеШаблона)	
	
	СтруктураКлюча = Новый Структура; 
	СтруктураКлюча.Вставить("Автор", XMLСтрока(ДанныеШаблона.Автор));
	СтруктураКлюча.Вставить("ДатаСоздания", ДанныеШаблона.ДатаСоздания);
	
	Возврат ДЛ_ДеловыеЛинии.СериализоватьСтруктуруПараметров(СтруктураКлюча);
	
КонецФункции

&НаКлиенте
Процедура УпрощеннаяФормаЗаказаПриИзменении(Элемент)
	
	Если УпрощеннаяФормаЗаказа Тогда
		
		СпособОтгрузки = 1;	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При оформлении заказа из упрощенной формы, стоимость перевозки будет объявлена после замера груза на терминале"); 
		
	Иначе
		
		ПереключательРасшифровкиПриИзменении(Неопределено);	
		
	КонецЕсли;  
	
	УстановитьВидимостьДоступностьНаСтраницеОсновная();
	ЗаблокироватьОтправкуЗаказа(); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовУпрощеннаяФормаЗаказа()  
	
	Элементы.СпособОтгрузки.Доступность = Не УпрощеннаяФормаЗаказа;		
	Элементы.днВГХ.Видимость = Не УпрощеннаяФормаЗаказа;
	Элементы.ГруппаПерезаполнитьПоОснованиям.Видимость = Не УпрощеннаяФормаЗаказа;	
	Элементы.ГруппаВГХ.Видимость = Не УпрощеннаяФормаЗаказа; 
	Элементы.ГруппаНегабаритныеМеста.Видимость = Не УпрощеннаяФормаЗаказа;	
	Элементы.ДекорацияВалютаСтоимостиГруза.Видимость = Не УпрощеннаяФормаЗаказа;
	Элементы.КоличествоГрузовыхМест.Видимость = УпрощеннаяФормаЗаказа;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМинимальныеЗначенияВГХ()
	
	Результат = Новый Структура;
	
	МинимальнаяДлина = Константы.ДЛ_МинимальнаяДлина.Получить();
	Результат.Вставить("МинимальнаяДлина", ?(ЗначениеЗаполнено(МинимальнаяДлина), МинимальнаяДлина, 0.1)); 
	МинимальнаяШирина = Константы.ДЛ_МинимальнаяШирина.Получить();
	Результат.Вставить("МинимальнаяШирина", ?(ЗначениеЗаполнено(МинимальнаяШирина), МинимальнаяШирина, 0.1));
	МинимальнаяВысота = Константы.ДЛ_МинимальнаяВысота.Получить();
	Результат.Вставить("МинимальнаяВысота", ?(ЗначениеЗаполнено(МинимальнаяВысота), МинимальнаяВысота, 0.1));
	МинимальныйОбъем = Константы.ДЛ_МинимальныйОбъем.Получить();
	Результат.Вставить("МинимальныйОбъем", ?(ЗначениеЗаполнено(МинимальныйОбъем), МинимальныйОбъем, 0.01));
	МинимальныйВес = Константы.ДЛ_МинимальныйВес.Получить();  
	Результат.Вставить("МинимальныйВес", ?(ЗначениеЗаполнено(МинимальныйВес), МинимальныйВес, 1));	
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура ПерейтиОсновное(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновное;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиГруз(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыГруза;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПлательщик(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаПлательщик;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиУслуги(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДополнительныеУслуги;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиям(Команда)	
	
	ЗаполнитьПоДокументамОснованиям(); 
	ПереключательРасшифровкиПриИзменении(Неопределено);
	
	Элементы.грОснования.Скрыть();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ заполнен успешно");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТерминалПоУмолчанию(ЭтоОтправка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДЛ_Терминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДЛ_Терминалы КАК ДЛ_Терминалы
	|ГДЕ
	|	НЕ ДЛ_Терминалы.ПометкаУдаления
	|	И ДЛ_Терминалы.Город = &Город
	|	И ДЛ_Терминалы.Выдача
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДЛ_Терминалы.ПоУмолчанию УБЫВ";
	Запрос.УстановитьПараметр("Город", ?(ЭтоОтправка, ОтправительГород, ПолучательГород));  
	
	Если ЭтоОтправка Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Выдача", "Приемка"); 
		
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат ПолучитьТерминалПоиском(ЭтоОтправка);
		
	Иначе
		
		Возврат Результат.Выгрузить()[0].Ссылка;
		
	КонецЕсли;	
	
КонецФункции   

&НаКлиенте
Процедура ГородПриИзменении(Префикс) 
	
	ГородЗаполнен = ЗначениеЗаполнено(ЭтаФорма[Префикс + "Город"]);
	
	Если ГородЗаполнен И ЗначениеЗаполнено(ЭтаФорма[Префикс + "Терминал"]) Тогда
		
		ПроверитьНеобходимостьОчисткиТерминала(Префикс);	
		
	КонецЕсли;   
	
	ЭтоОтправка = (Префикс = "Отправитель");
	
	Способ = ?(ЭтоОтправка, СпособОтгрузки, СпособДоставки);
	
	Если ГородЗаполнен Тогда
	
		ТерминалПоУмолчанию = ПолучитьТерминалПоУмолчанию(ЭтоОтправка); 		
		
		Если ЗначениеЗаполнено(ТерминалПоУмолчанию)  Тогда  
			
			ЭтаФорма[Префикс + "Терминал"] = ТерминалПоУмолчанию;
			
		ИначеЕсли Способ = 1 Тогда    
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В выбранном населенном пункте нет доступных терминалов"); 				
			
		КонецЕсли;
		
		АдресПоАдреснойКниге = ПолучитьАдресПоАдреснойКниге(Префикс);
		
		Если ЗначениеЗаполнено(АдресПоАдреснойКниге) Тогда
			
			ЭтаФорма[Префикс + "АдресПредставление"] = АдресПоАдреснойКниге;	
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетВГХПриИзмененииУсловийДоставки()
	
	УстановитьВидимостьДоступностьГруппыВГХ();	
	
	ГрузКоличествоГрузовыхМестДо = ГрузКоличествоГрузовыхМест;
	ГрузКоличествоГрузовыхМест = ?(ПереключательРасшифровки = 0, 1, Макс(ГрузКоличествоГрузовыхМест, 2));	
	ГрузОбъемДо = ГрузОбъем; 
	
	РассчитатьОбъем();	
	РассчитатьВес(); 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрВнутреннийНомерЗаказа()
	
	Результат = Новый Массив;	
	Результат.Добавить(Новый Структура("orderNumber", НаложенныйПлатежНомерЗаказа));  
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтправительАдресПриИзменении(Элемент)
	
	ОтправительАдресЗначение = ""; 
	
	ПодключитьОбработчикОжидания("СкрытьГруппаОтправительАдресПодсказки", 0.2, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательАдресПриИзменении(Элемент)
	
	ПолучательАдресЗначение = "";
	
	ПодключитьОбработчикОжидания("СкрытьГруппаПолучательАдресПодсказки", 0.2, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительАдресИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	АдресИзменениеТекстаРедактирования("Отправитель", Текст);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательАдресИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	АдресИзменениеТекстаРедактирования("Получатель", Текст);	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресИзменениеТекстаРедактирования(Префикс, Текст)
	
	Если Текст = ЭтаФорма[Префикс + "АдресПредставление"] Тогда  
		
		Элементы["Группа" + Префикс + "АдресПодсказки"].Видимость = Ложь;  
		
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма[Префикс + "Город"]) И СтрДлина(Текст) > 2 Тогда		
		
		АдресИзменениеТекстаРедактированияНаСервере(Префикс, Текст);			
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура АдресИзменениеТекстаРедактированияНаСервере(Префикс, Текст)  	
	
	МассивНаУдаление = Новый Массив;   
	
	ГруппаПодсказки = Элементы["Группа" + Префикс + "АдресПодсказки"];
	
	Для Каждого Элемент Из ГруппаПодсказки.ПодчиненныеЭлементы Цикл 
		
		МассивНаУдаление.Добавить(Элемент); 
		
	КонецЦикла;  
	
	Для Каждого Элемент Из МассивНаУдаление Цикл
		
		Элементы.Удалить(Элемент);
		
	КонецЦикла;      
	
	Если СервисПодсказокНеПодключен Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ГруппаПодсказки.Видимость = Истина;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("appKey");
	СтруктураЗапроса.Вставить("sessionID");  
	СтруктураЗапроса.Вставить("query", Текст);
	СтруктураЗапроса.Вставить("mode", "raw"); 
	СтруктураЗапроса.Вставить("count", 5);
	СтруктураЗапроса.Вставить("city_code", ЭтаФорма[Префикс + "Город"].КодКЛАДР);  
	
	ДанныеАдресов = ДЛ_ДеловыеЛинии.ПолучитьПодсказкиПоискаАдреса(СтруктураЗапроса); 
	
	МассивАдресов = Новый Массив;
	
	Если ДанныеАдресов["suggestions"] <> Неопределено Тогда
	
		Для Каждого СтруктураАдреса Из ДанныеАдресов["suggestions"] Цикл
			
			МассивАдресов.Добавить(СтруктураАдреса["value"]);	
			
		КонецЦикла;
		
	ИначеЕсли ДанныеАдресов["error"] <> Неопределено 
		И ДанныеАдресов["error"]["description"] = "Отсутствует доступ к методу. Обратитесь в техническую поддержку." Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует доступ к методу получения подсказок ручного ввода адреса. Обратитесь в техническую поддержку.");
		
		СервисПодсказокНеПодключен = Истина;	
		
	КонецЕсли;   
	
	Для Каждого НайденныйАдрес Из МассивАдресов цикл         
		
		ИндексЭлемента = МассивАдресов.Найти(НайденныйАдрес);  
		
		ИмяКоманды = Префикс + "ЗаполнениеАдресаПоПодсказке" + ИндексЭлемента; 
		
		НоваяКоманда = Команды.Найти(ИмяКоманды);  
		
		Если НоваяКоманда = Неопределено Тогда 
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "ЗаполнениеАдресаПоПодсказке"; 	
			
		КонецЕсли; 
		
		НоваяКоманда.Заголовок = НайденныйАдрес;
		
		НовыйЭлемент = Элементы.Добавить("Кнопка" + Префикс + "Подсказка" + ИндексЭлемента, Тип("КнопкаФормы"), ГруппаПодсказки);
		НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
		НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;		
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнениеАдресаПоПодсказке(Команда) 
	
	КонецПрефикса = СтрНайти(Команда.Имя, "ЗаполнениеАдресаПоПодсказке") - 1;
	Префикс = Лев(Команда.Имя, КонецПрефикса);
	
	ЭтаФорма[Префикс + "АдресПредставление"] = ПолучитьЗаголовокКоманды(Команда.Имя);	
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЗаголовокКоманды(ИмяКоманды) 
	
	Команда = Команды.Найти(ИмяКоманды);
	
	Возврат Команда.Заголовок;	
	
КонецФункции

&НаКлиенте
Процедура СкрытьГруппаПолучательАдресПодсказки()
	
	Элементы.ГруппаПолучательАдресПодсказки.Видимость = Ложь;	
	
КонецПроцедуры  

&НаКлиенте
Процедура СкрытьГруппаОтправительАдресПодсказки()
	
	Элементы.ГруппаОтправительАдресПодсказки.Видимость = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаселенныйПунктПоАдресу1С(Префикс)
	
	Адрес1С = ЭтаФорма[Префикс + "АдресЗначение"];
	
	Если ЗначениеЗаполнено(Адрес1С) Тогда 
		
		СтруктураАдреса = ДЛ_ДеловыеЛинии.ДесериализоватьСтруктуруПараметров(Адрес1С); 
		
		ИмяГорода = "";
		
		Если ЗначениеЗаполнено(СтруктураАдреса["locality"]) Тогда 
			
			ИмяГорода = СтруктураАдреса["locality"]; 
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураАдреса["city"]) Тогда 
			
			ИмяГорода = СтруктураАдреса["city"];
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураАдреса["area"]) Тогда 
			
			ИмяГорода = СтруктураАдреса["area"];	
			
		КонецЕсли;		                                           
		
		Если ЗначениеЗаполнено(ИмяГорода) Тогда
			
			НаселенныйПункт = ПолучитьНаселенныйПункт(ИмяГорода);	
			
			Если ЗначениеЗаполнено(НаселенныйПункт) Тогда
				
				ЭтаФорма[Префикс + "Город"] = НаселенныйПункт;			
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма[Префикс + "Город"]) Тогда
		
		ГородПриИзменении(Префикс);	
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьНаселенныйПункт(ИмяГорода) 
	
	Возврат Справочники.ДЛ_Города.НайтиПоНаименованию(ИмяГорода, Истина);	
	
КонецФункции

&НаКлиенте
Процедура ОтправительКонтрагентОчистка(Элемент, СтандартнаяОбработка)
	
	КонтрагентОчистка("Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентОчистка(Элемент, СтандартнаяОбработка)
	
	КонтрагентОчистка("Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикКонтрагентОчистка(Элемент, СтандартнаяОбработка)
	
	ПлательщикКонтрагентИНН = "";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымСуществующегоЗаказа(СтруктураЗаказа) 
	
	ДанныеЗаказа = СтруктураЗаказа["orders"][0]; 	
	
	ЗаполнитьДанныеУчастникаПеревозкиПоСуществующемуЗаказу("Отправитель", ПолучитьСекциюДанныхУчастникаПеревозкиСуществующегоЗаказа(ДанныеЗаказа, "sender"));
	ЗаполнитьДанныеУчастникаПеревозкиПоСуществующемуЗаказу("Получатель", ПолучитьСекциюДанныхУчастникаПеревозкиСуществующегоЗаказа(ДанныеЗаказа, "receiver"));
	ЗаполнитьДанныеУчастникаПеревозкиПоСуществующемуЗаказу("Плательщик", ПолучитьСекциюДанныхУчастникаПеревозкиСуществующегоЗаказа(ДанныеЗаказа, "payer")); 
	ЗаполнитьДанныеКонтактногоЛицаПеревозкиПоСуществующемуЗаказу("Отправитель", ДанныеЗаказа["sender"]);
	ЗаполнитьДанныеКонтактногоЛицаПеревозкиПоСуществующемуЗаказу("Получатель", ДанныеЗаказа["receiver"]);
	ЗаполнитьДанныеКонтактногоЛицаПеревозкиПоСуществующемуЗаказу("Плательщик", ДанныеЗаказа["payer"]);
	ЗаполнитьАдресПоСуществующемуЗаказу("Отправитель", ДанныеЗаказа["derival"]);
	ЗаполнитьАдресПоСуществующемуЗаказу("Получатель", ДанныеЗаказа["arrival"]); 
	ЗаполнитьГрузПоСуществующемуЗаказу(ДанныеЗаказа["freight"]);
	
	Если (ЗначениеЗаполнено(ОтправительКонтрагентИНН) И ОтправительКонтрагентИНН = ПлательщикКонтрагентИНН)
		Или (ОтправительКонтрагентНомерИностранногоПаспорта <> "~" И ОтправительКонтрагентНомерИностранногоПаспорта = ПлательщикКонтрагентНомерИностранногоПаспорта) Тогда 
		
		ПлательщикРоль = 1;
		ПлательщикРольПредставление = "Совпадает с отправителем";   
		
	ИначеЕсли (ЗначениеЗаполнено(ПолучательКонтрагентИНН) И ПолучательКонтрагентИНН = ПлательщикКонтрагентИНН)
		Или (ПолучательКонтрагентНомерИностранногоПаспорта <> "~" И ПолучательКонтрагентНомерИностранногоПаспорта = ПлательщикКонтрагентНомерИностранногоПаспорта) Тогда 
		
		ПлательщикРоль = 2;
		ПлательщикРольПредставление = "Совпадает с получателем";	
		
	Иначе
		
		ПлательщикРоль = 3;
		ПлательщикРольПредставление = "Третье лицо";
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДанныеУчастникаПеревозкиПоСуществующемуЗаказу(Префикс, СтруктураУчастника)
	
	ЭтаФорма[Префикс + "КонтрагентНаименование"] = СтруктураУчастника["name"];
	ЭтаФорма[Префикс + "КонтрагентИНН"] = СтруктураУчастника["inn"]; 
	ЭтаФорма[Префикс + "КонтрагентЮрФизЛицо"] = ?(СтруктураУчастника["isPhysical"] = Истина, 2, 1);
	ЭтаФорма[Префикс + "КонтрагентНомерИностранногоПаспорта"] = СокрЛП(СтруктураУчастника["documentSeries"]) + "~" + СокрЛП(СтруктураУчастника["documentNumber"]); 	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьАдресПоСуществующемуЗаказу(Префикс, СтруктураАдреса)
	
	ЭтаФорма[Префикс + "Город"] = Справочники.ДЛ_Города.НайтиПоРеквизиту("КодКЛАДР", СтруктураАдреса["cityCode"]);
	
	Если СтруктураАдреса["address"] = СтруктураАдреса["terminalAddress"] Тогда 
		
		ИмяРеквизитаСпособа = ?(Префикс = "Отправитель", "СпособОтгрузки", "СпособДоставки"); 
		
		ЭтаФорма[ИмяРеквизитаСпособа] = 1; 
		ЭтаФорма[Префикс + "Терминал"] = Справочники.ДЛ_Терминалы.НайтиПоРеквизиту("ИДтерминала", Строка(СтруктураАдреса["terminalId"]));
		
	Иначе
		
		ЭтаФорма[Префикс + "АдресПредставление"] = СтруктураАдреса["address"];	
				
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьГрузПоСуществующемуЗаказу(СтруктураГруза)
	
	Если СтруктураГруза["name"] <> Неопределено Тогда
	
		ХарактерГруза = Справочники.ДЛ_ХарактерГруза.НайтиПоНаименованию(СтруктураГруза["name"]); 
		
	КонецЕсли;
	
	ЕдиницаДлина = "м";
	ЕдиницаШирина = "м"; 
	ЕдиницаВысота = "м";
	
	МинВГХ = ПолучитьМинимальныеЗначенияВГХ();
	
	ГрузКоличествоГрузовыхМест = СтруктураГруза["places"];
	ПереключательРасшифровки = ?(ГрузКоличествоГрузовыхМест > 1, 1, 0);	
	ГрузВес = ?(СтруктураГруза["weight"] = Неопределено, 0, Число(СтруктураГруза["weight"])); 
	ГрузВес = ?(ГрузВес = 0, МинВГХ.МинимальныйВес, ГрузВес); 
	ГрузОбъем = ?(СтруктураГруза["volume"] = Неопределено, 0, Число(СтруктураГруза["volume"])); 
	ГрузОбъем = ?(ГрузОбъем = 0, МинВГХ.МинимальныйОбъем, ГрузОбъем);
	ГрузМаксимальнаяДлина = ?(СтруктураГруза["length"] = Неопределено, 0, Число(СтруктураГруза["length"])); 
	ГрузМаксимальнаяДлина = ?(ГрузМаксимальнаяДлина = 0, МинВГХ.МинимальнаяДлина, ГрузМаксимальнаяДлина);
	ГрузМаксимальнаяШирина = ?(СтруктураГруза["width"] = Неопределено, 0, Число(СтруктураГруза["width"])); 
	ГрузМаксимальнаяШирина = ?(ГрузМаксимальнаяШирина = 0, МинВГХ.МинимальнаяШирина, ГрузМаксимальнаяШирина);
	ГрузМаксимальнаяВысота = ?(СтруктураГруза["height"] = Неопределено, 0, Число(СтруктураГруза["height"])); 
	ГрузМаксимальнаяВысота = ?(ГрузМаксимальнаяВысота = 0, МинВГХ.МинимальнаяВысота, ГрузМаксимальнаяВысота);	
	ГрузНегабаритныйВес = ?(СтруктураГруза["oversizedWeight"] = Неопределено, 0, Число(СтруктураГруза["oversizedWeight"]));
	ГрузНегабаритныйОбъем = ?(СтруктураГруза["oversizedVolume"] = Неопределено, 0, Число(СтруктураГруза["oversizedVolume"]));
	
КонецПроцедуры  

&НаСервере
Процедура ОтправитьМетрикуРазмещенияЗаказа(НомерЗаказа) 	  
	
	ПараметрыВерсии = ДЛ_ДеловыеЛинииПовтИсп.ПолучитьПараметрыТекцущейВерсии();
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	СтруктураАтрибутов = Новый Структура;
	СтруктураАтрибутов.Вставить("extensionType", ПараметрыВерсии.Идентификатор);
	СтруктураАтрибутов.Вставить("extensionVersion", ПараметрыВерсии.Версия);
	СтруктураАтрибутов.Вставить("platformVersion", СистемнаяИнформация.ВерсияПриложения);
	СтруктураАтрибутов.Вставить("configurationVersion", Метаданные.Версия);
	СтруктураАтрибутов.Вставить("configurationName", Метаданные.Имя);
	СтруктураАтрибутов.Вставить("requestID", НомерЗаказа);
	СтруктураАтрибутов.Вставить("timeOrderSending", ВремяРазмещенияЗаказа - ВремяОткрытияФормы);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey");
	СтруктураПараметров.Вставить("sessionID");
	СтруктураПараметров.Вставить("source", "dellin_1c_extension"); 
	СтруктураПараметров.Вставить("timestamp", Формат(ТекущаяДатаСеанса(), "ДФ='гггг-ММ-дд чч:мм:сс'"));
	СтруктураПараметров.Вставить("category", "order");
	СтруктураПараметров.Вставить("action", "form_order_opened");
	СтруктураПараметров.Вставить("label");
	СтруктураПараметров.Вставить("customAttributes", СтруктураАтрибутов);
	
	ДЛ_ДеловыеЛинии.ОтправитьМетрки(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОдинаковыеМестаПриИзменении(Элемент)
	
	Элементы.ГрузОбщийВес.ТолькоПросмотр = ОдинаковыеМеста;
	Элементы.ГрузОбщийОбъем.ТолькоПросмотр = ОдинаковыеМеста;
	
	РассчитатьОбщиеВГХНесколькихМест();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбщиеВГХНесколькихМест() 
	
	Если ОдинаковыеМеста Тогда
		
		ГрузВес = ГрузМаксимальныйВес * ГрузКоличествоГрузовыхМест;
		ГрузОбъем = ГрузКоличествоГрузовыхМест * 
			ГрузМаксимальнаяВысота * КоэффициентЕдиницы(ЕдиницаВысота) *
			ГрузМаксимальнаяДлина * КоэффициентЕдиницы(ЕдиницаДлина) *
			ГрузМаксимальнаяШирина * КоэффициентЕдиницы(ЕдиницаШирина);			
		ГрузОбъем = Макс(ГрузОбъем, 0.01);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСекциюДанныхУчастникаПеревозкиСуществующегоЗаказа(ДанныеЗаказа, ИмяСекции) 
	
	ДанныеИзЗаказа = ДанныеЗаказа[ИмяСекции]; 
	
	Результат = ДанныеИзЗаказа;
	
	ДанныеДокументов = ДанныеЗаказа["documents"];
	
	Если ДанныеДокументов <> Неопределено И ДанныеДокументов.Количество() > 0 Тогда
		
		ДанныеИзНакладной = ДанныеДокументов[0][ИмяСекции];
		
		Если ДанныеИзНакладной <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(ДанныеИзНакладной["inn"]) И Не ЗначениеЗаполнено(ДанныеИзЗаказа["inn"]) 
				Или ЗначениеЗаполнено(ДанныеИзНакладной["documentSeries"]) И Не ЗначениеЗаполнено(ДанныеИзЗаказа["documentSeries"])
				Или ЗначениеЗаполнено(ДанныеИзНакладной["documentNumber"]) И Не ЗначениеЗаполнено(ДанныеИзЗаказа["documentNumber"]) Тогда
				
				Результат = ДанныеИзНакладной;	
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура РезультатПредрасчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РезультатПредрасчетаПредставление" Тогда
		
		Если СокрЛП(Элемент.ТекущиеДанные.Представление) = "Страховка" Тогда	
			
			МассивСтрок=Новый Массив;
			МассивСтрок.Добавить("Об услуге и условиях ее изменения ");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Подробнее", , , ,"https://www.dellin.ru/insurance/"));		
			
			ПоказатьВопрос(Новый ОписаниеОповещения(), Новый ФорматированнаяСтрока(МассивСтрок), РежимДиалогаВопрос.ОК); 
			
		ИначеЕсли СокрЛП(Элемент.ТекущиеДанные.Представление) = "Услуга 'Информация о статусе заказа'" Тогда 
			
			СтрокаИнформации = "Когда груз прибудет в пункт назначения, мы уведомим получателя звонком, в sms или сообщением на email.
			|Изменить способ оповещения можно в личном кабинете.
			|Стоимость услуги фиксированная и не зависит от маршрута и параметров груза.";
			
			ПоказатьВопрос(Новый ОписаниеОповещения(), СтрокаИнформации, РежимДиалогаВопрос.ОК);	
			
		КонецЕсли; 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКонтактногоЛицаПеревозкиПоСуществующемуЗаказу(Префикс, СтруктураУчастника)	
	 
	ЭтаФорма[Префикс + "КонтактноеЛицоНаименование"] = СтруктураУчастника["contacts"];
	ЭтаФорма[Префикс + "КонтактноеЛицоТелефонПредставление"] = ?(СтруктураУчастника["phones"] = Неопределено, "", СтрЗаменить(СтруктураУчастника["phones"], ",", ";"));
	
	Если Префикс = "Получатель" И СтруктураУчастника["anonym"] = Истина Тогда
		
		ПолучательКонтактноеЛицоТелефонПредставление = СтруктураУчастника["anonymPhone"]; 		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуОшибок(Ошибки)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("fields"); 
	Результат.Колонки.Добавить("title");
	Результат.Колонки.Добавить("detail");
	
	ТерминалОтправленияНеНайден = Ложь;
	ТерминалПолученияНеНайден = Ложь;
	
	Для Каждого ОшибкаИзРезультата Из Ошибки Цикл
		
		Если ОшибкаИзРезультата["title"] = "Выбранная дата недоступна" 
			И ОшибкаИзРезультата["detail"] = "Невозможно проверить дату заказа" 
			И (ТерминалПолученияНеНайден Или ТерминалОтправленияНеНайден) Тогда
			
			Продолжить; 
			
		ИначеЕсли ТипЗнч(ОшибкаИзРезультата["fields"]) = Тип("Массив") И ОшибкаИзРезультата["fields"].Количество() > 0 Тогда
			
			Если  ОшибкаИзРезультата["fields"][0] = "delivery.derival.terminalID" Или ОшибкаИзРезультата["fields"][0] = "delivery.derival.address.search" Тогда
				
				ТерминалОтправленияНеНайден = Истина;	
				
			ИначеЕсли ТерминалОтправленияНеНайден И ОшибкаИзРезультата["fields"][0] = "delivery.derival.variant" Тогда  
				
				Продолжить;	
				
			ИначеЕсли ОшибкаИзРезультата["fields"][0] = "delivery.arrival.terminalID"  Или ОшибкаИзРезультата["fields"][0] = "delivery.arrival.address.search" Тогда 
				
				ТерминалПолученияНеНайден = Истина;  
				
			ИначеЕсли ТерминалПолученияНеНайден И ОшибкаИзРезультата["fields"][0] = "delivery.arrival.variant" Тогда  
				
				Продолжить;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОшибкаЗапроса = Результат.Добавить();
		ОшибкаЗапроса.title = ОшибкаИзРезультата["title"];  
		ОшибкаЗапроса.detail = ОшибкаИзРезультата["detail"];  
		ОшибкаЗапроса.fields = ОшибкаИзРезультата["fields"];
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СохранитьАдресаВАдреснуюКнигу()
	
	Если СпособОтгрузки = 0 Тогда 
		
		СохранитьАдресВАдреснуюКнигу("Отправитель");	
		
	КонецЕсли;
	
	Если СпособДоставки = 0 Тогда  
		
		СохранитьАдресВАдреснуюКнигу("Получатель");	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьАдресВАдреснуюКнигу(Префикс)
	
	УчастникГрузоперевозки = ЭтаФорма[Префикс + "КонтрагентСсылка"];
	СохраняемыйАдрес = СокрЛП(ЭтаФорма[Префикс + "АдресПредставление"]);
	
	Если ЗначениеЗаполнено(УчастникГрузоперевозки) И СтрДлина(СохраняемыйАдрес) < 400 Тогда
		
		Запись = РегистрыСведений.ДЛ_АдреснаяКнига.СоздатьМенеджерЗаписи();
		Запись.УчастникГрузоперевозки = УчастникГрузоперевозки;		
		Запись.Адрес = СохраняемыйАдрес; 
		Запись.НаселнныйПункт = ЭтаФорма[Префикс + "Город"];
		Запись.ДатаИспользования = ТекущаяДатаСеанса();
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеАдресаПродолжение(Результат, Префикс) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		
		ЗаполнениеАдреса = Результат.Значение;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда 
		
		ЗаполнениеАдреса = Результат;
		
	Иначе      
		
		ЗаполнениеАдреса = ""; 
		
	КонецЕсли; 
	
	УчастникГрузоперевозки = ЭтаФорма[Префикс + "КонтрагентСсылка"];
	
	Если ЗаполнениеАдреса = Префикс Тогда 		
		
		Если ЗначениеЗаполнено(УчастникГрузоперевозки) и ТипЗнч(УчастникГрузоперевозки) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗаполнениеАдресаЗавершение", ЭтотОбъект, Префикс);
			
			КнопкиВопросаАдреса = Новый СписокЗначений;
			КнопкиВопросаАдреса.Вставить(0,"Контрагент","Контрагент");
			КнопкиВопросаАдреса.Вставить(1,"Партнер","Партнер");
			
			ПоказатьВыборИзСписка(ОписаниеОповещения, КнопкиВопросаАдреса);
			
		ИначеЕсли ЗначениеЗаполнено(УчастникГрузоперевозки) и ТипЗнч(УчастникГрузоперевозки) = Тип("СправочникСсылка.Организации") Тогда
			
			НачатьЗаполнениеАдресаЗавершение("Организация", Префикс);
			
		Иначе
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите контрагента, чей адрес должен быть заполнен.");
			
		КонецЕсли;  
		
	ИначеЕсли ЗаполнениеАдреса = "Адресная книга" Тогда
		
		НайденыйАдрес = ПолучитьАдресПоАдреснойКниге(Префикс);
		
		Если ЗначениеЗаполнено(НайденыйАдрес) Тогда 
			
			ЭтаФорма[Префикс + "АдресПредставление"] = НайденыйАдрес;
			
		Иначе
			
			ОО = Новый ОписаниеОповещения("ЗаполнениеАдресаАдрснаяКнигаЗавершение", ЭтаФорма, Префикс);
			
			Отборы = Новый Структура();
			Отборы.Вставить("УчастникГрузоперевозки", УчастникГрузоперевозки); 			
			
			Город = ЭтаФорма[Префикс + "Город"];
			
			Если ЗначениеЗаполнено(Город) Тогда
				
				Отборы.Вставить("НаселнныйПункт", Город);	
				
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Отборы);		
			
			ОткрытьФорму("РегистрСведений.ДЛ_АдреснаяКнига.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеАдресаАдрснаяКнигаЗавершение(Результат, Префикс) Экспорт  	 
	
	Если Результат <> Неопределено Тогда 	
		
		ЭтаФорма[Префикс + "АдресПредставление"] = Результат["Адрес"];			
		
		Если Не ЗначениеЗаполнено(ЭтаФорма[Префикс + "Город"]) Тогда
			
			ЭтаФорма[Префикс + "Город"] = Результат["Город"];	
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресПоАдреснойКниге(Префикс)
	
	Результат = "";   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЛ_АдреснаяКнига.Адрес КАК Адрес,
	               |	ДЛ_АдреснаяКнига.НаселнныйПункт КАК НаселнныйПункт
	               |ИЗ
	               |	РегистрСведений.ДЛ_АдреснаяКнига КАК ДЛ_АдреснаяКнига
	               |ГДЕ
	               |	ДЛ_АдреснаяКнига.УчастникГрузоперевозки = &УчастникГрузоперевозки	               
	               |	И ДЛ_АдреснаяКнига.НаселнныйПункт = &НаселнныйПункт";
	Запрос.УстановитьПараметр("УчастникГрузоперевозки", ЭтаФорма[Префикс + "КонтрагентСсылка"]);	  
	
	Если ЗначениеЗаполнено(ЭтаФорма[Префикс + "Город"]) Тогда
		
		Запрос.УстановитьПараметр("НаселнныйПункт", ЭтаФорма[Префикс + "Город"]);
		
	Иначе     
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДЛ_АдреснаяКнига.НаселнныйПункт = &НаселнныйПункт", "");	
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		
		ЭтаФорма[Префикс + "Город"] = Выборка.НаселнныйПункт;
		Результат = Выборка.Адрес;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьШаблонПродолжение(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = "Создать новый" Тогда
		
		СтруктураПараметров = Новый Структура("СтруктураШаблона", СобратьСтруктуруДанныхДляШаблона()); 
		
		ОткрытьФорму("РегистрСведений.ДЛ_Шаблоны.Форма.СохранениеШаблона", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Результат = "Перезаписать существующий" Тогда   
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина); 	
		ОО = Новый ОписаниеОповещения("ПриВыбореШаблонаДляЗаписи", ЭтаФорма, СобратьСтруктуруДанныхДляШаблона());
		
		ОткрытьФорму("РегистрСведений.ДЛ_Шаблоны.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриВыбореШаблонаДляЗаписи(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Возврат;
		
	КонецЕсли; 	
	
	ПерезаписатьШаблон(Результат, ДополнительныеПараметры);    
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Изменения шаблона сохранены");
	
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьШаблон(СтруктураКлюча, СтруктураШаблона)
	
	ШаблонРегистра = РегистрыСведений.ДЛ_Шаблоны.СоздатьМенеджерЗаписи();
	ШаблонРегистра.Автор = СтруктураКлюча.Автор;
	ШаблонРегистра.ДатаСоздания = СтруктураКлюча.ДатаСоздания;
	ШаблонРегистра.Прочитать();  
	ШаблонРегистра.Данные = Новый ХранилищеЗначения(СтруктураШаблона);
	ШаблонРегистра.ДатаИспользования = ТекущаяДатаСеанса();
	ШаблонРегистра.Записать(Истина);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтактноеЛицоТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 	
	
	СтандартнаяОбработка = Ложь;
	
	ВвестиДанныеТелефоновУчастникаПеревозки("Отправитель"); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучательКонтактноеЛицоТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ВвестиДанныеТелефоновУчастникаПеревозки("Получатель"); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПлательщикКонтактноеЛицоТелефонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВвестиДанныеТелефоновУчастникаПеревозки("Плательщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДанныеТелефоновУчастникаПеревозки(Префикс) 
	
	Телефоны = ЭтаФорма[Префикс + "КонтактноеЛицоТелефонПредставление"]; 
	
	ТекущиеТелефоны = Новый Массив;
	
	Если ЗначениеЗаполнено(Телефоны) Тогда	
		
		МассивТелефонов = СтрРазделить(Телефоны, ";");	
		
		Для Каждого НомерТелефона Из МассивТелефонов Цикл		
			
			НомерТелефонаСДобавочным = СтрРазделить(СтрЗаменить(СтрЗаменить(НомерТелефона, Символы.ПС, ""), ", доб. ", Символы.ПС), Символы.ПС, Ложь);			
			
			Если ЗначениеЗаполнено(НомерТелефонаСДобавочным[0]) Тогда
				
				СтруктураТелефона = Новый Структура;
				СтруктураТелефона.Вставить("Основной", СокрЛП(НомерТелефонаСДобавочным[0]));				
				
				Если НомерТелефонаСДобавочным.Количество() = 2  Тогда
					
					СтруктураТелефона.Вставить("Добавочный", СокрЛП(НомерТелефонаСДобавочным[1]));	
					
				КонецЕсли; 
				
				ТекущиеТелефоны.Добавить(СтруктураТелефона);		
				
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЕсли;
	
	ОО = Новый ОписаниеОповещения("ВвестиДанныеТелефоновУчастникаПеревозкиЗвершение", ЭтаФорма, Префикс); 
	ПараметрыФормы = Новый Структура("Телефоны", ТекущиеТелефоны);	
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ФормаВводаТелефонов", ПараметрыФормы, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДанныеТелефоновУчастникаПеревозкиЗвершение(Результат, Префикс) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма[Префикс + "КонтактноеЛицоТелефонПредставление"] = Результат;	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентОчистка(Префикс)  
	
	ЭтаФорма[Префикс + "КонтрагентИНН"] = "";
	ЭтаФорма[Префикс + "КонтрагентСсылка"] = Неопределено;
	ЭтаФорма[Префикс + "РучнойВвод"] = 0;	
	
	УстановитьВидимостьРучнойВводКонтрагентов(Префикс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентСтранаРВНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ОО = Новый ОписаниеОповещения("КонтрагентСтранаРВВыбор", ЭтаФорма, "Отправитель");
	ОткрытьФорму("Справочник.ДЛ_Страны.Форма.ФормаВыбора",  Новый Структура("РежимВыбора", Истина), ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентСтранаРВНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ОО = Новый ОписаниеОповещения("КонтрагентСтранаРВВыбор", ЭтаФорма, "Получатель");
	ОткрытьФорму("Справочник.ДЛ_Страны.Форма.ФормаВыбора",  Новый Структура("РежимВыбора", Истина), ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентСтранаРВВыбор(Результат, Префикс) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма[Префикс + "КонтрагентСтрана"] = Результат;	
		
	КонецЕсли;  
	
	КонтрагентСтранаРВПриИзменении(Префикс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКонтрагентСтранаРВПриИзменении(Элемент) 
	
	КонтрагентСтранаРВПриИзменении("Получатель"); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентСтранаРВПриИзменении(Элемент)
	
	КонтрагентСтранаРВПриИзменении("Отправитель");	
	
КонецПроцедуры  

&НаКлиенте
Процедура КонтрагентСтранаРВПриИзменении(Префикс)
	
	Если ЗначениеЗаполнено(ЭтаФорма[Префикс + "КонтрагентСтрана"]) И СокрЛП(ЭтаФорма[Префикс + "КонтрагентСтрана"]) <> "Россия" Тогда
		
		Элементы[Префикс + "КонтрагентОПФ"].Видимость = Истина;
		
	Иначе
		
		Элементы[Префикс + "КонтрагентОПФ"].Видимость = Ложь;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентОПФНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КонтрагентОПФНачалоВыбора("Отправитель", СтандартнаяОбработка);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучательКонтрагентОПФНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КонтрагентОПФНачалоВыбора("Получатель", СтандартнаяОбработка);
	
КонецПроцедуры   

&НаКлиенте
Процедура КонтрагентОПФНачалоВыбора(Префикс, СтандартнаяОбработка)
	
	Если ЭтаФорма[Префикс + "РучнойВвод"] = 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		ОО = Новый ОписаниеОповещения("КонтрагентОПФРВВыбор", ЭтаФорма, Префикс); 
		ЗначениеОтбора = Новый Структура("СтранаUID", ДЛ_ДеловыеЛинии.ПолучитьЗначениеРеквизита(ЭтаФорма[Префикс + "КонтрагентСтрана"], "UID"));
		ОткрытьФорму("Справочник.ДЛ_ОПФ.ФормаВыбора",  Новый Структура("РежимВыбора, Отбор", Истина, ЗначениеОтбора), ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентОПФРВВыбор(Результат, Префикс) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма[Префикс + "КонтрагентОПФ"] = Результат;	
		
	КонецЕсли;  
	
КонецПроцедуры   

&НаКлиенте
Процедура КонтрагентВыборКонтрагентаИзСписка(Результат, Префикс) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма[Префикс + "КонтрагентНаименование"] = Результат.Значение.Наименование;
		ЭтаФорма[Префикс + "КонтрагентИНН"] = Результат.Значение.ИНН;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Префикс)
	
	Если ЭтаФорма[Префикс + "РучнойВвод"] = 1 И СокрЛП(ЭтаФорма[Префикс + "КонтрагентСтрана"]) = "Россия" Тогда
		
		СписокКонтрагентов = ПолучитьСписокКонтрагентовAPI(Префикс);
		
		Если СписокКонтрагентов.Количество() = 1 Тогда
			
			ЭтаФорма[Префикс + "КонтрагентНаименование"] = СписокКонтрагентов[0].Значение.Наименование; 
			ЭтаФорма[Префикс + "КонтрагентИНН"] = СписокКонтрагентов[0].Значение.ИНН;		
			
		ИначеЕсли СписокКонтрагентов.Количество() > 1 Тогда 
			
			ОО = Новый ОписаниеОповещения("КонтрагентВыборКонтрагентаИзСписка", ЭтаФорма, Префикс); 
			
			ПоказатьВыборИзСписка(ОО, СписокКонтрагентов, Элементы[Префикс + "Контрагент"]); 	
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСписокКонтрагентовAPI(Префикс)	
	
	Возврат ДЛ_ДеловыеЛинии.ПолучитьСписокКонтрагентов(ЭтаФорма[Префикс + "КонтрагентНаименование"]);	
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьСтрануПоУмолчанию()	
	
	Возврат Справочники.ДЛ_Страны.НайтиПоРеквизиту("UID", "0x8f51001438c4d49511dbd774581edb7a");	
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьОПФПоУмолчанию()	
	
	Возврат Справочники.ДЛ_ОПФ.НайтиПоРеквизиту("UID", "0xAB91FEEA04F6D4AD48DF42161B6C2E7A");	
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьРучнойВводКонтрагентов(Префикс) 
	
	Если ЭтаФорма[Префикс + "РучнойВвод"] = 0 Тогда     
		
		Элементы[Префикс + "КонтрагентИНН"].Заголовок = "ИНН"; 
		Элементы[Префикс + "КонтрагентИНН"].ПодсказкаВвода = "Введите ИНН";
		Элементы[Префикс + "КонтрагентИНН"].Маска = ""; 
		Элементы[Префикс + "КонтрагентИНН"].ТолькоПросмотр = Истина;
		Элементы[Префикс + "Контрагент"].РедактированиеТекста = Ложь;
		Элементы[Префикс + "Контрагент"].КнопкаОткрытия = Истина; 
		Элементы[Префикс + "Контрагент"].ПодсказкаВвода = "Выберите из справочника";
		Элементы[Префикс + "Контрагент"].МаксимальнаяШирина = 33;
		Элементы[Префикс + "Поиск"].Видимость = Ложь;
		Элементы[Префикс + "КонтактноеЛицо"].КнопкаОткрытия = Истина;
		Элементы[Префикс + "КонтактноеЛицо"].КнопкаВыбора = Истина;	
		
		Если Префикс <> "Плательщик" Тогда
			
			Элементы[Префикс + "КонтрагентСтранаРВ"].Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы[Префикс + "КонтрагентИНН"].ТолькоПросмотр = Ложь;
		Элементы[Префикс + "Контрагент"].РедактированиеТекста = Истина; 
		Элементы[Префикс + "Контрагент"].КнопкаОткрытия = Ложь;						
		Элементы[Префикс + "КонтактноеЛицо"].КнопкаОткрытия = Ложь; 
		Элементы[Префикс + "КонтактноеЛицо"].КнопкаВыбора = Ложь; 
		Элементы["гр" + Префикс + "Иностранец"].Видимость = Ложь; 
		
		Если ЭтаФорма[Префикс + "РучнойВвод"] = 1 Тогда
			
			Элементы[Префикс + "Контрагент"].ПодсказкаВвода = "Поиск по Наименованию/ИНН"; 
			Элементы[Префикс + "Контрагент"].МаксимальнаяШирина = 29; 
			Элементы[Префикс + "Поиск"].Видимость = Истина;
			Элементы[Префикс + "КонтрагентСтранаРВ"].Видимость = Истина;  			
			Элементы[Префикс + "КонтрагентСтрана"].Видимость = Ложь;
			Элементы[Префикс + "КонтрагентИНН"].Маска = "";  
			
			КонтрагентСтранаРВПриИзменении(Префикс);
			
		Иначе
			
			Элементы[Префикс + "Контрагент"].ПодсказкаВвода = "ФИО";
			Элементы[Префикс + "Контрагент"].МаксимальнаяШирина = 33;
			Элементы[Префикс + "Поиск"].Видимость = Ложь;
			Элементы[Префикс + "КонтрагентСтранаРВ"].Видимость = Ложь;
			Элементы[Префикс + "КонтрагентСтрана"].Видимость = Истина;
			Элементы[Префикс + "КонтрагентИНН"].Заголовок = "Паспорт";
			Элементы[Префикс + "КонтрагентИНН"].ПодсказкаВвода = "Серия Номер";  
			Элементы[Префикс + "КонтрагентОПФ"].Видимость = Ложь;  			
			
			УстановитьМаскуПаспорта(Префикс);			
			
		КонецЕсли;		  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДополнительныеТребования(Префикс, ТЗ_Требования) 
	
	Элементы[Префикс + "ДополнительныеТребованияТС"].СписокВыбора.Добавить("", "Отсутствуют");
	
	Для Каждого СтрТЗ Из ТЗ_Требования Цикл
		
		Элементы[Префикс + "ДополнительныеТребованияТС"].СписокВыбора.Добавить(СтрТЗ.UID, СтрТЗ.Наименование);	
		
	КонецЦикла;
	
КонецПроцедуры   


&НаКлиенте
Процедура ДополнительныеУслугиИспользоватьПриИзменении(Элемент) 	
	
	Элементы.ДополнительныеУслугиПлательщик.ТолькоПросмотр = ОпределеитьВозможностьИзменятьПлательщикаЗаДопУслуги();
	
КонецПроцедуры 

&НаСервере
Функция ОпределеитьВозможностьИзменятьПлательщикаЗаДопУслуги() 
	
	ПромТЗ = ДополнительныеУслуги.Выгрузить(, "Использовать");
	ПромТЗ.Сортировать("Использовать УБЫВ");
	
	Возврат Не ПромТЗ[0].Использовать;
	
КонецФункции 

&НаСервере
Процедура ДобавитьСтрокуРасшифровкиПредрасчета(СтрокиРезультата, ДанныеЗапроса, ТекстРасшифровки)  
	
	Если ДанныеЗапроса["contractPrice"] Тогда
		
		СтрокаРезультата =	СтрокиРезультата.Добавить();
		СтрокаРезультата.Представление = "		" + ТекстРасшифровки;
		СтрокаРезультата.Сумма = "договорная"; 
		
	ИначеЕсли ДанныеЗапроса["price"] > 0 Тогда 	
		
		СтрокаРезультата = ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРезультата, "		" + ТекстРасшифровки, СтрокаСумма(ДанныеЗапроса["price"]));		
		
		ЗаполнитьРасшифровкуПоСкидкамНадбавкам(СтрокаРезультата.ПолучитьЭлементы(), ДанныеЗапроса);
		
	КонецЕсли;                                                                           
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуПоСкидкамНадбавкам(СтрокиРасшифровки, ДанныеЗапроса) 
	
	БазоваяЦена = ДанныеЗапроса["price"];
	
	ЗаполнитьРасшифровкуПоМассиву(СтрокиРасшифровки, ДанныеЗапроса["discountDetails"], -1);
	ЗаполнитьРасшифровкуПоМассиву(СтрокиРасшифровки, ДанныеЗапроса["premiumDetails"], 1); 
	
	Если ДанныеЗапроса["handling"] <> Неопределено И ДанныеЗапроса["handling"]["price"] <> Неопределено И ДанныеЗапроса["handling"]["price"] > 0 Тогда
		
		ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРасшифровки, "			Погрузо-разгрузочные работы", ДанныеЗапроса["handling"]["price"]);			
		
	КонецЕсли;
	
	Если СтрокиРасшифровки.Количество() > 0 Тогда
	
		Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
			
			БазоваяЦена = БазоваяЦена - СтрокаРасшифровки.Сумма; 
			
			СтрокаРасшифровки.Сумма = СтрокаСумма(СтрокаРасшифровки.Сумма);
			
		КонецЦикла; 
		
		Если БазоваяЦена <> 0 Тогда
			
			СтрокаРасшифровки =	СтрокиРасшифровки.Вставить(0);
			СтрокаРасшифровки.Представление = "			Базовая стоимость";
			СтрокаРасшифровки.Сумма = СтрокаСумма(БазоваяЦена);	
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьРасшифровкуПоМассиву(СтрокиРасшифровки, ДанныеЗапроса, Коэффициент)    
	
	Если ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		
		Для Каждого ЭлементМассива Из ДанныеЗапроса Цикл
			
			ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиРасшифровки, "			" + ЭлементМассива["name"], ЭлементМассива["value"] * Коэффициент);			
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ДобавитьСтрокуСуммыВДеревоПредрасчета(СтрокиДерева, Представление, Сумма)  
	
	Результат = СтрокиДерева.Добавить();
	Результат.Представление = Представление;
	Результат.Сумма = Сумма;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуСкидокНаценокПоМассиву(ДанныеЗапроса) 
	
	Результат = 0; 
	
	Если ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		
		Для Каждого ЭлементМассива Из ДанныеЗапроса Цикл
			
			Результат = Результат + ЭлементМассива["value"];
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НаложенныйПлатежПрименить(Команда)
	
	Элементы.грНаложенныйПлатежСостав.Скрыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ПоискОтправителя(Команда)
	
	КонтрагентПриИзменении("Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПолучателя(Команда)
	
	КонтрагентПриИзменении("Получатель");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМаскуПаспорта(Префикс)  
	
	Если ЭтаФорма[Префикс + "РучнойВвод"] > 0 Тогда 
		
		Если СокрЛП(ЭтаФорма[Префикс + "КонтрагентСтрана"]) = "Россия" Тогда 
			
			Элементы[Префикс + "КонтрагентИНН"].Маска = "9999 999999";
			
			ЦифрыПаспорта = ТолькоЦифры(ЭтаФорма[Префикс + "КонтрагентИНН"]);
			ЭтаФорма[Префикс + "КонтрагентИНН"] = ?(СтрДлина(ЦифрыПаспорта) > 4, Лев(Лев(ЦифрыПаспорта, 4) + " " + Сред(ЦифрыПаспорта, 5), 11), ЦифрыПаспорта);				
			
		Иначе
			
			Элементы[Префикс + "КонтрагентИНН"].Маска = "";
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйРасчетФайловый(Команда)
	
	Результат = РасчетИСозданиеЗаказа(Истина);                                 
	
	Если Результат.Успешно Тогда
		
		ОО = Новый ОписаниеОповещения("ПредварительныйРасчетОкончание", ЭтаФорма);	
		
		ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.РезультатКалькулятора", Результат, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		
	КонецЕсли;	
	
	УстановитьДоступностьФормы(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатРасчетаФайловыйВариант(РезультатЗапроса, Результат)
	
	Если РезультатЗапроса["data"] <> Неопределено Тогда  
		
		ВывестиДанныеПредварительногоРасчетаФайловыйВариант(РезультатЗапроса["data"], Результат);			
		
		УстановитьДоступностьФормы(Истина); 				
		
	ИначеЕсли РезультатЗапроса["errors"] <> Неопределено Тогда	
		
		ТаблицаОшибок = ЗаполнитьТаблицуОшибок(РезультатЗапроса["errors"]);
		
		Для Каждого ОшибкаЗапроса Из ТаблицаОшибок Цикл				
			
			ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибкеЗаказа(ОшибкаЗапроса)); 
			
		КонецЦикла; 
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка выполнения запроса. Попробуйте еще раз");
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ВывестиДанныеПредварительногоРасчетаФайловыйВариант(ДанныеЗапроса, Результат)	
	
	ГрафикПеревозки = ДЛ_ДеловыеЛинии.ПрочитатьДанныеГрафикаПеревозки(ДанныеЗапроса["orderDates"]); 
	
	Результат.Вставить("ГрафикПеревозки", ГрафикПеревозки);
	Результат.Вставить("ЦенаЗаказа", ДанныеЗапроса["price"]);
	Результат.Вставить("Страховка", ДанныеЗапроса["insurance"]);
	
	Если ДанныеЗапроса["foundAddresses"] <> Неопределено И ДанныеЗапроса["foundAddresses"].Количество() > 0 Тогда
		
		СообщениеАдреса = "Проверьте автоматически найденные адреса:"; 
		
		Для Каждого НайденныйАдрес Из ДанныеЗапроса["foundAddresses"] Цикл
			
			СообщениеАдреса = СообщениеАдреса + Символы.ПС + НайденныйАдрес["result"];
			
		КонецЦикла;
		
		Результат.Вставить("Адреса", СообщениеАдреса);
		
	КонецЕсли; 
	
	СообщениеДетализация = ""; 	
	УслугаИнформацияОСтатусе = "";
	
	ЦенаДоговорная = "договорная";
	
	Если ДанныеЗапроса["intercity"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["intercity"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе   
			
			Цена = "" + ДанныеЗапроса["intercity"]["price"] + " руб.";
			
		КонецЕсли; 
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Автоперевозка: " + Цена;
		
	КонецЕсли;   
	
	Если ДанныеЗапроса["small"] <> Неопределено Тогда 		
		
		Если ДанныеЗапроса["small"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["small"]["price"] + " руб.";
			
		КонецЕсли;  
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Малогабаритный груз: " + Цена;
		
	КонецЕсли;
	
	Если ДанныеЗапроса["air"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["air"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["air"]["price"] + " руб.";
			
		КонецЕсли;  
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Авиаперевозка: " + Цена;
		
	КонецЕсли; 
	
	Если ДанныеЗапроса["express"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["express"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["express"]["price"] + " руб.";
			
		КонецЕсли;
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Экспресс-перевозка: " + Цена;
		
	КонецЕсли; 
	
	Если ДанныеЗапроса["letter"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["letter"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["letter"]["price"] + " руб.";
			
		КонецЕсли;
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Письмо: " + Цена;
		
	КонецЕсли; 
	
	Если ДанныеЗапроса["derival"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["derival"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["derival"]["price"] + " руб.";
			
		КонецЕсли;
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Доставка от отправителя: " + Цена;
		
	КонецЕсли;  
	
	Если ДанныеЗапроса["arrival"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["arrival"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["arrival"]["price"] + " руб.";
			
		КонецЕсли;
		
		СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Доставка до получателя: " + Цена;
		
	КонецЕсли;
	
	Если ДанныеЗапроса["accompanyingDocuments"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["accompanyingDocuments"]["send"] <> Неопределено Тогда
			
			Если ДанныеЗапроса["accompanyingDocuments"]["send"]["contractPrice"] Тогда
				
				Цена = ЦенаДоговорная;	
				
			Иначе  
				
				Цена = "" + ДанныеЗапроса["accompanyingDocuments"]["send"]["price"] + " руб.";
				
			КонецЕсли;
			
			СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Отправка сопроводительных документов: " + Цена;
			
		КонецЕсли;
		
		Если ДанныеЗапроса["accompanyingDocuments"]["return"] <> Неопределено Тогда
			
			Если ДанныеЗапроса["accompanyingDocuments"]["return"]["contractPrice"] Тогда
				
				Цена = ЦенаДоговорная;	
				
			Иначе  
				
				Цена = "" + ДанныеЗапроса["accompanyingDocuments"]["return"]["price"] + " руб.";
				
			КонецЕсли;
			
			СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Возврат сопроводительных документов: " + Цена;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ДанныеЗапроса["notify"] <> Неопределено Тогда
		
		Если ДанныеЗапроса["notify"]["contractPrice"] Тогда
			
			Цена = ЦенаДоговорная;	
			
		Иначе  
			
			Цена = "" + ДанныеЗапроса["notify"]["price"] + " руб.";
			
		КонецЕсли;
		
		УслугаИнформацияОСтатусе = "Услуга 'Информация о статусе заказа': " + Цена;
		
	КонецЕсли;
	
	Если ДанныеЗапроса["packages"] <> Неопределено Тогда 
		
		Цена = 0;
		
		Для Каждого Упаковка Из ДанныеЗапроса["packages"] Цикл 						
			 
			Если НЕ Упаковка.Значение["contractPrice"] И ТипЗнч(Упаковка.Значение["price"]) = Тип("Число") Тогда				  			
				
				Цена = Цена + Упаковка.Значение["price"];
				
			КонецЕсли;    
			
		КонецЦикла;
		
		Если Цена > 0 Тогда
		
			СообщениеДетализация = СообщениеДетализация + Символы.ПС + "Упаковка: " + Цена + " руб."; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеДетализация) Тогда
		
		Результат.Вставить("Детализация", СокрЛП(СообщениеДетализация));
		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(УслугаИнформацияОСтатусе) Тогда
		
		Результат.Вставить("УслугаИнформацияОСтатусе", УслугаИнформацияОСтатусе);
		
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьТерминалПоиском(ЭтоОтправка)
	
	Результат = Неопределено;
	
	ГородПоиска = ?(ЭтоОтправка, ОтправительГород, ПолучательГород);
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("appKey");
	СтруктураЗапроса.Вставить("sessionID");
	СтруктураЗапроса.Вставить("code", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГородПоиска, "КодКЛАДР")); 
	СтруктураЗапроса.Вставить("direction", ?(ЭтоОтправка, "derival", "arrival")); 
	
	ДанныеТерминалы = ДЛ_ДеловыеЛинии.ПоискТерминалов(СтруктураЗапроса);
	
	Если ДанныеТерминалы["terminals"] <> Неопределено И ДанныеТерминалы["terminals"].Количество() > 0 Тогда
		
		НашлиПоУмолчанию = Ложь;
		
		Для Каждого НайденныйТерминал Из ДанныеТерминалы["terminals"] Цикл
			
			Если НайденныйТерминал["default"] = Истина Тогда
				
				НашлиПоУмолчанию = Истина;
				
				Результат = Справочники.ДЛ_Терминалы.НайтиПоРеквизиту("ИДтерминала", Строка(НайденныйТерминал["id"]));
				
				Прервать;
				
			КонецЕсли;			
			
		КонецЦикла;   
		
		Если Не НашлиПоУмолчанию Тогда
			
			Результат = Справочники.ДЛ_Терминалы.НайтиПоРеквизиту("ИДтерминала", Строка(ДанныеТерминалы["terminals"][0]["id"]));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

