#Область Интерфейс

Функция ПолучитьМаксимальныеСкидкиДляМассиваНоменклатуры(Дата, МассивНоменклатуры, Организация, Партнер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартМаксимальныеСкидкиСрезПоследних.Номенклатура КАК Номенклатура,
	|	смартМаксимальныеСкидкиСрезПоследних.МаксимальнаяСкидка КАК МаксимальнаяСкидка,
	|	1 КАК Приоритет,
	|	смартМаксимальныеСкидкиСрезПоследних.Отменена КАК Отменена,
	|	смартМаксимальныеСкидкиСрезПоследних.СкидкаЗапрещена КАК СкидкаЗапрещена
	|ПОМЕСТИТЬ ВТДанныеСкидок
	|ИЗ
	|	РегистрСведений.смартМаксимальныеСкидки.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Организация = &Организация
	|				И Партнер = &Партнер
	|				И ДляДилеров = &ДилерСЦ) КАК смартМаксимальныеСкидкиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартМаксимальныеСкидкиСрезПоследних.Номенклатура,
	|	смартМаксимальныеСкидкиСрезПоследних.МаксимальнаяСкидка,
	|	2,
	|	смартМаксимальныеСкидкиСрезПоследних.Отменена,
	|	смартМаксимальныеСкидкиСрезПоследних.СкидкаЗапрещена
	|ИЗ
	|	РегистрСведений.смартМаксимальныеСкидки.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Организация = &Организация
	|				И Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|				И ДляДилеров = &ДилерСЦ) КАК смартМаксимальныеСкидкиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартМаксимальныеСкидкиСрезПоследних.Номенклатура,
	|	смартМаксимальныеСкидкиСрезПоследних.МаксимальнаяСкидка,
	|	3,
	|	смартМаксимальныеСкидкиСрезПоследних.Отменена,
	|	смартМаксимальныеСкидкиСрезПоследних.СкидкаЗапрещена
	|ИЗ
	|	РегистрСведений.смартМаксимальныеСкидки.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				И Партнер = &Партнер
	|				И ДляДилеров = &ДилерСЦ) КАК смартМаксимальныеСкидкиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартМаксимальныеСкидкиСрезПоследних.Номенклатура,
	|	смартМаксимальныеСкидкиСрезПоследних.МаксимальнаяСкидка,
	|	4,
	|	смартМаксимальныеСкидкиСрезПоследних.Отменена,
	|	смартМаксимальныеСкидкиСрезПоследних.СкидкаЗапрещена
	|ИЗ
	|	РегистрСведений.смартМаксимальныеСкидки.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				И Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|				И ДляДилеров = &ДилерСЦ) КАК смартМаксимальныеСкидкиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеСкидок.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ВТДанныеСкидок.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритеты
	|ИЗ
	|	ВТДанныеСкидок КАК ВТДанныеСкидок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанныеСкидок.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеСкидок.Номенклатура КАК Номенклатура,
	|	ВТДанныеСкидок.МаксимальнаяСкидка КАК МаксимальнаяСкидка,
	|	ВТДанныеСкидок.Отменена КАК Отменена,
	|	ВТДанныеСкидок.СкидкаЗапрещена КАК СкидкаЗапрещена
	|ИЗ
	|	ВТДанныеСкидок КАК ВТДанныеСкидок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритеты КАК ВТПриоритеты
	|		ПО ВТДанныеСкидок.Номенклатура = ВТПриоритеты.Номенклатура
	|			И ВТДанныеСкидок.Приоритет = ВТПриоритеты.Приоритет";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ДилерСЦ", Партнер.смартДилерСервисЦентра);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДействующиеАкции(Дата, Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартОстаткиАкционныхТоваровОстатки.Номенклатура КАК Номенклатура,
	|	смартОстаткиАкционныхТоваровОстатки.Серия КАК Серия,
	|	смартОстаткиАкционныхТоваровОстатки.ДокументАкции КАК ДокументАкции,
	|	смартОстаткиАкционныхТоваровОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиАкционныхТоваров
	|ИЗ
	|	РегистрНакопления.смартОстаткиАкционныхТоваров.Остатки(&Дата, ) КАК смартОстаткиАкционныхТоваровОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартУправлениеАкциямиТовары.Ссылка.Организация КАК Организация,
	|	смартУправлениеАкциямиТовары.Ссылка.НазваниеАкции КАК НазваниеАкции,
	|	смартУправлениеАкциямиТовары.Ссылка.ДатаНачалаАкции КАК ДатаНачалаАкции,
	|	ВЫБОР
	|		КОГДА смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции
	|		ИНАЧЕ КОНЕЦПЕРИОДА(смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции, ДЕНЬ)
	|	КОНЕЦ КАК ДатаОкончанияАкции,
	|	смартУправлениеАкциямиТовары.Ссылка.ВидАкции КАК ВидАкции,
	|	смартУправлениеАкциямиТовары.Номенклатура КАК Номенклатура,
	|	смартУправлениеАкциямиТовары.Характеристика КАК Характеристика,
	|	смартУправлениеАкциямиТовары.Склад КАК Склад,
	|	смартУправлениеАкциямиТовары.Серия КАК Серия,
	|	смартУправлениеАкциямиТовары.ЦенаРозница КАК ЦенаРозница,
	|	смартУправлениеАкциямиТовары.ВалютаРозница КАК ВалютаРозница,
	|	смартУправлениеАкциямиТовары.ЦенаАкция КАК ЦенаАкция,
	|	смартУправлениеАкциямиТовары.ВалютаАкция КАК ВалютаАкция,
	|	смартУправлениеАкциямиТовары.Примечание КАК Примечание,
	|	смартУправлениеАкциямиТовары.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ВТОстаткиАкционныхТоваров.Количество, 0) КАК Количество,
	|	смартУправлениеАкциямиТовары.ОборудованиеДемозала КАК ОборудованиеДемозала
	|ПОМЕСТИТЬ ВТВсеАкции
	|ИЗ
	|	Документ.смартУправлениеАкциями.Товары КАК смартУправлениеАкциямиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиАкционныхТоваров КАК ВТОстаткиАкционныхТоваров
	|		ПО смартУправлениеАкциямиТовары.Номенклатура = ВТОстаткиАкционныхТоваров.Номенклатура
	|			И смартУправлениеАкциямиТовары.Серия = ВТОстаткиАкционныхТоваров.Серия
	|			И смартУправлениеАкциямиТовары.Ссылка = ВТОстаткиАкционныхТоваров.ДокументАкции
	|ГДЕ
	|	смартУправлениеАкциямиТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыАкций.Действует)
	|	И смартУправлениеАкциямиТовары.Ссылка.Проведен
	|	И (&Дата МЕЖДУ смартУправлениеАкциямиТовары.Ссылка.ДатаНачалаАкции И КОНЕЦПЕРИОДА(смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции, ДЕНЬ)
	|			ИЛИ (смартУправлениеАкциямиТовары.Ссылка.ДатаНачалаАкции <= &Дата
	|				И смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции = ДАТАВРЕМЯ(1, 1, 1)))
	|	И ВЫБОР
	|			КОГДА НЕ смартУправлениеАкциямиТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЕСТЬNULL(ВТОстаткиАкционныхТоваров.Количество, 0) > 0
	|			КОГДА смартУправлениеАкциямиТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|					И смартУправлениеАкциямиТовары.Ссылка.ВидАкции = ЗНАЧЕНИЕ(Перечисление.смартВидыАкций.Распродажа)
	|				ТОГДА ЕСТЬNULL(ВТОстаткиАкционныхТоваров.Количество, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВсеАкции.Организация КАК Организация,
	|	ВТВсеАкции.НазваниеАкции КАК НазваниеАкции,
	|	ВТВсеАкции.ДатаНачалаАкции КАК ДатаНачалаАкции,
	|	ВТВсеАкции.ДатаОкончанияАкции КАК ДатаОкончанияАкции,
	|	ВТВсеАкции.ВидАкции КАК ВидАкции,
	|	ВТВсеАкции.Номенклатура КАК Номенклатура,
	|	ВТВсеАкции.Характеристика КАК Характеристика,
	|	ВТВсеАкции.Склад КАК Склад,
	|	ВТВсеАкции.Серия КАК Серия,
	|	ВТВсеАкции.ЦенаРозница КАК ЦенаРозница,
	|	ВТВсеАкции.ВалютаРозница КАК ВалютаРозница,
	|	ВТВсеАкции.ЦенаАкция КАК ЦенаАкция,
	|	ВТВсеАкции.ВалютаАкция КАК ВалютаАкция,
	|	ВТВсеАкции.Примечание КАК Примечание,
	|	ВТВсеАкции.Количество КАК Количество,
	|	ВТВсеАкции.Ссылка КАК ДокументАкции,
	|	ВТВсеАкции.ОборудованиеДемозала КАК ОборудованиеДемозала,
	|	ВТВсеАкции.Ссылка КАК Ссылка
	|ИЗ
	|	ВТВсеАкции КАК ВТВсеАкции
	|ГДЕ
	|	ИСТИНА";
	
	Если НЕ Параметры = Неопределено Тогда
		
		МассивУсловий = Новый Массив;
		
		Для каждого стрПараметр Из Параметры Цикл
			
			Если стрПараметр.Ключ = "ВозвращатьАкцииБудущего" Тогда
				
				СтрокаЗамены = "	И (&Дата МЕЖДУ смартУправлениеАкциямиТовары.Ссылка.ДатаНачалаАкции И КОНЕЦПЕРИОДА(смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции, ДЕНЬ)
								|			ИЛИ (смартУправлениеАкциямиТовары.Ссылка.ДатаНачалаАкции <= &Дата
								|				И смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции = ДАТАВРЕМЯ(1, 1, 1)))";
				
				НаЧтоЗаменять = "	И (КОНЕЦПЕРИОДА(смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции, ДЕНЬ) >= &Дата
								|				ИЛИ смартУправлениеАкциямиТовары.Ссылка.ДатаОкончанияАкции = ДАТАВРЕМЯ(1, 1, 1))";
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст, СтрокаЗамены, НаЧтоЗаменять);
				
			Иначе
				
				МассивУсловий.Добавить(СтрШаблон("%1 В (&%1)",стрПараметр.Ключ));
				Запрос.УстановитьПараметр(стрПараметр.Ключ, стрПараметр.Значение);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивУсловий.Количество() > 0 Тогда
			Запрос.Текст = СтрШаблон("%1 И %2", Запрос.Текст, СтрСоединить(МассивУсловий, " И "));
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура РассчитатьАкцииВФормеЗаказеКлиента(Форма) Экспорт
	
	//СтруктураПараметры = Новый Структура;
	//СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	//СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	//СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
	//
	//СкидкиНаценкиСервер.Рассчитать(Форма.Объект, СтруктураПараметры);
	
	ВидСкидки = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ВидСкидкиАкция");
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Форма.Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	
	Для каждого стрТовары Из Форма.Объект.Товары Цикл
		
		НайденныеСтроки = Форма.Объект.смартАкции.НайтиСтроки(Новый Структура("КодСтроки", стрТовары.КодСтроки));
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ЦенаСоСкидкой = РаботаСКурсамиВалют.ПересчитатьВВалюту(НайденныеСтроки[0].ЦенаАкция, НайденныеСтроки[0].ВалютаАкция, Форма.Объект.Валюта, Форма.Объект.Дата);
			СуммаСоСкидкой = стрТовары.КоличествоУпаковок * ЦенаСоСкидкой;
			СуммаБезСкидки = стрТовары.Цена * стрТовары.КоличествоУпаковок;
			
			стрТовары.ЦенаСоСкидкой = ЦенаСоСкидкой;
			стрТовары.СуммаАвтоматическойСкидки = СуммаБезСкидки - СуммаСоСкидкой;
			стрТовары.Сумма = СуммаСоСкидкой;
			стрТовары.ПроцентАвтоматическойСкидки = ?(СуммаБезСкидки = 0, 0, стрТовары.СуммаАвтоматическойСкидки * 100 / СуммаБезСкидки);
			
			СкидкиНаценки = Форма.Объект.СкидкиНаценки.НайтиСтроки(Новый Структура("КлючСвязи", стрТовары.КодСтроки));
			
			НашлиСтроку = Ложь;
			Для каждого стрСкидкаНаценка Из СкидкиНаценки Цикл
				
				Если стрСкидкаНаценка.СкидкаНаценка = ВидСкидки Тогда
					
					НашлиСтроку = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ НашлиСтроку Тогда
				стрСкидкаНаценка = Форма.Объект.СкидкиНаценки.Добавить();
			КонецЕсли;
			
			стрСкидкаНаценка.СкидкаНаценка = ВидСкидки;
			стрСкидкаНаценка.Сумма = стрТовары.СуммаАвтоматическойСкидки;
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, СтруктураДействий, КэшированныеЗначения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИнформациюОбАкцияхнаФормуПодбора(Форма) Экспорт
	
	Свойства = Новый Структура;
	Свойства.Вставить("ЦветФона", WebЦвета.СветлоКоричневый);
	Свойства.Вставить("Видимость", Ложь);
	смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(Форма, "смартГруппаАкции", "СтраницаФильтры", 1,,, Свойства, "ГруппаФильтрПоЦене");
	
	Элемент = смартФормированиеИнтерфейса.СздДекорацияНадпись(Форма, "смартДекорацияАкцииЗаголовок", "смартГруппаАкции", "Акция ! Распродажа ДИЦ");
	Элемент.ЦветТекста = WebЦвета.Красный;
	
	смартФормированиеИнтерфейса.СздДекорацияНадпись(Форма, "смартДекорацияАкцииИнформация", "смартГруппаАкции", "");
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюПоДействующимСкидкамНоменклатурыВФормеПодбора(Форма, Организация, Номенклатура, Характеристика = Неопределено) Экспорт
	
	ПараметрыАкций = Новый Структура;
	ПараметрыАкций.Вставить("Организация", Организация);
	ПараметрыАкций.Вставить("Номенклатура", Номенклатура);
	Если НЕ Характеристика = Неопределено Тогда
		ПараметрыАкций.Вставить("Характеристика", Характеристика);
	КонецЕсли;
	
	ТЗакций = ПолучитьДействующиеАкции(ТекущаяДата(), ПараметрыАкций);
	
	Если ТЗакций.Количество() = 0 Тогда
		Форма.Элементы.смартГруппаАкции.Видимость = Ложь;
	Иначе
		
		Форма.Элементы.смартГруппаАкции.Видимость = Истина;
		
		МассивТекста = Новый Массив;
		Для каждого стрАкция ИЗ ТЗАкций Цикл
			
			МассивТекста.Добавить(СтрШаблон("Акция %1", стрАкция.ВидАкции));
			МассивТекста.Добавить(СтрШаблон("С %1 по %2", Формат(стрАкция.ДатаНачалаАкции, "ДФ=dd.MM.yyyy"), Формат(стрАкция.ДатаОкончанияАкции, "ДФ=dd.MM.yyyy")));
			МассивТекста.Добавить(СтрШаблон("Цена %1 %2", стрАкция.ЦенаАкция, стрАкция.ВалютаАкция));
			МассивТекста.Добавить("");
			
		КонецЦикла;
		
		Форма.Элементы.смартДекорацияАкцииИнформация.Заголовок = СтрСоединить(МассивТекста, Символы.ПС);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияИспользованныхТоваровПоЗаказуКлиента(Заказ, Отказ) Экспорт
	
	Если НЕ ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаказОплачен(Заказ) Тогда
		
		рег = РегистрыНакопления.смартОстаткиАкционныхТоваров.СоздатьНаборЗаписей();
		рег.Отбор.Регистратор.Установить(Заказ, Истина);
		рег.Записать(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиентасмартАкции.Ссылка КАК ЗаказКлиента,
		|	ЗаказКлиентасмартАкции.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентасмартАкции.НазваниеАкции КАК НазваниеАкции,
		|	ЗаказКлиентасмартАкции.ДатаНачалаАкции КАК ДатаНачалаАкции,
		|	ЗаказКлиентасмартАкции.ДатаОкончанияАкции КАК ДатаОкончанияАкции,
		|	ЗаказКлиентасмартАкции.ВидАкции КАК ВидАкции,
		|	ЗаказКлиентасмартАкции.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентасмартАкции.Склад КАК Склад,
		|	ЗаказКлиентасмартАкции.Серия КАК Серия,
		|	ЗаказКлиентасмартАкции.ЦенаАкция КАК ЦенаАкция,
		|	ЗаказКлиентасмартАкции.ВалютаАкция КАК ВалютаАкция,
		|	ЗаказКлиентасмартАкции.Примечание КАК Примечание,
		|	ЗаказКлиентасмартАкции.ОборудованиеДемозала КАК ОборудованиеДемозала,
		|	ЗаказКлиентасмартАкции.Количество КАК Количество,
		|	ЗаказКлиентасмартАкции.КодСтроки КАК КодСтроки,
		|	ЗаказКлиентасмартАкции.ДокументАкции КАК ДокументАкции,
		|	ЕСТЬNULL(смартОстаткиАкционныхТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЗаказКлиентасмартАкции.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ЗаказКлиента.смартАкции КАК ЗаказКлиентасмартАкции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.смартОстаткиАкционныхТоваров.Остатки КАК смартОстаткиАкционныхТоваровОстатки
		|		ПО ЗаказКлиентасмартАкции.Номенклатура = смартОстаткиАкционныхТоваровОстатки.Номенклатура
		|			И ЗаказКлиентасмартАкции.Серия = смартОстаткиАкционныхТоваровОстатки.Серия
		|			И ЗаказКлиентасмартАкции.ДокументАкции = смартОстаткиАкционныхТоваровОстатки.ДокументАкции
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ ЗаказКлиентасмартАкции.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			КОГДА ЗаказКлиентасмартАкции.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|					И ЗаказКлиентасмартАкции.ВидАкции = ЗНАЧЕНИЕ(Перечисление.смартВидыАкций.Распродажа)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ЗаказКлиентасмартАкции.Ссылка = &Заказ";
		
		Запрос.УстановитьПараметр("Заказ", Заказ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоОстаток >= Выборка.Количество Тогда
				
				Движение = рег.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
				
			Иначе
				
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не хватает остатка акционного товара %1. Остаток товара %2, количество в документе %3", Выборка.Номенклатура, Выборка.КоличествоОстаток, Выборка.Количество),,,, Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			рег.Записать(Истина);
		КонецЕсли;
		
	Иначе
		
		рег = РегистрыНакопления.смартОстаткиАкционныхТоваров.СоздатьНаборЗаписей();
		рег.Отбор.Регистратор.Установить(Заказ, Истина);
		рег.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаказОплачен(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.СуммаОплаты <> NULL И Выборка.СуммаОплаты > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти