
//++#1542 смарт: Лопато 03.11.2023 //Рефакторинг кода 1С. Расширение CRM. Перевести в расширение Смарт.  
//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 21.09.2021 13:13:55
&После("ОбработкаПолученияФормОбъектов")
Процедура extCRM_ОбработкаПолученияФормОбъектов(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийМенеджер.CRM_Напоминания") Тогда
			
		Если ВидФормы = "ФормаЗаписи" Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "РегистрСведений.CRM_Напоминания.Форма.ФормаЗаписи";
			
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры //--#1542 смарт: Лопато 03.11.2023
