
&ИзменениеИКонтроль("ПолучитьИнформациюОТовареПриПродаже")
Процедура смарт_ПолучитьИнформациюОТовареПриПродаже(Форма)
	
	Если Не Форма.ОтображатьОстатки
		Или Форма.ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения
		И Не ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	ОстаткиПоСкладам = Форма.ОстаткиТоваров.ПолучитьЭлементы();
	ОстаткиПоСкладам.Очистить();
	
	Если Форма.РежимПодбораБезСуммовыхПараметров И Не Форма.ОтображатьОстатки Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиИспользуются = Форма.ТекущаяСтрокаНоменклатуры.ХарактеристикиИспользуются;
	ЭтоТовар = Форма.ТекущаяСтрокаНоменклатуры.ЭтоТовар;
	
	Если Не ЭтоТовар 
			ИЛИ (Форма.НавигацияПоХарактеристикам И 
			Не ЗначениеЗаполнено(Форма.ТекущаяСтрокаХарактеристик.Характеристика))Тогда
		Возврат;
	КонецЕсли;
	
	Валюта = Форма.Валюта;
	Соглашение = Форма.Соглашение;
	
	Если Форма.НавигацияПоХарактеристикам Тогда
		
		Если Не ЗначениеЗаполнено(Форма.ТекущаяСтрокаХарактеристик.Характеристика) Тогда
			Возврат;
		КонецЕсли;
		
		#Удаление
		ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Форма.ТекущаяСтрокаХарактеристик.Характеристика, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен);
		#КонецУдаления
		#Вставка
		//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
		ИнформацияОТоваре = ПодборТоваровВызовСервера.смарт_ЦенаПродажиИОстаткиТовараНовая(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Форма.ТекущаяСтрокаХарактеристик.Характеристика, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен, Форма.смартЗапчастиГарантийные);
		//-- #Б1480 смарт: Шляпников 03.12.2024
		#КонецВставки
		
	Иначе
		
		#Удаление
		ИнформацияОТоваре = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Неопределено, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен);
		#КонецУдаления
		#Вставка
		//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
		ИнформацияОТоваре = ПодборТоваровВызовСервера.смарт_ЦенаПродажиИОстаткиТовараНовая(Форма.ТекущаяСтрокаНоменклатуры.Номенклатура, 
			Неопределено, Соглашение, Валюта, Форма.Склады, Форма.ВидыЦен, Форма.смартЗапчастиГарантийные);
		//-- #Б1480 смарт: Шляпников 03.12.2024
		#КонецВставки
		
	КонецЕсли;
	
	ЦенаПродажиТовара = ИнформацияОТоваре.Цена;
	
	НаименованиеУпаковкиЕдиницыИзмерения = ?(ЗначениеЗаполнено(ЦенаПродажиТовара.Упаковка), 
		Строка(ЦенаПродажиТовара.Упаковка), 
		Строка(ЦенаПродажиТовара.ЕдиницаИзмерения));
	
	Для Каждого СтрокаТбл Из ИнформацияОТоваре.ТекущиеОстатки Цикл
			
		СтрокаОстаткиПоСкладам = ОстаткиПоСкладам.Добавить();
		
		СтрокаОстаткиПоСкладам.Период = Форма.ТекущаяДатаСеанса;
		СтрокаОстаткиПоСкладам.ПериодОписание = НСтр("ru = 'Сейчас'");
		СтрокаОстаткиПоСкладам.Доступно = СтрокаТбл.Свободно;
		#Вставка
		//++ смарт:Подкин #1099 18.07.2022 16:06:21
        СтрокаОстаткиПоСкладам.Резерв = СтрокаТбл.Резерв;  
        СтрокаОстаткиПоСкладам.РезервОплачен = СтрокаТбл.РезервОплачен;
        //-- смарт:Подкин #1099 18.07.2022 16:06:21 
		#КонецВставки
		
		СтрокаОстаткиПоСкладам.ДоступноОписание = ОписаниеДоступногоКоличества(
			СтрокаОстаткиПоСкладам.Доступно,
			НаименованиеУпаковкиЕдиницыИзмерения,
			ХарактеристикиИспользуются,
			Форма.НавигацияПоХарактеристикам);
		
		СтрокаОстаткиПоСкладам.Склад = СтрокаТбл.Склад;
		СтрокаОстаткиПоСкладам.СкладОписание = Строка(СтрокаТбл.Склад);
		СтрокаОстаткиПоСкладам.СкладДоступенДляВыбора = СкладДоступенДляВыбора(Форма, СтрокаОстаткиПоСкладам.Склад);
		
		ПланируемыеОстаткиПоДатам = СтрокаОстаткиПоСкладам.ПолучитьЭлементы();
			
		ЕстьПланируемыеОстатки = Ложь;
		
		#Вставка   
		//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками  
		СтрокаПланируемыеОстаткиПоДатам = Неопределено; 
		//-- #Б-1022 смарт: Мосолов 30.10.2024      
		#КонецВставки  
			
		Для Каждого СтрокаТбл Из ИнформацияОТоваре.ПланируемыеОстатки Цикл
			
			Если Не (СтрокаТбл.Склад = СтрокаОстаткиПоСкладам.Склад) Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьПланируемыеОстатки = Истина;
			
			#Вставка   
			//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками 
			
			Если СтрокаПланируемыеОстаткиПоДатам <> Неопределено 
				И СтрокаПланируемыеОстаткиПоДатам.Период = СтрокаТбл.Период Тогда 
			
				СтрокаПланируемыеОстаткиПоДатам.Доступно = СтрокаПланируемыеОстаткиПоДатам.Доступно + СтрокаТбл.Доступно;
			
			Иначе
			//-- #Б-1022 смарт: Мосолов 30.10.2024     
			#КонецВставки   
			
			СтрокаПланируемыеОстаткиПоДатам = ПланируемыеОстаткиПоДатам.Добавить();
			
			СтрокаПланируемыеОстаткиПоДатам.Период = СтрокаТбл.Период;
			СтрокаПланируемыеОстаткиПоДатам.ПериодОписание = Формат(СтрокаТбл.Период, "ДЛФ=D");  
			СтрокаПланируемыеОстаткиПоДатам.Доступно = СтрокаТбл.Доступно; 
			
			#Вставка
            //++ смарт:Подкин #1099 24.07.2022 22:32:43
            СтрокаПланируемыеОстаткиПоДатам.Резерв = СтрокаТбл.Резерв;  
            //СтрокаПланируемыеОстаткиПоДатам.РезервОплачен = СтрокаТбл.РезервОплачен;
            //-- смарт:Подкин #1099 24.07.2022 22:32:43   
			#КонецВставки
			
			#Вставка   
			//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками  
			КонецЕсли;
			//-- #Б-1022 смарт: Мосолов 30.10.2024     
			#КонецВставки   

			СтрокаПланируемыеОстаткиПоДатам.ДоступноОписание = ОписаниеДоступногоКоличества(
				СтрокаПланируемыеОстаткиПоДатам.Доступно,
				НаименованиеУпаковкиЕдиницыИзмерения,
				ХарактеристикиИспользуются,
				Форма.НавигацияПоХарактеристикам);
			
			СтрокаПланируемыеОстаткиПоДатам.Склад = СтрокаТбл.Склад;
			#Удаление
			СтрокаПланируемыеОстаткиПоДатам.СкладОписание = "";
			#КонецУдаления
			#Вставка
            //++ смарт:Подкин #1099 22.07.2022 15:59:38
           	//СтрокаПланируемыеОстаткиПоДатам.СкладОписание = "";
			//++ #1550 смарт: Корбутов 15.11.2023 
            //СтрокаПланируемыеОстаткиПоДатам.СкладОписание = "В транзите, к: ";
			СтрокаПланируемыеОстаткиПоДатам.СкладОписание = "Итого, к: ";
			//-- #1550 смарт: Корбутов 15.11.2023
            //-- смарт:Подкин #1099 22.07.2022 15:59:38  
			#КонецВставки
			СтрокаПланируемыеОстаткиПоДатам.СкладДоступенДляВыбора = СкладДоступенДляВыбора(Форма, СтрокаПланируемыеОстаткиПоДатам.Склад);
			
		КонецЦикла;
		
		#Удаление //++ #1589 смарт: Мосолов 11.01.2024 //Помощник Продаж мелкие доработки
		Если СтрокаОстаткиПоСкладам.Доступно <= 0  И Не ЕстьПланируемыеОстатки Тогда
			ОстаткиПоСкладам.Удалить(СтрокаОстаткиПоСкладам);	
		КонецЕсли;
		#КонецУдаления
		
		#Вставка
		//++ #1589 смарт: Мосолов 11.01.2024 //Помощник Продаж мелкие доработки 
		Если СтрокаОстаткиПоСкладам.Доступно <= 0  И Не ЕстьПланируемыеОстатки И СтрокаОстаткиПоСкладам.Резерв <= 0 Тогда
			ОстаткиПоСкладам.Удалить(СтрокаОстаткиПоСкладам);	
		КонецЕсли;
		//-- #1589 смарт: Мосолов 11.01.2024
		#КонецВставки
		
	КонецЦикла;
	
КонецПроцедуры
