

//Процедуры автоматического формирования документов передачи товаров 
//между организациями. Товары передаются по закупочным ценам + доп. расходы.

Процедура ПередатьТоварыВДругуюОрганизацию(ДанныеЗаполнения = Неопределено, Документ = Неопределено) Экспорт
	
	//ПартионныйУчетСервер.ВыполнитьРегламентноеФормированиеДвиженийПоПартиямТоваров();

	//Распоряжения = ЖурналыДокументов.ПередачиВозвратыТоваровМеждуОрганизациями.ПолучитьФорму(;
	ДатаНачала = ?(ДанныеЗаполнения = Неопределено,Дата(1,1,1), ДанныеЗаполнения.НачалоПериода);
	ДатаОкончания = ?(ДанныеЗаполнения = Неопределено,НачалоЧаса(ТекущаяДата()), КонецДня(ДанныеЗаполнения.КонецПериода));
	Граница = Новый Граница(ДатаОкончания, ВидГраницы.Включая);
	
		
	Партии = СформироватьЗапросПоПартиям(Граница);
		
	ТЗТовары = Новый ТаблицаЗначений;
	ТЗТовары.Колонки.Добавить("Номенклатура");
	ТЗТовары.Колонки.Добавить("Характеристика");
	ТЗТовары.Колонки.Добавить("ВидЗапасов");
	ТЗТовары.Колонки.Добавить("ВидЗапасовПолучателя");
	ТЗТовары.Колонки.Добавить("НомерГТД");
	ТЗТовары.Колонки.Добавить("Количество");
	ТЗТовары.Колонки.Добавить("Цена");
    ТЗТовары.Колонки.Добавить("Валюта");
	
	Если ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.Свойство("ОбработатьОткрытыйДокумент") Тогда 
		ЗаполнитьТЗТовары(ТЗТовары, ДанныеЗаполнения,Партии);
		Документ.ЦенаВключаетНДС = Истина;
		//Документ.ДатаПлатежа = ДатаОкончания;
		//ТЗТовары.Свернуть("Номенклатура, Характеристика, ВидЗапасов, ВидЗапасовПолучателя, НомерГТД, Валюта", "Цена, Количество");   
		ДанныеЗаполнения.Вставить("Товары", ТЗТовары);
		ЗаполнитьДокументПоПартиямКПередаче(ДанныеЗаполнения, Документ);
		Возврат;
	КонецЕсли;
	
	Распоряжения = СформироватьЗапросПоРаспоряжениям(Граница);
	
	//Распоряжения = ЗапросПоРаспоряжениям.Выполнить();
	
	Если Распоряжения.Пустой() Тогда 
		Возврат;
	КонецЕсли;
			
	РаспоряженияНаПередачуТоваров = Распоряжения.Выбрать();

	
	Пока РаспоряженияНаПередачуТоваров.Следующий() Цикл
		
		 ТЗТовары.Очистить();
		 Если  РаспоряженияНаПередачуТоваров.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию")
			Тогда
			Продолжить;
		 КонецЕсли;
		 ДанныеЗаполнения.Вставить("Организация", РаспоряженияНаПередачуТоваров.Отправитель);
		 ДанныеЗаполнения.Вставить("ОрганизацияПолучатель", РаспоряженияНаПередачуТоваров.Получатель);
		 ЗаполнитьТЗТовары(ТЗТовары, ДанныеЗаполнения,Партии);
		
		 
	
	
	//Для Каждого Строка Из Распоряжения Цикл
	//Строка = Элементы.КОформлению.ТекущиеДанные;
		//Если Строка <> Неопределено Тогда
			СтруктураОснование = Новый Структура("
				|Организация,
				|ОрганизацияПолучатель,
				|Склад,
				|ПередачаПодДеятельность,
				|ТипЗапасов,
				|НачалоПериода,
				|КонецПериода,
				|ЗаполнятьПоСхеме,
				|ХозяйственнаяОперация,
				|Товары",
				РаспоряженияНаПередачуТоваров.Отправитель,
				РаспоряженияНаПередачуТоваров.Получатель,
				РаспоряженияНаПередачуТоваров.Склад,
				РаспоряженияНаПередачуТоваров.ПередачаПодДеятельность,
				РаспоряженияНаПередачуТоваров.ТипЗапасов,
				ДатаНачала,
				ДатаОкончания, 
				Истина,
				РаспоряженияНаПередачуТоваров.ХозяйственнаяОперация,
				ТЗТовары
			);
			СтруктураПараметры = Новый Структура("Основание", СтруктураОснование);
			//
			//Если РаспоряженияНаПередачуТоваров.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию")
			//	Или РаспоряженияНаПередачуТоваров.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию")
			//Тогда
			   СформироватьПередачуТоваров(СтруктураПараметры);
			//ИначеЕсли РаспоряженияНаПередачуТоваров.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями")
			//	Или РаспоряженияНаПередачуТоваров.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями")
			//Тогда
			//	СформироватьВозвратТоваров();
			//КонецЕсли;
		//КонецЕсли;
		//Прервать;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьПередачуТоваров(ДанныеЗаполнения)

	ДокументПередачи = Документы.ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
	//Форма = ДокументПередачи.ПолучитьФорму("ФормаДокумента");
	//Форма.Открыть();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	   И ДанныеЗаполнения.Основание.Свойство("ЗаполнятьПоСхеме") Тогда
	   
		ДокументПередачи.Организация = ДанныеЗаполнения.Основание.Организация;
		ДокументПередачи.ОрганизацияПолучатель = ДанныеЗаполнения.Основание.ОрганизацияПолучатель;
		ДокументПередачи.Склад = ДанныеЗаполнения.Основание.Склад;
		ДокументПередачи.ПоТоварамКОформлению = Истина;
		ДокументПередачи.Дата = НачалоДня(ДанныеЗаполнения.Основание.КонецПериода);
		ДокументПередачи.ЦенаВключаетНДС = Истина;
		//ДокументПередачи.ДатаПлатежа = ДокументПередачи.Дата;
		ДокументПередачи.Валюта = Справочники.Валюты.НайтиПоНаименованию("EUR");
		ДокументПередачи.КонецПериода =  ДокументПередачи.Дата;
		//Если ДанныеЗаполнения.ТипЗапасов = Перечисления.ТипыЗапасов.КомиссионныйТовар Тогда
		//	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию;
		//Иначе
			ДокументПередачи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию;
		//КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Основание.ПередачаПодДеятельность) Тогда
			ДокументПередачи.ПередачаПодДеятельность = ДанныеЗаполнения.Основание.ПередачаПодДеятельность;
		КонецЕсли;
		
		ЗаполнитьДокументПоПартиямКПередаче(ДанныеЗаполнения.Основание, ДокументПередачи);
		
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	// И ДанныеЗаполнения.Свойство("ЗаполнятьПоОтрицательнымОстаткам") Тогда
	// 
	//	Организация = ДанныеЗаполнения.Организация;
	//	ОрганизацияПолучатель = ДанныеЗаполнения.ОрганизацияПолучатель;
	//	Склад = ДанныеЗаполнения.Склад;
	//	Дата = ДанныеЗаполнения.Дата;
	//	
	//	ЗаполнитьПоОтрицательнымОстаткамТоваровОрганизаций(ДанныеЗаполнения
	//	);
		
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда	
	//	ЗаполнитьПоПеремещениюТоваров(
	//		ДанныеЗаполнения,
	//		ДанныеЗаполнения
	//	);
	КонецЕсли;
	
	//ИнициализироватьДокумент(ДанныеЗаполнения, ДокументПередачи);
	//ДокументПередачи.ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	ДокументПередачи.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СформироватьЗапросПоРаспоряжениям(Граница)
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	ВЫБОР
	                              |		КОГДА ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
	                              |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	                              |	КОНЕЦ КАК ХозяйственнаяОперация,
	                              |	НаДату.ВидЗапасовПродавца.НалогообложениеНДС КАК ПередачаПодДеятельность,
	                              |	НаДату.Склад,
	                              |	НаДату.ОрганизацияВладелец КАК Отправитель,
	                              |	ВидЗапасов.Организация КАК Получатель,
	                              |	ВидЗапасов.ТипЗапасов КАК ТипЗапасов
	                              |ИЗ
	                              |	РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&Граница, ) КАК НаДату
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидЗапасов
	                              |		ПО НаДату.ВидЗапасовПродавца = ВидЗапасов.Ссылка
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(, ) КАК НаСейчас
	                              |		ПО НаДату.Номенклатура = НаСейчас.Номенклатура
	                              |			И НаДату.Характеристика = НаСейчас.Характеристика
	                              |			И НаДату.НомерГТД = НаСейчас.НомерГТД
	                              |			И НаДату.ВидЗапасовПродавца = НаСейчас.ВидЗапасовПродавца
	                              |			И НаДату.ОрганизацияВладелец = НаСейчас.ОрганизацияВладелец
	                              |			И НаДату.Склад = НаСейчас.Склад
	                              |ГДЕ
	                              |	ЕСТЬNULL(НаСейчас.КоличествоОстаток, 0) > 0
	                              |
	                              |ОБЪЕДИНИТЬ ВСЕ
	                              |
	                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	ВЫБОР
	                              |		КОГДА ВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	                              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями)
	                              |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	                              |	КОНЕЦ,
	                              |	НаДату.ВидЗапасовПродавца.НалогообложениеНДС,
	                              |	НаДату.Склад,
	                              |	ВидыЗапасов.Организация,
	                              |	НаДату.ОрганизацияВладелец,
	                              |	ВидыЗапасов.ТипЗапасов
	                              |ИЗ
	                              |	РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&Граница, ) КАК НаДату
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	                              |		ПО НаДату.ВидЗапасовПродавца = ВидыЗапасов.Ссылка
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(, ) КАК НаСейчас
	                              |		ПО НаДату.Номенклатура = НаСейчас.Номенклатура
	                              |			И НаДату.Характеристика = НаСейчас.Характеристика
	                              |			И НаДату.НомерГТД = НаСейчас.НомерГТД
	                              |			И НаДату.ВидЗапасовПродавца = НаСейчас.ВидЗапасовПродавца
	                              |			И НаДату.ОрганизацияВладелец = НаСейчас.ОрганизацияВладелец
	                              |			И НаДату.Склад = НаСейчас.Склад
	                              |ГДЕ
	                              |	ЕСТЬNULL(НаСейчас.ВозвращеноОстаток, 0) > 0";
	
	Запрос.УстановитьПараметр("Граница", Граница);
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПоПартиям(Граница)
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыОрганизацийКПередачеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыОрганизацийКПередачеОстатки.Характеристика,
	               |	ТоварыОрганизацийКПередачеОстатки.ВидЗапасовПродавца.ВидЗапасовВладельца КАК ВидЗапасов,
	               |	ТоварыОрганизацийКПередачеОстатки.ВидЗапасовПродавца КАК ВидЗапасовПолучателя,
	               |	ТоварыОрганизацийКПередачеОстатки.НомерГТД КАК НомерГТД,
	               |	ТоварыОрганизацийКПередачеОстатки.КоличествоОстаток,
	               |	ТоварыОрганизацийКПередачеОстатки.ОрганизацияВладелец,
	               |	ТоварыОрганизацийКПередачеОстатки.ВидЗапасовПродавца.Организация КАК ОрганизацияПолучатель
	               |ПОМЕСТИТЬ ТоварыКПередаче
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&Граница, ) КАК ТоварыОрганизацийКПередачеОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьПартииТоваровОрганизаций.Регистратор,
	               |	ПоследовательностьПартииТоваровОрганизаций.Период КАК Период,
	               |	ПоследовательностьПартииТоваровОрганизаций.Номенклатура КАК Номенклатура,
	               |	ПоследовательностьПартииТоваровОрганизаций.Характеристика,
	               |	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток,
	               |	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьБезНДСОстаток, 0) КАК СтоимостьБезНДСОстаток,
	               |	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьРеглОстаток, 0) КАК СтоимостьРеглОстаток,
	               |	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.НДСРеглОстаток, 0) КАК НДСРеглОстаток,
	               |	ЕСТЬNULL(ТоварыКПередаче.КоличествоОстаток, 0) КАК КоличествоКПередаче,
	               |	ТоварыКПередаче.ОрганизацияВладелец,
	               |	ТоварыКПередаче.ОрганизацияПолучатель,
	               |	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьОстаток, 0) / ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.КоличествоОстаток, 0) КАК ЦенаПартии,
	               |	ТоварыКПередаче.ВидЗапасов,
	               |	ТоварыКПередаче.ВидЗапасовПолучателя,
	               |	ТоварыКПередаче.НомерГТД
	               |ПОМЕСТИТЬ ПартииКПередаче
	               |ИЗ
	               |	ТоварыКПередаче КАК ТоварыКПередаче
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций.Остатки(
	               |				&Граница,
	               |				(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	               |					(ВЫБРАТЬ
	               |						ТоварыКПередаче.Номенклатура,
	               |						ТоварыКПередаче.Характеристика
	               |					ИЗ
	               |						ТоварыКПередаче)) КАК ПартииТоваровОрганизацийОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Последовательность.ПартииТоваровОрганизаций КАК ПоследовательностьПартииТоваровОрганизаций
	               |			ПО (ПоследовательностьПартииТоваровОрганизаций.Регистратор.Организация = ПартииТоваровОрганизацийОстатки.Организация)
	               |				И (ПоследовательностьПартииТоваровОрганизаций.Номенклатура = ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура)
	               |				И (ПоследовательностьПартииТоваровОрганизаций.Регистратор = ПартииТоваровОрганизацийОстатки.ДокументПоступления)
	               |				И (ПоследовательностьПартииТоваровОрганизаций.Характеристика = ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика)
	               |		ПО (ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ТоварыКПередаче.Номенклатура)
	               |			И (ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика = ТоварыКПередаче.Характеристика)
	               |			И ТоварыКПередаче.ОрганизацияВладелец = ПартииТоваровОрганизацийОстатки.Организация
	               |ГДЕ
	               |	ПартииТоваровОрганизацийОстатки.КоличествоОстаток > 0
	               |	//И ПартииТоваровОрганизацийОстатки.СтоимостьОстаток >= 0
	               |	И НЕ ПоследовательностьПартииТоваровОрганизаций.Регистратор ЕСТЬ NULL 
	               |    
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ
				   //|	ПоследовательностьПартииТоваровОрганизаций.Регистратор,
				   //|	ПоследовательностьПартииТоваровОрганизаций.Период,
				   //|	ПоследовательностьПартииТоваровОрганизаций.Номенклатура,
				   //|	ПоследовательностьПартииТоваровОрганизаций.Характеристика,
				   //|	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.КоличествоОстаток, 0),
				   //|	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьОстаток, 0),
				   //|	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьБезНДСОстаток, 0),
				   //|	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьРеглОстаток, 0),
				   //|	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.НДСРеглОстаток, 0),
				   //|	ЕСТЬNULL(ТоварыКПередаче.КоличествоОстаток, 0),
				   //|	ТоварыКПередаче.ОрганизацияВладелец,
				   //|	ТоварыКПередаче.ОрганизацияПолучатель,
				   //|	ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.СтоимостьОстаток, 0) / ЕСТЬNULL(ПартииТоваровОрганизацийОстатки.КоличествоОстаток, 0),
				   //|	ТоварыКПередаче.ВидЗапасов,
				   //|	ТоварыКПередаче.ВидЗапасовПолучателя,
				   //|	ТоварыКПередаче.НомерГТД
				   //|ИЗ
				   //|	ТоварыКПередаче КАК ТоварыКПередаче
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций.Остатки(
				   //|				&ДатаКонецМесяца,
				   //|				(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
				   //|					(ВЫБРАТЬ
				   //|						ТоварыКПередаче.Номенклатура,
				   //|						ТоварыКПередаче.Характеристика
				   //|					ИЗ
				   //|						ТоварыКПередаче)) КАК ПартииТоваровОрганизацийОстатки
				   //|			ЛЕВОЕ СОЕДИНЕНИЕ Последовательность.ПартииТоваровОрганизаций КАК ПоследовательностьПартииТоваровОрганизаций
				   //|			ПО (ПоследовательностьПартииТоваровОрганизаций.Регистратор.Организация = ПартииТоваровОрганизацийОстатки.Организация)
				   //|				И (ПоследовательностьПартииТоваровОрганизаций.Номенклатура = ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура)
				   //|				И (ПоследовательностьПартииТоваровОрганизаций.Регистратор = ПартииТоваровОрганизацийОстатки.ДокументПоступления)
				   //|				И (ПоследовательностьПартииТоваровОрганизаций.Характеристика = ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика)
				   //|		ПО (ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ТоварыКПередаче.Номенклатура)
				   //|			И (ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика = ТоварыКПередаче.Характеристика)
				   //|			И ТоварыКПередаче.ОрганизацияВладелец = ПартииТоваровОрганизацийОстатки.Организация
				   //|ГДЕ
				   //|	ПартииТоваровОрганизацийОстатки.КоличествоОстаток > 0
				   //|	И ПартииТоваровОрганизацийОстатки.СтоимостьОстаток >= 0
				   //|	И НЕ ПоследовательностьПартииТоваровОрганизаций.Регистратор ЕСТЬ NULL 
				   //|	И ПоследовательностьПартииТоваровОрганизаций.Период > &Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииКПередаче.Регистратор,
	               |	ПартииКПередаче.Период КАК Период,
	               |	ПартииКПередаче.Номенклатура КАК Номенклатура,
	               |	ПартииКПередаче.Характеристика КАК Характеристика,
	               |	ПартииКПередаче.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииКПередаче.СтоимостьОстаток,
	               |	ПартииКПередаче.СтоимостьБезНДСОстаток,
	               |	ПартииКПередаче.СтоимостьРеглОстаток,
	               |	ПартииКПередаче.НДСРеглОстаток,
	               |	ПартииКПередаче.КоличествоКПередаче КАК КоличествоКПередаче,
	               |	ПартииКПередаче.ОрганизацияВладелец КАК Организация,
	               |	ПартииКПередаче.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслуг.Груз.КоэффициентНаценки, 0) КАК КоэффициентНаценки,
	               |	ПартииКПередаче.ЦенаПартии + ПартииКПередаче.ЦенаПартии * ЕСТЬNULL(ПоступлениеТоваровУслуг.Груз.КоэффициентНаценки, 0) КАК Цена,
	               |	ПартииКПередаче.ВидЗапасов,
	               |	ПартииКПередаче.ВидЗапасовПолучателя,
	               |	ПартииКПередаче.НомерГТД,
	               |	ПартииКПередаче.Регистратор.Валюта КАК Валюта
	               |ИЗ
	               |	ПартииКПередаче КАК ПартииКПередаче
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |		ПО ПартииКПередаче.Регистратор = ПоступлениеТоваровУслуг.Ссылка
	               |			И ПартииКПередаче.Регистратор = ПоступлениеТоваровУслуг.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	Характеристика,
	               |	Период,
	               |	ОрганизацияПолучатель,
	               |	ПартииКПередаче.ОрганизацияВладелец
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток),
	               |	МАКСИМУМ(КоличествоКПередаче)
	               |ПО
	               |	ОрганизацияПолучатель,
	               |	Организация,
	               |	Номенклатура,
	               |	Характеристика";
	
	Запрос.УстановитьПараметр("Граница",Граница);
	Запрос.УстановитьПараметр("ДатаКонецМесяца",КонецМесяца(Граница.Значение));
	//Запрос.УстановитьПараметр("Дата",Граница.Значение);
	
	Результат = Запрос.Выполнить();
    Возврат Результат;
КонецФункции

Процедура ЗаполнитьДокументПоПартиямКПередаче(Параметры, Документ) Экспорт
	
		
	Документ.Товары.Очистить();
	ТаблицаТовары = Документ.Товары.Выгрузить();
	
	//Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого Строка Из Параметры.Товары Цикл
		
		НоваяСтрока = Документ.ВидыЗапасов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрокаТоваров = ТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, Строка);
		НоваяСтрокаТоваров.КоличествоУпаковок = НоваяСтрокаТоваров.Количество;
		НоваяСтрокаТоваров.Сумма = НоваяСтрокаТоваров.Количество*НоваяСтрокаТоваров.Цена;
		//НоваяСтрокаТоваров.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(НоваяСтрокаТоваров.Сумма,НоваяСтрокаТоваров.СтавкаНДС, СтруктураПараметровДействия.ЦенаВключаетНДС);
	КонецЦикла;
	
	//ТаблицаТовары.Свернуть("Номенклатура, Характеристика, СтавкаНДС", "Количество, КоличествоУпаковок");
	Документ.Товары.Загрузить(ТаблицаТовары);
	
	ЗаполнитьРеквизитыПоУмолчаниюВТабличнойЧасти(Документ);
	ИнициализироватьДокумент(Параметры, Документ);
    Документ.ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
КонецПроцедуры
  
Процедура ЗаполнитьРеквизитыПоУмолчаниюВТабличнойЧасти(Документ)
	
	Документ.НалогообложениеНДС = Справочники.Организации.НалогообложениеНДС(
		Документ.Организация,
		Неопределено, // Склад
		Документ.Дата
	);
	
	КэшированныеЗначения = Неопределено;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Документ);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",  Документ.НалогообложениеНДС);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);

	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, КэшированныеЗначения);

	Если Не ЗначениеЗаполнено(Документ.ВидЦены) Тогда
		Документ.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Документ.ВидЦены) Тогда
		
		//Реквизиты = Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(Документ.ВидЦены);
		//Валюта = Реквизиты.ВалютаЦены;
		//ВалютаВзаиморасчетов = Реквизиты.ВалютаЦены;
		//ЦенаВключаетНДС = Реквизиты.ЦенаВключаетНДС;
		//
		//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Документ);
		//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
	
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, КэшированныеЗначения);
		//ПродажиСервер.ЗаполнитьЦены(
		//	Документ.Товары, // Табличная часть
		//	, // Массив строк или структура отбора
		//	Новый Структура( // Параметры заполнения
		//		"Дата, Валюта, ВидЦены, ПоляЗаполнения",
		//		Документ.Дата,
		//		Валюта,
		//		Документ.ВидЦены,
		//		"Цена, ВидЦены"
		//	),
		//	Новый Структура( // Структура действий с измененными строками
		//		"ПересчитатьСумму, ПересчитатьСуммуСНДС, ПересчитатьСуммуНДС",
		//		"КоличествоУпаковок", СтруктураПересчетаСуммы, СтруктураПересчетаСуммы
		//	)
		//);
		
	//КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено, Документ)

	Документ.Менеджер = Пользователи.ТекущийПользователь();
	Документ.Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Документ.Организация);
	Документ.Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Документ.Склад);
	Документ.БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Документ.Организация, , Документ.БанковскийСчетОрганизации);
	Документ.БанковскийСчетОрганизацииПолучателя = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Документ.ОрганизацияПолучатель, , Документ.БанковскийСчетОрганизацииПолучателя);
	Документ.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь(), Документ.Подразделение);
	Документ.Дата = НачалоДня(ДанныеЗаполнения.КонецПериода);
	Документ.ДатаПлатежа = Документ.Дата;
	//Документ.КонецПериода = 
	//Если Не ЗначениеЗаполнено(Документ.ВидЦены) Тогда
	//	Документ.ВидЦены = Справочники.ВидыЦен.ВидЦеныПоУмолчанию(Истина, Документ.ВидЦены);
	//	Если ЗначениеЗаполнено(Документ.ВидЦены) Тогда
	//		Реквизиты = Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(Документ.ВидЦены);
	//		Документ.Валюта = Реквизиты.ВалютаЦены;
	//		Документ.ЦенаВключаетНДС = Реквизиты.ЦенаВключаетНДС;
	//	Иначе
			
	Если (ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или НЕ ДанныеЗаполнения.Свойство("Валюта")) 
		И НЕ ДанныеЗаполнения.Свойство("ОбработатьОткрытыйДокумент") Тогда
				Документ.Валюта    = ДоходыИРасходыСервер.ПолучитьВалютуРегламентированногоУчета(Документ.Валюта);
			Иначе
			    Документ.Валюта = Справочники.Валюты.НайтиПоНаименованию("EUR");
			КонецЕсли;
			
		//КонецЕсли;
		Документ.ВалютаВзаиморасчетов = Документ.Валюта;
	//КонецЕсли;
	
	ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(Документ.Валюта, Документ.НалогообложениеНДС);
	Документ.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.ПолучитьГруппуФинансовогоУчетаПоУмолчанию(ПорядокОплаты);
	
КонецПроцедуры

Процедура ЗаполнитьТЗТовары(ТЗТовары, ДанныеЗаполнения,Партии)
	
	ВыборкаОрганизацийПолучателей = Партии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ОрганизацияПолучатель");
	//Если ВыборкаОрганизацийПолучателей.Количество() = 0 Тогда
		
		 Пока ВыборкаОрганизацийПолучателей.Следующий() Цикл

	     Если ДанныеЗаполнения.ОрганизацияПолучатель <> ВыборкаОрганизацийПолучателей.ОрганизацияПолучатель Тогда
					 Продолжить;
				 КонецЕсли;
	
		ВыборкаОрганизаций = ВыборкаОрганизацийПолучателей.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Организация");
		
			 Пока ВыборкаОрганизаций.Следующий() Цикл
				 
				 Если ДанныеЗаполнения.Организация <> ВыборкаОрганизаций.Организация Тогда
					 Продолжить;
				 КонецЕсли;
				 
				 ВыборкаТоваров = ВыборкаОрганизаций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
				 
				 Пока ВыборкаТоваров.Следующий() Цикл
					 
					 ВыборкаТоваровПоХарактеристикам = ВыборкаТоваров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Характеристика"); 
					 
					 Пока ВыборкаТоваровПоХарактеристикам.Следующий() Цикл
						 
						 Если ВыборкаТоваровПоХарактеристикам.КоличествоОстаток < ВыборкаТоваровПоХарактеристикам.КоличествоКПередаче Тогда
							 Сообщить("Не хватает товара " + ВыборкаТоваровПоХарактеристикам.Номенклатура + "! В Количестве " 
							 + (ВыборкаТоваровПоХарактеристикам.КоличествоКПередаче - ВыборкаТоваровПоХарактеристикам.КоличествоОстаток) + 
							 ".");
							 Продолжить;
						 КонецЕсли;
						 
						// НехваткаТовара = 0;
						 КоличествоКПередаче = ВыборкаТоваровПоХарактеристикам.КоличествоКПередаче;
						 КоличествоВПартии = КоличествоКПередаче;
						 СтрокаТовар = ВыборкаТоваровПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
						 
						 Пока СтрокаТовар.Следующий() Цикл
							 
							 Сч=0;
							 СуммаЦен = 0;
							 Если СтрокаТовар.КоличествоОстаток < КоличествоКПередаче Тогда   
								 КоличествоКПередаче  = КоличествоКПередаче - СтрокаТовар.КоличествоОстаток;
								 //КоличествоВПартии = СтрокаТовар.КоличествоОстаток;
								 СуммаЦен = СуммаЦен+СтрокаТовар.Цена;
								 Сч = Сч+1;
								 Продолжить;
							 Иначе
								 Сч = Сч+1;
								// КоличествоВПартии = КоличествоКПередаче;
								 СуммаЦен = СуммаЦен+СтрокаТовар.Цена;
								 //Цена = СтрокаТовар.Цена;
								 КоличествоКПередаче = 0;
							 КонецЕсли;
							 
							 НоваяСтрока = ТЗТовары.Добавить();
							 НоваяСтрока.Номенклатура =  СтрокаТовар.Номенклатура;
							 НоваяСтрока.Характеристика =  СтрокаТовар.Характеристика;
							 НоваяСтрока.Количество =  КоличествоВПартии;
							 //Если СтрокаТовар.Валюта = Справочники.Валюты.НайтиПоНаименованию("EUR") Тогда
							 Если СуммаЦен = 0 Тогда
								  НоваяСтрока.Цена = 0;
							 Иначе
								  НоваяСтрока.Цена =  СуммаЦен/Сч;//СтрокаТовар.Цена;
							 КонецЕсли;	  
						   //  Иначе
						   // 	 Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(Справочники.Валюты.НайтиПоНаименованию("EUR"), СтрокаТовар.Валюта, ТекущаяДата());
						   //	  НоваяСтрока.Цена = ?(Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов <> 0, СтрокаТовар.Цена / Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов, 0);
						   //КонецЕсли;
						     НоваяСтрока.ВидЗапасов = СтрокаТовар.ВидЗапасов;
							 НоваяСтрока.ВидЗапасовПолучателя = СтрокаТовар.ВидЗапасовПолучателя;
							 НоваяСтрока.НомерГТД = СтрокаТовар.НомерГТД;
							 
							
							 Если КоличествоКПередаче = 0 Тогда
								 Прервать;
							 КонецЕсли;
							 
				 	 	КонецЦикла;
				 	 КонецЦикла;
	             КонецЦикла;
			 КонецЦикла;
		КонецЦикла;	 
	КонецПроцедуры	
	
	//Коректировка регламентированной стоимости
Процедура СкорректироватьСтоимостьРеглСебестоимовтиТоваров() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СебестоимостьТоваров.Период,
		|	СебестоимостьТоваров.Регистратор,
		|	СебестоимостьТоваров.НомерСтроки,
		|	СебестоимостьТоваров.Активность,
		|	СебестоимостьТоваров.ВидДвижения,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.РазделУчета,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.Количество,
		|	СебестоимостьТоваров.Стоимость,
		|	СебестоимостьТоваров.СтоимостьБезНДС,
		|	СебестоимостьТоваров.СуммаДопРасходов,
		|	СебестоимостьТоваров.СуммаДопРасходовБезНДС,
		|	СебестоимостьТоваров.ХозяйственнаяОперация,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.КорРазделУчета,
		|	СебестоимостьТоваров.КорВидЗапасов,
		|	СебестоимостьТоваров.КорОрганизация,
		|	СебестоимостьТоваров.КорСтоимость,
		|	СебестоимостьТоваров.АналитикаУчетаПоПартнерам,
		|	СебестоимостьТоваров.ЗаказКлиента,
		|	СебестоимостьТоваров.Подразделение,
		|	СебестоимостьТоваров.АналитикаРасходов,
		|	СебестоимостьТоваров.СтатьяРасходовСписания,
		|	СебестоимостьТоваров.СтатьяДоходов,
		|	СебестоимостьТоваров.АналитикаДоходов,
		|	СебестоимостьТоваров.ПериодПродажи,
		|	//ВЫБОР
		|	//	КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	//		ТОГДА 
		|   ПартииТоваровОрганизаций.СтоимостьРегл
		|		//ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
		|	//КОНЕЦ КАК СтоимостьРегл
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваровОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ПО ПартииТоваровОрганизаций.Регистратор = СебестоимостьТоваров.Регистратор
		|			И ПартииТоваровОрганизаций.ВидДвижения = СебестоимостьТоваров.ВидДвижения
		|			И ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры = СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|			И ПартииТоваровОрганизаций.Организация = СебестоимостьТоваров.Организация
		|			И ПартииТоваровОрганизаций.ХозяйственнаяОперация = СебестоимостьТоваров.ХозяйственнаяОперация
		|ГДЕ
		|	ПартииТоваровОрганизаций.Активность
		|	И ПартииТоваровОрганизаций.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
		|	И ПартииТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ПартииТоваровОрганизаций.СтоимостьРегл <> СебестоимостьТоваров.СтоимостьРегл";

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыККорректировке = Результат.Выгрузить();
    
	ТаблицаКорректировки = РегистрыНакопления.СебестоимостьТоваров.СоздатьНаборЗаписей();
	
			
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТаблицаКорректировки.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
			ТаблицаКорректировки.Прочитать();
			
	       Для Каждого Запись Из ТаблицаКорректировки Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход ИЛИ 
					Запись.АналитикаУчетаНоменклатуры <> ВыборкаДетальныеЗаписи.АналитикаУчетаНоменклатуры ИЛИ
					(Запись.АналитикаУчетаНоменклатуры = ВыборкаДетальныеЗаписи.АналитикаУчетаНоменклатуры
					И Запись.НомерСтроки <> ВыборкаДетальныеЗаписи.НомерСтроки)Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи); 
				НачатьТранзакцию();
				ТаблицаКорректировки.Записывать = Истина;
				ТаблицаКорректировки.Записать(Истина);
				ЗафиксироватьТранзакцию();

		   КонецЦикла;

	    КонецЦикла;


		
		
КонецПроцедуры

//Формирование журнала регистраций изменений в документах

//Процедура ЗарегистрироватьИзмененияВЖурнале(Объект) Экспорт
//	
//	Если Объект.ЭтоНовый() Тогда
//		ВыполненоДействие = Перечисления.ДействияСДокументами.СозданиеНового;
//	ИначеЕсли Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		ВыполненоДействие = Перечисления.ДействияСДокументами.Проведение;
//	ИначеЕсли Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
//		ВыполненоДействие = Перечисления.ДействияСДокументами.Запись;
//	ИначеЕсли НЕ Объект.ПометкаУдаления И Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
//		ВыполненоДействие = Перечисления.ДействияСДокументами.ОтменаПроведения;
//	ИначеЕсли Объект.ПометкаУдаления И Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
//		ВыполненоДействие = Перечисления.ДействияСДокументами.ПометкаНаУдаление;
//	КонецЕсли;
//	
//	//Сообщить("Выполнено действие - " + ВыполненоДействие);
//	
//	// добавляем запись в РС
//	//РегистрыСведений.НастройкиТранспортаОбмена.ДобавитьЗапись(СтруктураЗаписи);
//	  //НаборАдресныхСведений = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
//	  //  НаборАдресныхСведений.Отбор.КодАдресногоОбъектаВКоде.Использование = Истина;
//	  //  НаборАдресныхСведений.Отбор.КодАдресногоОбъектаВКоде.Значение = Число(КодАдресногоОбъекта);
//	  //  НаборАдресныхСведений.Записать();
//	   МенеджерЗаписи = РегистрыСведений.ЖурналРегистрацииДействийСДокументами.СоздатьМенеджерЗаписи();
//	   //НаборЗаписей.Добавить();
//	   МенеджерЗаписи.Документ = Объект.Ссылка;
//	   МенеджерЗаписи.Дата = ТекущаяДата();
//	   МенеджерЗаписи.Действие = ВыполненоДействие;
//	   МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
//	   //НаборЗаписей.Записывать = Истина;
//	   МенеджерЗаписи.Записать();
//	   
//	   //Удалим не актуальные записи журнала старше трех месяцев.
//	   Запрос = Новый Запрос;
//	   Запрос.Текст = "ВЫБРАТЬ
//	   |	ЖурналРегистрацииДействийСДокументами.Дата,
//	   |	ЖурналРегистрацииДействийСДокументами.Документ,
//	   |	ЖурналРегистрацииДействийСДокументами.Пользователь,
//	   |	ЖурналРегистрацииДействийСДокументами.Действие
//	   |ИЗ
//	   |	РегистрСведений.ЖурналРегистрацииДействийСДокументами КАК ЖурналРегистрацииДействийСДокументами
//	   |ГДЕ
//	   |	ЖурналРегистрацииДействийСДокументами.Дата > &Дата";
//	   
//	   АктуальнаяДата = ТекущаяДата() - 86400*90; 
//	   Запрос.УстановитьПараметр("Дата", АктуальнаяДата);
//	   
//	   Результат = Запрос.Выполнить();
//	   Если Результат.Пустой() Тогда 
//		   Возврат;
//	   Конецесли;
//	   
//	   НаборЗаписей = РегистрыСведений.ЖурналРегистрацииДействийСДокументами.СоздатьНаборЗаписей();
//	   Выборка = Результат.Выгрузить();
//	   НаборЗаписей.Загрузить(Выборка);
//	   НаборЗаписей.Записать();
//	   //Пока Выборка.Следующий() Цикл
//	   //
//	   //	
//	   //
//	   //КонецЦикла;
//	   
//	   
//КонецПроцедуры	
//   
   
Процедура ОтразитьДопРасходыНаРеализацииИнтеркампани(Месяц) Экспорт
	   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПартииРасходовНаСебестоимостьТоваров.Период,
		|	ПартииРасходовНаСебестоимостьТоваров.Регистратор,
		|	ПартииРасходовНаСебестоимостьТоваров.ВидДвижения,
		|	ПартииРасходовНаСебестоимостьТоваров.Организация,
		|	ПартииРасходовНаСебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	ПартииРасходовНаСебестоимостьТоваров.ДокументПоступления,
		|	ПартииРасходовНаСебестоимостьТоваров.ВидЗапасов,
		|	ПартииРасходовНаСебестоимостьТоваров.АналитикаУчетаПартий,
		|	ПартииРасходовНаСебестоимостьТоваров.ДокументПоступленияРасходов,
		|	ПартииРасходовНаСебестоимостьТоваров.СтатьяРасходов,
		|	ПартииРасходовНаСебестоимостьТоваров.Количество,
		|	ПартииРасходовНаСебестоимостьТоваров.Стоимость,
		|	ПартииРасходовНаСебестоимостьТоваров.СтоимостьБезНДС,
		|	ПартииРасходовНаСебестоимостьТоваров.СтоимостьРегл,
		|	ПартииРасходовНаСебестоимостьТоваров.НДСРегл,
		|	ПартииРасходовНаСебестоимостьТоваров.НалогообложениеНДС,
		|	ПартииРасходовНаСебестоимостьТоваров.МоментВремени,
		|	ПартииРасходовНаСебестоимостьТоваров.Активность
		|ПОМЕСТИТЬ ПередачиТоваровРасход
		|ИЗ
		|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ПартииРасходовНаСебестоимостьТоваров
		|ГДЕ
		|	ПартииРасходовНаСебестоимостьТоваров.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
		|	И ПартииРасходовНаСебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ПартииРасходовНаСебестоимостьТоваров.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПартииТоваров.Период,
		|	ПартииТоваров.Регистратор,
		|	ПартииТоваров.ВидДвижения,
		|	ПартииТоваров.Организация,
		|	ПартииТоваров.АналитикаУчетаНоменклатуры,
		|	ПередачиТоваровРасход.ДокументПоступления,
		|	ПартииТоваров.ВидЗапасов,
		|	ПартииТоваров.АналитикаУчетаПартий,
		|	ПередачиТоваровРасход.ДокументПоступленияРасходов,
		|	ПередачиТоваровРасход.СтатьяРасходов КАК СтатьяРасходов,
		|	ПартииТоваров.Количество,
		|	ПередачиТоваровРасход.Стоимость,
		|	ПередачиТоваровРасход.СтоимостьБезНДС,
		|	ПередачиТоваровРасход.СтоимостьРегл,
		|	ПередачиТоваровРасход.НДСРегл,
		|	ПередачиТоваровРасход.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ПередачиТоваровРасход.МоментВремени,
		|	ПартииТоваров.Активность
		|ИЗ
		|	ПередачиТоваровРасход КАК ПередачиТоваровРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваров
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		|			ПО (ТоварыОрганизаций.Регистратор = ПартииТоваров.Регистратор)
		|				И (ТоварыОрганизаций.АналитикаУчетаНоменклатуры = ПартииТоваров.АналитикаУчетаНоменклатуры)
		|				И (ТоварыОрганизаций.ВидЗапасов = ПартииТоваров.ВидЗапасов)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Документ
		|			ПО (Документ.Ссылка = ПартииТоваров.Регистратор)
		|		ПО ПередачиТоваровРасход.Регистратор = ПартииТоваров.ДокументПоступления
		|			И ПередачиТоваровРасход.АналитикаУчетаНоменклатуры = ПартииТоваров.АналитикаУчетаНоменклатуры
		|ГДЕ
		|	ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ПартииТоваров.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ПартииТоваров.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|	И ПартииТоваров.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПартииТоваров.Период,
		|	ПартииТоваров.Регистратор,
		|	ПартииТоваров.ВидДвижения,
		|	ПартииТоваров.Организация,
		|	ПартииТоваров.АналитикаУчетаНоменклатуры,
		|	ПередачиТоваровРасход.ДокументПоступления,
		|	ПартииТоваров.ВидЗапасов,
		|	ПартииТоваров.АналитикаУчетаПартий,
		|	ПередачиТоваровРасход.ДокументПоступленияРасходов,
		|	ПередачиТоваровРасход.СтатьяРасходов,
		|	ПартииТоваров.Количество,
		|	ПередачиТоваровРасход.Стоимость,
		|	ПередачиТоваровРасход.СтоимостьБезНДС,
		|	ПередачиТоваровРасход.СтоимостьРегл,
		|	ПередачиТоваровРасход.НДСРегл,
		|	ПередачиТоваровРасход.НалогообложениеНДС,
		|	НЕОПРЕДЕЛЕНО,
		|	ПартииТоваров.Активность
		|ИЗ
		|	ПередачиТоваровРасход КАК ПередачиТоваровРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваров
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		|			ПО (ТоварыОрганизаций.Регистратор = ПартииТоваров.Регистратор)
		|				И (ТоварыОрганизаций.АналитикаУчетаНоменклатуры = ПартииТоваров.АналитикаУчетаНоменклатуры)
		|				И (ТоварыОрганизаций.ВидЗапасов = ПартииТоваров.ВидЗапасов)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Документ
		|			ПО (Документ.Ссылка = ПартииТоваров.Регистратор)
		|		ПО ПередачиТоваровРасход.Регистратор = ПартииТоваров.ДокументПоступления
		|			И ПередачиТоваровРасход.АналитикаУчетаНоменклатуры = ПартииТоваров.АналитикаУчетаНоменклатуры
		|ГДЕ
		|	ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ПартииТоваров.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ПартииТоваров.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|	И ПартииТоваров.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг";

	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Месяц));
	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ТаблицаДопРасходов = Результат.Выгрузить();
	
	НачатьТранзакцию();
	НаборЗаписей = РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров.СоздатьНаборЗаписей();
	
	Для каждого НоваяЗапись ИЗ ТаблицаДопРасходов Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(НоваяЗапись.Регистратор);
		НаборЗаписей.Прочитать();
        
		ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
		НаборЗаписейДляПроверки = НаборЗаписей.Выгрузить();
		НаборЗаписейДляПроверки.Колонки.Удалить("НомерСтроки");
		НаборЗаписейДляПроверки.Колонки.Удалить("МоментВремени");
		
		Отбор = НоваяЗапись;
		
		ЗаписыватьДвижение = Истина;
		Для каждого Запись Из НаборЗаписейДляПроверки Цикл
			Если Запись.Активность = Отбор.Активность И Запись.АналитикаУчетаНоменклатуры = Отбор.АналитикаУчетаНоменклатуры И
				Запись.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартий И Запись.ВидДвижения = Отбор.ВидДвижения
				И Запись.ВидЗапасов = Отбор.ВидЗапасов И Запись.ДокументПоступления = Отбор.ДокументПоступления И
				Запись.ДокументПоступленияРасходов = Отбор.ДокументПоступленияРасходов И Запись.Количество = Отбор.Количество И
				Запись.НДСРегл = Отбор.НДСРегл И Запись.НалогообложениеНДС = Отбор.НалогообложениеНДС И
				Запись.Организация = Отбор.Организация И Запись.Период = Отбор.Период И
				Запись.Регистратор = Отбор.Регистратор И Запись.СтатьяРасходов = Отбор.СтатьяРасходов И
				Запись.Стоимость = Отбор.Стоимость И Запись.СтоимостьБезНДС = Отбор.СтоимостьБезНДС И
				Запись.СтоимостьРегл = Отбор.СтоимостьРегл	Тогда
				
				ЗаписыватьДвижение = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		
		Если Не ЗаписыватьДвижение Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись.МоментВремени = Новый МоментВремени(НоваяЗапись.Период, НоваяЗапись.Регистратор);
		
		Движение = ТаблицаНабораЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,НоваяЗапись);
		
		НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Записать(Истина);
	    НаборЗаписей.Очистить();
		ТаблицаНабораЗаписей.Очистить();
		НаборЗаписейДляПроверки.Очистить();
		
	КонецЦикла;
	
    ЗафиксироватьТранзакцию();
     		   
КонецПроцедуры


Процедура СкорректироватьТаблицуОстатковПоАналитикеУчетаПартий(ОбрабатываемыйМесяц) Экспорт
	
	//ОтборДокументовРасхода = Новый Структура;
	////ОтборПоПустойАналитике.Вставить("АналитикаУчетаПартий",Неопределено);// Справочники.КлючиАналитикиУчетаПартий.ПустаяСсылка());//Неопределено);
	//ОтборДокументовРасхода.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
	////ОтборПоПустойАналитике.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	////ОтборПоПустойАналитике.Вставить("ТипЗнч(ДокументПоступления)", Тип(Документы.ПередачаТоваровМеждуОрганизациями));
	////ОтборПоПустойАналитике2 = Новый Структура;
	////ОтборПоПустойАналитике2.Вставить("АналитикаУчетаПартий",Справочники.КлючиАналитикиУчетаПартий.ПустаяСсылка());//Неопределено);
	////ОтборПоПустойАналитике2.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);

	//МассивРасходов = ТаблицаОстатков.НайтиСтроки(ОтборДокументовРасхода);
	////МассивРасходов2 = ТаблицаОстатков.НайтиСтроки(ОтборПоПустойАналитике2);
	////
	////Если МассивРасходов1.Количество() = 0 И МассивРасходов2.Количество() = 0 Тогда
	////	Возврат;
	////ИначеЕсли МассивРасходов2.Количество() = 0 Тогда
	////	МассивРасходов = МассивРасходов1;
	////ИначеЕсли МассивРасходов1.Количество() = 0 Тогда
	////	МассивРасходов = МассивРасходов2;
	////Иначе
	////	МассивРасходов = МассивРасходов1;
	////	Для Каждого Строка из МассивРасходов2 Цикл
	////		 МассивРасходов.Добавить(Строка);
	////		 //ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	////	КонецЦикла	 
	////КонецЕсли;
	//
	// 
	//ТаблицаОстатков.Колонки.Добавить("ПартияРаспределенаПоАналитикеУчетаПартий",Новый ОписаниеТипов("Булево"));
	//Для Каждого Запись Из МассивРасходов Цикл
	//	
	//	Если ЗначениеЗаполнено(Запись.АналитикаУчетаПартий) Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	//Если ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") И ТипЗнч(Запись.ДокументПоступления) <> Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")
	//	//	И (Запись.Период < НачалоМесяца(ОбрабатываемыйМесяц) ИЛИ Запись.Период > КонецМесяца(ОбрабатываемыйМесяц))  Тогда
	//	//	Продолжить;
	//	//КонецЕсли;
	//	Если Запись.Период > КонецМесяца(ОбрабатываемыйМесяц) Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	ОтборПоПоступлениюТоваров = Новый Структура;
	//	ОтборПоПоступлениюТоваров.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
	//	ОтборПоПоступлениюТоваров.Вставить("Регистратор", Запись.ДокументПоступления);
	//	ОтборПоПоступлениюТоваров.Вставить("АналитикаУчетаНоменклатуры", Запись.АналитикаУчетаНоменклатуры);
	//	ОтборПоПоступлениюТоваров.Вставить("ВидЗапасов", Запись.ВидЗапасов);
	//	ОтборПоПоступлениюТоваров.Вставить("Организация", Запись.Организация);
	//	ОтборПоПоступлениюТоваров.Вставить("ПартияРаспределенаПоАналитикеУчетаПартий", Ложь);
	//	ПартииКРаспределению = ТаблицаОстатков.НайтиСтроки(ОтборПоПоступлениюТоваров);
	//	Если ПартииКРаспределению.Количество() = 0 Тогда
	//		Сообщить("Для документа " + Запись.Регистратор + " партий не найдено.");
	//		Продолжить;
	//	КонецЕсли;

	//	Для Каждого Партия Из ПартииКРаспределению Цикл
	//		//Если НЕ ЗначениеЗаполнено(Запись.АналитикаУчетаПартий) Тогда
	//		//Продолжить;
	//		Если Партия.ПартияРаспределенаПоАналитикеУчетаПартий Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//			Если ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
	//			И ТипЗнч(Запись.ДокументПоступления) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
	//				ЗаполнитьЗначенияСвойств(Запись,Партия,"АналитикаУчетаПартий, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл");
	//				Партия.ПартияРаспределенаПоАналитикеУчетаПартий = Истина;
	//				Прервать;
	//			ИначеЕсли Запись.ДокументПоступления = Партия.Регистратор Тогда
	//				Запись.АналитикаУчетаПартий = Партия.АналитикаУчетаПартий;
	//				Если Запись.Стоимость = 0 Тогда
	//					Запись.Стоимость = (Партия.Стоимость/Партия.Количество)*Запись.Количество;
	//					Запись.СтоимостьБезНДС = (Партия.СтоимостьБезНДС/Партия.Количество)*Запись.Количество;
	//					Запись.СтоимостьРегл = (Партия.СтоимостьРегл/Партия.Количество)*Запись.Количество;
	//					Запись.НДСРегл = (Партия.НДСРегл/Партия.Количество)*Запись.Количество;
	//					Партия.ПартияРаспределенаПоАналитикеУчетаПартий = Истина;
	//				КонецЕсли;	
	//			КонецЕсли;
	//		//Иначе   
	//		//	СтоимостьПоПартии = Партия.Стоимость/Партия.Количество;
	//		//	СтоимостьПоРасходу = Запись.Стоимость/Запись.Количество;
	//		//	Если СтоимостьПоПартии <> СтоимостьПоРасходу Тогда
	//		//		Запись.Стоимость = СтоимостьПоПартии*Запись.Количество;
	//		//		Запись.СтоимостьБезНДС = (Партия.СтоимостьБезНДС/Партия.Количество)*Запись.Количество;
	//		//		Запись.СтоимостьРегл = (Партия.СтоимостьРегл/Партия.Количество)*Запись.Количество;
	//		//		Запись.НДСРегл = (Партия.НДСРегл/Партия.Количество)*Запись.Количество;
	//		//	КонецЕсли;	
	//		//КонецЕсли;
	//		
	//		//Запись.АналитикаУчетаПартий =  ПартияПоПередаче.АналитикаУчетаПартий;
	//	КонецЦикла;
	//КонецЦикла;
	//ТаблицаОстатков.Колонки.Удалить("ПартияРаспределенаПоАналитикеУчетаПартий");
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровОрганизаций.Период,
	               |	ПартииТоваровОрганизаций.Регистратор,
	               |	ПартииТоваровОрганизаций.НомерСтроки,
	               |	ПартииТоваровОрганизаций.Активность,
	               |	ПартииТоваровОрганизаций.ВидДвижения,
	               |	ПартииТоваровОрганизаций.Организация,
	               |	ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	               |	ПартииТоваровОрганизаций.ДокументПоступления,
	               |	ПартииТоваровОрганизаций.ВидЗапасов,
	               |	ПартииТоваровОрганизаций.АналитикаУчетаПартий,
	               |	ПартииТоваровОрганизаций.Количество,
	               |	ПартииТоваровОрганизаций.Стоимость,
	               |	ПартииТоваровОрганизаций.СтоимостьБезНДС,
	               |	ПартииТоваровОрганизаций.СтоимостьРегл,
	               |	ПартииТоваровОрганизаций.НДСРегл,
	               |	ПартииТоваровОрганизаций.Номенклатура,
	               |	ПартииТоваровОрганизаций.Характеристика,
	               |	ПартииТоваровОрганизаций.НалогообложениеНДС,
	               |	ПартииТоваровОрганизаций.ХозяйственнаяОперация,
	               |	ПартииТоваровОрганизаций.КорВидЗапасов,
	               |	ПартииТоваровОрганизаций.КорДокументПоступления,
	               |	ПартииТоваровОрганизаций.КорАналитикаУчетаПартий,
	               |	ПартииТоваровОрганизаций.ДоляСтоимости,
	               |	ПартииТоваровОрганизаций.КорАналитикаУчетаНоменклатуры,
	               |	ПартииТоваровОрганизаций.МоментВремени
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваровОрганизаций
	               |ГДЕ
	               |	ПартииТоваровОрганизаций.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	               |	И ПартииТоваровОрганизаций.Активность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Период,
	               |	Таблица.Регистратор,
	               |	Таблица.НомерСтроки,
	               |	Таблица.Активность,
	               |	Таблица.ВидДвижения,
	               |	Таблица.Организация,
	               |	Таблица.АналитикаУчетаНоменклатуры,
	               |	Таблица.ДокументПоступления,
	               |	Таблица.ВидЗапасов,
	               |	Таблица.АналитикаУчетаПартий,
	               |	Таблица.Количество,
	               |	Таблица.Стоимость,
	               |	Таблица.СтоимостьБезНДС,
	               |	Таблица.СтоимостьРегл,
	               |	Таблица.НДСРегл,
	               |	Таблица.Номенклатура,
	               |	Таблица.Характеристика,
	               |	Таблица.НалогообложениеНДС,
	               |	Таблица.ХозяйственнаяОперация,
	               |	Таблица.КорВидЗапасов,
	               |	Таблица.КорДокументПоступления,
	               |	Таблица.КорАналитикаУчетаПартий,
	               |	Таблица.ДоляСтоимости,
	               |	Таблица.КорАналитикаУчетаНоменклатуры,
	               |	Таблица.МоментВремени
	               |ИЗ
	               |	Таблица КАК Таблица
	               |ГДЕ
	               |	Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И Таблица.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Таблица.Период,
	               |	Таблица.Регистратор,
	               |	Таблица.НомерСтроки,
	               |	Таблица.Активность,
	               |	Таблица.ВидДвижения,
	               |	Таблица.Организация,
	               |	Таблица.АналитикаУчетаНоменклатуры,
	               |	Таблица.ДокументПоступления,
	               |	Таблица.ВидЗапасов,
	               |	Таблица.Количество,
	               |	Таблица.Номенклатура,
	               |	Таблица.Характеристика,
	               |	Таблица.НалогообложениеНДС,
	               |	Таблица.ХозяйственнаяОперация,
	               |	Таблица.КорВидЗапасов,
	               |	НЕОПРЕДЕЛЕНО КАК КорДокументПоступления,
	               |	Таблица.КорАналитикаУчетаПартий,
	               |	Таблица.ДоляСтоимости,
	               |	Таблица.КорАналитикаУчетаНоменклатуры,
	               |	Таблица.МоментВремени,
	               |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	               |	НЕОПРЕДЕЛЕНО КАК Стоимость,
	               |	НЕОПРЕДЕЛЕНО КАК СтоимостьБезНДС,
	               |	НЕОПРЕДЕЛЕНО КАК СтоимостьРегл,
	               |	НЕОПРЕДЕЛЕНО КАК НДСРегл
	               |ПОМЕСТИТЬ ПередачиПриход
	               |ИЗ
	               |	Таблица КАК Таблица
	               |ГДЕ
	               |	Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И Таблица.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПередачиПриход.Период,
	               |	ПередачиПриход.Регистратор,
	               |	ПередачиПриход.НомерСтроки,
	               |	ПередачиПриход.Активность,
	               |	ПередачиПриход.ВидДвижения,
	               |	ПередачиПриход.Организация,
	               |	ПередачиПриход.АналитикаУчетаНоменклатуры,
	               |	ПередачиПриход.ДокументПоступления,
	               |	ПередачиПриход.ВидЗапасов,
	               |	ПередачиПриход.Количество,
	               |	ПередачиПриход.Номенклатура,
	               |	ПередачиПриход.Характеристика,
	               |	ПередачиПриход.НалогообложениеНДС,
	               |	ПередачиПриход.ХозяйственнаяОперация,
	               |	ПередачиПриход.КорВидЗапасов,
	               |	ПередачиПриход.КорДокументПоступления,
	               |	ПередачиПриход.КорАналитикаУчетаПартий,
	               |	ПередачиПриход.ДоляСтоимости,
	               |	ПередачиПриход.КорАналитикаУчетаНоменклатуры,
	               |	ПередачиПриход.МоментВремени,
	               |	ПередачиПриход.Стоимость,
	               |	ПередачиПриход.СтоимостьБезНДС,
	               |	ПередачиПриход.СтоимостьРегл,
	               |	ПередачиПриход.НДСРегл,
	               |	ПередачиПриход.АналитикаУчетаПартий
	               |ИЗ
	               |	ПередачиПриход КАК ПередачиПриход
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Таблица.Период,
	               |	Таблица.Регистратор,
	               |	Таблица.НомерСтроки,
	               |	Таблица.Активность,
	               |	Таблица.ВидДвижения,
	               |	Таблица.Организация,
	               |	Таблица.АналитикаУчетаНоменклатуры,
	               |	Таблица.ДокументПоступления,
	               |	Таблица.ВидЗапасов,
	               |	Таблица.Количество,
	               |	Таблица.Номенклатура,
	               |	Таблица.Характеристика,
	               |	Таблица.НалогообложениеНДС,
	               |	Таблица.ХозяйственнаяОперация,
	               |	Таблица.КорВидЗапасов,
	               |	Таблица.КорДокументПоступления,
	               |	Таблица.КорАналитикаУчетаПартий,
	               |	Таблица.ДоляСтоимости,
	               |	Таблица.КорАналитикаУчетаНоменклатуры,
	               |	Таблица.МоментВремени,
	               |	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	               |	НЕОПРЕДЕЛЕНО КАК Стоимость,
	               |	НЕОПРЕДЕЛЕНО КАК СтоимостьБезНДС,
	               |	НЕОПРЕДЕЛЕНО КАК СтоимостьРегл,
	               |	НЕОПРЕДЕЛЕНО КАК НДСРегл
	               |ИЗ
	               |	Таблица КАК Таблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПередачиПриход КАК ПередачиПриход
	               |		ПО Таблица.ДокументПоступления = ПередачиПриход.Регистратор
	               |			И Таблица.АналитикаУчетаНоменклатуры = ПередачиПриход.АналитикаУчетаНоменклатуры
	               |			И Таблица.Организация = ПередачиПриход.Организация
	               |			И Таблица.ВидЗапасов = ПередачиПриход.ВидЗапасов
	               |ГДЕ
	               |	Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Таблица.Регистратор
	               |ПОМЕСТИТЬ Регистраторы
	               |ИЗ
	               |	Таблица КАК Таблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПередачиПриход КАК ПередачиПриход
	               |		ПО Таблица.ДокументПоступления = ПередачиПриход.Регистратор
	               |			И Таблица.АналитикаУчетаНоменклатуры = ПередачиПриход.АналитикаУчетаНоменклатуры
	               |			И Таблица.Организация = ПередачиПриход.Организация
	               |			И Таблица.ВидЗапасов = ПередачиПриход.ВидЗапасов
	               |ГДЕ
	               |	Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Регистраторы.Регистратор
	               |ИЗ
	               |	Регистраторы КАК Регистраторы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Таблица.Период,
	               |	Таблица.Регистратор,
	               |	Таблица.НомерСтроки,
	               |	Таблица.Активность,
	               |	Таблица.ВидДвижения,
	               |	Таблица.Организация,
	               |	Таблица.АналитикаУчетаНоменклатуры,
	               |	Таблица.ДокументПоступления,
	               |	Таблица.ВидЗапасов,
	               |	Таблица.АналитикаУчетаПартий,
	               |	Таблица.Количество,
	               |	Таблица.Стоимость,
	               |	Таблица.СтоимостьБезНДС,
	               |	Таблица.СтоимостьРегл,
	               |	Таблица.НДСРегл,
	               |	Таблица.Номенклатура,
	               |	Таблица.Характеристика,
	               |	Таблица.НалогообложениеНДС,
	               |	Таблица.ХозяйственнаяОперация,
	               |	Таблица.КорВидЗапасов,
	               |	Таблица.КорДокументПоступления,
	               |	Таблица.КорАналитикаУчетаПартий,
	               |	Таблица.ДоляСтоимости,
	               |	Таблица.КорАналитикаУчетаНоменклатуры,
	               |	Таблица.МоментВремени
	               |ИЗ
	               |	Таблица КАК Таблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	               |		ПО Таблица.Регистратор = Регистраторы.Регистратор
	               |ГДЕ
	               |	НЕ Таблица.ДокументПоступления ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
				   |	//И Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ОбрабатываемыйМесяц));
	Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ОбрабатываемыйМесяц));
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаПередачиТоваровПриход = Результат[3].Выгрузить();
	ТаблицаПередачиТоваровРасход = Результат[1].Выгрузить();
	//ТаблицаПередачиТоваров.Колонки.Добавить("ПартияРаспределена",Новый ОписаниеТипов("Булево"));
	
	ТаблицаПроверкиДублей = ТаблицаПередачиТоваровПриход.СкопироватьКолонки(); 
	ТаблицаРасходы = Результат[4].Выгрузить();
	ТаблицаРегистраторыРасход = Результат[6].Выгрузить();
	ТаблицаКорректировки = Результат[7].Выгрузить();
	
	//Распределим Передачи товаров
	Для Каждого Передача Из ТаблицаПередачиТоваровПриход Цикл
		 ОтборРасходов = Новый Структура;
	    //ОтборПередачТоваров.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
		ОтборРасходов.Вставить("Регистратор", Передача.ДокументПоступления);
		ОтборРасходов.Вставить("Количество", Передача.Количество);
		ОтборРасходов.Вставить("АналитикаУчетаНоменклатуры", Передача.АналитикаУчетаНоменклатуры);
        ОтборРасходов.Вставить("Период",Передача.Период);
		//ОтборРасходов.Вставить("Организация", Расход.Организация);
		//ОтборПередачТоваров.Вставить("ПартияРаспределена", Ложь);
		РасходыКРаспределению = ТаблицаПередачиТоваровРасход.НайтиСтроки(ОтборРасходов);
		Если РасходыКРаспределению.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Партия Из РасходыКРаспределению Цикл
			ЗаполнитьЗначенияСвойств(Передача,Партия,"АналитикаУчетаПартий, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл");
			Передача.КорДокументПоступления = Партия.ДокументПоступления;
			//Партия.ПартияРаспределена = Истина;
			ТаблицаПередачиТоваровРасход.Удалить(Партия);
			Прервать;
		КонецЦикла;	
	        НоваяЗапись = ТаблицаКорректировки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Передача);
	КонецЦикла;
	
	//Для Каждого Расход Из ТаблицаРасходы Цикл
	//	ДокПост = Расход.ДокументПоступления;
	//	Рег=Расход.Регистратор;
	//	Кол = Расход.Количество;
	//КонецЦикла;	
	//Рапределим партии передач на расходные документы 	
	Для Каждого Расход Из ТаблицаРасходы Цикл
			
		ОтборПередачТоваров = Новый Структура;
	    //ОтборПередачТоваров.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
		ОтборПередачТоваров.Вставить("Регистратор", Расход.ДокументПоступления);
		ОтборПередачТоваров.Вставить("Количество", Расход.Количество);
		ОтборПередачТоваров.Вставить("АналитикаУчетаНоменклатуры", Расход.АналитикаУчетаНоменклатуры);
        ОтборПередачТоваров.Вставить("ВидЗапасов",Расход.ВидЗапасов);
		ОтборПередачТоваров.Вставить("Организация", Расход.Организация);
		//ОтборПередачТоваров.Вставить("ПартияРаспределена", Ложь);
		ПартииКРаспределению = ТаблицаПередачиТоваровПриход.НайтиСтроки(ОтборПередачТоваров);
		
		Если ПартииКРаспределению.Количество() = 0 Тогда
			ОтборПередачТоваров = Новый Структура;
			ОтборПередачТоваров.Вставить("Регистратор", Расход.ДокументПоступления);
			//ОтборПередачТоваров.Вставить("Количество", Расход.Количество);
			ОтборПередачТоваров.Вставить("АналитикаУчетаНоменклатуры", Расход.АналитикаУчетаНоменклатуры);
	        ОтборПередачТоваров.Вставить("ВидЗапасов",Расход.ВидЗапасов);
			ОтборПередачТоваров.Вставить("Организация", Расход.Организация);
			//ОтборПередачТоваров.Вставить("ПартияРаспределена", Ложь);
			ПартииКРаспределению = ТаблицаПередачиТоваровПриход.НайтиСтроки(ОтборПередачТоваров);
		КонецЕсли;
		
		Для Каждого Партия Из ПартииКРаспределению Цикл
			Если Расход.Количество = 0 Тогда 
				Прервать;
			КонецЕсли;
			
			
			Если Партия.Количество >= Расход.Количество Тогда
				Если Партия.Количество = Расход.Количество Тогда
					ЗаполнитьЗначенияСвойств(Расход,Партия,"АналитикаУчетаПартий, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл");
					ТаблицаПередачиТоваровПриход.Удалить(Партия);
					НоваяЗапись = ТаблицаКорректировки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись,Расход);
					Прервать;
				Конецесли;	
			//Партия.ПартияРаспределена = Истина;
			//ТаблицаПередачиТоваровПриход.Удалить(Партия);
				Расход.АналитикаУчетаПартий = Партия.АналитикаУчетаПартий; 
				Расход.Стоимость = Окр((Партия.Стоимость/Партия.Количество)*Расход.Количество,2);
				Расход.СтоимостьБезНДС = Окр((Партия.СтоимостьБезНДС/Партия.Количество)*Расход.Количество,2);
				Расход.СтоимостьРегл = Окр((Партия.СтоимостьРегл/Партия.Количество)*Расход.Количество,2);
				Расход.НДСРегл = Окр((Партия.НДСРегл/Партия.Количество)*Расход.Количество,2);
				КоличествоОстаток = Партия.Количество - Расход.Количество;
				Партия.Стоимость = Окр((Партия.Стоимость/Партия.Количество)*КоличествоОстаток,2);
				Партия.СтоимостьБезНДС = Окр((Партия.СтоимостьБезНДС/Партия.Количество)*КоличествоОстаток,2);
                Партия.СтоимостьРегл = Окр((Партия.СтоимостьРегл/Партия.Количество)*КоличествоОстаток,2);
				Партия.НДСРегл = Окр((Партия.НДСРегл/Партия.Количество)*КоличествоОстаток,2);
                Партия.Количество = КоличествоОстаток;
				НоваяЗапись = ТаблицаКорректировки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись,Расход);
				Если Партия.Количество = 0 Тогда 
					ТаблицаПередачиТоваровПриход.Удалить(Партия);
				КонецЕсли;
				Прервать;
			Иначе
				ИсходноеКоличествоВРасходе = Расход.Количество;
				ЗаполнитьЗначенияСвойств(Расход,Партия,"АналитикаУчетаПартий, Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл");
				//Расход.Количество = Расход.Количество - Партия.Количество;
				//Расход.АналитикаУчетаПартий = Партия.АналитикаУчетаПартий; 
				//Расход.Стоимость = Окр((Партия.Стоимость/Партия.Количество)*Расход.Количество,2);
				//Расход.СтоимостьБезНДС = Окр((Партия.СтоимостьБезНДС/Партия.Количество)*Расход.Количество,2);
				//Расход.СтоимостьРегл = Окр((Партия.СтоимостьРегл/Партия.Количество)*Расход.Количество,2);
				//Расход.НДСРегл = Окр((Партия.НДСРегл/Партия.Количество)*Расход.Количество,2);
				НоваяЗапись = ТаблицаКорректировки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись,Расход);
				Расход.Количество = ИсходноеКоличествоВРасходе - Партия.Количество;
				ТаблицаПередачиТоваровПриход.Удалить(Партия);
            КонецЕсли;
		КонецЦикла;	
			//НоваяЗапись = ТаблицаКорректировки.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяЗапись,Расход);
	КонецЦикла;
	//НаборЗаписей = РегистрыНакопления.ПартииТоваровОрганизаций.СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	//ТаблицаНабораЗаписей = НаборЗаписей.ВыгрузитьКолонки();
	//Для Каждого СтрокаКорректировки Из ТаблицаКорректировки Цикл
	//	Продолжить;
	//КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	Таблица.Регистратор
	//			   |ПОМЕСТИТЬ Расходы
	//			   |ИЗ
	//			   |	&Таблица КАК Таблица
	//			   |ГДЕ
	//			   |	Таблица.ВидДвижения = &ВидДвижения
	//			   |;
	//			   |
	//			   |////////////////////////////////////////////////////////////////////////////////
	//			   |ВЫБРАТЬ
	//			   |	Расходы.Регистратор
	//			   |ИЗ
	//			   |	Расходы КАК Расходы
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	Расходы.Регистратор";
	//
	//Запрос.УстановитьПараметр("Таблица", ТаблицаКорректировки);
	//Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	
	Для Каждого ЗаписьРегистратора ИЗ ТаблицаРегистраторыРасход Цикл
		ОтборРасходов = Новый Структура;
		ОтборРасходов.Вставить("Регистратор",ЗаписьРегистратора.Регистратор);
		ТаблицаРасходов = ТаблицаКорректировки.НайтиСтроки(ОтборРасходов);
		Если ТаблицаРасходов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		НаборЗаписей = РегистрыНакопления.ПартииТоваровОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЗаписьРегистратора.Регистратор);
		НаборЗаписей.Прочитать();
		
		//Если СтрокаКорректировки.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			
			НаборЗаписей.Очистить();
			НаборЗаписей.Записывать = Истина;
			НаборЗаписей.Записать(Истина);
			Для Каждого СтрокаРасхода ИЗ ТаблицаРасходов Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаРасхода);
				НаборЗаписей.Записывать = Истина;
				НаборЗаписей.Записать(Ложь);
                ТаблицаКорректировки.Удалить(СтрокаРасхода);
			КонецЦикла;
			//НаборЗаписей.Записывать = Истина;
			//НаборЗаписей.Записать(Ложь);
			//Продолжить;
		//КонецЕсли;	

		
	
	КонецЦикла;
	
	Для Каждого СтрокаКорректировки Из ТаблицаКорректировки Цикл
		НаборЗаписей = РегистрыНакопления.ПартииТоваровОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(СтрокаКорректировки.Регистратор);
		НаборЗаписей.Прочитать();
		
		//Если СтрокаКорректировки.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
		//	ОтборРасходов = Новый Структура;
		//	ОтборРасходов.Вставить("Регистратор",СтрокаКорректировки.Регистратор);
		//	ТаблицаРасходов = ТаблицаКорректировки.НайтиСтроки(ОтборРасходов);
		//	//Если ТаблицаРасходов.Количество() = 1 Тогда
		//	//	ЗаполнитьЗначенияСвойств(НаборЗаписей[0], ТаблицаРасходов[0]);
		//	//	НаборЗаписей.Записывать = Истина;
		//	//	НаборЗаписей.Записать(Истина);
		//	//	ТаблицаКорректировки.Удалить(ТаблицаРасходов[0]);
		//	//	Продолжить;
		//	//КонецЕсли;	
		//	
		//	НаборЗаписей.Очистить();
		//	НаборЗаписей.Записывать = Истина;
		//	НаборЗаписей.Записать(Истина);
		//	Для Каждого СтрокаРасхода ИЗ ТаблицаРасходов Цикл
		//		НоваяЗапись = НаборЗаписей.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаРасхода);
		//		НаборЗаписей.Записывать = Истина;
		//		НаборЗаписей.Записать(Ложь);
		//		ТаблицаКорректировки.Удалить(СтрокаРасхода);
		//	КонецЦикла;
		//	//НаборЗаписей.Записывать = Истина;
		//	//НаборЗаписей.Записать(Ложь);
		//	Продолжить;
		//КонецЕсли;	
			
		//Движение = ТаблицаНабораЗаписей.Добавить();
		Для Каждого СтрокаКМодификации Из НаборЗаписей Цикл
			//Движение = НаборЗаписей.Добавить();
			ОтборПроверкиДублей = Новый Структура;
		    //ОтборПередачТоваров.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
			ОтборПроверкиДублей.Вставить("Регистратор",СтрокаКМодификации.Регистратор);
			ОтборПроверкиДублей.Вставить("Количество", СтрокаКМодификации.Количество);
			ОтборПроверкиДублей.Вставить("АналитикаУчетаНоменклатуры", СтрокаКМодификации.АналитикаУчетаНоменклатуры);
	        ОтборПроверкиДублей.Вставить("ВидЗапасов",СтрокаКМодификации.ВидЗапасов);
			ОтборПроверкиДублей.Вставить("Организация", СтрокаКМодификации.Организация);
			ОтборПроверкиДублей.Вставить("Период", СтрокаКМодификации.Период);
			ОтборПроверкиДублей.Вставить("Активность", СтрокаКМодификации.Активность);
            ОтборПроверкиДублей.Вставить("ВидДвижения", СтрокаКМодификации.ВидДвижения);
			ОтборПроверкиДублей.Вставить("ДокументПоступления", СтрокаКМодификации.ДокументПоступления);
	        ОтборПроверкиДублей.Вставить("НалогообложениеНДС", СтрокаКМодификации.НалогообложениеНДС);                      
	        ОтборПроверкиДублей.Вставить("ХозяйственнаяОперация", СтрокаКМодификации.ХозяйственнаяОперация);       
	        ОтборПроверкиДублей.Вставить("КорВидЗапасов", СтрокаКМодификации.КорВидЗапасов);       
	        ОтборПроверкиДублей.Вставить("КорДокументПоступления", СтрокаКМодификации.КорДокументПоступления);       
	        ОтборПроверкиДублей.Вставить("КорАналитикаУчетаПартий", СтрокаКМодификации.КорАналитикаУчетаПартий);
	        ОтборПроверкиДублей.Вставить("КорАналитикаУчетаНоменклатуры", СтрокаКМодификации.КорАналитикаУчетаНоменклатуры);
	       // ОтборПроверкиДублей.Вставить("МоментВремени", СтрокаКМодификации.МоментВремени);
	        ОтборПроверкиДублей.Вставить("Стоимость", СтрокаКМодификации.Стоимость);
            ОтборПроверкиДублей.Вставить("СтоимостьБезНДС", СтрокаКМодификации.СтоимостьБезНДС);
            ОтборПроверкиДублей.Вставить("СтоимостьРегл", СтрокаКМодификации.СтоимостьРегл);
	        ОтборПроверкиДублей.Вставить("НДСРегл", СтрокаКМодификации.НДСРегл);
	        ОтборПроверкиДублей.Вставить("АналитикаУчетаПартий", СтрокаКМодификации.АналитикаУчетаПартий);
	              
			Дубли = ТаблицаПроверкиДублей.НайтиСтроки(ОтборПроверкиДублей);
			Если Дубли.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;	
			Если ТипЗнч(СтрокаКорректировки.Регистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
				Если СтрокаКМодификации.ВидДвижения = СтрокаКорректировки.ВидДвижения И СтрокаКМодификации.АналитикаУчетаНоменклатуры = СтрокаКорректировки.АналитикаУчетаНоменклатуры
					И СтрокаКМодификации.Период = СтрокаКорректировки.Период и СтрокаКМодификации.ДокументПоступления = СтрокаКорректировки.ДокументПоступления 
					И СтрокаКМодификации.Организация = СтрокаКорректировки.Организация и СтрокаКМодификации.Регистратор = СтрокаКорректировки.Регистратор 
					и СтрокаКМодификации.Количество = СтрокаКорректировки.Количество Тогда
					ЗаполнитьЗначенияСвойств(СтрокаКМодификации, СтрокаКорректировки);
					
					//НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
					НаборЗаписей.Записывать = Истина;
					НаборЗаписей.Записать(Истина);
					СтрокаПроверки = ТаблицаПроверкиДублей.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПроверки, СтрокаКМодификации);
					Прервать;
				Иначе
					Продолжить;
				КонецЕсли;
			//Иначе
			//	Если СтрокаКМодификации.ВидДвижения = СтрокаКорректировки.ВидДвижения И СтрокаКМодификации.АналитикаУчетаНоменклатуры = СтрокаКорректировки.АналитикаУчетаНоменклатуры
			//		И СтрокаКМодификации.Период = СтрокаКорректировки.Период и СтрокаКМодификации.ДокументПоступления = СтрокаКорректировки.ДокументПоступления 
			//		И СтрокаКМодификации.Организация = СтрокаКорректировки.Организация и СтрокаКМодификации.Регистратор = СтрокаКорректировки.Регистратор 
			//		//И СтрокаКМодификации.АналитикаУчетаПартий = Справочники.КлючиАналитикиУчетаПартий.ПустаяСсылка()
			//		Тогда
			//		ЗаполнитьЗначенияСвойств(СтрокаКМодификации, СтрокаКорректировки);
			//		
			//		//НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
			//		НаборЗаписей.Записывать = Истина;
			//		НаборЗаписей.Записать(Истина);
			//		СтрокаПроверки = ТаблицаПроверкиДублей.Добавить();
			//		ЗаполнитьЗначенияСвойств(СтрокаПроверки, СтрокаКМодификации);
			//		Прервать;
			//	Иначе
			//		Продолжить;
			//	КонецЕсли;
             КонецЕсли;
		    //НаборЗаписей.Очистить();
		//ТаблицаНабораЗаписей.Очистить();
		//НаборЗаписейДляПроверки.Очистить();
		КонецЦикла;
	   // НаборЗаписей.Очистить();
	КонецЦикла;	

	
КонецПроцедуры	
	

Процедура СкорректироватьПартииТоваровОрганизацийПоСборкамРазборкамТоваров(ОбрабатываемыйМесяц) Экспорт
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровОрганизаций.Период,
	               |	ПартииТоваровОрганизаций.Регистратор,
	               |	ПартииТоваровОрганизаций.НомерСтроки,
	               |	ПартииТоваровОрганизаций.Активность,
	               |	ПартииТоваровОрганизаций.ВидДвижения,
	               |	ПартииТоваровОрганизаций.Организация,
	               |	ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	               |	ПартииТоваровОрганизаций.ДокументПоступления,
	               |	ПартииТоваровОрганизаций.ВидЗапасов,
	               |	ПартииТоваровОрганизаций.АналитикаУчетаПартий,
	               |	ПартииТоваровОрганизаций.Количество,
	               |	ПартииТоваровОрганизаций.Стоимость,
	               |	ПартииТоваровОрганизаций.СтоимостьБезНДС,
	               |	ПартииТоваровОрганизаций.СтоимостьРегл,
	               |	ПартииТоваровОрганизаций.НДСРегл,
	               |	ПартииТоваровОрганизаций.Номенклатура,
	               |	ПартииТоваровОрганизаций.Характеристика,
	               |	ПартииТоваровОрганизаций.НалогообложениеНДС,
	               |	ПартииТоваровОрганизаций.ХозяйственнаяОперация,
	               |	ПартииТоваровОрганизаций.КорВидЗапасов,
	               |	ПартииТоваровОрганизаций.КорДокументПоступления,
	               |	ПартииТоваровОрганизаций.КорАналитикаУчетаПартий,
	               |	ПартииТоваровОрганизаций.ДоляСтоимости,
	               |	ПартииТоваровОрганизаций.КорАналитикаУчетаНоменклатуры
	               |ПОМЕСТИТЬ ТаблицаСборки
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваровОрганизаций
	               |ГДЕ
	               |	ПартииТоваровОрганизаций.Период <= &Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСборки.Период,
	               |	ТаблицаСборки.Регистратор,
	               |	ТаблицаСборки.НомерСтроки,
	               |	ТаблицаСборки.Активность,
	               |	ТаблицаСборки.ВидДвижения,
	               |	ТаблицаСборки.Организация,
	               |	ТаблицаСборки.АналитикаУчетаНоменклатуры,
	               |	ТаблицаСборки.ДокументПоступления,
	               |	ТаблицаСборки.ВидЗапасов,
	               |	ТаблицаСборки.АналитикаУчетаПартий,
	               |	ТаблицаСборки.Количество,
	               |	ТаблицаСборки.Стоимость,
	               |	ТаблицаСборки.СтоимостьБезНДС,
	               |	ТаблицаСборки.СтоимостьРегл,
	               |	ТаблицаСборки.НДСРегл,
	               |	ТаблицаСборки.Номенклатура,
	               |	ТаблицаСборки.Характеристика,
	               |	ТаблицаСборки.НалогообложениеНДС,
	               |	ТаблицаСборки.ХозяйственнаяОперация,
	               |	ТаблицаСборки.КорВидЗапасов,
	               |	ТаблицаСборки.КорДокументПоступления,
	               |	ТаблицаСборки.КорАналитикаУчетаПартий,
	               |	ТаблицаСборки.ДоляСтоимости,
	               |	ТаблицаСборки.КорАналитикаУчетаНоменклатуры
	               |ИЗ
	               |	ТаблицаСборки КАК ТаблицаСборки";

				  
	               
				   
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	//Запрос.УстановитьПараметр("Таблица", ТаблицаОстатков);
	Запрос.УстановитьПараметр("Период", КонецМесяца(ОбрабатываемыйМесяц));
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	ТаблицаКорректировки = ТаблицаОстатков.СкопироватьКолонки();
	//Выборка1 = РезультатЗапроса.Выбрать();
	//Выборка1.Следующий();
	
	//Если Выборка1.Количество = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСборки.ВидДвижения,
	               |	ТаблицаСборки.Организация,
	               |	ТаблицаСборки.Период,
	               |	ТаблицаСборки.Регистратор,
				   //|	ТаблицаСборки.Номенклатура,
				   //|	ТаблицаСборки.Характеристика,
	               |	СУММА(ТаблицаСборки.Стоимость) КАК Стоимость,
	               |	СУММА(ТаблицаСборки.НДСРегл) КАК НДСРегл,
	               |	СУММА(ТаблицаСборки.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	               |	СУММА(ТаблицаСборки.СтоимостьРегл) КАК СтоимостьРегл,
	               |	ТаблицаСборки.ХозяйственнаяОперация,
	               |	СборкаТоваров.ТипОперации
	               |ИЗ
	               |	ТаблицаСборки КАК ТаблицаСборки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
	               |		ПО ТаблицаСборки.Регистратор = СборкаТоваров.Ссылка
	               |ГДЕ
	               |	СборкаТоваров.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийЗаказаНаСборку.СборкаИзКомплектующих)
	               |	И ТаблицаСборки.Период <= &Период
	               |	И ТаблицаСборки.Регистратор ССЫЛКА Документ.СборкаТоваров
	               |	И ТаблицаСборки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ТаблицаСборки.Стоимость > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСборки.ВидДвижения,
	               |	ТаблицаСборки.Организация,
	               |	ТаблицаСборки.Период,
	               |	ТаблицаСборки.Регистратор,
	               |	ТаблицаСборки.ХозяйственнаяОперация,
	               |	СборкаТоваров.ТипОперации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаСборки.ВидДвижения,
	               |	ТаблицаСборки.Организация,
	               |	ТаблицаСборки.Период,
	               |	ТаблицаСборки.Регистратор,
				   //|	ТаблицаСборки.Номенклатура,
				   //|	ТаблицаСборки.Характеристика,
	               |	СУММА(ТаблицаСборки.Стоимость),
	               |	СУММА(ТаблицаСборки.НДСРегл),
	               |	СУММА(ТаблицаСборки.СтоимостьБезНДС),
	               |	СУММА(ТаблицаСборки.СтоимостьРегл),
	               |	ТаблицаСборки.ХозяйственнаяОперация,
	               |	СборкаТоваров.ТипОперации
	               |ИЗ
	               |	ТаблицаСборки КАК ТаблицаСборки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
	               |		ПО ТаблицаСборки.Регистратор = СборкаТоваров.Ссылка
	               |ГДЕ
	               |	СборкаТоваров.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийЗаказаНаСборку.РазборкаНаКомплектующие)
	               |	И ТаблицаСборки.Период <= &Период
	               |	И ТаблицаСборки.Регистратор ССЫЛКА Документ.СборкаТоваров
	               |	И ТаблицаСборки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И ТаблицаСборки.Стоимость > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСборки.ХозяйственнаяОперация,
	               |	ТаблицаСборки.ВидДвижения,
	               |	ТаблицаСборки.Регистратор,
	               |	ТаблицаСборки.Период,
	               |	ТаблицаСборки.Организация,
	               |	СборкаТоваров.ТипОперации";
				   //|ГДЕ
				   //|	ТаблицаСборки.Период <= &Период
				   //|	И ТаблицаСборки.Регистратор ССЫЛКА Документ.СборкаТоваров
				   //|	ТаблицаСборки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
				   //|	И ТаблицаСборки.Стоимость > 0";
				   
	//Запрос.УстановитьПараметр("Период", КонецМесяца(ОбрабатываемыйМесяц));			   
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	Конецесли;
	
	ОтборПоСборкам  = Новый Структура;
	ОтборПоРасходам = Новый Структура;
	ОтборПоПартиям  = Новый Структура;
	//Отбор           = Новый Структура;
	
	ТаблицаОстатков.Колонки.Добавить("НоваяПартия");
	
	Пока Выборка.Следующий() Цикл
		   
			Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				Продолжить;
			КонецЕсли;
			

//~Метка2:
			ДокументПоступления = Выборка.Регистратор;
		//Пока Истина Цикл
		    ЗаписьРасхода = Выборка;
			ОтборПоСборкам.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
			ОтборПоСборкам.Вставить("ДокументПоступления", ДокументПоступления);
			//ОтборПоСборкам.Вставить("Номенклатура", Выборка.Номенклатура);
			//ОтборПоСборкам.Вставить("Характеристика", Выборка.Характеристика);
			ОтборПоСборкам.Вставить("Организация", Выборка.Организация);
			ОтборПоСборкам.Вставить("Стоимость", 0);
			ПартииКРаспределению = ТаблицаОстатков.НайтиСтроки(ОтборПоСборкам);
			//ОтборПоСборкам.Удалить();
			//КоэффициентПоПартиям = ПартииКРаспределению.Скопировать();
			//КоэффициентПоПартиям.Свернуть("Регистратор, ДокументПоступления","ДоляСтоимости");
			
			
			Если ПартииКРаспределению.Количество() = 0 Тогда
				Продолжить;//Прервать;
			Конецесли;
			
			Коэффициент = 0;
			Для Каждого Строка Из ПартииКРаспределению Цикл
				Коэффициент = Коэффициент + Строка.ДоляСтоимости;
			КонецЦикла;
			Если Коэффициент = 0 Тогда
				Коэффициент = 1;
			КонецЕсли;	
			//ЕстьНовыеПартии = Ложь;
			ПерваяИтерация = Истина;
			
~Метка1:	Для каждого Запись Из ПартииКРаспределению Цикл
				//Пока Истина Цикл
				    Если ПерваяИтерация Тогда
						Если Выборка.ТипОперации = Перечисления.ТипыОперацийЗаказаНаСборку.РазборкаНаКомплектующие Тогда
							Если Запись.Количество = 0 Тогда
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ
								|	СУММА(СборкаТоваровТовары.Количество) КАК Количество
								|ИЗ
								|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
								|ГДЕ
								|	СборкаТоваровТовары.Ссылка = &Ссылка
								|	И СборкаТоваровТовары.Номенклатура = &Номенклатура
								|	И СборкаТоваровТовары.Характеристика = &Характеристика
								|	И СборкаТоваровТовары.ВидЗапасов = &ВидЗапасов";
								
								Запрос.УстановитьПараметр("Ссылка", Запись.Регистратор);
								Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
								Запрос.УстановитьПараметр("Характеристика", Запись.Характеристика);
								Запрос.УстановитьПараметр("ВидЗапасов", Запись.ВидЗапасов);
								
								РезультатЗапроса = Запрос.Выполнить().Выбрать();
								РезультатЗапроса.Следующий();
								Запись.Количество = РезультатЗапроса.Количество; 
							КонецЕсли;	
							Запись.Стоимость = (ЗаписьРасхода.Стоимость*Запись.ДоляСтоимости)/Коэффициент;
							Запись.СтоимостьБезНДС = (ЗаписьРасхода.СтоимостьБезНДС*Запись.ДоляСтоимости)/Коэффициент;
							Запись.СтоимостьРегл = (ЗаписьРасхода.СтоимостьРегл*Запись.ДоляСтоимости)/Коэффициент;
							Запись.НДСРегл = (ЗаписьРасхода.НДСРегл*Запись.ДоляСтоимости)/Коэффициент;
						Иначе
							ЗаполнитьЗначенияСвойств(Запись, ЗаписьРасхода,"Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл");
						КонецЕсли;	
					Иначе
						ДокументПоступления = Запись.Регистратор;
					КонецЕсли;
					ДобавитьЗаписьВТаблицуКорректировки(Запись, ТаблицаКорректировки); 
					//Получили партию	
			        ОтборПоРасходам.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
					ОтборПоРасходам.Вставить("ДокументПоступления", ДокументПоступления);
					ОтборПоРасходам.Вставить("АналитикаУчетаНоменклатуры", Запись.АналитикаУчетаНоменклатуры);
				    ОтборПоРасходам.Вставить("ВидЗапасов", Запись.ВидЗапасов);
				    ОтборПоРасходам.Вставить("Организация", Запись.Организация);
					ОтборПоРасходам.Вставить("Стоимость", 0);
					РасходыКРаспределению = ТаблицаОстатков.НайтиСтроки(ОтборПоРасходам); //Таблица расходов
					//РасходыКРаспределению.Колонки.Добавить("НоваяПартия");
					//ОтборПоРасходам.Удалить();
					Если РасходыКРаспределению.Количество()=0 Тогда
						Продолжить;
					КонецЕсли;
					
					Для каждого Расход Из РасходыКРаспределению Цикл
						Расход.Стоимость = (Запись.Стоимость/Запись.Количество)*Расход.Количество;
						Расход.СтоимостьБезНДС = (Запись.СтоимостьБезНДС/Запись.Количество)*Расход.Количество;
						Расход.СтоимостьРегл = (Запись.СтоимостьРегл/Запись.Количество)*Расход.Количество;
						Расход.НДСРегл = (Запись.НДСРегл/Запись.Количество)*Расход.Количество;
						ДобавитьЗаписьВТаблицуКорректировки(Расход, ТаблицаКорректировки);
						//Если расход не образует следующую партию - продолжить обход расходов
						//Новые партии формируют Передачи товаров между организациями,перемещение товаров и сборки
						Отбор = Новый Структура;
						Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
						//Если ТипЗнч(Расход.Регистратор) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
						//	Отбор.Вставить("ДокументПоступления", Расход.ДокументПоступления);
						//Иначе
							Отбор.Вставить("ДокументПоступления", Расход.Регистратор);
						//КонецЕсли;	
						Отбор.Вставить("АналитикаУчетаНоменклатуры", Запись.АналитикаУчетаНоменклатуры);
						Если ТипЗнч(Расход.Регистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") ИЛИ
							ТипЗнч(Расход.Регистратор) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
							Отбор.Вставить("Количество", Расход.Количество);
							Отбор.Вставить("КорДокументПоступления", Расход.ДокументПоступления);
						КонецЕсли;
						//Отбор.Вставить("ВидЗапасов", Запись.ВидЗапасов);
					    //Отбор.Вставить("Организация", Запись.Организация);
						Отбор.Вставить("Стоимость", 0);
						НовыеПартии = ТаблицаОстатков.НайтиСтроки(Отбор); //Таблица Новых партий
						//Отбор.Удалить();
						
						Если НовыеПартии.Количество()=0 Тогда
							//Расход.НоваяПартия = Ложь;
							Продолжить;
						КонецЕсли;
						//ЗаписьРасхода = Расход;
						//Если образует следующую партию
						Для Каждого Партия Из НовыеПартии Цикл
							Если ТипЗнч(Партия.Регистратор)= Тип("ДокументСсылка.СборкаТоваров") Тогда
								Продолжить;
							КонецЕсли;
							Партия.НоваяПартия = Истина;
							//Расход.НоваяПартия = Истина;
							ЗаполнитьЗначенияСвойств(Партия, Расход,"Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл");
							ДобавитьЗаписьВТаблицуКорректировки(Партия, ТаблицаКорректировки);
							//Партия.Стоимость = (Расход.Стоимость/Расход.Количество)*Партия.Количество;
							//Партия.СтоимостьБезНДС = (Расход.СтоимостьБезНДС/Расход.Количество)*Партия.Количество;
							//Партия.СтоимостьРегл = (Расход.СтоимостьРегл/Расход.Количество)*Партия.Количество;
							//Партия.НДСРегл = (Расход.НДСРегл/Расход.Количество)*Партия.Количество;
						КонецЦикла;	
						//ДокументПоступления = Расход.Регистратор;
					КонецЦикла;
				//КонецЦикла;
				ОтборПоПартиям.Вставить("НоваяПартия", Истина);
				НовыеПартииКРаспределению = ТаблицаОстатков.НайтиСтроки(ОтборПоПартиям);
				//ОтборПоПартиям.Удалить();
				Если НовыеПартииКРаспределению.Количество() <> 0 Тогда  
					//ЕстьНовыеПартии = Истина;
					ПерваяИтерация = Ложь;
					ПартииКРаспределению.Очистить();
					ПартииКРаспределению = НовыеПартииКРаспределению;
					//РасходыКРаспределению.Очистить();
					Перейти ~Метка1;
				КонецЕсли;	
			КонецЦикла;
			//Перейти ~Метка2;
	КонецЦикла;
	//ТаблицаОстатков.Колонки.Удалить("НоваяПартия");
	//ОтборНовый  = Новый Структура;
	//ОтборНовый.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
	//ОтборНовый.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.СборкаТоваров);
	////ОтборПоСборкам.Вставить("АналитикаУчетаНоменклатуры", Выборка.АналитикаУчетаНоменклатуры);
	////ОтборПоСборкам.Вставить("ВидЗапасов", Выборка.ВидЗапасов);
	////ОтборНовый.Вставить("Организация", Выборка.Организация);
	//ОтборНовый.Вставить("Стоимость", 0);
	//ТаблицаПроверки = ТаблицаОстатков.НайтиСтроки(ОтборНовый);
	//Если ТаблицаПроверки.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;	
	НаборЗаписей = РегистрыНакопления.ПартииТоваровОрганизаций.СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	ТаблицаНабораЗаписей = НаборЗаписей.ВыгрузитьКолонки();
	
	Для Каждого СтрокаКорректировки Из ТаблицаКорректировки Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(СтрокаКорректировки.Регистратор);
		НаборЗаписей.Прочитать();
		//Движение = ТаблицаНабораЗаписей.Добавить();
		Для Каждого СтрокаКМодификации Из НаборЗаписей Цикл
			//Движение = НаборЗаписей.Добавить();  
			Если ТипЗнч(СтрокаКорректировки.Регистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") 
				И СтрокаКорректировки.ВидДвижения = ВидДвиженияНакопления.Приход
				И СтрокаКМодификации.ВидДвижения = СтрокаКорректировки.ВидДвижения 
				И СтрокаКМодификации.АналитикаУчетаНоменклатуры = СтрокаКорректировки.АналитикаУчетаНоменклатуры 
				И  СтрокаКМодификации.Период = СтрокаКорректировки.Период 
				и СтрокаКМодификации.ДокументПоступления = СтрокаКорректировки.ДокументПоступления 
				И СтрокаКМодификации.Организация = СтрокаКорректировки.Организация 
				И СтрокаКМодификации.КорДокументПоступления = СтрокаКорректировки.КорДокументПоступления 
				И СтрокаКМодификации.Стоимость = 0 
				И СтрокаКМодификации.Количество = СтрокаКорректировки.Количество Тогда
				ЗаполнитьЗначенияСвойств(СтрокаКМодификации, СтрокаКорректировки);
				//НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
				НаборЗаписей.Записывать = Истина;
				НаборЗаписей.Записать(Истина);
				Прервать;
			ИначеЕсли СтрокаКМодификации.ВидДвижения = СтрокаКорректировки.ВидДвижения И СтрокаКМодификации.АналитикаУчетаНоменклатуры = СтрокаКорректировки.АналитикаУчетаНоменклатуры
				И  СтрокаКМодификации.Период = СтрокаКорректировки.Период и СтрокаКМодификации.ДокументПоступления = СтрокаКорректировки.ДокументПоступления 
				И СтрокаКМодификации.Организация = СтрокаКорректировки.Организация И СтрокаКМодификации.Стоимость = 0 
				И СтрокаКМодификации.Количество = СтрокаКорректировки.Количество Тогда
				ЗаполнитьЗначенияСвойств(СтрокаКМодификации, СтрокаКорректировки);
				//НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
				НаборЗаписей.Записывать = Истина;
				НаборЗаписей.Записать(Истина);
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;	
		 КонецЦикла;
	КонецЦикла;	

		
		
КонецПроцедуры


Процедура ДобавитьЗаписьВТаблицуКорректировки(Строка, ТаблицаКорректировки)
	
	 НоваяЗапись = ТаблицаКорректировки.Добавить();
	 ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
	
КонецПроцедуры	

Процедура СкорректироватьПартииТоваровОрганизацийПоСтоимости(ОбрабатываемыйМесяц) Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПартииТоваровОрганизаций.Период,
	 |	ПартииТоваровОрганизаций.Регистратор,
	 |	ПартииТоваровОрганизаций.НомерСтроки,
	 |	ПартииТоваровОрганизаций.Активность,
	 |	ПартииТоваровОрганизаций.ВидДвижения,
	 |	ПартииТоваровОрганизаций.Организация,
	 |	ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	 |	ПартииТоваровОрганизаций.ДокументПоступления,
	 |	ПартииТоваровОрганизаций.ВидЗапасов,
	 |	ПартииТоваровОрганизаций.АналитикаУчетаПартий,
	 |	ПартииТоваровОрганизаций.Количество,
	 |	ПартииТоваровОрганизаций.Стоимость,
	 |	ПартииТоваровОрганизаций.СтоимостьБезНДС,
	 |	ПартииТоваровОрганизаций.СтоимостьРегл,
	 |	ПартииТоваровОрганизаций.НДСРегл,
	 |	ПартииТоваровОрганизаций.Номенклатура,
	 |	ПартииТоваровОрганизаций.Характеристика,
	 |	ПартииТоваровОрганизаций.НалогообложениеНДС,
	 |	ПартииТоваровОрганизаций.ХозяйственнаяОперация,
	 |	ПартииТоваровОрганизаций.КорВидЗапасов,
	 |	ПартииТоваровОрганизаций.КорДокументПоступления,
	 |	ПартииТоваровОрганизаций.КорАналитикаУчетаПартий,
	 |	ПартииТоваровОрганизаций.ДоляСтоимости,
	 |	ПартииТоваровОрганизаций.КорАналитикаУчетаНоменклатуры,
	 |	ПартииТоваровОрганизаций.МоментВремени
	 |ПОМЕСТИТЬ Таблица
	 |ИЗ
	 |	РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваровОрганизаций
	 |ГДЕ
	 |	ПартииТоваровОрганизаций.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	 |	И НЕ ПартииТоваровОрганизаций.ДокументПоступления ССЫЛКА Документ.СборкаТоваров
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Таблица.Период,
	 |	Таблица.Регистратор,
	 |	Таблица.НомерСтроки,
	 |	Таблица.Активность,
	 |	Таблица.ВидДвижения,
	 |	Таблица.Организация,
	 |	Таблица.АналитикаУчетаНоменклатуры,
	 |	Таблица.ДокументПоступления,
	 |	Таблица.ВидЗапасов,
	 |	Таблица.АналитикаУчетаПартий,
	 |	Таблица.Количество,
	 |	ВЫРАЗИТЬ(Таблица.Стоимость / Таблица.Количество КАК ЧИСЛО(10, 0)) КАК СтоимостьТовараЗаЕдиницу,
	 |	Таблица.СтоимостьБезНДС,
	 |	Таблица.СтоимостьРегл,
	 |	Таблица.НДСРегл,
	 |	Таблица.Номенклатура,
	 |	Таблица.Характеристика,
	 |	Таблица.НалогообложениеНДС,
	 |	Таблица.ХозяйственнаяОперация,
	 |	Таблица.КорВидЗапасов,
	 |	Таблица.КорДокументПоступления,
	 |	Таблица.КорАналитикаУчетаПартий,
	 |	Таблица.ДоляСтоимости,
	 |	Таблица.КорАналитикаУчетаНоменклатуры,
	 |	Таблица.МоментВремени
	 |ПОМЕСТИТЬ СтоимостьРасход
	 |ИЗ
	 |	Таблица КАК Таблица
	 |ГДЕ
	 |	Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Таблица.Период,
	 |	Таблица.Регистратор,
	 |	Таблица.НомерСтроки,
	 |	Таблица.Активность,
	 |	Таблица.ВидДвижения,
	 |	Таблица.Организация,
	 |	Таблица.АналитикаУчетаНоменклатуры,
	 |	Таблица.ДокументПоступления,
	 |	Таблица.ВидЗапасов,
	 |	Таблица.АналитикаУчетаПартий,
	 |	Таблица.Количество,
	 |	ВЫРАЗИТЬ(Таблица.Стоимость / Таблица.Количество КАК ЧИСЛО(10, 0)) КАК СтоимостьТовараЗаЕдиницу,
	 |	Таблица.СтоимостьБезНДС,
	 |	Таблица.СтоимостьРегл,
	 |	Таблица.НДСРегл,
	 |	Таблица.Номенклатура,
	 |	Таблица.Характеристика,
	 |	Таблица.НалогообложениеНДС,
	 |	Таблица.ХозяйственнаяОперация,
	 |	Таблица.КорВидЗапасов,
	 |	Таблица.КорДокументПоступления,
	 |	Таблица.КорАналитикаУчетаПартий,
	 |	Таблица.ДоляСтоимости,
	 |	Таблица.КорАналитикаУчетаНоменклатуры,
	 |	Таблица.МоментВремени
	 |ПОМЕСТИТЬ СтоимостьПриход
	 |ИЗ
	 |	Таблица КАК Таблица
	 |ГДЕ
	 |	Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СтоимостьРасход.Период,
	 |	СтоимостьРасход.Регистратор,
	 |	СтоимостьРасход.НомерСтроки,
	 |	СтоимостьРасход.Активность,
	 |	СтоимостьРасход.ВидДвижения,
	 |	СтоимостьРасход.Организация,
	 |	СтоимостьРасход.АналитикаУчетаНоменклатуры,
	 |	СтоимостьРасход.ДокументПоступления,
	 |	СтоимостьРасход.ВидЗапасов,
	 |	СтоимостьРасход.АналитикаУчетаПартий,
	 |	СтоимостьРасход.Количество,
	 |	СтоимостьРасход.СтоимостьТовараЗаЕдиницу,
	 |	СтоимостьРасход.СтоимостьБезНДС,
	 |	СтоимостьРасход.СтоимостьРегл,
	 |	СтоимостьРасход.НДСРегл,
	 |	СтоимостьРасход.Номенклатура,
	 |	СтоимостьРасход.Характеристика,
	 |	СтоимостьРасход.НалогообложениеНДС,
	 |	СтоимостьРасход.ХозяйственнаяОперация,
	 |	СтоимостьРасход.КорВидЗапасов,
	 |	СтоимостьРасход.КорДокументПоступления,
	 |	СтоимостьРасход.КорАналитикаУчетаПартий,
	 |	СтоимостьРасход.ДоляСтоимости,
	 |	СтоимостьРасход.КорАналитикаУчетаНоменклатуры,
	 |	СтоимостьРасход.МоментВремени
	 |ПОМЕСТИТЬ ТаблицаКорректировкиРасходов
	 |ИЗ
	 |	СтоимостьРасход КАК СтоимостьРасход
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтоимостьПриход КАК СтоимостьПриход
	 |		ПО СтоимостьРасход.ДокументПоступления = СтоимостьПриход.ДокументПоступления
	 |			И СтоимостьРасход.СтоимостьТовараЗаЕдиницу <> СтоимостьПриход.СтоимостьТовараЗаЕдиницу
	 |			И СтоимостьРасход.Номенклатура = СтоимостьПриход.Номенклатура
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ТаблицаКорректировкиРасходов.Период,
	 |	ТаблицаКорректировкиРасходов.Регистратор,
	 |	ТаблицаКорректировкиРасходов.НомерСтроки,
	 |	ТаблицаКорректировкиРасходов.Активность,
	 |	ТаблицаКорректировкиРасходов.ВидДвижения,
	 |	ТаблицаКорректировкиРасходов.Организация,
	 |	ТаблицаКорректировкиРасходов.АналитикаУчетаНоменклатуры,
	 |	ТаблицаКорректировкиРасходов.ДокументПоступления,
	 |	ТаблицаКорректировкиРасходов.ВидЗапасов,
	 |	ТаблицаКорректировкиРасходов.АналитикаУчетаПартий,
	 |	ТаблицаКорректировкиРасходов.Количество,
	 |	Таблица.Стоимость КАК СтоимостьПриход,
	 |	ВЫРАЗИТЬ(Таблица.Стоимость / Таблица.Количество * ТаблицаКорректировкиРасходов.Количество КАК ЧИСЛО(15, 2)) КАК Стоимость,
	 |	ВЫРАЗИТЬ(Таблица.СтоимостьБезНДС / Таблица.Количество * ТаблицаКорректировкиРасходов.Количество КАК ЧИСЛО(15, 2)) КАК СтоимостьБезНДС,
	 |	ВЫРАЗИТЬ(Таблица.СтоимостьРегл / Таблица.Количество * ТаблицаКорректировкиРасходов.Количество КАК ЧИСЛО(15, 2)) КАК СтоимостьРегл,
	 |	ВЫРАЗИТЬ(Таблица.НДСРегл / Таблица.Количество * ТаблицаКорректировкиРасходов.Количество КАК ЧИСЛО(15, 2)) КАК НДСРегл,
	 |	ТаблицаКорректировкиРасходов.Номенклатура,
	 |	ТаблицаКорректировкиРасходов.Характеристика,
	 |	ТаблицаКорректировкиРасходов.НалогообложениеНДС,
	 |	ТаблицаКорректировкиРасходов.ХозяйственнаяОперация,
	 |	ТаблицаКорректировкиРасходов.КорВидЗапасов,
	 |	ТаблицаКорректировкиРасходов.КорДокументПоступления,
	 |	ТаблицаКорректировкиРасходов.КорАналитикаУчетаПартий,
	 |	ТаблицаКорректировкиРасходов.ДоляСтоимости,
	 |	ТаблицаКорректировкиРасходов.КорАналитикаУчетаНоменклатуры,
	 |	ТаблицаКорректировкиРасходов.МоментВремени
	 |ИЗ
	 |	ТаблицаКорректировкиРасходов КАК ТаблицаКорректировкиРасходов
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Таблица КАК Таблица
	 |		ПО ТаблицаКорректировкиРасходов.ДокументПоступления = Таблица.Регистратор
	 |			И ТаблицаКорректировкиРасходов.Организация = Таблица.Организация
	 |			И ТаблицаКорректировкиРасходов.Номенклатура = Таблица.Номенклатура
	 |			И ТаблицаКорректировкиРасходов.Характеристика = Таблица.Характеристика";
	 
	 Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ОбрабатываемыйМесяц));
	 Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ОбрабатываемыйМесяц));
	 
	 Результат = Запрос.Выполнить();
	 Если Результат.Пустой() тогда
		 Возврат;
	 КонецЕсли;
	 
	 Выборка = Результат.Выбрать();
	 
	 НаборЗаписей = РегистрыНакопления.ПартииТоваровОрганизаций.СоздатьНаборЗаписей();
	 
	 Пока Выборка.Следующий() Цикл
		 
		//Отбор = Новый Структура;
		//Отбор.Вставить("ВидДвижения", Выборка.ВидДвижения);
		//Отбор.Вставить("Регистратор", Выборка.Регистратор);
		//Отбор.Вставить("АналитикаУчетаНоменклатуры", Выборка.АналитикаУчетаНоменклатуры);
		//Отбор.Вставить("ВидЗапасов", Выборка.ВидЗапасов);
		//Отбор.Вставить("Организация", Выборка.Организация);
		//Отбор.Вставить("ХозяйственнаяОперация", Выборка.ХозяйственнаяОперация);
		//Отбор.Вставить("Период", Выборка.Период);
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		//РасходыККорекции = НаборЗаписей.НайтиСтроки(Отбор);
	  //Если РасходыККорекции.Количество = 0 ИЛИ РасходыККорекции.Количество > 1 Тогда
	  //  	Продолжить;
	  //  Конецесли;
		
		Для Каждого Запись из НаборЗаписей Цикл
			Если Выборка.ВидДвижения = Запись.ВидДвижения И Выборка.Регистратор = Запись.Регистратор
				и Выборка.АналитикаУчетаНоменклатуры = Запись.АналитикаУчетаНоменклатуры И Выборка.ВидЗапасов = Запись.ВидЗапасов
				И Выборка.Организация = Запись.Организация И Выборка.ХозяйственнаяОперация = Запись.ХозяйственнаяОперация
				И Выборка.Период = Запись.Период И Выборка.Количество = Запись.Количество Тогда
                    ЗаполнитьЗначенияСвойств(Запись, Выборка);
					НаборЗаписей.Записывать = Истина;
					НаборЗаписей.Записать(Истина);
			КонецЕсли;		
        КонецЦикла;	
	 
	 КонецЦикла;
	 
	 СкорректиоватьНеточностиОкругления(ОбрабатываемыйМесяц);
	
 КонецПроцедуры
 
 Процедура СкорректиоватьНеточностиОкругления(ОбрабатываемыйМесяц)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПартииТоваровОрганизацийОстатки.Организация,
	 |	ПартииТоваровОрганизацийОстатки.АналитикаУчетаНоменклатуры,
	 |	ПартииТоваровОрганизацийОстатки.ДокументПоступления,
	 |	ПартииТоваровОрганизацийОстатки.ВидЗапасов,
	 |	ПартииТоваровОрганизацийОстатки.АналитикаУчетаПартий,
	 |	ПартииТоваровОрганизацийОстатки.КоличествоОстаток,
	 |	ПартииТоваровОрганизацийОстатки.СтоимостьОстаток КАК Стоимость,
	 |	ПартииТоваровОрганизацийОстатки.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	 |	ПартииТоваровОрганизацийОстатки.СтоимостьРеглОстаток КАК СтоимостьРегл,
	 |	ПартииТоваровОрганизацийОстатки.НДСРеглОстаток КАК НДСРегл
	 |ПОМЕСТИТЬ СуммовыеОстатки
	 |ИЗ
	 |	РегистрНакопления.ПартииТоваровОрганизаций.Остатки(&Дата, ) КАК ПартииТоваровОрганизацийОстатки
	 |ГДЕ
	 |	ПартииТоваровОрганизацийОстатки.КоличествоОстаток = 0
	 |	И (ПартииТоваровОрганизацийОстатки.СтоимостьОстаток <> 0
	 |			ИЛИ ПартииТоваровОрганизацийОстатки.СтоимостьБезНДСОстаток <> 0
	 |			ИЛИ ПартииТоваровОрганизацийОстатки.СтоимостьРеглОстаток <> 0
	 |			ИЛИ ПартииТоваровОрганизацийОстатки.НДСРеглОстаток <> 0)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	МАКСИМУМ(ПартииТоваровОрганизаций.Период) КАК ДатаПоследнегоСписания
	 |ПОМЕСТИТЬ ДатыСписания
	 |ИЗ
	 |	СуммовыеОстатки КАК СуммовыеОстатки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваровОрганизаций
	 |		ПО СуммовыеОстатки.Организация = ПартииТоваровОрганизаций.Организация
	 |			И СуммовыеОстатки.АналитикаУчетаНоменклатуры = ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры
	 |			И СуммовыеОстатки.ВидЗапасов = ПартииТоваровОрганизаций.ВидЗапасов
	 |			И СуммовыеОстатки.АналитикаУчетаПартий = ПартииТоваровОрганизаций.АналитикаУчетаПартий
	 |			И СуммовыеОстатки.ДокументПоступления = ПартииТоваровОрганизаций.ДокументПоступления
	 |ГДЕ
	 |	ПартииТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПартииТоваровОрганизаций.Период,
	 |	ПартииТоваровОрганизаций.Регистратор,
	 |	ПартииТоваровОрганизаций.НомерСтроки,
	 |	ПартииТоваровОрганизаций.Активность,
	 |	ПартииТоваровОрганизаций.ВидДвижения,
	 |	ПартииТоваровОрганизаций.Организация,
	 |	ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	 |	ПартииТоваровОрганизаций.ДокументПоступления,
	 |	ПартииТоваровОрганизаций.ВидЗапасов,
	 |	ПартииТоваровОрганизаций.АналитикаУчетаПартий,
	 |	ПартииТоваровОрганизаций.Количество,
	 |	ПартииТоваровОрганизаций.Стоимость - СуммовыеОстатки.Стоимость КАК Стоимость,
	 |	ПартииТоваровОрганизаций.СтоимостьБезНДС - СуммовыеОстатки.СтоимостьБезНДС КАК СтоимостьБезНДС,
	 |	ПартииТоваровОрганизаций.СтоимостьРегл - СуммовыеОстатки.СтоимостьРегл КАК СтоимостьРегл,
	 |	ПартииТоваровОрганизаций.НДСРегл - СуммовыеОстатки.НДСРегл КАК НДСРегл,
	 |	ПартииТоваровОрганизаций.Номенклатура,
	 |	ПартииТоваровОрганизаций.Характеристика,
	 |	ПартииТоваровОрганизаций.НалогообложениеНДС,
	 |	ПартииТоваровОрганизаций.ХозяйственнаяОперация,
	 |	ПартииТоваровОрганизаций.КорВидЗапасов,
	 |	ПартииТоваровОрганизаций.КорДокументПоступления,
	 |	ПартииТоваровОрганизаций.КорАналитикаУчетаПартий,
	 |	ПартииТоваровОрганизаций.ДоляСтоимости,
	 |	ПартииТоваровОрганизаций.КорАналитикаУчетаНоменклатуры
	 |ИЗ
	 |	СуммовыеОстатки КАК СуммовыеОстатки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций КАК ПартииТоваровОрганизаций
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыСписания КАК ДатыСписания
	 |			ПО ПартииТоваровОрганизаций.Период = ДатыСписания.ДатаПоследнегоСписания
	 |		ПО СуммовыеОстатки.Организация = ПартииТоваровОрганизаций.Организация
	 |			И СуммовыеОстатки.АналитикаУчетаНоменклатуры = ПартииТоваровОрганизаций.АналитикаУчетаНоменклатуры
	 |			И СуммовыеОстатки.ВидЗапасов = ПартииТоваровОрганизаций.ВидЗапасов
	 |			И СуммовыеОстатки.АналитикаУчетаПартий = ПартииТоваровОрганизаций.АналитикаУчетаПартий
	 |			И СуммовыеОстатки.ДокументПоступления = ПартииТоваровОрганизаций.ДокументПоступления
	 |ГДЕ
	 |	ПартииТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	 
	 Запрос.УстановитьПараметр("Дата",КонецМесяца(ОбрабатываемыйМесяц) );
	 
	Результат = Запрос.Выполнить();
	 Если Результат.Пустой() тогда
		 Возврат;
	 КонецЕсли;
	 
	 Выборка = Результат.Выбрать();
	 
	 НаборЗаписей = РегистрыНакопления.ПартииТоваровОрганизаций.СоздатьНаборЗаписей();
	 
	 Пока Выборка.Следующий() Цикл
		 
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
				
		Для Каждого Запись из НаборЗаписей Цикл
			Если Выборка.ВидДвижения = Запись.ВидДвижения И Выборка.Регистратор = Запись.Регистратор
				и Выборка.АналитикаУчетаНоменклатуры = Запись.АналитикаУчетаНоменклатуры И Выборка.ВидЗапасов = Запись.ВидЗапасов
				И Выборка.Организация = Запись.Организация И Выборка.ХозяйственнаяОперация = Запись.ХозяйственнаяОперация
				И Выборка.Период = Запись.Период И Выборка.Количество = Запись.Количество Тогда
                    ЗаполнитьЗначенияСвойств(Запись, Выборка);
					НаборЗаписей.Записывать = Истина;
					НаборЗаписей.Записать(Истина);
			КонецЕсли;		
        КонецЦикла;	
	 
	 КонецЦикла;
	 
	 
КонецПроцедуры	 
