
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОтправитьВДиалогах(Команда)
	#Если ВебКлиент Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПутьКПустомуФайлуМакетаПродолжение", ЭтотОбъект);
		НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	#Иначе
		ПутьКПустомуФайлуМакетаПродолжение(Истина, "");
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПустомуФайлуМакетаПродолжение(Подключено, ДополнительныеПараметры) Экспорт
	Если Подключено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеКаталогаЗавершениеДиалоги", ЭтотОбъект);
		НачатьПолучениеКаталогаВременныхФайлов(ОписаниеОповещения);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПутьКПустомуФайлуМакетаПродолжение", ЭтотОбъект);
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПолучениеКаталогаЗавершениеДиалоги(Путь, ДопПараметры) Экспорт
	Каталог = Путь;
	ТипМакета = "HTML";
	
	УИН = Новый УникальныйИдентификатор;
	
	ИмяФайла = Строка(УИН) + ".html";
	ПутьКФайлуМакета = Каталог + "\" + ИмяФайла;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаписиМакета", ЭтотОбъект);
	ТекДок = Новый ТекстовыйДокумент;
	ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
	ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
	ТекстHTML = "<html>
	|<head>
	|"+ТекстПроверкиТМПHead+"
	|</head>
	|<body>" + ТекстПроверкиТМПBody +"
	|</body>
	|<html>";  
	ТекДок.ДобавитьСтроку(ТекстHTML);
	ТекДок.НачатьЗапись(ОписаниеОповещения, ПутьКФайлуМакета);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписиМакета(Подключено, ДопПараметры) Экспорт
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикОповещенияБезДействия", CRM_ОбщегоНазначенияКлиент);	
	ОткрытьФорму("Обработка.CRM_Мессенджер.Форма", ПолучитьПараметрыОткрытияДляМессенджера(), ЭтотОбъект,,,, ОписаниеОповещения);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.ИмяДокумента;
	СтилиТекста = Элементы.КомандаformatBlock.СписокВыбора[0].Значение;
	ИмяШрифта = Элементы.КомандаFontName.СписокВыбора[0].Значение;
	РазмерШрифта = 3;
	ЭтоПечать = Ложь;
	
	Элементы.Редактирование.Пометка = Истина;
	ПредыдущийРежим = Элементы.Редактирование.Имя;
	ИмяОбъектаМетаданныхМакета = Параметры.ИмяОбъектаМетаданныхМакета;
	
	ЭтоИнтерес = (Найти(ИмяОбъектаМетаданныхМакета, "Документ.CRM_Интерес") > 0);
	
	Если ЭтоИнтерес Тогда
		ИдентификаторМДОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.CRM_Интерес);
	Иначе	
		ИдентификаторМДОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.КоммерческоеПредложениеКлиенту);
	КонецЕсли;	
		
	
	ТаблицаАвтотекстаЗнач = РеквизитФормыВЗначение("ТаблицаАвтотекста");
	CRM_АвтотекстПереопределяемый.СформироватьСписокАвтотекста(ТаблицаАвтотекстаЗнач, ИдентификаторМДОбъекта,,Ложь);
	ЗначениеВРеквизитФормы(ТаблицаАвтотекстаЗнач, "ТаблицаАвтотекста");
	
	ТаблицаАвтотекстаЗнач = РеквизитФормыВЗначение("ТаблицаАвтотекстаТовары");
	CRM_АвтотекстПереопределяемый.СформироватьСписокАвтотекста(ТаблицаАвтотекстаЗнач, ИдентификаторМДОбъекта,"Товары",Ложь);
	ЗначениеВРеквизитФормы(ТаблицаАвтотекстаЗнач, "ТаблицаАвтотекстаТовары");
	
	
	CRM_АвтотекстПереопределяемый.ЗаполнитьКоманднуюПанельФорматированногоДокумента(ЭтотОбъект, Истина,,, "ТаблицаАвтотекстаТовары", "АвтотекстТовары");
	CRM_АвтотекстПереопределяемый.ЗаполнитьКоманднуюПанельФорматированногоДокумента(ЭтотОбъект, Истина,,, "ТаблицаАвтотекста", "АвтотекстРеквизиты");
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	Если Параметры.Свойство("Печать") Тогда
		Элементы.ЗаписатьЗакрыть.Видимость = Ложь;
		Элементы.Записать.Видимость = Ложь;
		Элементы.Текст.Видимость = Ложь;
		Элементы.Автотекст.Видимость = Ложь;
		Элементы.АвтоТекстКонтекст.Видимость = Ложь;
		ОбъектСсылка = Параметры.ОбъектСсылка;
		ЭтоПечать = Истина;
		Элементы.ПолеHTMLДокумента.ТолькоПросмотр = Истина;
		Если ЭтоИнтерес Тогда
			СформироватьДокумент(1);
		Иначе
			СформироватьДокумент(Параметры.НомерВарианта);
		КонецЕсли;
	Иначе	
		ЧастиИмени = СтрРазделить(ИмяОбъектаМетаданныхМакета, ".");
		ИмяМакета = ЧастиИмени[ЧастиИмени.ВГраница()];
		
		ИмяВладельца = "";
		Для НомерЧасти = 0 По ЧастиИмени.ВГраница()-1 Цикл
			Если Не ПустаяСтрока(ИмяВладельца) Тогда
				ИмяВладельца = ИмяВладельца + ".";
			КонецЕсли;
			ИмяВладельца = ИмяВладельца + ЧастиИмени[НомерЧасти];
		КонецЦикла;
		
		ИмяОбъектаМетаданныхМакета	= Параметры.ИмяОбъектаМетаданныхМакета;
		РедактированиеЗапрещено		= НЕ Параметры.Редактирование;
		Если Параметры.Свойство("ТекстовыйДокумент") Тогда
			ДанныеПоляHTMLДокумента = Параметры.ТекстовыйДокумент;
		Иначе	
			ДанныеПоляHTMLДокумента = "about:";
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоПечать И НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати) Тогда
		Элементы.Редактирование.Доступность = Ложь;
	КонецЕсли;	
	
	Элементы.ГруппаДополнительное.Видимость = Ложь;
	Элементы.Отправить.Видимость = ЭтоПечать;
	Элементы.ОтправитьВДиалогах.Видимость = ЭтоПечать;
	
	Если НЕ ЭтоПечать Тогда
		Элементы.ЗаписатьЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ПустаяСтрока(ИмяОбъектаМетаданныхМакета) И (ДанныеПоляHTMLДокумента = "about:") Тогда
		ЗагрузитьТабличныйДокументИзМетаданных();
	Иначе
		ПриОткрытииЗавершение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы Тогда
		Если НЕ ЭтоПечать Тогда
			Если НЕ НеПроверять Тогда
				ТекстПроверки = "";
				ВходящийТекстПроверки = "";
				ВходящийТекст = СтрЗаменить(ВходящийТекст,"<html>","");
				ВходящийТекст = СтрЗаменить(ВходящийТекст,"</html>","");
				ВходящийТекст = СтрЗаменить(ВходящийТекст,"<body>","");
				ВходящийТекст = СтрЗаменить(ВходящийТекст,"</body>","");
				ВходящийТекст = СтрЗаменить(ВходящийТекст,"<head>","");
				ВходящийТекст = СтрЗаменить(ВходящийТекст,"</head>","");
				ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
				ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
				ТекстПроверкиТМП = "<html>
				|<head>
				|"+ТекстПроверкиТМПHead+"
				|</head>
				|<body>" + ТекстПроверкиТМПBody +"
				|</body>
				|<html>";
				ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<html>","");
				ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</html>","");
				ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<body>","");
				ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</body>","");
				ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<head>","");
				ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</head>","");
				КолСтрок = СтрЧислоСтрок(ТекстПроверкиТМП);
				Для а = 1 По КолСтрок Цикл
					Стр = СтрПолучитьСтроку(ТекстПроверкиТМП, а);
					Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
						ТекстПроверки = ТекстПроверки + Стр+"
						|";
					КонецЕсли;	
				КонецЦикла;	
				КолСтрок = СтрЧислоСтрок(ВходящийТекст);
				Для а = 1 По КолСтрок Цикл
					Стр = СтрПолучитьСтроку(ВходящийТекст, а);
					Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
						ВходящийТекстПроверки = ВходящийТекстПроверки + Стр+"
						|";
					КонецЕсли;	
				КонецЦикла;	
				КолСтрокВх = СтрЧислоСтрок(ВходящийТекстПроверки);
				КолСтрок = СтрЧислоСтрок(ТекстПроверки);
				Если ТекстПроверки <> ВходящийТекстПроверки Тогда
					Отказ = Истина;
					ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаОСохранении", ЭтотОбъект);
					ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Макет был изменен. Сохранить ?'"), РежимДиалогаВопрос.ДаНетОтмена);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайл(Команда)
	ТекстПроверки = "";
	ВходящийТекстПроверки = "";
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"<html>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"</html>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"<body>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"</body>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"<head>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"</head>","");
	
	ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
	ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
	ТекстПроверкиТМП = "<html>
	|<head>
	|"+ТекстПроверкиТМПHead+"
	|</head>
	|<body>" + ТекстПроверкиТМПBody +"
	|</body>
	|<html>";
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<html>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</html>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<body>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</body>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<head>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</head>","");
	
	КолСтрок = СтрЧислоСтрок(ТекстПроверкиТМП);
	Для а = 1 По КолСтрок Цикл
		Стр = СтрПолучитьСтроку(ТекстПроверкиТМП, а);
		Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
			ТекстПроверки = ТекстПроверки + Стр+"
			|";
		КонецЕсли;	
	КонецЦикла;	
	КолСтрок = СтрЧислоСтрок(ВходящийТекст);
	Для а = 1 По КолСтрок Цикл
		Стр = СтрПолучитьСтроку(ВходящийТекст, а);
		Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
			ВходящийТекстПроверки = ВходящийТекстПроверки + Стр+"
			|";
		КонецЕсли;	
	КонецЦикла;	
	КолСтрокВх = СтрЧислоСтрок(ВходящийТекстПроверки);
	КолСтрок = СтрЧислоСтрок(ТекстПроверки);
	Если ТекстПроверки <> ВходящийТекстПроверки Тогда
		ПараметрЗакрытия = "";
		ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
		ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
		ТекстПроверки = "<html>
		|<head>
		|"+ТекстПроверкиТМПHead+"
		|</head>
		|<body>" + ТекстПроверкиТМПBody +"
		|</body>
		|<html>";
		КолСтрок = СтрЧислоСтрок(ТекстПроверки);
		Для а = 1 По КолСтрок Цикл
			Стр = СтрПолучитьСтроку(ТекстПроверки, а);
			Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
				ПараметрЗакрытия = ПараметрЗакрытия + Стр+"
				|";
			КонецЕсли;	
		КонецЦикла;
		Макет = Новый ТекстовыйДокумент;
		Макет.ДобавитьСтроку(ПараметрЗакрытия);
		ЗаписатьМакет(Макет);
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ИмяОбъектаМетаданныхМакета", ИмяОбъектаМетаданныхМакета);
		Оповестить("Запись_ПользовательскиеМакетыПечати", ПараметрыОповещения, ЭтотОбъект);
		ВходящийТекст = ТекстПроверки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВставитьТэг(Команда)
	ИмяКоманды = Команда.Имя;
	Если Найти(ИмяКоманды, "АвтотекстТовары") > 0 Тогда
		ИмяКоманды = СтрЗаменить(ИмяКоманды, "АвтотекстТовары", "");
		МассивСтрок = ТаблицаАвтотекстаТовары.НайтиСтроки(Новый Структура("ИмяКоманды", ИмяКоманды));
	Иначе
		ИмяКоманды = СтрЗаменить(ИмяКоманды, "АвтотекстРеквизиты", "");
		МассивСтрок = ТаблицаАвтотекста.НайтиСтроки(Новый Структура("ИмяКоманды", ИмяКоманды));
	КонецЕсли;
	Тэг = МассивСтрок[0].Тэг;
	
	Кнопка = "insertText";
	Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Кнопка) Тогда
		Элементы.ПолеHTMLДокумента.Документ.execCommand(Кнопка, Ложь, Тэг);
	КонецЕсли;
	ПоказатьРежимыКнопок();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоздатьТег(Команда)
	
	Элемент = СтрЗаменить(Команда.Имя, "МенюАвтотекстаСоздатьТег", "");
	Если Элемент = "АвтотекстТовары" Тогда
		Таблица = "ТаблицаАвтотекстаТовары";
		ИмяТЧ = "Товары";
	Иначе
		Таблица = "ТаблицаАвтотекста";
		ИмяТЧ = "";
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_СоздатьТегЗавершение", ЭтотОбъект, Новый Структура("Элемент, Таблица", Элемент, Таблица));
	CRM_АвтотекстКлиент.СоздатьТегАвтотекста(ЭтотОбъект, Команда, ИдентификаторМДОбъекта, ИмяТЧ, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоздатьТегЗавершение(ТегАвтотекста, ДопПараметры) Экспорт
	
	ИмяКоманды = ДобавитьКомандуАвтотекста(ТегАвтотекста, ДопПараметры);
	Команда = Команды.Найти(ИмяКоманды);
	Если Команда<>Неопределено Тогда
		Подключаемый_ВставитьТэг(Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомандуАвтотекста(ТегАвтотекста, ДопПараметры)
	
	Возврат CRM_АвтотекстПереопределяемый.ДобавитьКомандуАвтотекста(ЭтотОбъект, ТегАвтотекста, Ложь, Истина, , ДопПараметры.Таблица, ДопПараметры.Элемент);
	
КонецФункции

&НаКлиенте
Процедура ПолеHTMLДокументаДокументСформирован(Элемент)
	Если НЕ CRM_ОбщегоНазначенияКлиент.ЭтоМобильныйКлиент() Тогда
		Элемент.Документ.Body.ContentEditable = "true";
	КонецЕсли;	
	//Элемент.Документ.Body.innerHTML = Параметры.ТекстHTML;
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Попытка
		Если ДанныеСобытия.Element.nodeName = "IMG" Тогда
			ПараметрыФормы = Новый Структура("Ширина,Высота", ДанныеСобытия.Element.width, ДанныеСобытия.Element.height);
			ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьКартинкуЗавершение", ЭтотОбъект, ДанныеСобытия);
			ОткрытьФорму("ОбщаяФорма.CRM_РедакторHTMLИзменениеКартинки", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);	
		Иначе	
			ПоказатьРежимыКнопок();
		КонецЕсли;
	Исключение	
		ПоказатьРежимыКнопок();
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКартинкуЗавершение(СтруктураВозврата, ДанныеСобытия) Экспорт
	Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ДанныеСобытия.Element.width = СтруктураВозврата.Ширина;
	ДанныеСобытия.Element.height = СтруктураВозврата.Высота;
	ПоказатьРежимыКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПоOK(Команда)
	НеПроверять = Истина;
	КоманднаяПанельРежим(Команды.Просмотр);
	ТекстПроверки = "";
	ВходящийТекстПроверки = "";
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"<html>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"</html>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"<body>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"</body>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"<head>","");
	ВходящийТекст = СтрЗаменить(ВходящийТекст,"</head>","");
	
	ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
	ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
	ТекстПроверкиТМП = "<html>
	|<head>
	|"+ТекстПроверкиТМПHead+"
	|</head>
	|<body>" + ТекстПроверкиТМПBody +"
	|</body>
	|<html>";
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<html>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</html>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<body>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</body>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"<head>","");
	ТекстПроверкиТМП = СтрЗаменить(ТекстПроверкиТМП,"</head>","");
	
	КолСтрок = СтрЧислоСтрок(ТекстПроверкиТМП);
	Для а = 1 По КолСтрок Цикл
		Стр = СтрПолучитьСтроку(ТекстПроверкиТМП, а);
		Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
			ТекстПроверки = ТекстПроверки + Стр+"
			|";
		КонецЕсли;	
	КонецЦикла;	
	КолСтрок = СтрЧислоСтрок(ВходящийТекст);
	Для а = 1 По КолСтрок Цикл
		Стр = СтрПолучитьСтроку(ВходящийТекст, а);
		Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
			ВходящийТекстПроверки = ВходящийТекстПроверки + Стр+"
			|";
		КонецЕсли;	
	КонецЦикла;	
	КолСтрокВх = СтрЧислоСтрок(ВходящийТекстПроверки);
	КолСтрок = СтрЧислоСтрок(ТекстПроверки);
	Если ТекстПроверки <> ВходящийТекстПроверки Тогда
		ПараметрЗакрытия = "";
		ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
		ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
		ТекстПроверки = "<html>
		|<head>
		|"+ТекстПроверкиТМПHead+"
		|</head>
		|<body>" + ТекстПроверкиТМПBody +"
		|</body>
		|<html>";
		КолСтрок = СтрЧислоСтрок(ТекстПроверки);
		Для а = 1 По КолСтрок Цикл
			Стр = СтрПолучитьСтроку(ТекстПроверки, а);
			Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
				ПараметрЗакрытия = ПараметрЗакрытия + Стр+"
				|";
			КонецЕсли;	
		КонецЦикла;
		Макет = Новый ТекстовыйДокумент;
		Макет.ДобавитьСтроку(ПараметрЗакрытия);
		ЗаписатьМакет(Макет);
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ИмяОбъектаМетаданныхМакета", ИмяОбъектаМетаданныхМакета);
		Оповестить("Запись_ПользовательскиеМакетыПечати", ПараметрыОповещения, ЭтотОбъект);
	КонецЕсли;
	
	Закрыть(ПараметрЗакрытия);	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(Кнопка)
	
	Команда = Сред(Кнопка.Имя, 8);
	Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Команда) Тогда
		Элементы.ПолеHTMLДокумента.Документ.execCommand(Команда, Ложь);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРежимыКнопок()
	Для каждого Группа Из Элементы.КоманднаяПанельКнопок.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Группа) = Тип("ГруппаФормы") Тогда
			Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(Кнопка) = тип("КнопкаФормы") Тогда
					Команда = Сред(Кнопка.Имя, 8);
					Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Команда) Тогда
						Попытка
							Кнопка.Пометка = Элементы.ПолеHTMLДокумента.Документ.queryCommandState(Команда);
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Команда = Сред(Группа.Имя, 8);
			Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Команда) Тогда
				Попытка
					Кнопка.Пометка = Элементы.ПолеHTMLДокумента.Документ.queryCommandState(Команда);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьШрифт(Команда)
	
	HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
	Размер = Число(HTMLДокумент.queryCommandValue("fontSize"));
	
	Если Не ЗначениеЗаполнено(Размер) Тогда 
		Размер = 2;
	КонецЕсли;
	HTMLДокумент.execCommand("fontSize", Ложь, Размер + 1);
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьШрифт(Команда)
	
	HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
	Размер = Число(HTMLДокумент.queryCommandValue("fontSize"));
	Если Не ЗначениеЗаполнено(Размер) Тогда 
		Размер = 3;
	КонецЕсли;
	HTMLДокумент.execCommand("fontSize", Ложь, Размер - 1);
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШрифт(Команда)
	
	ДиалогВыбораШрифта = Новый ДиалогВыбораШрифта;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеИзменитьШрифт", ЭтотОбъект);
	ДиалогВыбораШрифта.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьHTMLКоманду(Команда)
	
	HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
	HTMLДокумент.execCommand(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеИзменитьШрифт(Шрифт, Параметры) Экспорт
	
	Если Шрифт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Шрифт.Имя) Тогда
		
		HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
		HTMLДокумент.execCommand("fontName", Ложь, Шрифт.Имя);
		
	КонецЕсли;
	
	РазмерШрифта = 2;
	
	Если Шрифт.Размер <> -1 Тогда
		Если Шрифт.Размер < 8 Тогда
			РазмерШрифта = 1;
		ИначеЕсли Шрифт.Размер <= 10 Тогда
			РазмерШрифта = 2;	
		ИначеЕсли Шрифт.Размер <= 12 Тогда
			РазмерШрифта = 3;	
		ИначеЕсли Шрифт.Размер <= 14 Тогда
			РазмерШрифта = 4;	
		ИначеЕсли Шрифт.Размер <= 16 Тогда
			РазмерШрифта = 5;	
		ИначеЕсли Шрифт.Размер <= 18 Тогда
			РазмерШрифта = 6;	
		Иначе
			РазмерШрифта = 7;	
		КонецЕсли;	
	КонецЕсли;
	
	HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
	HTMLДокумент.execCommand("fontSize", Ложь, РазмерШрифта);
	
	Если Шрифт.Зачеркивание = Истина Тогда
		
		HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
		ВыполнитьHTMLКоманду("strikeThrough");
		
	КонецЕсли;	
	
	Если Шрифт.Полужирный = Истина Тогда
		
		HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
		ВыполнитьHTMLКоманду("Bold");
		
	КонецЕсли;	
	
	Если Шрифт.Наклонный = Истина Тогда
		
		HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
		ВыполнитьHTMLКоманду("italic");
		
	КонецЕсли;	
	
	Если Шрифт.Подчеркивание = Истина Тогда
		
		HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
		ВыполнитьHTMLКоманду("underline");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельРежим(Команда, ОбновлятьРежим = Истина)
	Если Команда.Имя = "Редактирование" Тогда
		Элементы.ПолеHTMLДокумента.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Кнопка = Элементы[Команда.Имя];
	Если Кнопка.Пометка Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы.Редактирование.Пометка = Ложь;
	Элементы.Текст.Пометка = Ложь;
	Кнопка.Пометка = Истина;
	
	Если Кнопка = Элементы.Текст Тогда
		
		// На некоторых машинах видимо из за настроек безопасности IE раскраска кода не получается
		// Поэтому делаем через попытку
		Попытка 
			sExpression = "
			|document.body.innerText = document.body.innerHTML;
			|document.body.innerHTML = colourCode(document.body.innerHTML);
			|function colourCode(code)
			|{
			|    htmlTag = /(&lt;([\s\S]*?)&gt;)/gi
			|    tableTag = /(&lt;(table|tbody|th|tr|td|\/table|\/tbody|\/th|\/tr|\/td)([\s\S]*?)&gt;)/gi
			|    commentTag = /(&lt;!--([\s\S]*?)&gt;)/gi
			|    imageTag = /(&lt;img([\s\S]*?)&gt;)/gi
			|    linkTag = /(&lt;(a|\/a)([\s\S]*?)&gt;)/gi
			|    scriptTag = /(&lt;(script|\/script)([\s\S]*?)&gt;)/gi
			|    code = code.replace(htmlTag,""<font color=#FF0000>$1</font>"")
			|    code = code.replace(tableTag,""<font color=#008080>$1</font>"")
			|    code = code.replace(commentTag,""<font color=#808080>$1</font>"")
			|    code = code.replace(imageTag,""<font color=#800080>$1</font>"")
			|    code = code.replace(linkTag,""<font color=#008000>$1</font>"")
			|    code = code.replace(scriptTag,""<font color=#800000>$1</font>"")
			|    return code;
			|}";
			Элементы.ПолеHTMLДокумента.Документ.parentWindow.execScript(sExpression);
			
		Исключение
			Элементы.ПолеHTMLДокумента.Документ.Body.InnerText = Элементы.ПолеHTMLДокумента.Документ.Body.InnerHTML;
		КонецПопытки;
		
	ИначеЕсли ПредыдущийРежим = Элементы.Текст.Имя Тогда
		Элементы.ПолеHTMLДокумента.Документ.Body.InnerHTML = Элементы.ПолеHTMLДокумента.Документ.Body.InnerText;
	КонецЕсли;
	
	ДоступностьКнопок = (Кнопка = Элементы.Редактирование);
	Элементы.ГруппаФормат.Видимость = ДоступностьКнопок;
	
	Для каждого Группа Из Элементы.КоманднаяПанельКнопок.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Группа) = Тип("ГруппаФормы") Тогда
			Если Группа.Имя = "ГруппаУправлениеРежимом" Тогда
				УправлятьДоступностью = Ложь;
			Иначе
				УправлятьДоступностью = Истина;
			КонецЕсли;
			
			Для каждого Кн Из Группа.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(Кн) = тип("КнопкаФормы") Тогда
					Если УправлятьДоступностью Тогда
						Кн.Видимость = ДоступностьКнопок
					КонецЕсли; 
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ТипЗнч(Группа) = тип("КнопкаФормы") Тогда
				Группа.Видимость = ДоступностьКнопок
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Элементы.Автотекст.Видимость = НЕ ЭтоПечать И ДоступностьКнопок;
	Элементы.АвтоТекстКонтекст.Видимость = НЕ ЭтоПечать И ДоступностьКнопок;
	Элементы.ЗаписатьЗакрыть.Видимость = НЕ ЭтоПечать;
	Элементы.Записать.Видимость = НЕ ЭтоПечать;
	Элементы.Отправить.Видимость = ЭтоПечать;
	Элементы.ОтправитьВДиалогах.Видимость = ЭтоПечать;
	
	#Если ВебКлиент Тогда
		Элементы.КомандаPrint.Видимость = Ложь;
	#Иначе
		Элементы.КомандаPrint.Видимость = ЭтоПечать;
	#КонецЕсли
	
	Элементы.ПосмотретьФорму.Видимость = ДоступностьКнопок;
	
	Если НЕ ДоступностьКнопок Тогда
		Элементы.ПоказатьДопФорматирование.Пометка = Ложь;
		Элементы.ГруппаДополнительное.Видимость = Ложь;
	КонецЕсли;
	
	ПредыдущийРежим = Кнопка.Имя;
	Если ОбновлятьРежим Тогда
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуСписка(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Команда = Сред(Элемент.Имя, 8);
	Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Команда) Тогда
		Список = Элемент.СписокВыбора;
		Элементы.ПолеHTMLДокумента.Документ.execCommand(Команда, Истина, ВыбранноеЗначение);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьГиперссылку(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборГиперссылкиЗавершение", ЭтотОбъект, Команда);
	ОткрытьФорму("ОбщаяФорма.CRM_РедакторHTMLВыборГиперссылки",, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборГиперссылкиЗавершение(Гиперссылка, Команда) Экспорт
	
	Если Гиперссылка <> Неопределено Тогда
		Элементы.ПолеHTMLДокумента.Документ.execCommand("CreateLink", Ложь, Гиперссылка);
	КонецЕсли;
	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦвета(Команда)
	ПараметрыФормы = Новый Структура("ИсточникВызова", Команда.Имя);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект, Команда);
	ОткрытьФорму("ОбщаяФорма.CRM_РедакторHTMLВыборЦвета", , ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦветаЗавершение(Цвет, Команда) Экспорт
	
	//Цвет = Результат;
	Если ТипЗнч(Цвет)=Тип("Структура") Тогда 
		Кнопка = Сред(Команда.Имя, 8);
		Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Кнопка) Тогда
			Элементы.ПолеHTMLДокумента.Документ.execCommand(Кнопка, Ложь, "" + HEX(Цвет.Красный) + HEX(Цвет.Зеленый) + HEX(Цвет.Синий));
		КонецЕсли;
	КонецЕсли;
	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзображение(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПомещениеФайлаЗавершение", ЭтотОбъект);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Изображения|*.png;*.gif;*.jpg;*.jpeg;*.svg|Все файлы|*.*";
	НачатьПомещениеФайла(ОписаниеОповещения, , ДиалогВыбораФайла, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаЗавершение(Результат, Адрес, ПомещаемыйФайл, ДополнительныеПараметры) Экспорт
	Если Результат тогда
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		Строка64 = Base64Строка(ДД);
		СоответствиеMimeТипов = Новый Соответствие;
		СоответствиеMimeТипов.Вставить(".png", "image/png");
		СоответствиеMimeТипов.Вставить(".gif", "image/gif");
		СоответствиеMimeТипов.Вставить(".jpg", "image/jpeg");
		СоответствиеMimeТипов.Вставить(".jpeg", "image/jpeg");
		СоответствиеMimeТипов.Вставить(".svg", "image/svg+xml");
		
		Файл = Новый Файл(ПомещаемыйФайл);
		MIME_тип = СоответствиеMimeТипов.Получить(нрег(Файл.Расширение));
		ВыбранноеЗначение = СтрШаблон("data:%1;base64,%2", MIME_тип, Строка64);
		Элементы.ПолеHTMLДокумента.Документ.execCommand("insertImage", Ложь, ВыбранноеЗначение);
		ПоказатьРежимыКнопок();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура КомандаinsertHTML(Команда)
	ПараметрыФормы = Новый Структура("ИсточникВызова", Команда.Имя);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВставитьТаблицуЗавершение", ЭтотОбъект, ПараметрыФормы);
	ОткрытьФорму("ОбщаяФорма.CRM_РедакторHTMLСозданиеТаблицы", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТаблицуЗавершение(СтруктураВозврата, Команда) Экспорт
	Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	ЭтоТЧ = СтруктураВозврата.ЭтоТЧ;
	Колонки = СтруктураВозврата.Колонок;
	Строк = СтруктураВозврата.Строк;
	ШиринаКолонкиПикс = СтруктураВозврата.Ширина;
	ШиринаТаблицыПикс = ШиринаКолонкиПикс*Колонки;
	ШиринаВПикселях = ШиринаКолонкиПикс>0;
	БезРамки = СтруктураВозврата.БезРамки;
	
	Если ТипЗнч(Колонки)=Тип("Число") Тогда 
		Кнопка = Сред(Команда.ИсточникВызова, 8, 10);
		ШиринаКолонки = Цел(100/Колонки);
		ДопШиринаПоследней = 100 - ШиринаКолонки*Колонки;
		Если Элементы.ПолеHTMLДокумента.Документ.queryCommandSupported(Кнопка) Тогда
			Если ЭтоТЧ Тогда
				ТекстВставкиТаблицы = "<!--НачалоТаблицы-->
				|";
				ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<div><table border cellspacing=0 width="""+?(ШиринаВПикселях, Формат(ШиринаТаблицыПикс, "ЧГ=0")+"px", "100%")+""">
				|<tbody><tr width="""+?(ШиринаВПикселях, Формат(ШиринаТаблицыПикс, "ЧГ=0")+"px", "100%")+""">
				|";
				Для а = 1 По Колонки Цикл
					Если ШиринаВПикселях Тогда
						ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td style=""text-align: center;"" width="""+Формат(ШиринаКолонкиПикс, "ЧГ=0")+"px""><b>"+НСтр("ru='Заголовок колонки '")+а+"</b></td>
						|";
					Иначе
						ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td style=""text-align: center;"" width="""+?(а = Колонки, ШиринаКолонки + ДопШиринаПоследней, ШиринаКолонки)+"%""><b>"+НСтр("ru='Заголовок колонки '")+а+"</b></td>
						|";
					КонецЕсли;
				КонецЦикла;
				ТекстВставкиТаблицы = ТекстВставкиТаблицы + "</tr>
				|<!--НачалоСтроки-->
				|<tr width="""+?(ШиринаВПикселях, Формат(ШиринаТаблицыПикс, "ЧГ=0")+"px", "100%")+""">
				|";
				Для а = 1 По Колонки Цикл
					Если ШиринаВПикселях Тогда
						ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td width="""+Формат(ШиринаКолонкиПикс, "ЧГ=0")+"px""><"+НСтр("ru='автотекст колонки '")+а+"></td>
						|";
					Иначе
						ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td width="""+?(а = Колонки, ШиринаКолонки + ДопШиринаПоследней, ШиринаКолонки)+"%""><"+НСтр("ru='автотекст колонки '")+а+"></td>
						|";
					КонецЕсли;
				КонецЦикла;
				ТекстВставкиТаблицы = ТекстВставкиТаблицы + "</tr>
				|<!--ОкончаниеСтроки-->
				|</tbody></table></div>
				|<!--ОкончаниеТаблицы-->
				|<br>
				|<br>
				|";
			Иначе	
				ТекстВставкиТаблицы = "";
				ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<div><table border cellspacing=0 width="""+?(ШиринаВПикселях, Формат(ШиринаТаблицыПикс, "ЧГ=0")+"px", "100%")+""">
				|<tbody><tr width="""+?(ШиринаВПикселях, Формат(ШиринаТаблицыПикс, "ЧГ=0")+"px", "100%")+""">
				|";
				Для а = 1 По Колонки Цикл
					Если ШиринаВПикселях Тогда
						ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td width="""+Формат(ШиринаКолонкиПикс, "ЧГ=0")+"px"">&nbsp;</td>
						|";
					Иначе	
						ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td width="""+?(а = Колонки, ШиринаКолонки + ДопШиринаПоследней, ШиринаКолонки)+"%"">&nbsp;</td>
						|";
					КонецЕсли;
				КонецЦикла;
				ТекстВставкиТаблицы = ТекстВставкиТаблицы + "</tr>";
				Для Стр = 2 По Строк Цикл 
					ТекстВставкиТаблицы = ТекстВставкиТаблицы + "
					|<tr width="""+?(ШиринаВПикселях, Формат(ШиринаТаблицыПикс, "ЧГ=0")+"px", "100%")+""">
					|";
					Для а = 1 По Колонки Цикл
						Если ШиринаВПикселях Тогда
							ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td width="""+Формат(ШиринаКолонкиПикс, "ЧГ=0")+"px"">&nbsp;</td>
							|";
						Иначе	
							ТекстВставкиТаблицы = ТекстВставкиТаблицы + "<td width="""+?(а = Колонки, ШиринаКолонки + ДопШиринаПоследней, ШиринаКолонки)+"%"">&nbsp;</td>
							|";
						КонецЕсли;
					КонецЦикла;
					ТекстВставкиТаблицы = ТекстВставкиТаблицы + "</tr>";
				КонецЦикла;
				ТекстВставкиТаблицы = ТекстВставкиТаблицы + " 
				|</table>
				|<br>
				|<br>
				|";
			КонецЕсли;
			
			Если БезРамки Тогда
				ТекстВставкиТаблицы = СтрЗаменить(ТекстВставкиТаблицы, "border ", "");
			КонецЕсли;
			
			Элементы.ПолеHTMLДокумента.Документ.execCommand(Кнопка, Ложь, ТекстВставкиТаблицы);
		КонецЕсли;
	КонецЕсли;
	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
	ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
	ТекстHTML = "<html>
	|<head>
	|"+ТекстПроверкиТМПHead+"
	|</head>
	|<body>" + ТекстПроверкиТМПBody +"
	|</body>
	|<html>";
	ПараметрыОтправки = ПараметрыОтправкиПисьма(ТекстHTML);
	МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
	МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОСохранении(Ответ, ДопСвойства) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗакрытьПоOK("");
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда	
		НеПроверять = Истина;
		Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДопФорматирование(Команда)
	Элементы.ПоказатьДопФорматирование.Пометка = НЕ Элементы.ПоказатьДопФорматирование.Пометка;
	Элементы.ГруппаДополнительное.Видимость = Элементы.ПоказатьДопФорматирование.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьФормат(Команда)
	HTMLДокумент = Элементы.ПолеHTMLДокумента.Документ; 
	HTMLДокумент.execCommand("removeFormat", Ложь, "");
	ПоказатьРежимыКнопок();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяВременногоФайлаМакета(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьМакетНаСервере(ИмяОбъектаМетаданныхМакета)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		Возврат МодульУправлениеПечатью.МакетПечатнойФормы(ИмяОбъектаМетаданныхМакета);
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытииЗавершение()
	УникальныйИдентификаторХранилища = Новый УникальныйИдентификатор;
	Если ЭтоПечать Тогда
		#Если ВебКлиент Тогда
		ДанныеПоляHTMLДокумента = СтрЗаменить(ДанныеПоляHTMLДокумента, "box-shadow: 0 0 0.5cm rgba(0,0,0,0.5);", "");
		#КонецЕсли
		СтруктураКоманды = Новый Структура("Имя", "Просмотр");
		КоманднаяПанельРежим(СтруктураКоманды, Ложь);
	КонецЕсли;
	ВходящийТекст = ДанныеПоляHTMLДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаУдаленияФайлаМакета(ДополнительныеПараметры) Экспорт
	ПриОткрытииЗавершение();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиФайлаМакета(ДополнительныеПараметры) Экспорт
	Макет = Новый ТекстовыйДокумент;
	Макет.Прочитать(ДополнительныеПараметры.ИмяФайлаМакета); // АПК:566 - не верное определение синхронного вызова: "Прочитать".
	ДанныеПоляHTMLДокумента = Макет.ПолучитьТекст();
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаУдаленияФайлаМакета", ЭтотОбъект, ДополнительныеПараметры);
	НачатьУдалениеФайлов(ОписаниеОповещения, ДополнительныеПараметры.ИмяФайлаМакета);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТабличныйДокументИзМетаданных()
	Макет = ПолучитьМакетНаСервере(ИмяОбъектаМетаданныхМакета);
	Если Макет = Неопределено Тогда
		ПриОткрытииЗавершение();
	ИначеЕсли ТипЗнч(Макет) = Тип("ДвоичныеДанные") Тогда
		ИмяФайлаМакета = ПолучитьИмяВременногоФайлаМакета("html");
		ДополнительныеПараметры = Новый Структура("ИмяФайлаМакета", ИмяФайлаМакета);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗаписиФайлаМакета", ЭтотОбъект, ДополнительныеПараметры);
		Макет.НачатьЗапись(ОписаниеОповещения, ИмяФайлаМакета);
	Иначе	
		ДанныеПоляHTMLДокумента = Макет.ПолучитьТекст();
		ПриОткрытииЗавершение();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМакет(Макет)
	// +CRM
	ЗаписьНовая = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
	ЗаписьНовая.Объект		= ИмяВладельца;
	ЗаписьНовая.ИмяМакета	= ИмяМакета;
	ЗаписьНовая.Прочитать();
	Если НЕ ЗаписьНовая.Выбран() Тогда
		ЗаписьНовая = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
		ЗаписьНовая.Объект	  = ИмяВладельца;
		ЗаписьНовая.ИмяМакета = ИмяМакета;
	КонецЕсли;
	ЗаписьНовая.Использование	= Истина;
	ЗаписьНовая.Макет			= Новый ХранилищеЗначения(Макет, Новый СжатиеДанных(9));
	ЗаписьНовая.Записать(); // АПК:566 - не верное определение синхронного вызова: "Записать".
	// -CRM
КонецПроцедуры

&НаКлиенте
Функция HEX(Знач Значение, Разрядность = 2)
	Перем Результат;
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Значение % 16 + 1, 1) + Результат;
		Значение = Цел(Значение / 16);
	КонецЦикла;
	
	Результат = Прав("00000000" + Результат, Разрядность);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьДокумент(знач НомерВарианта = Неопределено)
	ДанныеОбъекта = CRM_ОбщегоНазначенияСервер.CRM_ПолучитьДанныеОбъекта(ОбъектСсылка, НомерВарианта);
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		Макет = МодульУправлениеПечатью.МакетПечатнойФормы(ИмяОбъектаМетаданныхМакета);
		Если ТипЗнч(Макет) = Тип("ДвоичныеДанные") Тогда
			ИмяФайлаМакета = ПолучитьИмяВременногоФайла("html");
			Макет.Записать(ИмяФайлаМакета);
			Макет = Новый ТекстовыйДокумент;
			Макет.Прочитать(ИмяФайлаМакета);
			ДанныеПоляHTMLДокумента = Макет.ПолучитьТекст();
			УдалитьФайлы(ИмяФайлаМакета);
		Иначе	
			ДанныеПоляHTMLДокумента = Макет.ПолучитьТекст();
		КонецЕсли;	
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из ДанныеОбъекта Цикл
		ДанныеПоляHTMLДокумента = СтрЗаменить(ДанныеПоляHTMLДокумента,"%"+ЭлементСтруктуры.Ключ+"%", ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	ПозНачалаТаб = СтрНайти(ДанныеПоляHTMLДокумента, "<!--НачалоТаблицы-->")+20;
	
	Пока ПозНачалаТаб>0 Цикл
		ПозКонцаТаб = СтрНайти(ДанныеПоляHTMLДокумента, "<!--ОкончаниеТаблицы-->",, ПозНачалаТаб);
		ТекстТаблицы = Сред(ДанныеПоляHTMLДокумента, ПозНачалаТаб, ПозКонцаТаб - ПозНачалаТаб);	
		
		ПозНачала = СтрНайти(ТекстТаблицы, "<!--НачалоСтроки-->")+19;
		ПозКонца = СтрНайти(ТекстТаблицы, "<!--ОкончаниеСтроки-->");
		ТекстТаблицыСтрок = Сред(ТекстТаблицы, ПозНачала, ПозКонца - ПозНачала);
		
		ТекстНДС = ?(ОбъектСсылка.ЦенаВключаетНДС, НСтр("ru='в том числе НДС:';en='Including VAT:'"), НСтр("ru='Сумма НДС:'"));
		
		СформированныйТекст = "";
			
		Для Каждого ВариантКП ИЗ ДанныеОбъекта["Варианты"] Цикл
			
			Если НомерВарианта = -1 Тогда
				СформированныйТекст = СформированныйТекст +"<div style=""text-align: justify;"">"+ВариантКП.СтрокаВарианта+"</div>
				|";
			КонецЕсли;
			СформированныйТекстТаблицы = "";
			Для Каждого Строка Из ВариантКП.Товары Цикл
				Если Строка["ТипСтроки"] <> "Номенклатура" Тогда
					ЭтоТовар = Ложь;
				Иначе
					ЭтоТовар = Истина;
				КонецЕсли;	
				ТекстТаблицыСтрокТМП = ТекстТаблицыСтрок;
				Для Каждого ЭлементыСтроки Из Строка Цикл 
					ТекстТаблицыСтрокТМП = СтрЗаменить(ТекстТаблицыСтрокТМП,"%"+ЭлементыСтроки.Ключ+"%", ?(ЭтоТовар, "", "<b>")+ЭлементыСтроки.Значение+?(ЭтоТовар, "", "</b>"));
				КонецЦикла;
				СформированныйТекстТаблицы = СформированныйТекстТаблицы + ТекстТаблицыСтрокТМП
			КонецЦикла;	
			
			СтрокаДляВывода = "Общая стоимость составляет "+ВариантКП.Всего+" ("+ВариантКП.СтоимостьПропись+"); "+ВариантКП.СтрокаНДС+" "+ВариантКП.ВсегоНДС; 
			
			СформированныйТекст = СформированныйТекст + СтрЗаменить(ТекстТаблицы,ТекстТаблицыСтрок, СформированныйТекстТаблицы)+"
			|<br>
			|";
			СформированныйТекст = СтрЗаменить(СформированныйТекст, "%СтоимостьПрописьИтог%", СтрокаДляВывода);
			
		КонецЦикла;	
		ДанныеПоляHTMLДокумента = СтрЗаменить(ДанныеПоляHTMLДокумента,ТекстТаблицы, СформированныйТекст);
		ДанныеПоляHTMLДокумента = СтрЗаменить(ДанныеПоляHTMLДокумента,"%СтоимостьПрописьИтог%", СтрокаДляВывода);

		ПозНачалаТаб = СтрНайти(ДанныеПоляHTMLДокумента, "<!--НачалоТаблицы-->", , ПозНачалаТаб+20);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПараметрыОтправкиПисьма(ТекстHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку(ТекстHTML);
	СписокВложений = ПоместитьДокументыВоВременноеХранилище(ТекстовыйДокумент);
	
	// Контроль уникальности имен.
	ШаблонИмениФайла = "%1%2.%3";
	ИспользованныеИменаФайлов = Новый Соответствие;
	Для Каждого Вложение Из СписокВложений Цикл
		ИмяФайла = Вложение.Представление;
		НомерИспользования = ?(ИспользованныеИменаФайлов[ИмяФайла] <> Неопределено,
		ИспользованныеИменаФайлов[ИмяФайла] + 1, 1);
		ИспользованныеИменаФайлов.Вставить(ИмяФайла, НомерИспользования);
		Если НомерИспользования > 1 Тогда
			Файл = Новый Файл(ИмяФайла);
			ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла,
			Файл.ИмяБезРасширения, " (" + НомерИспользования + ")", Файл.Расширение);
		КонецЕсли;
		Вложение.Представление = ИмяФайла;
	КонецЦикла;
	
	Получатели = Неопределено;
	
	Результат = Новый Структура;
	Результат.Вставить("Получатель", Получатели);
	Результат.Вставить("Тема", ПараметрыВывода.ПараметрыОтправки.Тема);
	Результат.Вставить("Текст", ПараметрыВывода.ПараметрыОтправки.Текст);
	Результат.Вставить("Вложения", СписокВложений);
	Результат.Вставить("УдалятьФайлыПослеОтправки", Истина);
	
	ПечатныеФормы = Новый ТаблицаЗначений;
	ПечатныеФормы.Колонки.Добавить("Название");
	ПечатныеФормы.Колонки.Добавить("ТабличныйДокумент");
	
	ОписаниеПечатнойФормы = ПечатныеФормы.Добавить();
	Если Найти(ИмяОбъектаМетаданныхМакета, "Договор") = 0 Тогда
		ОписаниеПечатнойФормы.Название = "Коммерческое предложение";
	Иначе
		ОписаниеПечатнойФормы.Название = "Договор";
	КонецЕсли;	
	ОписаниеПечатнойФормы.ТабличныйДокумент = ТекстовыйДокумент;
	
	СписокОбъектов = Новый Массив;
	СписокОбъектов.Добавить(ОбъектСсылка);
	
	УправлениеПечатьюПереопределяемый.ПередОтправкойПоПочте(Результат, ПараметрыВывода, СписокОбъектов, ПечатныеФормы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПоместитьДокументыВоВременноеХранилище(ТекстовыйДокумент)
	Перем ЗаписьZipФайла, ИмяАрхива;
	
	Результат = Новый Массив;
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	ПереводитьИменаФайловВТранслит = Истина;
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
	ОбъектПечати = ОбъектСсылка;
	ПечатнаяФорма = ТекстовыйДокумент;
	
	ЗаданныеИменаПечатныхФорм = Неопределено;
	Если Найти(ИмяОбъектаМетаданныхМакета, "Договор") = 0 Тогда
		Название = "Коммерческое предложение";
	Иначе
		Название = "Договор";
	КонецЕсли;
	ИмяФайла = УправлениеПечатью.ИмяФайлаПечатнойФормыОбъекта(ОбъектПечати, ЗаданныеИменаПечатныхФорм, Название);
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
	Если ПереводитьИменаФайловВТранслит Тогда
		ИмяФайла = СтроковыеФункции.СтрокаЛатиницей(ИмяФайла);
	КонецЕсли;
	ИмяФайла = ИмяФайла + ".HTML";
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла);
	
	ПечатнаяФорма.Записать(ПолноеИмяФайла);
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторХранилища);
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Представление", ИмяФайла);
	ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
	Результат.Добавить(ОписаниеФайла);
	УдалитьФайлы(ИмяВременнойПапки);
	Если ЗначениеЗаполнено(ИмяАрхива) Тогда
		УдалитьФайлы(ИмяАрхива);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции

&НаКлиенте
Процедура ПосмотретьФорму(Команда)
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		ОткрытьМакетВебКлиент();
	#Иначе
		ОткрытьМакетТонкийКлиент();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетТонкийКлиент()
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеКаталогаЗавершение", ЭтотОбъект);
		НачатьПолучениеКаталогаВременныхФайлов(ОписаниеОповещения);	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетВебКлиент()
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьМакетаПродолжение", ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетаПродолжение(Подключено, ДополнительныеПараметры) Экспорт
	Если Подключено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеКаталогаЗавершение", ЭтотОбъект);
		НачатьПолучениеКаталогаВременныхФайлов(ОписаниеОповещения);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановкуРасширенияПродолжение", ЭтотОбъект);
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
		
	КонецЕсли;
КонецПроцедуры // ПутьКФайлуМакетаНачалоВыбора()

&НаКлиенте
Процедура ПолучениеКаталогаЗавершение(Путь, ДопПараметры) Экспорт
	Каталог = Путь;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".html";
	ПутьКФайлуМакета = Каталог + "\" + ИмяФайла;
	ПараметрЗакрытия = "";
	ТекстПроверкиТМПBody =Элементы.ПолеHTMLДокумента.Документ.Body.innerHTML;
	ТекстПроверкиТМПHead =Элементы.ПолеHTMLДокумента.Документ.Head.innerHTML;
	ТекстПроверки = "<html>
	|<head>
	|"+ТекстПроверкиТМПHead+"
	|</head>
	|<body>" + ТекстПроверкиТМПBody +"
	|</body>
	|<html>";
	КолСтрок = СтрЧислоСтрок(ТекстПроверки);
	Для а = 1 По КолСтрок Цикл
		Стр = СтрПолучитьСтроку(ТекстПроверки, а);
		Если НЕ ПустаяСтрока(Стр) И Найти(СокрЛП(Стр),"<base href=""") = 0 Тогда
			ПараметрЗакрытия = ПараметрЗакрытия + Стр+"
			|";
		КонецЕсли;	
	КонецЦикла;
	Макет = Новый ТекстовыйДокумент;
	Макет.ДобавитьСтроку(ПараметрЗакрытия);	
	Макет.Записать(ПутьКФайлуМакета);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикОповещенияБезДействия", CRM_ОбщегоНазначенияКлиент);	
	НачатьЗапускПриложения(ОписаниеОповещения, ПутьКФайлуМакета,, Ложь);
КонецПроцедуры // ПутьКФайлуМакетаНачалоВыбора(

&НаКлиенте
Процедура УстановкуРасширенияПродолжение(Подключено) Экспорт
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьМакетаПродолжение", ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры // ПутьКФайлуМакетаНачалоВыбора(

&НаСервере
Функция ПолучитьПараметрыОткрытияДляМессенджера()
	ПараметрыДиалога = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "КонтактноеЛицо")
			И ЗначениеЗаполнено(ОбъектСсылка["КонтактноеЛицо"]) Тогда
		ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка["КонтактноеЛицо"]);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "Партнер")
			И ЗначениеЗаполнено(ОбъектСсылка["Партнер"]) Тогда
		ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка["Партнер"]);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "Клиент")
			И ЗначениеЗаполнено(ОбъектСсылка["Клиент"]) Тогда
		ПараметрыДиалога.Вставить("ПараметрОткрытия", ОбъектСсылка["Клиент"]);
	КонецЕсли;
	ПараметрыДиалога.Вставить("ПутьКФайлуМакета", ПутьКФайлуМакета);
    Возврат ПараметрыДиалога;
КонецФункции	

#КонецОбласти
