
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И (ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")) 
		И Параметры.ЗначенияЗаполнения.Свойство("ВидДела") Тогда
		Объект.ВидДела = Параметры.ЗначенияЗаполнения.ВидДела;
	КонецЕсли;
	ВидДелаИнтерес = (Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес"));
	Элементы.СостояниеИнтереса.Доступность = ВидДелаИнтерес;
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ВидДелаИнтерес;
	Элементы.ГруппаСрок.Видимость = ВидДелаИнтерес;
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ЗначениеЗаполнено(Объект.СостояниеИнтереса);
	Элементы.ГруппаПланированиеВстреч.Доступность = (Объект.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы);
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ВидДелаПриИзменении(Элемент)
	Элементы.СостояниеИнтереса.Доступность = Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес");
	Элементы.ГруппаПланированиеВстреч.Доступность =  (Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.ПрочиеДокументы"));
КонецПроцедуры

&НаКлиенте
Процедура СостояниеИнтересаПриИзменении(Элемент)
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ЗначениеЗаполнено(Объект.СостояниеИнтереса);
КонецПроцедуры

&НаСервере
Процедура ВидСобытияПриИзмененииНаСервере()
	//Если Объект.ВидСобытия = Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда
	//	Элементы.ГруппаПланированиеВстреч.Видимость = Истина;
	//Иначе	
	//	Элементы.ГруппаПланированиеВстреч.Видимость = Ложь;
	//	Объект.ДлительностьВстречиПоУмолчанию = 0;
	//	Объект.ПланироватьвЖурналеВстреч = Ложь;
	//КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	ВидСобытияПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
