
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомпановщикНастроекУсловий.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.Параметры.АдресСхемыКомпоновкиДанных));
	НастройкиСКД = ЭтаФорма.Параметры.НастройкиСКД;
	КомпановщикНастроекУсловий.ЗагрузитьНастройки(НастройкиСКД);
	КомпановщикНастроекУсловий.Восстановить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	ЭтаФорма.Закрыть(КомпановщикНастроекУсловий.Настройки)
КонецПроцедуры

#КонецОбласти

