
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьЭлементыНаФорму();
	НомерТекущейСтраницы = 1;
	ОткрытьПослеСоздания = Истина;
		
	//++ #1376 смарт: Фролов 06.09.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
	//ЗаполнитьСтоимостьИзПредопределенныхНастроек(); 
	ЕстьПолныеПрава = УправлениеДоступом.ЕстьРоль("ПолныеПрава");
	Если НЕ (УправлениеДоступом.ЕстьРоль("смартIECHOЗакупщикКомплектующих")
		ИЛИ ЕстьПолныеПрава ИЛИ УправлениеДоступом.ЕстьРоль("смартIECHOАдминистрирование")) Тогда
		Элементы.ГруппаСтоимость.Видимость=Ложь;
	КонецЕсли;	
	//-- #1376 смарт: Фролов 06.09.2023 
	
	//++ #Б-5346 смарт: Фролов 30.12.2025 //Доработка Конструктора IECHO
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартiECHOЗаполнениеСтоимости
	|ГДЕ
	|	СхемаПоУмолчанию");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЭтаФорма.СхемаЗаполненияСтоимости = Выборка.Ссылка;
		
	КонецЕсли;
	//-- #Б-5346 смарт: Фролов 30.12.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "смартIECHOКомплектующие_Запись" Тогда
		ОбновитьСписокДоступныхКомплектующих(Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

// ++ 02.02.2021
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

// ++ 02.02.2021
&НаКлиенте
Процедура МаржаПриИзменении(Элемент)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;

КонецПроцедуры


//&НаКлиенте
//Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	ОбновитьСписокЗапчастей();
//КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если НЕ ЗначениеЗаполнено(СхемаЗаполненияСтоимости) ТОгда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите схему заполнения стоимости.'"),, "СхемаЗаполненияСтоимости" );
	Иначе
		ВыполнитьПереходПоСтраницам(Неопределено, Команда);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ВыполнитьПереходПоСтраницам(Неопределено, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходПоСтраницам(Знач Оповещение, Команда)
	
	Отказ = УсловияПереходаПоСтраницамНеВыполнены(Команда);
	
	Если Не Отказ Тогда
		ВыполнитьНеобходимыеДействияПриПереходеПоСтраницам(Новый ОписаниеОповещения("ВыполнитьПереходПоСтраницамЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), Команда);
		Возврат;
	КонецЕсли;
	
	ВыполнитьПереходПоСтраницамФрагмент(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходПоСтраницамЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ;
    
    ВыполнитьПереходПоСтраницамФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходПоСтраницамФрагмент(Знач Оповещение)
	
	УправлениеСтраницамиПодвал();
	
	ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура УправлениеСтраницамиПодвал()
	
	ПредыдущаяСтраницаПодвал = Элементы.СтраницыПодвал.ТекущаяСтраница;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница_1"] Тогда
		Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.СтраницаКнопкиДалее;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.СтраницаКнопкиСоздать;
	Иначе
		Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.СтраницаКнопкиНазадДалее;
	КонецЕсли;
	
	Если ПредыдущаяСтраницаПодвал <> Элементы.СтраницыПодвал.ТекущаяСтраница Тогда
		Если Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.СтраницаКнопкиДалее Тогда
			Элементы.Далее.КнопкаПоУмолчанию = Истина;
		ИначеЕсли Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.СтраницаКнопкиСоздать Тогда
			Элементы.Далее2.КнопкаПоУмолчанию = Истина;
		ИначеЕсли Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.СтраницаКнопкиНазадДалее Тогда
			Элементы.Далее3.КнопкаПоУмолчанию = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция УсловияПереходаПоСтраницамНеВыполнены(Команда)
	
	Отказ = Ложь;
	//Если Команда.Имя = "Далее" Тогда
	//	Если Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаПервичнаяИнформация Тогда
	//		Отказ = ПервичнаяИнформацияЗаполненаНеправильно();
	//	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДополнительныеСведения Тогда
	//		Отказ = ДополнительныеСведенияЗаполненыНеправильно();
	//	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДополнительныеРеквизиты Тогда
	//		Отказ = ДополнительныеРеквизитыЗаполненыНеправильно();
	//	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаГоловнойКонтрагент Тогда
	//		Отказ = СведенияГоловногоКонтрагентаЗаполненыНеправильно();
	//	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаРасчетныйСчет Тогда
	//		Отказ = РасчетныйСчетЗаполненНеправильно();
	//	ИначеЕсли Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаРасчетныйСчетГоловногоКонтрагента Тогда
	//		Отказ = РасчетныйСчетГоловногоКонтрагентаЗаполненНеправильно();
	//	КонецЕсли;
	//КонецЕсли;
	//
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьНеобходимыеДействияПриПереходеПоСтраницам(Знач Оповещение, Команда)
	
	Если Команда.Имя = "Далее" Тогда 
		//++ #1487 смарт: Фролов 09.10.2023 //Изменения консруктора iECHO
		//++ #Б4216 смарт: Шляпников 12.09.2025 / Корректировка Конструктора IECHO.
		//Если СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Заголовок,"70 Опции","")<> Элементы.ГруппаСтраницы.ТекущаяСтраница.Заголовок 
		//	И ЭтаФорма["ТЗ_3"].Итог("Количество")=0 Тогда
		//	НомерТекущейСтраницы=22;		
		//КонецЕсли;
		//-- #Б4216 смарт: Шляпников 12.09.2025
		//-- #1487 смарт: Фролов 09.10.2023
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница <> Элементы.СтраницаФинальная Тогда
			
			ВсегоЭлементов = КоличествоСтраниц;
			
			Если НомерТекущейСтраницы = ВсегоЭлементов Тогда
				ПерейтиНаФинальнуюСтраницу();
				НомерТекущейСтраницы = НомерТекущейСтраницы + 1;
			Иначе
				//++ #1487 смарт: Фролов 11.10.2023 //Изменения консруктора iECHO
				ПроверкаСледующейСтраницы=НомерТекущейСтраницы+1;
				Пока ЭтаФорма["ТЗ_"+ПроверкаСледующейСтраницы].Количество()=0 Цикл
					ПроверкаСледующейСтраницы=ПроверкаСледующейСтраницы+1;
				КонецЦикла;
				НомерТекущейСтраницы=ПроверкаСледующейСтраницы-1; 
				//-- #1487 смарт: Фролов 11.10.2023
				НомерСледующейСтраницы = НомерТекущейСтраницы + 1;
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница_" + НомерСледующейСтраницы];
				НомерТекущейСтраницы = НомерСледующейСтраницы;
			КонецЕсли;
			
			//ОбновитьСписокЗапчастей();
			
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
			
			ДокументСсылка = СоздатьДокументСпецификация();
			
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				
				Если ОткрытьПослеСоздания Тогда
					ПоказатьЗначение(, ДокументСсылка);
				КонецЕсли;
				
				ЭтаФорма.Закрыть();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		//++ #1487 смарт: Фролов 09.10.2023 //Изменения консруктора iECHO
		//++ #Б4216 смарт: Шляпников 12.09.2025 / Корректировка Конструктора IECHO.
		//Если СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Заголовок,"90 SOFTWARE","")<> Элементы.ГруппаСтраницы.ТекущаяСтраница.Заголовок 
		//	И ЭтаФорма["ТЗ_3"].Итог("Количество")=0 Тогда
		//	НомерТекущейСтраницы=11;		
		//КонецЕсли; 
		//-- #Б4216 смарт: Шляпников 12.09.2025
		ПроверкаСледующейСтраницы=НомерТекущейСтраницы-1;
		Пока ЭтаФорма["ТЗ_"+ПроверкаСледующейСтраницы].Количество()=0 Цикл
			ПроверкаСледующейСтраницы=ПроверкаСледующейСтраницы-1;
		КонецЦикла;
		НомерТекущейСтраницы=ПроверкаСледующейСтраницы+1; 
		//-- #1487 смарт: Фролов 09.10.2023
		Если НомерТекущейСтраницы <> 1 Тогда
			НомерПредыдущейСтраницы = НомерТекущейСтраницы - 1;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница_" + НомерПредыдущейСтраницы];
			НомерТекущейСтраницы = НомерПредыдущейСтраницы;
			//ОбновитьСписокЗапчастей();
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьНеобходимыеДействияПриПереходеПоСтраницамФрагмент(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНеобходимыеДействияПриПереходеПоСтраницамФрагмент(Знач Оповещение)
	
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

// ++ 03.02.2021
&НаКлиенте
Процедура СтоимостьДоставкиДоГраницыРФПриИзменении(Элемент)
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИмяЭлемента", "СтоимостьДоставкиДоГраницыРФ");
	//Оповещение = Новый ОписаниеОповещения("ВопросПередИзменениемСтоимостиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//ТекстВопроса = НСтр("ru = 'Изменить стоимость в предопределенных настройках?'");
	//ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

// ++ 03.02.2021
&НаКлиенте
Процедура СтоимостьТаможенногоОформленияПриИзменении(Элемент)
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИмяЭлемента", "СтоимостьТаможенногоОформления");
	//Оповещение = Новый ОписаниеОповещения("ВопросПередИзменениемСтоимостиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//ТекстВопроса = НСтр("ru = 'Изменить стоимость в предопределенных настройках?'");
	//ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

// ++ 03.02.2021
&НаКлиенте
Процедура СтоимостьДоставкиПоРФПриИзменении(Элемент)
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИмяЭлемента", "СтоимостьДоставкиПоРФ");
	//Оповещение = Новый ОписаниеОповещения("ВопросПередИзменениемСтоимостиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//ТекстВопроса = НСтр("ru = 'Изменить стоимость в предопределенных настройках?'");
	//ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

// ++ 03.02.2021
&НаКлиенте
Процедура ВопросПередИзменениемСтоимостиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	//Если Ответ = КодВозвратаДиалога.Да Тогда			
	//	ИзменитьПредопределеннуюНастройку(ДополнительныеПараметры.ИмяЭлемента);				
	//КонецЕсли;
	//
	//Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
	//	// Обновить итоговое поле
	//	ЗаполнитьИтоговуюИнформацию();
	//КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////

//// ++ 03.02.2021
//&НаСервере
//Процедура ИзменитьПредопределеннуюНастройку(ИмяЭлемента)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	СправочникСсылка = Справочники.смартПредопределенныеЗначения[ИмяЭлемента];
//	
//	Если СправочникСсылка.Значение <> ЭтаФорма[ИмяЭлемента] Тогда		
//		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
//		СправочникОбъект.Значение = ЭтаФорма[ИмяЭлемента];
//		СправочникОбъект.Записать();
//	КонецЕсли;
//	
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	
//КонецПроцедуры

//++ #Б-3928 смарт: Лопато 28.07.2025 //Доработка конструктора IECHO. Уточнение наценки по моделям.  
&НаКлиенте
Процедура ЗаполнитьСтоимостьИзПредопределенныхНастроек()
	
    ЗаполнитьСтоимостьИзПредопределенныхНастроекСервер();
	
	ПолучитьМаржуПоМоделиКомплектующейКлиент();
	
КонецПроцедуры //-- #Б-3928 смарт: Лопато 28.07.2025

//++ #Б-3928 смарт: Лопато 28.07.2025 //Доработка конструктора IECHO. Уточнение наценки по моделям.  
&НаКлиенте
Процедура ПолучитьМаржуПоМоделиКомплектующейКлиент()

	МодельОсновнойКомплектующей = Неопределено;
	
	Если ВыбранныеОсновныеКомплектующие.Количество() > 0 Тогда
		
		Для Каждого ЭлементСпискаОсновнаяКомплектующая Из ВыбранныеОсновныеКомплектующие Цикл
			
			ПолучитьМаржуПоМоделиКомплектующейСервер(Маржа, ЭтаФорма.СхемаЗаполненияСтоимости, ЭлементСпискаОсновнаяКомплектующая.Значение);

		КонецЦикла;
		
	Иначе
		
		ИмяТЧ = ПолучитьИмяТекущейТЧ();
		
		Если ИмяТЧ = "ТЗ_1" Тогда

			ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
			
			Если ТекущиеДанные <> Неопределено Тогда
				
				ПолучитьМаржуПоМоделиКомплектующейСервер(Маржа, ЭтаФорма.СхемаЗаполненияСтоимости, ТекущиеДанные.Наименование);

			КонецЕсли;				
				
		КонецЕсли;

	КонецЕсли;	

КонецПроцедуры //-- #Б-3928 смарт: Лопато 28.07.2025

//++ #Б-3928 смарт: Лопато 28.07.2025 //Доработка конструктора IECHO. Уточнение наценки по моделям.  
&НаСервере
Процедура ПолучитьМаржуПоМоделиКомплектующейСервер(Маржа, Знач Схема, Знач Комплектующая)

	Если ЗначениеЗаполнено(Схема)
		И ЗначениеЗаполнено(Комплектующая) Тогда
		
		МодельКомплектующей = Комплектующая.Model;
			
		Если ЗначениеЗаполнено(МодельКомплектующей) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Маржа КАК Маржа
			|ИЗ
			|	Справочник.смартiECHOЗаполнениеСтоимости.НаценкаПоМоделям
			|ГДЕ
			|	Ссылка = &Схема
			|	И Модель = &Модель";
			
			Запрос.УстановитьПараметр("Схема", Схема);
			Запрос.УстановитьПараметр("Модель", МодельКомплектующей);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				Маржа = ВыборкаДетальныеЗаписи.Маржа;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
			
КонецПроцедуры //-- #Б-3928 смарт: Лопато 28.07.2025

// ++ 03.02.2021
&НаСервере
//++ #Б-3928 смарт: Лопато 28.07.2025 //Доработка конструктора IECHO. Уточнение наценки по моделям.  
Процедура ЗаполнитьСтоимостьИзПредопределенныхНастроекСервер()
//-- #Б-3928 смарт: Лопато 28.07.2025

	//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
	//СтоимостьДоставкиДоГраницыРФПредопределенное 	= Справочники.смартПредопределенныеЗначения.СтоимостьДоставкиДоГраницыРФ;
	//СтоимостьТаможенногоОформленияПредопределенное 	= Справочники.смартПредопределенныеЗначения.СтоимостьТаможенногоОформления;
	//СтоимостьДоставкиПоРФПредопределенное 			= Справочники.смартПредопределенныеЗначения.СтоимостьДоставкиПоРФ;
	//	
	//СтоимостьДоставкиДоГраницыРФ 	= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СтоимостьДоставкиДоГраницыРФПредопределенное, Ложь);
	//СтоимостьТаможенногоОформления 	= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СтоимостьТаможенногоОформленияПредопределенное, Ложь);
	//СтоимостьДоставкиПоРФ 			= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СтоимостьДоставкиПоРФПредопределенное, Ложь);
	//
	//// ++ 22.04.2021
	//Настройка = Справочники.смартПредопределенныеЗначения.Маржа;
	//Маржа = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
	//
	//Настройка = Справочники.смартПредопределенныеЗначения.КоличествоДнейДействияКП;
	//КоличествоДней = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
	//Если ЗначениеЗаполнено(КоличествоДней) И ТипЗнч(КоличествоДней) = Тип("Число") Тогда			
	//	ДатаДействияКП = ТекущаяДата() + КоличествоДней * 86400;
	//КонецЕсли;		
	//
	//Настройка = Справочники.смартПредопределенныеЗначения.СрокПоставкиДней;
	//КоличествоДней = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
	//СрокПоставкиДней = КоличествоДней;
	// --   
	
	СтоимостьДоставкиДоГраницыРФ 	= ЭтаФорма.СхемаЗаполненияСтоимости.СтоимостьДоставкиДоГраницыРФ;
	СтоимостьТаможенногоОформления 	= ЭтаФорма.СхемаЗаполненияСтоимости.СтоимостьТаможенногоОформления;
	СтоимостьДоставкиПоРФ 			= ЭтаФорма.СхемаЗаполненияСтоимости.СтоимостьДоставкиПоРФ;
	СтоимостьДоставкиЖДТранспортом  = ЭтаФорма.СхемаЗаполненияСтоимости.СтоимостьДоставкиЖДТранспортом;
	СтоимостьДоставкиАМТранспортом  = ЭтаФорма.СхемаЗаполненияСтоимости.СтоимостьДоставкиАМТранспортом;
	
	СтавкаНДС                       = ЭтаФорма.СхемаЗаполненияСтоимости.СтавкаНДС;
	
	ВалютаУчета                     = ЭтаФорма.СхемаЗаполненияСтоимости.ВалютаУчета;
	
	Маржа = ЭтаФорма.СхемаЗаполненияСтоимости.Маржа;
	
	КоличествоДней = ЭтаФорма.СхемаЗаполненияСтоимости.КоличествоДнейДействияКП;
	Если ЗначениеЗаполнено(КоличествоДней) И ТипЗнч(КоличествоДней) = Тип("Число") Тогда			
		ДатаДействияКП = ТекущаяДата() + КоличествоДней * 86400;
	КонецЕсли;		
	
	КоличествоДней = ЭтаФорма.СхемаЗаполненияСтоимости.СрокПоставкиДней;
	СрокПоставкиДней = КоличествоДней;
	//-- #1376 смарт: Фролов 18.06.2023
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыНаФорму()
	
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ДобавленныеСтраницы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартIECHOКомплектующие.Ссылка КАК Ссылка,
	|	смартIECHOКомплектующие.Наименование КАК Наименование,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ смартIECHOКомплектующиеДетальныеЗаписи.Ссылка) КАК КоличествоПодчиненных
	////++ смарт: Белоусова 621 03.09.21
	//|	смартIECHOКомплектующие.Порядок КАК Порядок
	////-- смарт: Белоусова 621 03.09.21
	|ИЗ
	|	Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующиеРодитель
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующиеРодительРодитель
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующиеРодительРодительРодитель
	|				ПО смартIECHOКомплектующиеРодительРодитель.Родитель = смартIECHOКомплектующиеРодительРодительРодитель.Ссылка
	|			ПО смартIECHOКомплектующиеРодитель.Родитель = смартIECHOКомплектующиеРодительРодитель.Ссылка
	|		ПО смартIECHOКомплектующие.Родитель = смартIECHOКомплектующиеРодитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующиеДетальныеЗаписи
	|		ПО смартIECHOКомплектующие.Ссылка = смартIECHOКомплектующиеДетальныеЗаписи.Родитель
	|			И (НЕ смартIECHOКомплектующиеДетальныеЗаписи.ЭтоГруппа)
	|ГДЕ
	|	НЕ смартIECHOКомплектующие.ПометкаУдаления
	|	И смартIECHOКомплектующие.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	смартIECHOКомплектующие.Ссылка,
	|	смартIECHOКомплектующие.Наименование,
	|	смартIECHOКомплектующиеРодитель.Наименование,
	|	смартIECHOКомплектующиеРодительРодитель.Наименование,
	|	смартIECHOКомплектующиеРодительРодительРодитель.Наименование
	////++ смарт: Белоусова 621 03.09.21
	//|	смартIECHOКомплектующие.Порядок
	////-- смарт: Белоусова 621 03.09.21
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ смартIECHOКомплектующиеДетальныеЗаписи.Ссылка) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	////++ смарт: Белоусова 621 03.09.21
	//|	Порядок,
	////-- смарт: Белоусова 621 03.09.21
	//++ #1361 смарт: Фролов 29.05.2023 //Изменения в модуле iECHO  
	//|	ВЫБОР
	//|		КОГДА смартIECHOКомплектующиеРодитель.Наименование ЕСТЬ NULL
	//|			ТОГДА 1
	//|		КОГДА смартIECHOКомплектующиеРодительРодитель.Наименование ЕСТЬ NULL
	//|			ТОГДА 2
	//|		КОГДА смартIECHOКомплектующиеРодительРодительРодитель.Наименование ЕСТЬ NULL
	//|			ТОГДА 3
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	смартIECHOКомплектующие.Наименование";
	|	смартIECHOКомплектующие.Наименование ИЕРАРХИЯ";
	//-- #1361 смарт: Фролов 29.05.2023
	
	ВыборкаГруппы = Запрос.Выполнить().Выбрать();
	
	МассивДобавляемыхРеквизитов = Новый Массив;
		
	Сч = 0;
	
	Пока ВыборкаГруппы.Следующий() Цикл
		
		Сч = Сч + 1;
		
		ИмяРеквизита = "ТЗ_" + Сч;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ТаблицаЗначений")));
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Наименование", Новый ОписаниеТипов("СправочникСсылка.смартIECHOКомплектующие"), ИмяРеквизита, "Наименование"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество", Новый ОписаниеТипов("Число", ,, Новый КвалификаторыЧисла(15,2)), ИмяРеквизита, "Количество"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Цена", Новый ОписаниеТипов("Число", ,, Новый КвалификаторыЧисла(15,2)), ИмяРеквизита, "Цена"));		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Подитог", Новый ОписаниеТипов("Число", ,, Новый КвалификаторыЧисла(15,2)), ИмяРеквизита, "Подитог"));		
		
		НоваяСтрока = ДобавленныеСтраницы.Добавить();
		НоваяСтрока.ГруппаСправочника = ВыборкаГруппы.Ссылка;
		// ++ 01.02.2021
		//НоваяСтрока.Наименование = ВыборкаГруппы.Наименование;
		НоваяСтрока.Наименование = ПолучитьПолныйПутьРекурсивно(ВыборкаГруппы.Ссылка, ВыборкаГруппы.Наименование);
		// --
		НоваяСтрока.Номер = Сч;
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	Для Сч1 = 1 По Сч Цикл
		
		ИмяРеквизита = "ТЗ_" + Сч1;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номер", Сч1);
		НайденныеСтроки = ДобавленныеСтраницы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Наименование = НайденныеСтроки[0].Наименование;

		ЭлементСтраница = ДобавитьСтраницуНаФорму("Страница_" + Сч1, Наименование);
		
		ВывестиТаблицуНаФорму(ЭтаФорма, ИмяРеквизита, ЭлементСтраница, Наименование);
		
	КонецЦикла;
	
	КоличествоСтраниц = Сч;
	
	ЗаполнитьТаблицыКомплектующих();
				
КонецПроцедуры

// ++ 01.02.2021
&НаСервереБезКонтекста
Функция ПолучитьПолныйПутьРекурсивно(ГруппаСправочника, знач ИтоговоеНаименование)
	
	Если ЗначениеЗаполнено(ГруппаСправочника.Родитель) Тогда
		ИтоговоеНаименование = "" + ГруппаСправочника.Родитель + " - " + ИтоговоеНаименование;
		Возврат ПолучитьПолныйПутьРекурсивно(ГруппаСправочника.Родитель, ИтоговоеНаименование);
	Иначе
		Возврат ИтоговоеНаименование;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицыКомплектующих(ПервоначальноеЗаполнение = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартIECHOКомплектующие.Родитель КАК Родитель,
	|	смартIECHOКомплектующие.Ссылка КАК Ссылка,
	|	смартIECHOКомплектующие.Цена КАК Цена
	//++ смарт:ММ 621 30.09.2021 
	////++ смарт: Белоусова 621 03.09.21
	//|	смартIECHOКомплектующие.Порядок КАК Порядок
	////-- смарт: Белоусова 621 03.09.21
	//-- смарт:ММ 30.09.2021
	|ИЗ
	|	Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующие
	|ГДЕ
	|	НЕ смартIECHOКомплектующие.ПометкаУдаления
	|	И НЕ смартIECHOКомплектующие.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	//++ смарт:ММ 621 30.09.2021 
	////++ смарт: Белоусова 621 03.09.21
	//|	Порядок,
	////-- смарт: Белоусова 621 03.09.21
	//-- смарт:ММ 30.09.2021
	|	Родитель,
	|	смартIECHOКомплектующие.Наименование
	|ИТОГИ ПО
	|	Родитель";
	
	ВыборкаИерархия = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИерархия.Следующий() Цикл
				
		Отбор = Новый Структура;
		Отбор.Вставить("ГруппаСправочника", ВыборкаИерархия.Родитель);
		НайденныеСтроки = ДобавленныеСтраницы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтраницы = НайденныеСтроки[0].Номер;
				
		ИмяРеквизитаТЧ = "ТЗ_" + НомерСтраницы;
		
		ВыборкаДетальная = ВыборкаИерархия.Выбрать();
		
		Пока ВыборкаДетальная.Следующий() Цикл
			
			ДобавитьСтроку = Ложь;
			
			Если ПервоначальноеЗаполнение Тогда
				ДобавитьСтроку = Истина;
			Иначе
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", ВыборкаДетальная.Ссылка);
				НайденныеСтроки = ЭтаФорма[ИмяРеквизитаТЧ].НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					ДобавитьСтроку = Истина;
				Иначе
					НайденнаяСтрока = НайденныеСтроки[0];
					Если НайденнаяСтрока.Цена <> ВыборкаДетальная.Цена Тогда
						НайденнаяСтрока.Цена = ВыборкаДетальная.Цена;
						НайденнаяСтрока.Подитог = НайденнаяСтрока.Цена * НайденнаяСтрока.Количество;
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли;
			
			Если ДобавитьСтроку Тогда
				НоваяСтрока = ЭтаФорма[ИмяРеквизитаТЧ].Добавить();
				НоваяСтрока.Наименование = ВыборкаДетальная.Ссылка;
				НоваяСтрока.Цена = ВыборкаДетальная.Цена;
			КонецЕсли;			
		КонецЦикла;
		
		// ++ 01.02.2021
		//++ смарт: Белоусова 621 03.09.21
		//ЭтаФорма[ИмяРеквизитаТЧ].Сортировать("Наименование");
		//-- смарт: Белоусова 621 03.09.21

		// --
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавитьСтраницуНаФорму(ИмяРеквизита, СинонимСтраницы)
	
	НоваяСтраница = Элементы.Вставить(ИмяРеквизита, Тип("ГруппаФормы"), Элементы.ГруппаСтраницы, Элементы.СтраницаФинальная);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	НоваяСтраница.Заголовок = СинонимСтраницы;
	
	Возврат НоваяСтраница;
	
КонецФункции

&НаСервере
Процедура ВывестиТаблицуНаФорму(Форма, ИмяТаблицы, Родитель, ЗаголовокТаблицы)
    
    ТаблицаФормы = Форма.Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Родитель);
    ТаблицаФормы.ПутьКДанным = ИмяТаблицы;
    ТаблицаФормы.Заголовок = ЗаголовокТаблицы;
    ТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ТаблицаФормы.ЦветТекстаЗаголовка = Новый Цвет(51, 102, 255);
	ТаблицаФормы.ШрифтЗаголовка = Новый Шрифт(ТаблицаФормы.ШрифтЗаголовка,, 14, Истина);
    ТаблицаФормы.ИзменятьПорядокСтрок = Ложь;
    ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
    ТаблицаФормы.РазрешитьНачалоПеретаскивания = Ложь;
	ТаблицаФормы.КоманднаяПанель.Видимость = Ложь;
	ТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки", "КомплектующиеПриАктивизацииСтроки");
	ТаблицаФормы.УстановитьДействие("Выбор", "КомплектующиеВыбор");
    
    ДобавитьНовуюКолонку(Форма, ТаблицаФормы, ИмяТаблицы, "Наименование", Истина);    
    ДобавитьНовуюКолонку(Форма, ТаблицаФормы, ИмяТаблицы, "Количество",, "КомплектующиеКоличествоПриИзменении");    
    ДобавитьНовуюКолонку(Форма, ТаблицаФормы, ИмяТаблицы, "Цена",, "КомплектующиеКолонкаПриИзменении");
	ДобавитьНовуюКолонку(Форма, ТаблицаФормы, ИмяТаблицы, "Подитог"); 
    
КонецПроцедуры
 
&НаСервере
Процедура ДобавитьНовуюКолонку(Форма, ТаблицаФормы, ИмяТаблицы, ИмяКолонки, ТолькоПросмотр = Ложь, ДействиеПриИзменении = "")
    
    НоваяКолонка = Форма.Элементы.Добавить(ИмяТаблицы+ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
    НоваяКолонка.Заголовок = ИмяКолонки;
    НоваяКолонка.ПутьКДанным = ИмяТаблицы + "." + ИмяКолонки;
    НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ТолькоПросмотр = ТолькоПросмотр;
	
	Если ЗначениеЗаполнено(ДействиеПриИзменении) Тогда
		НоваяКолонка.УстановитьДействие("ПриИзменении", ДействиеПриИзменении);
	КонецЕсли;
    
КонецПроцедуры

// ++ 02.02.2021
&НаКлиенте
Процедура КомплектующиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//++ смарт:ММ 621 23.09.2021 
	//ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	//ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
	//НомерЗнака_ = СтрНайти(ИмяТекущейСтраницы, "_");
	//Если НомерЗнака_ = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//НомерСтраницы = Прав(ИмяТекущейСтраницы, СтрДлина(ИмяТекущейСтраницы) - НомерЗнака_);
	//
	//ИмяТЧ = "ТЗ_" + НомерСтраницы;
	
	ИмяТЧ = ПолучитьИмяТекущейТЧ();
	Если НЕ ЗначениеЗаполнено(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	//-- смарт:ММ 23.09.2021
	
	Если Поле.Имя = "" + ИмяТЧ + "Наименование" Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Наименование);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриАктивизацииСтроки(Элемент) Экспорт
	
	//++ смарт:ММ 621 23.09.2021 
	//ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	//ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
	//НомерЗнака_ = СтрНайти(ИмяТекущейСтраницы, "_");
	//Если НомерЗнака_ = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//НомерСтраницы = Прав(ИмяТекущейСтраницы, СтрДлина(ИмяТекущейСтраницы) - НомерЗнака_);
	//
	//ИмяТЧ = "ТЗ_" + НомерСтраницы;
	
	ИмяТЧ = ПолучитьИмяТекущейТЧ();
	Если НЕ ЗначениеЗаполнено(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	//-- смарт:ММ 23.09.2021

	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СсылкаНаСправочник = ТекущиеДанные.Наименование;		
		ЭтаФорма.АдресКартинки = ПолучитьАдресКартинки(СсылкаНаСправочник, ЭтотОбъект.УникальныйИдентификатор);
		
		//++ #Б-3928 смарт: Лопато 28.07.2025 //Доработка конструктора IECHO. Уточнение наценки по моделям.  
		Если ИмяТЧ = "ТЗ_1" Тогда
			ЗаполнитьСтоимостьИзПредопределенныхНастроек();
		КонецЕсли;
		//-- #Б-3928 смарт: Лопато 28.07.2025
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеКоличествоПриИзменении(Элемент) Экспорт
	
	// Если в текущей строке выбрана основная комплектующая, то проверить, что все выбранные до этого комплектующие подходят для этой модели
	
	//++ смарт:ММ 621 23.09.2021 
	//ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	//ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
	//НомерЗнака_ = СтрНайти(ИмяТекущейСтраницы, "_");
	//Если НомерЗнака_ = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//НомерСтраницы = Прав(ИмяТекущейСтраницы, СтрДлина(ИмяТекущейСтраницы) - НомерЗнака_);
	//
	//ИмяТЧ = "ТЗ_" + НомерСтраницы;
	
	ИмяТЧ = ПолучитьИмяТекущейТЧ();
	Если НЕ ЗначениеЗаполнено(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;

	//-- смарт:ММ 23.09.2021
	
	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	ТекущаяКомплектующая = ТекущиеДанные.Наименование;
	
	//++ смарт:ММ 621 22.09.2021 
	//// ++ 02.02.2021
	////ДополнительныеПараметры = Новый Структура;

	//ТекстВажно = ПолучитьРеквизитОбъекта(ТекущаяКомплектующая, "Важно");
	//Если ЗначениеЗаполнено(ТекстВажно) Тогда
	//	//ОписаниеОповещения = Новый ОписаниеОповещения("КомплектующиеКоличествоПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//	ПоказатьПредупреждение(, ТекстВажно);
	//Иначе
	//	//КомплектующиеКоличествоПриИзмененииЗавершение(ДополнительныеПараметры);
	//КонецЕсли;
	//
	//Если ТекущиеДанные.Количество = 0 Тогда
	//	ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая, Истина);
	//Иначе
	//	ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая);
	//КонецЕсли;

	//ПроверитьСоответствиеМоделейНаСервере(ТекущаяКомплектующая);
	//ОбновитьСписокДоступныхКомплектующих(ТекущаяКомплектующая);
	//	
	//КомплектующиеКолонкаПриИзменении(Элемент);

	Если ТекущиеДанные.Количество <> 0 Тогда
		//++ смарт:ММ 621 28.09.2021
		СписокКомплектующихИзВопросов.Очистить();
		//-- смарт:ММ 28.09.2021
		ОбработатьВопросы(ТекущаяКомплектующая, ТекущиеДанные);
	Иначе
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяКомплектующая", ТекущаяКомплектующая);
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);	
		
		КомплектующиеКоличествоПриИзмененииЗавершение(ДополнительныеПараметры);
	КонецЕсли;
	
	//-- смарт:ММ 22.09.2021

	// --	
		
КонецПроцедуры

// ++ 02.02.2021
&НаСервереБезКонтекста
Функция ПолучитьРеквизитОбъекта(ТекОбъект, ИмяРеквизита)
	Возврат ТекОбъект[ИмяРеквизита];
КонецФункции

// ++ 02.02.2021
&НаКлиенте
Процедура КомплектующиеКоличествоПриИзмененииЗавершение(ДополнительныеПараметры) Экспорт
	
	//Если ТекущиеДанные.Количество = 0 Тогда
	//	ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая, Истина);
	//Иначе
	//	ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая);
	//КонецЕсли;

	//ПроверитьСоответствиеМоделейНаСервере(ТекущаяКомплектующая);
	//ОбновитьСписокДоступныхКомплектующих(ТекущаяКомплектующая);
	//
	//КомплектующиеКолонкаПриИзменении(Элемент);
	
	//++ смарт:ММ 621 22.09.2021
	
	ТекущаяКомплектующая = ДополнительныеПараметры.ТекущаяКомплектующая;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	// ++ 02.02.2021
	//ДополнительныеПараметры = Новый Структура;

	ТекстВажно = ПолучитьРеквизитОбъекта(ТекущаяКомплектующая, "Важно");
	Если ЗначениеЗаполнено(ТекстВажно) Тогда
		//ОписаниеОповещения = Новый ОписаниеОповещения("КомплектующиеКоличествоПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьПредупреждение(, ТекстВажно);
	Иначе
		//КомплектующиеКоличествоПриИзмененииЗавершение(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая, Истина);
	Иначе
		ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая);
	КонецЕсли;

	ПроверитьСоответствиеМоделейНаСервере(ТекущаяКомплектующая);
	ОбновитьСписокДоступныхКомплектующих(ТекущаяКомплектующая);
		
	КомплектующиеКолонкаПриИзменении(Неопределено); //Элемент);
	//-- смарт:ММ 22.09.2021
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеКолонкаПриИзменении(Элемент) Экспорт
	
	//++ смарт:ММ 621 23.09.2021 
	//ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	//ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
	//НомерЗнака_ = СтрНайти(ИмяТекущейСтраницы, "_");
	//Если НомерЗнака_ = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//НомерСтраницы = Прав(ИмяТекущейСтраницы, СтрДлина(ИмяТекущейСтраницы) - НомерЗнака_);
	//
	//ИмяТЧ = "ТЗ_" + НомерСтраницы;
	ИмяТЧ = ПолучитьИмяТекущейТЧ();
	Если НЕ ЗначениеЗаполнено(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	//-- смарт:ММ 23.09.2021
	
	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПересчитатьСтроку(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(ТекСтрока)
	
	ТекСтрока.Подитог = ТекСтрока.Цена * ТекСтрока.Количество;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяКомплектующая, УдалитьИзСписка = Ложь)
		
	Если ТекущаяКомплектующая.ОсновнаяКомплектующая Тогда
		СписокЗнач = ВыбранныеОсновныеКомплектующие;
	Иначе
		СписокЗнач = ВыбранныеКомплектующие;
	КонецЕсли;
	
	Если УдалитьИзСписка Тогда
		Если СписокЗнач.НайтиПоЗначению(ТекущаяКомплектующая) <> Неопределено Тогда
			СписокЗнач.Удалить(СписокЗнач.НайтиПоЗначению(ТекущаяКомплектующая));
		КонецЕсли;
	Иначе
		Если СписокЗнач.НайтиПоЗначению(ТекущаяКомплектующая) = Неопределено Тогда
			СписокЗнач.Добавить(ТекущаяКомплектующая);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоответствиеМоделейНаСервере(ТекущаяКомплектующая)
	
	Если ТекущаяКомплектующая.ОсновнаяКомплектующая Тогда
				
		Для Каждого ЭлементСпискаОсновнаяКомплектующая Из ВыбранныеОсновныеКомплектующие Цикл
			
			ОсновнаяКомплектующая = ЭлементСпискаОсновнаяКомплектующая.Значение;
			ТекущаяМодель = ОсновнаяКомплектующая.Model;
			// ++ 01.02.2021
			ТекущийРазмер = ОсновнаяКомплектующая.Размер;
			// --
			
			Для Сч = 1 По КоличествоСтраниц Цикл
				
				ИмяТЧ = "ТЗ_" + Сч;
				
				Для Каждого ТекСтрока Из ЭтаФорма[ИмяТЧ] Цикл
					
					Если ТекСтрока.Количество = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					// ++ 01.02.2021
					ОграничениеИспользованияПоМоделям = ТекСтрока.Наименование.ОграничениеИспользованияПоМоделям;
					ОграничениеИспользованияПоРазмеру = ТекСтрока.Наименование.ОграничениеИспользованияПоРазмеру;
					 
					Если НЕ ОграничениеИспользованияПоМоделям 						
						И НЕ ОграничениеИспользованияПоРазмеру
					// --
						Тогда
						Продолжить;
					КонецЕсли;
					
					// ++ 01.02.2021
					Если ОграничениеИспользованияПоМоделям Тогда
					// --
						
						КомплектующаяПодходитДляТекущихМоделей = Ложь;
						Отбор = Новый Структура;
						Отбор.Вставить("Модель", ТекущаяМодель);
						НайденныеСтроки = ТекСтрока.Наименование.МоделиДляИспользования.НайтиСтроки(Отбор);
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							КомплектующаяПодходитДляТекущихМоделей = Истина;
						КонецЕсли;
										
						Если НЕ КомплектующаяПодходитДляТекущихМоделей Тогда
							ТекстСообщения = "Комплектующая " + ТекСтрока.Наименование + " не используется с " + ОсновнаяКомплектующая + " (ограничение по модели)";
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
							ТекСтрока.Количество = 0;
							ТекСтрока.Подитог = 0;
							ВыбранныеКомплектующие.Удалить(ВыбранныеКомплектующие.НайтиПоЗначению(ТекСтрока.Наименование));
						КонецЕсли;
						
					// ++ 01.02.2021
					КонецЕсли;
					
					Если ОграничениеИспользованияПоРазмеру Тогда
					
						КомплектующаяПодходитДляТекущихРазмеров = Ложь;
						Отбор = Новый Структура;
						Отбор.Вставить("Размер", ТекущийРазмер);
						НайденныеСтроки = ТекСтрока.Наименование.РазмерыДляИспользования.НайтиСтроки(Отбор);
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							КомплектующаяПодходитДляТекущихРазмеров = Истина;
						КонецЕсли;
										
						Если НЕ КомплектующаяПодходитДляТекущихРазмеров Тогда
							ТекстСообщения = "Комплектующая " + ТекСтрока.Наименование + " не используется с " + ОсновнаяКомплектующая + " (ограничение по размеру)";
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
							ТекСтрока.Количество = 0;
							ТекСтрока.Подитог = 0;
							ВыбранныеКомплектующие.Удалить(ВыбранныеКомплектующие.НайтиПоЗначению(ТекСтрока.Наименование));
						КонецЕсли;
					КонецЕсли;
					// --

				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДоступныхКомплектующих(ТекущаяКомплектующая)
	
	// Удалить несоответствующие комплектующие
	
	Если ТекущаяКомплектующая = Неопределено  
		ИЛИ ТекущаяКомплектующая.ОсновнаяКомплектующая Тогда
		
		// Сначала добавить все возможные комплектующие (если, например, поменялась основная комплектующая и требуется вернуть ранее удаленные из списка элементы)
		ЗаполнитьТаблицыКомплектующих(Ложь);

		Для Каждого ЭлементСпискаОсновнаяКомплектующая Из ВыбранныеОсновныеКомплектующие Цикл
			
			ОсновнаяКомплектующая = ЭлементСпискаОсновнаяКомплектующая.Значение;
			ТекущаяМодель = ОсновнаяКомплектующая.Model;
			
			// ++ 01.02.2021
			ТекущийРазмер = ОсновнаяКомплектующая.Размер;
			// --
			
			Для Сч = 1 По КоличествоСтраниц Цикл
				
				ИмяТЧ = "ТЗ_" + Сч;
				
				СтрокиДляУдаления = Новый Массив;
				
				Для Каждого ТекСтрока Из ЭтаФорма[ИмяТЧ] Цикл
					
					// ++ 01.02.2021
					ОграничениеИспользованияПоМоделям = ТекСтрока.Наименование.ОграничениеИспользованияПоМоделям;
					ОграничениеИспользованияПоРазмеру = ТекСтрока.Наименование.ОграничениеИспользованияПоРазмеру;
					 
					Если НЕ ОграничениеИспользованияПоМоделям 						
						И НЕ ОграничениеИспользованияПоРазмеру						
						// --
						Тогда
						Продолжить;
					КонецЕсли;
					
					// ++ 01.02.2021
					Если ОграничениеИспользованияПоМоделям Тогда
					// --
						КомплектующаяПодходитДляТекущихМоделей = Ложь;
						Отбор = Новый Структура;
						Отбор.Вставить("Модель", ТекущаяМодель);
						НайденныеСтроки = ТекСтрока.Наименование.МоделиДляИспользования.НайтиСтроки(Отбор);
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							КомплектующаяПодходитДляТекущихМоделей = Истина;
						КонецЕсли;
						
						Если НЕ КомплектующаяПодходитДляТекущихМоделей Тогда
							// ++ 01.02.2021
							//ЭтаФорма[ИмяТЧ].Удалить(ТекСтрока);
							СтрокиДляУдаления.Добавить(ТекСтрока);
							
							Продолжить;
							// --
						КонецЕсли;
					
					// ++ 01.02.2021
					КонецЕсли;
				
					Если ОграничениеИспользованияПоРазмеру Тогда
						
						КомплектующаяПодходитДляТекущихРазмеров = Ложь;
						Отбор = Новый Структура;
						Отбор.Вставить("Размер", ТекущийРазмер);
						НайденныеСтроки = ТекСтрока.Наименование.РазмерыДляИспользования.НайтиСтроки(Отбор);
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							КомплектующаяПодходитДляТекущихРазмеров = Истина;
						КонецЕсли;
						
						Если НЕ КомплектующаяПодходитДляТекущихРазмеров Тогда
							//ЭтаФорма[ИмяТЧ].Удалить(ТекСтрока);	
							СтрокиДляУдаления.Добавить(ТекСтрока);
						КонецЕсли;
					КонецЕсли;
					// --
					
				КонецЦикла;
				
				// ++ 01.02.2021
				Счетчик = ЭтаФорма[ИмяТЧ].Количество() - 1;
				
				Пока Счетчик >= 0 Цикл
					
					ТекущаяСтрока = ЭтаФорма[ИмяТЧ][Счетчик];
					
					Если СтрокиДляУдаления.Найти(ТекущаяСтрока) <> Неопределено Тогда
						
						Если ТекущаяСтрока.Количество <> 0 Тогда
							ДобавитьУдалитьКомплектующуюСписокЗначений(ТекущаяСтрока.Наименование, Истина);	
						КонецЕсли;
						
						ЭтаФорма[ИмяТЧ].Удалить(ТекущаяСтрока);
					КонецЕсли;
					
					Счетчик = Счетчик - 1;
				КонецЦикла;
				// --
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументСпецификация()
	
	Результат = Документы.смартIECHOСпецификация.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо указать клиента!", , "Клиент", "Объект");
		Возврат Результат;
	КонецЕсли;
	
	ДокОбъект = Документы.смартIECHOСпецификация.СоздатьДокумент();
	
	ДокОбъект.Дата 			= ТекущаяДата();
	ДокОбъект.Валюта	 	= Справочники.Валюты.НайтиПоКоду("840"); // доллар
	КурсВалютыСтруктура 	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокОбъект.Валюта, ТекущаяДата());
	ДокОбъект.Клиент 		= Объект.Клиент;
	ДокОбъект.Менеджер 		= ПараметрыСеанса.ТекущийПользователь;
	ДокОбъект.НаименованиеОборудования = НаименованиеОборудования();	
	ДокОбъект.Итого 		= Итого;
	// ++ 02.02.2021
	ДокОбъект.ИтогоДляКлиента = ИтогоДляКлиента;
	// --
	ДокОбъект.Курс	 		= КурсВалютыСтруктура.Курс;
	//ДокОбъект.ИтогоРуб 		= Итого * КурсВалютыСтруктура.Курс / КурсВалютыСтруктура.Кратность;
	
	// ++ 22.04.2021
	ДокОбъект.КонтактноеЛицо 	= КонтактноеЛицо;
	ДокОбъект.Маржа 			= Маржа;
	ДокОбъект.ДатаДействияКП 	= ДатаДействияКП;
	ДокОбъект.СрокПоставкиДней 	= СрокПоставкиДней;
	ДокОбъект.СтоимостьДоставкиДоГраницыРФ 		= СтоимостьДоставкиДоГраницыРФ;
	ДокОбъект.СтоимостьДоставкиПоРФ 			= СтоимостьДоставкиПоРФ;
	ДокОбъект.СтоимостьТаможенногоОформления 	= СтоимостьТаможенногоОформления;
	
	//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
	ДокОбъект.СтоимостьДоставкиЖДТранспортом 		= СтоимостьДоставкиЖДТранспортом;
	ДокОбъект.СтоимостьДоставкиАМТранспортом 		= СтоимостьДоставкиАМТранспортом;
	ДокОбъект.ВалютаУчета 		= ВалютаУчета; 
	ДокОбъект.СтавкаНДС         = СтавкаНДС;
	КурсВалютыСтруктураВалютаУчета 		= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокОбъект.ВалютаУчета, ТекущаяДата());
	ДокОбъект.СхемаЗаполненияСтоимости=СхемаЗаполненияСтоимости;
	ДокОбъект.ТипДоставки=ТипДоставки;
	//-- #1376 смарт: Фролов 18.06.2023
	
	// ++ 04.05.2021
	ДокОбъект.СебестоимостьОборудования = СебестоимостьОборудования;
	ДокОбъект.ИтогоДляКлиентаРуб = ИтогоДляКлиента * КурсВалютыСтруктура.Курс / КурсВалютыСтруктура.Кратность;
	// --
	
	// ++ 12.05.2021
	ДокОбъект.СкидкаНаЗакупку = СкидкаНаЗакупку;
	ДокОбъект.ИтогоЦенаЗакупкиСоСкидкой = ИтогоЦенаЗакупкиСоСкидкой;
	ДокОбъект.ИтогоРуб = ИтогоЦенаЗакупкиСоСкидкой * КурсВалютыСтруктура.Курс / КурсВалютыСтруктура.Кратность;
	// --
	
	//++ смарт:ММ 621 28.09.2021 
	ДокОбъект.МаржаUSD = МаржаUSD;
	//-- смарт:ММ 28.09.2021
	
	Для Сч = 1 По КоличествоСтраниц Цикл
						
		ИмяТЧ = "ТЗ_" + Сч;
		
		Для Каждого ТекСтрока Из ЭтаФорма[ИмяТЧ] Цикл
			
			Если ТекСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДокОбъект.Комплектующие.Добавить();
			НоваяСтрока.НаименованиеКомплектующей = ТекСтрока.Наименование;
			НоваяСтрока.Количество = ТекСтрока.Количество;
			НоваяСтрока.Цена = ТекСтрока.Цена;
			НоваяСтрока.Стоимость = ТекСтрока.Подитог;						
		КонецЦикла;		
	КонецЦикла;
	
	//++ смарт:ММ 621 30.09.2021 
	ДокОбъект.СортироватьТаблицуКомплектующих();
	//-- смарт:ММ 30.09.2021
	
	Попытка
		ДокОбъект.Записать();
		Результат = ДокОбъект.Ссылка;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаФинальнуюСтраницу()
	
	ЗаполнитьИтоговуюИнформацию();
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговуюИнформацию()
	
	Об = РеквизитФормыВЗначение("Объект");
	ИтоговаяИнформация = Об.ПолучитьМакет("Макет").ПолучитьТекст();

	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#fcfaeb", "#ffffff");
	КонецЕсли;
	
	Итого = 0;
	КомплектующаяТекст = "";
	
	Для Сч = 1 По КоличествоСтраниц Цикл
						
		ИмяТЧ = "ТЗ_" + Сч;
		
		Для Каждого ТекСтрока Из ЭтаФорма[ИмяТЧ] Цикл
			
			Если ТекСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстТекущаяСтрока = "" + ТекСтрока.Наименование + ", " + ТекСтрока.Количество + " шт., $" + ТекСтрока.Подитог;
			Итого = Итого + ТекСтрока.Подитог;
			
			КомплектующаяТекст = КомплектующаяТекст + ?(ЗначениеЗаполнено(КомплектующаяТекст), "<br>", "") + ТекстТекущаяСтрока;
						
		КонецЦикла;		
	КонецЦикла;	
	
	НаименованиеОборудования = НаименованиеОборудования();
	
	// ++ 03.02.2021
	ИтогоДляКлиента = 0;
	ИтогоДляКлиентаРасчет = "";
	
	// ++ 16.05.2021
	КоэффициентРасчетаСебестоимости = 1;
	
	Если ВыбранныеОсновныеКомплектующие.Количество() > 0 Тогда
		//++ #1361 смарт: Фролов 30.05.2023 //Изменения в модуле iECHO  
		//ОК = ВыбранныеОсновныеКомплектующие[0].Значение; 
		//КоэффициентРасчетаСебестоимости = ОК.КоэффициентРасчетаСебестоимости; 
		КоэффициентРасчетаСебестоимости=0;
		Для Каждого ОК Из ВыбранныеОсновныеКомплектующие Цикл
			КоэффициентРасчетаСебестоимости=КоэффициентРасчетаСебестоимости+ОК.Значение.КоэффициентРасчетаСебестоимости;
		КонецЦикла;	
		//-- #1361 смарт: Фролов 30.05.2023
	КонецЕсли;
	// --
	
	Если Итого <> 0 Тогда
		//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
        КоэффициентНДСТекст=СтавкаНДС/100+1;
		// ++ 16.05.2021
		//ДоставкаПоРФиТаможняРубли = СтоимостьДоставкиПоРФ + СтоимостьТаможенногоОформления;
		Если ТипДоставки=Перечисления.смартТипыДоставки.МорскойПлюсЖД Тогда
			ДоставкаПоРФиТаможняРубли = СтоимостьДоставкиПоРФ * КоэффициентРасчетаСебестоимости + СтоимостьТаможенногоОформления * КоэффициентРасчетаСебестоимости;
			// --
			
			Рубли = Справочники.Валюты.НайтиПоКоду("643");
			Доллары = Справочники.Валюты.НайтиПоКоду("840");
			Курс2 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Доллары, ТекущаяДата());
			КурсВалюты = Курс2.Курс;
			
			ДоставкаПоРФиТаможняДоллары = РаботаСКурсамиВалют.ПересчитатьВВалюту(ДоставкаПоРФиТаможняРубли, Рубли, Доллары, ТекущаяДата());
			
			// ++ 12.05.2021
			ИтогоЦенаЗакупкиСоСкидкой = смартОбщегоНазначения.РассчитатьСуммуСоСкидкойНаЗакупку(СкидкаНаЗакупку, Итого);
			//--

			// 16.05.2021
			//СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоГраницыРФ) * 1.2 + ДоставкаПоРФиТаможняДоллары;
			СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоГраницыРФ * КоэффициентРасчетаСебестоимости) * +КоэффициентНДСТекст + ДоставкаПоРФиТаможняДоллары;
			// --
			
			ИтогоДляКлиентаРасчет = 
			"Себестоимость оборудования = (Стоимость закупки + Доставка до границы РФ * Коэффициент расчета себестоимости) * "+КоэффициентНДСТекст+" (НДС) + (Доставка по РФ * Коэффициент расчета себестоимости + Таможенное оформление * Коэффициент расчета себестоимости) / Курс USD-RUB =" + "<br>"
			+ "(" + ИтогоЦенаЗакупкиСоСкидкой + " + " + СтоимостьДоставкиДоГраницыРФ + " * " + КоэффициентРасчетаСебестоимости + ") * "+КоэффициентНДСТекст+" + (" + СтоимостьДоставкиПоРФ + " * " + КоэффициентРасчетаСебестоимости + " + " + СтоимостьТаможенногоОформления + " * " + КоэффициентРасчетаСебестоимости + ") / " + КурсВалюты + " = " + СебестоимостьОборудования;
		Иначе
			Если ЭтаФорма.ТипДоставки=Перечисления.смартТипыДоставки.ЖелезнодорожныйТранспорт Тогда
				СтоимостьДоставкиВВалютеУчета=СтоимостьДоставкиЖДТранспортом;
			Иначе
				СтоимостьДоставкиВВалютеУчета=СтоимостьДоставкиАМТранспортом;
			КонецЕсли;	
			КурсВалютаУчетаСтруктура = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУчета, ТекущаяДата());
			ИтогоЦенаЗакупкиСоСкидкой = смартОбщегоНазначения.РассчитатьСуммуСоСкидкойНаЗакупку(СкидкаНаЗакупку, Итого);
			ДоставкаТаможняВВалютеУчета = СтоимостьТаможенногоОформления * КоэффициентРасчетаСебестоимости;
			Доллары = Справочники.Валюты.НайтиПоКоду("840");
			Курс2 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Доллары, ТекущаяДата());
			КурсВалюты = Курс2.Курс;
			КурсВалютаУчета=КурсВалютаУчетаСтруктура.Курс;
			КратностьКурса=КурсВалютаУчетаСтруктура.Кратность;
			КроссКурс=Формат(КурсВалюты/КурсВалютаУчета,"ЧЦ=10; ЧДЦ=4");
			
			СтоимостьДоставкиДоллары= РаботаСКурсамиВалют.ПересчитатьВВалюту(СтоимостьДоставкиВВалютеУчета, ВалютаУчета, Доллары, ТекущаяДата());
			ТаможняДоллары = РаботаСКурсамиВалют.ПересчитатьВВалюту(ДоставкаТаможняВВалютеУчета, ВалютаУчета, Доллары, ТекущаяДата());
			СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоллары * КоэффициентРасчетаСебестоимости) * +КоэффициентНДСТекст + ТаможняДоллары;
			
			ИтогоДляКлиентаРасчет = 
			"Себестоимость оборудования = (Стоимость закупки + "+ЭтаФорма.ТипДоставки+" * Коэффициент расчета себестоимости) * "+КоэффициентНДСТекст+" (НДС) + ( Таможенное оформление * Коэффициент расчета себестоимости) / Кросс курс USD-"+ВалютаУчета.Наименование+" * Кратность курса =" + "<br>"
			+ "(" + ИтогоЦенаЗакупкиСоСкидкой + " + " + СтоимостьДоставкиДоллары + " * " + КоэффициентРасчетаСебестоимости + ") * "+КоэффициентНДСТекст+" + ("+ СтоимостьТаможенногоОформления + " * " + КоэффициентРасчетаСебестоимости + ") / " + КроссКурс + " * "+ КратностьКурса+ " = " + СебестоимостьОборудования;
		КонецЕсли;
		
		//-- #1376 смарт: Фролов 18.06.2023
		
		//++ смарт:ММ 621 30.09.2021 
		//ИтогоДляКлиента = Окр(СебестоимостьОборудования + СебестоимостьОборудования * Маржа / 100, 2);
		МаржаUSD = Окр(СебестоимостьОборудования * Маржа / 100, 2);
		//++ #1518 смарт: Фролов 19.10.2023 //Изменения консруктора iECHO (продолжение задачи 1376)
		//Изменил разрядность округления
		ИтогоДляКлиента = Окр(СебестоимостьОборудования + МаржаUSD, -1);
		//-- #1518 смарт: Фролов 19.10.2023
		//-- смарт:ММ 30.09.2021
		
		ИтогоДляКлиентаРасчет = ИтогоДляКлиентаРасчет +  "<br>"
		+ "Цена для клиента = Себестоимость оборудования + Себестоимость оборудования * Маржа = " + Символы.ПС
		+ СебестоимостьОборудования + " + " + СебестоимостьОборудования + " * " + Маржа + "% = " + ИтогоДляКлиента;
	КонецЕсли;	
	// --
	
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#НаименованиеОборудования#", НаименованиеОборудования);
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#Менеджер#", ПараметрыСеанса.ТекущийПользователь);
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#Клиент#", Объект.Клиент);
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#Итого#", "" + Итого + "$");
	// ++ 03.02.2021
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#ИтогоДляКлиента#", "" + ИтогоДляКлиента + "$");
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#ИтогоДляКлиентаРасчет#", ИтогоДляКлиентаРасчет);
	// 12.05.2021
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#СкидкаНаЗакупку#", Строка(СкидкаНаЗакупку));
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#ИтогоСоСкидкой#", "" + ИтогоЦенаЗакупкиСоСкидкой + "$");
	// --
	ИтоговаяИнформация = СтрЗаменить(ИтоговаяИнформация, "#КомплектующаяТекст#", КомплектующаяТекст);
	
	НачалоТегHTML = СтрНайти(ИтоговаяИнформация, "<html");
	Если НачалоТегHTML <> 0 Тогда
		ИтоговаяИнформация = Прав(ИтоговаяИнформация, СтрДлина(ИтоговаяИнформация) - НачалоТегHTML + 1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеОборудования()
	
	Результат = "";
	
	Для Каждого ОК Из ВыбранныеОсновныеКомплектующие Цикл
		Результат = Результат + ?(ЗначениеЗаполнено(Результат), "_", "") + ОК.Значение;
	КонецЦикла;
	
	Для Каждого Комплектующая Из ВыбранныеКомплектующие Цикл
		Результат = Результат + ?(ЗначениеЗаполнено(Результат), "_", "") + Комплектующая.Значение;
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАдресКартинки(СсылкаНаСправочник, ИД)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(СсылкаНаСправочник.ФайлКартинки, ИД).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		АдресКартинки = "";
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат АдресКартинки;
	
КонецФункции

// ++ 12.05.2021
&НаКлиенте
Процедура СкидкаНаЗакупкуПриИзменении(Элемент)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

//++ смарт:ММ 621 22.09.2021
&НаСервереБезКонтекста
Функция ПолучитьВопросыПоКомплектующей(ТекКомплектующая)
	
	МассивРезультат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартIECHOВопросыОтветыПоКомплектующим.Вопрос КАК Вопрос
	|ИЗ
	|	РегистрСведений.смартIECHOВопросыОтветыПоКомплектующим КАК смартIECHOВопросыОтветыПоКомплектующим
	|ГДЕ
	|	смартIECHOВопросыОтветыПоКомплектующим.ИсходнаяКомплектующая = &ТекКомплектующая";
	
	Запрос.УстановитьПараметр("ТекКомплектующая", ТекКомплектующая);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Вопрос) Тогда
			МассивРезультат.Добавить(Выборка.Вопрос);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРезультат;
		
КонецФункции //-- смарт:ММ 22.09.2021

//++ смарт:ММ 621 22.09.2021 
&НаСервереБезКонтекста
Функция ПолучитьЗависимыеКомплектующие(ТекКомплектующая, Вопрос, Ответ)
	
	МассивРезультат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартIECHOВопросыОтветыПоКомплектующим.Комплектующая КАК Комплектующая
	|ИЗ
	|	РегистрСведений.смартIECHOВопросыОтветыПоКомплектующим КАК смартIECHOВопросыОтветыПоКомплектующим
	|ГДЕ
	|	смартIECHOВопросыОтветыПоКомплектующим.ИсходнаяКомплектующая = &ТекКомплектующая
	|	И смартIECHOВопросыОтветыПоКомплектующим.Вопрос = &Вопрос
	|	И смартIECHOВопросыОтветыПоКомплектующим.Ответ = &Ответ";
	
	Запрос.УстановитьПараметр("ТекКомплектующая", 	ТекКомплектующая);
	Запрос.УстановитьПараметр("Вопрос", 			Вопрос);
	Запрос.УстановитьПараметр("Ответ", 				Ответ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Комплектующая) Тогда
			МассивРезультат.Добавить(Выборка.Комплектующая);
		КонецЕсли;
	КонецЦикла;
		
	Возврат МассивРезультат;	
	
КонецФункции //-- смарт:ММ 22.09.2021

//++ смарт:ММ 621 23.09.2021 
&НаКлиенте
Функция ОбработатьВопросы(ТекущаяКомплектующая, ТекущиеДанные = Неопределено)
	
	//++ смарт:ММ 621 28.09.2021 
	Если СписокКомплектующихИзВопросов.НайтиПоЗначению(ТекущаяКомплектующая) = Неопределено Тогда
		СписокКомплектующихИзВопросов.Добавить(ТекущаяКомплектующая);
	КонецЕсли;
	//-- смарт:ММ 28.09.2021
	
	МассивВопросов = ПолучитьВопросыПоКомплектующей(ТекущаяКомплектующая);
	
	Если МассивВопросов.Количество() > 0 Тогда
		НомерПоследнегоОбработанногоВопросаИзМассива = 0;
		ЗадатьВопросы(МассивВопросов, НомерПоследнегоОбработанногоВопросаИзМассива, ТекущаяКомплектующая, ТекущиеДанные);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяКомплектующая", ТекущаяКомплектующая);
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);	
	
	КомплектующиеКоличествоПриИзмененииЗавершение(ДополнительныеПараметры);
	
КонецФункции //-- смарт:ММ 23.09.2021

//++ смарт:ММ 621 23.09.2021 
&НаКлиенте
Процедура ЗадатьВопросы(МассивВопросов, НомерПоследнегоОбработанногоВопросаИзМассива = 0, ТекущаяКомплектующая, ТекущиеДанные)
	
	Сч = 1;
	
	Для Каждого Вопрос Из МассивВопросов Цикл
		
		Если Сч = НомерПоследнегоОбработанногоВопросаИзМассива + 1 Тогда
			ЗадатьВопрос(Вопрос, ТекущаяКомплектующая, НомерПоследнегоОбработанногоВопросаИзМассива, МассивВопросов, ТекущиеДанные);
		КонецЕсли;
		
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 23.09.2021

//++ смарт:ММ 621 23.09.2021 
&НаКлиенте
Процедура ЗадатьВопрос(Вопрос, ТекущаяКомплектующая, НомерПоследнегоОбработанногоВопросаИзМассива, МассивВопросов, ТекущиеДанные)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	ДополнительныеПараметры.Вставить("МассивВопросов", МассивВопросов);
	ДополнительныеПараметры.Вставить("Вопрос", Вопрос);
	ДополнительныеПараметры.Вставить("ТекущаяКомплектующая", ТекущаяКомплектующая);
	ДополнительныеПараметры.Вставить("НомерПоследнегоОбработанногоВопросаИзМассива", НомерПоследнегоОбработанногоВопросаИзМассива);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("КомплектующиеКоличествоПриИзмененииОтветНаВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	//++ #Б4216 смарт: Шляпников 12.09.2025 / Корректировка Конструктора IECHO.
	ДанныеАвтоОтвета = ПроверитьВопросНаАвтоматическийОтвет(Вопрос);
	Если ДанныеАвтоОтвета.ЕстьАвтоматическийОтвет Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, ?(ДанныеАвтоОтвета.АвтоматическийОтвет = Истина, КодВозвратаДиалога.Да, КодВозвратаДиалога.Нет));
		Возврат;
	КонецЕсли;
	//-- #Б4216 смарт: Шляпников 12.09.2025

	ПоказатьВопрос(ОписаниеОповещения, Вопрос, РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры //-- смарт:ММ 23.09.2021

//++ смарт:ММ 621 22.09.2021 
&НаКлиенте
Процедура КомплектующиеКоличествоПриИзмененииОтветНаВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	МассивВопросов = ДополнительныеПараметры.МассивВопросов;
	
	НомерПоследнегоОбработанногоВопросаИзМассива = ДополнительныеПараметры.НомерПоследнегоОбработанногоВопросаИзМассива;
	НомерПоследнегоОбработанногоВопросаИзМассива = НомерПоследнегоОбработанногоВопросаИзМассива + 1;
	
	Ответ = Неопределено;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Ответ = Истина;
	Иначе
		Ответ = Ложь;
	КонецЕсли;	
	
	ТекущаяКомплектующая = ДополнительныеПараметры.ТекущаяКомплектующая;
	Вопрос = ДополнительныеПараметры.Вопрос;
	
	ЗависимыеКомплектующие = ПолучитьЗависимыеКомплектующие(ТекущаяКомплектующая, Вопрос, Ответ);
	
	Для Каждого ЗависимаяКомплектующая Из ЗависимыеКомплектующие Цикл
		
		// Пройтись по всем ТЧ и отметить количество = 1 для выбранной комплектующей.
		// Пересчитать подитог
		// Проверить и задать вопросы при необходимости (если они есть в РС)
		
		//++ смарт:ММ 621 28.09.2021 
		Если СписокКомплектующихИзВопросов.НайтиПоЗначению(ЗависимаяКомплектующая) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//-- смарт:ММ 28.09.2021
		
		ОтметитьКоличествоПоКомплектующей(ЗависимаяКомплектующая);
		ОбработатьВопросы(ЗависимаяКомплектующая, ТекущиеДанные);
	КонецЦикла;
	
	ЗадатьВопросы(МассивВопросов, НомерПоследнегоОбработанногоВопросаИзМассива, ТекущаяКомплектующая, ТекущиеДанные);
	
КонецПроцедуры //-- смарт:ММ 22.09.2021

//++ смарт:ММ 621 23.09.2021 
&НаКлиенте
Процедура ОтметитьКоличествоПоКомплектующей(ЗависимаяКомплектующая)
		
	Для Сч = 1 По КоличествоСтраниц Цикл
		
		ИмяТЧ = "ТЗ_" + Сч;
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", ЗависимаяКомплектующая);
		НайденныеСтроки = ЭтаФорма[ИмяТЧ].НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Количество = 1;
			ПересчитатьСтроку(НайденнаяСтрока);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Автоматически добавлена комплектующая " + ЗависимаяКомплектующая + " (кол-во = 1)");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 23.09.2021

//++ смарт:ММ 621 23.09.2021 
&НаКлиенте
Функция ПолучитьИмяТекущейТЧ()
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	ИмяТекущейСтраницы = ТекущаяСтраница.Имя;
	НомерЗнака_ = СтрНайти(ИмяТекущейСтраницы, "_");
	Если НомерЗнака_ = 0 Тогда
		Возврат "";
	КонецЕсли;
	НомерСтраницы = Прав(ИмяТекущейСтраницы, СтрДлина(ИмяТекущейСтраницы) - НомерЗнака_);
	
	ИмяТЧ = "ТЗ_" + НомерСтраницы;
	
	Возврат ИмяТЧ;
	
КонецФункции //-- смарт:ММ 23.09.2021

//++ #1376 смарт: Фролов 15.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура ТипДоставкиПриИзменении(Элемент)
	ЗаполнитьСтоимостьИзПредопределенныхНастроек();
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		ЗаполнитьИтоговуюИнформацию();			
	КонецЕсли;	
КонецПроцедуры  //-- #1376 смарт: Фролов 15.06.2023

//++ #1376 смарт: Фролов 15.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.СхемаЗаполненияСтоимости) Тогда 
		ЭтаФорма.ТипДоставки=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ЭтаФорма.СхемаЗаполненияСтоимости,"ТипДоставки");
		ЗаполнитьСтоимостьИзПредопределенныхНастроек(); 
	КонецЕсли;
	ОбновитьСписокТиповДоставки();
КонецПроцедуры  //-- #1376 смарт: Фролов 15.06.2023

//++ #1376 смарт: Фролов 15.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура СхемаЗаполненияСтоимостиПриИзменении(Элемент)
	ЗаполнитьСтоимостьИзПредопределенныхНастроек(); 
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		ЗаполнитьИтоговуюИнформацию();			
	КонецЕсли;
	ОбновитьСписокТиповДоставки();
КонецПроцедуры //-- #1376 смарт: Фролов 15.06.2023

//++ #1376 смарт: Фролов 15.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура ДоставкаЖДПриИзменении(Элемент)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
КонецПроцедуры //-- #1376 смарт: Фролов 15.06.2023

//++ #1376 смарт: Фролов 15.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура ДоставкаАМПриИзменении(Элемент)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФинальная Тогда
		// Обновить итоговое поле
		ЗаполнитьИтоговуюИнформацию();
	КонецЕсли;
КонецПроцедуры //-- #1376 смарт: Фролов 15.06.2023

&НаСервере
//++ #1376 смарт: Фролов 06.09.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
Процедура ОбновитьСписокТиповДоставки() 
	Элементы.ТипДоставки.СписокВыбора.Очистить();
	Если ЭтаФорма.СхемаЗаполненияСтоимости.Страна=Справочники.СтраныМира.Россия ТОгда
		Элементы.ТипДоставки.СписокВыбора.Добавить(Перечисления.смартТипыДоставки.МорскойПлюсЖД,"Морской транспорт + ЖД");
		Элементы.ДекорацияВниманиеСтрана.Видимость=Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.СхемаЗаполненияСтоимости) ТОгда
		Страна=НРег(ЭтаФорма.СхемаЗаполненияСтоимости.Страна.Наименование); 
		Страна=Врег(Лев(Страна,1))+Сред(Страна,2,СтрДлина(Страна)-1);
		МасДляСтраны=ПолучитьСклоненияСтроки(Страна,"ПЛ=Мужской","ПД=Родительный");
		НаименованиеСтраны=МасДляСтраны[0];
		Элементы.ДекорацияВниманиеСтрана.Заголовок="Внимание! Расчет произведен для "+НаименованиеСтраны+"";
		Элементы.ДекорацияВниманиеСтрана.Видимость=Истина;
	КонецЕсли;	
	Элементы.ТипДоставки.СписокВыбора.Добавить(Перечисления.смартТипыДоставки.ЖелезнодорожныйТранспорт,"Железнодорожный транспорт");
	Элементы.ТипДоставки.СписокВыбора.Добавить(Перечисления.смартТипыДоставки.АвтомобильныйТранспорт,"Автомобильный транспорт"); 
	ЭтаФорма.ТипДоставки=ЭтаФорма.СхемаЗаполненияСтоимости.ТипДоставки;
КонецПроцедуры	//-- #1376 смарт: Фролов 06.09.2023

//++ #Б4216 смарт: Шляпников 12.09.2025 / Корректировка Конструктора IECHO.
&НаСервере
Функция ПроверитьВопросНаАвтоматическийОтвет(Вопрос)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьАвтоматическийОтвет", Вопрос.АвтоматическийОтвет <> Неопределено);
	Результат.Вставить("АвтоматическийОтвет", Вопрос.АвтоматическийОтвет);
	
	Возврат Результат;
	
КонецФункции
