
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПричинаВозникновения");
	КонецЕсли;

	Если Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована ИЛИ Статус = Перечисления.СтатусыПретензийКлиентов.Обрабатывается Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
		МассивНепроверяемыхРеквизитов.Добавить("РезультатыОтработки");
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПартнерыИКонтактныеЛица.Партнер");
		Для ТекИндекс = 0 По ПартнерыИКонтактныеЛица.Количество() - 1 Цикл
			Если Не ЗначениеЗаполнено(ПартнерыИКонтактныеЛица[ТекИндекс].Партнер) Тогда

				АдресОшибки = " " + НСтр("ru='в строке %НомерСтроки% списка ""Участники""'");
				АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", ПартнерыИКонтактныеЛица[ТекИндекс].НомерСтроки);

				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Контрагент""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПартнерыИКонтактныеЛица", ПартнерыИКонтактныеЛица[ТекИндекс].НомерСтроки, "Партнер"),
				,
				Отказ);

			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	#Вставка
	//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
	//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
	Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаказКлиента") 
		И ЭтотОбъект.ПричинаВозникновения.смартОбязательноеУказаниеТоваров И ЭтотОбъект.смартТовары.Количество() = 0 Тогда
	//-- #Б2802 смарт: Шляпников 15.04.2025
		
		ТекстОшибки = НСтр("ru='Не заполнены товары'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"смартТовары",
			,
			Отказ);

	КонецЕсли;
	//-- #1844 смарт: Мосолов 10.06.2024 
	
	//++ #Б3202 смарт: Шляпников 24.06.2025 / Претензия клиента. Возврат товара.
	Если ЭтотОбъект.ПричинаВозникновения.смартТребуетсяВозвратТоваров Тогда
		ПроверяемыеРеквизиты.Добавить("ПартнерыИКонтактныеЛица.смартТелефонКонтактногоЛица");
	КонецЕсли;
	//-- #Б3202 смарт: Шляпников 24.06.2025
	#КонецВставки

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
	ПроверяемыеРеквизиты,
	МассивНепроверяемыхРеквизитов);

КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
//++ #Б-3374 смарт: Фролов 04.06.2025 //Претензия клиента. Уведомления.
Процедура смарт_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПретензияАктивна = (Не ПометкаУдаления) И ((Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована)
	Или (Статус = Перечисления.СтатусыПретензийКлиентов.Обрабатывается));

	Взаимодействия.УстановитьПризнакАктивен(Ссылка, ПретензияАктивна);
	
	#Вставка
	//++ #Б-3374 смарт: Фролов 04.06.2025 //Претензия клиента. Уведомления.
	Если ДополнительныеСвойства.ЭтоНовый Тогда
	
		ПользователиДляРассылок = Справочники.смартПредопределенныеЗначения.Настройки.ПолучателиРассылокОПретензияхКлиентов;
		
		Для Каждого СтрПользователиДляРассылок Из ПользователиДляРассылок Цикл
			
			НапоминанияПользователяСлужебный.смарт_ПодключитьПроизвольноеНапоминаниеПользователю(
				"Создана новая претензия клиента" + Символы.ПС 
				+ "Дата регистрации " + Ссылка.ДатаРегистрации + Символы.ПС
				+ "Код " + Ссылка.Код + Символы.ПС
				+ "Клиент " + Ссылка.Партнер + Символы.ПС
				+ "Оборудование " + Ссылка.Партнер + Символы.ПС
				+ "Наименование " + Ссылка.Наименование + Символы.ПС, 
				ТекущаяДата(), 60, Ссылка, "Создана новая претензия клиента", 
				СтрПользователиДляРассылок.Пользователь);
				
		КонецЦикла;
			
	КонецЕсли;
	//-- #Б-3374 смарт: Фролов 04.06.2025
	#КонецВставки

КонецПроцедуры //-- #Б-3374 смарт: Фролов 04.06.2025

#КонецОбласти
