#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает  элементы справочника по умолчанию.
//
Процедура СоздатьЭлементыСправочникаПоУмолчанию() Экспорт
	
	// Элемент "День рождения контактного лица".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("День рождения контактного лица", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='День рождения контактного лица';en='Birthday of the contact person'");
		НовыйЭлемент.РеквизитДопУпорядочивания	= 1; 
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "День рождения компании".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("День рождения компании", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='День рождения компании';en='Birthday of the company'");
		НовыйЭлемент.РеквизитДопУпорядочивания  = 3;
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Профессиональный праздник компании".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("Профессиональный праздник компании", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='Профессиональный праздник компании';en='Professional holiday of the company'");
		НовыйЭлемент.РеквизитДопУпорядочивания  = 4;
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Профессиональный праздник контактного лица".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("Профессиональный праздник контактного лица", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='Профессиональный праздник контактного лица';en='Professional holiday of the contact person'");
		НовыйЭлемент.РеквизитДопУпорядочивания  = 2;
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры // СоздатьЭлементыСправочникаПоУмолчанию()

#КонецОбласти

#КонецЕсли
