#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.смартASP_НакоплениеБонусов.Очистить();
	Движения.смартASP_НакоплениеБонусов.Записывать = Истина;

	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если смартСтатусРасчетаБонусов <> Перечисления.смартСтатусыДокументовРасчетаБонусов.РасчетЗавершен Тогда
		Возврат;
	КонецЕсли;	
	//--#1288 смарт: Лопато 26.12.2022
	
	Для Каждого ТекСтрокаНачислениеБонусов Из НачислениеБонусов Цикл
		Если ТекСтрокаНачислениеБонусов.СуммаКВыплате <> 0 Тогда
			Движение = Движения.смартASP_НакоплениеБонусов.Добавить();
			Движение.Период = Дата;
			Движение.ТипБонуса = Перечисления.смартASP_ТипыБонусов.ВыполнениеРемонтныхРабот;
			Движение.Инженер = ТекСтрокаНачислениеБонусов.Инженер;
			Движение.Сумма = ТекСтрокаНачислениеБонусов.СуммаКВыплате;
			Движение.Комментарий = ТекСтрокаНачислениеБонусов.ОписаниеНачисленияБонуса;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  	
	
	смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров  	

	смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	
КонецПроцедуры //--#1288 смарт: Лопато 29.12.2022

#КонецЕсли
