
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаОкончание") Тогда
		ДатаОкончание = Параметры.ДатаОкончание;
	КонецЕсли;
	
	Если Параметры.Свойство("ВремяОкончание") Тогда
		ВремяОкончание = Параметры.ВремяОкончание;
	КонецЕсли;
	
	Если Параметры.Свойство("ИспользоватьДатуИВремяВСрокахЗадач") Тогда
		ИспользоватьДатуИВремяВСрокахЗадач = Параметры.ИспользоватьДатуИВремяВСрокахЗадач;
	КонецЕсли;
	
	Элементы.ВремяОкончание.Видимость	= ИспользоватьДатуИВремяВСрокахЗадач;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВремяОкончаниеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияВыбранногоВремени", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, ВремяОкончание, Элемент,,, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура("ДатаОкончание,ВремяОкончание,Причина",ДатаОкончание,ВремяОкончание,Причина);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОповещенияВыбранногоВремени(ВыбранноеВремя, СтандартнаяОбработка) Экспорт
	Если ВыбранноеВремя <> Неопределено Тогда
		ВремяОкончание = ВыбранноеВремя.Значение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти