// ++ смарт Белоусова #468 15.03.2021

&После("ПриСозданииНаСервере")
Процедура НП_ПриСозданииНаСервере(Форма, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлемента" Тогда
		
		#Область ДобавлениеРеквизитовФормы
		// Массив для новых реквизитов
		ДобавляемыеРеквизиты	= Новый Массив;
		
		// Опишем ревизиты формы
		Реквизит_смартКлючевойКлиентПоРасходнымМатериалам = Новый РеквизитФормы("смартКлючевойКлиентПоРасходнымМатериалам",	Новый ОписаниеТипов("Булево"), "Ключевой клиент по расходным материалам");
		
		// Заполним массив после описания реквизитов формы
		ДобавляемыеРеквизиты.Добавить(Реквизит_смартКлючевойКлиентПоРасходнымМатериалам);
		
		// Добавим новые реквизиты в форму
		//Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		#КонецОбласти
		
		#Область ДобавлениеЭлементовФормы
		// Элементы
		ИмяГруппы = "ГруппаОтношения";
		ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
		Если ГруппаФормы <> Неопределено Тогда
			
			ИмяЭлемента = "смартКлючевойКлиентПоРасходнымМатериалам";
			Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
				ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
				ЭлементФормы.ПутьКДанным = "Объект.смартКлючевойКлиентПоРасходнымМатериалам";
				ЭлементФормы.положениезаголовка = ПоложениеЗаголовкаЭлементаФормы.право;
				//ЭлементФормы.Высота = 3;
			КонецЕсли;   
			
		КонецЕсли;
		#КонецОбласти
		
		#Область ЗаполнениеДанных
//		Форма.смартКлючевойКлиентПоРасходнымМатериалам = Форма.Объект.смартКлючевойКлиентПоРасходнымМатериалам;
		#КонецОбласти
		
	КонецЕсли;
	
КонецПроцедуры

// -- смарт Белусова #468 15.03.2021
