
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("СписокОбъектов") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СписокОбъектов = Параметры.СписокОбъектов;
	Если Параметры.Свойство("НомерТелефона") Тогда
		НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;	
	Если Параметры.Свойство("ТолькоКлиентыИКЛ") Тогда
		ТолькоКлиентыИКЛ = Параметры.ТолькоКлиентыИКЛ;
	КонецЕсли;			
	сфпСформироватьЗаголовокФормы(НЕ Параметры.Свойство("ПодборВИнтерес"));
	сфпСформироватьДеревоАбонентов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоАбонентов

&НаКлиенте
Процедура ДеревоАбонентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	Если ТекДанные.Недоступен Тогда
		ТекстСообщения = Нстр("ru='Данный контакт недоступен текущему пользователю!';en='This contact is not available to the current user!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Закрыть(ТекДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(,Нстр("ru='Не выбран контакт!';en='No contact selected!'"),5);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ПоказатьЗначение(,ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура сфпСформироватьДеревоАбонентов()
	ДеревоАбонентов.ПолучитьЭлементы().Очистить();
	Если СписокОбъектов.Количество() = 0 Тогда Возврат; КонецЕсли;
	КореньДерева = ДеревоАбонентов.ПолучитьЭлементы();
	КоличествоНедоступных = 0;
	Для Каждого ЭлементСписка Из СписокОбъектов Цикл
		СсылкаНаЭлемент = ЭлементСписка.Значение;
		Если Найти(СсылкаНаЭлемент, "Объект не найден") > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			Недоступен = Истина;
			КоличествоНедоступных = КоличествоНедоступных + 1;
		Иначе
			Недоступен = Ложь;
		КонецЕсли;
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Партнеры") 
		И СсылкаНаЭлемент.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда 
			МассивСвязанныхЛиц = РегистрыСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров.ПолучитьКонтактныеЛица(СсылкаНаЭлемент);
			Если МассивСвязанныхЛиц.Количество() > 0 Тогда
				ВеткаДерева 			= КореньДерева.Добавить();
				ВеткаДерева.Ссылка 		= СсылкаНаЭлемент;
				ВеткаДерева.Объект 		= Строка(СсылкаНаЭлемент) + Нстр("ru=' (партнер, ключевое физ. лицо)';en=' (partner, key person)'");
				ВеткаДерева.Недоступен 	= Недоступен;
				ВеткаКлиент = ВеткаДерева.ПолучитьЭлементы();
				Если ПривилегированныйРежим() Тогда
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
				Для Каждого ЭлементМассива Из МассивСвязанныхЛиц Цикл
					Если Найти(ЭлементМассива, "Объект не найден") > 0 Тогда
						УстановитьПривилегированныйРежим(Истина);
						Недоступен = Истина;
						КоличествоНедоступных = КоличествоНедоступных + 1;
					Иначе
						Недоступен = Ложь;
					КонецЕсли;
					ВладелецКонтакт = сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(ЭлементМассива);
					СтрокаКлиент = ВеткаКлиент.Добавить();
					СтрокаКлиент.Ссылка = ВладелецКонтакт;
					Если ВладелецКонтакт.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
						СтрокаКлиент.Объект = Строка(ВладелецКонтакт) + Нстр("ru=' (партнер, физ. лицо)';en=' (partner, individual)'");
					Иначе
						СтрокаКлиент.Объект = Строка(ВладелецКонтакт) + Нстр("ru=' (партнер, юр. лицо)';en=' (Partner, Legal Entity)'");
					КонецЕсли;
					МассивКонтактныхЛиц = сфпСофтФонПроСервер.сфпПолучитьВсехКонтактныхЛицПартнера(ВладелецКонтакт);
					Если ПривилегированныйРежим() Тогда
						УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли;
					СтрокаКлиент.Недоступен = Недоступен;
					ВеткаКонтакт = СтрокаКлиент.ПолучитьЭлементы();
					Для Каждого КонтактноеЛицо Из МассивКонтактныхЛиц Цикл
						Если Найти(КонтактноеЛицо, "Объект не найден") > 0 Тогда
							УстановитьПривилегированныйРежим(Истина);
							Недоступен = Истина;
							КоличествоНедоступных = КоличествоНедоступных + 1;
						Иначе
							Недоступен = Ложь;
						КонецЕсли;
						СтрокаКонтакт = ВеткаКонтакт.Добавить();
						СтрокаКонтакт.Ссылка = КонтактноеЛицо;
						СтрокаКонтакт.Объект = Строка(КонтактноеЛицо) + Нстр("ru=' (контактное лицо партнера)';en=' (contact person of partner)'");
						СтрокаКонтакт.Недоступен = Недоступен;
						Если ПривилегированныйРежим() Тогда
							УстановитьПривилегированныйРежим(Ложь);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;	
			Иначе
				ВеткаДерева 			= КореньДерева.Добавить();
				ВеткаДерева.Ссылка 		= СсылкаНаЭлемент;
				ВеткаДерева.Объект 		= Строка(СсылкаНаЭлемент) + Нстр("ru=' (партнер, физ. лицо)';en=' (partner, individual)'");
				ВеткаДерева.Недоступен 	= Недоступен;
			КонецЕсли;
		Иначе
			Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Пользователи") И НЕ ТолькоКлиентыИКЛ Тогда
				ВеткаДерева = КореньДерева.Добавить();
				ВеткаДерева.Ссылка = СсылкаНаЭлемент;
				ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru=' (пользователь)';en=' (user)'");
			ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Организации") И НЕ ТолькоКлиентыИКЛ Тогда
				ВеткаДерева = КореньДерева.Добавить();
				ВеткаДерева.Ссылка = СсылкаНаЭлемент;
				ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru=' (организация)';en=' (organization)'");
			ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Партнеры") Тогда
				ВеткаДерева = КореньДерева.Добавить();
				ВеткаДерева.Ссылка = СсылкаНаЭлемент;
				ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru=' (партнер, юр. лицо)';en=' (Partner, Legal Entity)'")
			ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") И НЕ ТолькоКлиентыИКЛ Тогда
				ВеткаДерева = КореньДерева.Добавить();
				ВеткаДерева.Ссылка = СсылкаНаЭлемент;
				ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru=' (потенциальный клиент)';en=' (potential customer)'");
			ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ФизическиеЛица") И НЕ ТолькоКлиентыИКЛ Тогда
				ВеткаДерева = КореньДерева.Добавить();
				ВеткаДерева.Ссылка = СсылкаНаЭлемент;
				ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru=' (физическое лицо)';en=' (individual)'");
			ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				CRM_ФизЛицо = РегистрыСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров.ПолучитьФизЛицо(СсылкаНаЭлемент);
				Если НЕ ЗначениеЗаполнено(CRM_ФизЛицо) Тогда
					ВеткаДерева = КореньДерева.Добавить();
					ВеткаДерева.Ссылка = СсылкаНаЭлемент;
					ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + " <" + Строка(сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(СсылкаНаЭлемент)) + ">" + Нстр("ru=' (контактное лицо партнера)';en=' (contact person of partner)'");
					ВеткаДерева.Недоступен 	= Недоступен;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЦикла;
	Если КоличествоНедоступных > 0 Тогда
		Элементы.ДекорацияНедоступен.Видимость = Истина;
	КонецЕсли;
	Если ДеревоАбонентов.ПолучитьЭлементы().Количество() = КоличествоНедоступных Тогда
		Элементы.ДекорацияНетКлиентов.Видимость = Истина;
		Элементы.ФормаОткрытьОбъект.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура сфпСформироватьЗаголовокФормы(ПодборНомера)
	Если ПодборНомера Тогда
		Заголовок = Нстр("ru='Выберите контакт для номера ';en='Select contact for number '") + НомерТелефона;
	Иначе
		Заголовок = Нстр("ru='Выберите связанный объект ';en='Choose related object '");
	КонецЕсли;		
КонецПроцедуры	

#КонецОбласти

