Функция ПолучитьМассивПоляПоиска() Экспорт	
	
	Возврат ДЛ_ДеловыеЛинии.МассивДвухЭлементов("code", "КодКЛАДР");
	
КонецФункции    

Функция ПолучитьСтруктуруПолейЗначений() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("name", "Наименование");	 
	Результат.Вставить("cityID", "ИДгорода");	 
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = ДЛ_ДеловыеЛинии.НоваяТаблицаПолейЗначений();
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Наименование", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "cityID", "ИДгорода", "Реквизит");	
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "terminals", "terminal", "Справочник", "ДЛ_Терминалы");	 
		
	Возврат Результат;
	
КонецФункции