
//++ смарт:ММ #001 137 01.12.2019
Функция ПолучитьПрефиксКонтрагентаПартнера(КонтрагентПартнер) Экспорт
	
	Префикс = "";
	
	Если НЕ ЗначениеЗаполнено(КонтрагентПартнер) Тогда
		Возврат Префикс;
	КонецЕсли;
	
	Если ТипЗнч(КонтрагентПартнер) <> Тип("СправочникСсылка.Контрагенты") 
		И ТипЗнч(КонтрагентПартнер) <> Тип("СправочникСсылка.Партнеры") Тогда
		Возврат Префикс;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтрагентыДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	|ГДЕ
	|	КонтрагентыДополнительныеРеквизиты.Свойство.Имя = ""ПрефиксКонтрагента""
	|	И КонтрагентыДополнительныеРеквизиты.Ссылка = &КонтрагентПартнер";
		
	Если ТипЗнч(КонтрагентПартнер) = Тип("СправочникСсылка.Партнеры") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Контрагенты", "Справочник.Партнеры");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПрефиксКонтрагента", "ПрефиксПартнера");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонтрагентПартнер", КонтрагентПартнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Префикс;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Значение;
	
КонецФункции //-- смарт:ММ 01.12.2019

//++ смарт:ММ #006 144 04.12.2019
Процедура НастроитьВидимостьЭлементовФормы(Форма) Экспорт
	
	// Видимость колонки смартНомерЗаявкиНаГарантийныйРемонт в табличной части Товары
	
	Если Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента"
		// ++ Вариант 1
		//ИЛИ Форма.ИмяФормы = "Документ.смартПоступлениеПоГарантии.Форма.ФормаДокумента"
		// -- Вариант 1
		ИЛИ Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаВнутреннееПотребление.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
		
		// Колонка смартНомерЗаявкиНаГарантийныйРемонт видима, только если она заполнена в ТЧ Товары	
		
		ИмяТЧ = "Товары";
		Если Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
			ИмяТЧ = "ТоварыПоРаспоряжениям";
		КонецЕсли;
		
		Если Форма.Объект[ИмяТЧ].Количество() <> 0 Тогда
						
			Запрос = Новый Запрос;
			//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ТаблицаТовары.смартНомерЗаявкиНаГарантийныйРемонт КАК смартНомерЗаявкиНаГарантийныйРемонт
			//|ПОМЕСТИТЬ ВТ
			//|ИЗ
			//|	&ТЧ КАК ТаблицаТовары				
			//|;
			//|ВЫБРАТЬ
			//|	ВТ.смартНомерЗаявкиНаГарантийныйРемонт
			//|ГДЕ				
			//|	ВТ.смартНомерЗаявкиНаГарантийныйРемонт <> """"";
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка КАК смартНомерЗаявкиНаГарантийныйРемонтСсылка
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&ТЧ КАК ТаблицаТовары				
			|;
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка
			|ГДЕ				
			|	ВТ.смартНомерЗаявкиНаГарантийныйРемонтСсылка <> ЗНАЧЕНИЕ(Документ.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка)";
			//-- #Б1132 смарт: Шляпников 14.10.2024
			
			Запрос.УстановитьПараметр("ТЧ", Форма.Объект[ИмяТЧ].Выгрузить());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				// Хотя бы в одной строке колонка заполнена
				//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
				//// ++ 25.02.2021
				//Если Форма.Элементы.Найти("ТоварысмартНомерЗаявкиНаГарантийныйРемонт") = Неопределено Тогда
				//// --
				//
				//	НовыйЭлемент = Форма.Элементы.Добавить("ТоварысмартНомерЗаявкиНаГарантийныйРемонт", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
				//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				//	НовыйЭлемент.ПутьКДанным = "Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонт";
				//	
				//	//++ смарт:ММ 25.10.2020
				//	Если Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
				//		Если НЕ РольДоступна("ПолныеПрава") Тогда
				//			НовыйЭлемент.ТолькоПросмотр = Истина;
				//			// ++ 07.11.2020
				//			Форма.Элементы.ЗаполнитьПоРаспоряжению.Доступность = Ложь;
				//			// --
				//		КонецЕсли;				
				//	КонецЕсли;
				//	//-- смарт:ММ 25.10.2020
				//
				//// ++ 25.02.2021
				//КонецЕсли;
				//// --  
				
				//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи
				// ПЕРЕНОС КОДА В ОТДЕЛЬНУЮ ПРОЦЕДУРУ
				//Если Форма.Элементы.Найти("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка") = Неопределено Тогда
				//	
				//	НовыйЭлемент = Форма.Элементы.Добавить("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
				//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				//	НовыйЭлемент.ПутьКДанным = "Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылка";

				//	//++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
				//	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
				//	//-- #Б-1434 смарт: Лопато 22.11.2024
				//	
				//	Если Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
				//		Если НЕ РольДоступна("ПолныеПрава") Тогда
				//			НовыйЭлемент.ТолькоПросмотр = Истина;
				//		КонецЕсли;
				//	КонецЕсли;
				//	
				//КонецЕсли;
				////-- #Б1132 смарт: Шляпников 14.10.2024
				//
				////++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
				//Если Форма.Элементы.Найти("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление") = Неопределено Тогда
				//	
				//	МассивРеквизитов = Новый Массив;
				//	
				//	НовыйРеквизитФормы = Новый РеквизитФормы("смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление", 
				//											 Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(50)), 
				//											 "Объект." + ИмяТЧ, 
				//											 "Представление заявки");
				//	
				//	МассивРеквизитов.Добавить(НовыйРеквизитФормы);

				//	Форма.ИзменитьРеквизиты(МассивРеквизитов); 
				//	
				//	НовыйЭлемент = Форма.Элементы.Добавить("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
				//	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
				//	НовыйЭлемент.ПутьКДанным = "Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление";
				//	НовыйЭлемент.Видимость 	 = Ложь;

				//	ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();

				//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
				//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка.Имя);

				//	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				//	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылка");
				//	ЭлементУсловия.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;
				//	ЭлементУсловия.Использование = Истина;

				//	ЭлементУО.Оформление.УстановитьЗначениеПараметра(
				//		"Текст", Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление"));
				//	
				//КонецЕсли;

				//ОбновитьПредставлениеЗаявокНаГарантийныйРемонт(Форма.Объект[ИмяТЧ]);
				////-- #Б-1434 смарт: Лопато 22.11.2024
				
				СоздатьЭлементыДляНомераЗаявкиНаГарантийныйРемонт(Форма, ИмяТЧ);
				//-- #5734 смарт: Тимофеева 18.02.26
			КонецЕсли;
		КонецЕсли;		
		
		//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи
		Если Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента"
			ИЛИ Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
			СоздатьЭлементыДляНомераЗаявкиНаГарантийныйРемонт(Форма, ИмяТЧ);
		КонецЕсли;
		//-- #5734 смарт: Тимофеева 18.02.26
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 04.12.2019

//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи
Процедура СоздатьЭлементыДляНомераЗаявкиНаГарантийныйРемонт(Форма, ИмяТЧ)

	Если Форма.Элементы.Найти("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка") = Неопределено Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылка";
		
		//++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		//-- #Б-1434 смарт: Лопато 22.11.2024
		
		Если Форма.ИмяФормы = "Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				НовыйЭлемент.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	//++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
	Если Форма.Элементы.Найти("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление") = Неопределено Тогда
		
		МассивРеквизитов = Новый Массив;
		
		НовыйРеквизитФормы = Новый РеквизитФормы("смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление", 
												Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(50)), 
												"Объект." + ИмяТЧ, 
												"Представление заявки");
		
		МассивРеквизитов.Добавить(НовыйРеквизитФормы);
		
		Форма.ИзменитьРеквизиты(МассивРеквизитов); 
		
		НовыйЭлемент = Форма.Элементы.Добавить("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
		НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление";
		НовыйЭлемент.Видимость 	 = Ложь;
		
		ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка.Имя);
		
		ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылка");
		ЭлементУсловия.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементУсловия.Использование = Истина;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(
			"Текст", Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление"));
		
	КонецЕсли;
	
	ОбновитьПредставлениеЗаявокНаГарантийныйРемонт(Форма.Объект[ИмяТЧ]);
	//-- #Б-1434 смарт: Лопато 22.11.2024	
	
КонецПроцедуры
//-- #5734 смарт: Тимофеева 18.02.26

//++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
Процедура ОбновитьПредставлениеЗаявокНаГарантийныйРемонт(ОбъектТовары) Экспорт

	МассивЗаявок = ОбъектТовары.Выгрузить(, "смартНомерЗаявкиНаГарантийныйРемонтСсылка").ВыгрузитьКолонку("смартНомерЗаявкиНаГарантийныйРемонтСсылка");
	
	СоответствиеЗаявок = СоответствияПредставленийЗаявокНаГарантийныйРемонт(МассивЗаявок);
	
	Для Каждого СтрокаТовары Из ОбъектТовары Цикл
		
		СтрокаТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылкаПредставление = СоответствиеЗаявок[СтрокаТовары.смартНомерЗаявкиНаГарантийныйРемонтСсылка];
		
	КонецЦикла;	

КонецПроцедуры //-- #Б-1434 смарт: Лопато 22.11.2024

//++ #Б-1434 смарт: Лопато 22.11.2024 //Изменить представление наименования ссылки на Заявку на гарантийный ремонт  
Функция СоответствияПредставленийЗаявокНаГарантийныйРемонт(МассивЗаявок) Экспорт

	СоответствиеЗаявок = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Ссылка,
		|	Номер КАК Номер,
		|	Дата КАК Дата
		|ИЗ
		|	Документ.смартЗаявкаНаГарантийныйРемонт
		|ГДЕ
		|	Ссылка В(&МассивЗаявок)";
	
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СоответствиеЗаявок.Вставить(Выборка.Ссылка,	СтрШаблон("%1 от %2", 
															  СокрЛП(Выборка.Номер), 
															  Формат(Выборка.Дата, "ДФ=dd.MM.yyyy")));
		
	КонецЦикла;
	
	Возврат СоответствиеЗаявок;

КонецФункции //-- #Б-1434 смарт: Лопато 22.11.2024

//++ смарт:ММ #008 136 08.12.2019
// Параметры:
//		Контрагенты - ссылка на контрагента либо массив контрагентов
// Возвращаемое значение:
// 		Соответствие, где ключ - контрагент, значение - массив из строк с названиями незаполненных реквизитов
Функция ПолучитьНезаполненныеРеквизитыКонтрагента(Контрагенты) Экспорт
	
	ИтоговоеСоответствиие = Новый Соответствие;
	//Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 01.09.2021 10:10:25 задача 552 исключение из проверки предопределенного контрагента, для Розничного покупателя
	Если НЕ ЗначениеЗаполнено(Контрагенты) или Контрагенты.Предопределенный Тогда
	//Смарт }Подкин Алексей Иванович 01.09.2021 10:10:25
		Возврат ИтоговоеСоответствиие;
	КонецЕсли;
	
	МассивКонтрагентов = Новый Массив;
	
	Если ТипЗнч(Контрагенты) = Тип("СправочникСсылка.Контрагенты") Тогда
		МассивКонтрагентов.Добавить(Контрагенты);
	ИначеЕсли ТипЗнч(Контрагенты) = Тип("Массив") Тогда
		МассивКонтрагентов = Контрагенты;
	Иначе
		Возврат ИтоговоеСоответствиие;
	КонецЕсли;
	
	Для Каждого Контрагент Из МассивКонтрагентов Цикл
		ИтоговоеСоответствиие.Вставить(Контрагент, Новый Массив);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрагентыСпр.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ВсеКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК КонтрагентыСпр
	|ГДЕ
	|	КонтрагентыСпр.Ссылка В(&МассивКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ВсеКонтрагенты.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ЕСТЬNULL(БанковскиеСчетаКонтрагентов.Ссылка, """")) КАК БанковскийСчет
	|ПОМЕСТИТЬ ВТ_БанковскиеСчетаКонтрагентов
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ПО (ВТ_ВсеКонтрагенты.Контрагент = (ВЫРАЗИТЬ(БанковскиеСчетаКонтрагентов.Владелец КАК Справочник.Контрагенты)))
	|			И (НЕ БанковскиеСчетаКонтрагентов.Закрыт)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеКонтрагенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ВсеКонтрагенты.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Представление, """")) КАК Представление
	|ПОМЕСТИТЬ ВТ_ДокументыУдостоверяющиеЛичность
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|				&КонецПериода,
	|				ЯвляетсяДокументомУдостоверяющимЛичность
	|					И ВЫРАЗИТЬ(Физлицо КАК Справочник.Контрагенты) В
	|						(ВЫБРАТЬ
	|							ВТ_ВсеКонтрагенты.Контрагент
	|						ИЗ
	|							ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|						ГДЕ
	|							ВТ_ВсеКонтрагенты.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо))) КАК ДокументыФизическихЛицСрезПоследних
	|		ПО (ВТ_ВсеКонтрагенты.Контрагент = (ВЫРАЗИТЬ(ДокументыФизическихЛицСрезПоследних.Физлицо КАК Справочник.Контрагенты)))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеКонтрагенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ВсеКонтрагенты.Контрагент КАК Контрагент,
	|	КонтрагентыФактическийАдрес.Вид КАК Вид,
	|	МАКСИМУМ(КонтрагентыФактическийАдрес.ДействуетС) КАК ДатаСвязи
	|ПОМЕСТИТЬ ВТ_ДатыСрезаАдресов
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыФактическийАдрес
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыФактическийАдрес.Ссылка
	|			И (КонтрагентыФактическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	КонтрагентыФактическийАдрес.ДействуетС <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрагентыФактическийАдрес.Вид,
	|	ВТ_ВсеКонтрагенты.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеКонтрагенты.Контрагент,
	|	КонтрагентыЮридическийАдрес.Вид,
	|	МАКСИМУМ(КонтрагентыЮридическийАдрес.ДействуетС)
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыЮридическийАдрес
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыЮридическийАдрес.Ссылка
	|			И (КонтрагентыЮридическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	КонтрагентыЮридическийАдрес.ДействуетС <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеКонтрагенты.Контрагент,
	|	КонтрагентыЮридическийАдрес.Вид
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГоловныеКонтрагенты.Ссылка,
	|	ГоловныеКонтрагентыФактическийАдрес.Вид,
	|	МАКСИМУМ(ГоловныеКонтрагентыФактическийАдрес.ДействуетС)
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСпр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ГоловныеКонтрагентыФактическийАдрес
	|				ПО ГоловныеКонтрагенты.ГоловнойКонтрагент = ГоловныеКонтрагентыФактическийАдрес.Ссылка
	|					И (ГоловныеКонтрагентыФактическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			ПО КонтрагентыСпр.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыСпр.Ссылка
	|ГДЕ
	|	КонтрагентыСпр.ОбособленноеПодразделение
	|	И ГоловныеКонтрагентыФактическийАдрес.ДействуетС <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ГоловныеКонтрагенты.Ссылка,
	|	ГоловныеКонтрагентыФактическийАдрес.Вид
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГоловныеКонтрагенты.Ссылка,
	|	ГоловныеКонтрагентыЮридическийАдрес.Вид,
	|	МАКСИМУМ(ГоловныеКонтрагентыЮридическийАдрес.ДействуетС)
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСпр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ГоловныеКонтрагентыЮридическийАдрес
	|				ПО ГоловныеКонтрагенты.ГоловнойКонтрагент = ГоловныеКонтрагентыЮридическийАдрес.Ссылка
	|					И (ГоловныеКонтрагентыЮридическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|			ПО КонтрагентыСпр.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыСпр.Ссылка
	|ГДЕ
	|	КонтрагентыСпр.ОбособленноеПодразделение
	|	И ГоловныеКонтрагентыЮридическийАдрес.ДействуетС <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ГоловныеКонтрагенты.Ссылка,
	|	ГоловныеКонтрагентыЮридическийАдрес.Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ВсеКонтрагенты.Контрагент КАК Контрагент,
	//++ смарт:ММ #071 351 09.09.2020 - Добавление реквизитов в проверку заполнения
	|	КонтрагентыСпр.смартГенеральныйДиректор,
	|	КонтрагентыСпр.смартБухгалтер,
	|	ЕСТЬNULL(КонтактныеЛицаПартнеровГенДирТелефон.Представление, """") КАК ТелефонГенДир,
	|	ЕСТЬNULL(КонтактныеЛицаПартнеровГенДирПочта.Представление, """") КАК ПочтаГенДир,
	|	ЕСТЬNULL(КонтактныеЛицаПартнеровБухТелефон.Представление, """") КАК ТелефонБухгалтер,
	|	ЕСТЬNULL(КонтактныеЛицаПартнеровБухПочта.Представление, """") КАК ПочтаБухгалтер,
	//-- смарт:ММ 09.09.2020
	|	ВЫБОР
	|		КОГДА КонтрагентыСпр.ОбособленноеПодразделение
	|			ТОГДА ""ОП""
	|		КОГДА КонтрагентыСпр.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""ЮЛ""
	|		КОГДА КонтрагентыСпр.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
	|			ТОГДА ""НеРезидент""
	|		КОГДА КонтрагентыСпр.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	|			ТОГДА ""ИП""
	|		КОГДА КонтрагентыСпр.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""ФЛ""
	|	КОНЕЦ КАК ВидКонтрагента,
	|	КонтрагентыСпр.ИНН КАК ИНН,
	|	КонтрагентыСпр.КПП КАК КПП,
	|	КонтрагентыСпр.НаименованиеПолное КАК НаименованиеПолное,
	|	КонтрагентыСпр.КодПоОКПО КАК КодПоОКПО,
	|	ЕСТЬNULL(КонтрагентыФактическийАдрес.Представление, """") КАК ФактическийАдрес,
	|	ЕСТЬNULL(КонтрагентыЮридическийАдрес.Представление, """") КАК ЮридическийАдрес,
	|	ЕСТЬNULL(КонтрагентыТелефон.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(КонтрагентыЭлектроннаяПочта.Представление, """") КАК ЭлектроннаяПочта,
	|	ЕСТЬNULL(ВТ_БанковскиеСчетаКонтрагентов.БанковскийСчет, """") КАК БанковскийСчет,
	|	ЕСТЬNULL(ГоловныеКонтрагенты.ИНН, """") КАК ИННГоловногоКонтрагента,
	|	ЕСТЬNULL(ГоловныеКонтрагенты.КПП, """") КАК КППГоловногоКонтрагента,
	|	ЕСТЬNULL(ГоловныеКонтрагентыФактическийАдрес.Представление, """") КАК ФактическийАдресГоловногоКонтрагента,
	|	ЕСТЬNULL(ГоловныеКонтрагентыЮридическийАдрес.Представление, """") КАК ЮридическийАдресГоловногоКонтрагента,
	|	ЕСТЬNULL(КонтрагентыСпр.СтранаРегистрации, """") КАК СтранаРегистрации,
	|	ЕСТЬNULL(КонтрагентыСпр.РегистрационныйНомер, """") КАК РегистрационныйНомер,
	|	ЕСТЬNULL(КонтрагентыСпр.НалоговыйНомер, """") КАК НалоговыйНомер,
	|	ЕСТЬNULL(ВТ_ДокументыУдостоверяющиеЛичность.Представление, """") КАК ПаспортныеДанные
	|ПОМЕСТИТЬ ВТ_ВсеДанныеКонтрагентов
	|ИЗ
	|	ВТ_ВсеКонтрагенты КАК ВТ_ВсеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСпр
	//++ смарт:ММ #071 351 09.09.2020 - Добавление реквизитов в проверку заполнения 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеровГенДир
	|		    	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровГенДирТелефон
	|		    	ПО КонтактныеЛицаПартнеровГенДир.Ссылка = КонтактныеЛицаПартнеровГенДирТелефон.Ссылка
	|		    		И КонтактныеЛицаПартнеровГенДирТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|		    		И КонтактныеЛицаПартнеровГенДирТелефон.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица))	
	|		        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровГенДирПочта
	|		    	ПО КонтактныеЛицаПартнеровГенДир.Ссылка = КонтактныеЛицаПартнеровГенДирПочта.Ссылка
	|		    		И КонтактныеЛицаПартнеровГенДирПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|		    		И КонтактныеЛицаПартнеровГенДирПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица)	
	|		     ПО КонтрагентыСпр.смартГенеральныйДиректор = КонтактныеЛицаПартнеровГенДир.Ссылка
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеровБух		
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровБухТелефон
	|		    	ПО КонтактныеЛицаПартнеровБух.Ссылка = КонтактныеЛицаПартнеровБухТелефон.Ссылка
	|		    		И КонтактныеЛицаПартнеровБухТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|		    		И КонтактныеЛицаПартнеровБухТелефон.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица))	
	|		        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровБухПочта
	|		    	ПО КонтактныеЛицаПартнеровБух.Ссылка = КонтактныеЛицаПартнеровБухПочта.Ссылка
	|		    		И КонтактныеЛицаПартнеровБухПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|		    		И КонтактныеЛицаПартнеровБухПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица)				
	|		    ПО КонтрагентыСпр.смартБухгалтер = КонтактныеЛицаПартнеровБух.Ссылка
	//-- смарт:ММ 09.09.2020
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСрезаАдресов КАК ВТ_ДатыСрезаАдресовФактическийАдресГоловныеКонтрагенты
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ГоловныеКонтрагентыФактическийАдрес
	|					ПО ВТ_ДатыСрезаАдресовФактическийАдресГоловныеКонтрагенты.Контрагент = ГоловныеКонтрагентыФактическийАдрес.Ссылка
	|						И ВТ_ДатыСрезаАдресовФактическийАдресГоловныеКонтрагенты.ДатаСвязи = ГоловныеКонтрагентыФактическийАдрес.ДействуетС
	|						И (ГоловныеКонтрагентыФактическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|						И (ГоловныеКонтрагентыФактическийАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				ПО ГоловныеКонтрагенты.Ссылка = ВТ_ДатыСрезаАдресовФактическийАдресГоловныеКонтрагенты.Контрагент
	|					И (ВТ_ДатыСрезаАдресовФактическийАдресГоловныеКонтрагенты.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСрезаАдресов КАК ВТ_ДатыСрезаАдресовЮридическийАдресГоловныеКонтрагенты
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ГоловныеКонтрагентыЮридическийАдрес
	|					ПО ВТ_ДатыСрезаАдресовЮридическийАдресГоловныеКонтрагенты.Контрагент = ГоловныеКонтрагентыЮридическийАдрес.Ссылка
	|						И ВТ_ДатыСрезаАдресовЮридическийАдресГоловныеКонтрагенты.ДатаСвязи = ГоловныеКонтрагентыЮридическийАдрес.ДействуетС
	|						И (ГоловныеКонтрагентыЮридическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|						И (ГоловныеКонтрагентыЮридическийАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				ПО ГоловныеКонтрагенты.Ссылка = ВТ_ДатыСрезаАдресовЮридическийАдресГоловныеКонтрагенты.Контрагент
	|					И (ВТ_ДатыСрезаАдресовЮридическийАдресГоловныеКонтрагенты.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			ПО КонтрагентыСпр.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка
	|				И (КонтрагентыСпр.ОбособленноеПодразделение)
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыСпр.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСрезаАдресов КАК ВТ_ДатыСрезаАдресовФактическийАдрес
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыФактическийАдрес
	|			ПО ВТ_ДатыСрезаАдресовФактическийАдрес.Контрагент = КонтрагентыФактическийАдрес.Ссылка
	|				И ВТ_ДатыСрезаАдресовФактическийАдрес.ДатаСвязи = КонтрагентыФактическийАдрес.ДействуетС
	|				И (КонтрагентыФактическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				И (КонтрагентыФактическийАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = ВТ_ДатыСрезаАдресовФактическийАдрес.Контрагент
	|			И (ВТ_ДатыСрезаАдресовФактическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСрезаАдресов КАК ВТ_ДатыСрезаАдресовЮридическийАдрес
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыЮридическийАдрес
	|			ПО ВТ_ДатыСрезаАдресовЮридическийАдрес.Контрагент = КонтрагентыЮридическийАдрес.Ссылка
	|				И ВТ_ДатыСрезаАдресовЮридическийАдрес.ДатаСвязи = КонтрагентыЮридическийАдрес.ДействуетС
	|				И (КонтрагентыЮридическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|				И (КонтрагентыЮридическийАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = ВТ_ДатыСрезаАдресовЮридическийАдрес.Контрагент
	|			И (ВТ_ДатыСрезаАдресовЮридическийАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыТелефон
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыТелефон.Ссылка
	|			И (КонтрагентыТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			И (КонтрагентыТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыЭлектроннаяПочта
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = КонтрагентыЭлектроннаяПочта.Ссылка
	|			И (КонтрагентыЭлектроннаяПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
	|			И (КонтрагентыЭлектроннаяПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанковскиеСчетаКонтрагентов КАК ВТ_БанковскиеСчетаКонтрагентов
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = ВТ_БанковскиеСчетаКонтрагентов.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыУдостоверяющиеЛичность КАК ВТ_ДокументыУдостоверяющиеЛичность
	|		ПО ВТ_ВсеКонтрагенты.Контрагент = ВТ_ДокументыУдостоверяющиеЛичность.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент КАК Контрагент,
	|	""Наименование Контрагента (юридическое)"" КАК Реквизит
	|ПОМЕСТИТЬ ВТ_НезаполненныеРеквизиты
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ФЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВТ_ВсеДанныеКонтрагентов.НаименованиеПолное = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""ИНН""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВТ_ВсеДанныеКонтрагентов.ИНН = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""КПП""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВТ_ВсеДанныеКонтрагентов.КПП = """"
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Код по ОКПО""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	И ВТ_ВсеДанныеКонтрагентов.КодПоОКПО = """"
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Фактический адрес""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	И ВТ_ВсеДанныеКонтрагентов.ФактическийАдрес = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Юридический адрес""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|				ТОГДА ИСТИНА
	// ++ смарт Белоусова #448 18.03.2021
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ИСТИНА
	// -- смарт Белоусова #448 18.03.2021
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВТ_ВсеДанныеКонтрагентов.ЮридическийАдрес = """"
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Телефон""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	И ВТ_ВсеДанныеКонтрагентов.Телефон = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""e-mail""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ФЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВТ_ВсеДанныеКонтрагентов.ЭлектроннаяПочта = """"
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Банковский счет""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	//|				ТОГДА ИСТИНА
	//|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|	И ВТ_ВсеДанныеКонтрагентов.БанковскийСчет = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""ИНН головного контрагента""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|	И ВТ_ВсеДанныеКонтрагентов.ИННГоловногоКонтрагента = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""КПП головного контрагента""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|	И ВТ_ВсеДанныеКонтрагентов.КППГоловногоКонтрагента = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Фактический адрес головного контрагента""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|	И ВТ_ВсеДанныеКонтрагентов.ФактическийАдресГоловногоКонтрагента = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Юридический адрес головного контрагента""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|	И ВТ_ВсеДанныеКонтрагентов.ЮридическийАдресГоловногоКонтрагента = """"
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Паспортные данные""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ФЛ""
	//|	И ВТ_ВсеДанныеКонтрагентов.ПаспортныеДанные = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Страна регистрации""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|	И ВТ_ВсеДанныеКонтрагентов.СтранаРегистрации = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Регистрационный номер в стране регистрации и/или налоговый номер в стране регистрации""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|	И ВТ_ВсеДанныеКонтрагентов.РегистрационныйНомер = """"
	|	И ВТ_ВсеДанныеКонтрагентов.НалоговыйНомер = """"
	//++ смарт:ММ #071 351 09.09.2020 - Добавление реквизитов в проверку заполнения 
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Генеральный директор""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВТ_ВсеДанныеКонтрагентов.смартГенеральныйДиректор = ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Бухгалтер""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ФЛ""
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И
	|	ВТ_ВсеДанныеКонтрагентов.смартБухгалтер = ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""Телефон генерального директора""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВТ_ВсеДанныеКонтрагентов.ТелефонГенДир = """"
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	//|	""E-mail генерального директора""
	//|ИЗ
	//|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	//|ГДЕ
	//|	ВТ_ВсеДанныеКонтрагентов.ПочтаГенДир = """"
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""Телефон бухгалтера""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ФЛ""
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И
	|	ВТ_ВсеДанныеКонтрагентов.ТелефонБухгалтер = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсеДанныеКонтрагентов.Контрагент,
	|	""E-mail бухгалтера""
	|ИЗ
	|	ВТ_ВсеДанныеКонтрагентов КАК ВТ_ВсеДанныеКонтрагентов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ЮЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ОП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ИП""
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""ФЛ""
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ВсеДанныеКонтрагентов.ВидКонтрагента = ""НеРезидент""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И
	|	ВТ_ВсеДанныеКонтрагентов.ПочтаБухгалтер = """"
	//-- смарт:ММ 09.09.2020
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НезаполненныеРеквизиты.Контрагент КАК Контрагент,
	|	ВТ_НезаполненныеРеквизиты.Реквизит КАК Реквизит
	|ИЗ
	|	ВТ_НезаполненныеРеквизиты КАК ВТ_НезаполненныеРеквизиты
	|ИТОГИ ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("КонецПериода", 		ТекущаяДата());
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ИтоговоеСоответствиие;
	КонецЕсли;
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
			
		Выборка = ВыборкаКонтрагент.Выбрать();
		
		МассивРеквизитов = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			МассивРеквизитов.Добавить(Выборка.Реквизит);
		КонецЦикла;
		
		ИтоговоеСоответствиие.Вставить(ВыборкаКонтрагент.Контрагент, МассивРеквизитов);

	КонецЦикла;
		
	Возврат ИтоговоеСоответствиие;
		
КонецФункции //-- смарт:ММ 08.12.2019

//++ смарт:ММ #010 137 05.01.2020
Функция РазбитьСтрокуНаПрефиксИНомер(Стр) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Префикс", "");
	СтруктураВозврата.Вставить("Номер", "");
	
	НомерПервогоЧисловогоСимвола = ПолучитьНомерПервогоЧисловогоСимвола(Стр);
	
	Если НомерПервогоЧисловогоСимвола > 0 Тогда
		
		Префикс = Лев(Стр, НомерПервогоЧисловогоСимвола - 1);
		СтруктураВозврата.Вставить("Префикс", Префикс);
		
		ВнешнийНомер = Прав(Стр, (СтрДлина(Стр) - НомерПервогоЧисловогоСимвола + 1));
		СтруктураВозврата.Вставить("Номер", ВнешнийНомер);
	Иначе //смарт:rnp 551 21.10.2021
		Префикс = Стр;
		СтруктураВозврата.Вставить("Префикс", Префикс);
	КонецЕсли;

	Возврат СтруктураВозврата;
	
КонецФункции //-- смарт:ММ 05.01.2020

//++ #Б-1176 смарт: Мосолов 25.10.2024 //Заявки на гарантийный ремонт. Запчасти. Отчет по возвратам  
Функция ПолучитьПрефиксИзНомера(Номер) Экспорт
	
	НомерПервогоЧисловогоСимвола = ПолучитьНомерПервогоЧисловогоСимвола(Номер);
	
	Если НомерПервогоЧисловогоСимвола > 0 Тогда
		
		Префикс = Лев(Номер, НомерПервогоЧисловогоСимвола - 1); 
		
	Иначе 
		
		Префикс = Номер;  
		
	КонецЕсли;

	Возврат Префикс;
	
КонецФункции //-- #Б-1176 смарт: Мосолов 25.10.2024

//++ смарт:ММ #010 137 05.01.2020
Функция ПолучитьНомерПервогоЧисловогоСимвола(Стр) Экспорт
	
	МассивЧисел = Новый Массив;
	МассивЧисел.Добавить("0");
	МассивЧисел.Добавить("1");
	МассивЧисел.Добавить("2");
	МассивЧисел.Добавить("3");
	МассивЧисел.Добавить("4");
	МассивЧисел.Добавить("5");
	МассивЧисел.Добавить("6");
	МассивЧисел.Добавить("7");
	МассивЧисел.Добавить("8");
	МассивЧисел.Добавить("9");
	
	Для Сч = 1 По СтрДлина(Стр) Цикл
		
		ТекСимвол = Сред(Стр, Сч, 1);
		
		Если МассивЧисел.Найти(ТекСимвол) <> Неопределено Тогда
			Возврат Сч;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат -1;
	
КонецФункции //-- смарт:ММ 05.01.2020

//++ смарт:ММ #010 137 07.01.2020
Функция ПолучитьСтрокуСоСтатусом(ДокОбъект, НомерПозиции, Статус) Экспорт
	
	СтрокаДокумента = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерПозиции", НомерПозиции);
	Отбор.Вставить("Статус", Статус);
	
	НайденныеСтроки = ДокОбъект.Статусы.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаДокумента = ДокОбъект.Статусы.Добавить();		
	Иначе
		СтрокаДокумента = НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат СтрокаДокумента;
	
КонецФункции //-- смарт:ММ 07.01.2020

//++ смарт:ММ #044 137 08.04.2020
Функция СформироватьПутьККаталогуГарантийныхЗапчастей(НомерОтправления, ДатаЗаявки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НомерОтправления)
		ИЛИ НЕ ЗначениеЗаполнено(ДатаЗаявки) Тогда
		Возврат "";
	КонецЕсли;
	
	Начало = Справочники.смартПредопределенныеЗначения.КаталогФайловПоЗаявкамНаГарантийныйРемонт.Значение;
	
	Если НЕ ЗначениеЗаполнено(Начало) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Прав(Начало, 1) <> "\" Тогда
		Начало = Начало + "\";
	КонецЕсли;
	
	Окончание = "" + Формат(Год(ДатаЗаявки), "ЧГ=") + "\" + НомерОтправления;
	
	Возврат (Начало + Окончание);

КонецФункции //-- смарт:ММ 08.04.2020

//++ #1929 смарт: Фролов 14.08.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
Функция ПолучитьссылкуНаВнешнююОбработку(ИмяОбъекта) Экспорт
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбъекта);	

КонецФункции //-- #1929 смарт: Фролов 14.08.2024

//++ #Б-1644 смарт: Фролов 12.12.2024 //Отображение состояния партнера в карточке партнера.
Функция ПолучитьДниВСклонении(КоличествоДней) Экспорт
	
	ДниВСклонении = "дней";
	
	Если КоличествоДней = 0 Тогда
		Возврат ДниВСклонении;
	КонецЕсли;	
	
	ДлинаЧисла = СтрДлина(КоличествоДней);
	ОдинСПрава = Прав(КоличествоДней, 1);
	ДваСПрава = Прав(КоличествоДней, 2);
	
	Если ДлинаЧисла = 1 И НЕ КоличествоДней = Неопределено Тогда     
		
		Если КоличествоДней = 1 Тогда 
			ДниВСклонении = "день";
		ИначеЕсли КоличествоДней = 2 ИЛИ КоличествоДней = 3 ИЛИ КоличествоДней = 4 Тогда  
			ДниВСклонении = "дня" 
		ИначеЕсли КоличествоДней = 5 ИЛИ КоличествоДней = 6 ИЛИ КоличествоДней = 7 ИЛИ КоличествоДней = 8
			ИЛИ КоличествоДней = 9 ИЛИ КоличествоДней = 0 Тогда  
			ДниВСклонении = "дней" 
		КонецЕсли;
		
	ИначеЕсли ДлинаЧисла > 1 Тогда
		
		Если ДваСПрава = "10" ИЛИ ДваСПрава = "11" ИЛИ ДваСПрава = "12" ИЛИ ДваСПрава = "13" ИЛИ ДваСПрава = "14" Тогда
			ДниВСклонении = "дней"   
		ИначеЕсли ОдинСПрава = "1" Тогда 
			ДниВСклонении = "день"     
		ИначеЕсли ОдинСПрава = "2" ИЛИ ОдинСПрава = "3" ИЛИ ОдинСПрава = "4" Тогда
			ДниВСклонении = "дня"  
		ИначеЕсли  ОдинСПрава = "5" ИЛИ ОдинСПрава = "6" ИЛИ ОдинСПрава = "7" ИЛИ ОдинСПрава = "8" 
			ИЛИ ОдинСПрава = "9" ИЛИ ОдинСПрава = "0" Тогда  
			ДниВСклонении = "дней";      
		КонецЕсли;
		
	КонеЦесли;
	
	Возврат ДниВСклонении;
	
КонецФункции //-- #Б-1644 смарт: Фролов 12.12.2024

//++ #Б-4120 смарт: Фролов 22.08.2025 //Указывать в Партнерах и Интересах, на против ответственных информацию о их отпусках
Функция смартОпределитьДатуОкончанияОтпуска(Ответственный) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Статус КАК Статус,
	|	До КАК До
	|ИЗ
	//++ #Б-7054 смарт: Фролов 01.06.2026 //Отпуска сотрудников на текущую дату
	//|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(, Пользователь = &Ответственный)");
	|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(&ТекущаяДата, Пользователь = &Ответственный)");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//-- #Б-7054 смарт: Фролов 01.06.2026
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Статус = Справочники.смартСтатусыСотрудников.ВОтпуске Тогда
			
			Возврат Выборка.До;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;	
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции

//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
Функция Строка2Число(Строка) Экспорт
	
	Определение = Новый ОписаниеТипов("Число");
	Возврат Определение.ПривестиЗначение(Строка);
	
КонецФункции

//++ #Б5448 смарт: Шляпников 23.01.2026 / Документ Заказ клиента. Установка тарифа доставки для приоритетных клиентов.
Функция ПолучитьМассивСегментовПартнера(Партнер) Экспорт
	
	МассивСегментов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СегментыПартнеров.Ссылка КАК Сегмент,
	|	СегментыПартнеров.СпособФормирования КАК СпособФормирования
	|ИЗ
	|	Справочник.СегментыПартнеров КАК СегментыПартнеров
	|ГДЕ
	|	НЕ СегментыПартнеров.ЭтоГруппа
	|	И НЕ СегментыПартнеров.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СегментыСервер.ВходитВСегмент(Партнер, Выборка.Сегмент,, Выборка.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьДинамически) Тогда
			МассивСегментов.Добавить(Выборка.Сегмент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСегментов;
	
КонецФункции

#Область ОтправкаОповещений

//++ смарт:ММ #023 200 23.02.2020
// Возвращаемое значение: массив из структур с полями Адрес, Представление
Функция смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой = "", АдресаПользователей = Истина) Экспорт
	
	Запрос = Новый Запрос;
	
	Если АдресаПользователей Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартПредопределенныеЗначения.Значение КАК Пользователь
		|ПОМЕСТИТЬ ВТ_СписокПользователей
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
		|ГДЕ
		|	смартПредопределенныеЗначения.Ссылка = &Ссылка
		|	И смартПредопределенныеЗначения.СписокЗначений = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	смартПредопределенныеЗначенияЗначения.Значение
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
		|ГДЕ
		|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
		|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПользователиСпр.смартРабочаяПочта КАК смартРабочаяПочта
		|ИЗ
		|	ВТ_СписокПользователей КАК ВТ_СписокПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиСпр
		|		ПО ВТ_СписокПользователей.Пользователь = ПользователиСпр.Ссылка
		|ГДЕ 
		|	ЕСТЬNULL(ПользователиСпр.смартРабочаяПочта, """") <> """"";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартПредопределенныеЗначения.Значение КАК смартРабочаяПочта
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
		|ГДЕ
		|	смартПредопределенныеЗначения.Ссылка = &Ссылка
		|	И смартПредопределенныеЗначения.СписокЗначений = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	смартПредопределенныеЗначенияЗначения.Значение
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
		|ГДЕ
		|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
		|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений = ИСТИНА";

	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаПредопределенноеЗначение);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- смарт:ММ 23.02.2020 

//++ #Б-6630 смарт: Фролов 28.05.2026 //Сделать механизм оповещений о новых Инцидентах.
//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.
//Функция смартПолучитьАдресаПолучателейУведомленийПоТипуПродукта(Квалификация, Ответственный, АдресаДляОтправкиСтрокой = "", Вариант) Экспорт
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	ПользователисмартОповещениеОбИнтересах.Ссылка.смартРабочаяПочта КАК смартРабочаяПочта
//	|ИЗ
//	|	Справочник.Пользователи.смартОповещениеОбИнтересах КАК ПользователисмартОповещениеОбИнтересах
//	|ГДЕ
//	|	ПользователисмартОповещениеОбИнтересах." + Вариант + "
//	|	И ПользователисмартОповещениеОбИнтересах.Подразделение В (&Подразделение)
//	|	И ВЫБОР
//	|			КОГДА &ТипПродукта = ЗНАЧЕНИЕ(Справочник.смартТипыПродуктов.Оборудование)
//	|				ТОГДА ПользователисмартОповещениеОбИнтересах.Оборудование
//	|			ИНАЧЕ ВЫБОР
//	|					КОГДА &ТипПродукта = ЗНАЧЕНИЕ(Справочник.смартТипыПродуктов.Запчасти)
//	|						ТОГДА ПользователисмартОповещениеОбИнтересах.Запчасти
//	|					ИНАЧЕ ВЫБОР
//	|							КОГДА &ТипПродукта = ЗНАЧЕНИЕ(Справочник.смартТипыПродуктов.Расходка)
//	|								ТОГДА ПользователисмартОповещениеОбИнтересах.РасходныеМатериалы
//	|							ИНАЧЕ ПользователисмартОповещениеОбИнтересах.Прочее
//	|						КОНЕЦ
//	|				КОНЕЦ
//	|		КОНЕЦ");

//	Запрос.УстановитьПараметр("ТипПродукта", Квалификация.ТипПродукта);
//	Запрос.УстановитьПараметр("Подразделение", Ответственный.Подразделение);
//	
//	МассивАдресов = Новый Массив;
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
//		
//		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
//			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
//			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
//		КонецЦикла;
//		
//	КонецЦикла;
//		
//	Возврат МассивАдресов;
//	
//КонецФункции //-- #Б-3858 смарт: Фролов 21.07.2025
//-- #Б-6630 смарт: Фролов 28.05.2026

//++ смарт:ММ #082 397 14.11.2020 - Заявка на ремонт
Функция ПолучитьАдресаПользователей(мПользователи, АдресаДляОтправкиСтрокой = "") Экспорт
	
	МассивАдресов = Новый Массив;
	
	ОтборПользователей = Новый Массив;
	Если ТипЗнч(мПользователи) = Тип("Массив") Тогда
		
		Для каждого стрПользователь Из мПользователи Цикл
			
			Если ТипЗнч(стрПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
				ОтборПользователей.Добавить(стрПользователь);
			ИначеЕсли ТипЗнч(стрПользователь) = Тип("Строка") Тогда
				МассивАдресов.Добавить(Новый Структура("Адрес,Представление", стрПользователь, стрПользователь));
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(мПользователи) = Тип("СправочникСсылка.Пользователи") Тогда
		ОтборПользователей.Добавить(мПользователи);
	Иначе
		Возврат МассивАдресов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиСпр.смартРабочаяПочта КАК смартРабочаяПочта
	|ИЗ
	|	Справочник.Пользователи КАК ПользователиСпр
	|ГДЕ 
	|	ПользователиСпр.Ссылка В (&Пользователи)
	|	И ПользователиСпр.смартРабочаяПочта <> """"";
	
	Запрос.УстановитьПараметр("Пользователи", ОтборПользователей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;

КонецФункции //-- смарт:ММ 14.11.2020

//++ смарт:ММ #023 200 23.02.2020
// ++ 21.11.2020
//Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные) Экспорт
//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
//Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные, МассивАдресовКопия = Неопределено) Экспорт	
//++ смарт:ММ 572 28.07.2021
//Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные, МассивАдресовКопия = Неопределено, ТестовыеАдресаМассив = Неопределено, ТестовыеАдресаСтрока = "", ЭтоТестоваяБаза = Истина, Важность = Неопределено, ФорматироватьТекст = Истина) Экспорт
//++ #1404 смарт: Фролов 27.07.2023 //контроль отслеживания поступлений и зависших запчастей по гарантии  
//Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные, МассивАдресовКопия = Неопределено, ТестовыеАдресаМассив = Неопределено, ТестовыеАдресаСтрока = "", ЭтоТестоваяБаза = Ложь, Важность = Неопределено, ФорматироватьТекст = Истина, ВыводитьПодписьНеТребуетОтвета = Истина) Экспорт
Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные, МассивАдресовКопия = Неопределено, ТестовыеАдресаМассив = Неопределено, ТестовыеАдресаСтрока = "", ЭтоТестоваяБаза = Ложь, Важность = Неопределено, ФорматироватьТекст = Истина, ВыводитьПодписьНеТребуетОтвета = Истина,ПредупреждениеОЗакрытойЗавке=Ложь) Экспорт	
//-- смарт:ММ 28.07.2021
//-- смарт:ММ 03.03.2021
// --
//-- #1404 смарт: Фролов 27.07.2023	
	ДанныеДляОтправки = Новый Структура;
	
	ДанныеДляОтправки.Вставить("Кому",	 	МассивАдресов);
	ДанныеДляОтправки.Вставить("Тема", 		Данные.Тема);
	//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
	Если НЕ ФорматироватьТекст Тогда
		ДанныеДляОтправки.Вставить("Тело", 	Данные.Заголовок);	
	Иначе
	//-- смарт:ММ 04.03.2021	

	//++ смарт:ММ 572 28.07.2021
	//ДанныеДляОтправки.Вставить("Тело", ПолучитьФорматированныйТекст(Данные));
	//++ #1404 смарт: Фролов 27.07.2023 //контроль отслеживания поступлений и зависших запчастей по гарантии  
	//ДанныеДляОтправки.Вставить("Тело", ПолучитьФорматированныйТекст(Данные, ВыводитьПодписьНеТребуетОтвета));  
	ДанныеДляОтправки.Вставить("Тело", ПолучитьФорматированныйТекст(Данные, ВыводитьПодписьНеТребуетОтвета,ПредупреждениеОЗакрытойЗавке));  
	//-- #1404 смарт: Фролов 27.07.2023	
	//-- смарт:ММ 28.07.2021
	
	//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
	КонецЕсли;
	//-- смарт:ММ 04.03.2021
	
	ДанныеДляОтправки.Вставить("ТипТекста",	ТипТекстаПочтовогоСообщения.HTML);
	//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
	//ДанныеДляОтправки.Вставить("Важность",	ВажностьИнтернетПочтовогоСообщения.Обычная);
	 
	Если НЕ ЗначениеЗаполнено(Важность) Тогда
		ВажностьСообщения = ВажностьИнтернетПочтовогоСообщения.Обычная;
	Иначе
		ВажностьСообщения = Важность;
	КонецЕсли;
	
	ДанныеДляОтправки.Вставить("Важность", ВажностьСообщения);
	//-- смарт:ММ 04.03.2021
	
	// ++ 21.11.2020
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если МассивАдресовКопия <> Неопределено Тогда
	Если МассивАдресовКопия <> Неопределено 
		И НЕ ЭтоТестоваяБаза Тогда
	//-- смарт:ММ 03.03.2021
		ДанныеДляОтправки.Вставить("Копии", МассивАдресовКопия);
	КонецЕсли;
	// --
			
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	ДанныеДляОтправки.Вставить("ТестовыеАдреса", "");
	ДанныеДляОтправки.Вставить("ТестоваяБаза", ЭтоТестоваяБаза);
	
	Если ЗначениеЗаполнено(ТестовыеАдресаМассив) 
		И ТестовыеАдресаМассив.Количество() > 0 Тогда
		
		ДанныеДляОтправки.Вставить("ТестовыеАдреса", ТестовыеАдресаСтрока);
		ДанныеДляОтправки.Вставить("Кому", ТестовыеАдресаМассив);	
	КонецЕсли;

	//++ смарт:ММ 572 11.08.2021
	Если Данные.Свойство("Вложения") Тогда
		ДанныеДляОтправки.Вставить("Вложения", Данные.Вложения);
	КонецЕсли;
	//-- смарт:ММ 11.08.2021
	
	////++ смарт:ММ #082 397 12.11.2020 - Заявка на ремонт
	//ДанныеДляОтправки.Вставить("ТестовыеАдреса", "");
	//ДанныеДляОтправки.Вставить("ТестоваяБаза", Ложь);
		
	//Если НЕ смартРабочаяБаза() Тогда
	//	
	//	МассивАдресов = Новый Массив;
	//	ТестовыеАдреса = "";
	//	
	//	//ТестовыеАдресаМассив = ПолучитьТестовыеАдресаДляРассылок(Истина);
	//	
	//	//Для Каждого Адрес Из ТестовыеАдресаМассив Цикл
	//	//	ТестовыеАдреса = ТестовыеАдреса + ?(ЗначениеЗаполнено(ТестовыеАдреса), ", ", "") + Адрес;			
	//	//	МассивАдресов.Добавить(Новый Структура("Адрес,Представление", Адрес, Адрес));
	//	//КонецЦикла;
	//	
	//	МассивАдресов = ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдреса);
	//	
	//	ДанныеДляОтправки.Вставить("Кому", МассивАдресов);
	//	ДанныеДляОтправки.Вставить("ТестовыеАдреса", ТестовыеАдреса);
	//	ДанныеДляОтправки.Вставить("ТестоваяБаза", Истина);
	//	// ++ 21.11.2020
	//	Если МассивАдресовКопия <> Неопределено Тогда
	//		//ДанныеДляОтправки.Удалить("Копии");
	//		ДанныеДляОтправки.Вставить("Копии", МассивАдресов);
	//	КонецЕсли;
	//	// --
	//КонецЕсли;
	////-- смарт:ММ 12.11.2020
	//-- смарт:ММ 03.03.2021
		
	Возврат ДанныеДляОтправки;
	
КонецФункции //-- смарт:ММ 23.02.2020

//++ смарт:ММ #023 200 23.02.2020
//++ смарт:ММ 572 28.07.2021
//Функция ПолучитьФорматированныйТекст(ДанныеОтправки)
Функция ПолучитьФорматированныйТекст(ДанныеОтправки, ВыводитьПодписьНеТребуетОтвета = Истина,ПредупреждениеОЗакрытойЗавке=Ложь)
//-- смарт:ММ 28.07.2021	
	Док = Новый ФорматированныйДокумент;
	
	мЗаголовок = Док.Добавить("Уведомление.", ТипЭлементаФорматированногоДокумента.Текст);
	мЗаголовок.Шрифт = Новый Шрифт("Arial", 16, Истина);
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	КоличествоЭлементов = Док.Элементы[0].Элементы.Количество();
	
	Абзац = Док.Добавить(ДанныеОтправки.Заголовок, ТипЭлементаФорматированногоДокумента.Текст);
	
	Для Сч = КоличествоЭлементов + 1 По Док.Элементы[0].Элементы.Количество() Цикл 
		Если ТипЗнч(Док.Элементы[0].Элементы[Сч-1]) = Тип("ТекстФорматированногоДокумента") Тогда 
			Док.Элементы[0].Элементы[Сч-1].Шрифт = Новый Шрифт("Arial", 12);
		КонецЕсли;
	КонецЦикла;
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	//++ #1404 смарт: Фролов 27.07.2023 //контроль отслеживания поступлений и зависших запчастей по гарантии  
	Если ПредупреждениеОЗакрытойЗавке ТОгда
		мПодвал = Док.Добавить("Внимание! Заявка на гарантийный ремонт ЗАКРЫТА.", ТипЭлементаФорматированногоДокумента.Текст);
		мПодвал.Шрифт = Новый Шрифт("Arial", 14, Истина); 
		мПодвал.ЦветТекста=WEBЦвета.Красный;
		
		Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
		Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	КонецЕсли;	
	//-- #1404 смарт: Фролов 27.07.2023
	//++ смарт:ММ 572 28.07.2021
	Если ВыводитьПодписьНеТребуетОтвета Тогда
	//-- смарт:ММ 28.07.2021
	
	Подпись = Док.Добавить("Письмо создано роботом и не требует ответа.", ТипЭлементаФорматированногоДокумента.Текст);
	
	Подпись.Шрифт = Новый Шрифт("Arial", 8);
	
	//++ смарт:ММ 572 28.07.2021
	КонецЕсли;
	//-- смарт:ММ 28.07.2021
	
	Возврат Док;
	
КонецФункции //-- смарт:ММ 23.02.2020

// ++ 21.11.2020
Функция ПолучитьАдресРуководителяПредставительства(Представительство, АдресаДляОтправкиСтрокой = "") Экспорт 
		
	Если НЕ ЗначениеЗаполнено(Представительство) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ПользователиДляОтправки.смартРабочаяПочта = """"
	|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|		ИНАЧЕ ПользователиДляОтправки.смартРабочаяПочта
	|	КОНЕЦ КАК Значение,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ВсеПриоритеты
	|ИЗ
	|	Справочник.Пользователи КАК ПользователиДляОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиДляОтправки.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
	|ГДЕ
	|	ПользователиДляОтправки.Ссылка = &смартРуководительСервисногоЦентра
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПользователиДляОтправки.смартРабочаяПочта = """"
	|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|		ИНАЧЕ ПользователиДляОтправки.смартРабочаяПочта
	|	КОНЕЦ КАК Значение,
	|	2 КАК Приоритет
	|ИЗ
	|	Справочник.Пользователи КАК ПользователиДляОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПользователиКонтактнаяИнформация.Ссылка = ПользователиДляОтправки.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
	|ГДЕ
	|	ПользователиДляОтправки.ФизическоеЛицо = &ФизическоеЛицо
	|   И ПользователиДляОтправки.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|;
	|ВЫБРАТЬ
	|  МИНИМУМ(ВТ.Приоритет) КАК МинимальныйПриоритет
	|ПОМЕСТИТЬ ВТ_МинимальныйПриоритет
	|ИЗ
	|  ВТ_ВсеПриоритеты КАК ВТ
	|;
	|
	|ВЫБРАТЬ
	|  ВТ_ВсеПриоритеты.Значение
	|ИЗ 
	|	ВТ_ВсеПриоритеты КАК ВТ_ВсеПриоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимальныйПриоритет КАК ВТ_МинимальныйПриоритет
	|		ПО ВТ_ВсеПриоритеты.Приоритет = ВТ_МинимальныйПриоритет.МинимальныйПриоритет";
	
	Запрос.УстановитьПараметр("ПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("ФизическоеЛицо", Представительство.ТекущийРуководитель);
	Запрос.УстановитьПараметр("смартРуководительСервисногоЦентра", Представительство.смартРуководительСервисногоЦентра);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции

//++ #1698 смарт: Фролов 28.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.
Функция смартПолучитьУчетнуюЗаписьЭППользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_УчетныеЗаписиЭлектроннойПочты.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК CRM_УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	CRM_УчетныеЗаписиЭлектроннойПочты.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УчетнаяЗапись;
	Иначе
		Возврат Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;	
		
КонецФункции //-- #1698 смарт: Фролов 28.03.2024	

//++ #1790 смарт: Фролов 23.04.2024 //Оповещение руководителей подразделений о неудачно завершенных Интересах их сотрудников по почте.
Функция ПолучитьАдресПользователяПоФизЛицу(ФизическоеЛицо, АдресаДляОтправкиСтрокой = "") Экспорт 
		
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ПользователиДляОтправки.смартРабочаяПочта = """"
	|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|		ИНАЧЕ ПользователиДляОтправки.смартРабочаяПочта
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	Справочник.Пользователи КАК ПользователиДляОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО (ПользователиКонтактнаяИнформация.Ссылка = ПользователиДляОтправки.Ссылка)
	|			И (ПользователиКонтактнаяИнформация.Вид = &ПочтаПользователя)
	|ГДЕ
	|	ПользователиДляОтправки.ФизическоеЛицо = &ФизическоеЛицо
	|	И ПользователиДляОтправки.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("ПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- #1790 смарт: Фролов 23.04.2024

//++ #1790 смарт: Фролов 25.04.2024 //Оповещение руководителей подразделений о неудачно завершенных Интересах их сотрудников по почте.
Функция ПолучитьАдресаПолучателейУведомленийПоКвалификации(Квалификация, АдресаДляОтправкиСтрокой = "") Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартКвалификацииМенеджеровПолучателиРассылок.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ПолучателиРассылок
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.ПолучателиРассылок КАК смартКвалификацииМенеджеровПолучателиРассылок
	|ГДЕ
	|	смартКвалификацииМенеджеровПолучателиРассылок.Ссылка = &Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ПолучателиРассылок.Пользователь.смартРабочаяПочта = """"
	|			ТОГДА ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """")
	|		ИНАЧЕ ПолучателиРассылок.Пользователь.смартРабочаяПочта
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	ПолучателиРассылок КАК ПолучателиРассылок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПолучателиРассылок.Пользователь = ПользователиКонтактнаяИнформация.Ссылка");
	
	Запрос.УстановитьПараметр("Квалификация", Квалификация);
	Запрос.УстановитьПараметр("ПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.Значение);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес, Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- #1790 смарт: Фролов 25.04.2024

//++ #Б-6630 смарт: Фролов 13.05.2026 //Сделать механизм оповещений о новых Инцидентах.
Функция ПолучитьПользователейПоНастройкамОбОповещениях(ОбъектОповещения, Подразделение, ТипПродукта, ЭтапИнтереса = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи.смартОповещениеОбИнтересах
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОбъектОповещения = ""Интересы""
	|				ТОГДА ВЫБОР
	|							КОГДА &Новые
	|								ТОГДА Новые
	|						КОНЕЦ
	|						ИЛИ ВЫБОР
	|							КОГДА &Квалификация
	|								ТОГДА Квалификация
	|						КОНЕЦ
	|						ИЛИ ВЫБОР
	|							КОГДА &Завершенные
	|								ТОГДА Завершенные
	|						КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Оборудование
	|				ТОГДА Оборудование
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Запчасти
	|				ТОГДА Запчасти
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &РасходныеМатериалы
	|				ТОГДА РасходныеМатериалы
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Прочее
	|				ТОГДА Прочее
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ОбъектОповещения = &ОбъектОповещения
	|	И (Подразделение = &Подразделение
	|			ИЛИ Подразделение = ""Все подразделения"")");
	Запрос.УстановитьПараметр("ОбъектОповещения", ОбъектОповещения);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Если ТипПродукта = Справочники.смартТипыПродуктов.Оборудование Тогда
		Запрос.УстановитьПараметр("Оборудование", Истина);
	Иначе
		Запрос.УстановитьПараметр("Оборудование", Ложь);
	КонецЕсли;
	
	Если ТипПродукта = Справочники.смартТипыПродуктов.Запчасти Тогда
		Запрос.УстановитьПараметр("Запчасти", Истина);
	Иначе
		Запрос.УстановитьПараметр("Запчасти", Ложь);
	КонецЕсли;	
	
	Если ТипПродукта = Справочники.смартТипыПродуктов.Расходка Тогда
		Запрос.УстановитьПараметр("РасходныеМатериалы", Истина);
	Иначе
		Запрос.УстановитьПараметр("РасходныеМатериалы", Ложь);
	КонецЕсли;	
	
	Если ТипПродукта = Справочники.смартТипыПродуктов.Прочее
		ИЛИ ТипПродукта = Справочники.смартТипыПродуктов.Неопределено Тогда
		Запрос.УстановитьПараметр("Прочее", Истина);
	Иначе
		Запрос.УстановитьПараметр("Прочее", Ложь);
	КонецЕсли;
	
	Если ЭтапИнтереса = "Новые" Тогда
		Запрос.УстановитьПараметр("Новые", Истина);
	Иначе
		Запрос.УстановитьПараметр("Новые", Ложь);
	КонецЕсли;

	Если ЭтапИнтереса = "Квалификация" Тогда
		Запрос.УстановитьПараметр("Квалификация", Истина);
	Иначе
		Запрос.УстановитьПараметр("Квалификация", Ложь);
	КонецЕсли;

	Если ЭтапИнтереса = "Завершенные" Тогда
		Запрос.УстановитьПараметр("Завершенные", Истина);
	Иначе
		Запрос.УстановитьПараметр("Завершенные", Ложь);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;	
	
КонецФункции //-- #Б-6630 смарт: Фролов 13.05.2026	

#КонецОбласти

#Область ПроеркаКоличестваВТоварах

//++ смарт:ММ #040 217 21.03.2020 - проверка рулонов
&НаСервере
Функция НоменклатураВРулонахПоХарактеристикам(Номенклатура) Экспорт

	НастройкаТоварРулоныХарактеристики = ПредопределенноеЗначение("Справочник.смартПредопределенныеЗначения.ВидНоменклатурыТоварРулоныХарактеристики");
	
	ВидНоменклатуры = НастройкаТоварРулоныХарактеристики.Значение;
	
	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварРулоныХарактеристики", Истина);
	КонецЕсли;
	
	Возврат Номенклатура.ВидНоменклатуры = ВидНоменклатуры;

КонецФункции //-- смарт:ММ 21.03.2020

#КонецОбласти

//++ смарт:ММ #054 301 19.06.2020 - Контрагенты с ЭДО
// В соответствии вернутся ТОЛЬКО ТЕ контрагенты, для которых есть записи в регистре сведений смартКонтрагентыСЭДО
&НаСервере
Функция ПолучитьЭДОКонтрагентов(МассивКонтрагентов = Неопределено, ВернутьТолькоКонтрагентов = Ложь) Экспорт
	
	СоответствиеВозврат = Новый Соответствие; // Контрагент - массив видов ЭДО
	МассивКонтрагентовВозврат = Новый Массив; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартКонтрагентыСЭДО.Контрагент КАК Контрагент,
	|	""1С ЭДО"" КАК ВидЭДО
	|ПОМЕСТИТЬ ВТ_Объединение
	|ИЗ
	|	РегистрСведений.смартКонтрагентыСЭДО КАК смартКонтрагентыСЭДО
	|ГДЕ
	|	смартКонтрагентыСЭДО.ЭДО1С
	|	И ВЫБОР
	|			КОГДА &ОтборКонтрагенты
	|				ТОГДА смартКонтрагентыСЭДО.Контрагент В (&МассивКонтрагентов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартКонтрагентыСЭДО.Контрагент,
	|	""Диадок""
	|ИЗ
	|	РегистрСведений.смартКонтрагентыСЭДО КАК смартКонтрагентыСЭДО
	|ГДЕ
	|	смартКонтрагентыСЭДО.Диадок
	|	И ВЫБОР
	|			КОГДА &ОтборКонтрагенты
	|				ТОГДА смартКонтрагентыСЭДО.Контрагент В (&МассивКонтрагентов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартКонтрагентыСЭДО.Контрагент,
	|	""СБИС""
	|ИЗ
	|	РегистрСведений.смартКонтрагентыСЭДО КАК смартКонтрагентыСЭДО
	|ГДЕ
	|	смартКонтрагентыСЭДО.СБИС
	|	И ВЫБОР
	|			КОГДА &ОтборКонтрагенты
	|				ТОГДА смартКонтрагентыСЭДО.Контрагент В (&МассивКонтрагентов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объединение.Контрагент КАК Контрагент,
	|	ВТ_Объединение.ВидЭДО КАК ВидЭДО
	|ИЗ
	|	ВТ_Объединение КАК ВТ_Объединение
	|ИТОГИ ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	Запрос.УстановитьПараметр("ОтборКонтрагенты", ?(ЗначениеЗаполнено(МассивКонтрагентов), Истина, Ложь));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоответствиеВозврат;
	КонецЕсли;
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		Контрагент = ВыборкаКонтрагент.Контрагент;
		
		Если МассивКонтрагентовВозврат.Найти(Контрагент) = Неопределено Тогда
			МассивКонтрагентовВозврат.Добавить(Контрагент);
		КонецЕсли;
		
		МассивВидовЭДОКонтрагента = Новый Массив;
		
		Выборка = ВыборкаКонтрагент.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивВидовЭДОКонтрагента.Добавить(Выборка.ВидЭДО);
		КонецЦикла;
		
		СоответствиеВозврат.Вставить(Контрагент, МассивВидовЭДОКонтрагента);
		
	КонецЦикла;
	
	Если ВернутьТолькоКонтрагентов Тогда
		Возврат МассивКонтрагентовВозврат;
	КонецЕсли;
	
	Возврат СоответствиеВозврат;
	
КонецФункции //-- смарт:ММ 19.06.2020

//++ смарт: #1438 Корбутов 04.09.2023 добавление выбора основного ЭДО контрагента 
// возвращает оператора ЭДО по умолчанию для контрагента
&НаСервере
Функция ПолучитьОсновнойЭДОКонтрагентов(МассивКонтрагентов = Неопределено) Экспорт
	
	СоответствиеВозврат = Новый Соответствие;
	Если Не ЗначениеЗаполнено(МассивКонтрагентов)
	Тогда 
		Возврат СоответствиеВозврат;
	Иначе 
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	смартКонтрагентыСЭДО.Контрагент КАК Контрагент,
	|	смартКонтрагентыСЭДО.ОператорЭДО КАК ОператорЭДО
	|ИЗ
	|	РегистрСведений.смартКонтрагентыСЭДО КАК смартКонтрагентыСЭДО
	|ГДЕ
	|	смартКонтрагентыСЭДО.Контрагент В(&МассивКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоответствиеВозврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() 
	Цикл
		СоответствиеВозврат.Вставить(Выборка.Контрагент, Выборка.ОператорЭДО);			
	КонецЦикла; 	
	Возврат СоответствиеВозврат;	
КонецФункции //-- смарт: #1438 Корбутов 04.09.2023

//++ смарт: #1438 Корбутов 04.09.2023 добавление выбора основного ЭДО контрагента
//пер. ЗначениеВыбора - Строка(4,0)
Процедура ЗаписатьВыборОсновногоЭДО(Контрагент,ЗначениеВыбора) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.смартКонтрагентыСЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0
	Тогда
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Контрагент = Контрагент;
		НовЗапись.ОператорЭДО = ЗначениеВыбора;
	Иначе
		НовЗапись = НаборЗаписей[0];
		НовЗапись.ОператорЭДО = ЗначениеВыбора;
	КонецЕсли;	
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры //-- смарт: #1438 Корбутов 04.09.2023

//++ смарт: #1438 Корбутов 04.09.2023 добавление выбора основного ЭДО контрагента 
//пер. Элемент - элемент формы
Процедура ЗаполнитьСписокВыбораЭДОНаСервере(Элемент) Экспорт
	//++ #5046 смарт: Тимофеева 27.11.2025 / Оператор ЭДО в карточке контрагента
	//Элемент.СписокВыбора.Добавить("1С  ","1С ЭДО");
	//Элемент.СписокВыбора.Добавить("Диад","Диадок");
	//Элемент.СписокВыбора.Добавить("СБИС","СБИС"); 
	Элемент.СписокВыбора.Добавить("1С  ","1С ЭДО (Калуга Астрал)");
	Элемент.СписокВыбора.Добавить("Диад","Диадок (Контур)");
	Элемент.СписокВыбора.Добавить("СБИС","СБИС (Тензор)");
	Элемент.СписокВыбора.Добавить("NO  ","Не работает в ЭДО");
	//-- #5046 смарт: Тимофеева 27.11.2025
КонецПроцедуры //-- смарт: #1438 Корбутов 04.09.2023

//++ смарт:ММ #054 301 23.07.2020 - Контрагенты с ЭДО 
// В соответствии вернутся только те контрагенты, для которых есть доп. сведение "id_ЭДО"
&НаСервере
Функция ПолучитьОператоровЭДОКонтрагентов(МассивКонтрагентов = Неопределено, ВернутьТолькоКонтрагентов = Ложь) Экспорт
	
	СоответствиеВозврат = Новый Соответствие; // Контрагент - Массив операторов
	МассивКонтрагентовВозврат = Новый Массив; // Для контрагентов, у которых есть операторы ЭДО
	
	Если НЕ ЗначениеЗаполнено(МассивКонтрагентов) И НЕ ВернутьТолькоКонтрагентов Тогда
		Возврат СоответствиеВозврат;
	КонецЕсли;	
	
	// 1. Получить идентификаторы ЭДО для контрагентов из РС ДополнительныеСведения
	// 2. По первым 3 символам идентификатора найти операторов ЭДО в РС ОператорыЭДО
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)), 1, 3) КАК КодОператора,
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, """") КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_КодыОператоров
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.Контрагенты)))
	|ГДЕ
	|	ДополнительныеСведения.Объект В(&МассивКонтрагентов)
	|	И ДополнительныеСведения.Свойство.Имя = &ИмяСвойства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_КодыОператоров.Контрагент КАК Контрагент,
	|	ВТ_КодыОператоров.КодОператора КАК КодОператора,
	|	ВТ_КодыОператоров.Идентификатор КАК ИдентификаторКонтрагента,
	|	ЕСТЬNULL(ОператорыЭДО.Представление, """") КАК Оператор
	|ИЗ
	|	ВТ_КодыОператоров КАК ВТ_КодыОператоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
	|		ПО ВТ_КодыОператоров.КодОператора = ОператорыЭДО.ИдентификаторОператора
	|ИТОГИ ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("ИмяСвойства", "id_ЭДО");
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
		
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		Контрагент = ВыборкаКонтрагент.Контрагент;
		
		МассивОператоров = Новый Массив;
		
		Выборка = ВыборкаКонтрагент.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.Оператор) Тогда
				Продолжить;
			КонецЕсли;
			
			МассивОператоров.Добавить(Выборка.Оператор);
		КонецЦикла;
		
		Если МассивКонтрагентовВозврат.Найти(Контрагент) = Неопределено Тогда
			МассивКонтрагентовВозврат.Добавить(Контрагент);
		КонецЕсли;
		
		СоответствиеВозврат.Вставить(ВыборкаКонтрагент.Контрагент, МассивОператоров);
		
	КонецЦикла;
	
	Если ВернутьТолькоКонтрагентов Тогда
		Возврат МассивКонтрагентовВозврат;
	КонецЕсли;
	
	Возврат СоответствиеВозврат;
	
КонецФункции //-- смарт:ММ 23.07.2020

//++ смарт:ММ #054 301 24.07.2020 - Контрагенты с ЭДО 
Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 24.07.2020

//++ смарт:ММ #072 311 14.09.2020 - Доработка подбора товаров
// Параметры: СсылкаНаПредопределенноеЗначение - ссылка или наименование предопределенного элемента
Функция ПолучитьСмартПредопределенноеЗначение(СсылкаНаПредопределенноеЗначение, ВернутьМассив = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначения.СписокЗначений = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений = ИСТИНА";
	
	// 05.06.2021
	УстановитьПривилегированныйРежим(Истина);

	Если ТипЗнч(СсылкаНаПредопределенноеЗначение) = Тип("Строка") Тогда
		Настройка = Справочники.смартПредопределенныеЗначения[СсылкаНаПредопределенноеЗначение];
		Запрос.УстановитьПараметр("Ссылка", Настройка);
	Иначе
	// --
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаПредопределенноеЗначение);
	КонецЕсли;
	
	Если ВернутьМассив Тогда
		Результат = Новый Массив;
	Иначе 
		Результат = Неопределено;
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	// ++ 02.03.2021
	УстановитьПривилегированныйРежим(Ложь);
	// --
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Массив = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");
	Если ВернутьМассив Тогда
		Результат = Массив;
	ИначеЕсли Массив.Количество() > 0 Тогда
		Результат = Массив[0];
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 14.09.2020

//++ смарт:rnp  #64 316 15.09.2020 перенесено из 1С Бухгалтерии 
//Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//  РаспределяемаяСумма - Число - сумма, которую надо распределить;
//  Коэффициенты - Массив - коэффициенты распределения;
//  Точность - Число - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае если распределить не удалось (сумма = 0, кол-во коэффициентов = 0,
//           или суммарный вес коэффициентов = 0), тогда возвращается значение Неопределено.
//
Функция смартРаспределитьПропорционально(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт 

	Если Коэффициенты.Количество() = 0 Или Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	РаспределеннаяСумма = 0;
	СуммаКоэффициентов  = 0;
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Коэффициент = Коэффициенты[Индекс];
		
		АбсолютноеЗначениеКоэффициента = ?(Коэффициент > 0, Коэффициент, -Коэффициент);
		Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
			МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(Коэффициенты.Количество());
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * Коэффициенты[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
	
	Дельта = РаспределяемаяСумма - РаспределеннаяСумма;
	//++ смарт:rnp  #64 316 24.09.2020 изменено условие
	//Если Дельта > 0 Тогда 
	Если Дельта <> 0 Тогда
		// Погрешности округления отнесем на коэффициент с максимальным весом.
		Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
			Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + Дельта;
		КонецЕсли;
		
	ИначеЕсли Дельта < 0 Тогда 
		
		// Если распределили больше чем положено, размазываем погрешность по ближайшим максимальным весам.
		ЗначениеПогрешности = 1 / Pow(10, Точность);
		КоличествоЭлементовПогрешности = -Дельта / ЗначениеПогрешности;
		
		КоэффициентыРешето = Новый Массив(Новый ФиксированныйМассив(Коэффициенты));
		
		Для Сч = 1 По КоличествоЭлементовПогрешности Цикл 
			МаксимальныйКоэффициент = МаксимальноеЗначениеВМассиве(КоэффициентыРешето);
			Индекс = КоэффициентыРешето.Найти(МаксимальныйКоэффициент);
			Результат[Индекс] = Результат[Индекс] - ЗначениеПогрешности;
			КоэффициентыРешето[Индекс] = 0;
		КонецЦикла;
		
	Иначе 
		// Если Дельта = 0, то все идеально.
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//++ смарт:ММ #082 397 12.11.2020 - Заявка на ремонт
Функция ПолучитьТестовыеАдресаДляРассылок(АдресаДляОтправкиСтрокой = "") Экспорт
	
	СсылкаНаПредопределенноеЗначение = Справочники.смартПредопределенныеЗначения.АдресДляТестовыхРассылок;
	
	Возврат смартПолучитьАдресаПолучателейУведомлений(СсылкаНаПредопределенноеЗначение, АдресаДляОтправкиСтрокой, Ложь);

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	смартПредопределенныеЗначения.Значение КАК Значение
	//|ИЗ
	//|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	//|ГДЕ
	//|	НЕ смартПредопределенныеЗначения.СписокЗначений
	//|	И НЕ смартПредопределенныеЗначения.ПометкаУдаления
	//|	И смартПредопределенныеЗначения.Ссылка = &Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	смартПредопределенныеЗначенияЗначения.Значение
	//|ИЗ
	//|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	//|ГДЕ
	//|	смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
	//|	И НЕ смартПредопределенныеЗначенияЗначения.Ссылка.ПометкаУдаления
	//|	И смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Справочники.смартПредопределенныеЗначения.АдресДляТестовыхРассылок);
	//
	//Если ВернутьМассив Тогда
	//	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	//Иначе
	//	Результат = "";
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Если Выборка.Следующий() Тогда
	//		// Первый попавшийся
	//		Результат = Выборка.Значение;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Возврат Результат;
	
КонецФункции //-- смарт:ММ 12.11.2020

//++ смарт:ММ #082 397 15.11.2020 - Заявка на ремонт
Функция СимволыПС() Экспорт
	Возврат Символы.ПС;
КонецФункции //-- смарт:ММ 15.11.2020

// Каратеев // 01.10.2020 // возвращает рабочая база или копия.
//
// в основном нужно для проверки перед рассылкой, чтобы из копий баз рассылки не уходили
//
Функция смартРабочаяБаза() Экспорт
		
	//++ смарт:ММ #098 464 02.03.2021 Доработка рассылок на тестовые адреса
	//СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();
	//Возврат СтрНайти(СтрокаСоединенияИнформационнойБазы, "Srvr=""sdb"";Ref=""smart""") = 1;
	
	НастройкаСервер = Справочники.смартПредопределенныеЗначения.РабочийСервер;
	НастройкаИмяБазы = Справочники.смартПредопределенныеЗначения.РабочаяБазаУТ;
	
	ИмяСервера = ПолучитьСмартПредопределенноеЗначение(НастройкаСервер, Ложь);
	ИмяБазы = ПолучитьСмартПредопределенноеЗначение(НастройкаИмяБазы, Ложь);
	
	Если ЗначениеЗаполнено(ИмяСервера) И ЗначениеЗаполнено(ИмяБазы) Тогда
		
		СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();
		
		СтрокаСоединенияРабочаяБаза = "Srvr=""" + ИмяСервера + """;Ref=""" + ИмяБазы + """;";
		Если ВРег(СтрокаСоединенияИнформационнойБазы) = ВРег(СтрокаСоединенияРабочаяБаза) Тогда
			Возврат Истина;
		КонецЕсли;
		
 	//++#1214 смарт: Лопато 13.10.2022 //Рефакторинг в связи с ошибками  
	Иначе		
		СохраненныеПараметрыБлокировки = БлокировкаРаботыСВнешнимиРесурсами.СохраненныеПараметрыБлокировки();		
		Если НЕ СохраненныеПараметрыБлокировки.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
			Возврат Истина;
		КонецЕсли;	
	//--#1214 смарт: Лопато 13.10.2022
	
	КонецЕсли;
	
	Возврат Ложь;
	//-- смарт:ММ 02.03.2021
	
КонецФункции // смартРабочаяБаза()

Функция МаксимальноеЗначениеВМассиве(Массив)
	
	// Рассчитываем, что на вход будет получен массив, в котором все элементы либо все положительные, либо отрицательные.
	// Поэтому для определения максимального значения сравниваем абсолютное значение элемента.
	//
	// В случае, если на вход получен массив, в котором элементы с разными знаками, то максимальное значение будет
	// определено не правильно. Но этот случай оставлен для совместимости с предыдущими версиями.
	
	МаксимальноеЗначение = 0;
	Множитель            = 1;
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		АбсолютноеЗначение = ?(Значение> 0, Значение, -Значение);
		Если МаксимальноеЗначение < АбсолютноеЗначение Тогда
			МаксимальноеЗначение = АбсолютноеЗначение;
			Множитель = ?(Значение > 0, 1, -1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение * Множитель;
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.10.2020 13:51:00  удаление из строки букв и спецсимволов
Функция УдаляемНечисла(НашаСтрокаДляРазбора) Экспорт
	ОбработаннаяСтрокаСтр = СокрЛП(НашаСтрокаДляРазбора);
	РезультатРаботы = ОбработаннаяСтрокаСтр;
	Для н=1 по СтрДлина(ОбработаннаяСтрокаСтр) Цикл
		ТекСимвол = Сред(ОбработаннаяСтрокаСтр,н,1);
		Если Найти("0123456789",ТекСимвол) = 0 Тогда
			РезультатРаботы = СтрЗаменить(РезультатРаботы,ТекСимвол,""); 
		КонецЕсли; 
	КонецЦикла; 
	Возврат РезультатРаботы;
КонецФункции
//Смарт }Подкин Алексей Иванович 01.10.2020 13:51:00

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 02.10.2020 10:02:57 Задача 365 поиск/ создание договора

Функция ПолучитьДоговор(Организация, Контрагент, ТипДоговора) Экспорт
	ЗапросДоговор = Новый Запрос;
	ЗапросДоговор.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
	|	И (ДоговорыКонтрагентов.ДатаНачалаДействия <= &ДатаТек
	|			ИЛИ ДоговорыКонтрагентов.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ДатаТек
	|			ИЛИ ДоговорыКонтрагентов.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1))";
	
	ЗапросДоговор.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросДоговор.УстановитьПараметр("Организация", Организация);
	ЗапросДоговор.УстановитьПараметр("ТипДоговора", ТипДоговора);
	ЗапросДоговор.УстановитьПараметр("ДатаТек", ТекущаяДатаСеанса());

	РезультатЗапроса = ЗапросДоговор.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	//Создадим договор
	НовыйДоговор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Наименование="Основной договор";
	НовыйДоговор.Статус=Перечисления.СтатусыДоговоровКонтрагентов.Действует;
	НовыйДоговор.ТипДоговора=ТипДоговора;
	НовыйДоговор.Организация=Организация;
	НовыйДоговор.Партнер=Контрагент.Партнер;
	НовыйДоговор.Контрагент=Контрагент;
	НовыйДоговор.ПорядокРасчетов=Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	НовыйДоговор.ПорядокОплаты=Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
	НовыйДоговор.ГруппаФинансовогоУчета=Справочники.смартПредопределенныеЗначения.ГруппаФинУчетаРасчетовДог.Значение;
	НовыйДоговор.СтатьяДвиженияДенежныхСредств=Справочники.смартПредопределенныеЗначения.СтатьяДДСДог.Значение;
	НовыйДоговор.НалогообложениеНДСОпределяетсяВДокументе=1;
	НовыйДоговор.ВалютаВзаиморасчетов=Константы.ВалютаРегламентированногоУчета.Получить();
	НовыйДоговор.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; //rnp 01.03.2021
	Попытка 
		НовыйДоговор.Записать();
		Возврат НовыйДоговор.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

//Смарт }Подкин Алексей Иванович 02.10.2020 10:02:57

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.10.2020 17:14:00
#Область ПолучениеСоответствияБитрикс
Функция  ПолучитьИзСоответствияБитрикс(ГуидПоиск) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СмартИдентификаторыСоответствияБитрикс.СсылкаМет КАК СсылкаМет
	|ИЗ
	|	РегистрСведений.СмартИдентификаторыСоответствияБитрикс КАК СмартИдентификаторыСоответствияБитрикс
	|ГДЕ
	|	СмартИдентификаторыСоответствияБитрикс.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", ГуидПоиск);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.СсылкаМет;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
#КонецОбласти

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 12.10.2020 11:34:38
Функция смартПолучитьЗонуДоставкиМосква() Экспорт
	
	Настройка = Справочники.смартПредопределенныеЗначения.ЗонаДоставкиМоскваМО;
	
	Если Настройка <> Неопределено Тогда
		Возврат Настройка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//Смарт }Подкин Алексей Иванович 12.10.2020 11:34:38

//++ смарт:ММ #082 397 26.12.2020 - Выгрузка при создании оборудования
//++ смарт:ММ 594 15.08.2021
//Функция ВыгрузитьОборудованиеВJSON(ОтправлятьНаЭлПочту = Истина) Экспорт
Функция ВыгрузитьОборудованиеВJSON(ОтправлятьНаЭлПочту = Истина, СохранятьНаFTP = Истина) Экспорт
//-- смарт:ММ 15.08.2021
	
	Успех = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+- смарт:Каратеев #981 18.04.2022 // Изменен запрос, чтобы выгружались товары из каталого 3-го уровня в каталог 2-го
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА смартОборудованиеКлиентов.Родитель = &ГруппаОборудование
	|			ТОГДА &ГруппаОборудование
	|		КОГДА смартОборудованиеКлиентов.Родитель = &ГруппаЧернила
	|			ТОГДА &ГруппаЧернила
	|		КОГДА РодительСпр.Родитель = &ГруппаОборудование
	|			ТОГДА &ГруппаОборудование
	|		КОГДА РодительСпр.Родитель = &ГруппаЧернила
	|			ТОГДА &ГруппаЧернила
	|		КОГДА РодительСпр.Родитель.Родитель = &ГруппаОборудование
	|			ТОГДА &ГруппаОборудование
	|		КОГДА РодительСпр.Родитель.Родитель = &ГруппаЧернила
	|			ТОГДА &ГруппаЧернила
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.смартОборудованиеКлиентов.ПустаяСсылка)
	|	КОНЕЦ КАК КорневойКаталог,
	|	ВЫБОР
	|		КОГДА смартОборудованиеКлиентов.Родитель.Родитель = &ГруппаОборудование
	|			ТОГДА смартОборудованиеКлиентов.Родитель
	|		КОГДА смартОборудованиеКлиентов.Родитель.Родитель = &ГруппаЧернила
	|			ТОГДА смартОборудованиеКлиентов.Родитель
	|		ИНАЧЕ смартОборудованиеКлиентов.Родитель.Родитель
	|	КОНЕЦ КАК Родитель,
	|	ВЫБОР
	|		КОГДА РодительСпр.Родитель = &ГруппаОборудование
	|			ТОГДА ЕСТЬNULL(РодительСпр.Наименование, """")
	|		КОГДА РодительСпр.Родитель = &ГруппаЧернила
	|			ТОГДА ЕСТЬNULL(РодительСпр.Наименование, """")
	|		ИНАЧЕ ЕСТЬNULL(РодительСпр.Родитель.Наименование, """")
	|	КОНЕЦ КАК РодительНаименование,
	|	смартОборудованиеКлиентов.Ссылка КАК Ссылка,
	|	смартОборудованиеКлиентов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.смартОборудованиеКлиентов КАК смартОборудованиеКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартОборудованиеКлиентов КАК РодительСпр
	|		ПО смартОборудованиеКлиентов.Родитель = РодительСпр.Ссылка
	|ГДЕ
	|	НЕ смартОборудованиеКлиентов.ПометкаУдаления
	|	И НЕ смартОборудованиеКлиентов.ЭтоГруппа
	|	И РодительСпр.ВыгружатьВЗаявкуНаРемонтныеРаботы
	|
	|УПОРЯДОЧИТЬ ПО
	//++ #Б-4874 смарт: Фролов 05.11.2025 //Доработка выгрузки справочника Оборудование клиентов на сайт Smart.help 
	//|	РодительСпр.ПорядокСортировкиДляВыгрузки,
	|	ВЫБОР
	|		КОГДА смартОборудованиеКлиентов.Родитель.ПорядокСортировкиДляВыгрузки = 0
	|			ТОГДА смартОборудованиеКлиентов.Родитель.Родитель.ПорядокСортировкиДляВыгрузки
	|		ИНАЧЕ смартОборудованиеКлиентов.Родитель.ПорядокСортировкиДляВыгрузки
	|	КОНЕЦ,
	//-- #Б-4874 смарт: Фролов 05.11.2025
	|	Наименование
	|ИТОГИ
	|	МАКСИМУМ(РодительНаименование)
	|ПО
	|	КорневойКаталог,
	|	Родитель";
	
	//++ смарт:ММ #094 411 07.02.2021
	//ГруппаОборудование = Справочники.смартОборудованиеКлиентов.НайтиПоНаименованию("ОБОРУДОВАНИЕ", Истина);
	//ГруппаЧернила = Справочники.смартОборудованиеКлиентов.НайтиПоНаименованию("ЧЕРНИЛА", Истина);
	ГруппаОборудование = Справочники.смартПредопределенныеЗначения.ОборудованиеГруппаОборудование.Значение;
	Если НЕ ЗначениеЗаполнено(ГруппаОборудование) Тогда
		ГруппаОборудование = Справочники.смартОборудованиеКлиентов.НайтиПоНаименованию("ОБОРУДОВАНИЕ", Истина);	
	КонецЕсли;
	
	ГруппаЧернила = Справочники.смартПредопределенныеЗначения.ОборудованиеГруппаЧернила.Значение;
	Если НЕ ЗначениеЗаполнено(ГруппаЧернила) Тогда
		ГруппаЧернила = Справочники.смартОборудованиеКлиентов.НайтиПоНаименованию("ЧЕРНИЛА", Истина);	
	КонецЕсли;
	//-- смарт:ММ 07.02.2021
	
	Запрос.УстановитьПараметр("ГруппаОборудование", ГруппаОборудование);
	Запрос.УстановитьПараметр("ГруппаЧернила", ГруппаЧернила);
	
	ВыборкаТип = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИмяВременногоФайлаОБОРУДОВАНИЕ = "hardware.json";
	ИмяВременногоФайлаЧЕРНИЛА = "inks.json";		
	
	Пока ВыборкаТип.Следующий() Цикл
		
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		Если ВыборкаТип.КорневойКаталог = ГруппаОборудование Тогда
			ИмяВременногоФайлаОБОРУДОВАНИЕ = КаталогВременныхФайлов + ИмяВременногоФайлаОБОРУДОВАНИЕ;
			ИмяФайла = ИмяВременногоФайлаОБОРУДОВАНИЕ;
		ИначеЕсли ВыборкаТип.КорневойКаталог = ГруппаЧернила Тогда
			ИмяВременногоФайлаЧЕРНИЛА = КаталогВременныхФайлов + ИмяВременногоФайлаЧЕРНИЛА;
			ИмяФайла = ИмяВременногоФайлаЧЕРНИЛА;
		Иначе
			Продолжить;
		КонецЕсли;			
		
		ВыборкаРодитель = ВыборкаТип.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		
		// ОТЛАДКА
		//ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписьJSON.ОткрытьФайл(ИмяФайла,,, ПараметрыЗаписиJSON);
		
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
				
		Пока ВыборкаРодитель.Следующий() Цикл
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта(); 

			ЗаписьJSON.ЗаписатьИмяСвойства("title");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаРодитель.РодительНаименование);
			//++ смарт: Белоусова 494 22.04.2021
			если ВыборкаРодитель.родитель.СмартНеИспользуетЧернила тогда
				ЗаписьJSON.ЗаписатьИмяСвойства("no_inks");
				ЗаписьJSON.ЗаписатьЗначение(ВыборкаРодитель.родитель.СмартНеИспользуетЧернила);
			КонецЕсли;
			//-- смарт: Белоусова 494 22.04.2021
			ЗаписьJSON.ЗаписатьИмяСвойства("items");
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			Выборка = ВыборкаРодитель.Выбрать(); 
			Сч = 1;
			Пока Выборка.Следующий() Цикл
				
				ЗаписьJSON.ЗаписатьИмяСвойства("id-" + Сч);
				ЗаписьJSON.ЗаписатьЗначение(СокрЛП(Выборка.Наименование));              
				Сч = Сч + 1;
			КонецЦикла;
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			ЗаписьJSON.ЗаписатьКонецОбъекта(); 
			
		КонецЦикла;
				
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		// ОТЛАДКА
		//СтрокаJSON = ЗаписьJSON.Закрыть();
		//сообщить(СтрокаJSON);	
		ЗаписьJSON.Закрыть();
		
	КонецЦикла;
	
	//++ смарт:ММ 594 15.08.2021
	Если СохранятьНаFTP Тогда
		
		АдресКаталога = ПолучитьСмартПредопределенноеЗначение("КаталогFTPДляОборудованияЧернил", Ложь);
		
		Если ЗначениеЗаполнено(АдресКаталога) Тогда
			
			ФайлОборудованиеСуществует = ФайлСуществует(ИмяВременногоФайлаОБОРУДОВАНИЕ);
			ФайлЧернилаСуществует = ФайлСуществует(ИмяВременногоФайлаЧЕРНИЛА);
			
			МассивВременныхФайлов = Новый Массив;
			
			Если ФайлОборудованиеСуществует Тогда
				СтруктураФайла = Новый Структура;
				СтруктураФайла.Вставить("ИмяФайла", "hardware.json");
				СтруктураФайла.Вставить("АдресФайла", ИмяВременногоФайлаОБОРУДОВАНИЕ);
				МассивВременныхФайлов.Добавить(СтруктураФайла);				
			КонецЕсли;
			
			Если ФайлЧернилаСуществует Тогда				
				СтруктураФайла = Новый Структура;
				СтруктураФайла.Вставить("ИмяФайла", "inks.json");
				СтруктураФайла.Вставить("АдресФайла", ИмяВременногоФайлаЧЕРНИЛА);
				МассивВременныхФайлов.Добавить(СтруктураФайла);
			КонецЕсли;
			
			Если МассивВременныхФайлов.Количество() > 0 Тогда
				СохранитьФайлыНаFTP(МассивВременныхФайлов, АдресКаталога);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//-- смарт:ММ 15.08.2021

	//++ #1193 смарт: Фролов 23.11.2022 //Исправить ошибки в журнале регистрации 
	//Если ОтправлятьНаЭлПочту Тогда
	//	Успех = ОтправитьФайлыОборудование(ИмяВременногоФайлаОБОРУДОВАНИЕ, ИмяВременногоФайлаЧЕРНИЛА);
	//КонецЕсли;
	//-- #1193 смарт: Фролов 23.11.2022
	
		
	Возврат Успех;
	
КонецФункции //-- смарт:ММ 26.12.2020

//++ смарт:ММ 594 15.08.2021
//	Параметры:
//		АдресКаталога - адрес каталога на FTP (не включая имя сервера)	
Процедура СохранитьФайлыНаFTP(МассивВременныхФайлов, АдресКаталога)
    
    //++ смарт:Подкин #986 19.04.2022 16:18:02
	Настройка = Справочники.смартПредопределенныеЗначения.АдресФТПсервера;
	ИмяСервера = ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь); 
    //-- смарт:Подкин #986 19.04.2022 16:18:02

	//ИмяСервера = "u483805.ftp.masterhost.ru";
	
	Соединение = ПодключитьсяКFTPСерверу(ИмяСервера);
	
	Если ТипЗнч(Соединение) <> Тип("FTPСоединение") Тогда
		ТекстСообщения = "Не удалось загрузить файлы на ftp: " + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("Сохранение файлов оборудования на ftp", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);

		Возврат;
	КонецЕсли;
	
	Соединение.УстановитьТекущийКаталог("/");
	
	АдресКаталога = СтрЗаменить(АдресКаталога, ИмяСервера, "");
	
	Если Лев(АдресКаталога, 1) <> "/" Тогда
		АдресКаталога = "/" + АдресКаталога;
	КонецЕсли;
	
	Если Прав(АдресКаталога, 1) <> "/" Тогда
		АдресКаталога = АдресКаталога + "/";
	КонецЕсли;
	
	Для Каждого СтруктураФайл Из МассивВременныхФайлов Цикл

		ИмяФайла = СтруктураФайл.ИмяФайла;
		АдресФайла = СтруктураФайл.АдресФайла;
		
		Попытка
			Соединение.Записать(
			        АдресФайла, // что записываем
			        АдресКаталога + ИмяФайла // куда записываем
    				);
			ТекстСообщения = "Файл " + ИмяФайла + " сохранен в каталог ftp: " + ИмяСервера + АдресКаталога;		
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЗаписьЖурналаРегистрации("Сохранение файлов оборудования на ftp", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		Исключение
			ТекстСообщения = "Не удалось загрузить файлы на ftp: " + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЗаписьЖурналаРегистрации("Сохранение файлов оборудования на ftp", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		КонецПопытки;
				
	КонецЦикла;

КонецПроцедуры //-- смарт:ММ 15.08.2021

//++ смарт:ММ 594 15.08.2021
Функция ПодключитьсяКFTPСерверу(ИмяСервера)
    
    //++ смарт:Подкин #986 19.04.2022 16:18:02
    НастройкаЛогин = Справочники.смартПредопределенныеЗначения.ЛогинФТПсервера;
    Логин = ПолучитьСмартПредопределенноеЗначение(НастройкаЛогин, Ложь);   
    
    НастройкаПароль = Справочники.смартПредопределенныеЗначения.ПарольФТПсервера;
    Пароль = ПолучитьСмартПредопределенноеЗначение(НастройкаПароль, Ложь); 
    
    Если Не ЗначениеЗаполнено(Логин) Или Не ЗначениеЗаполнено(Пароль) Тогда
        Возврат Неопределено;
    КонецЕсли;
    //-- смарт:Подкин #986 19.04.2022 16:18:02
    
    Соединение = Новый FTPСоединение(
        ИмяСервера, // адрес ftp сервера
        21, // порт сервера
        Логин, //"u483805"//"smartftpd", // имя пользователя
        Пароль, //"r5terietiessel", //"Wp4j63piI1WWzXh", // пароль пользователя
        Неопределено, // прокси не используется
        Истина, // пассивный режим работы
        0, // таймаут (0 - без ограничений)
        Неопределено // незащищенное соединение
    );
 
    // Для случаев, когда у ftp сервера нет возможности
    // обращаться к нам (мы находимся за межсетевым экраном)
    // следует использовать пассивный режим работы.
 
    Возврат Соединение;
 
КонецФункции //-- смарт:ММ 15.08.2021

//ВыгрузитьсмартРастровыеПроцессорыJSON

//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 
//Функция ВыгрузитьсмартРастровыеПроцессорыJSON(ОтправлятьНаЭлПочту = Истина) Экспорт
Функция ВыгрузитьсмартРастровыеПроцессорыJSON(ОтправлятьНаЭлПочту = Истина, СохранятьНаFTP = Истина) Экспорт
	
	Успех = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	смартРастровыеПроцессоры.Ссылка КАК Ссылка,
	|	смартРастровыеПроцессоры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.смартРастровыеПроцессоры КАК смартРастровыеПроцессоры
	|ГДЕ
	|	НЕ смартРастровыеПроцессоры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	рез = запрос.Выполнить().Выгрузить();
	
	ИмяВременногоФайлаРастровыеПроцессоры = "proc.json";		
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	ИмяВременногоФайлаРастровыеПроцессоры = КаталогВременныхФайлов + ИмяВременногоФайлаРастровыеПроцессоры;
	ИмяФайла = ИмяВременногоФайлаРастровыеПроцессоры;
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.ПС);
		
	ЗаписьJSON.ОткрытьФайл(ИмяФайла,,, ПараметрыЗаписиJSON);
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	//++ смарт:Белоусова  494 13.05.2021 исправление
	//ЗаписьJSON.ЗаписатьНачалоОбъекта();
	//сч = 1;
	для каждого эл из рез цикл			
		//если сч<рез.Количество() тогда
		//ЗаписьJSON.ЗаписатьЗначение(эл.Наименование + ",");
		////ЗаписьJSON.ЗаписатьКонецОбъекта();
		//иначе
		ЗаписьJSON.ЗаписатьЗначение(эл.Наименование );

		//КонецЕсли;
		//сч = сч + 1;	
	КонецЦикла;
	//ЗаписьJSON.ЗаписатьКонецОбъекта();
	//-- смарт:Белоусова  494 13.05.2021 исправление
	

	ЗаписьJSON.ЗаписатьКонецМассива();			
	ЗаписьJSON.Закрыть();
		
	//++ смарт:rnp 594 16.08.2021
	Если СохранятьНаFTP Тогда
		
		АдресКаталога = ПолучитьСмартПредопределенноеЗначение("КаталогFTPДляОборудованияЧернил", Ложь);
		
		Если ЗначениеЗаполнено(АдресКаталога) Тогда
			
			ФайлОборудованиеСуществует = ФайлСуществует(ИмяВременногоФайлаРастровыеПроцессоры);
			
			
			МассивВременныхФайлов = Новый Массив;
			
			Если ФайлОборудованиеСуществует Тогда
				СтруктураФайла = Новый Структура;
				СтруктураФайла.Вставить("ИмяФайла", "proc.json");
				СтруктураФайла.Вставить("АдресФайла", ИмяВременногоФайлаРастровыеПроцессоры);
				МассивВременныхФайлов.Добавить(СтруктураФайла);				
			КонецЕсли;
			
						
			Если МассивВременныхФайлов.Количество() > 0 Тогда
				СохранитьФайлыНаFTP(МассивВременныхФайлов, АдресКаталога);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//-- смарт:rnp 16.08.2021
	
	//++ #1193 смарт: Фролов 23.11.2022 //Исправить ошибки в журнале регистрации  
	//Если ОтправлятьНаЭлПочту Тогда
	//	Успех = ОтправитьФайлыРастровыеПроцессоры(ИмяВременногоФайлаРастровыеПроцессоры);
	//КонецЕсли;
	//-- #1193 смарт: Фролов 23.11.2022
	
	Возврат Успех;
	
КонецФункции 
//-- смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 

//ВыгрузитьсмартКонфигурацииЧернилJSON

//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 
//Функция ВыгрузитьсмартКонфигурацииЧернилJSON(ОтправлятьНаЭлПочту = Истина) Экспорт
Функция ВыгрузитьсмартКонфигурацииЧернилJSON(ОтправлятьНаЭлПочту = Истина, СохранятьНаFTP = Истина) Экспорт	
	Успех = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	смартКонфигурацииЧернил.Ссылка КАК Ссылка,
	|	смартКонфигурацииЧернил.Наименование КАК Наименование
	|ИЗ
	|	Справочник.смартКонфигурацииЧернил КАК смартКонфигурацииЧернил
	|ГДЕ
	|	НЕ смартКонфигурацииЧернил.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	рез = запрос.Выполнить().Выгрузить();
	
	ИмяВременногоФайлаКонфигурацииЧернил = "conf.json";		
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	ИмяВременногоФайлаКонфигурацииЧернил = КаталогВременныхФайлов + ИмяВременногоФайлаКонфигурацииЧернил;
	ИмяФайла = ИмяВременногоФайлаКонфигурацииЧернил;
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.ПС);
		
	ЗаписьJSON.ОткрытьФайл(ИмяФайла,,, ПараметрыЗаписиJSON);
	ЗаписьJSON.ЗаписатьНачалоМассива();
		
	//++ смарт:Белоусова  494 13.05.2021 исправление
	//ЗаписьJSON.ЗаписатьНачалоОбъекта();
	//сч = 1;
	для каждого эл из рез цикл			
		//если сч<рез.Количество() тогда
		//ЗаписьJSON.ЗаписатьЗначение(эл.Наименование + ",");
		////ЗаписьJSON.ЗаписатьКонецОбъекта();
		//иначе
		ЗаписьJSON.ЗаписатьЗначение(эл.Наименование );

		//КонецЕсли;
		//сч = сч + 1;	
	КонецЦикла;

	//ЗаписьJSON.ЗаписатьКонецОбъекта();
	//-- смарт:Белоусова  494 13.05.2021 исправление
	

	ЗаписьJSON.ЗаписатьКонецМассива();			
	ЗаписьJSON.Закрыть();
		
	//++ смарт:rnp 594 16.08.2021
	Если СохранятьНаFTP Тогда
		
		АдресКаталога = ПолучитьСмартПредопределенноеЗначение("КаталогFTPДляОборудованияЧернил", Ложь);
		
		Если ЗначениеЗаполнено(АдресКаталога) Тогда
			
			ФайлОборудованиеСуществует = ФайлСуществует(ИмяВременногоФайлаКонфигурацииЧернил);
			
			
			МассивВременныхФайлов = Новый Массив;
			
			Если ФайлОборудованиеСуществует Тогда
				СтруктураФайла = Новый Структура;
				СтруктураФайла.Вставить("ИмяФайла", "conf.json");
				СтруктураФайла.Вставить("АдресФайла", ИмяВременногоФайлаКонфигурацииЧернил);
				МассивВременныхФайлов.Добавить(СтруктураФайла);				
			КонецЕсли;
			
						
			Если МассивВременныхФайлов.Количество() > 0 Тогда
				СохранитьФайлыНаFTP(МассивВременныхФайлов, АдресКаталога);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//-- смарт:rnp 16.08.2021
	
	//++ #1193 смарт: Фролов 23.11.2022 //Исправить ошибки в журнале регистрации  
	//Если ОтправлятьНаЭлПочту Тогда
	//	Успех = ОтправитьФайлыКонфигурацииЧернил(ИмяВременногоФайлаКонфигурацииЧернил);
	//КонецЕсли;
	//-- #1193 смарт: Фролов 23.11.2022
	
	Возврат Успех;
	
КонецФункции 
//-- смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 



//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 
Функция ОтправитьФайлыРастровыеПроцессоры(ИмяВременногоФайлаРастровыеПроцессоры)
	
	Успех = Ложь;
	
	ИмяСобытияЖР = "ОтправкаФайловРастровыеПроцессорыJSON_смарт";
	ФайлРастровыеПроцессорыСуществует = ФайлСуществует(ИмяВременногоФайлаРастровыеПроцессоры);
	//ФайлЧернилаСуществует = ФайлСуществует(ИмяВременногоФайлаЧЕРНИЛА);
	Если НЕ ФайлРастровыеПроцессорыСуществует  Тогда
		ТекстСообщения = "Не найдены файлы для отправки";
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Успех;
	КонецЕсли;
	
	АдресаДляОтправкиСтрокой = "";
	СсылкаПредопределнноеЗначение = Справочники.смартПредопределенныеЗначения.АдресДляОтправкиВыгрузкиОборудования;	
	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаПредопределнноеЗначение,АдресаДляОтправкиСтрокой, Ложь);

	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если МассивАдресовДляОтправки.Количество() = 0 И НЕ ЭтоТестоваяБаза Тогда
		ТекстСообщения = "Не найдены получатели в справочнике ""Предопределенные значения (смарт)""";
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Успех;
	КонецЕсли;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);	
	//-- смарт:ММ 03.03.2021
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) 
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
		И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		//-- смарт:ММ 03.03.2021
		
		ТемаПисьма = "Выгрузка Растровых Процессоров из УТ";
		
		ТекстПисьма = "";
		
		Вложения = Новый Массив;
		
		Если ФайлРастровыеПроцессорыСуществует Тогда
			Вложение = Новый Структура;		
			Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайлаРастровыеПроцессоры);
			Вложение.Вставить("Представление", "РастровыеПроцессорыУТ.json");
		КонецЕсли;
		
		Вложения.Добавить(Вложение);
		
				
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		ПараметрыПисьма.Вставить("Вложения", Вложения);
		//ПараметрыПисьма.ТестовыеАдреса = "belousova@smart-t.ru";
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо с файлами Растровых Процессоров НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + "(в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено письмо с файлами Растровых Процессоров на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Успех = Истина;
		Исключение 
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			//ТекстСообщения = "Не удалось отправить письмо с файлами оборудования" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайлаРастровыеПроцессоры);
			
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции //-- смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 

//++ смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 
Функция ОтправитьФайлыКонфигурацииЧернил(ИмяВременногоФайлаКонфигурацииЧернил)
	
	Успех = Ложь;
	
	ИмяСобытияЖР = "ОтправкаФайловКонфигурацииЧернилJSON_смарт";
	ФайлРастровыеПроцессорыСуществует = ФайлСуществует(ИмяВременногоФайлаКонфигурацииЧернил);
	//ФайлЧернилаСуществует = ФайлСуществует(ИмяВременногоФайлаЧЕРНИЛА);
	Если НЕ ФайлРастровыеПроцессорыСуществует  Тогда
		ТекстСообщения = "Не найдены файлы для отправки";
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Успех;
	КонецЕсли;
	
	АдресаДляОтправкиСтрокой = "";
	СсылкаПредопределнноеЗначение = Справочники.смартПредопределенныеЗначения.АдресДляОтправкиВыгрузкиОборудования;	
	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаПредопределнноеЗначение,АдресаДляОтправкиСтрокой, Ложь);

	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если МассивАдресовДляОтправки.Количество() = 0 И НЕ ЭтоТестоваяБаза Тогда
		ТекстСообщения = "Не найдены получатели в справочнике ""Предопределенные значения (смарт)""";
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Успех;
	КонецЕсли;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);	
	//-- смарт:ММ 03.03.2021
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) 
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
		И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		//-- смарт:ММ 03.03.2021
		
		ТемаПисьма = "Выгрузка Конфигураций Чернил из УТ";
		
		ТекстПисьма = "";
		
		Вложения = Новый Массив;
		
		Если ФайлРастровыеПроцессорыСуществует Тогда
			Вложение = Новый Структура;		
			Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайлаКонфигурацииЧернил);
			Вложение.Вставить("Представление", "КонфигурацииЧернилУТ.json");
		КонецЕсли;
		
		Вложения.Добавить(Вложение);
		
				
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		ПараметрыПисьма.Вставить("Вложения", Вложения);
		//ПараметрыПисьма.ТестовыеАдреса = "belousova@smart-t.ru";
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо с файлами Конфигураций Чернил НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + "(в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено письмо с файлами Конфигураций Чернил на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Успех = Истина;
		Исключение 
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			//ТекстСообщения = "Не удалось отправить письмо с файлами оборудования" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайлаКонфигурацииЧернил);
			
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции //-- смарт:Белоусова  494 24.04.2021 - Выгрузка при создании эл справочника смартРастровыеПроцессоры 

//++ смарт:ММ #082 397 26.12.2020 - Выгрузка при создании оборудования
Функция ОтправитьФайлыОборудование(ИмяВременногоФайлаОБОРУДОВАНИЕ, ИмяВременногоФайлаЧЕРНИЛА)
	
	Успех = Ложь;
	
	ИмяСобытияЖР = "ОтправкаФайловОборудованиеJSON_смарт";
	ФайлОборудованиеСуществует = ФайлСуществует(ИмяВременногоФайлаОБОРУДОВАНИЕ);
	ФайлЧернилаСуществует = ФайлСуществует(ИмяВременногоФайлаЧЕРНИЛА);
	Если НЕ ФайлОборудованиеСуществует И НЕ ФайлЧернилаСуществует Тогда
		ТекстСообщения = "Не найдены файлы для отправки";
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Успех;
	КонецЕсли;
	
	АдресаДляОтправкиСтрокой = "";
	СсылкаПредопределнноеЗначение = Справочники.смартПредопределенныеЗначения.АдресДляОтправкиВыгрузкиОборудования;	
	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(СсылкаПредопределнноеЗначение, АдресаДляОтправкиСтрокой, Ложь);

	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если МассивАдресовДляОтправки.Количество() = 0 И НЕ ЭтоТестоваяБаза Тогда
		ТекстСообщения = "Не найдены получатели в справочнике ""Предопределенные значения (смарт)""";
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Успех;
	КонецЕсли;
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);	
	//-- смарт:ММ 03.03.2021
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) 
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//И (МассивАдресовДляОтправки.Количество() > 0 ИЛИ ЭтоТестоваяБаза) Тогда
		И (ТестовыеАдресаМассив.Количество() > 0
			ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		//-- смарт:ММ 03.03.2021
		
		ТемаПисьма = "Выгрузка оборудования из УТ";
		
		ТекстПисьма = "";
		
		Вложения = Новый Массив;
		
		Если ФайлОборудованиеСуществует Тогда
			Вложение = Новый Структура;		
			Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайлаОБОРУДОВАНИЕ);
			Вложение.Вставить("Представление", "ОборудованиеУТ.json");
		КонецЕсли;
		
		Вложения.Добавить(Вложение);
		
		Если ФайлЧернилаСуществует Тогда
			Вложение = Новый Структура;		
			Вложение.Вставить("АдресВоВременномХранилище", ИмяВременногоФайлаЧЕРНИЛА);
			Вложение.Вставить("Представление", "ЧернилаУТ.json");
		КонецЕсли;
		
		Вложения.Добавить(Вложение);
		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		ПараметрыПисьма.Вставить("Вложения", Вложения);
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено письмо с файлами оборудования НА ТЕСТОВУЮ ПОЧТУ " + ПараметрыПисьма.ТестовыеАдреса + "(в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";				
			Иначе
				ТекстСообщения = "Отправлено письмо с файлами оборудования на почту " +  АдресаДляОтправкиСтрокой;				
			КонецЕсли;
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Успех = Истина;
		Исключение 
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			ТекстСообщения = "Не удалось отправить письмо с файлами оборудования" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайлаОБОРУДОВАНИЕ);
			УдалитьФайлы(ИмяВременногоФайлаЧЕРНИЛА);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции //-- смарт:ММ 26.12.2020

//++ смарт:ММ #082 397 26.12.2020 - Выгрузка при создании оборудования
Функция ФайлСуществует(Знач ПутьКФайлу) Экспорт 
	
	Файл = Новый Файл(ПутьКФайлу); 	
	Возврат Файл.Существует(); 
	
КонецФункции //-- смарт:ММ 26.12.2020

//++ смарт:ММ #092 389 20.01.2021 - Конструктор оборудования
Процедура ЗавершитьБизнесПроцессИЗадачи(БП, Комментарий = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(БП) Тогда
		Возврат;
	КонецЕсли;
	
	//БизнесПроцессыИЗадачиВызовСервера.ОстановитьБизнесПроцесс(БП);
	
	Если НЕ БП.Завершен Тогда
		ОбъектБП = БП.ПолучитьОбъект();	
		ОбъектБП.Завершен = Истина;
		ОбъектБП.Комментарий = Комментарий;
		ОбъектБП.Записать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачаИсполнителя.Ссылка КАК Задача
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.Выполнена
	|	И ЗадачаИсполнителя.БизнесПроцесс = &БП
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("БП", БП);
	
	ВыборкаЗадача = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗадача.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаЗадача.Задача) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяЗадача = ВыборкаЗадача.Задача.ПолучитьОбъект();
		ТекущаяЗадача.ВыполнитьЗадачу();
		ТекущаяЗадача.Записать();
	КонецЦикла;			
	
КонецПроцедуры //-- смарт:ММ 20.01.2021

//++ смарт:ММ #082 397 12.02.2021 Заявка на ремонтные работы
Функция ПолучитьДатуИзСтроки(ДатаСтрока) Экспорт
	
	Если ТипЗнч(ДатаСтрока) = Тип("Дата") Тогда
		Возврат ДатаСтрока;
	КонецЕсли;
		
	ДатаИтог 	= Дата('0001.01.01');
	СтрокаГод 	= "";
	СтрокаМесяц = "";
	СтрокаДень 	= "";
	
	ДатаСтрока = СокрЛП(ДатаСтрока);

	Разделитель = ".";
		
	Если СтрНайти(ДатаСтрока, "/") <> 0 Тогда
		Разделитель = "/";
	ИначеЕсли СтрНайти(ДатаСтрока, "-") <> 0 Тогда
		Разделитель = "-";
	КонецЕсли;
	
	Если СтрДлина(ДатаСтрока) = 10 Тогда  // 01012010 или 20100101

		НомерПервогоСимволаНеЧисло = СтрНайти(ДатаСтрока, Разделитель);
		
		Если НомерПервогоСимволаНеЧисло = 3 Тогда // 01.01.2010, 01-01-2021
			СтрокаГод 	= Прав(ДатаСтрока, 4);
			СтрокаМесяц = Сред(ДатаСтрока, 4, 2);
			СтрокаДень 	= Лев(ДатаСтрока, 2);			
		ИначеЕсли НомерПервогоСимволаНеЧисло = 5 Тогда // 2010.01.01, 2021-01-01
			СтрокаГод 	= Лев(ДатаСтрока, 4);
			СтрокаМесяц = Сред(ДатаСтрока, 6, 2);
			СтрокаДень 	= Прав(ДатаСтрока, 2);
		Иначе
			Возврат ДатаИтог;
		КонецЕсли;
		
	ИначеЕсли СтрДлина(ДатаСтрока) = 8 Тогда // 01.01.10, 01-01-20
		
		СтрокаГод 	= "20" + Прав(ДатаСтрока, 2);
		СтрокаМесяц = Сред(ДатаСтрока, 4, 2);
		СтрокаДень 	= Лев(ДатаСтрока, 2);
		
	ИначеЕсли СтрДлина(ДатаСтрока) = 18 ИЛИ СтрДлина(ДатаСтрока) = 19 Тогда // 01.01.2010 0:00:00 или 01.01.2010 14:00:00
		
		СтрокаГод 	= Сред(ДатаСтрока, 7, 4);
		СтрокаМесяц = Сред(ДатаСтрока, 4, 2);
		СтрокаДень 	= Лев(ДатаСтрока, 2);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СтрокаГод) Тогда
		Попытка
			ДатаСтрокаИтог = "" + СтрокаГод + СтрокаМесяц + СтрокаДень;
			ОписаниеТипа = Новый ОписаниеТипов("Дата");
			ДатаИтог = ОписаниеТипа.ПривестиЗначение(ДатаСтрокаИтог);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат ДатаИтог;
	
КонецФункции //-- смарт:ММ 12.02.2021

//++ смарт:ММ #082 397 13.02.2021 Заявка на ремонтные работы
Функция ЭтоПлоттер(Оборудование) Экспорт
	
	ТоварыПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	
	Возврат Оборудование.ВидНоменклатуры = ТоварыПлоттерыСерии;
	
КонецФункции //-- смарт:ММ 13.02.2021

//++ смарт:ММ #044 224 23.02.2021 - Заявка на гарантийный ремонт 
Функция ПолучитьСкладПодЗаказ() Экспорт
	
	Настройка = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ;
	
	Возврат ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
	
КонецФункции //-- смарт:ММ 23.02.2021

//++ смарт:ММ #044 224 25.02.2021 - Заявка на гарантийный ремонт 
Процедура ПроверитьОстаткиНаСкладеГарантийныхЗапчастей(ДатаОстатков, МассивСтруктур, ОткрытьФормуПодбор, Регистратор = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	ВТ.Номенклатура,
	|	ВТ.Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ВТ
	|;
	|/////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.Номенклатура КАК Номенклатура,
	|	смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.НомерЗаявки КАК НомерЗаявки,
	//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
	|	смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.Заявка КАК Заявка,
	//-- #Б1132 смарт: Шляпников 14.10.2024
	|	смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.смартОстаткиНаСкладеГарантийныхЗапчастей.Остатки(&ДатаДокумента, Номенклатура В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ КАК ВТ)) КАК смартОстаткиНаСкладеГарантийныхЗапчастейОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ВТ.Номенклатура = смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.Номенклатура
	|			И  ВТ.Количество <= смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.КоличествоОстаток
	|ГДЕ
	|	смартОстаткиНаСкладеГарантийныхЗапчастейОстатки.КоличествоОстаток > 0";
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого ТекущаяСтрока Из МассивСтруктур Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаОстатков);
	
	// ++ 18.03.2021
	Если ЗначениеЗаполнено(Регистратор) Тогда
		Запрос.УстановитьПараметр("ДатаДокумента", Новый Граница(Новый МоментВремени(Регистратор.Дата, Регистратор), ВидГраницы.Исключая));
	КонецЕсли;
	// --
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого ТекущаяСтрока Из МассивСтруктур Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		
		Выборка.Сбросить();
		
		Список = Новый СписокЗначений;
		Сч = 0;
		
		//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
		Заявка = Неопределено;
		//-- #Б1132 смарт: Шляпников 01.11.2024
		
		Пока Выборка.НайтиСледующий(Отбор) Цикл
			
			Сч = Сч + 1;
			
			Если ЗначениеЗаполнено(Выборка.НомерЗаявки) Тогда
				НомерЗаявки = Выборка.НомерЗаявки;
			Иначе
				НомерЗаявки = "Без номера";
			КонецЕсли;
			
			//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
			Если ЗначениеЗаполнено(Выборка.Заявка) Тогда
				Заявка = Выборка.Заявка;
			КонецЕсли;
			
			Список.Добавить(Выборка.Заявка, НомерЗаявки);
			//-- #Б1132 смарт: Шляпников 01.11.2024
			
		КонецЦикла;
		
		ТекущаяСтрока.СписокНомеров = Список;
		
		Если Сч = 1 Тогда
			ТекущаяСтрока.НомерЗаявки = НомерЗаявки;
			//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
			ТекущаяСтрока.Заявка = Заявка;
			//-- #Б1132 смарт: Шляпников 01.11.2024
		КонецЕсли;
		
		Если Сч <> 1 Тогда
			ОткрытьФормуПодбор = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры //-- смарт:ММ 23.02.2021

Функция НайтиДоговор(Организация,Партнер,Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК Валюта
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности > 0
	|   И ДоговорыКонтрагентов.ДатаНачалаДействия <= &ДатаТек
	|	И ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ДатаТек
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Партнер = &Партнер
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("ДатаТек", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьИндСоглашение(Организация,Партнер,Контрагент,Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоглашенияСКлиентами.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.Организация = &Организация
	|	И СоглашенияСКлиентами.Партнер = &Партнер
	|	И СоглашенияСКлиентами.Контрагент = &Контрагент
	|	И (СоглашенияСКлиентами.ДатаНачалаДействия <= &ДатаТек
	|			ИЛИ СоглашенияСКлиентами.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И (СоглашенияСКлиентами.ДатаОкончанияДействия >= &ДатаТек
	|			ИЛИ СоглашенияСКлиентами.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|	И СоглашенияСКлиентами.Валюта = &Валюта
	|	И СоглашенияСКлиентами.ИспользуютсяДоговорыКонтрагентов";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ДатаТек", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	//Запрос.УстановитьПараметр("ПустоеЗначение", пустаяда);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Смарт Подкин Алексей Иванович 25.11.2020 рассылка отчета взаиморасчеты по резуальтатам проведения документов Взаиморасчеты задолженности, Списание задолженности
Процедура смарт_ПроведениеВзаиморасчетыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ДополнительныеСвойства.Свойство("ОтложенноеПроведение") Тогда	
		ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартОбщегоНазначения.ОповещениеВзаиморасчеты",Новый Структура("Источник",Источник.Ссылка),ПараметрыВыполнения);
	КонецЕсли; 
КонецПроцедуры

Процедура ОповещениеВзаиморасчеты(Параметры, Адрес) Экспорт
	
	//ЗначК=Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить();
	//ВРСтруктура=ЗначК.Получить();
	//Если ВРСтруктура.РаботаСВнешнимиРесурсамиЗаблокирована тогда
	//	Возврат;
	//КонецЕсли;
	
	ИсточникДанных=Параметры.Источник;
	СтруктураПодключенияКБД=База1сПодключение(ИсточникДанных.Организация);
	
	Если СтруктураПодключенияКБД=Неопределено Тогда
		ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, "Не указаны настроки подключения к БД Бухгалтерии!");
		Возврат;
	КонецЕсли; 
	
	Попытка
		Сервер=СтруктураПодключенияКБД.Сервер; 
		База=СтруктураПодключенияКБД.База;
		Логин=СтруктураПодключенияКБД.Логин;
		Пароль=СтруктураПодключенияКБД.Пароль;
		
		СервисИмя="Reports_buh_smart";
		
		//=============Данные БУХ=========================================================================================================	
		ПроксиWS=ПодключениеК_WS(Сервер,База,Логин,Пароль,СервисИмя);	
		Если ПроксиWS=Неопределено Тогда
			//Возврат Неопределено;
			Возврат;
		КонецЕсли;
		
		ПараметрыЗапросаБУ = Новый Структура;
		ПараметрыЗапросаБУ.Вставить("Период", ИсточникДанных.Дата+1);
		ПараметрыЗапросаБУ.Вставить("ОрганизацияИНН",ИсточникДанных.Организация.ИНН);
		
		КонтрагентИНН=Новый СписокЗначений;
		Если ТипЗнч(ИсточникДанных)=Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
			Если ЗначениеЗаполнено(ИсточникДанных.КонтрагентДебитор) И ИсточникДанных.КонтрагентДебитор.ИНН<>"" Тогда
				КонтрагентИНН.Добавить(ИсточникДанных.КонтрагентДебитор.ИНН);
			КонецЕсли; 
			Если ЗначениеЗаполнено(ИсточникДанных.КонтрагентКредитор) И ИсточникДанных.КонтрагентКредитор.ИНН<>"" Тогда
				КонтрагентИНН.Добавить(ИсточникДанных.КонтрагентКредитор.ИНН);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(ИсточникДанных)=Тип("ДокументСсылка.СписаниеЗадолженности") тогда
			Если ЗначениеЗаполнено(ИсточникДанных.Контрагент) Тогда
				КонтрагентИНН.Добавить(ИсточникДанных.Контрагент.ИНН);
			КонецЕсли; 
		Иначе 
			Возврат;
		КонецЕсли; 
		ПараметрыЗапросаБУ.Вставить("КонтрагентИНН",КонтрагентИНН);
		
		ФильтрСписокСчетов=Новый СписокЗначений;
		//	ФильтрСписокСчетов.Добавить("60");
		ФильтрСписокСчетов.Добавить("62");
		ФильтрСписокСчетов.Добавить("76");
		
		СчетаИсключения=Новый СписокЗначений;
		СчетаИсключения.Добавить("76.07.9");
		СчетаИсключения.Добавить("76.37.9");
		СчетаИсключения.Добавить("76.НА");
		СчетаИсключения.Добавить("76.К");
		
		ПараметрыЗапросаБУ.Вставить("ФильтрСписокСчетов",ФильтрСписокСчетов);
		ПараметрыЗапросаБУ.Вставить("СчетаИсключения",СчетаИсключения);
		ПараметрыЗапросаБУ.Вставить("ВалютаРегл","руб.");
		
		Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
		ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапросаБУ);
		Запрос="ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Счет
		|ПОМЕСТИТЬ ФильтрСписокСчетов
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Родитель.Код В(&ФильтрСписокСчетов)
		|	И НЕ Хозрасчетный.Код В (&СчетаИсключения)
		
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет
		|;
		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Субконто1) КАК Контрагент,
		|	ХозрасчетныйОстатки.Субконто1.ИНН КАК ИНН,
		|	ХозрасчетныйОстатки.Субконто1.КПП КАК КПП,
		|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Субконто2) КАК Договор,
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).Дата КАК Дата,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).Номер КАК Номер,
		|   ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Валюта) КАК Валюта,
		|   ХозрасчетныйОстатки.Субконто3.Дата КАК Дата_ДокРасч_Бух,
		|   ХозрасчетныйОстатки.Субконто3.Номер КАК Номер_ДокРасч_Бух
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ФильтрСписокСчетов.Счет
		|				ИЗ
		|					ФильтрСписокСчетов),
		|			,
		|			Организация.ИНН = &ОрганизацияИНН И ТИПЗНАЧЕНИЯ(Субконто1)=Тип(Справочник.Контрагенты)
		|			И ТИПЗНАЧЕНИЯ(Субконто2)=Тип(Справочник.ДоговорыКонтрагентов) И Субконто1.ИНН в (&КонтрагентИнн)) КАК ХозрасчетныйОстатки
		|ГДЕ (ХозрасчетныйОстатки.Валюта Есть NULL И (ХозрасчетныйОстатки.СуммаОстатокДт <> 0 ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт <> 0))
		|     ИЛИ (ХозрасчетныйОстатки.Валюта.Наименование <> &ВалютаРегл И (ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт <> 0 ИЛИ ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт <> 0))
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		//Рашевская добавлено условие в запрос чтобы не попадали нулевые валютные остатки по валютным взаиморасчетам (висят рублевые хвосты из-за непроведенной переоценки в бух)
		
		ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(Запрос, ПараметрыЗапросаXDTO);	//ПроксиWS.ПолучитьДеревоРезультатаЗапроса(Запрос, ПараметрыЗапросаXDTO);//
		ТЗ_БУХ = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси); 
		
		//======================================================================================================================
		//Выборка в УТ
		
		//++ смарт:ММ #050 16.05.2020
		// Перенесено в функцию
		ТЗ_УТ = Неопределено;
		СформироватьТЗ_УТ(ТЗ_УТ,ИсточникДанных,КонтрагентИНН);
		//-- смарт:ММ 16.05.2020
		ТекстСтрока="";
		ТЗ_БУХ.Сортировать("ИНН");
		ТЗ_УТ.Сортировать("КонтрагентИНН");
		Если ТЗ_БУХ.Количество()=0 Тогда
			ТекстСтрока =ТекстСтрока+" Пустая таблица ТЗ_БУХ";
		КонецЕсли; 
		Если ТЗ_УТ.Количество()=0 Тогда
			ТекстСтрока =ТекстСтрока+" Пустая таблица ТЗ_УТ";
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		////++ смарт:ММ 24.07.2020 отладка
		//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		////--
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_БУХ.Контрагент КАК Контрагент_Бух,
		|	ТЗ_БУХ.ИНН КАК КонтрагентИНН_Бух,
		|	ТЗ_БУХ.КПП КАК КонтрагентКПП_Бух,
		|	ТЗ_БУХ.Договор КАК Договор_Бух,
		|	ТЗ_БУХ.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ТЗ_БУХ.СуммаОстатокКт КАК СуммаОстатокКт,
		|	ТЗ_БУХ.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
		|	ТЗ_БУХ.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
		|	НАЧАЛОПЕРИОДА(ТЗ_БУХ.Дата, ДЕНЬ) КАК Дата_Бух,
		|	ТЗ_БУХ.Номер КАК Номер_Бух,
		|	ТЗ_БУХ.Валюта КАК Валюта_Бух,
		|	НАЧАЛОПЕРИОДА(ТЗ_БУХ.Дата_ДокРасч_Бух, ДЕНЬ) КАК Дата_ДокРасч_Бух,
		|	ВЫРАЗИТЬ(ТЗ_БУХ.Номер_ДокРасч_Бух КАК СТРОКА(15)) КАК Номер_ДокРасч_Бух
		|ПОМЕСТИТЬ ВТ_БУХ
		|ИЗ
		|	&ТЗ_БУХ КАК ТЗ_БУХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ_УТ.Контрагент КАК Контрагент_Ут,
		|	ТЗ_УТ.КонтрагентИНН КАК КонтрагентИНН_Ут,
		|	ТЗ_УТ.КонтрагентКПП КАК КонтрагентКПП_Ут,
		|	ТЗ_УТ.ДолгКлиентаКонечныйОстаток КАК ДолгКлиента,
		|	ТЗ_УТ.НашДолгКонечныйОстаток КАК НашДолг,
		|	ТЗ_УТ.ОбъектРасчетов КАК ОбъектРасчетов_Ут,
		|	ТЗ_УТ.Номер КАК Номер_Ут,
		|	НАЧАЛОПЕРИОДА(ТЗ_УТ.Дата, ДЕНЬ) КАК Дата_Ут,
		|	ТЗ_УТ.Валюта КАК Валюта,
		|	ТЗ_УТ.Партнер КАК Партнер,
		|	ТЗ_УТ.ДокРасч КАК ДокРасч_Ут,
		|	НАЧАЛОПЕРИОДА(ТЗ_УТ.Дата_ДокРасч, ДЕНЬ) КАК Дата_ДокРасч_Ут,
		|	ВЫРАЗИТЬ(ТЗ_УТ.Номер_ДокРасч КАК СТРОКА(15)) КАК Номер_ДокРасч_Ут,
		|	ТЗ_УТ.КлючАналитикиПоПартнеру КАК КлючАналитикиПоПартнеру
		|ПОМЕСТИТЬ ВТ_УТ
		|ИЗ
		|	&ТЗ_УТ КАК ТЗ_УТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_БУХ.Контрагент_Бух, """") КАК Контрагент_Бух,
		|	ВТ_БУХ.КонтрагентИНН_Бух КАК КонтрагентИНН_Бух,
		|	ВТ_БУХ.КонтрагентКПП_Бух КАК КонтрагентКПП_Бух,
		|	ВТ_БУХ.Договор_Бух КАК Договор_Бух,
		|	ВТ_БУХ.Дата_Бух КАК Дата_Бух,
		|	ВТ_БУХ.Номер_Бух КАК Номер_Бух,
		|	ВТ_БУХ.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ВТ_БУХ.СуммаОстатокКт КАК СуммаОстатокКт,
		|	ВТ_БУХ.ВалютнаяСуммаОстатокДт КАК ВалСуммаОстатокДт,
		|	ВТ_БУХ.ВалютнаяСуммаОстатокКт КАК ВалСуммаОстатокКт,
		|	ВТ_БУХ.Валюта_Бух КАК Валюта_Бух,
		|	ВТ_БУХ.Дата_ДокРасч_Бух КАК Дата_ДокРасч_Бух,
		|	ВТ_БУХ.Номер_ДокРасч_Бух КАК Номер_ДокРасч_Бух,
		|	ВТ_УТ.Контрагент_Ут КАК Контрагент_Ут,
		|	ВТ_УТ.КонтрагентИНН_Ут КАК КонтрагентИНН_Ут,
		|	ВТ_УТ.КонтрагентКПП_Ут КАК КонтрагентКПП_Ут,
		|	ВТ_УТ.ОбъектРасчетов_Ут КАК ОбъектРасчетов_Ут,
		|	ВТ_УТ.ДолгКлиента КАК ДолгКлиента,
		|	ВТ_УТ.НашДолг КАК НашДолг,
		|	ВТ_УТ.Валюта КАК Валюта,
		|	ВТ_УТ.Партнер КАК Партнер,
		|	ВТ_УТ.ДокРасч_Ут КАК ДокРасч_Ут,
		|	ВТ_УТ.Дата_ДокРасч_Ут КАК Дата_ДокРасч_Ут,
		|	ВТ_УТ.Номер_ДокРасч_Ут КАК Номер_ДокРасч_Ут,
		|	ВЫБОР
		|		КОГДА ВТ_БУХ.Контрагент_Бух ЕСТЬ NULL
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВТ_УТ.Контрагент_Ут)
		|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_БУХ.Контрагент_Бух КАК СТРОКА(200))
		|	КОНЕЦ КАК ПолеПорядка,
		|	ВТ_УТ.Номер_Ут КАК Номер_Ут,
		|	ВТ_УТ.Дата_Ут КАК Дата_Ут,
		|	ВТ_УТ.КлючАналитикиПоПартнеру КАК КлючАналитикиПоПартнеру
		|ПОМЕСТИТЬ ДоРасхождений
		|ИЗ
		|	ВТ_БУХ КАК ВТ_БУХ
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_УТ КАК ВТ_УТ
		|		ПО ВТ_БУХ.КонтрагентИНН_Бух = ВТ_УТ.КонтрагентИНН_Ут
		|			И ВТ_БУХ.КонтрагентКПП_Бух = ВТ_УТ.КонтрагентКПП_Ут
		|			И ВТ_БУХ.Дата_Бух = ВТ_УТ.Дата_Ут
		|			И ВТ_БУХ.Номер_Бух = ВТ_УТ.Номер_Ут
		|			И (ЕСТЬNULL(ВТ_БУХ.Номер_ДокРасч_Бух, """") = ЕСТЬNULL(ВТ_УТ.Номер_ДокРасч_Ут, """"))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоРасхождений.Контрагент_Бух КАК Контрагент_Бух,
		|	ДоРасхождений.КонтрагентИНН_Бух КАК КонтрагентИНН_Бух,
		|	ДоРасхождений.КонтрагентКПП_Бух КАК КонтрагентКПП_Бух,
		|	ДоРасхождений.Договор_Бух КАК Договор_Бух,
		|	ДоРасхождений.Дата_Бух КАК Дата_Бух,
		|	ДоРасхождений.Номер_Бух КАК Номер_Бух,
		|	ЕСТЬNULL(ДоРасхождений.СуммаОстатокДт, 0) КАК СуммаОстатокДт,
		|	ЕСТЬNULL(ДоРасхождений.СуммаОстатокКт, 0) КАК СуммаОстатокКт,
		|	ЕСТЬNULL(ДоРасхождений.ВалСуммаОстатокДт, 0) КАК ВалСуммаОстатокДт,
		|	ЕСТЬNULL(ДоРасхождений.ВалСуммаОстатокКт, 0) КАК ВалСуммаОстатокКт,
		|	ЕСТЬNULL(ДоРасхождений.Валюта_Бух, """") КАК Валюта_Бух,
		|	ДоРасхождений.Дата_ДокРасч_Бух КАК Дата_ДокРасч_Бух,
		|	ДоРасхождений.Номер_ДокРасч_Бух КАК Номер_ДокРасч_Бух,
		|	ДоРасхождений.Контрагент_Ут КАК Контрагент_Ут,
		|	ДоРасхождений.КонтрагентИНН_Ут КАК КонтрагентИНН_Ут,
		|	ДоРасхождений.КонтрагентКПП_Ут КАК КонтрагентКПП_Ут,
		|	ДоРасхождений.ОбъектРасчетов_Ут КАК ОбъектРасчетов_Ут,
		|	ЕСТЬNULL(ДоРасхождений.ДолгКлиента, 0) КАК ДолгКлиента,
		|	ЕСТЬNULL(ДоРасхождений.НашДолг, 0) КАК НашДолг,
		|	ДоРасхождений.Валюта КАК Валюта,
		|	ДоРасхождений.Партнер КАК Партнер_Ут,
		|	ДоРасхождений.ПолеПорядка КАК ПолеПорядка,
		|	ДоРасхождений.Номер_Ут КАК Номер_Ут,
		|	ДоРасхождений.Дата_Ут КАК Дата_Ут,
		|	ДоРасхождений.ДокРасч_Ут КАК ДокРасч_Ут,
		|	ДоРасхождений.Номер_ДокРасч_Ут КАК Номер_ДокРасч_Ут,
		|	ДоРасхождений.Дата_ДокРасч_Ут КАК Дата_ДокРасч_Ут,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ДоРасхождений.КонтрагентИНН_Бух, ЕСТЬNULL(ДоРасхождений.КонтрагентИНН_Ут, """")) <> """"
		|			ТОГДА ЕСТЬNULL(ДоРасхождений.КонтрагентИНН_Бух, ЕСТЬNULL(ДоРасхождений.КонтрагентИНН_Ут, """"))
		|		ИНАЧЕ ДоРасхождений.ПолеПорядка
		|	КОНЕЦ КАК ПолеДляПоиска,
		|	ДоРасхождений.КлючАналитикиПоПартнеру КАК КлючАналитикиПоПартнеру
		|ИЗ
		|	ДоРасхождений КАК ДоРасхождений
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Расхождения
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ДоРасхождений.ВалСуммаОстатокДт, 0) > 0
		|							ТОГДА НЕ ЕСТЬNULL(ДоРасхождений.ВалСуммаОстатокДт, 0) = ЕСТЬNULL(ДоРасхождений.ДолгКлиента, 0)
		|						КОГДА ЕСТЬNULL(ДоРасхождений.СуммаОстатокДт, 0) > 0
		|							ТОГДА НЕ ЕСТЬNULL(ДоРасхождений.СуммаОстатокДт, 0) = ЕСТЬNULL(ДоРасхождений.ДолгКлиента, 0)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Расхождения
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ДоРасхождений.ВалСуммаОстатокКт, 0) > 0
		|							ТОГДА НЕ ЕСТЬNULL(ДоРасхождений.ВалСуммаОстатокКт, 0) = ЕСТЬNULL(ДоРасхождений.НашДолг, 0)
		|						КОГДА ЕСТЬNULL(ДоРасхождений.СуммаОстатокКт, 0) > 0
		|							ТОГДА НЕ ЕСТЬNULL(ДоРасхождений.СуммаОстатокКт, 0) = ЕСТЬNULL(ДоРасхождений.НашДолг, 0)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолеДляПоиска";
		
		Запрос.УстановитьПараметр("Расхождения", Ложь);
		Запрос.УстановитьПараметр("ТЗ_БУХ",ТЗ_БУХ);
		Запрос.УстановитьПараметр("ТЗ_УТ",ТЗ_УТ);
		
		РезультатЗапроса=Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() тогда 
			ТЗ=РезультатЗапроса.Выгрузить();
			ТЗ.Сортировать("ПолеДляПоиска");
		КонецЕсли;
		
		Если ТЗ=Неопределено Или ТЗ.Количество()=0 Тогда
			ТекстСтрока = ТекстСтрока+" Пустая таблица сверки!";
		Иначе
			
			
			МассивСтрок1=ТЗ.НайтиСтроки(Новый Структура("ВалСуммаОстатокДт,ВалСуммаОстатокКт,СуммаОстатокДт,СуммаОстатокКт,НашДолг,ДолгКлиента",0,0,0,0,0,0));
			Если МассивСтрок1.Количество()>0 тогда
				Для Каждого  стрТЗ из МассивСтрок1 цикл
					ТЗ.Удалить(стрТЗ)
				КонецЦикла;
			КонецЕсли;
			
			//Массив для выборки заказа клиента в бух, для подставновки ввиде информации в левую часть ТЧ
			МассивПустойКонтрагентБУХ=ТЗ.НайтиСтроки(Новый Структура("Контрагент_Бух",""));
			ТЗ_В_Бух=Новый ТаблицаЗначений;
			ТЗ_В_Бух.Колонки.Добавить("КонтрагентИНН_Ут",ОбщегоНазначения.ОписаниеТипаСтрока(20));
			ТЗ_В_Бух.Колонки.Добавить("КонтрагентКПП_Ут",ОбщегоНазначения.ОписаниеТипаСтрока(20));
			ТЗ_В_Бух.Колонки.Добавить("Номер_Ут",ОбщегоНазначения.ОписаниеТипаСтрока(20));
			ТЗ_В_Бух.Колонки.Добавить("Дата_Ут",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			Для Каждого СтрМасс из  МассивПустойКонтрагентБУХ цикл
				Если ЗначениеЗаполнено(СтрМасс.КонтрагентИНН_Ут) и ЗначениеЗаполнено(СтрМасс.Номер_Ут)
					и ЗначениеЗаполнено(СтрМасс.Дата_Ут) тогда
					НоваяСтрокаТЗ=ТЗ_В_Бух.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ,СтрМасс);
				КонецЕсли;
			КонецЦикла;
			ТЗ_В_Бух.свернуть("КонтрагентИНН_Ут,КонтрагентКПП_Ут,Номер_Ут,Дата_Ут");
			
			//======================================================================================================================
			ПараметрыЗапросаБУ2 = Новый Структура;
			ПараметрыЗапросаБУ2.Вставить("Тз_в_БУх", ТЗ_В_Бух);
			ПараметрыЗапросаБУ2.Вставить("Период", ИсточникДанных.Дата);
			ПараметрыЗапросаБУ2.Вставить("ОрганизацияИНН",ИсточникДанных.Организация.ИНН);
			ПараметрыЗапросаБУ2.Вставить("ФильтрСписокСчетов",ФильтрСписокСчетов);
			ПараметрыЗапросаБУ2.Вставить("СчетаИсключения",СчетаИсключения);
			
			Сериализатор2 = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
			ПараметрыЗапросаXDTO2 = Сериализатор2.ЗаписатьXDTO(ПараметрыЗапросаБУ2);
			Запрос2="ВЫБРАТЬ
			|	Хозрасчетный.Ссылка КАК Счет
			|ПОМЕСТИТЬ ФильтрСписокСчетов
			|ИЗ
			|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.Родитель.Код В(&ФильтрСписокСчетов)
			|	И НЕ Хозрасчетный.Код В (&СчетаИсключения)
			
			|ИНДЕКСИРОВАТЬ ПО
			|	Счет
			|;
			
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЗ_В_БУХ.КонтрагентИНН_Ут КАК КонтрагентИНН_Ут,
			|	ТЗ_В_БУХ.КонтрагентКПП_Ут КАК КонтрагентКПП_Ут,
			|	ТЗ_В_БУХ.Номер_Ут КАК Номер_Ут,
			|	ТЗ_В_БУХ.Дата_Ут КАК Дата_Ут
			|ПОМЕСТИТЬ ФильтрПоиска
			|ИЗ
			|	&ТЗ_В_БУХ КАК ТЗ_В_БУХ
			|;
			
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Субконто1) КАК Контрагент,
			|	ХозрасчетныйОстатки.Субконто1.ИНН КАК ИНН,
			|	ХозрасчетныйОстатки.Субконто1.КПП КАК КПП,
			|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Субконто2) КАК Договор,
			|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
			|	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
			|	ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
			|	ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
			|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).Дата КАК Дата,
			|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).Номер КАК Номер,
			|	ФильтрПоиска.КонтрагентИНН_Ут КАК КонтрагентИНН_Ут,
			|	ФильтрПоиска.КонтрагентКПП_Ут КАК КонтрагентКПП_Ут,
			|	ФильтрПоиска.Номер_Ут КАК Номер_Ут,
			|	ФильтрПоиска.Дата_Ут КАК Дата_Ут,
			|	ДоговорыКонтрагентов.Ссылка КАК ДоговорНайден,
			|	ДоговорыКонтрагентов.Владелец КАК ВладелецНайден
			|ПОМЕСТИТЬ ИтоговаяТаблица
			|ИЗ
			|	ФильтрПоиска КАК ФильтрПоиска
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
			|				&Период,
			|				Счет В
			|					(ВЫБРАТЬ
			|						ФильтрСписокСчетов.Счет
			|					ИЗ
			|						ФильтрСписокСчетов),
			|				,
			|				Организация.ИНН = &ОрганизацияИНН
			|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты)
			|					И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ДоговорыКонтрагентов)) КАК ХозрасчетныйОстатки
			|		ПО (ХозрасчетныйОстатки.Субконто1.ИНН = ФильтрПоиска.КонтрагентИНН_Ут)
			|			И (ХозрасчетныйОстатки.Субконто1.КПП = ФильтрПоиска.КонтрагентКПП_Ут)
			|			И (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).Дата = ФильтрПоиска.Дата_Ут)
			|			И (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).Номер = ФильтрПоиска.Номер_Ут)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ФильтрПоиска.КонтрагентИНН_Ут = ДоговорыКонтрагентов.Владелец.ИНН
			|			И ФильтрПоиска.КонтрагентКПП_Ут = ДоговорыКонтрагентов.Владелец.КПП
			|			И ФильтрПоиска.Номер_Ут = ДоговорыКонтрагентов.Номер
			|			И ФильтрПоиска.Дата_Ут = ДоговорыКонтрагентов.Дата
			|;
			
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИтоговаяТаблица.Контрагент КАК Контрагент,
			|	ИтоговаяТаблица.ИНН КАК ИНН,
			|	ИтоговаяТаблица.КПП КАК КПП,
			|	ИтоговаяТаблица.Договор КАК Договор,
			|	ИтоговаяТаблица.СуммаОстатокДт КАК СуммаОстатокДт,
			|	ИтоговаяТаблица.СуммаОстатокКт КАК СуммаОстатокКт,
			|	ИтоговаяТаблица.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
			|	ИтоговаяТаблица.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
			|	ИтоговаяТаблица.Дата КАК Дата,
			|	ИтоговаяТаблица.Номер КАК Номер,
			|	ИтоговаяТаблица.КонтрагентИНН_Ут КАК КонтрагентИНН_Ут,
			|	ИтоговаяТаблица.КонтрагентКПП_Ут КАК КонтрагентКПП_Ут,
			|	ИтоговаяТаблица.Номер_Ут КАК Номер_Ут,
			|	ИтоговаяТаблица.Дата_Ут КАК Дата_Ут,
			|	Представление(ИтоговаяТаблица.ДоговорНайден) КАК ДоговорНайден,
			|	Представление(ИтоговаяТаблица.ВладелецНайден) КАК ВладелецНайден
			|ИЗ
			|	ИтоговаяТаблица КАК ИтоговаяТаблица
			|ГДЕ
			|	ИтоговаяТаблица.СуммаОстатокДт ЕСТЬ NULL
			|	И ИтоговаяТаблица.СуммаОстатокКт ЕСТЬ NULL
			|	И ИтоговаяТаблица.ВалютнаяСуммаОстатокДт ЕСТЬ NULL
			|	И ИтоговаяТаблица.ВалютнаяСуммаОстатокКт ЕСТЬ NULL
			|   И НЕ ИтоговаяТаблица.ДоговорНайден ЕСТЬ NULL
			|   И НЕ ИтоговаяТаблица.ВладелецНайден ЕСТЬ NULL";
			
			
			ТаблицаХОПрокси2 = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(Запрос2, ПараметрыЗапросаXDTO2);	//ПроксиWS.ПолучитьДеревоРезультатаЗапроса(Запрос, ПараметрыЗапросаXDTO);//
			ТЗ_БУХ2 = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси2); 
			
			//======================================================================================================================
			
			ТЗ_УТ.Очистить();
			ТЗ_БУХ.Очистить();
			//Результат.Очистить();
			
			Для Каждого СтрИтог из ТЗ цикл
				Если НЕ(ЗначениеЗаполнено(СтрИтог.Контрагент_Бух) и ЗначениеЗаполнено(СтрИтог.Договор_Бух)) тогда
					ОтборСтруктура=Новый Структура("КонтрагентИНН_Ут,КонтрагентКПП_Ут,Номер_Ут,Дата_Ут",СтрИтог.КонтрагентИНН_Ут, СтрИтог.КонтрагентКПП_Ут,СтрИтог.Номер_Ут,СтрИтог.Дата_Ут);
					МассивыНашли= ТЗ_БУХ2.НайтиСтроки(ОтборСтруктура);
					Если МассивыНашли.Количество()> 0 тогда
						СтрИтог.Договор_Бух=МассивыНашли[0].ДоговорНайден;
						СтрИтог.Контрагент_Бух=МассивыНашли[0].ВладелецНайден;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ТД=Новый ТабличныйДокумент;
			
			ВнешниеНаборыДанных = Новый Структура;
			ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
			
			//	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
			СхемаКомпоновкиДанных = ПолучитьОбщийМакет("смарт_ВзаиморасчетыОповещение"); 
			//ОтчетОбъект.ПолучитьМакет("Макет");
			
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,СхемаКомпоновкиДанных.НастройкиПоУмолчанию,ДанныеРасшифровкиОтчета); //Отчет.КомпоновщикНастроек.ПолучитьНастройки()
			
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровкиОтчета, Истина); 
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ТД);//тд
			
			ПроцессорВывода.НачатьВывод();
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
			ПроцессорВывода.ЗакончитьВывод();
			
			ФайлВФорматеHTML = ПолучитьИмяВременногоФайла("html");
			
			ТабличныйДокументБезРисунков = Новый ТабличныйДокумент;
			ТабличныйДокументБезРисунков.Вывести(ТД);
			ТабличныйДокументБезРисунков.Рисунки.Очистить();
			ТабличныйДокументБезРисунков.Записать(ФайлВФорматеHTML, ТипФайлаТабличногоДокумента.HTML);
			
			Письмо = Новый ИнтернетПочтовоеСообщение;
			HtmlДок = Новый ЧтениеТекста;
			HtmlДок.Открыть(ФайлВФорматеHTML);
			ТекстHtmlДока = HtmlДок.Прочитать();
			ТекстСтрока = ТекстHtmlДока;
		КонецЕсли;
		
				
	Исключение
		ТекстСтрока="Не удалось выполнить сверу данных после проведения документа: "+ИсточникДанных+" "+Символы.пс+" "+ ОписаниеОшибки();
	КонецПопытки;
	
	Если КонтрагентИНН.Количество()=0 Тогда



	
		 ТекстСтрока=ТекстСтрока+" Не найден ИНН контагентов!";
	
	КонецЕсли; 
	
	Если НЕ ТекстСтрока="" тогда
		ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, "Сверка взаиморасчетов УТ/БП!!! "  + ТекущаяДатаСеанса() + Символы.ПС);
		
		// Отправка уведомления 
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки=смартПолучитьАдресаПолучателейУведомлений(Справочники.смартПредопределенныеЗначения.ПользователиДляОповещенияОбВзаимозачете,АдресаДляОтправкиСтрокой,);	//	МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес,Представление", "rashevskaya@smart-t.ru", "rashevskaya@smart-t.ru"));
		Если МассивАдресовДляОтправки.Количество()=0 Тогда
		   ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, "Не указаны адреса для рассылки в справочнике Предопределенные значения(смарт): ПользователиДляОповещенияОбВзаимозачете!");
		   Возврат;
		КонецЕсли; 
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
		Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
			
			ТемаПисьма = "Сверка взаиморасчетов УТ/БП для документа: "+ ИсточникДанных;
			ТекстПисьма = ТекстСтрока; 
			
			ДанныеОтправки = Новый Структура("Тема,Тело", ТемаПисьма, ТекстПисьма);
			
			ПараметрыПисьма = ПолучитьПараметрыОтправки2(МассивАдресовДляОтправки, ДанныеОтправки);
			
			Попытка
				ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, "Отправлено уведомление о взаиморасчете УТ/БП "+ИсточникДанных+" " + ТекущаяДата() + Символы.ПС + " на почту: " + АдресаДляОтправкиСтрокой);
			Исключение 
				//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
				смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,,ТекстПисьма);
				//-- #1416 смарт: Фролов 29.08.2023
				ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось отправить уведомление о взаиморасчете УТ/БП "+ИсточникДанных+" "  + ТекущаяДата() + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	

	
КонецПроцедуры

Функция ПодключениеК_WS(Сервер,База,Логин,Пароль,СервисИмя)
	
	Адрес="http://"+Сервер+"/"+База+"/ws/"+СервисИмя+".1cws/?wsdl";
	
	// Создание WS-определений
	ОпределениеWS 		= Новый WSОпределения(Адрес, Логин, Пароль);
	Сервис 				= ОпределениеWS.Сервисы.Получить(0);
	ИмяСервиса 			= Сервис.Имя;
	ИмяТочкиПодключения = Сервис.ТочкиПодключения.Получить(0).Имя;
	
	// Создание WS-прокси
	ПроксиWS 				= Новый WSПрокси(ОпределениеWS, Сервис.URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения);
	ПроксиWS.Пользователь 	= Логин;
	ПроксиWS.Пароль 		= Пароль;
	
	Возврат ПроксиWS;
	
КонецФункции // ПодключениеК_УТ()

Функция СформироватьТЗ_УТ(ТЗ_УТ,ИсточникДанных, КонтрагентИНН)
	//Рашевская: в запрос добавлена аналитика по партнеру из регистра Расчеты по срокам
	//и в качестве объекта расчетов подставляется договор если заполнен в аналитике
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Партнер КАК Партнер,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК Сегменты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК Коэффициент
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, ) КАК КурсВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода, Валюта = &Валюта) КАК КурсВалютыОтчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КурсВалюты.Кратность <> 0
	|	И КурсВалютыОтчета.Курс <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Контрагент КАК Контрагент,
	|	Расчеты.Контрагент.ИНН КАК КонтрагентИНН,
	|	Расчеты.Контрагент.КПП КАК КонтрагентКПП,
	|	СУММА(Расчеты.ДолгКлиентаКонечныйОстаток) КАК ДолгКлиентаКонечныйОстаток,
	|	СУММА(Расчеты.НашДолгКонечныйОстаток) КАК НашДолгКонечныйОстаток,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА Расчеты.АналитикаУчетаПоПартнерам.Договор = &ПустойДоговор
	|			ТОГДА Расчеты.ОбъектРасчетов.Номер
	|		ИНАЧЕ Расчеты.АналитикаУчетаПоПартнерам.Договор.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА Расчеты.АналитикаУчетаПоПартнерам.Договор = &ПустойДоговор
	|			ТОГДА НАЧАЛОПЕРИОДА(Расчеты.ОбъектРасчетов.Дата, ДЕНЬ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Расчеты.АналитикаУчетаПоПартнерам.Договор.Дата, ДЕНЬ)
	|	КОНЕЦ КАК Дата,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.Партнер КАК Партнер,
	|	Расчеты.РасчетныйДокумент КАК ДокРасч,
	|	Расчеты.РасчетныйДокумент.Номер КАК Номер_ДокРасч,
	|	Расчеты.РасчетныйДокумент.Дата КАК Дата_ДокРасч,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитикиПоПартнеру
	|ИЗ
	|	(ВЫБРАТЬ
	|		АналитикаУчета.Организация КАК Организация,
	|		АналитикаУчета.Партнер КАК Партнер,
	|		АналитикаУчета.Контрагент КАК Контрагент,
	|		АналитикаУчета.Договор КАК Договор,
	|		АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта КАК Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения КАК ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокам.ДолгОстаток КАК ДолгКлиентаНачальныйОстаток,
	|		РасчетыПоСрокам.ПредоплатаОстаток КАК НашДолгНачальныйОстаток,
	|		0 КАК ПлановаяОплатаНачальныйОстаток,
	|		0 КАК ПлановаяОтгрузкаНачальныйОстаток,
	|		0 КАК Заказано,
	|		0 КАК Отгружено,
	|		0 КАК Зачтено,
	|		0 КАК Оплачено,
	|		0 КАК Оплачивается,
	|		0 КАК Отгружается,
	|		0 КАК ДолгКлиентаКонечныйОстаток,
	|		0 КАК НашДолгКонечныйОстаток,
	|		0 КАК ПлановаяОплатаКонечныйОстаток,
	|		0 КАК ПлановаяОтгрузкаКонечныйОстаток,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоОстатки, ) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И АналитикаУчета.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация,
	|		АналитикаУчета.Партнер,
	|		АналитикаУчета.Контрагент,
	|		АналитикаУчета.Договор,
	|		АналитикаУчета.НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыПоСрокам.ДолгОстаток,
	|		РасчетыПоСрокам.ПредоплатаОстаток,
	|		0,
	|		0,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&КонецПериода, ) КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И АналитикаУчета.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаУчета.Организация,
	|		АналитикаУчета.Партнер,
	|		АналитикаУчета.Контрагент,
	|		АналитикаУчета.Договор,
	|		АналитикаУчета.НаправлениеДеятельности,
	|		РасчетыПоСрокам.ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта,
	|		РасчетыПоСрокам.РасчетныйДокумент,
	|		РасчетыПоСрокам.ДатаВозникновения,
	|		РасчетыПоСрокам.ДатаПлановогоПогашения,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
	|				ТОГДА -РасчетыПоСрокам.Долг + РасчетыПоСрокам.Предоплата
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
	|				ТОГДА РасчетыПоСрокам.Долг - РасчетыПоСрокам.Предоплата
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РасчетыПоСрокам.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И (РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|						ИЛИ РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности))
	|				ТОГДА -РасчетыПоСрокам.Предоплата + РасчетыПоСрокам.Долг
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И (РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|						ИЛИ РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РезервированиеАвансаКлиента))
	|				ТОГДА РасчетыПоСрокам.Предоплата
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|				ТОГДА -РасчетыПоСрокам.Предоплата + РасчетыПоСрокам.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РезервированиеАвансаКлиента)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				ТОГДА РасчетыПоСрокам.Предоплата
	|			КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
	|					И РасчетыПоСрокам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				ТОГДА РасчетыПоСрокам.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	|			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	|	ГДЕ
	|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И АналитикаУчета.Организация = &Организация
	|		И РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода) КАК Расчеты
	|ГДЕ
	|	(Расчеты.ДолгКлиентаКонечныйОстаток <> 0
	|			ИЛИ Расчеты.НашДолгКонечныйОстаток <> 0)
	|	И Расчеты.Контрагент.ИНН В(&КонтрагентИНН)
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Контрагент.ИНН,
	|	Расчеты.Контрагент.КПП,
	|	ВЫБОР
	|		КОГДА Расчеты.АналитикаУчетаПоПартнерам.Договор = &ПустойДоговор
	|			ТОГДА Расчеты.ОбъектРасчетов.Номер
	|		ИНАЧЕ Расчеты.АналитикаУчетаПоПартнерам.Договор.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Расчеты.АналитикаУчетаПоПартнерам.Договор = &ПустойДоговор
	|			ТОГДА НАЧАЛОПЕРИОДА(Расчеты.ОбъектРасчетов.Дата, ДЕНЬ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Расчеты.АналитикаУчетаПоПартнерам.Договор.Дата, ДЕНЬ)
	|	КОНЕЦ,
	|	Расчеты.Контрагент,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.Партнер,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.РасчетныйДокумент.Номер,
	|	Расчеты.РасчетныйДокумент.Дата,
	|	Расчеты.АналитикаУчетаПоПартнерам";
	
	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("КонецПериода", ИсточникДанных.Дата+1);
	Запрос.УстановитьПараметр("НачалоОстатки", ИсточникДанных.Дата+1);
	Запрос.УстановитьПараметр("НачалоПериода", ИсточникДанных.Дата+1);
	Запрос.УстановитьПараметр("Организация", ИсточникДанных.Организация);
	Запрос.УстановитьПараметр("КонтрагентИНН",КонтрагентИНН);
	
	ТЗ_УТ = Запрос.Выполнить().Выгрузить();
	МассивСтрок=ТЗ_УТ.НайтиСтроки(Новый структура("ДолгКлиентаКонечныйОстаток,НашДолгКонечныйОстаток",0,0));
	Если МассивСтрок.Количество()>0 тогда
		Для Каждого  стрТЗ_УТ из МассивСтрок цикл
			ТЗ_УТ.Удалить(стрТЗ_УТ)
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыОтправки2(МассивАдресов, Данные)
	
	ДанныеДляОтправки = Новый Структура;
	
	ДанныеДляОтправки.Вставить("Кому",	 	МассивАдресов);
	ДанныеДляОтправки.Вставить("Тема", 		Данные.Тема);
	ДанныеДляОтправки.Вставить("Тело", 		Данные.Тело);//ПолучитьФорматированныйТекст(Данные));
	ДанныеДляОтправки.Вставить("ТипТекста",	ТипТекстаПочтовогоСообщения.HTML);
	ДанныеДляОтправки.Вставить("Важность",	ВажностьИнтернетПочтовогоСообщения.Обычная);	
	
	Возврат ДанныеДляОтправки;
	
КонецФункции 

Функция База1сПодключение(Организация) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	смартБазы1С.ИмяИБ КАК ИмяИБ,
	|	смартБазы1С.ИмяСервера КАК ИмяСервера,
	|	смартБазы1С.Пользователь КАК Пользователь,
	|	смартБазы1С.Пароль КАК Пароль
	|ИЗ
	|	Справочник.смартБазы1С КАК смартБазы1С
	|ГДЕ
	|	смартБазы1С.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Организация);
	РезЗапроса=Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Выборка=РезЗапроса.Выбрать();
	СтрукутраБД1с=Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		СтрукутраБД1с.Вставить("Сервер",сокрЛП(Выборка.ИмяСервера));
		СтрукутраБД1с.Вставить("База",сокрЛП(Выборка.ИмяИБ));
		СтрукутраБД1с.Вставить("Логин",сокрЛП(Выборка.Пользователь));
		СтрукутраБД1с.Вставить("Пароль",сокрЛП(Выборка.Пароль));
	КонецЦикла; 
	
	Возврат СтрукутраБД1с;
	
КонецФункции // ()
 
//++ #1766 смарт: Мосолов 09.04.2024 //Создать предварительный шаг по контролю созданных документов в БП при отгрузке
Функция СостоянияСохраненияПечатныхФормРеализацийВБП(ПараметрыПолучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПодключенияКБД = База1сПодключение(ПараметрыПолучения.Организация);
	
	Если СтруктураПодключенияКБД = Неопределено Тогда
		Возврат "По организации " + ПараметрыПолучения.Организация + " не указаны настроки подключения к БД Бухгалтерии!";
	КонецЕсли; 
	
	Попытка
		
		Сервер = СтруктураПодключенияКБД.Сервер; 
		База = СтруктураПодключенияКБД.База;
		Логин = СтруктураПодключенияКБД.Логин;
		Пароль = СтруктураПодключенияКБД.Пароль;
		
		СервисИмя = "Reports_buh_smart";
		
		ПроксиWS = ПодключениеК_WS(Сервер, База, Логин, Пароль, СервисИмя);
		
		Если ПроксиWS = Неопределено Тогда
			Возврат "Не удалось подключиться к БД Бухгалтерии!";
		КонецЕсли;
		
		ПараметрыЗапросаБУ = Новый Структура;
		ПараметрыЗапросаБУ.Вставить("ВходящиеДанные", ПараметрыПолучения.ВходящиеДанные);
		
		Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
		ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапросаБУ); 
		
		Запрос =
		"ВЫБРАТЬ
		|	ВходящиеДанные.Номер КАК Номер,
		|	ВходящиеДанные.Дата КАК Дата
		|ПОМЕСТИТЬ ТаблицаПараметров
		|ИЗ
		|	&ВходящиеДанные КАК ВходящиеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартСформированныеПакетыПФ.Документ.Номер КАК Номер,
		|	смартСформированныеПакетыПФ.Документ.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.смартСформированныеПакетыПФ КАК смартСформированныеПакетыПФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПараметров КАК ТаблицаПараметров
		|		ПО смартСформированныеПакетыПФ.Документ.Номер = ТаблицаПараметров.Номер
		|			И смартСформированныеПакетыПФ.Документ.Дата = ТаблицаПараметров.Дата
		|ГДЕ
		|	смартСформированныеПакетыПФ.Документ.Проведен 
		|	И смартСформированныеПакетыПФ.ПакетСформирован"; 
		
		
		ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(Запрос, ПараметрыЗапросаXDTO);
		//ТаблицаХОПрокси = ПроксиWS.ПолучитьДеревоРезультатаЗапроса(Запрос, ПараметрыЗапросаXDTO);
		
		Возврат Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);  
		
	Исключение
		
		Возврат "По организации " + ПараметрыПолучения.Организация + " не удалось получить данные по формированию пакета документов в БД Бухгалтерии: " + Символы.ПС + ОписаниеОшибки(); 
		
	КонецПопытки;
		
	
КонецФункции //++ #1766 смарт: Мосолов 09.04.2024 

//++ смарт:ММ #099 409 26.03.2021 Регламентное обслуживание - уже не используется в блоке регл.обслуживания. 
Функция ДобавитьКДатеРабочиеДни(ДатаНач, ЧислоРабочихДней) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    ВЫБОР
	|        КОГДА ДанныеПроизводственногоКалендаря.ВидДня = &РабочийДень
	|                ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = &ПредпраздничныйДень
	|            ТОГДА 1
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК ЧислоРабочихДней,
	|    ДанныеПроизводственногоКалендаря.Дата КАК ДатаКалендаря
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|    ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь.Код = ""РФ""
	|    И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ТЗ.ДатаКалендаря,
	|    СУММА(ТЗ1.ЧислоРабочихДней) КАК ЧислоРабочихДней
	|ПОМЕСТИТЬ ТЗНакопл
	|ИЗ
	|    ТЗ КАК ТЗ
	|        ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ1
	|        ПО (ТЗ1.ДатаКалендаря <= ТЗ.ДатаКалендаря)
	|
	|СГРУППИРОВАТЬ ПО
	|    ТЗ.ДатаКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    МАКСИМУМ(ТЗ.ДатаКалендаря) КАК ДатаКалендаря
	|ИЗ
	|    ТЗНакопл КАК ТЗ
	|ГДЕ
	|    ТЗ.ЧислоРабочихДней = &ЧислоРабочихДней";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	ЧислоНедель = Цел(ЧислоРабочихДней /5 + 0.5);
	ЧислоВыходныхДней = ЧислоНедель * 2;
	МаксимальноеКоличествоПраздничныхДнейПодряд = 8; //РождественскиеКаникулы
	ДатаКон = ДатаНач + (ЧислоВыходныхДней + ЧислоРабочихДней + МаксимальноеКоличествоПраздничныхДнейПодряд)*24*60*60;
	
	Запрос.УстановитьПараметр("ДатаКон", 				ДатаКон);
	Запрос.УстановитьПараметр("ЧислоРабочихДней", 		ЧислоРабочихДней);
	Запрос.УстановитьПараметр("РабочийДень",         	Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ПредпраздничныйДень", 	Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = 0;
	
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.ДатаКалендаря) = Тип("Дата") Тогда
			Результат = КонецДня(Выборка.ДатаКалендаря) + 1; 
		КонецЕсли;
	Конецесли;    
	
	Возврат Результат;
	
КонецФункции 

//++смарт: Белоусова #448 21.03.2021
Функция  ПолучитьДанныеПоКонтрагентуИЗЭДО(Контрагент) Экспорт
	РеквизитыКонтрагента = ПартнерыИКонтрагентыВызовСервера.ДанныеКонтрагентаПоИНН(
		                       ОбщегоНазначенияУТКлиентСервер.ЭтоЮрЛицо(Контрагент.ЮрФизЛицо),
		                       Контрагент.ИНН,
		                       );
возврат  РеквизитыКонтрагента;
КонецФункции
 


//++ смарт:ММ #102 476 12.05.2021 
Функция РассчитатьСуммуСоСкидкойНаЗакупку(СкидкаНаЗакупку, знач СуммаБезСкидки) Экспорт
	
	СуммаСоСкидкой = СуммаБезСкидки;
	
	СкидкаПроцент = Ложь;
	СкидкаСумма = Ложь;
	
	Если ЗначениеЗаполнено(СкидкаНаЗакупку) И ЗначениеЗаполнено(СкидкаНаЗакупку.Размер) Тогда
		Если СкидкаНаЗакупку.ЕдиницаИзмерения = Перечисления.смартСпособыПредоставленияСкидок.Сумма Тогда
			СуммаСоСкидкой = СуммаСоСкидкой - СкидкаНаЗакупку.Размер;
		ИначеЕсли СкидкаНаЗакупку.ЕдиницаИзмерения = Перечисления.смартСпособыПредоставленияСкидок.Процент Тогда
			СуммаСоСкидкой = СуммаСоСкидкой - СуммаСоСкидкой * (СкидкаНаЗакупку.Размер / 100);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СуммаСоСкидкой;
	
КонецФункции //-- смарт:ММ 12.05.2021

Функция ПолучитьПрибавитьКДатеКоличествоРабочихДней(Знач ДатаОт,Знач КолДней)Экспорт
	Если КолДней=0 Тогда 
		Возврат ДатаОт;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Дата",ДатаОт);
	Запрос.УстановитьПараметр("Календарь",Справочники.Календари.НайтиПоНаименованию("Российская Федерация",Истина));
	Запрос.УстановитьПараметр("Год",Год(ДатаОт));
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 5
	|	КалендарныеГрафики.ДатаГрафика КАК Дата
	|	ПОМЕСТИТЬ ВТ
	|ИЗ
	|РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|КалендарныеГрафики.Календарь=&Календарь
	|И КалендарныеГрафики.ДатаГрафика > &Дата
	|И КалендарныеГрафики.ДеньВключенВГрафик
	|И КалендарныеГрафики.Год >= &Год
	|;   
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ.Дата) КАК Дата
	|ИЗ
	|ВТ КАК ВТ";
	
	СхемаЗапроса=Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].КоличествоПолучаемыхЗаписей=?(КолДней<0,-КолДней,КолДней);
	Если КолДней<0 Тогда 
		ПорядокСортировки=СхемаЗапроса.ПакетЗапросов[0].Порядок.Добавить("Дата");
		ПорядокСортировки.Направление=НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор[1]=Новый ВыражениеСхемыЗапроса("КалендарныеГрафики.ДатаГрафика < &Дата");
		
		СхемаЗапроса.ПакетЗапросов[1].Операторы[0].ВыбираемыеПоля[0]=Новый ВыражениеСхемыЗапроса("МИНИМУМ(ВТ.Дата)");
	КонецЕсли;
	Запрос.Текст=СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		//++ смарт:Каратеев #1297 09.01.2023//Заплатка для исправления ошибки сравнения типов, когда Рез.Дата = null
		//Лучше потом переделать всю эту функцию, сейчас запрос не учитывает год
		Возврат ?(ЗначениеЗаполнено(Рез.Дата),Рез.Дата,ДатаОт);
		//-- смарт:Каратеев #1297 09.01.2023
	КонецЕсли;
	Возврат ДатаОт;
КонецФункции

//++ смарт:ММ 572 27.07.2021
Функция ПолучитьИмяФайлаДляБуфераОбмена(ДокСсылка) Экспорт
	
	РезультатВозврат = "";
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		// ++ 13.08.2021
		УстановитьПривилегированныйРежим(Истина);
		// --
		//++rnp 20.08.2021 по Смарт-Т Текстиль  нет с/ф
		СчетФактура = Документы.СчетФактураВыданный.ПустаяСсылка();
		Если ДокСсылка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС 
			ИЛИ ДокСсылка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт Тогда
			СчетФактура = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка);
		КонецЕсли;
		//--rnp 20.08.2021
		
		Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
			//Возврат РезультатВозврат; //rnp 20.08.2021  закомментировано
		КонецЕсли;
		
		СчетНаОплатуПокупателю = ДокСсылка.ЗаказКлиента;
		
		Если НЕ ЗначениеЗаполнено(СчетНаОплатуПокупателю) Тогда
			//Возврат РезультатВозврат; //rnp 20.08.2021 закомментировано, заказ не может быть пустым
		КонецЕсли;

		ИмяКонтрагента = Лев(СокрЛП(СтрЗаменить(ДокСсылка.Контрагент.Наименование, "ООО", "")), 100);
		
		//++ смарт:ММ 572 19.08.2021 - ругается на длинное наименование
		ИмяКонтрагента = Лев(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяКонтрагента, ""), 50);
		//-- смарт:ММ 19.08.2021
		
		//++rnp 20.08.2021
		Если Не ЗначениеЗаполнено(СчетФактура) Тогда
			РезультатВозврат = "СФ " + ДокСсылка.Номер + " " + Формат(ДокСсылка.Дата, "ДЛФ=D") + " (Счет " + СчетНаОплатуПокупателю.Номер + " " + Формат(СчетНаОплатуПокупателю.Дата, "ДЛФ=D") + ") " + ИмяКонтрагента;	
		Иначе//--rnp 20.08.2021	
			РезультатВозврат = "СФ " + СчетФактура.Номер + " " + Формат(СчетФактура.Дата, "ДЛФ=D") + " (Счет " + СчетНаОплатуПокупателю.Номер + " " + Формат(СчетНаОплатуПокупателю.Дата, "ДЛФ=D") + ") " + ИмяКонтрагента;	
		КонецЕсли;
		// ++ 13.08.2021
		УстановитьПривилегированныйРежим(Ложь);
		// --
	//++rnp 20.08.2021
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		    		
		РезультатВозврат = "Заказ на перемещение " + ДокСсылка.Номер + " " + Формат(ДокСсылка.Дата, "ДЛФ=D") + " " + Строка(ДокСсылка.СкладПолучатель);	
		
	КонецЕсли;
	
	Возврат РезультатВозврат;
	
КонецФункции //-- смарт:ММ 27.07.2021

//++ смарт:ММ 572 04.07.2021
Функция НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка) Экспорт
	
	//Возврат УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка, , , Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	1 КАК Приоритет,
		|	NULL КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_Объединение
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
		|	И НЕ СчетФактураВыданный.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка,
		|	2,
		|	СчетФактураВыданный.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ_Объединение.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ВТ_Приоритет
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Объединение.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Приоритет КАК ВТ_Приоритет
		|		ПО ВТ_Объединение.Приоритет = ВТ_Приоритет.Приоритет";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокСсылка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 27.07.2021
//++ смарт:ММ 698 03.11.2021 
//Функция ОтправитьПакетДокументовНаПочту(МассивСтруктурВложений, ДокСсылка) Экспорт
//Функция ОтправитьПакетДокументовНаПочту(МассивСтруктурВложений, ДокСсылка = Неопределено, ТемаП = "") Экспорт
//-- смарт:ММ 03.11.2021
//++ #1353 смарт: Фролов 16.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
Функция ОтправитьПакетДокументовНаПочту(МассивСтруктурВложений, ДокСсылка = Неопределено, ТемаП = "",СкладАдмирал=Неопределено,Самовывоз=Ложь) Экспорт
//-- #1353 смарт: Фролов 16.05.2023
	
	//++ #1353 смарт: Фролов 16.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//МассивАдресов = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("АдресДляОтправкиПакетаНаСкладАдмирал", Истина);
	//
	////++ смарт:Подкин #1121 04.08.2022 9:24:59
	//МассивАдресовКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("АдресДляОтправкиПакетаНаСкладАдмиралКовчег", Истина); 
	//СкладАдмиралКовчег = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмиралКовчег", Ложь);
	//Если ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаданиеНаПеревозку") И ДокСсылка.Склад=СкладАдмиралКовчег Тогда   
	//    МассивАдресов = МассивАдресовКовчег;
	//ИначеЕсли ДокСсылка<>Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка,"Организация") И ДокСсылка.Организация.ИНН="7722457913" Тогда
	//    МассивАдресов = МассивАдресовКовчег;	
	//КонецЕсли;
    //-- смарт:Подкин #1121 04.08.2022 9:24:59  
	
	//++ #1353 смарт: Фролов 06.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//Если НЕ СкладАдмирал=Неопределено ТОгда
	//	МассивАдресов=СкладАдмирал.смартАдресаДляОтправкиПакетаНаСклад.ВыгрузитьКолонку("смартАдресДляОтправкиПакетаНаСклад");	
	//ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаданиеНаПеревозку") И НЕ ДокСсылка.Склад.ЭтоГруппа И ДокСсылка.Склад.смартАвтоматическиФормироватьДокументы Тогда
	//	МассивАдресов=ДокСсылка.Склад.смартАдресаДляОтправкиПакетаНаСклад.ВыгрузитьКолонку("смартАдресДляОтправкиПакетаНаСклад");	
	//ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаказНаПеремещение") И ДокСсылка.СкладОтправитель.смартАвтоматическиФормироватьДокументы Тогда	
	//	МассивАдресов=ДокСсылка.СкладОтправитель.смартАдресаДляОтправкиПакетаНаСклад.ВыгрузитьКолонку("смартАдресДляОтправкиПакетаНаСклад");
	//ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаказНаПеремещение") И ДокСсылка.СкладПолучатель.смартАвтоматическиФормироватьДокументы Тогда	
	//	МассивАдресов=ДокСсылка.СкладПолучатель.смартАдресаДляОтправкиПакетаНаСклад.ВыгрузитьКолонку("смартАдресДляОтправкиПакетаНаСклад");
	//Иначе
	//	Для Каждого СтруктураВложение Из МассивСтруктурВложений Цикл
	//		МассивАдресов=СтруктураВложение.Склад.смартАдресаДляОтправкиПакетаНаСклад.ВыгрузитьКолонку("смартАдресДляОтправкиПакетаНаСклад");	
	//		Прервать;
	//	КонецЦикла;
	//КонецЕсли;
	//-- #1353 смарт: Фролов 07.06.2023
	Если НЕ СкладАдмирал=Неопределено ТОгда
		МассивАдресов=ПолучитьСписокАдресовРассылкиДляПакетаАдмирал(СкладАдмирал,Самовывоз);
	ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаданиеНаПеревозку") И НЕ ДокСсылка.Склад.ЭтоГруппа И ДокСсылка.Склад.смартАвтоматическиФормироватьДокументы Тогда
		МассивАдресов=ПолучитьСписокАдресовРассылкиДляПакетаАдмирал(ДокСсылка.Склад,Самовывоз);	
	ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаказНаПеремещение") И ДокСсылка.СкладОтправитель.смартАвтоматическиФормироватьДокументы Тогда	
		МассивАдресов=ПолучитьСписокАдресовРассылкиДляПакетаАдмирал(ДокСсылка.СкладОтправитель,Самовывоз);
	ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ЗаказНаПеремещение") И ДокСсылка.СкладПолучатель.смартАвтоматическиФормироватьДокументы Тогда	
		МассивАдресов=ПолучитьСписокАдресовРассылкиДляПакетаАдмирал(ДокСсылка.СкладПолучатель,Самовывоз);
	Иначе
		Для Каждого СтруктураВложение Из МассивСтруктурВложений Цикл
			МассивАдресов=ПолучитьСписокАдресовРассылкиДляПакетаАдмирал(СтруктураВложение.Склад,Самовывоз);
			Прервать;
		КонецЦикла;
	КонецЕсли;
    //-- #1353 смарт: Фролов 06.09.2023
	
	Если МассивАдресов.Количество() > 0 Тогда
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = Новый Массив;
		
		Для Каждого АдресСтрока Из МассивАдресов Цикл
			МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес,Представление", АдресСтрока, АдресСтрока));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + АдресСтрока;
		КонецЦикла;
		
		Вложения = Новый Массив;

		Для Каждого СтруктураВложение Из МассивСтруктурВложений Цикл		
			ДанныеВложения = Новый Структура();
			ДанныеВложения.Вставить("Представление", СтруктураВложение.ИмяФайла);
			ДанныеВложения.Вставить("АдресВоВременномХранилище", СтруктураВложение.АдресХранилища);
			Вложения.Добавить(ДанныеВложения);
		КонецЦикла;
		
		// ОТЛАДКА
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("buh@smart-t.ru");
		//УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		//++ смарт:ММ 698 03.11.2021 
		Если ЗначениеЗаполнено(ТемаП) Тогда
			ТемаПисьма = ТемаП;
		Иначе
		//-- смарт:ММ 03.11.2021
		
		//++ смарт:ММ 572 18.08.2021
		//ТемаПисьма = "Пакет документов " + ПолучитьИмяФайлаДляБуфераОбмена(ДокСсылка); 
        //++ смарт:Подкин #1121 05.08.2022 8:54:43 внесены изменения для Организации Ковчег  
		//++ #1416 смарт: Фролов 22.09.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ
		//++ #1353 смарт: Фролов 05.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
		//Если ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") И ЗначениеЗаполнено(ДокСсылка.ЗаказКлиента) ТОгда
			//++ #1506 смарт: Фролов 18.10.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ (продолжение задачи 1416)
			//Добавил партнера
			ТемаПисьма = "Пакет документов по заказу №" + ДокСсылка.ЗаказКлиента.Номер + " от " + Формат(ДокСсылка.ЗаказКлиента.Дата, "ДФ='dd.MM.yyyy ""г.""'")+" "+ДокСсылка.ЗаказКлиента.Партнер.Наименование+"";
			//-- #1506 смарт: Фролов 18.10.2023
		//-- #1416 смарт: Фролов 22.09.2023	
		ИначеЕсли ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда	
			ТемаПисьма = "Пакет документов по реализации №" + ДокСсылка.Номер + " от " + Формат(ДокСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'"); 	
		Иначе	
			Попытка
	            ТемаПисьма = "Пакет документов "+?(ДокСсылка<>Неопределено И ДокСсылка.Организация.ИНН="7722457913","ООО Ковчег","")+" по заданию на перевозку №" + ДокСсылка.Номер + " от " + Формат(ДокСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'"); 
	        Исключение  
	            ТемаПисьма = "Пакет документов по заданию на перевозку №" + ДокСсылка.Номер + " от " + Формат(ДокСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'"); 
			КонецПопытки; 
		КонецЕсли; 
		//-- #1353 смарт: Фролов 05.09.2023
        //-- смарт:Подкин #1121 05.08.2022 8:54:43
		//-- смарт:ММ 18.08.2021
		
		//++ смарт:ММ 698 03.11.2021 
		КонецЕсли;
		//-- смарт:ММ 03.11.2021
	
		ТекстПисьма = "Во вложении прикреплен " + ТемаПисьма;	
	
		ДанныеОтправки = Новый Структура("Тема,Заголовок,Вложения", ТемаПисьма, ТекстПисьма, Вложения);
			
		ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,,,,,,, Ложь);

		ПараметрыПисьма.Вставить("АдресОтвета", "buh@smart-t.ru");
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);			
			
			ТекстСообщения = "Пакет документов отправлен на электронную почту " + АдресаДляОтправкиСтрокой;
						
			ЗаписьЖурналаРегистрации("смартОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение
			//++ #1416 смарт: Фролов 29.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,ДокСсылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 29.08.2023
			ТекстСообщения = "Не удалось отправить пакет документов на электронную почту" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("смартОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;

		Для Каждого СтруктураВложение Из МассивСтруктурВложений Цикл
			УдалитьИзВременногоХранилища(СтруктураВложение.АдресХранилища);
		КонецЦикла;
    КонецЕсли;
    
КонецФункции //-- смарт:ММ 27.07.2021

//++ #1353 смарт: Фролов 06.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
Функция ПолучитьСписокАдресовРассылкиДляПакетаАдмирал(СкладАдмирал,Самовывоз=Ложь)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	                    |	СкладысмартАдресаДляОтправкиПакетаНаСклад.смартАдресДляОтправкиПакетаНаСклад КАК смартАдресДляОтправкиПакетаНаСклад
	                    |ИЗ
	                    |	Справочник.Склады.смартАдресаДляОтправкиПакетаНаСклад КАК СкладысмартАдресаДляОтправкиПакетаНаСклад
	                    |ГДЕ
	                    |	СкладысмартАдресаДляОтправкиПакетаНаСклад.Ссылка = &Ссылка
	                    |	И  1 = 1 ";
	Если Самовывоз Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"1 = 1","СкладысмартАдресаДляОтправкиПакетаНаСклад.смартСамовывоз");
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"1 = 1","СкладысмартАдресаДляОтправкиПакетаНаСклад.смартДоставка");
	КонецЕсли;	
	Запрос.УстановитьПараметр("Ссылка",СкладАдмирал);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("смартАдресДляОтправкиПакетаНаСклад");
КонецФункции	//-- #1353 смарт: Фролов 06.09.2023

//++ смарт:ММ 633 10.09.2021
Функция ПартнерПринадлежитСегменту(Партнер, Сегмент) Экспорт

	Принадлежит = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Партнер) ИЛИ НЕ ЗначениеЗаполнено(Сегмент) Тогда
		Возврат Принадлежит;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартнерыСегмента.Партнер КАК Партнер
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|ГДЕ
	|	ПартнерыСегмента.Сегмент = &Сегмент
	|	И ПартнерыСегмента.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Принадлежит = НЕ РезультатЗапроса.Пустой();
	
	Возврат Принадлежит;
	
КонецФункции //-- смарт:ММ 10.09.2021

//++ смарт:ММ 615 17.09.2021 СМС инженеру
Процедура ОбновитьБаланс(ТекущийБаланс) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НастройкаОбъект = Справочники.смартПредопределенныеЗначения.ТекущийБалансSMSRU.ПолучитьОбъект();
	НастройкаОбъект.Значение = ТекущийБаланс;
	НастройкаОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);          
КонецПроцедуры //-- смарт:ММ 17.09.2021

//++ смарт:ММ 615 15.09.2021 СМС инженеру
Функция ОтправитьСМСПользователю(Пользователь, ТекстСообщения) Экспорт
	
	РезультатОтправки = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЛогинДляОтправкиSMS 	= НастройкиОтправкиSMS.Логин;
	ИмяОтправителя 			= НастройкиОтправкиSMS.ИмяОтправителя;
	ПарольДляОтправкиSMS 	= НастройкиОтправкиSMS.Пароль; 
	
	//++ #1735 смарт: Ермаков 02.04.2024 / Не отправляются СМС пользователям
	ТелефонПользователя = 
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				Пользователь,  
				Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя,
				,
				Истина);
	//-- #1735 смарт: Ермаков 02.04.2024				
				
	Если НЕ ЗначениеЗаполнено(ТелефонПользователя) Тогда
		РезультатОтправки.ОписаниеОшибки = "Не указан телефон пользователя " + Пользователь;
		Возврат РезультатОтправки;
	КонецЕсли;
			
	Если Не Взаимодействия.КорректноВведенНомерТелефона(ТелефонПользователя) Тогда
		
		ТекстОшибки = "SMS не отправлено: номер телефона пользователя " + Пользователь + " введен некорректно";
		ЗаписьЖурналаРегистрации("Отправка SMS пользователю (смарт)", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		РезультатОтправки.ОписаниеОшибки = ТекстОшибки;
		
		Возврат РезультатОтправки;
	КонецЕсли;
	
	НомерДляОтправки = ФорматироватьНомер(ТелефонПользователя);
	
	Если ЗначениеЗаполнено(НомерДляОтправки) Тогда
				
		Если НЕ смартРабочаяБаза() Тогда
			
			ОсталосьБесплатныхСМС = ОтправкаSMSЧерезSMSRU.смартПолучитьОстатокБесплатныхСМС(ЛогинДляОтправкиSMS, ПарольДляОтправкиSMS);
			
			Если ОсталосьБесплатныхСМС = 0 Тогда
				ТекстОшибки = "SMS инженеру не отправлено (ограничение тестовой базы)";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				РезультатОтправки.ОписаниеОшибки = ТекстОшибки;
				Возврат РезультатОтправки;
			Иначе
				НомерДляРабочейБазы = НомерДляОтправки;
				НомерДляОтправки = ФорматироватьНомер(ЛогинДляОтправкиSMS);
				ОбщегоНазначения.СообщитьПользователю("SMS отправлено на номер " + НомерДляОтправки + " (в рабочей базе отправилось бы на номер " + НомерДляРабочейБазы + ")");
			КонецЕсли;			
		КонецЕсли;
	
		НомерДляОтправкиМассив = Новый Массив;
		НомерДляОтправкиМассив.Добавить(НомерДляОтправки);
		
		РезультатОтправки = ОтправкаSMSЧерезSMSRU.ОтправитьSMS(НомерДляОтправкиМассив, ТекстСообщения, ИмяОтправителя, ЛогинДляОтправкиSMS, ПарольДляОтправкиSMS);
		
		Если НЕ ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда  
			
			//++ #1803 смарт: Мосолов 27.04.2024 //Доработать отправку СМС из документа Заявка на ремонтные работы
			//ЗаписьЖурналаРегистрации("Отправка SMS пользователю (смарт)", УровеньЖурналаРегистрации.Информация,,, "SMS отправлено");
			
			ТекстЖурнала = "SMS отправлено" 
						+ Символы.ПС + "Пользователь: " + Пользователь
						+ Символы.ПС + "На номер " + Строка(ТелефонПользователя)
						+ Символы.ПС + "Текст: " + ТекстСообщения; 
						
			ЗаписьЖурналаРегистрации("Отправка SMS пользователю (смарт)", УровеньЖурналаРегистрации.Информация,,, ТекстЖурнала);
			//-- #1803 смарт: Мосолов 27.04.2024
			
		Иначе

			//++ #1803 смарт: Мосолов 27.04.2024 //Доработать отправку СМС из документа Заявка на ремонтные работы
			//ЗаписьЖурналаРегистрации("Отправка SMS пользователю (смарт)", УровеньЖурналаРегистрации.Ошибка,,, "SMS не отправлено: " + РезультатОтправки.ОписаниеОшибки);
			
			ТекстЖурнала = "SMS не отправлено: " + РезультатОтправки.ОписаниеОшибки 
						+ Символы.ПС + "Пользователь: " + Пользователь
						+ Символы.ПС + "На номер " + Строка(ТелефонПользователя)
						+ Символы.ПС + "Текст: " + ТекстСообщения; 
						
			ЗаписьЖурналаРегистрации("Отправка SMS пользователю (смарт)", УровеньЖурналаРегистрации.Ошибка,,, ТекстЖурнала);
			//-- #1803 смарт: Мосолов 27.04.2024
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОтправки;
	
КонецФункции //-- смарт:ММ 15.09.2021

//++ смарт:ММ 615 17.09.2021 СМС инженеру 
Функция ФорматироватьНомер(Номер)
	
	Результат = "";
	ДопустимыеСимволы = "+1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Результат) > 10 Тогда
		ПервыйСимвол = Лев(Результат, 1);
		Если ПервыйСимвол = "8" Тогда
			Результат = "+7" + Сред(Результат, 2);
		ИначеЕсли ПервыйСимвол <> "+" Тогда
			Результат = "+" + Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 17.09.2021

//++ смарт:ММ 667 06.10.2021 
Функция ОбработатьКодНоменклатуры(знач ИсходныйКод) Экспорт
	
	Результат = "";
	
	ИсходныйКод = СокрЛП(ИсходныйКод);
	
	Кириллица = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЪЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщыъьэюя"; 

	ВсеНеДопустимыеСимволы = Новый Соответствие;
	Для Позиция = 1 По СтрДлина(Кириллица) Цикл
		ВсеНеДопустимыеСимволы[Сред(Кириллица, Позиция, 1)] = Истина;
	КонецЦикла;
	
	Для Позиция = 1 По СтрДлина(ИсходныйКод) Цикл
		ТекСимвол = Сред(ИсходныйКод, Позиция, 1);
		Если ВсеНеДопустимыеСимволы[ТекСимвол] = Неопределено Тогда
			Результат = Результат + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Если Лев(Результат, 1) = "-" Тогда
		Результат = Сред(Результат, 2);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 06.10.2021

//++ Демичев №809 13.12.2021((
&НаСервере
Функция ПолучитьНастройкиПечатиНомераПоОрганизацииИПрефиксу(ПрефиксОрганизации,ПрефиксИБ = Неопределено) Экспорт
	
    УсловиеВыборки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	смартПрефиксыИнформационныхБаз.ПрефиксИБ КАК ПрефиксИБ,
		|	смартПрефиксыИнформационныхБаз.ПрефиксОрганизации КАК ПрефиксОрганизации,
		|	смартПрефиксыИнформационныхБаз.ПечататьПрефиксИБ КАК ПечататьПрефиксИБ,
		|	смартПрефиксыИнформационныхБаз.ПечататьПрефиксОрганизации КАК ПечататьПрефиксОрганизации
		|ИЗ
		|	РегистрСведений.смартПрефиксыИнформационныхБаз КАК смартПрефиксыИнформационныхБаз
		|ГДЕ
		|	смартПрефиксыИнформационныхБаз.ПрефиксОрганизации = &ПрефиксОрганизации %Условие%";
	
	Запрос.УстановитьПараметр("ПрефиксОрганизации", ПрефиксОрганизации);
	
	Если ПрефиксИБ <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ПрефиксИБ", ПрефиксИБ);
		
		УсловиеВыборки = " И смартПрефиксыИнформационныхБаз.ПрефиксИБ = &ПрефиксИБ"; 
		
	КонецЕсли;
	
	Если УсловиеВыборки <> "" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",УсловиеВыборки);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%","");
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//++ Демичев №894 14.02.2022((
			
	//ВыборкаДЗ = РезультатЗапроса.Выбрать();
	//
	//ВыборкаДЗ.Следующий();
	
	РезультатВСтр = Новый Структура;
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		РезультатВСтр.Вставить(Колонка.Имя);
	КонецЦикла;    
	
	ВыборкаДЗ = РезультатЗапроса.Выбрать();
	ВыборкаДЗ.Следующий();   
	
	ЗаполнитьЗначенияСвойств(РезультатВСтр,ВыборкаДЗ);
	
	//-- Демичев №894 14.02.2022))
	
	Возврат РезультатВСтр;
	
КонецФункции	
//-- Демичев №809 13.12.2021))

//++ смарт:Подкин #914,916 15.03.2022 19:31:18
&НаСервере
Функция смартПроверкаОтгруженногоОплаченного(Заказ) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   СостоянияЗаказовКлиентов.Заказ КАК Заказ
    |ИЗ
    |   РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
    |ГДЕ
    |   СостоянияЗаказовКлиентов.Заказ = &Заказ
    |   И СостоянияЗаказовКлиентов.Состояние В(&Состояние)";
    СостоянияЗаказов= Новый СписокЗначений();
    СостоянияЗаказов.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
    СостоянияЗаказов.Добавить(Перечисления.СостоянияЗаказовКлиентов.Закрыт);
    
    Запрос.УстановитьПараметр("Состояние",СостоянияЗаказов);
    Запрос.УстановитьПараметр("Заказ", Заказ);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Возврат РезультатЗапроса.Пустой(); //Истина - при пустом результате нужна проверка
    
КонецФункции 
//-- смарт:Подкин #914,916 15.03.2022 19:31:18    

&НаСервере
//++ #1794 смарт: Фролов 24.04.2024 //Запрет печати счета из Заказа клиента если в нем есть оборудование и он создан не на основании Интереса.
Функция ПроверитьНаличиеИнтересаПоЗаказу(ЗаказКлиента) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CRM_ЖурналДокументов.CRM_Интерес КАК CRM_Интерес
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|		ПО ЗаказКлиента.Ссылка = CRM_ЖурналДокументов.Объект
	|			И (CRM_ЖурналДокументов.ГлавнаяЗапись)
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.CRM_Интерес) Тогда
			Возврат Истина;
		Иначе	
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции //-- #1794 смарт: Фролов 24.04.2024

//++ #1793 смарт: Фролов 02.05.2024 //Доработка помошника создания Интереса, добавление возможности выбора валюты.
Функция ВернутьКвалификациюПоТипуПродукта(ТипПродукта) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	смартКвалификацииМенеджеров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров КАК смартКвалификацииМенеджеров
	|ГДЕ
	|	смартКвалификацииМенеджеров.ТипПродукта = &ТипПродукта");
	Запрос.УстановитьПараметр("ТипПродукта", ТипПродукта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.смартКвалификацииМенеджеров.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции //-- #1793 смарт: Фролов 02.05.2024

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при вводе контактной информации
#Область ПроверкаАдресаEmai

//++#1256 смарт: Лопато 03.06.2024 //Изменить проверку на дубли email при вводе в Контактном лице (продолжение задачи 1012)  
Функция ПроверитьАдресЭлектроннойПочты(Текст, Ссылка, Владелец = Неопределено) Экспорт
	
	Возврат АдресЭлПочтыПроверкаСВыводомСообщений(СокрЛП(Текст), Ссылка, Владелец);
	
КонецФункции //--#1256 смарт: Лопато 03.06.2024 

//++#1012 смарт: Каратеев 14.09.2022 // ПроверитьАдресНаВалидность Отключена
//Функция временно не используется, так как занимает слишком длительное время для проверки.
//Перед началом использования необходимо решить вопрос скорости получения ответа.
Функция ПроверитьАдресНаВалидность(Адрес)
	
	АдресСервиса = "api.quickemailverification.com/v1";
	АдресРесурса = "/verify?email=" + Адрес + "&apikey=d2cdc5f4577766b121ae83522ef677879e62a0f83bfe1ddc8349c2291b54";
	СтрокаПараметров = "";
	ЗащищенноеСоединение = Ложь;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	//HTTPЗапрос.Заголовки.Вставить("accept", "application/json");
	//HTTPЗапрос.Заголовки.Вставить("Authorization", "7pi2d8knC2DgpJ3gFFYe6c3IxPQj1LGX2OO5");
	//HTTPСоединение = Новый HTTPСоединение(АдресСервиса, , , , , , ?(ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL, Неопределено));
	HTTPСоединение = Новый HTTPСоединение(АдресСервиса);
	
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда 
		
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда

			СтрокаОтвет = СтрЗаменить(СтрокаОтвет,"{","");
			СтрокаОтвет = СтрЗаменить(СтрокаОтвет,"}","");
			
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаОтвет, ",");
			
			Если МассивСтрок.Количество() > 0 Тогда 
				
				Если МассивСтрок[0] = """result"":""valid""" Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь; 
	
КонецФункции 
//--#1012 смарт: Каратеев 14.09.2022 // ПроверитьАдресНаВалидность Отключена

//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
Функция ПолучитьДублиПоКонтактнойИнформацииСправочников(ПараметрыКИ) Экспорт

	МассивРезультат = Новый Массив;
	
	ВидСправочника = "";

	Запрос = Новый Запрос;
	
	Если ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
		ИЛИ ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.Партнеры")
		ИЛИ ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда

		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Ссылка КАК Контрагент
			|ПОМЕСТИТЬ ВТ_Контрагенты
			|ИЗ
			|	Справочник.Контрагенты
			|ГДЕ
			|	НЕ ПометкаУдаления
			|	И &УсловиеКонтрагент
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Ссылка КАК КонтактноеЛицо
			|ПОМЕСТИТЬ ВТ_КонтактныеЛица
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров
			|ГДЕ
			|	НЕ ПометкаУдаления
			|	И &УсловиеКонтактноеЛицо
			|;
			|
			//++ #Б-2314 смарт: Лопато 17.02.2025 //Справочник Контактные лица партнеров. Проверка на дублей КИ  
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Ссылка КАК КонтактноеЛицо,
			|	СОКРЛП(
			|		СТРЗАМЕНИТЬ(
			|			СТРЗАМЕНИТЬ(
			|				СТРЗАМЕНИТЬ(
			|					СТРЗАМЕНИТЬ(
			|						СТРЗАМЕНИТЬ(
			|							СТРЗАМЕНИТЬ(
			|								СТРЗАМЕНИТЬ( 
			|									СТРЗАМЕНИТЬ(
			|										СТРЗАМЕНИТЬ(
			|											СТРЗАМЕНИТЬ(
			|												СТРЗАМЕНИТЬ(
			|													СТРЗАМЕНИТЬ(
			|														смартТелефонНаСайте
			|													, ""/"", """")
			|												, "" "", """")
			|											, "";"", """")
			|										, ""	"", """")
			|									, ""."", """")
			|								, "":"", """")
			|							, ""–"", """")
			|						, "" "", """")
			|					, ""-"", """")
			|				, ""("", """")
			|			, "")"", """")
			|		, ""+"", """")
			|	) КАК смартТелефонНаСайте
			|ПОМЕСТИТЬ КЛДанныеСайтаТелефон
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров
			|ГДЕ
			|	&ТипКИ = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И смартТелефонНаСайте <> """"
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Ссылка КАК КонтактноеЛицо,
			|	смартЭлектроннаяПочтаНаСайте КАК смартЭлектроннаяПочтаНаСайте,
			|	смартЛогинНаСайте КАК смартЛогинНаСайте
			|ПОМЕСТИТЬ КЛДанныеСайтаПочта
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров
			|ГДЕ
			|	&ТипКИ = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|	И (смартЭлектроннаяПочтаНаСайте <> """"
			|	   ИЛИ смартЛогинНаСайте <> """")
			|;
			|
			//-- #Б-2314 смарт: Лопато 17.02.2025
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	""Контактного лица"" КАК Представление,
			|	ОбъектВыборки.Вид КАК Вид,
			|	ОбъектВыборки.Ссылка КАК Ссылка,
			|	ОбъектВыборки.Ссылка.Представление КАК ПредставлениеСсылки,
			|	ОбъектВыборки.Ссылка.Владелец.Представление КАК ПредставлениеПартнер
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ОбъектВыборки
			|ГДЕ
			|	НЕ ОбъектВыборки.Ссылка.ПометкаУдаления
			|	И НЕ ОбъектВыборки.Ссылка В(ВЫБРАТЬ КонтактноеЛицо ИЗ ВТ_КонтактныеЛица)
			|	И ОбъектВыборки.Ссылка.Владелец <> &Партнер
			|	И ОбъектВыборки.Тип = &ТипКИ
			|	И ВЫБОР 
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) ТОГДА 
			|			ОбъектВыборки.АдресЭП = &ПредставлениеКИ
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон) ТОГДА 
			|			ОбъектВыборки.НомерТелефона = &ПредставлениеКИ
			|        ИНАЧЕ 
			|			ЛОЖЬ 
			|	  КОНЕЦ
			|
			|ОБЪЕДИНИТЬ
			|
			//++ #Б-2314 смарт: Лопато 17.02.2025 //Справочник Контактные лица партнеров. Проверка на дублей КИ  
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	""Контактного лица"" КАК Представление,
			|	""Телефон на сайте"" КАК Вид,
			|	КонтактноеЛицо КАК Ссылка,
			|	КонтактноеЛицо.Представление КАК ПредставлениеСсылки,
			|	КонтактноеЛицо.Владелец.Представление КАК ПредставлениеПартнер
			|ИЗ
			|	КЛДанныеСайтаТелефон
			|ГДЕ
			|	&ТипКИ = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И ВЫБОР
			|		КОГДА (ДЛИНАСТРОКИ(смартТелефонНаСайте) = 11 И ПОДСТРОКА(смартТелефонНаСайте, 1, 1) = ""8"")
			|			ТОГДА ""7"" + ПОДСТРОКА(смартТелефонНаСайте, 2, 10)
			|		КОГДА ДЛИНАСТРОКИ(смартТелефонНаСайте) = 10
			|			ТОГДА ""7"" + смартТелефонНаСайте
			|		ИНАЧЕ смартТелефонНаСайте
			|	КОНЕЦ = &ПредставлениеКИ
			//++ #Б-5452 смарт: Фролов 30.01.2026 //Заполнение адреса электронной почты в карточке контакта, если зафиксирована привязка к лк интернет-магазина
			|	И 1 = 1
			//-- #Б-5452 смарт: Фролов 30.01.2026
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	""Контактного лица"" КАК Представление,
			|	""Электронная почта на сайте"" КАК Вид,
			|	КонтактноеЛицо КАК Ссылка,
			|	КонтактноеЛицо.Представление КАК ПредставлениеСсылки,
			|	КонтактноеЛицо.Владелец.Представление КАК ПредставлениеПартнер
			|ИЗ
			|	КЛДанныеСайтаПочта
			|ГДЕ
			|	&ТипКИ = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|	И смартЭлектроннаяПочтаНаСайте <> """"
			|	И смартЭлектроннаяПочтаНаСайте = &ПредставлениеКИ
			//++ #Б-5452 смарт: Фролов 30.01.2026 //Заполнение адреса электронной почты в карточке контакта, если зафиксирована привязка к лк интернет-магазина
			|	И 2 = 2
			//-- #Б-5452 смарт: Фролов 30.01.2026
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	""Контактного лица"" КАК Представление,
			|	""Логин на сайте"" КАК Вид,
			|	КонтактноеЛицо КАК Ссылка,
			|	КонтактноеЛицо.Представление КАК ПредставлениеСсылки,
			|	КонтактноеЛицо.Владелец.Представление КАК ПредставлениеПартнер
			|ИЗ
			|	КЛДанныеСайтаПочта
			|ГДЕ
			|	&ТипКИ = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|	И смартЛогинНаСайте <> """"
			|	И смартЛогинНаСайте = &ПредставлениеКИ
			//++ #Б-5452 смарт: Фролов 30.01.2026 //Заполнение адреса электронной почты в карточке контакта, если зафиксирована привязка к лк интернет-магазина
			|	И 2 = 2
			//-- #Б-5452 смарт: Фролов 30.01.2026
			|
			|ОБЪЕДИНИТЬ
			|
			//-- #Б-2314 смарт: Лопато 17.02.2025
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	""Клиента"",
			|	ОбъектВыборки.Вид,
			|	ОбъектВыборки.Ссылка,
			|	ОбъектВыборки.Ссылка.Представление,
			|	ОбъектВыборки.Ссылка.Представление
			|ИЗ
			|	Справочник.Партнеры.КонтактнаяИнформация КАК ОбъектВыборки
			|ГДЕ
			|	НЕ ОбъектВыборки.Ссылка.ПометкаУдаления
			|	И ОбъектВыборки.Ссылка <> &Партнер
			|	И ОбъектВыборки.Тип = &ТипКИ
			|	И ВЫБОР 
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) ТОГДА 
			|			ОбъектВыборки.АдресЭП = &ПредставлениеКИ
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон) ТОГДА 
			|			ОбъектВыборки.НомерТелефона = &ПредставлениеКИ
			|        ИНАЧЕ 
			|			ЛОЖЬ 
			|	  КОНЕЦ
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	""Контрагента"",
			|	ОбъектВыборки.Вид,
			|	ОбъектВыборки.Ссылка,
			|	ОбъектВыборки.Ссылка.Представление,
			|	ОбъектВыборки.Ссылка.Партнер.Представление
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК ОбъектВыборки
			|ГДЕ
			|	НЕ ОбъектВыборки.Ссылка.ПометкаУдаления
			|	И НЕ ОбъектВыборки.Ссылка В(ВЫБРАТЬ Контрагент ИЗ ВТ_Контрагенты)
			|	И ОбъектВыборки.Ссылка.Партнер <> &Партнер
			|	И ОбъектВыборки.Тип = &ТипКИ
			|	И ВЫБОР 
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) ТОГДА 
			|			ОбъектВыборки.АдресЭП = &ПредставлениеКИ
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон) ТОГДА 
			|			ОбъектВыборки.НомерТелефона = &ПредставлениеКИ
			|        ИНАЧЕ 
			|			ЛОЖЬ 
			|	  КОНЕЦ";
		
		Если ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			
			Партнер = ПараметрыКИ.Владелец;

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент",     "Партнер = &Партнер");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтактноеЛицо", "Ссылка = &Ссылка");
			
			//++ #Б-5452 смарт: Фролов 30.01.2026 //Заполнение адреса электронной почты в карточке контакта, если зафиксирована привязка к лк интернет-магазина
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "НЕ КЛДанныеСайтаТелефон.КонтактноеЛицо = &Ссылка");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "НЕ КЛДанныеСайтаПочта.КонтактноеЛицо = &Ссылка");
			//-- #Б-5452 смарт: Фролов 30.01.2026
			
		ИначеЕсли ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда
			
			Партнер = ПараметрыКИ.Ссылка;	

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент",     "Партнер = &Партнер");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтактноеЛицо", "Владелец = &Партнер");
			
		ИначеЕсли ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Партнер = ПараметрыКИ.Владелец;

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент",     "Ссылка = &Контрагент");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтактноеЛицо", "Владелец = &Партнер");
			
			Запрос.УстановитьПараметр("Контрагент", ПараметрыКИ.Ссылка);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Партнер", Партнер);
		
	Иначе
		
		Если ПараметрыКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			
			Возврат МассивРезультат;
			
		КонецЕсли;	
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	""Справочника"" КАК Представление,
			|	ОбъектВыборки.Вид КАК Вид,
			|	ОбъектВыборки.Ссылка КАК Ссылка,
			|	ОбъектВыборки.Ссылка.Представление КАК ПредставлениеСсылки
			|ИЗ
			|	Справочник.%СправочникДляПроверки%.КонтактнаяИнформация КАК ОбъектВыборки
			|ГДЕ
			|	НЕ ОбъектВыборки.Ссылка.ПометкаУдаления
			|	И ОбъектВыборки.Ссылка <> &Ссылка
			|	И ОбъектВыборки.Тип = &ТипКИ
			|	И ВЫБОР 
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) ТОГДА 
			|			ОбъектВыборки.АдресЭП = &ПредставлениеКИ
			|	 	 КОГДА ОбъектВыборки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон) ТОГДА 
			|			ОбъектВыборки.НомерТелефона = &ПредставлениеКИ
			|        ИНАЧЕ 
			|			ЛОЖЬ 
			|	  КОНЕЦ";

		ВидСправочника = ПолучитьВидСправочника(ПараметрыКИ.Ссылка);
		
		Если НЕ ЗначениеЗаполнено(ВидСправочника) Тогда
			
			Возврат МассивРезультат;
			
		КонецЕсли;	
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СправочникДляПроверки%", ВидСправочника);
		
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("ПредставлениеКИ", ПараметрыКИ.ПредставлениеКИ);
	Запрос.УстановитьПараметр("ТипКИ", 			 ПараметрыКИ.ТипКИ);
	Запрос.УстановитьПараметр("Ссылка", 		 ПараметрыКИ.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураРезультата = Новый Структура;
		
		ТекстСообщения = "Как """ + СокрЛП(ВыборкаДетальныеЗаписи.Вид) + """ "
						 + ?(ВыборкаДетальныеЗаписи.Представление = "Справочника", 
								 ВыборкаДетальныеЗаписи.Представление + " " + ВидСправочника,
								 ВыборкаДетальныеЗаписи.Представление)
						 + " """ + ВыборкаДетальныеЗаписи.ПредставлениеСсылки + """";
		
		Если (ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
			ИЛИ ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.Партнеры")
			ИЛИ ТипЗнч(ПараметрыКИ.Ссылка) = Тип("СправочникСсылка.Контрагенты"))
			И ВыборкаДетальныеЗаписи.Представление <> "Клиента" Тогда
			
			ТекстСообщения = ТекстСообщения + " у клиента """ + ВыборкаДетальныеЗаписи.ПредставлениеПартнер + """";
			
		КонецЕсли;	
		
		СтруктураРезультата.Вставить("ТекстСообщения", ТекстСообщения);													   
		СтруктураРезультата.Вставить("Ключ", 		   ВыборкаДетальныеЗаписи.Ссылка);
		
		МассивРезультат.Добавить(СтруктураРезультата);
						  
	КонецЦикла;

	Возврат МассивРезультат;
	
КонецФункции //-- #1152 смарт: Лопато 18.10.2024

Функция ПолучитьВидСправочника(Ссылка)

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "Контрагенты";	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда 
	    Возврат "Организации";	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда 
	    Возврат "Партнеры";		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда 
	    Возврат "Пользователи";			
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
	    Возврат "ФизическиеЛица";			
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда 
	    Возврат "CRM_ПотенциальныеКлиенты";			
	//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
	Иначе
		Возврат "";
	//-- #1152 смарт: Лопато 18.10.2024	
	КонецЕсли;

КонецФункции 

//++#1256 смарт: Лопато 03.06.2024 //Изменить проверку на дубли email при вводе в Контактном лице (продолжение задачи 1012)  
Функция АдресЭлПочтыПроверкаСВыводомСообщений(Знач Адрес, Ссылка, Владелец = Неопределено, РазрешитьЛокальныеАдреса = Ложь) Экспорт
//--#1256 смарт: Лопато 03.06.2024
	
	ВозврСтруктура = Новый Структура();
	ВозврСтруктура.Вставить("СообщениеОшибки", "");
	ВозврСтруктура.Вставить("КодОшибки", 0);
	
	// Коды Ошибок
	СообщениеПроверкаСобака					= НСтр("ru='В адресе электронной почты должен быть один символ @'");
	СообщениеПроверкаДвоеточие				= НСтр("ru='В адресе электронной почты может быть только один символ :'");
	СообщениеДвеТочки						= НСтр("ru='В адресе электронной почты нельзя ставить две точки подряд'");
	СообщениеНедопустимыеСимволы			= НСтр("ru='Допускается использование букв, цифр, английского и русского алфавита(если .рф)"
"Недопустимые символы в адресе электронной почты."
"Адреса электронной почты не должен содержать: !#$%^&*()+`~|\/=;,ПРОБЕЛ'");
	СообщениеНеверныйФорматПочтовогоАдреса	= НСтр("ru='Домен(после @) и локальное имя не могут быть пустыми. Также длина домена должна быть не более 255 символов, локального имени - 64'");
	СообщениеСимволыВокругДомена			= НСтр("ru='В начале и в конце домена (например .ru) не может быть символов .@_-:+'");
	СообщениеМинимумОднаТочка				= НСтр("ru='В домене (после @) должна быть минимум одна точка'");
	СообщениеПодчеркиваниеВДомене			= НСтр("ru='В домене (после @) не должно быть символа подчеркивания'");
	СообщениеДвоеточиеВДомене				= НСтр("ru='В домене (после @) не должно быть символа двоеточие'");
	СообщениеПлюсВДомене					= НСтр("ru='В домене (после @) не должно быть символа +'");
	СообщениеФорматЗоны						= НСтр("ru='Формат зона домена(например ru, com): минимум 2 символа, только буквы'");
	СообщениеНаличиеДублей					= НСтр("ru='Данный адрес уже закреплён за: '");
	СообщениеНеВалиден						= НСтр("ru='Данный адрес не существует'");
	
	// Допустимые символы для email.
	Буквы = "abcdefghijklmnopqrstuvwxyz";
	СимволыРусскогоАлфавита = "ёйцукенгшщзхъфывапролджэячсмитьбю"; 
	Цифры = "0123456789";
	СпецСимволы = ".@_-:+";
	
	// проверяем символ @
	Если СтрЧислоВхождений(Адрес, "@") <> 1 Тогда
		ВозврСтруктура.КодОшибки = 1;
		ВозврСтруктура.СообщениеОшибки = СообщениеПроверкаСобака; 
		Возврат ВозврСтруктура; 
	КонецЕсли;
	
	// Разрешаем двоеточие только один раз.
	Если СтрЧислоВхождений(Адрес, ":") > 1 Тогда
		ВозврСтруктура.КодОшибки = 2;
		ВозврСтруктура.СообщениеОшибки = СообщениеПроверкаДвоеточие; 
		Возврат ВозврСтруктура; 
	КонецЕсли;
	
	// проверяем две точки подряд
	Если СтрНайти(Адрес, "..") > 0 Тогда
		ВозврСтруктура.КодОшибки = 3;
		ВозврСтруктура.СообщениеОшибки = СообщениеДвеТочки; 
		Возврат ВозврСтруктура; 
	КонецЕсли;
	
	// Приводим строку адреса к нижнему регистру.
	Адрес = НРег(Адрес);
	
	// Разбираем адрес на local-part и domain.
	Позиция = СтрНайти(Адрес,"@");
	ЛокальноеИмя = Лев(Адрес, Позиция - 1);
	Домен = Сред(Адрес, Позиция + 1);
	
	// В домене должна быть минимум одна точка.
	Если Не РазрешитьЛокальныеАдреса И СтрНайти(Домен,".") = 0 Тогда
		ВозврСтруктура.КодОшибки = 7;
		ВозврСтруктура.СообщениеОшибки = СообщениеМинимумОднаТочка; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// Проверяем на заполненность и допустимость длины.
	Если ПустаяСтрока(ЛокальноеИмя)
	 	Или ПустаяСтрока(Домен)
		Или СтрДлина(ЛокальноеИмя) > 64
		Или СтрДлина(Домен) > 255 Тогда
		
		ВозврСтруктура.КодОшибки = 5;
		ВозврСтруктура.СообщениеОшибки = СообщениеНеверныйФорматПочтовогоАдреса; 
		Возврат ВозврСтруктура;
	КонецЕсли;

	// Выделяем зону (TLD) из имени домена.
	Зона = Домен;
	Позиция = СтрНайти(Зона,".");
	Пока Позиция > 0 Цикл
		Зона = Сред(Зона, Позиция + 1);
		Позиция = СтрНайти(Зона,".");
	КонецЦикла;
	
	// Проверяем зону домена (минимум 2 символа, только буквы).
	Если Прав(Адрес,3) = ".рф" Тогда
		Буквы = Буквы + СимволыРусскогоАлфавита;
	КонецЕсли;
	
	Если НЕ (РазрешитьЛокальныеАдреса Или СтрДлина(Зона) >= 2 И СтрокаСодержитТолькоДопустимыеСимволы(Зона,Буквы)) Тогда
	
		ВозврСтруктура.КодОшибки = 11;
		ВозврСтруктура.СообщениеОшибки = СообщениеФорматЗоны; 
		Возврат ВозврСтруктура;
	
	КонецЕсли;
	
	// Проверяем допустимые символы.
	Если СтрДлина(Зона) >= 2 И Прав(Адрес,3) = ".рф" Тогда
		ДопустимыеСимволы = Буквы + Цифры + СпецСимволы + СимволыРусскогоАлфавита;
	Иначе 
		ДопустимыеСимволы = Буквы + Цифры + СпецСимволы;		
	КонецЕсли;
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(Адрес, ДопустимыеСимволы) Тогда
		ВозврСтруктура.КодОшибки = 4;
		ВозврСтруктура.СообщениеОшибки = СообщениеНедопустимыеСимволы; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// Проверяем наличие спецсимволов в начале и в конце домена.
	Если ЕстьСимволыВНачалеВКонце(Домен, СпецСимволы) Тогда
		ВозврСтруктура.КодОшибки = 6;
		ВозврСтруктура.СообщениеОшибки = СообщениеСимволыВокругДомена; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// В домене не должно быть символа подчеркивания.
	Если СтрНайти(Домен,"_") > 0 Тогда
		ВозврСтруктура.КодОшибки = 8;
		ВозврСтруктура.СообщениеОшибки = СообщениеПодчеркиваниеВДомене; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// В домене не должно быть символа двоеточие.
	Если СтрНайти(Домен,":") > 0 Тогда
		ВозврСтруктура.КодОшибки = 9;
		ВозврСтруктура.СообщениеОшибки = СообщениеДвоеточиеВДомене; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// В домене не должно быть символа "плюс".
	Если СтрНайти(Домен,"+") > 0 Тогда
		ВозврСтруктура.КодОшибки = 10;
		ВозврСтруктура.СообщениеОшибки = СообщениеПлюсВДомене; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
	//Проверяем на наличие дублей
	СтруктураПараметровКИ = Новый Структура;

	СтруктураПараметровКИ.Вставить("Ссылка", 		  Ссылка);
	СтруктураПараметровКИ.Вставить("ПредставлениеКИ", Адрес);
	СтруктураПараметровКИ.Вставить("ТипКИ", 		  Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	СтруктураПараметровКИ.Вставить("Владелец", 		  Владелец);
	
	МассивСтруктурДублей = ПолучитьДублиПоКонтактнойИнформацииСправочников(СтруктураПараметровКИ);
		
	Если МассивСтруктурДублей.Количество() > 0  Тогда

		ВозврСтруктура.КодОшибки = 12;
		ВозврСтруктура.СообщениеОшибки = "Данный адрес электронной почты уже используется:" + Символы.ПС;

		ВозврСтруктура.Вставить("МассивДублей", МассивСтруктурДублей);
		
		Возврат ВозврСтруктура;
		
	КонецЕсли;
	//-- #1152 смарт: Лопато 18.10.2024
	
	//Проверка адреса на валидность
	//++#1012 смарт: Каратеев 14.09.2022 // ПроверитьАдресНаВалидность Отключена
	//Функция временно не используется, так как занимает слишком длительное время для проверки.
	//Перед началом использования необходимо решить вопрос скорости получения ответа.
	
	//АдресСуществует = ПроверитьАдресНаВалидность(Адрес);
	//Если НЕ АдресСуществует Тогда
	//
	//	ВозврСтруктура.КодОшибки = 13;
	//	ВозврСтруктура.СообщениеОшибки = СообщениеНеВалиден; 
	//	Возврат ВозврСтруктура;
	//	
	//КонецЕсли;
	
	//--#1012 смарт: Каратеев 14.09.2022 // ПроверитьАдресНаВалидность Отключена
	
	Возврат ВозврСтруктура;
	
КонецФункции

Функция СтрокаСодержитТолькоДопустимыеСимволы(Строка, ДопустимыеСимволы)
	МассивСимволов = Новый Массив;
	Для Позиция = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		МассивСимволов.Добавить(Сред(ДопустимыеСимволы,Позиция,1));
	КонецЦикла;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Если МассивСимволов.Найти(Сред(Строка, Позиция, 1)) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции 

Функция ЕстьСимволыВНачалеВКонце(Строка, ПроверяемыеСимволы)
	
	Для Позиция = 1 По СтрДлина(ПроверяемыеСимволы) Цикл
		Символ = Сред(ПроверяемыеСимволы, Позиция, 1);
		СимволНайден = (Лев(Строка,1) = Символ) Или (Прав(Строка,1) = Символ);
		Если СимволНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ПроверкаНомераТелефона

Функция ПроверитьТелефон(ДанныеСтроки) Экспорт

	Возврат ТелефонПроверкаСВыводомСообщений(ДанныеСтроки);	

КонецФункции 

Функция ПроверитьТелефонПриЗаписи(СтрДанных,Ссылка) Экспорт 
	
	Если Лев(СтрДанных.Представление,2) = "+7" Тогда
		Результат = ТелефонПроверкаСВыводомСообщений(СтрДанных);	 	
	Иначе
		Результат = ТелефонПроверкаСообщенияПриЗаписи(СтрДанных,Ссылка);
	КонецЕсли;
	
	Возврат Результат;
 
 КонецФункции 

Функция ТелефонПроверкаСообщенияПриЗаписи(ДанныеСтроки,Ссылка)

	ВозврСтруктура = Новый Структура();
	ВозврСтруктура.Вставить("СообщениеОшибки", "");
	ВозврСтруктура.Вставить("КодОшибки", 0); 

	СообщениеНетКодов		 = НСтр("ru='Не заполнен код страны и код города'");
	СообщениеСкобкаВНачале	 = НСтр("ru='Номер не может начинаться со скобки'");
	СообщениеНекорректныеСимволы  = НСтр("ru='Можно использовать только 0123456789+()-–‒'");
	СообщениеКодСтраныПлюс	 = НСтр("ru='Код страны должне начинаться с знака + и состоять из цифр'");
	
	ТелПредставление = ДанныеСтроки.Представление;

	// Проверяем допустимые символы.
    КорректныеСимволыВТелефоне = "0123456789+()-–‒ ";
	
	Добавочный = СтрНайти(ТелПредставление,", доб.");
	
	Если Добавочный > 0 Тогда
		КорректныеСимволыВТелефоне	= КорректныеСимволыВТелефоне + ",доб.";
	КонецЕсли; 
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(ТелПредставление, КорректныеСимволыВТелефоне) Тогда
		ВозврСтруктура.КодОшибки = 1;
		ВозврСтруктура.СообщениеОшибки = СообщениеНекорректныеСимволы; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// Проверяем на скобку в начале номера
	Если Лев(ТелПредставление, 1) = "(" Тогда
		ВозврСтруктура.КодОшибки = 7 ;
		ВозврСтруктура.СообщениеОшибки = СообщениеСкобкаВНачале; 
		Возврат ВозврСтруктура;
	КонецЕсли;

	//Проверяем на код города и номер телефона
	Значение = ДанныеСтроки.Значение;
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(Значение) Тогда
		КонтактнаяИнформацияСтруктурой = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
		
		Если КонтактнаяИнформацияСтруктурой.Свойство("countryCode") И 
			КонтактнаяИнформацияСтруктурой.Свойство("number") И
			КонтактнаяИнформацияСтруктурой.Свойство("areaCode") Тогда
			
			Если КонтактнаяИнформацияСтруктурой.countryCode = "" И КонтактнаяИнформацияСтруктурой.areaCode = "" Тогда
				ВозврСтруктура.КодОшибки = 6;
				ВозврСтруктура.СообщениеОшибки = СообщениеНетКодов; 
				Возврат ВозврСтруктура;
			ИначеЕсли КонтактнаяИнформацияСтруктурой.countryCode = "+" Тогда
				ВозврСтруктура.КодОшибки = 8;
				ВозврСтруктура.СообщениеОшибки = СообщениеКодСтраныПлюс; 
				Возврат ВозврСтруктура;
			//ИначеЕсли СтрДлина(КонтактнаяИнформацияСтруктурой.areaCode) <> 3 Тогда
			//	ВозврСтруктура.КодОшибки = 4;
			//	ВозврСтруктура.СообщениеОшибки = СообщениеКодГорода; 
			//	Возврат ВозврСтруктура;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	
	Возврат ВозврСтруктура;

 КонецФункции 
 
Функция ТелефонПроверкаСВыводомСообщений(ДанныеСтроки)
	
	ВозврСтруктура = Новый Структура();
	ВозврСтруктура.Вставить("СообщениеОшибки", "");
	ВозврСтруктура.Вставить("КодОшибки", 0);
	
	// Коды Ошибок
	СообщениеНекорректныеСимволы			= НСтр("ru='Можно использовать только 0123456789+()-–‒'");
	СообщениеНеверныйКодСтраны				= НСтр("ru='Российский номер должен начинаться с +7 или 8'");
	СообщениеКороткийномер					= НСтр("ru='Номер должен состоять из семи цифр'");
	СообщениеКодГорода						= НСтр("ru='Код города должен состоять из трёх цифр'");
	СообщениеНеформат						= НСтр("ru='Номер должен состоять из 11 цифр'");	
	СообщениеСкобкаВНачале					= НСтр("ru='Перед перед скобками должен быть код страны'");
	СообщениНеПлюсСемь						= НСтр("ru='Если номер начинается с + , то должен быть +7'");
	
	Представление = ДанныеСтроки.Представление;
	
	// Проверяем допустимые символы.
    КорректныеСимволыВТелефоне = "0123456789+()-–‒ ";
	
	Добавочный = СтрНайти(Представление,", доб.");
	
	Если Добавочный > 0 Тогда
		КорректныеСимволыВТелефоне	= КорректныеСимволыВТелефоне + ",доб.";
	КонецЕсли; 
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(Представление, КорректныеСимволыВТелефоне) Тогда
		ВозврСтруктура.КодОшибки = 1;
		ВозврСтруктура.СообщениеОшибки = СообщениеНекорректныеСимволы; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	// Проверяем на длину в 11 символов
	СтрокаЧисел = "";
	
	Для Индекс = 1 По ?(Добавочный > 0,Добавочный-1 ,СтрДлина(Представление)) Цикл
		
		Символ = Сред(Представление, Индекс, 1); // Перебираем все символы из нашей строки
		
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
			СтрокаЧисел = СтрокаЧисел + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрДлина(СтрокаЧисел) <> 11 Тогда
		ВозврСтруктура.КодОшибки = 5;
		ВозврСтруктура.СообщениеОшибки = СообщениеНеформат; 
		Возврат ВозврСтруктура;
	КонецЕсли;
	
	//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
	//Проверяем на наличие дублей
	СтруктураПараметровКИ = Новый Структура;
	
	СтруктураПараметровКИ.Вставить("Ссылка", ДанныеСтроки.Ссылка);

	Если ДанныеСтроки.Свойство("Владелец") Тогда
		СтруктураПараметровКИ.Вставить("Владелец", ДанныеСтроки.Владелец);
	Иначе
		СтруктураПараметровКИ.Вставить("Владелец", Неопределено);
	КонецЕсли;
	
	СтруктураПараметровКИ.Вставить("ПредставлениеКИ", СтрокаЧисел);
	СтруктураПараметровКИ.Вставить("ТипКИ", 		  Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	МассивСтруктурДублей = ПолучитьДублиПоКонтактнойИнформацииСправочников(СтруктураПараметровКИ);
		
	Если МассивСтруктурДублей.Количество() > 0  Тогда

		ВозврСтруктура.КодОшибки = 12;
		ВозврСтруктура.СообщениеОшибки = "Данный телефон уже используется:" + Символы.ПС;

		ВозврСтруктура.Вставить("МассивДублей", МассивСтруктурДублей);
		
		Возврат ВозврСтруктура;
		
	КонецЕсли;
	//-- #1152 смарт: Лопато 18.10.2024
	
	//Проверяем на код города и номер телефона
	Значение = ДанныеСтроки.Значение;
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(Значение) Тогда
		КонтактнаяИнформацияСтруктурой = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
		
		Если КонтактнаяИнформацияСтруктурой.Свойство("countryCode") И 
			КонтактнаяИнформацияСтруктурой.Свойство("number") И
			КонтактнаяИнформацияСтруктурой.Свойство("areaCode") Тогда
			
			Если КонтактнаяИнформацияСтруктурой.countryCode <> "+7" Тогда
				ВозврСтруктура.КодОшибки = 2;
				ВозврСтруктура.СообщениеОшибки = СообщениеНеверныйКодСтраны; 
				Возврат ВозврСтруктура;
			//ИначеЕсли СтрДлина(КонтактнаяИнформацияСтруктурой.number) <> 7 Тогда
			//	ВозврСтруктура.КодОшибки = 3;
			//	ВозврСтруктура.СообщениеОшибки = СообщениеКороткийномер; 
			//	Возврат ВозврСтруктура;
			//ИначеЕсли СтрДлина(КонтактнаяИнформацияСтруктурой.areaCode) <> 3 Тогда
			//	ВозврСтруктура.КодОшибки = 4;
			//	ВозврСтруктура.СообщениеОшибки = СообщениеКодГорода; 
			//	Возврат ВозврСтруктура;
				
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ВозврСтруктура;
	
КонецФункции 

&НаСервере
Процедура ДобавитьПодсказкиКонтактнаяИнформация(Форма) Экспорт
	
	Если ТипЗнч(Форма) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;		
	КонецЕсли;      
	
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда
		
		МассивИзменяемыхЭлементов = новый Массив();
		
		МассивИзменяемыхЭлементов.Добавить("ТелефонПартнера"); 
		МассивИзменяемыхЭлементов.Добавить("ТелефонКЛ");
		МассивИзменяемыхЭлементов.Добавить("МобильныйТелефонКЛ");
		МассивИзменяемыхЭлементов.Добавить("ТелефонПартнераФизЛицо");
		
		Для каждого ЭлМассива Из МассивИзменяемыхЭлементов Цикл
			
			УстановитьПодсказкуДляЭлементов(Форма.Элементы[ЭлМассива]);
			
		КонецЦикла;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая"
				ИЛИ Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая"  Тогда	
		
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			Для каждого Стр Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				
				Если Стр.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
					
					ЭлемНомерТелефона = Форма.Элементы.Найти(Стр.ИмяРеквизита);
					
					Если ЭлемНомерТелефона <> Неопределено Тогда
						
						УстановитьПодсказкуДляЭлементов(ЭлемНомерТелефона);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая" Тогда
				
				МассивИзменяемыхЭлементов = новый Массив();
				
				МассивИзменяемыхЭлементов.Добавить("Контакт_Телефон"); 
				МассивИзменяемыхЭлементов.Добавить("Контакт_МобТелефон");
				
				Для каждого ЭлМассива Из МассивИзменяемыхЭлементов Цикл
					
					УстановитьПодсказкуДляЭлементов(Форма.Элементы[ЭлМассива]);
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.CRM_ПотенциальныеКлиенты.Форма.ФормаЭлемента" 
				ИЛИ Форма.ИмяФормы = "Справочник.ФизическиеЛица.Форма.CRM_МодульУТ_ФормаЭлемента"
				ИЛИ Форма.ИмяФормы = "Справочник.Склады.Форма.ФормаЭлемента" 
				ИЛИ Форма.ИмяФормы = "Справочник.Пользователи.Форма.CRM_ФормаЭлемента" 
				ИЛИ Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаЭлемента"
		        ИЛИ Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда 
				
		Для каждого Стр Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				
				Если Стр.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
					
					ЭлемНомерТелефона = Форма.Элементы.Найти(Стр.ИмяРеквизита);
					
					Если ЭлемНомерТелефона <> Неопределено Тогда
						
						УстановитьПодсказкуДляЭлементов(ЭлемНомерТелефона);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьПодсказкуДляЭлементов(Элемент)
	
	Элемент.ПодсказкаВвода = "+7 ХХХ ХХХ ХХ ХХ или 8 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
	Элемент.Подсказка = "Если номер имеет заграничный формат, нажмите на кнопку выбора(если имеется) или F4 и введите номер";
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	
КонецПроцедуры 

#КонецОбласти
//--#1012 смарт: Холопов 04.05.2022 

#Область смартОбработки         

//++ смарт:Подкин #1025 25.05.2022 9:48:13
Функция ПолучитьВнешнююОбработку(ИмяИдентификатора) Экспорт
    Запрос = Новый Запрос;
    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
    |ГДЕ
    |	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &Идентификатор";
    
    Запрос.УстановитьПараметр("Идентификатор", ИмяИдентификатора);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        ВыборкаДетальныеЗаписи.Следующий();
        ВнешнОбработка = ВыборкаДетальныеЗаписи.Ссылка; 
        Возврат ВнешнОбработка;
  
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции //-- смарт:Подкин #1025 25.05.2022 9:48:13 

//++ смарт:Подкин #1121 04.08.2022 16:52:15
Функция ПолучитьСкладДокумента(ДокСсылка) Экспорт
     
    Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
        Возврат ДокСсылка.Склад;
    ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
        Возврат ДокСсылка.СкладПолучатель;
    КонецЕсли;  
    
    Возврат Неопределено;
    
КонецФункции //-- смарт:Подкин #1121 04.08.2022 16:52:15

//++#1205 смарт: Лопато 05.10.2022 //Не учитывается конец дня даты резерва  
Функция смартЦелыхДнейМеждуДатами(ДатаНачала, ДатаОкончания) Экспорт
	
	Возврат ОбщегоНазначенияУТ.РазностьДат(НачалоДня(ДатаНачала), НачалоДня(ДатаОкончания), Перечисления.Периодичность.День);

КонецФункции
//--#1205 смарт: Лопато 05.10.2022

#Область ОфертаВСчетеНаОплату

//++#1311 смарт: Лопато 17.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция смартВЗаказахУстановленРезерв(МассивЗаказов) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	ЗаказКлиентаТовары.Ссылка КАК Заказ
        |ИЗ
        |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
        |ГДЕ
        |	ЗаказКлиентаТовары.Ссылка В(&Заказы)
        |	И НЕ ЗаказКлиентаТовары.Отменено
		|	И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
		|				ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
		|				ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))";
    
    Запрос.УстановитьПараметр("Заказы", МассивЗаказов);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции //--#1311 смарт: Лопато 17.02.2023

//++#1311 смарт: Лопато 17.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция смартНужноВыводитьОферту(МассивЗаказов) Экспорт

	СегментПроверки = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментАппаратноеОбеспечение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&Заказы)
	|	И ЗаказКлиентаТовары.Ссылка.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|	И (ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|;
	|";
	
	Если ЗначениеЗаполнено(СегментПроверки) И СегментПроверки.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьДинамически Тогда

		ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментПроверки);
		
		Запрос.Текст = Запрос.Текст + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_НоменклатураСегмента
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&НоменклатураСегмента)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|";
		
		Запрос.УстановитьПараметр("НоменклатураСегмента", ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка"));  
		
	Иначе

		Запрос.Текст = Запрос.Текст + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураСегмента.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_НоменклатураСегмента
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|ГДЕ
		|	НоменклатураСегмента.Сегмент = &Сегмент
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|";
		
	КонецЕсли;	
	
	Запрос.Текст = Запрос.Текст + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураСегмента КАК ВТ_НоменклатураСегмента
	|		ПО ВТ_Товары.Номенклатура = ВТ_НоменклатураСегмента.Номенклатура
	|";
	
    Запрос.УстановитьПараметр("Заказы",  МассивЗаказов);
	Запрос.УстановитьПараметр("Сегмент", СегментПроверки);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЕстьТовар 			= НЕ РезультатЗапроса[2].Пустой();
	НетТовараИзСегмента = РезультатЗапроса[3].Пустой();
	
	Возврат ЕстьТовар И НетТовараИзСегмента;
	
КонецФункции //--#1311 смарт: Лопато 17.02.2023	

//++#1318 смарт: Лопато 09.03.2023 //Добавить текст оферты в файл Счет на оплату  
Функция смартСформироватьТекстОферты(ЗаказКлиента) Экспорт
	
	ТекстОферта = "";
	
	Если ЗначениеЗаполнено(ЗаказКлиента) 
		И ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") 
		И смартНужноВыводитьОферту(ЗаказКлиента) Тогда

		СтруктураДанныхОферта = Новый Структура;
		
		МакетОферта = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСчетовНаОплату.смартПФ_MXL_СчетНаОплатуВнимание");
		
		//++ #Б-1290 смарт: Мосолов 07.11.2024 //Дополнить печатную форму счета на оплату из 1С
		СписокАртикуловАналоговыхДеталей = ПолучитьСписокАртикуловАналоговыхДеталей(ЗаказКлиента);
		
		Если СписокАртикуловАналоговыхДеталей = "" Тогда
		//-- #Б-1290 смарт: Мосолов 07.11.2024
		
			Если ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
				//Счет - доставка до склада Покупателя
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаДоКлиента").Область(3,2).Текст;
			ИначеЕсли ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика 
				  ИЛИ ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
				  ИЛИ ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
				//Счет - доставка до транспортной компании                                                    
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаДоТранспортнойКомпании").Область(3,2).Текст;
			ИначеЕсли ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз 
				  ИЛИ ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда
				//Счет - самовывоз со склада Продавца
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаСамовывоз").Область(3,2).Текст;
			Иначе
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаДоКлиента").Область(3,2).Текст;
			КонецЕсли;				
		
		//++ #Б-1290 смарт: Мосолов 07.11.2024 //Дополнить печатную форму счета на оплату из 1С
		Иначе
		
			Если ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда  
				
				//Счет - доставка до склада Покупателя
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаДоКлиентаПоСегменту").Область(3,2).Текст;  
				
			ИначеЕсли ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика 
				ИЛИ ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
				ИЛИ ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
				
				//Счет - доставка до транспортной компании                                                    
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаДоТранспортнойКомпанииПоСегменту").Область(3,2).Текст;  
				
			ИначеЕсли ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз 
				ИЛИ ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда   
				
				//Счет - самовывоз со склада Продавца
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаСамовывозПоСегменту").Область(3,2).Текст;     
				
			Иначе     
				
				ТекстОферта = МакетОферта.ПолучитьОбласть("смартОфертаДоКлиентаПоСегменту").Область(3,2).Текст;  
				
			КонецЕсли;				
			
		КонецЕсли;
		
		СтруктураДанныхОферта.Вставить("АртикулыТоваровСегмента", СписокАртикуловАналоговыхДеталей);
		//-- #Б-1290 смарт: Мосолов 07.11.2024
		
		ТаблицаЭтапыОплаты = смартСформироватьТаблицуЭтапыОплатыЗаказа(ЗаказКлиента);
		
		ДатаСрокаДействия = смартПолучитьДатуСрокаДействия(ЗаказКлиента.Валюта, ЗаказКлиента.Дата, ТаблицаЭтапыОплаты);
		
		СтруктураДанныхОферта.Вставить("СрокОплаты", Формат(ДатаСрокаДействия, "ДФ=dd.MM.yyyy"));

		СтруктураДанныхОферта.Вставить("АдресДоставки", смартОпределитьСкладДоставки(ЗаказКлиента));
		СтруктураДанныхОферта.Вставить("СрокПоставки", смартПолучитьСрокПоставкиОферты(ЗаказКлиента));
		
		//++ #4778 смарт: Тимофеева 07.11.2025 / Заказ клиента. Печатная форма. Дополнить текст. 
		ЭлектронныйАдресКонтактногоЛица = "";
		ТелефонКонтактногоЛица 			= "";
		
		Бухгалтер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента.Контрагент, "смартБухгалтер", Истина);
		Если ЗначениеЗаполнено(Бухгалтер) Тогда
			КонтактнаяИнформация 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Бухгалтер, , ЗаказКлиента.Дата, Ложь);
			ТаблицаЭлектронныхАдресов		= КонтактнаяИнформация.Скопировать(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица), "Представление");
			ЭлектронныйАдресКонтактногоЛица = СтрСоединить(ТаблицаЭлектронныхАдресов.ВыгрузитьКолонку("Представление"), ", ");
		
			ТаблицаТелефонов		 		= КонтактнаяИнформация.Скопировать(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица), "Представление");
			ТаблицаМобильныхТелефонов		= КонтактнаяИнформация.Скопировать(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица), "Представление");
		
			ТелефонКонтактногоЛица			= СтрСоединить(ТаблицаТелефонов.ВыгрузитьКолонку("Представление"), ", ") 
											+ ?(ТаблицаТелефонов.Количество() > 0 И ТаблицаМобильныхТелефонов.Количество() > 0, ", ", "")
											+ СтрСоединить(ТаблицаМобильныхТелефонов.ВыгрузитьКолонку("Представление"), ", ");
		КонецЕсли;
										
		СтруктураДанныхОферта.Вставить("ЭлектронныйАдресКонтактногоЛица", 	ЭлектронныйАдресКонтактногоЛица);
		СтруктураДанныхОферта.Вставить("ТелефонКонтактногоЛица", 			ТелефонКонтактногоЛица);
		
		СведенияОбОрганизации   		= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЗаказКлиента.Организация, ЗаказКлиента.Дата);
		СтруктураДанныхОферта.Вставить("ЭлектронныйАдресПродавца", СведенияОбОрганизации.ЭлектроннаяПочта);
		СтруктураДанныхОферта.Вставить("ТелефонПродавца", СведенияОбОрганизации.Телефоны);
	   	//-- #4778 смарт: Тимофеева 07.11.2025
		
		Для Каждого ПараметрОферта Из СтруктураДанныхОферта Цикл 
			ТекстОферта = СтрЗаменить(ТекстОферта, "["+ПараметрОферта.Ключ+"]", СокрЛП(ПараметрОферта.Значение));
		КонецЦикла;	

	КонецЕсли;				
	
	Возврат ТекстОферта;
	
КонецФункции //--#1318 смарт: Лопато 09.03.2023	

//++ #Б-1290 смарт: Мосолов 07.11.2024 //Дополнить печатную форму счета на оплату из 1С
Функция ПолучитьСписокАртикуловАналоговыхДеталей(ЗаказКлиента) 
	
	СписокАртикулов = "";
	
	СегментАналогов = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "АналоговыеДетали");
	
	Если СегментАналогов.Пустая() Тогда
		
		Возврат СписокАртикулов;
		
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("Сегмент", СегментАналогов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыЗаказа
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураСегмента.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	НоменклатураСегмента.Сегмент = &Сегмент
	|	И НоменклатураСегмента.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТоварыЗаказа.Номенклатура
	|			ИЗ
	|				ТоварыЗаказа КАК ТоварыЗаказа)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		СписокАртикулов = ?(СписокАртикулов = "", "", СписокАртикулов + ", ") + Выборка.Артикул;
		
	КонецЦикла;
	
	Возврат СписокАртикулов;
	
КонецФункции //-- #Б-1290 смарт: Мосолов 07.11.2024

//++#1318 смарт: Лопато 09.03.2023 //Добавить текст оферты в файл Счет на оплату  
Функция смартСформироватьТаблицуЭтапыОплатыЗаказа(ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	1														КАК Порядок,
	|	ЭтапыГрафикаОплаты.Ссылка								КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки							КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа							КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа						КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа							КАК СуммаПлатежа,
	|	ЛОЖЬ													КАК ЭтоЗалогЗаТару
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|	И ЭтапыГрафикаОплаты.СуммаПлатежа <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2														КАК Порядок,
	|	ЭтапыГрафикаОплаты.Ссылка								КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки							КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа							КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентЗалогаЗаТару					КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаЗалогаЗаТару					КАК СуммаПлатежа,
	|	ИСТИНА													КАК ЭтоЗалогЗаТару
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|	И ЭтапыГрафикаОплаты.Ссылка.ТребуетсяЗалогЗаТару
	|	И ЭтапыГрафикаОплаты.СуммаЗалогаЗаТару <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Порядок";
	
	Запрос.УстановитьПараметр("МассивОбъектов", ЗаказКлиента);
	
	РезультатЭтапыОплаты = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЭтапыОплаты;

КонецФункции //--#1318 смарт: Лопато 09.03.2023	

//++#1311 смарт: Лопато 17.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция смартОпределитьСкладДоставки(ЗаказСсылка)
	
	АдресДоставки = ЗаказСсылка.АдресДоставки;
	
	Если ЗаказСсылка.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз 
		ИЛИ ЗаказСсылка.СпособДоставки=Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда
		
		МассивСкладовДоставка = Новый Массив;
		
		Если НЕ ЗаказСсылка.Склад.ЭтоГруппа Тогда
			МассивСкладовДоставка.Добавить(ЗаказСсылка.Склад);
		Иначе
			Для Каждого СтрТовары Из ЗаказСсылка.Товары Цикл
				Если ЗначениеЗаполнено(СтрТовары.Склад) Тогда
					МассивСкладовДоставка.Добавить(СтрТовары.Склад);
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКонтактнаяИнформация.Представление КАК Адрес
		|ИЗ
		|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
		|ГДЕ
		|	СкладыКонтактнаяИнформация.Ссылка В(&Склады)
		|	И СкладыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Представление
		|";
		Запрос.УстановитьПараметр("Склады", МассивСкладовДоставка);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			АдресДоставки = Результат.Адрес;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат АдресДоставки;
	
КонецФункции //--#1311 смарт: Лопато 17.02.2023	

//++#1311 смарт: Лопато 17.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция смартПолучитьСрокПоставкиОферты(ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ДатаОтгрузки) КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВТ_МаксДатаОтгрузки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	|		ПО (ВТ_Заказ.Заказ = ЗаказКлиентаТовары.Ссылка)
	|ГДЕ
	|	НЕ ЗаказКлиентаТовары.Отменено
	|	И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	|			ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
	|			ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов)
	|			ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	ЛОЖЬ КАК ТоварВРезерве
	|ПОМЕСТИТЬ ВТ_ТоварВРезерве
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	|		ПО (ВТ_Заказ.Заказ = ЗаказКлиентаТовары.Ссылка)
	|ГДЕ
	|	НЕ ЗаказКлиентаТовары.Отменено
	|	И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	|				ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
	|				ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов)
	|				ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказ.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВТ_МаксДатаОтгрузки.ДатаОтгрузки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтгрузки,
	|	ЕСТЬNULL(ВТ_ТоварВРезерве.ТоварВРезерве, ИСТИНА) КАК ТоварВРезерве
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксДатаОтгрузки КАК ВТ_МаксДатаОтгрузки
	|		ПО ВТ_Заказ.Заказ = ВТ_МаксДатаОтгрузки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварВРезерве КАК ВТ_ТоварВРезерве
	|		ПО ВТ_Заказ.Заказ = ВТ_ТоварВРезерве.Заказ
	|";
	
	Запрос.Параметры.Вставить("ЗаказСсылка", ЗаказКлиента);	
	
	Результат = Запрос.Выполнить().Выбрать();
	
	//В п.2 срок проставляется из "резерв к дате + 5 раб. дней".
	//- если весь товар в резерве, ставим срок 5 дней
	//- если резерв к дате, берем самую дальнюю дату + 5 дней
	//- если товар не зарезервирован, перед печатью счета выдавать окно Да/Нет, если Да, берем дату "Отгружать одной датой/Дата отгрузки (самая дальняя)" + 5 раб. дней.		
	Если Результат.Следующий() Тогда
		Если Результат.ТоварВРезерве = Истина Тогда
			Возврат 5;
		ИначеЕсли ЗначениеЗаполнено(Результат.ДатаОтгрузки) Тогда
			РабочихДней = КалендарныеГрафики.РазностьДатПоКалендарю(КалендарныеГРафики.ОсновнойПроизводственныйКалендарь(), ЗаказКлиента.Дата, Результат.ДатаОтгрузки);
			Если РабочихДней <= 0 Тогда
				Возврат 5;
			Иначе	
				Возврат РабочихДней - 1 + 5;
			КонецЕсли;	
		Иначе	
			Возврат 5;
		КонецЕсли;	
	Иначе
		Возврат 5;
	КонецЕсли;	
	
КонецФункции //--#1311 смарт: Лопато 17.02.2023	

//++#1311 смарт: Лопато 10.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция смартПолучитьДатуСрокаДействия(ЗаказВалюта, ЗаказДата, ТаблицаЭтапыОплаты) Экспорт

	Если ТаблицаЭтапыОплаты.Количество() = 0 Тогда
		ДатаПлатежа = '00010101';
	ИначеЕсли ТаблицаЭтапыОплаты.Количество() = 1 Тогда
		ДатаПлатежа = ТаблицаЭтапыОплаты[0].ДатаПлатежа;
	Иначе
		ДатаПлатежа = ТаблицаЭтапыОплаты[ТаблицаЭтапыОплаты.Количество()-1].ДатаПлатежа;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаПлатежа) 
		И НЕ ЗаказВалюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		
		ДатаСрокаДействия = ДатаПлатежа;
		
	Иначе
		// Фролов изменение по распоряжению Ларькова. не верно указывается срок действия счета
		//ДатаСрокаДействия = ТекущаяДата() + 60 * 60 * 24;   // Так было
		//++ смарт:ММ #101 05.04.2021 Обновление
		//ДатаСрокаДействия = смартСервер.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ДанныеПечати.Дата, 1);
		//++#1311 смарт: Лопато 13.02.2023 //Рефакторинг. Перенесено из расширения (отмена &Вместо)  
		ДатаСрокаДействия = смартОбщегоНазначения.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ЗаказДата, 0);
		//ДатаСрокаДействия = смартОбщегоНазначения.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ДанныеПечати.Дата, 1);
		//--#1311 смарт: Лопато 13.02.2023
		//-- смарт:ММ 05.04.2021
		// Фролов -
	КонецЕсли;
	
	Возврат ДатаСрокаДействия;
	
КонецФункции //--#1311 смарт: Лопато 10.02.2023	

#КонецОбласти

#КонецОбласти 

#Область ПроверкаПРослеживаемыйТовар    

//++ смарт:Демичев #895 26012023
Функция смартПроверитьНаПрослеживаемостьНаСервере(ТоварСсылка) Экспорт
	
	Возврат ТоварСсылка.КодТНВЭД.ПрослеживаемыйТовар;	

КонецФункции //-- смарт:Демичев #895 26012023

//++ смарт:Демичев #895 26012023
Функция смартПолучитьПризнакПрослеживаемости(ВыбранноеЗначение) Экспорт
		
	//ОбъектТаблица = ДанныеКоллекция.Выгрузить();	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Строка Из ТаблицаТоваров Цикл	
		
			ПризнакПрослеживаемости = Строка.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар;		
			
			Если ПризнакПрослеживаемости Тогда			
				ЕстьПрослеживаемыеТовары = ПризнакПрослеживаемости;				
				Прервать;
			КонецЕсли;
		
		//ПараметрыОтбора = Новый Структура("Номенклатура",Строка.Номенклатура);
		//МассивПТ = ОбъектТаблица.НайтиСтроки(ПараметрыОтбора);
		//
		//Для каждого НайденнаяСтрока Из МассивПТ Цикл		
		//	
		//	ПризнакПрослеживаемости = Строка.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар;		
		//	
		//	Если ПризнакПрослеживаемости Тогда			
		//		ЕстьПрослеживаемыеТовары = ПризнакПрослеживаемости;				
		//	КонецЕсли;
		//				
		//КонецЦикла;
	КонецЦикла;
	
	Возврат ЕстьПрослеживаемыеТовары;
	
КонецФункции //-- смарт:Демичев #895 26012023

#КонецОбласти 

#Область РаботаСКонтейнерами
//++#1374 смарт: Балашов 19.06.2023 //Разработать учет закупок в разрезе Контейнеров  
Функция смартПолучитьМассивКонтейнеров(СтрокаJSON) Экспорт
	Массив = Новый Массив;
	Если ЗначениеЗаполнено(СтрокаJSON) Тогда 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Структура = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		Массив = Структура.Контейнеры;
	КонецЕсли;	
	Возврат Массив;
КонецФункции//--#1374 смарт: Балашов 19.06.2023    

//++#1374 смарт: Балашов 19.06.2023 //Разработать учет закупок в разрезе Контейнеров    
Функция смартКонтейнерыВСтроку(Массив) Экспорт
	СтрокаКонтейнеров = "";
	Для Каждого элМассива Из Массив Цикл 
		Если элМассива.Пометка Тогда
			СтрокаКонтейнеров = СтрокаКонтейнеров + элМассива.Наименование+Символы.ПС;
		КонецЕсли;	
	КонецЦикла;
	Возврат СтрокаКонтейнеров;
КонецФункции//--#1374 смарт: Балашов 19.06.2023   

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартЗаписатьВыбраныеКонтейнерыВJSON(СписокКонтейнеров) Экспорт
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Истина;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	Запись = Новый ЗаписьJSON;
	Запись.ПроверятьСтруктуру = Истина;
	Запись.УстановитьСтроку(ПараметрыJSON);
	Запись.ЗаписатьНачалоОбъекта();
	Запись.ЗаписатьИмяСвойства("Контейнеры");
		Запись.ЗаписатьНачалоМассива();
		Для каждого Контейнер Из СписокКонтейнеров Цикл 
		Запись.ЗаписатьНачалоОбъекта();
		Если ТипЗнч(СписокКонтейнеров) = Тип("СписокЗначений") Тогда
			Запись.ЗаписатьИмяСвойства("Ссылка");
			Запись.ЗаписатьЗначение(Строка(Контейнер.Значение.УникальныйИдентификатор()));
			Запись.ЗаписатьИмяСвойства("Наименование");
			Запись.ЗаписатьЗначение(Строка(Контейнер));
			Запись.ЗаписатьИмяСвойства("Пометка");
			Запись.ЗаписатьЗначение(Контейнер.Пометка);
		ИначеЕсли ТипЗнч(СписокКонтейнеров) = Тип("Массив") Тогда
			Запись.ЗаписатьИмяСвойства("Ссылка");
			Запись.ЗаписатьЗначение(Контейнер.Ссылка);
			Запись.ЗаписатьИмяСвойства("Наименование");
			Запись.ЗаписатьЗначение(Контейнер.Наименование);
			Запись.ЗаписатьИмяСвойства("Пометка");
			Запись.ЗаписатьЗначение(Контейнер.Пометка);
		КонецЕсли;	
		Запись.ЗаписатьКонецОбъекта();
		КонецЦикла;
	Запись.ЗаписатьКонецМассива();
	Запись.ЗаписатьКонецОбъекта();
	Возврат Запись.Закрыть();
КонецФункции//--#1374 смарт: Балашов 15.06.2023


#КонецОбласти 

#Область Скидки

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
Функция смартПравоРедактированияИндивидуальныхСкидокПартнера(Партнер) Экспорт
	
	РазрешитьРедактированиеИндивидуальныхСкидокПартнера = Ложь;
	
	Если смартДоступноИзменениеПовышеннойСкидкиПартнера() Тогда
		
		РазрешитьРедактированиеИндивидуальныхСкидокПартнера = Истина;
		
	Иначе	
		
		ЗначенияРеквизитовПартнера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Партнер, "ОсновнойМенеджер,смартОсновнойМенеджерСервисЦентра,смартМенеджерПоРасходнымМатериалам");
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		
		РазрешитьРедактированиеИндивидуальныхСкидокПартнера = ТекущийПользователь 	  = ЗначенияРеквизитовПартнера.ОсновнойМенеджер 
															  ИЛИ ТекущийПользователь = ЗначенияРеквизитовПартнера.смартОсновнойМенеджерСервисЦентра
															  ИЛИ ТекущийПользователь = ЗначенияРеквизитовПартнера.смартМенеджерПоРасходнымМатериалам;
		
	КонецЕсли;	
	
	Возврат РазрешитьРедактированиеИндивидуальныхСкидокПартнера;
	
КонецФункции //--#1323 смарт: Лопато 15.03.2023

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
Функция смартДоступноИзменениеПовышеннойСкидкиПартнера(Пользователь = Неопределено) Экспорт
	
	//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
	Если Пользователи.ЭтоПолноправныйПользователь(Пользователь) 
		ИЛИ Пользователи.РолиДоступны("смартРазрешитьСкидкуБольшеМаксимальной", Пользователь) Тогда	
	//--#1868 смарт: Лопато 19.06.2024
		Возврат Истина;
	Иначе	
		РуководительТекущий = смартПолучитьТекРуководительПовышенныеСкидки(Пользователь);
		Возврат ЗначениеЗаполнено(РуководительТекущий.Значение);
	КонецЕсли;
	
КонецФункции //--#1323 смарт: Лопато 15.03.2023

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
Функция смартПолучитьТекРуководительПовышенныеСкидки(Пользователь = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура("Значение, К2, К3, К4");
	
	МассивРуководителейРегионов = смартОбщегоНазначенияСКэш.смартПредопределенныеЗначенияКэш(
									  Справочники.смартПредопределенныеЗначения.смартПользователиПредоставленияПовышеннойСкидки); 
	
	Для каждого Стр Из МассивРуководителейРегионов Цикл
		
		Если Стр.Значение = Пользователь Тогда
			ЗаполнитьЗначенияСвойств(СтруктураРезультат, Стр); 
			Возврат СтруктураРезультат;
		КонецЕсли;
	   
    КонецЦикла;      
    
    Возврат СтруктураРезультат;
       
КонецФункции //--#1323 смарт: Лопато 15.03.2023

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
Функция смартПолучитьИндивидуальныеСкидкиКлиентов(ДатаСкидок = Неопределено, Клиенты = Неопределено, Номенклатура = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ДатаСкидок) Тогда
		ДатаСкидок = ТекущаяДата();
	КонецЕсли;	
	
	ЗапросСкидки = Новый Запрос;

	ТекстЗапросСкидки =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Период КАК НачалоДействия,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Клиент КАК Клиент,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Номенклатура КАК Номенклатура,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.ПроцентСкидки КАК ПроцентСкидки,
		|	0 КАК СуммаСкидки,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Регистратор КАК Регистратор,
		//++ #1870 смарт: Лопато 25.08.2024 //Доработать механизм выгрузки индивидуальных скидок  
		|	ВЫРАЗИТЬ(смартИндивидуальныеСкидкиКлиентовСрезПоследних.Регистратор.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		//-- #1870 смарт: Лопато 25.08.2024
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Ответственный КАК Ответственный,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.СрокДействия КАК СрокДействия
		|ИЗ
		|	РегистрСведений.смартИндивидуальныеСкидкиКлиентов.СрезПоследних(&Дата, &ОтборКлиент И &ОтборНоменклатура) КАК смартИндивидуальныеСкидкиКлиентовСрезПоследних
		|ГДЕ
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.ПроцентСкидки <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗапросСкидки.УстановитьПараметр("Дата",   ДатаСкидок);
	
	Если Клиенты <> Неопределено Тогда
		ЗапросСкидки.УстановитьПараметр("Клиенты", Клиенты);
		ТекстЗапросСкидки = СтрЗаменить(ТекстЗапросСкидки, "&ОтборКлиент", "Клиент В(&Клиенты)");
	Иначе
		ТекстЗапросСкидки = СтрЗаменить(ТекстЗапросСкидки, "&ОтборКлиент", "ИСТИНА");
	КонецЕсли;

	Если Номенклатура <> Неопределено Тогда
		ЗапросСкидки.УстановитьПараметр("Номенклатура", Номенклатура);
		ТекстЗапросСкидки = СтрЗаменить(ТекстЗапросСкидки, "&ОтборНоменклатура", " Номенклатура В(&Номенклатура)");
	Иначе
		ТекстЗапросСкидки = СтрЗаменить(ТекстЗапросСкидки, "&ОтборНоменклатура", " ИСТИНА");
	КонецЕсли;
	
	ЗапросСкидки.Текст = ТекстЗапросСкидки; 
	РезультатЗапроса = ЗапросСкидки.Выполнить();

	ТаблицаСкидокРезультат = РезультатЗапроса.Выгрузить();
				
	Возврат ТаблицаСкидокРезультат;	
	
КонецФункции //--#1323 смарт: Лопато 15.03.2023	

//++#1356 смарт: Лопато 14.06.2024 //Исправление автоматического расчета скидок в заказах клиентов
Функция смартПолучитьИндивидуальнуюСкидкуКлиентаПоНоменклатуре(Дата, Партнер, Номенклатура) Экспорт

	ПроцентИндивидуальнойСкидки = 0;

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТаблицаИндивидуальныеСкидкиКлиентов = смартПолучитьИндивидуальныеСкидкиКлиентов(Дата, Партнер, Номенклатура);
	
	Если ТаблицаИндивидуальныеСкидкиКлиентов.Количество() > 0 Тогда
		
		ПроцентИндивидуальнойСкидки = ТаблицаИндивидуальныеСкидкиКлиентов[0].ПроцентСкидки;
	
	КонецЕсли;

	Возврат ПроцентИндивидуальнойСкидки;
	
КонецФункции //--#1356 смарт: Лопато 14.06.2024

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
Функция смартМаксимальнаяИндивидуальнаяСкидкаПартнера() Экспорт
	
	Возврат Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
	
КонецФункции //--#1323 смарт: Лопато 15.03.2023

//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
Функция смартПолучитьДопустимуюСуммуСкидки(СтруктураПараметров) Экспорт
    
	МаксимальныйПроцентРучнойСкидкиОбщий = Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
	
	Если СтруктураПараметров.ПовышеннаяСкидкаРазрешена Тогда
		МаксимальныйПроцентРучнойСкидки = Макс(МаксимальныйПроцентРучнойСкидкиОбщий, СтруктураПараметров.ПроцентПовышеннойСкидки);
	Иначе
		МаксимальныйПроцентРучнойСкидки = МаксимальныйПроцентРучнойСкидкиОбщий;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Партнер)
		И ЗначениеЗаполнено(СтруктураПараметров.Номенклатура) Тогда
		
		ПроцентИндивидуальнойСкидки = смартПолучитьИндивидуальнуюСкидкуКлиентаПоНоменклатуре(СтруктураПараметров.Дата, 
																							 СтруктураПараметров.Партнер, 
																							 СтруктураПараметров.Номенклатура);
	
		Если ЗначениеЗаполнено(ПроцентИндивидуальнойСкидки) Тогда
			МаксимальныйПроцентРучнойСкидки = Макс(МаксимальныйПроцентРучнойСкидки, ПроцентИндивидуальнойСкидки);
		КонецЕсли;
		
	КонецЕсли;	
	
	СтруктураКонтроля = Новый Структура("МаксимальнаяСуммаСкидкиДляКонтроля, ПроцентРучнойСкидки", 
										Окр(СтруктураПараметров.Цена * СтруктураПараметров.Количество * МаксимальныйПроцентРучнойСкидки / 100, 2), 
										МаксимальныйПроцентРучнойСкидки);
	
	Возврат СтруктураКонтроля;
    
КонецФункции //--#1868 смарт: Лопато 19.06.2024

//++#1323 смарт: Лопато 15.06.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаСервере
Процедура смартЗаписатьМаксимальныйПроцентРучнойСкидки(МаксимальныйПроцентИндивидуальнойРучнойСкидки) Экспорт

	НаборКонстантМаксимальныйПроцентРучнойСкидки = Константы.смартМаксимальныйПроцентРучнойСкидки.СоздатьМенеджерЗначения();
	НаборКонстантМаксимальныйПроцентРучнойСкидки.Значение = МаксимальныйПроцентИндивидуальнойРучнойСкидки;
	
	Попытка
		НаборКонстантМаксимальныйПроцентРучнойСкидки.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи значения максимальной ручной скидки!");
	КонецПопытки;	
	
КонецПроцедуры //--#1323 смарт: Лопато 15.06.2023

#КонецОбласти

//++#1336 смарт: Лопато 04.04.2023 //Ограничение создания заявки на ПНР (только после полной отгрузки)  
Функция смартЗаказКлиентаОтгруженОформлен(Заказ) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   СостоянияЗаказовКлиентов.Заказ КАК Заказ
    |ИЗ
    |   РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
    |ГДЕ
	|   СостоянияЗаказовКлиентов.Заказ = &Заказ
	|   И СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100";
    
    Запрос.УстановитьПараметр("Заказ", Заказ);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Возврат НЕ РезультатЗапроса.Пустой();
    
КонецФункции //--#1336 смарт: Лопато 04.04.2023

#Область Телефония    

//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
Функция смартТелефонияВыполнитьHTTPЗапрос(Знач ПараметрыЗвонка) Экспорт
	
	HTTPОтвет = Неопределено;

	HTTPЗапрос = смартТелефонияПодготовитьHTTPЗапрос(ПараметрыЗвонка);
	
	//++#1359 смарт: Лопато 28.08.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
	Если HTTPЗапрос = "" Тогда
		Возврат Неопределено;
	КонецЕсли;	
	//--#1359 смарт: Лопато 28.08.2023
	
	Попытка
		Соединение = Новый HTTPСоединение(ПараметрыЗвонка.Соединение, , , , , 60, ПараметрыЗвонка.ЗащищенноеСоединение);
		Если ПараметрыЗвонка.ИмяМетода = "ClickToCall" Тогда 
			//++#1359 смарт: Лопато 29.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			//--#1359 смарт: Лопато 29.09.2023
		ИначеЕсли ПараметрыЗвонка.ИмяМетода = "MakeCall" Тогда
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		//++#1359 смарт: Балашов 25.05.2023	
		ИначеЕсли ПараметрыЗвонка.ИмяМетода = "accounts" Тогда
			HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ПараметрыЗвонка.ИмяМетода = "history" Тогда
			//++#1359 смарт: Лопато 06.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
			Если ПараметрыЗвонка.ВерсияAPIМегафон = "V1" Тогда
				HTTPОтвет = Соединение.Получить(HTTPЗапрос);
			Иначе	
				HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			КонецЕсли;	
			//--#1359 смарт: Лопато 06.09.2023		//--#1359 смарт: Балашов 25.05.2023	
		КонецЕсли;	
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Звонок через " + ПараметрыЗвонка.ИмяМетода + "'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если HTTPОтвет <> Неопределено Тогда
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"), ПараметрыЗвонка.ИмяМетода, HTTPОтвет.КодСостояния) + Символы.ПС
				+ HTTPОтвет.ПолучитьТелоКакСтроку();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Звонок через " + ПараметрыЗвонка.ИмяМетода + "'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			//++#1359 смарт: Лопато 30.08.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
			ОбщегоНазначения.СообщитьПользователю("Не удалось совершить звонок! " + ТекстОшибки);
			//--#1359 смарт: Лопато 30.08.2023
		КонецЕсли;
			
		Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
		
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции //--#1352 смарт: Лопато 04.05.2023

//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
Функция смартТелефонияПодготовитьHTTPЗапрос(ПараметрыЗвонка)
	
	HTTPЗапрос = "";
	Если ПараметрыЗвонка.ИмяМетода = "ClickToCall" Тогда
		
		//++#1359 смарт: Лопато 29.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
		ПараметрыЗвонка.Вставить("ЗащищенноеСоединение", Неопределено);
		ПараметрыЗвонка.Вставить("Соединение", "call.smart-t.me");
		ПараметрыЗвонка.Вставить("Dialplan",   "outbound");
		
		АдресРесурса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("/clicktocall.php?exten=%1&cont=%2&number=%3",
																			   ПараметрыЗвонка.ИсходящийНомер, 
																			   ПараметрыЗвонка.Dialplan, 
																			   ПараметрыЗвонка.Телефон);	
					   
		ЗаголовокЗапросаHTTP = Новый Соответствие;
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);	   
		//--#1359 смарт: Лопато 29.09.2023
		
	ИначеЕсли ПараметрыЗвонка.ИмяМетода = "MakeCall" Тогда
		//++#1431 смарт: Лопато 28.08.2023 //Доработать регистрацию звонков в 1С по Ковчегу (интеграция с ВАТС и Asterisk)  
		ПараметрыВАТС = смартПолучитьПараметрыВАТС(ПараметрыЗвонка);
		//--#1431 смарт: Лопато 28.08.2023
		//++#1359 смарт: Балашов 13.06.2023 Проверка параметров    
		Если Не ПараметрыВАТС = Неопределено Тогда
			//++#1359 смарт: Балашов 25.05.2023	
			ПараметрыЗвонка.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
			ПараметрыЗвонка.Вставить("HTTPМетод",  "POST");
			ПараметрыЗвонка.Вставить("Соединение",  ПараметрыВАТС.Соединение);
			ПараметрыЗвонка.Вставить("АдресРесурса",ПараметрыВАТС.АдресРесурса);
			ПараметрыЗвонка.Вставить("Токен",       ПараметрыВАТС.Токен);
			//--#1359 смарт: Балашов 25.05.2023	
			ЗаголовокЗапросаHTTP = Новый Соответствие;
			//++#1359 смарт: Лопато 06.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
			Если ПараметрыВАТС.ВерсияAPIМегафон = "V1" Тогда
				ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
				ЗаголовокЗапросаHTTP.Вставить("X-API-KEY",    ПараметрыЗвонка.Токен);
				ПараметрыЗвонка.АдресРесурса = ПараметрыВАТС.АдресРесурса + "makecall";
			Иначе	
				ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
				ЗаголовокЗапросаHTTP.Вставить("X-Auth-Key",   ПараметрыЗвонка.Токен);
			КонецЕсли;	
			//--#1359 смарт: Лопато 06.09.2023
		
			HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗвонка.АдресРесурса, ЗаголовокЗапросаHTTP);
		
			ДанныеДляЗапроса = Новый Структура;
			//++#1359 смарт: Лопато 06.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
			Если ПараметрыВАТС.ВерсияAPIМегафон = "V1" Тогда
				ДанныеДляЗапроса.Вставить("user",  ПараметрыЗвонка.ИсходящийНомер);
				ДанныеДляЗапроса.Вставить("phone", ПараметрыЗвонка.Телефон);
				ПараметрыЗапроса = "";
				Для Каждого ЭлементДанныеДляЗапроса Из ДанныеДляЗапроса Цикл
					ЗначениеПараметраЗапроса = ЭлементДанныеДляЗапроса.Ключ + "=" + ЭлементДанныеДляЗапроса.Значение;
					ПараметрыЗапроса = ПараметрыЗапроса + ЗначениеПараметраЗапроса + "&";
				КонецЦикла;	
				ТелоЗапроса = Лев(ПараметрыЗапроса, СтрДлина(ПараметрыЗапроса) - 1);
			Иначе	
				ДанныеДляЗапроса.Вставить("cmd",   "makeCall");
				ДанныеДляЗапроса.Вставить("phone", ПараметрыЗвонка.Телефон);
				ДанныеДляЗапроса.Вставить("user",  ПараметрыЗвонка.ИсходящийНомер);
				ДанныеДляЗапроса.Вставить("token", ПараметрыЗвонка.Токен);
				ТелоЗапроса = ЗначениеВJSON(ДанныеДляЗапроса);
			КонецЕсли;	
			//--#1359 смарт: Лопато 06.09.2023
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;
		//--#1359 смарт: Балашов 13.06.2023
	ИначеЕсли ПараметрыЗвонка.ИмяМетода = "accounts" Тогда
		//++#1359 смарт: Балашов 25.05.2023	
		//++#1431 смарт: Лопато 28.08.2023 //Доработать регистрацию звонков в 1С по Ковчегу (интеграция с ВАТС и Asterisk)  
		ПараметрыВАТС = смартПолучитьПараметрыВАТС(ПараметрыЗвонка);
		//--#1431 смарт: Лопато 28.08.2023
		Если Не ПараметрыВАТС = Неопределено Тогда
			ПараметрыЗвонка.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
			ПараметрыЗвонка.Вставить("HTTPМетод",  "POST");
			ПараметрыЗвонка.Вставить("Соединение",  ПараметрыВАТС.Соединение);
			ПараметрыЗвонка.Вставить("АдресРесурса",ПараметрыВАТС.АдресРесурса);
			ПараметрыЗвонка.Вставить("Токен",       ПараметрыВАТС.Токен);

			ЗаголовокЗапросаHTTP = Новый Соответствие;
			ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
			ЗаголовокЗапросаHTTP.Вставить("X-Auth-Key",   ПараметрыЗвонка.Токен);
			
			HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗвонка.АдресРесурса, ЗаголовокЗапросаHTTP);

			ДанныеДляЗапроса = Новый Структура;
			ДанныеДляЗапроса.Вставить("cmd",   "accounts");
			ДанныеДляЗапроса.Вставить("token", ПараметрыЗвонка.Токен);
			
			ТелоЗапроса = ЗначениеВJSON(ДанныеДляЗапроса);

			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;	
	ИначеЕсли ПараметрыЗвонка.ИмяМетода = "history" Тогда 
		//++#1431 смарт: Лопато 28.08.2023 //Доработать регистрацию звонков в 1С по Ковчегу (интеграция с ВАТС и Asterisk)  
		ПараметрыВАТС = смартПолучитьПараметрыВАТС(ПараметрыЗвонка);
		//--#1431 смарт: Лопато 28.08.2023
		Если Не ПараметрыВАТС = Неопределено Тогда
			ПараметрыЗвонка.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL());
			ПараметрыЗвонка.Вставить("HTTPМетод",  "POST");
			ПараметрыЗвонка.Вставить("Соединение",  ПараметрыВАТС.Соединение);
			ПараметрыЗвонка.Вставить("АдресРесурса",ПараметрыВАТС.АдресРесурса);
			ПараметрыЗвонка.Вставить("Токен",       ПараметрыВАТС.Токен); 

			ЗаголовокЗапросаHTTP = Новый Соответствие;
			//++#1359 смарт: Лопато 06.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
			ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
			Если ПараметрыВАТС.ВерсияAPIМегафон = "V1" Тогда
				ЗаголовокЗапросаHTTP.Вставить("X-API-KEY",    ПараметрыЗвонка.Токен);
				ПараметрыЗвонка.АдресРесурса = ПараметрыВАТС.АдресРесурса + "history/json";

				ДанныеДляЗапроса = Новый Структура;
				Если ПараметрыЗвонка.Свойство("period") и Не ПараметрыЗвонка.period = "" Тогда
					ДанныеДляЗапроса.Вставить("period", ПараметрыЗвонка.period);
				ИначеЕсли ПараметрыЗвонка.Свойство("start") и ПараметрыЗвонка.Свойство("end") Тогда
					ДанныеДляЗапроса.Вставить("start", ПараметрыЗвонка.start);
					ДанныеДляЗапроса.Вставить("end", ПараметрыЗвонка.end);
				КонецЕсли;	
				ДанныеДляЗапроса.Вставить("type",   ПараметрыЗвонка.type);

				Если ДанныеДляЗапроса.Количество() > 0 Тогда
					ПараметрыЗапроса = "?";
					Для Каждого ЭлементДанныеДляЗапроса Из ДанныеДляЗапроса Цикл
						ЗначениеПараметраЗапроса = ЭлементДанныеДляЗапроса.Ключ + "=" + ЭлементДанныеДляЗапроса.Значение;
						ПараметрыЗапроса = ПараметрыЗапроса + ЗначениеПараметраЗапроса + "&";
					КонецЦикла;	
					ПараметрыЗвонка.АдресРесурса = ПараметрыЗвонка.АдресРесурса + Лев(ПараметрыЗапроса, СтрДлина(ПараметрыЗапроса)-1);
				КонецЕсли;
				
				HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗвонка.АдресРесурса, ЗаголовокЗапросаHTTP);
			Иначе	
				ЗаголовокЗапросаHTTP.Вставить("X-Auth-Key",   ПараметрыЗвонка.Токен);
			
				HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗвонка.АдресРесурса, ЗаголовокЗапросаHTTP);

				ДанныеДляЗапроса = Новый Структура;
				ДанныеДляЗапроса.Вставить("cmd",   "history");
				//++#1359 смарт: Балашов 24.07.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)
				Если ПараметрыЗвонка.Свойство("period") и Не ПараметрыЗвонка.period = "" Тогда
					ДанныеДляЗапроса.Вставить("period", ПараметрыЗвонка.period);
				ИначеЕсли ПараметрыЗвонка.Свойство("start") и ПараметрыЗвонка.Свойство("end") Тогда
					ДанныеДляЗапроса.Вставить("start", ПараметрыЗвонка.start);
					ДанныеДляЗапроса.Вставить("end", ПараметрыЗвонка.end);
				КонецЕсли;	
				//--#1359 смарт: Балашов 24.07.2023	
					
				ДанныеДляЗапроса.Вставить("type",   ПараметрыЗвонка.type);
				ДанныеДляЗапроса.Вставить("token",  ПараметрыЗвонка.Токен);
				
				ТелоЗапроса = ЗначениеВJSON(ДанныеДляЗапроса);
				
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			КонецЕсли;	
			//--#1359 смарт: Лопато 06.09.2023
		КонецЕсли;	
		//--#1359 смарт: Балашов 25.05.2023	
	КонецЕсли;				   
	
	Возврат HTTPЗапрос;
КонецФункции //--#1352 смарт: Лопато 04.05.2023

//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
Функция ПодготовитьПараметрыЗвонка(ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(ДополнительныеПараметры.СсылкаНаОбъект) Тогда
		НаименованиеКонтакта = сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ДополнительныеПараметры.СсылкаНаОбъект);
		Если НЕ (ТипЗнч(ДополнительныеПараметры.СсылкаНаОбъект) = Тип("Строка")) Тогда
			ВладелецКонтакта	= сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(ДополнительныеПараметры.СсылкаНаОбъект);
			ИзображениеКонтакта	= сфпСофтФонПроСервер.сфпПолучитьАватарКонтакта(ДополнительныеПараметры.СсылкаНаОбъект, Истина);	
	    КонецЕсли;
	КонецЕсли;

	ДополнительныеПараметры.Вставить("Дата", ТекущаяДата());

	ДополнительныеПараметры.Вставить("НаименованиеКонтакта", НаименованиеКонтакта);
	ДополнительныеПараметры.Вставить("ВладелецКонтакта", 	 ВладелецКонтакта);
	ДополнительныеПараметры.Вставить("ИзображениеКонтакта",  ИзображениеКонтакта);
	
	ДополнительныеПараметры.Вставить("Пользователь", ПользователиКлиентСервер.АвторизованныйПользователь());
    
	//++#1651 смарт: Лопато 17.04.2024 //Телефония. Хранение истории контактной информации пользователей  
	ДополнительныеПараметры.Вставить("ПользовательВнутреннийНомер", 
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДополнительныеПараметры.Пользователь,
																	Справочники.ВидыКонтактнойИнформации.смартРабочийТелефон));
	
	ДополнительныеПараметры.Вставить("ПользовательВнутреннийНомерВАТС", 
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДополнительныеПараметры.Пользователь, 
																	Справочники.ВидыКонтактнойИнформации.смартВнутреннийНомерВАТС));
	//--#1651 смарт: Лопато 17.04.2024
	
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	ДополнительныеПараметры.Вставить("ПользовательВнутреннийНомерВАТСДополнительный", 
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДополнительныеПараметры.Пользователь, 
																	Справочники.ВидыКонтактнойИнформации.смартВнутреннийНомерВАТСДополнительный));
	//-- #Б-6744 смарт: Фролов 28.05.2026																
	
	ДополнительныеПараметры.Телефон = СтрЗаменить(ДополнительныеПараметры.Телефон, "+7", "8");
	
	Возврат ДополнительныеПараметры;
	
КонецФункции //--#1352 смарт: Лопато 04.05.2023

//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
Процедура смартОбработатьИсходящийЗвонок(ПараметрыЗвонка, Ответ) Экспорт
	
	//++#1359 смарт: балашов 23.05.2023 //записывать ID звонка
	Если Ответ <> Неопределено Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ);
		СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
		//++#1359 смарт: Лопато 29.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
		Если ТипЗнч(СтруктураИзJSON) = Тип("Структура") Тогда
			Если ПараметрыЗвонка.ИмяМетода = "ClickToCall" И СтруктураИзJSON.Свойство("Uniqueid") Тогда
				ИдентификаторЗвонкаВАТС = СокрЛП(СтрЗаменить(СтруктураИзJSON.Uniqueid, "Event", ""));
			ИначеЕсли ПараметрыЗвонка.ИмяМетода = "MakeCall" И СтруктураИзJSON.Свойство("callid") Тогда
				ИдентификаторЗвонкаВАТС = СтруктураИзJSON["callid"];
			Иначе
				ИдентификаторЗвонкаВАТС = Неопределено;
			КонецЕсли;	
		Иначе
			ИдентификаторЗвонкаВАТС = Неопределено;
		КонецЕсли;	
		//--#1359 смарт: Лопато 29.09.2023
	Иначе
		ИдентификаторЗвонкаВАТС = Неопределено;	
	КонецЕсли;	
	//--#1359 смарт: балашов 23.05.2023
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументТелефонныйЗвонок = сфпСофтФонПроСервер.СоздатьТелефонныйЗвонок(ПараметрыЗвонка.СсылкаНаОбъект, ПараметрыЗвонка.Телефон, 
																		   ПараметрыЗвонка.Пользователь, ПараметрыЗвонка.Пользователь, 
																		   ПараметрыЗвонка.ИсходящийНомер, Ложь, ПараметрыЗвонка.Дата, 
															//++#1359 смарт: балашов 23.05.2023 //добавил ID звонка  
																		   ИдентификаторЗвонкаВАТС);
															//--#1359 смарт: балашов 23.05.2023 

	//++#1359 смарт: Балашов 18.07.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
	Если ПараметрыЗвонка.Свойство("ДанныеЗаполнения") и ЗначениеЗаполнено(ПараметрыЗвонка.ДанныеЗаполнения) Тогда
		СтруктураЗаполнения = ПараметрыЗвонка.ДанныеЗаполнения;
		Если СтруктураЗаполнения.Свойство("Основание") и ЗначениеЗаполнено(СтруктураЗаполнения.Основание) Тогда
			ТекИнтерес = СтруктураЗаполнения.Основание;
			Если ТипЗнч(ТекИнтерес) = Тип("ДокументСсылка.CRM_Интерес") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ 
					|	CRM_ЖурналДокументов.CRM_Интерес КАК Ссылка,
					|	CRM_ЖурналДокументов.ИнтересЯвляетсяОснованием КАК ВведенНаОсновании,
					|	CRM_ЖурналДокументов.ОсновнойИнтерес КАК ОсновнойИнтерес
					|ИЗ
					|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
					|ГДЕ
					|	CRM_ЖурналДокументов.Объект = &Объект
					|	И НЕ CRM_ЖурналДокументов.CRM_Интерес = ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка)
					|	И CRM_ЖурналДокументов.ГлавнаяЗапись
					|";
				Запрос.УстановитьПараметр("Объект",ДокументТелефонныйЗвонок);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Не Выборка.Следующий() Тогда
					Запрос_1 = Новый Запрос;
					Запрос_1.УстановитьПараметр("Объект"		, ДокументТелефонныйЗвонок);
					Запрос_1.УстановитьПараметр("Клиент"		, ПараметрыЗвонка.ВладелецКонтакта);
					Запрос_1.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
						|	CRM_ЖурналДокументов.ГлавнаяЗапись,
						|	CRM_ЖурналДокументов.Клиент,
						|	CRM_ЖурналДокументов.Объект,
						|	CRM_ЖурналДокументов.CRM_Интерес,
						|	CRM_ЖурналДокументов.ТипОбъекта,
						|	CRM_ЖурналДокументов.Номер,
						|	CRM_ЖурналДокументов.Дата,
						|	CRM_ЖурналДокументов.Организация,
						|	CRM_ЖурналДокументов.Сумма,
						|	CRM_ЖурналДокументов.Валюта,
						|	CRM_ЖурналДокументов.Ответственный,
						|	CRM_ЖурналДокументов.Автор,
						|	CRM_ЖурналДокументов.Описание,
						|	CRM_ЖурналДокументов.Важность,
						|	CRM_ЖурналДокументов.ВходящееИсходящее,
						|	CRM_ЖурналДокументов.ВидСобытия,
						|	CRM_ЖурналДокументов.ПометкаУдаления,
						|	CRM_ЖурналДокументов.Проведен,
						|	CRM_ЖурналДокументов.КонтактноеЛицо,
						|	CRM_ЖурналДокументов.СостояниеСобытия,
						|	CRM_ЖурналДокументов.СостояниеИнтереса,
						|	CRM_ЖурналДокументов.ЕстьПрисоединенныеФайлы
						|ИЗ
						|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
						|ГДЕ
						|	CRM_ЖурналДокументов.Объект = &Объект
						|	И CRM_ЖурналДокументов.Клиент = &Клиент
						|	И CRM_ЖурналДокументов.ГлавнаяЗапись
					    |";
					Выборка_1 = Запрос_1.Выполнить().Выбрать();
					НоваяЗапись = РегистрыСведений.CRM_ЖурналДокументов.СоздатьМенеджерЗаписи();
					Если Выборка_1.Следующий() Тогда
						ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка_1);
						НоваяЗапись.CRM_Интерес		= ТекИнтерес;
						НоваяЗапись.СостояниеИнтереса	= ТекИнтерес.СостояниеИнтереса;
					Иначе
						ТипИсточника	= ТипЗнч(Выборка.Ссылка);
						ТипОбъекта		= CRM_КлиентыСервер.ПолучитьСсылкуПВХОбъектыЖурналаПоТипу(ТипИсточника);
						
						НоваяЗапись.ГлавнаяЗапись		= Истина;
						НоваяЗапись.Клиент			= ПараметрыЗвонка.ВладелецКонтакта;
						НоваяЗапись.Объект			= ДокументТелефонныйЗвонок;
						НоваяЗапись.CRM_Интерес		= ТекИнтерес;
						НоваяЗапись.ТипОбъекта		= ТипОбъекта;
						НоваяЗапись.Номер				= ДокументТелефонныйЗвонок.Номер;
						НоваяЗапись.Дата				= ДокументТелефонныйЗвонок.Дата;
						НоваяЗапись.Автор				= ДокументТелефонныйЗвонок.Автор;
						НоваяЗапись.СостояниеИнтереса	= ТекИнтерес.СостояниеИнтереса;
						
					КонецЕсли;
					
					НоваяЗапись.ОсновнойИнтерес		= истина;
					
					НоваяЗапись.Записать();
					
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	//--#1359 смарт: Балашов 18.07.2023
																
	 
	//++#1359 смарт: балашов 26.05.2023 - лишний вызов. Внутри функции "СоздатьТелефонныйЗвонок" уже происходит запись,
	//так, что комментарю
	//сфпСофтФонПроСервер.ЗаписатьДанныеЗвонка(ДокументТелефонныйЗвонок, 
	//										 //++#1359 смарт: балашов 23.05.2023 //добавил ID звонка  
	//										 ИдентификаторЗвонкаВАТС, 
	//										 //--#1359 смарт: балашов 23.05.2023 //добавил ID звонка  
	//										 ПараметрыЗвонка.Дата, , Ложь, ПараметрыЗвонка.СсылкаНаОбъект, 
	//										 ПараметрыЗвонка.Телефон, ПараметрыЗвонка.ИсходящийНомер, ПараметрыЗвонка.Пользователь);
	//--#1359 смарт: балашов 26.05.2023
	
КонецПроцедуры //--#1352 смарт: Лопато 04.05.2023

//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
Функция смартПроверитьДоступностьЗвонков() Экспорт

	ТекущийПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	//++#1651 смарт: Лопато 17.04.2024 //Телефония. Хранение истории контактной информации пользователей  
	смартРабочийТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
							  ТекущийПользователь, Справочники.ВидыКонтактнойИнформации.смартРабочийТелефон);

	смартВнутреннийНомерВАТС = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
								   ТекущийПользователь, Справочники.ВидыКонтактнойИнформации.смартВнутреннийНомерВАТС);
								   
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	смартВнутреннийНомерВАТСДополнительный = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
								   ТекущийПользователь, Справочники.ВидыКонтактнойИнформации.смартВнутреннийНомерВАТСДополнительный);
													  
	//Возврат ЗначениеЗаполнено(смартРабочийТелефон) ИЛИ ЗначениеЗаполнено(смартВнутреннийНомерВАТС);
	Возврат ЗначениеЗаполнено(смартРабочийТелефон) ИЛИ ЗначениеЗаполнено(смартВнутреннийНомерВАТС) ИЛИ ЗначениеЗаполнено(смартВнутреннийНомерВАТСДополнительный);
	//-- #Б-6744 смарт: Фролов 28.05.2026
	//--#1651 смарт: Лопато 17.04.2024
	
КонецФункции //--#1352 смарт: Лопато 04.05.2023

//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
Функция ЗначениеВJSON(Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции //--#1352 смарт: Лопато 04.05.2023

// Преобразует строку в формате JSON в значение при помощи метода глобального контекста ПрочитатьJSON.
// См. ограничения в синтакс-помощнике.
// Объекты JSON по умолчанию преобразует в значения типа Соответствие. 
// Имена свойств со значением типа Дата необходимо явно указывать, чтобы было выполнено преобразование.
// Ожидаемый формат дат - ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//   Строка - Строка - значение в формате JSON.
//   ИменаСвойствСоЗначениямиДата - Строка - имя свойства, содержащее значение типа Дата. Допустимо указывать несколько
//                                           свойств через запятую.
//                                - Массив из Строка 
//   ПрочитатьВСоответствие       - Булево - если Ложь, то объекты JSON будут преобразованы в значение типа Структура.
//   
// Возвращаемое значение:
//  Произвольный
//
Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт
	
	Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
		ИменаСвойствСоЗначениямиДата = СтрРазделить(ИменаСвойствСоЗначениямиДата, ", " + Символы.ПС, Ложь);
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
КонецФункции

//++#1359 смарт: Балашов 13.06.2023 проверка получения значений для подключения    
Функция смартПолучитьПараметрыВАТС(ПараметрыЗвонка = "") Экспорт //#1431 смарт: Лопато 28.08.2023 //Доработать регистрацию звонков в 1С по Ковчегу (интеграция с ВАТС и Asterisk)

	ПредопределенныеДанныеМассив = Метаданные.Справочники.смартПредопределенныеЗначения.ПолучитьИменаПредопределенных();
	//++#1431 смарт: Лопато 28.08.2023 //Доработать регистрацию звонков в 1С по Ковчегу (интеграция с ВАТС и Asterisk)  
	Если (ТипЗнч(ПараметрыЗвонка) = Тип("Строка") И ПараметрыЗвонка = "Ковчег") 
		ИЛИ (ТипЗнч(ПараметрыЗвонка) = Тип("Структура") И ПараметрыЗвонка.Свойство("ИсходящийНомер") И Лев(ПараметрыЗвонка.ИсходящийНомер, 1) = "7") Тогда
		ПостфиксПредопределенныхДанных = "Ковчег";
	Иначе
		ПостфиксПредопределенныхДанных = "";
	КонецЕсли;	

	//++#1359 смарт: Лопато 06.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
	ИмяПредопределенныхДанных = "ВерсияAPIМегафон";
	Индекс = ПредопределенныеДанныеМассив.Найти(ИмяПредопределенныхДанных);
	Если Индекс <> Неопределено И ПараметрыЗвонка.ИмяМетода <> "accounts" Тогда
		ВерсияAPIМегафон = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ИмяПредопределенныхДанных, Ложь);
	Иначе
		ВерсияAPIМегафон = ""; 
	КонецЕсли;
	
	ИмяПредопределенныхДанных = "АдресРесурсаМегафон" + ВерсияAPIМегафон;
	//--#1359 смарт: Лопато 06.09.2023
	Индекс = ПредопределенныеДанныеМассив.Найти(ИмяПредопределенныхДанных);
	Если Индекс <> Неопределено Тогда
		АдресРесурсаМегафон = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ИмяПредопределенныхДанных, Ложь);
		Если НЕ ЗначениеЗаполнено(АдресРесурсаМегафон) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнены настройки подключения к АТС по организации " + ?(ПостфиксПредопределенныхДанных = "", "Смарт-Т", "Ковчег"));
			Возврат Неопределено; 
		КонецЕсли;			
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
		
	ИмяПредопределенныхДанных = "СоединениеМегафонВАТС" + ПостфиксПредопределенныхДанных;
	Индекс = ПредопределенныеДанныеМассив.Найти(ИмяПредопределенныхДанных);
	Если Индекс <> Неопределено Тогда
		СоединениеМегафонВАТС = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ИмяПредопределенныхДанных, Ложь);
		Если НЕ ЗначениеЗаполнено(СоединениеМегафонВАТС) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнены настройки подключения к АТС по организации " + ?(ПостфиксПредопределенныхДанных = "", "Смарт-Т", "Ковчег"));
			Возврат Неопределено; 
		КонецЕсли;			
	Иначе
		Возврат Неопределено; 
	КонецЕсли;	
	
	ИмяПредопределенныхДанных = "ТокенМегафон" + ПостфиксПредопределенныхДанных;;
	Индекс = ПредопределенныеДанныеМассив.Найти(ИмяПредопределенныхДанных);
	Если Индекс <> Неопределено Тогда
		ТокенМегафон = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(ИмяПредопределенныхДанных, Ложь);
		Если НЕ ЗначениеЗаполнено(ТокенМегафон) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнены настройки подключения к АТС по организации " + ?(ПостфиксПредопределенныхДанных = "", "Смарт-Т", "Ковчег"));
			Возврат Неопределено; 
		КонецЕсли;			
	Иначе
		Возврат Неопределено; 
	КонецЕсли;	
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	ПараметрыВАТС = Новый Структура;
	ПараметрыВАТС.Вставить("Соединение",   СоединениеМегафонВАТС);
	ПараметрыВАТС.Вставить("АдресРесурса", АдресРесурсаМегафон);
	ПараметрыВАТС.Вставить("Токен",        ТокенМегафон);
	//--#1431 смарт: Лопато 28.08.2023

	//++#1359 смарт: Лопато 06.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk) 
	ПараметрыВАТС.Вставить("ВерсияAPIМегафон", ВерсияAPIМегафон);
	//--#1359 смарт: Лопато 06.09.2023
	
	Возврат ПараметрыВАТС;

КонецФункции //--#1359 смарт: Балашов 13.06.2023	

//++#1359 смарт: Лопато 13.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
Функция ПривестиТелефонныйНомерКФормату(ОригТелНомер) Экспорт
	
	ТелНомер = СокрЛП(ОригТелНомер);
	
	ТелНомер = ПолучитьСтрокуДоСимвола(ТелНомер, ";");
	ТелНомер = ПолучитьСтрокуДоСимвола(ТелНомер, ",");
	ТелНомер = ПолучитьСтрокуДоСимвола(ТелНомер, "/");
	
	ТелНомер = СтрЗаменить(ТелНомер, "+7", "7");     
	ТелНомер = СтрЗаменить(ТелНомер, ":7", "7");     
	ТелНомер = СтрЗаменить(ТелНомер, "+8", "7");     
	ТелНомер = СтрЗаменить(ТелНомер, ":8", "7");     
	
	Если СтрДлина(ТелНомер) >= 6 Тогда
		ТелНомер = сфпСофтФонПроСерверПереопределяемый.ПреобразоватьНомерДляКонтактнойИнформации(ТелНомер);
	КонецЕсли;	

	ТелНомер = ТолькоЦифры(ТелНомер);
	
	Если СтрДлина(ТелНомер) = 10 Тогда
		ТелНомер = "7" + ТелНомер;
	КонецЕсли;

	Если Лев(ТелНомер, 1) = "8" И СтрДлина(ТелНомер) = 11 Тогда
		ТелНомер = "7" + Сред(ТелНомер, 2);
	КонецЕсли;

	Возврат ТелНомер;	

КонецФункции //--#1359 смарт: Лопато 13.09.2023

//++#1359 смарт: Лопато 13.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
Функция ПолучитьСтрокуДоСимвола(ТелНомер, Символ) Экспорт

	Если СтрНайти(ТелНомер, Символ) > 0 Тогда
		ТелНомер = Лев(ТелНомер, СтрНайти(ТелНомер, Символ) - 1);
	КонецЕсли;	           
	
	Возврат ТелНомер;
	
КонецФункции //--#1359 смарт: Лопато 13.09.2023

//++#1359 смарт: Лопато 13.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
Функция ТолькоЦифры(Строка) Экспорт

	Итог = "";
	
	ДлинаСтроки = СтрДлина(Строка);

	Для Сч = 1 По ДлинаСтроки Цикл
        Символ = Сред(Строка, Сч, 1);   
        КодСимвола = КодСимвола(Символ);
        Если КодСимвола > 47 И КодСимвола < 58 Тогда
            Итог = Итог + Символ;
        КонецЕсли;
    КонецЦикла;

	Возврат Итог;
	
КонецФункции //--#1359 смарт: Лопато 13.09.2023

#КонецОбласти

#Область ПодразделенияОрганизации

//++#1316 смарт: Лопато 06.10.2023 //Запретить использование в документах подразделения другой организации  
Функция смартПолучитьСписокПодразделенийОрганизации(Организация) Экспорт

	МассивПодразделений = Новый Массив;

	Если ЗначениеЗаполнено(Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	НЕ СтруктураПредприятия.ПометкаУдаления
		|	И НЕ СтруктураПредприятия.смартПодразделениеНеИспользуется
		|	И СтруктураПредприятия.смартОрганизацияВладелец = &смартОрганизацияВладелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";	
		
		Запрос.УстановитьПараметр("смартОрганизацияВладелец", Организация);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			МассивПодразделений = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		Иначе
			МассивПодразделений = смартПолучитьСоздатьПодразделениеОрганизацииПоУмолчанию(Организация);
		КонецЕсли;

	КонецЕсли;
		
	Возврат МассивПодразделений;
		
КонецФункции //--#1316 смарт: Лопато 06.10.2023

//++#1316 смарт: Лопато 06.10.2023 //Запретить использование в документах подразделения другой организации  
Функция смартПолучитьСоздатьПодразделениеОрганизацииПоУмолчанию(Организация) Экспорт

	МассивПодразделений = Новый Массив;
	
	НеобходимоСоздатьЭлемент = Ложь;
			
	НаименованиеЭлементаПоУмолчанию = НСтр("ru = '<Подразделение по умолчанию>'");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СтруктураПредприятия.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СтруктураПредприятия.Наименование = &НаименованиеЭлементаПоУмолчанию
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.смартОрганизацияВладелец = &смартОрганизацияВладелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
	Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
	Запрос.УстановитьПараметр("смартОрганизацияВладелец", 		 Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
			МассивПодразделений.Добавить(Выборка.Ссылка);
		КонецЕсли;
	Иначе
		НеобходимоСоздатьЭлемент = Истина;
	КонецЕсли;
	
	Если НеобходимоСоздатьЭлемент Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПодразделениеОбъект = Справочники.СтруктураПредприятия.СоздатьЭлемент();

		ПодразделениеОбъект.Наименование 					 = НаименованиеЭлементаПоУмолчанию;
		ПодразделениеОбъект.смартОрганизацияВладелец 		 = Организация;
		ПодразделениеОбъект.ВариантОбособленногоУчетаТоваров = Перечисления.ВариантыОбособленногоУчетаТоваров.НеВедется;
		
		ПодразделениеОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ПодразделениеОбъект.Записать();
			МассивПодразделений.Добавить(ПодразделениеОбъект.Ссылка);
			ОбщегоНазначения.СообщитьПользователю("Создано подразделение по умолчанию для организации """ + СокрЛП(Организация) + """");
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось создать подразделение по умолчанию! Обратитесь к администратору 1С!");
			ЗаписьЖурналаРегистрации("Автоматическое создание подразделения по умолчанию", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось создать подразделение по умолчанию!");
		КонецПопытки;

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Возврат МассивПодразделений;
	
КонецФункции //--#1316 смарт: Лопато 06.10.2023

//++#1316 смарт: Лопато 06.10.2023 //Запретить использование в документах подразделения другой организации  
Процедура смартПроверитьОрганизациюПодразделения(Отказ, Подразделение, Организация, ПодразделениеОбязательно = Ложь) Экспорт
	
	СообщениеОшибка = "";
	
	Если ЗначениеЗаполнено(Подразделение) Тогда

		ПодразделениеВладелец = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Подразделение, "смартОрганизацияВладелец");

		Если ПодразделениеВладелец <> Организация Тогда
			СообщениеОшибка = НСтр("ru='Организация в документе """ + СокрЛП(Организация) + """ не совпадает с организацией-владельцем подразделения """ + СокрЛП(Подразделение) + """!'");
		КонецЕсли;
		
	ИначеЕсли ПодразделениеОбязательно Тогда
		
		МассивПодразделений = смартПолучитьСписокПодразделенийОрганизации(Организация);
		
		Если МассивПодразделений.Количество() > 0 Тогда

			НаименованиеПодразделенияПоУмолчанию = "<Подразделение по умолчанию>";

			Если НЕ (МассивПодразделений.Количество() = 1 И МассивПодразделений[0].Наименование = НаименованиеПодразделенияПоУмолчанию) Тогда
				СообщениеОшибка = НСтр("ru='В документе не заполнено поле подразделения! У организации """ + СокрЛП(Организация) + """ имеются действующие подразделения!'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОшибка) Тогда
		
		Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			ОбщегоНазначения.СообщитьПользователю(СообщениеОшибка, Подразделение, "Подразделение", "Объект.Подразделение", Отказ);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СообщениеОшибка, Подразделение, "Подразделение", "Объект.Подразделение");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //--#1316 смарт: Лопато 06.10.2023

//++ #Б-2282 смарт: Фролов 11.03.2025 //Оповещение руководителей при назначении новому партнеру менеджера по расходке
Функция НайтиРегионВерхнегоУровня(Регион) Экспорт
	
	РегионПоиска = Регион;
	
	Пока ЗначениеЗаполнено(РегионПоиска.Родитель) И НЕ ЗначениеЗаполнено(РегионПоиска.смартОтветственоеПодразделение) Цикл
		РегионПоиска = НайтиРегионВерхнегоУровня(РегионПоиска.Родитель);
	КонецЦикла;
	
	Возврат РегионПоиска;
	
КонецФункции //-- #Б-2282 смарт: Фролов 11.03.2025

#КонецОбласти

//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
Функция смартПолучитьТЗАдресовСкладов(СкладВШапке, ТЧТовары, СпособДоставки) Экспорт

	ТЧСклады = ТЧТовары.Выгрузить(, "Склад");
	ТЧСклады.Очистить();
	
	Если ЗначениеЗаполнено(СкладВШапке) И НЕ Справочники.Склады.ЭтоГруппа(СкладВШапке) Тогда

		НовыйСклад = ТЧСклады.Добавить();
		НовыйСклад.Склад = СкладВШапке;
		
	Иначе
		
		Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
			
			Для Каждого ТекСтрока Из ТЧТовары Цикл
				Если ЗначениеЗаполнено(ТекСтрока.Склад) И ТЧСклады.Найти(ТекСтрока.Склад, "Склад") = Неопределено 
					//++ #Б-2116 смарт: Лопато 04.02.2025 //Ошибка при определении адреса склада  
					И ТипЗнч(ТекСтрока.Склад) = Тип("СправочникСсылка.Склады") 
					//-- #Б-2116 смарт: Лопато 04.02.2025
					//++ #4494 смарт: Тимофеева 14.10.2025 / Ошибка ЖР. Документ Заказ клиента. Способ доставки Самовывоз
					И НЕ Справочники.Склады.ЭтоГруппа(ТекСтрока.Склад)
					//-- #4494 смарт: Тимофеева 14.10.2025
					И НЕ ТекСтрока.Склад.смартАвтоматическиФормироватьДокументы Тогда
					НовыйСклад = ТЧСклады.Добавить();
					НовыйСклад.Склад = ТекСтрока.Склад;
				КонецЕсли;
			КонецЦикла;
			
			Если ТЧСклады.Количество() = 0 Тогда
				Для Каждого ТекСтрока Из ТЧТовары Цикл
					Если ЗначениеЗаполнено(ТекСтрока.Склад) И ТЧСклады.Найти(ТекСтрока.Склад, "Склад") = Неопределено 
						//++ #Б-2116 смарт: Лопато 04.02.2025 //Ошибка при определении адреса склада  
						И ТипЗнч(ТекСтрока.Склад) = Тип("СправочникСсылка.Склады") 
						//-- #Б-2116 смарт: Лопато 04.02.2025
						//++ #4494 смарт: Тимофеева 14.10.2025 / Ошибка ЖР. Документ Заказ клиента. Способ доставки Самовывоз
						И НЕ Справочники.Склады.ЭтоГруппа(ТекСтрока.Склад)
						//-- #4494 смарт: Тимофеева 14.10.2025
						И ТекСтрока.Склад.смартАвтоматическиФормироватьДокументы Тогда
						НовыйСклад = ТЧСклады.Добавить();
						НовыйСклад.Склад = ТекСтрока.Склад;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			
		ИначеЕсли СпособДоставки = Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал Тогда	

			Для Каждого ТекСтрока Из ТЧТовары Цикл
				Если ЗначениеЗаполнено(ТекСтрока.Склад) И ТЧСклады.Найти(ТекСтрока.Склад, "Склад") = Неопределено 
					//++ #Б-2116 смарт: Лопато 04.02.2025 //Ошибка при определении адреса склада  
					И ТипЗнч(ТекСтрока.Склад) = Тип("СправочникСсылка.Склады") 
					//-- #Б-2116 смарт: Лопато 04.02.2025
					//++ #4494 смарт: Тимофеева 14.10.2025 / Ошибка ЖР. Документ Заказ клиента. Способ доставки Самовывоз
					И НЕ Справочники.Склады.ЭтоГруппа(ТекСтрока.Склад)
					//-- #4494 смарт: Тимофеева 14.10.2025
					И ТекСтрока.Склад.смартАвтоматическиФормироватьДокументы Тогда
					НовыйСклад = ТЧСклады.Добавить();
					НовыйСклад.Склад = ТекСтрока.Склад;
				КонецЕсли;
			КонецЦикла;
			
			Если ТЧСклады.Количество() = 0 Тогда
				Для Каждого ТекСтрока Из ТЧТовары Цикл
					Если ЗначениеЗаполнено(ТекСтрока.Склад) И ТЧСклады.Найти(ТекСтрока.Склад, "Склад") = Неопределено 
						//++ #Б-2116 смарт: Лопато 04.02.2025 //Ошибка при определении адреса склада  
						И ТипЗнч(ТекСтрока.Склад) = Тип("СправочникСсылка.Склады") 
						//-- #Б-2116 смарт: Лопато 04.02.2025
						//++ #4494 смарт: Тимофеева 14.10.2025 / Ошибка ЖР. Документ Заказ клиента. Способ доставки Самовывоз
						И НЕ Справочники.Склады.ЭтоГруппа(ТекСтрока.Склад)
						//-- #4494 смарт: Тимофеева 14.10.2025
						И НЕ ТекСтрока.Склад.смартАвтоматическиФормироватьДокументы Тогда
						НовыйСклад = ТЧСклады.Добавить();
						НовыйСклад.Склад = ТекСтрока.Склад;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	//++#1578 смарт: Лопато 15.12.2023 //Ошибка в заказе клиента при изменении адреса доставки  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТЧСклады.Склад КАК Склад
	|ПОМЕСТИТЬ ТЧСклады
	|ИЗ
	|	&ТЧСклады КАК ТЧСклады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкладыКонтактнаяИнформация.Вид.Представление КАК Вид,
	|	СкладыКонтактнаяИнформация.Представление 	 КАК АдресДоставки,
	|	СкладыКонтактнаяИнформация.Значение 		 КАК АдресДоставкиЗначение,
	|	СкладыКонтактнаяИнформация.ЗначенияПолей 	 КАК АдресДоставкиЗначенияПолей
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|ГДЕ
	|	СкладыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ТЧСклады.Склад
	|			ИЗ
	|				ТЧСклады)
	|	И СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И СкладыКонтактнаяИнформация.Вид = &Вид");
	//--#1578 смарт: Лопато 15.12.2023

	Запрос.УстановитьПараметр("Вид", 	  Справочники.ВидыКонтактнойИнформации.АдресСклада);
	Запрос.УстановитьПараметр("ТЧСклады", ТЧСклады);

	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //--#1382 смарт: Лопато 21.06.2023

//++#1382 смарт: Лопато 21.06.2023 //Заполнение параметров заказа при самовывозе  
Функция смартПолучитьАдресСклада(СкладВШапке, ТЧТовары, АдресДоставки, СпособДоставки) Экспорт
	
	//++#1578 смарт: Лопато 15.12.2023 //Ошибка в заказе клиента при изменении адреса доставки  
	Результат = Новый Структура("АдресДоставки, АдресДоставкиЗначение, АдресДоставкиЗначенияПолей");
	//--#1578 смарт: Лопато 15.12.2023
	
	СкладыАдреса = смартПолучитьТЗАдресовСкладов(СкладВШапке, ТЧТовары, СпособДоставки);
	
	Результат.Вставить("СкладыАдреса", СкладыАдреса);
	
	Если СкладыАдреса.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(АдресДоставки) Тогда
			ЗаполнитьЗначенияСвойств(Результат, СкладыАдреса[0]);
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //--#1382 смарт: Лопато 21.06.2023

//++#1578 смарт: Лопато 15.12.2023 //Ошибка в заказе клиента при изменении адреса доставки  
Функция смартСтруктураВыбораАдресДоставки() Экспорт
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции //--#1578 смарт: Лопато 15.12.2023

//++#1578 смарт: Лопато 15.12.2023 //Ошибка в заказе клиента при изменении адреса доставки  
Процедура смартДозаполнитьПустыеСвойстваАдресДоставки(СтруктураПриемник, Источник) Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры //--#1578 смарт: Лопато 15.12.2023

//++ #1366 смарт: Фролов 28.06.2023 //Отслеживать появление на складах запчастей, требуемых для выполнения заявок со статусом  
Функция смартВычислитьРазличияВТаблицахЗначений(Таблица0, Таблица1, Измерения) Экспорт
	
	Отбор = Новый Структура(Измерения);
    
    Ресурсы = Новый Массив;
    Для ИндексКолонки = 0 По Таблица0.Колонки.Количество() - 1 Цикл
        Если НЕ Отбор.Свойство(Таблица0.Колонки[ИндексКолонки].Имя) Тогда
            Ресурсы.Добавить(ИндексКолонки)
        КонецЕсли
    КонецЦикла;
    
    Таблица1.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
    Таблица1.ЗаполнитьЗначения(1, "Знак");
    НовыйИндекс = Таблица1.Индексы.Добавить(Измерения);
    
    Разница = Таблица1.СкопироватьКолонки();
    
    Для Каждого Строка0 Из Таблица0 Цикл
        ЗаполнитьЗначенияСвойств(Отбор, Строка0); 
        Строки1 = Таблица1.НайтиСтроки(Отбор);
        Если Строки1.Количество() = 0 Тогда     
            ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка0)     
        Иначе
            Строка1 = Строки1[0];
            Для Каждого Ресурс Из Ресурсы Цикл 
                Если Строка0[Ресурс] <> Строка1[Ресурс] Тогда    
                    ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка0);
                    ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка1);
                    Прервать 
                КонецЕсли 
            КонецЦикла;
            Строка1.Знак = 0 
        КонецЕсли 
    КонецЦикла;
    
    Для Каждого Строка1 Из Таблица1.НайтиСтроки(Новый Структура("Знак", 1)) Цикл 
        ЗаполнитьЗначенияСвойств(Разница.Добавить(), Строка1); 
    КонецЦикла;
    
    Таблица1.Колонки.Удалить("Знак");
    Таблица1.Индексы.Удалить(НовыйИндекс);
        
    Возврат Разница
	
КонецФункции  //-- #1366 смарт: Фролов 28.06.2023

//++ #1416 смарт: Фролов 28.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ  
Процедура смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма, ДокСсылка = Неопределено, ТекстПисьма = "") Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор();
	
	НаборЗаписей = РегистрыСведений.смартКэшНеОтправленныхПочтовыхСообщений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УИДПисьма.Установить(КлючУникальности); 
	НаборЗаписей.Прочитать();
	
	СтрПолучателиТекст = "";
	СтруктураЗаписи = Новый Структура; 
	СтруктураЗаписиКопии = Новый Структура;
	МасПолучатели = Новый Массив;
	
	Для Каждого СтрПолучатели Из ПараметрыПисьма.Кому Цикл
		
		СтрПолучателиТекст = СтрПолучателиТекст+СтрПолучатели.Представление + "; ";
		МасПолучатели.Добавить(Строка(СтрПолучатели.Представление));
		
	КонецЦикла;	
	
	Если ПараметрыПисьма.Свойство("Копии") Тогда
		
		МасКопии = Новый Массив;
		
		Для Каждого СтрКопии Из ПараметрыПисьма.Копии Цикл
			
			СтрКопииТекст = СтрКопииТекст+СтрКопии.Представление+"; ";
			МасКопии.Добавить(Строка(СтрКопии.Представление));	
			
		КонецЦикла;
		
	КонецЕсли;	
	
	СтруктураЗаписи.Вставить("МасПолучатели", МасПолучатели);
	СтруктураЗаписиКопии.Вставить("МасПолучатели", МасКопии);
	
	Если ПараметрыПисьма.Свойство("Вложения") Тогда
		
		Для Каждого СтруктураВложение Из ПараметрыПисьма.Вложения Цикл
			
			СтрНаборЗаписей = НаборЗаписей.Добавить();
			
			Если НЕ ЭтоАдресВременногоХранилища(СтруктураВложение.АдресВоВременномХранилище) Тогда
				
				ЭлементХранилища = Новый ХранилищеЗначения(Новый ДвоичныеДанные(СтруктураВложение.АдресВоВременномХранилище));
				СтрНаборЗаписей.ПрисоединенныйФайл = ЭлементХранилища; 
				
			Иначе	
				
				ЗагруженныйФайл = ПолучитьИзВременногоХранилища(СтруктураВложение.АдресВоВременномХранилище);
				ЭлементХранилища = Новый ХранилищеЗначения(ЗагруженныйФайл);
				СтрНаборЗаписей.АдресХранилища = СтруктураВложение.АдресВоВременномХранилище;
				СтрНаборЗаписей.ПрисоединенныйФайл = ЭлементХранилища; 
				
			КонецЕсли;
			
			СтрНаборЗаписей.УИДПисьма = КлючУникальности;
			
			Если ПараметрыПисьма.Свойство("АдресОтвета") Тогда
				СтрНаборЗаписей.УчетнаяЗаписьОтправки = ПараметрыПисьма.АдресОтвета;
			КонецЕсли;
			
			СтрНаборЗаписей.ТемаПисьма = ПараметрыПисьма.Тема;
			СтрНаборЗаписей.СсылкаНаОбъект = ДокСсылка;  
			СтрНаборЗаписей.Получатели = СтрПолучателиТекст; 
			СтрНаборЗаписей.Копии = СтрКопииТекст;
			СтрНаборЗаписей.ТелоПисьма = ТекстПисьма;
			СтрНаборЗаписей.Пользователь = ПараметрыСеанса.ТекущийПользователь; 
			СтрНаборЗаписей.ИмяФайла = СтруктураВложение.Представление;
			
			Запись =Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			ЗаписатьJSON(Запись, СтруктураЗаписи);
			СтрНаборЗаписей.ПолучателиМассив = Запись.Закрыть(); 
			
			Если НЕ СтруктураЗаписиКопии.МасПолучатели = Неопределено Тогда
				
				Запись = Новый ЗаписьJSON;
				Запись.УстановитьСтроку();
				ЗаписатьJSON(Запись, СтруктураЗаписиКопии);
				СтрНаборЗаписей.КопииМассив = Запись.Закрыть();
				
			КонецЕсли;
			
		КонецЦикла;                                    
	Иначе
		
		СтрНаборЗаписей = НаборЗаписей.Добавить();
		СтрНаборЗаписей.УИДПисьма = КлючУникальности;
		
		Если ПараметрыПисьма.Свойство("АдресОтвета") Тогда
			СтрНаборЗаписей.УчетнаяЗаписьОтправки = ПараметрыПисьма.АдресОтвета;
		КонецЕсли;
		
		СтрНаборЗаписей.ТемаПисьма = ПараметрыПисьма.Тема;
		СтрНаборЗаписей.СсылкаНаОбъект = ДокСсылка;  
		СтрНаборЗаписей.Получатели = СтрПолучателиТекст;
		СтрНаборЗаписей.Копии = СтрКопииТекст;
		СтрНаборЗаписей.ТелоПисьма = ТекстПисьма;
		СтрНаборЗаписей.Пользователь = ПараметрыСеанса.ТекущийПользователь; 
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, СтруктураЗаписи);
		СтрНаборЗаписей.ПолучателиМассив = Запись.Закрыть(); 
		
		Если НЕ СтруктураЗаписиКопии.МасПолучатели = Неопределено Тогда
			
			Запись = Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			ЗаписатьJSON(Запись, СтруктураЗаписиКопии);
			СтрНаборЗаписей.КопииМассив = Запись.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
//-- #1416 смарт: Фролов 28.08.2023

//++#1459 смарт: Лопато 13.09.2023 //При копировании контрагента не очищается история наименования  
Процедура ОчиститьРеквизитыОбъекта(Объект, ИменаРеквизитов = Неопределено, ИменаТабличныхЧастей = Неопределено, ИменаИсключений = Неопределено) Экспорт
	
	Реквизиты = Объект.Метаданные().Реквизиты;
	СтандартныеРеквизиты = Объект.Метаданные().СтандартныеРеквизиты; 
	ТабличныеЧасти = Объект.Метаданные().ТабличныеЧасти;
	ИмяНаименование = "Наименование";
	
	МассивРеквизитов = Новый Массив;
	Если ИменаРеквизитов <> Неопределено И ТипЗнч(ИменаРеквизитов) = Тип("Строка") Тогда
		МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ИменаРеквизитов, ", ");
	Иначе	
		Для Каждого ЭлементКоллекции Из Реквизиты Цикл
			МассивРеквизитов.Добавить(ЭлементКоллекции.Имя);
		КонецЦикла;	
		Для Каждого ЭлементКоллекции Из СтандартныеРеквизиты Цикл
			Если ЭлементКоллекции.Имя = ИмяНаименование Тогда 
				МассивРеквизитов.Добавить(ЭлементКоллекции.Имя);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	МассивТабличныхЧастей = Новый Массив;
	Если ИменаТабличныхЧастей <> Неопределено И ТипЗнч(ИменаТабличныхЧастей) = Тип("Строка") Тогда
		МассивТабличныхЧастей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ИменаТабличныхЧастей, ", ");
	Иначе	
		Для Каждого ЭлементКоллекции Из ТабличныеЧасти Цикл
			МассивТабличныхЧастей.Добавить(ЭлементКоллекции.Имя);
		КонецЦикла;	
	КонецЕсли;	
	
	МассивИсключений = Новый Массив;
	Если ИменаИсключений <> Неопределено И ТипЗнч(ИменаИсключений) = Тип("Строка") Тогда
		МассивИсключений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ИменаИсключений, ", ");
	КонецЕсли;	
	
	Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если МассивИсключений.Найти(ИмяРеквизита) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Реквизиты.Найти(ИмяРеквизита) <> Неопределено ИЛИ ИмяРеквизита = ИмяНаименование)
			И ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
			
			Объект[ИмяРеквизита] = Неопределено;

		КонецЕсли;
			
	КонецЦикла;
			
	Для Каждого ИмяТабличнойЧасти Из МассивТабличныхЧастей Цикл
		
		Если МассивИсключений.Найти(ИмяТабличнойЧасти) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТабличныеЧасти.Найти(ИмяТабличнойЧасти) <> Неопределено
			И Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
			
			Объект[ИмяТабличнойЧасти].Очистить();

		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры //--#1459 смарт: Лопато 13.09.2023

//++#1463 смарт: Лопато 20.09.2023 //Изменить выборку расчета бонусов по подразделению заказа.  
Функция смартПолучитьЗначениеСвойстваОффлайнЗаказ(Заказ) Экспорт
	
	ЗначСвойства = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|    ДополнительныеСведения.Значение КАК ЗначениеСв
	|ИЗ
	|    РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|    ДополнительныеСведения.Свойство.Наименование Подобно &ИмяСвойства
	|   И ДополнительныеСведения.Объект=&ОбъектЗаказ";
	
	Запрос.УстановитьПараметр("ОбъектЗаказ", Заказ.Ссылка);
	Запрос.УстановитьПараметр("ИмяСвойства", "%Оффлайн%заказ%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	Если ВыборкаРезультата.Следующий() Тогда
		ЗначСвойства = ВыборкаРезультата.ЗначениеСв;
	КонецЕсли;
	
	Возврат ЗначСвойства;
	
КонецФункции //--#1463 смарт: Лопато 20.09.2023

//++ #Б-5936 смарт: Фролов 06.03.2026 //Ошибка. Доработать механизм перераспределения лидов.
Функция ВернутьКонтрольныеДатуВремя(Менеджер, Квалификация) Экспорт
	
	ВремяРеакцииОбщее = Справочники.смартПредопределенныеЗначения.Настройки.КонтрольныйСрокОбработкиЛида;
	
	ВремяПоГринвичу = Менеджер.Подразделение.CRM_Офис.CRM_ВремяПоГринвичу_GMT;
	ПриведеннаяТекущаяДата = ТекущаяДата() + (ВремяПоГринвичу - 3) * 3600;
	
	Если ДатаЯвляетсяРабочей(ТекущаяДата()) ТОгда
		
		Если НачалоДня(ТекущаяДата()) + 3600 * 17 >= ПриведеннаяТекущаяДата Тогда //Определяем не закончился ли рабочий день
			//Успеваем сегодня
			Если НачалоДня(ТекущаяДата()) + 3600 * 9 >= ПриведеннаяТекущаяДата ТОгда
				Возврат НачалоДня(ТекущаяДата()) + 3600 * 9 + ?(Квалификация.ВремяРеакции = 0, ВремяРеакцииОбщее, Квалификация.ВремяРеакции * 3600);
			Иначе	
				Возврат ПриведеннаяТекущаяДата + ?(Квалификация.ВремяРеакции = 0, ВремяРеакцииОбщее, Квалификация.ВремяРеакции * 3600);
			КонецЕсли;
			
		Иначе
			//Переносим на следующий рабочий день
			СледующийРабочийДень = ПолучитьПрибавитьКДатеКоличествоРабочихДней(ПриведеннаяТекущаяДата, 1);
			КонтрольнаяДата = СледующийРабочийДень + 3600 * 9 - (ВремяПоГринвичу - 3) * 3600 + ?(Квалификация.ВремяРеакции = 0, ВремяРеакцииОбщее, Квалификация.ВремяРеакции * 3600);
			Возврат КонтрольнаяДата;
			
		КонецЕсли;
		
	Иначе
		//Переносим на следующий рабочий день
		СледующийРабочийДень = ПолучитьПрибавитьКДатеКоличествоРабочихДней(ПриведеннаяТекущаяДата, 1);
		КонтрольнаяДата = СледующийРабочийДень + 3600 * 9 - (ВремяПоГринвичу - 3) *3600 + ?(Квалификация.ВремяРеакции = 0, ВремяРеакцииОбщее, Квалификация.ВремяРеакции * 3600);
		Возврат КонтрольнаяДата;
		
	КонецЕсли;
	
КонецФункции

//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
// Добавил область
#Область Мимаки

//++#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)
// Выполняет проверку объекта (документа) на соблюдения условий по производютелю Мимаки
// Параметры:
//  Объект  - ЛюбойОбъект - объект (документ), который следует анализировать.
//			- Форма - форма клиентского приложения, содержащая объект (документ)
//
// Возвращаемое значение:
//  Производитель Мимаки - СправочникСсылка.Производители.
//                 		   Если производитель Мимаки не найден, будет возвращена пустая ссылка.
Функция Мимаки_УсловияОбъектаВыполнены(Объект) Экспорт
	
	//++ #1838 смарт: Ермаков 03.06.2024 / Изменить условие обязательного заполнения отчета
	МассивПроизводителей = 
		ПолучитьСмартПредопределенноеЗначение(
			Справочники.смартПредопределенныеЗначения.ПроизводительМимаки, Истина);
			
	Если Не МассивПроизводителей.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;	
	//-- #1838 смарт: Ермаков 03.06.2024
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.смартЗаявкаНаГарантийныйРемонт")
		 Или ТипЗнч(Объект) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт")
		 Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт")
		Тогда
		
		// Оборудование - это реквизит объекта
		Возврат ЗначениеЗаполнено(Объект.Оборудование)
				 И Не МассивПроизводителей.Найти(Объект.Оборудование.Производитель) = Неопределено;
				 
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.смартЗаявкаНаПускоНаладку")
		 Или ТипЗнч(Объект) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")
		 Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.смартЗаявкаНаПускоНаладку")
		Тогда
		
		// Оборудование - это табличная часть объекта
		ОборудованиеВТаблицеНайдено = Ложь;
		Для Каждого СтрокаТаблицы Из Объект.Оборудование Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Оборудование)
				 И Не МассивПроизводителей.Найти(СтрокаТаблицы.Оборудование.Производитель) = Неопределено
				Тогда
				
				ОборудованиеВТаблицеНайдено = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ОборудованиеВТаблицеНайдено;
		
	КонецЕсли;
	
КонецФункции
//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)

#КонецОбласти
//--#1466 смарт: Ермаков 21.09.2023 // Изменить условие обязательного заполнения отчета (отчет mimaki)      

#Область УчетПоСериям

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПравоУказыватьСерииВручную() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь() ИЛИ Пользователи.РолиДоступны("смартУказаниеСерийВручную");
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартЗаполнитьОбеспечениеСериямиПоFEFO(Знач Объект, Форма, Операция, ДанныеЗаполнения, ПараметрыУказанияСерий) Экспорт
	
	//++#1547 смарт: Лопато 27.05.2024 //Ошибка при автоматической установке резерва
	Если Форма = Неопределено ИЛИ ПараметрыУказанияСерий = Неопределено Тогда
		Возврат ДанныеЗаполнения;
	КонецЕсли;	
	//--#1547 смарт: Лопато 27.05.2024
	
	ДанныеЗаполненияЭтоТаблицаЗначений = ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений");
	
	Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
		//++ #Б-1684 смарт: Лопато 20.01.2025 //Автоматическое заполнение серий чернил в Заказе клиента. Ошибка  
		ДанныеЗаполнения.Колонки.Добавить("Номенклатура");
		ДанныеЗаполнения.Колонки.Добавить("Характеристика");
		//-- #Б-1684 смарт: Лопато 20.01.2025
		ДанныеЗаполнения.Колонки.Добавить("Серия");
	КонецЕсли;	

	ДанныеЗаполненияИсходные = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеЗаполнения);
	
	Для Каждого СтрокаДанныхЗаполнения Из ДанныеЗаполненияИсходные Цикл 
		
		СтрокаОбеспечения 		 = Неопределено;
		СтрокаОбеспеченияИндекс  = Неопределено;
	    КоличествоКРаспределению = 0;
	
		Если СтрокаДанныхЗаполнения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить И СтрокаДанныхЗаполнения.Количество > 0 Тогда
			  
			СтрокаОбеспечения 		 = СтрокаДанныхЗаполнения;
			КоличествоКРаспределению = СтрокаДанныхЗаполнения.Количество;
			
		КонецЕсли;
			  
		Если СтрокаОбеспечения = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
			СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(СтрокаОбеспечения.Идентификатор);
		ИначеЕсли Операция = "ИндексыСтрок" Тогда
			СтрокаТовары = Объект.Товары[СтрокаОбеспечения.Идентификатор];
		КонецЕсли;

		Если НЕ смартДействуетОсобыйУчетСерий(СтрокаТовары.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовары.ВариантОбеспечения = СтрокаОбеспечения.ВариантОбеспечения;

		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

		Если СтрокаТовары.СтатусУказанияСерий <> 0 Тогда
		
			Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				ПараметрыФормы = смартПараметрыВыбораОбеспеченияЗаказКлиента(Объект, Форма, СтрокаОбеспечения.Идентификатор);
			ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				ПараметрыФормы = смартПараметрыВыбораОбеспеченияЗаказНаПеремещение(Объект, Форма, СтрокаОбеспечения.Идентификатор);
			ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
				ПараметрыФормы = смартПараметрыВыбораОбеспеченияЗаказНаСборку(Объект, Форма, СтрокаОбеспечения.Идентификатор);
			ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
				ПараметрыФормы = смартПараметрыВыбораОбеспеченияЗаказНаВнутреннееПотребление(Объект, Форма, СтрокаОбеспечения.Идентификатор);
			Иначе	
				Продолжить;
			КонецЕсли;	

			Операция = "СтрокаТовары";
			
			//++#Б-732 смарт: Лопато 14.10.2024 //Автоматическое заполнение серий чернил в заказах (ошибка)
			ОстаткиСерий = смартВыполнитьЗапросЗаполненияТаблицыОстатковСерий(Объект, ПараметрыУказанияСерий, СтрокаТовары, ПараметрыФормы, ДанныеЗаполнения);
			//--#Б-732 смарт: Лопато 14.10.2024
			
			Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
				МассивСтрокиОбеспечения = Новый Массив;
				МассивСтрокиОбеспечения.Добавить(СтрокаОбеспечения);
				ОбразецСтрокаОбеспечения = ДанныеЗаполненияИсходные.Скопировать(МассивСтрокиОбеспечения);	
			Иначе	
				ОбразецСтрокаОбеспечения = ОбщегоНазначения.СкопироватьРекурсивно(СтрокаОбеспечения);
			КонецЕсли;
			
			Для Каждого СтрокаНовыхДанныхЗаполнения Из ДанныеЗаполнения Цикл
				
				//++#Б-732 смарт: Лопато 14.10.2024 //Автоматическое заполнение серий чернил в заказах (ошибка)
				Если СтрокаНовыхДанныхЗаполнения.Идентификатор = СтрокаДанныхЗаполнения.Идентификатор
					И СтрокаНовыхДанныхЗаполнения.ВариантОбеспечения = СтрокаДанныхЗаполнения.ВариантОбеспечения Тогда
				//--#Б-732 смарт: Лопато 14.10.2024
					
					Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
						СтрокаОбеспеченияИндекс = ДанныеЗаполнения.Индекс(СтрокаНовыхДанныхЗаполнения);
					Иначе
						СтрокаОбеспеченияИндекс = ДанныеЗаполнения.Найти(СтрокаНовыхДанныхЗаполнения);
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;	
			
			ТекущийИндекс = СтрокаОбеспеченияИндекс;
			
			Для Каждого СтрокаСерии Из ОстаткиСерий Цикл
				
				Если КоличествоКРаспределению <= 0 Тогда
					Прервать;
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(СтрокаСерии.Серия) И СтрокаСерии.СвободныйОстаток > 0 Тогда
								
					КоличествоСерии = Мин(СтрокаСерии.СвободныйОстаток, КоличествоКРаспределению);
				
					Если ТекущийИндекс = СтрокаОбеспеченияИндекс Тогда
						
						ТекущаяСтрокаОбеспечения = ДанныеЗаполнения.Получить(ТекущийИндекс);
							
					Иначе

						Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
							ТекущаяСтрокаОбеспечения = ДанныеЗаполнения.Вставить(ТекущийИндекс);
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаОбеспечения, ОбразецСтрокаОбеспечения[0]);
						Иначе
							ТекущаяСтрокаОбеспечения = ОбщегоНазначения.СкопироватьРекурсивно(ОбразецСтрокаОбеспечения);
							ДанныеЗаполнения.Вставить(ТекущийИндекс, ТекущаяСтрокаОбеспечения);
						КонецЕсли;
						
					КонецЕсли;					
					
					//++ #Б-1684 смарт: Лопато 20.01.2025 //Автоматическое заполнение серий чернил в Заказе клиента. Ошибка  
					Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
						
						ТекущаяСтрокаОбеспечения.Номенклатура 	= СтрокаТовары.Номенклатура;
						ТекущаяСтрокаОбеспечения.Характеристика = СтрокаТовары.Характеристика;
						
					КонецЕсли;
					//-- #Б-1684 смарт: Лопато 20.01.2025
					
					ТекущаяСтрокаОбеспечения.Количество = КоличествоСерии;
					ТекущаяСтрокаОбеспечения.Серия 		= СтрокаСерии.Серия;
					
					КоличествоКРаспределению = КоличествоКРаспределению - КоличествоСерии;

					ТекущийИндекс = ТекущийИндекс + 1;
					
				КонецЕсли;

			КонецЦикла;	
			
			Если КоличествоКРаспределению > 0 И ДанныеЗаполнения.Количество() > 1 Тогда

				Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
					ТекущаяСтрокаОбеспечения = ДанныеЗаполнения.Вставить(ТекущийИндекс);
					ЗаполнитьЗначенияСвойств(ТекущаяСтрокаОбеспечения, ОбразецСтрокаОбеспечения[0]);
				Иначе
					ТекущаяСтрокаОбеспечения = ОбщегоНазначения.СкопироватьРекурсивно(ОбразецСтрокаОбеспечения);
					ДанныеЗаполнения.Вставить(ТекущийИндекс, ТекущаяСтрокаОбеспечения);
				КонецЕсли;

				ТекущаяСтрокаОбеспечения.Количество = КоличествоКРаспределению;
				
			КонецЕсли;	
			
		КонецЕсли;

	КонецЦикла;
	
	//++#1774 смарт: Лопато 29.05.2024 //Автоматическое заполнение серий чернил в заказах. Продолжение задачи 1547.
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") 
		  ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Массив"))
		И ДанныеЗаполнения.Количество() > 1 Тогда
		  
		МассивСерий = Новый Массив;
		
		Для Каждого СтрДанныеЗаполнения Из ДанныеЗаполнения Цикл
			МассивСерий.Добавить(СтрДанныеЗаполнения.Серия);			
		КонецЦикла;	
		
		СвернутыйМассивСерий = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСерий);		
		
		Если МассивСерий.Количество() <> СвернутыйМассивСерий.Количество() Тогда
		
			Если ДанныеЗаполненияЭтоТаблицаЗначений Тогда
				
				ДанныеЗаполнения.Свернуть("Идентификатор, Склад, ВариантОбеспечения, ДатаОтгрузки, 
										  |Приоритет, ПриоритетТипаОбеспечения, СкладНаименование, Серия", 
										  "Количество, Отгружено");
				
			Иначе
				
				ТеблицаЗначенийДанныеЗаполнения = CRM_ОбменСMSOutlookСервер.МассивСтруктурВТаблицуЗначений(ДанныеЗаполнения);	

				ТеблицаЗначенийДанныеЗаполнения.Свернуть("Идентификатор, Склад, ВариантОбеспечения, ДатаОтгрузки, Серия",
														 "Количество, Отгружено");
				
				ДанныеЗаполнения = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТеблицаЗначенийДанныеЗаполнения);
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;	
	//--#1774 смарт: Лопато 29.05.2024
	
	Возврат ДанныеЗаполнения;
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023	

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
//++#Б-732 смарт: Лопато 14.10.2024 //Автоматическое заполнение серий чернил в заказах (ошибка)
Функция смартВыполнитьЗапросЗаполненияТаблицыОстатковСерий(Объект, ПараметрыУказанияСерий, ТекСтрокаТовары, ПараметрыФормы, ДанныеЗаполнения)
//--#Б-732 смарт: Лопато 14.10.2024

	ТекущаяНоменклатура 	  = ТекСтрокаТовары.Номенклатура;
	ТекущаяХарактеристика 	  = ТекСтрокаТовары.Характеристика;
	ТекущийВидНоменклатуры 	  = ТекущаяНоменклатура.ВидНоменклатуры;
	ТекущийВариантОбеспечения = ТекСтрокаТовары.ВариантОбеспечения;
	
	Регистратор  = Объект.Ссылка;
	Распоряжение = Объект.Ссылка;
	Назначение 	 = Справочники.Назначения.ПустаяСсылка();

	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ТекущийСклад = ТекСтрокаТовары.Склад;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		ТекущийСклад = Объект.СкладОтправитель;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		ТекущийСклад = Объект.Склад;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		ТекущийСклад = Объект.Склад;
	КонецЕсли;
	
	ОстаткиСерий = Новый ТаблицаЗначений;
	ОстаткиСерий.Колонки.Добавить("Серия", 					Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ОстаткиСерий.Колонки.Добавить("СвободныйОстаток", 		Новый ОписаниеТипов("Число"));
	ОстаткиСерий.Колонки.Добавить("ГоденДо", 				Новый ОписаниеТипов("Дата"));
	ОстаткиСерий.Колонки.Добавить("Номер", 					Новый ОписаниеТипов("Строка"));
	ОстаткиСерий.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	ОстаткиСерий.Колонки.Добавить("КоличествоУпаковок", 	Новый ОписаниеТипов("Число"));
	ОстаткиСерий.Колонки.Добавить("РежимОтображенияСерий", 	Новый ОписаниеТипов("Строка"));
	ОстаткиСерий.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ОстаткиСерий.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОстаткиСерий.Колонки.Добавить("Склад", 					Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ОстаткиСерий.Колонки.Добавить("ВариантОбеспечения", 	Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыОбеспечения"));
	ОстаткиСерий.Колонки.Добавить("СтрокаЗаказа", 			Новый ОписаниеТипов("Число"));
	ОстаткиСерий.Колонки.Добавить("Назначение", 			Новый ОписаниеТипов("СправочникСсылка.Назначения"));

	АдресТаблицыПодобраноРанее = ПараметрыФормы.АдресТаблицыПодобраноРанее;	
	
	ВариантПолучениеДанныхИзРегистров = "ЗаказНакладнаяСерииИзОстатка";
	
	ПараметрыЗапросаВрем = Новый Структура;
	ПараметрыЗапросаВрем.Вставить("Номенклатура", ТекущаяНоменклатура);
	ПараметрыЗапросаВрем.Вставить("Характеристика", ТекущаяХарактеристика);
	Если ЗначениеЗаполнено(Назначение) И ТекущийВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда
		ПараметрыЗапросаВрем.Вставить("ВсеСерии", Ложь);
	Иначе
		ПараметрыЗапросаВрем.Вставить("ВсеСерии", Истина);
	КонецЕсли;
	Если ТекущийВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда
		ПараметрыЗапросаВрем.Вставить("Назначение", Назначение);
	Иначе
		ПараметрыЗапросаВрем.Вставить("Назначение", Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	ПараметрыЗапросаВрем.Вставить("Склад",        ТекущийСклад);
	ПараметрыЗапросаВрем.Вставить("Помещение",    Справочники.СкладскиеПомещения.ПустаяСсылка());
	ПараметрыЗапросаВрем.Вставить("Регистратор",  Регистратор);
	ПараметрыЗапросаВрем.Вставить("Распоряжение", Распоряжение);
	
	ПараметрыЗапросаОстаткаСерий = Новый ФиксированнаяСтруктура(ПараметрыЗапросаВрем);
	
	ТекстЗапроса = Обработки.ПодборСерийВДокументы.ТекстЗапросаФормированияТаблицыДанныеРегистров(ВариантПолучениеДанныхИзРегистров,
		ТекущийСклад);
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	ДанныеРегистров.Серия КАК Серия,
	//++#1774 смарт: Лопато 29.05.2024 //Автоматическое заполнение серий чернил в заказах. Продолжение задачи 1547.
	|	ВЫРАЗИТЬ(
	|		СТРЗАМЕНИТЬ(
	|			СТРЗАМЕНИТЬ(
	|				ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Номер, 
	|			""-"", """"),
	|		""."", """")
	|		КАК СТРОКА(1000))
	|	КАК Номер,
	//--#1774 смарт: Лопато 29.05.2024
	|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ГоденДо КАК ГоденДо,
	|	ДанныеРегистров.СвободныйОстаток КАК СвободныйОстаток
	|ПОМЕСТИТЬ ОстаткиСерий
	|ИЗ
	|	ДанныеРегистров КАК ДанныеРегистров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|	ТаблицаТоваров.Склад КАК Склад,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Серия,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ПОМЕСТИТЬ ПодобранныеСерии
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Номенклатура = &Номенклатура
	|	И ТаблицаТоваров.Характеристика = &Характеристика
	|	И (ТаблицаТоваров.Назначение = &Назначение
	|			ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|				И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
	|	И ТаблицаТоваров.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиСерий.Серия,
	|	ОстаткиСерий.Номер,
	|	ОстаткиСерий.ГоденДо,
	|	ОстаткиСерий.СвободныйОстаток - ЕСТЬNULL(ПодобранныеСерии.Количество, 0) КАК СвободныйОстаток,
	|	ВЫБОР КОГДА ОстаткиСерий.Номер ЕСТЬ NULL ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПриоритетИтог
	|ИЗ
	|	ОстаткиСерий КАК ОстаткиСерий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодобранныеСерии КАК ПодобранныеСерии
	|		ПО ОстаткиСерий.Серия = ПодобранныеСерии.Серия
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетИтог,
	|	ГоденДо,
	|	Номер";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Для Каждого Параметр Из ПараметрыЗапросаОстаткаСерий Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаТоваров = ОстаткиСерий.Скопировать().СкопироватьКолонки();
	Для Каждого Строка Из ПолучитьИзВременногоХранилища(АдресТаблицыПодобраноРанее) Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	//++#Б-732 смарт: Лопато 14.10.2024 //Автоматическое заполнение серий чернил в заказах (ошибка)
	Для Каждого Строка Из ДанныеЗаполнения Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Серия) Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ТаблицаТоваров.Добавить();

		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		//++ #Б-1684 смарт: Лопато 20.01.2025 //Автоматическое заполнение серий чернил в Заказе клиента. Ошибка  
		НоваяСтрока.Назначение = Назначение;
		//-- #Б-1684 смарт: Лопато 20.01.2025
		
	КонецЦикла;
	//--#Б-732 смарт: Лопато 14.10.2024
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	СтруктураЗначенияПриоритетаПоСрокамГодностиСерий = смартПолучитьЗначенияПриоритетаПоСрокамГодностиСерий(Объект, ТекущийВидНоменклатуры);

	Если СтруктураЗначенияПриоритетаПоСрокамГодностиСерий.ПриоритетПоСрокам 
		И СтруктураЗначенияПриоритетаПоСрокамГодностиСерий.МинимальныйСрокГодностиВМесяцах <> 0 Тогда

		Запрос.УстановитьПараметр("ДатаПроверки", 					 ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("МинимальныйСрокГодностиВМесяцах", СтруктураЗначенияПриоритетаПоСрокамГодностиСерий.МинимальныйСрокГодностиВМесяцах);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ПО
		|	ПриоритетИтог,
		|	ГоденДо,",
		"ПО
		|	ПриоритетИтог,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(&ДатаПроверки, ОстаткиСерий.ГоденДо, ДЕНЬ) / 30 >= &МинимальныйСрокГодностиВМесяцах
		|			ТОГДА ГоденДо
		|	КОНЕЦ ВОЗР,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(&ДатаПроверки, ОстаткиСерий.ГоденДо, ДЕНЬ) / 30 < &МинимальныйСрокГодностиВМесяцах
		|			ТОГДА ГоденДо
		|	КОНЕЦ УБЫВ,");
		
	КонецЕсли;	
	
	ОстаткиСерий = Запрос.Выполнить().Выгрузить();
	
	//++#1774 смарт: Лопато 29.05.2024 //Автоматическое заполнение серий чернил в заказах. Продолжение задачи 1547.
	Если ОстаткиСерий.Количество() > 0 
		И ЗначениеЗаполнено(ТекущийВидНоменклатуры)
		И смартДействуетОсобыйУчетСерий(ТекущийВидНоменклатуры) Тогда
		
		//Запоминаем сортировку по FEFO
		Приоритет = 0;
		ТекущаяДатаГоденДо = ОстаткиСерий[0].ГоденДо;
		
		Для Каждого СтрокаОстаткиFEFO Из ОстаткиСерий Цикл
			
			Если ТекущаяДатаГоденДо <> СтрокаОстаткиFEFO.ГоденДо Тогда
				
				Приоритет = Приоритет + 1;
				ТекущаяДатаГоденДо = СтрокаОстаткиFEFO.ГоденДо;
				
			КонецЕсли;
			 
			СтрокаОстаткиFEFO.ПриоритетИтог = Приоритет; 
			
		КонецЦикла;	
		
		//Подготовка итоговой таблицы
		ОстаткиСерийFIFO = ОстаткиСерий.Скопировать();
		ОстаткиСерийFIFO.Колонки.Добавить("ДатаПрихода", Новый ОписаниеТипов("Дата"));
		ОстаткиСерийFIFO.Очистить();
		
		ОстаткиСерийFEFO = ОстаткиСерий.Скопировать();
		
		СерииFEFO = ОстаткиСерийFEFO.ВыгрузитьКолонку("Серия");

		ПустаяСерия = СерииFEFO.Найти(Справочники.СерииНоменклатуры.ПустаяСсылка());
		
		Если ПустаяСерия <> Неопределено Тогда
			СерииFEFO.Удалить(СерииFEFO.Найти(Справочники.СерииНоменклатуры.ПустаяСсылка()));
		КонецЕсли;	
		
		//Запрос по датам прихода и списаниям
		Запрос.Текст = ПолучитьЗапросПартийСерийДляFIFO();
	
		Запрос.УстановитьПараметр("Серия", СерииFEFO);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ТаблицаПриходаFIFO = РезультатЗапроса[0].Выгрузить();
		ТаблицаРасходаFIFO = РезультатЗапроса[1].Выгрузить();
		
		//Попытка развернуть каждую строку FEFO по FIFO
		Для Каждого СтрокаFEFO Из ОстаткиСерийFEFO Цикл
			
			Если ЗначениеЗаполнено(СтрокаFEFO.Номер) Тогда
				
				СерияFEFO = СтрокаFEFO.Серия;
				
				ОтборСерия = Новый Структура("Серия", СерияFEFO);
				
				СтрокиПриходаПоСерии = ТаблицаПриходаFIFO.НайтиСтроки(ОтборСерия); 
				СтрокиРасходаПоСерии = ТаблицаРасходаFIFO.НайтиСтроки(ОтборСерия); 
				
				ПриходВсего = 0;
				Для Каждого СтрокаПриходFIFO Из СтрокиПриходаПоСерии Цикл
					ПриходВсего = ПриходВсего + СтрокаПриходFIFO.Количество;	
				КонецЦикла;
				
				РасходВсего = 0;
				Если СтрокиРасходаПоСерии.Количество() > 0 Тогда
					РасходВсего = -СтрокиРасходаПоСерии[0].Количество;
				КонецЕсли;
				
				//Проверка остатков по FEFO и FIFO
				Если (ПриходВсего - РасходВсего) = СтрокаFEFO.СвободныйОстаток Тогда
					
					ВсегоТребуетсяРаспределить = ПриходВсего - РасходВсего;
					ОстатокРасхода 		  	   = РасходВсего;
					
					Для Каждого СтрокаПриходFIFO Из СтрокиПриходаПоСерии Цикл
						
						СписатьРасход = Мин(ОстатокРасхода, СтрокаПриходFIFO.Количество);
						
						ОстатокРасхода 				= ОстатокРасхода - СписатьРасход;
						СтрокаПриходFIFO.Количество = СтрокаПриходFIFO.Количество - СписатьРасход;
						
						Если СтрокаПриходFIFO.Количество = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						РаспределитьКоличество = Мин(ВсегоТребуетсяРаспределить, СтрокаПриходFIFO.Количество);
						
						НоваяСтрокаFIFO = ОстаткиСерийFIFO.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаFIFO, СтрокаFEFO);
						
						НоваяСтрокаFIFO.СвободныйОстаток = РаспределитьКоличество;
						НоваяСтрокаFIFO.ДатаПрихода 	 = СтрокаПриходFIFO.Период;
						
						ВсегоТребуетсяРаспределить = ВсегоТребуетсяРаспределить - РаспределитьКоличество;
					
					КонецЦикла;
					
				Иначе
					
					//Количество остатка не совпало, оставляем строку как есть
					НоваяСтрокаFIFO = ОстаткиСерийFIFO.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрокаFIFO, СтрокаFEFO);
					
				КонецЕсли;	

			Иначе
				
				//Строка итога переносится без изменения
				НоваяСтрокаFIFO = ОстаткиСерийFIFO.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаFIFO, СтрокаFEFO);
				
			КонецЕсли;	
				
		КонецЦикла;	
		
		ОстаткиСерийFIFO.Сортировать("ПриоритетИтог, ДатаПрихода, Номер");
		
		ОстаткиСерий = ОстаткиСерийFIFO.Скопировать();
		
	КонецЕсли;	
	//--#1774 смарт: Лопато 29.05.2024

	Возврат ОстаткиСерий;
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1774 смарт: Лопато 29.05.2024 //Автоматическое заполнение серий чернил в заказах. Продолжение задачи 1547.
Функция ПолучитьЗапросПартийСерийДляFIFO()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахПриход.Период КАК Период,
		|	ТоварыНаСкладахПриход.Регистратор КАК Регистратор,
		|	ТоварыНаСкладахПриход.Серия КАК Серия,
		|	ТоварыНаСкладахПриход.ВНаличииПриход КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , 
		|			Регистратор,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика
		|				И (Назначение = &Назначение
		|					ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|						И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|				И Склад = &Склад
		|				И Серия В (&Серия)
		|				) КАК ТоварыНаСкладахПриход
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Серия КАК Серия,
		|	СУММА(ВложенныйЗапрос.СвободныйОстаток) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|	ТоварыНаСкладахПриход.Серия КАК Серия,
		|	-ТоварыНаСкладахПриход.ВНаличииРасход КАК СвободныйОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , ,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика
		|				И (Назначение = &Назначение
		|					ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|						И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|				И Склад = &Склад
		|				И Серия В (&Серия)
		|				) КАК ТоварыНаСкладахПриход
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.Серия,
		|	-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад
		|				И Характеристика = &Характеристика
		|				И (Назначение = &Назначение
		|					ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|						И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|				И Серия В (&Серия)) КАК ТоварыКОтгрузкеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыНаСкладах.Серия,
		|	ВЫБОР
		|		КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
		|		ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|ГДЕ
		|	ТоварыНаСкладах.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладах.Характеристика = &Характеристика
		|	И (ТоварыНаСкладах.Назначение = &Назначение
		|			ИЛИ ТоварыНаСкладах.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|				И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|	И ТоварыНаСкладах.Склад = &Склад
		|	И ТоварыНаСкладах.Регистратор = &Регистратор
		|	И Серия В (&Серия)
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РезервыСерий.Серия,
		|	ВЫБОР
		|		КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
		|		ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
		|ГДЕ
		|	РезервыСерий.Номенклатура = &Номенклатура
		|	И РезервыСерий.Характеристика = &Характеристика
		|	И (РезервыСерий.Назначение = &Назначение
		|			ИЛИ РезервыСерий.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|				И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|	И РезервыСерий.Склад = &Склад
		|	И РезервыСерий.Регистратор = &Регистратор
		|	И РезервыСерий.Серия В (&Серия)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Серия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Серия
		|АВТОУПОРЯДОЧИВАНИЕ";

	Возврат ТекстЗапроса;
	
КонецФункции //--#1774 смарт: Лопато 29.05.2024

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьЗначенияПриоритетаПоСрокамГодностиСерий(Объект, ВидНоменклатуры) Экспорт
	
	ПриоритетПоСрокам = Ложь;
	МинимальныйСрокГодностиВМесяцах = 0;
	
	Если ЗначениеЗаполнено(ВидНоменклатуры)	И смартДействуетОсобыйУчетСерий(ВидНоменклатуры) Тогда
	
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				ПартнерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Партнер", Истина);
			ИначеЕсли ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
				ПартнерЗаказа = Объект.Партнер;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПартнерЗаказа) Тогда

				ПартнерДилер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПартнерЗаказа, "Дилер", Истина);
				
				Если ПартнерДилер = Истина Тогда
					
					ПриоритетПоСрокам = Истина;
				    МинимальныйСрокГодностиВМесяцах = смартПолучитьМинимальныйСрокГодностиВМесяцах(ВидНоменклатуры, "ОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры", "К2");
					
				КонецЕсли;
				
			КонецЕсли;	
			
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			
			Если ЗначениеЗаполнено(Объект.СкладОтправитель) И ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
				
				БизнесРегионОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СкладОтправитель, "БизнесРегион", Истина);
				БизнесРегионПолучатель  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СкладПолучатель, "БизнесРегион", Истина);
				
				БизнесРегионМосква = Справочники.смартПредопределенныеЗначения.БизнесРегионМосква.Значение;
				
				Если ЗначениеЗаполнено(БизнесРегионПолучатель)
					И ЗначениеЗаполнено(БизнесРегионМосква)
					И БизнесРегионПолучатель <> БизнесРегионМосква
					И БизнесРегионПолучатель <> БизнесРегионОтправитель Тогда
				
					ПриоритетПоСрокам = Истина;
				    МинимальныйСрокГодностиВМесяцах = смартПолучитьМинимальныйСрокГодностиВМесяцах(ВидНоменклатуры, "ОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры", "К3");

				КонецЕсли;	
					
			КонецЕсли;	
			
		КонецЕсли;

	КонецЕсли;
		
	Результат = Новый Структура();
	Результат.Вставить("ПриоритетПоСрокам", 			  ПриоритетПоСрокам);
	Результат.Вставить("МинимальныйСрокГодностиВМесяцах", МинимальныйСрокГодностиВМесяцах);
	
	Возврат Результат;
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьМинимальныйСрокГодностиВМесяцах(ВидНоменклатуры, НаименованиеПредопределеннойНастройки, Колонка)
	
	МинимальныйСрокГодностиВМесяцах = 0;
	
	МассивСтруктурМинимальныйСрокГодностиВМесяцах = смартПолучитьПредопределенноеЗначениеТЧСписокЗначений(НаименованиеПредопределеннойНастройки);
	
	Для Каждого СтруктураМинимальныйСрокГодностиВМесяцах Из МассивСтруктурМинимальныйСрокГодностиВМесяцах Цикл
		
		Если СтруктураМинимальныйСрокГодностиВМесяцах.К1 = ВидНоменклатуры 
			И ТипЗнч(СтруктураМинимальныйСрокГодностиВМесяцах[Колонка]) = Тип("Число") Тогда
	
			МинимальныйСрокГодностиВМесяцах = СтруктураМинимальныйСрокГодностиВМесяцах[Колонка];
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МинимальныйСрокГодностиВМесяцах;
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПараметрыВыбораОбеспеченияЗаказНаПеремещение(Объект, Форма, ИдентификаторСтроки)
	
	ПутиКДанным = Новый Соответствие();
	ПутиКДанным.Вставить("ДатаОтгрузки", "НачалоОтгрузки");
	ПутиКДанным.Вставить("Склад", "СкладОтправитель");
	Если Объект.ОбосабливатьПоНазначениюЗаказа Тогда
		Справочники.Назначения.ЗаполнитьНазначениеОбеспечения(Объект.Товары, Объект.Назначение);
		ПутиКДанным.Вставить("Назначение", "НазначениеОбеспечения");
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура("МенеджерРегистра", РегистрыНакопления.ЗаказыНаПеремещение);
	
	Результат = ОбеспечениеСервер.ПараметрыВыбораОбеспечения(
		ИдентификаторСтроки,
		Объект,
		Объект.Товары,
		ПутиКДанным,
		ПараметрыЗаполнения);
	
	ОбеспечениеСервер.ДобавитьСвойствоАдресТаблицыПодобраноРанее(Результат, Форма.УникальныйИдентификатор);
	
	Возврат Результат;

КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПараметрыВыбораОбеспеченияЗаказКлиента(Объект, Форма, ИдентификаторСтроки)
	
	ПутиКДанным = Новый Соответствие();
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");

	ПараметрыЗаполнения = Новый Структура("СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра",
		Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован, Объект.Склад, РегистрыНакопления.ЗаказыКлиентов);

	ПараметрыФормы = ОбеспечениеСервер.ПараметрыВыбораОбеспечения(
		ИдентификаторСтроки,
		Объект,
		Объект.Товары,
		ПутиКДанным,
		ПараметрыЗаполнения);

	// В строках ТЧ нет поля Назначения, поэтому оно копируется из шапки документа.
	// Необходимо очистить поле Назначение для тех строк, где выбран не обособленный вариант обеспечения.
	Для Каждого Строка Из ПараметрыФормы.ТаблицаНевыделенныеСтроки Цикл
		Если Не (Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно
			Или Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно) Тогда
			Строка.Назначение = Справочники.Назначения.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	ОбеспечениеСервер.ДобавитьСвойствоАдресТаблицыПодобраноРанее(ПараметрыФормы, Форма.УникальныйИдентификатор);
	
	Возврат ПараметрыФормы;
		
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПараметрыВыбораОбеспеченияЗаказНаСборку(Объект, Форма, ИдентификаторСтроки)
	
	ПутиКДанным = Новый Соответствие();
	ПутиКДанным.Вставить("ДатаОтгрузки", "НачалоСборкиРазборки");
	ПутиКДанным.Вставить("Назначение", "НазначениеШапки");
	Если Объект.ОбосабливатьПоНазначениюЗаказа Или Не Объект.ОбосабливатьПоНазначениюЗаказа И Не ЗначениеЗаполнено(Объект.Назначение) Тогда
		ПутиКДанным.Вставить("Назначение", "НазначениеТовары");
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыНаСборку);
	ПараметрыЗаполнения.Вставить("ОтборПоИзмерениям", Новый Структура("ТипСборки", Перечисления.ТипыДвиженияЗапасов.Отгрузка));
	
	Результат = ОбеспечениеСервер.ПараметрыВыбораОбеспечения(
		ИдентификаторСтроки,
		Объект,
		Объект.Товары,
		ПутиКДанным,
		ПараметрыЗаполнения);
	
	ОбеспечениеСервер.ДобавитьСвойствоАдресТаблицыПодобраноРанее(Результат, Форма.УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
Функция смартПараметрыВыбораОбеспеченияЗаказНаВнутреннееПотребление(Объект, Форма, ИдентификаторСтроки)

	ПутиКДанным = Новый Соответствие();
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");

	ПараметрыЗаполнения = Новый Структура("МенеджерРегистра", РегистрыНакопления.ЗаказыНаВнутреннееПотребление);

	Результат = ОбеспечениеСервер.ПараметрыВыбораОбеспечения(
		ИдентификаторСтроки,
		Объект,
		Объект.Товары,
		ПутиКДанным,
		ПараметрыЗаполнения);

	ОбеспечениеСервер.ДобавитьСвойствоАдресТаблицыПодобраноРанее(Результат, Форма.УникальныйИдентификатор);
	Возврат Результат;

КонецФункции //--#1547 смарт: Лопато 22.03.2024

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьПредопределенноеЗначениеТЧСписокЗначений(СсылкаНаПредопределенноеЗначение) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	смартПредопределенныеЗначенияТЧСписокЗначений.к1 КАК К1,
        |	смартПредопределенныеЗначенияТЧСписокЗначений.к2 КАК К2,
        |	смартПредопределенныеЗначенияТЧСписокЗначений.к3 КАК К3,
        |	смартПредопределенныеЗначенияТЧСписокЗначений.к4 КАК К4
        |ИЗ
        |	Справочник.смартПредопределенныеЗначения.ТЧСписокЗначений КАК смартПредопределенныеЗначенияТЧСписокЗначений
        |ГДЕ
        |	смартПредопределенныеЗначенияТЧСписокЗначений.Ссылка = &Ссылка
        |	И смартПредопределенныеЗначенияТЧСписокЗначений.Ссылка.ИспользоватьТЧСписокЗначений";
	
	Если ТипЗнч(СсылкаНаПредопределенноеЗначение) = Тип("СправочникСсылка.смартПредопределенныеЗначения") Тогда
		Настройка = СсылкаНаПредопределенноеЗначение;
	ИначеЕсли ТипЗнч(СсылкаНаПредопределенноеЗначение) = Тип("Строка") Тогда
		Попытка
			Настройка = Справочники.смартПредопределенныеЗначения[СсылкаНаПредопределенноеЗначение];
		Исключение
			Настройка = Справочники.смартПредопределенныеЗначения.ПустаяСсылка();
		КонецПопытки;	
	Иначе
		Настройка = Справочники.смартПредопределенныеЗначения.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Настройка);

    МассивРезультат = Новый Массив;
	
    ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
    
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Структура = Новый Структура("К1, К2, К3, К4"); 
		
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
		
		МассивРезультат.Добавить(Структура);
		
	КонецЦикла;
    
    Возврат МассивРезультат;
    
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 20.11.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартДействуетОсобыйУчетСерий(ОбъектПроверкиСсылка) Экспорт

	ОсобыйУчетСерий = Ложь;
	ВидНоменклатуры = Неопределено;
	
	Если ЗначениеЗаполнено(ОбъектПроверкиСсылка) Тогда
		
		Если ТипЗнч(ОбъектПроверкиСсылка) = Тип("СправочникСсылка.Номенклатура") Тогда                                   
		    ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектПроверкиСсылка, "ВидНоменклатуры", Истина);
		ИначеЕсли ТипЗнч(ОбъектПроверкиСсылка) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
	        ВидНоменклатуры = ОбъектПроверкиСсылка;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		
			МассивСтруктурОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры = смартПолучитьПредопределенноеЗначениеТЧСписокЗначений("ОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры");
			
			Для Каждого СтруктураОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры Из МассивСтруктурОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры Цикл

				Если СтруктураОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры.К1 = ВидНоменклатуры Тогда

					ОсобыйУчетСерий = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;	

		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ОсобыйУчетСерий;
	
КонецФункции //--#1547 смарт: Лопато 20.11.2023

//++#1547 смарт: Лопато 12.12.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПроверкаЗаказДоДатыНачалаСерийногоУчета(ВыбранноеЗначение, Знач Объект, ИмяФормы, Знач ВыделенныеСтроки) Экспорт

	СтрокаПредупреждение = "";
	
	Если ИмяФормы = "Перечисление.ВариантыОбеспечения.Форма.ВыборВариантаОбеспечения" Тогда
		
		ДанныеОбеспечения = ВыбранноеЗначение;
		
	ИначеЕсли ИмяФормы = "Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа" Тогда
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ДанныеОбеспечения = смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказКлиента(ВыбранноеЗначение, Объект, ВыделенныеСтроки);
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			ДанныеОбеспечения = смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказНаПеремещение(ВыбранноеЗначение, Объект, ВыделенныеСтроки);
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
			ДанныеОбеспечения = смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказНаСборку(ВыбранноеЗначение, Объект, ВыделенныеСтроки);
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			ДанныеОбеспечения = смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказНаВнутреннееПотребление(ВыбранноеЗначение, Объект, ВыделенныеСтроки);
		Иначе
			Возврат СтрокаПредупреждение;
		КонецЕсли;		
		
	КонецЕсли; 
	
	МассивНоменклатурыДляПроверки = Новый Массив;
	
	Для Каждого СтрокаОбеспечения Из ДанныеОбеспечения Цикл

		Если СтрокаОбеспечения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить И СтрокаОбеспечения.Количество > 0 Тогда
		
			СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(СтрокаОбеспечения.Идентификатор);

			Если СтрокаТовары <> Неопределено 
				И смартДействуетОсобыйУчетСерий(СтрокаТовары.Номенклатура) Тогда
		
				смартДатаНачалаСерийногоУчетаВременная = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "смартДатаНачалаСерийногоУчетаВременная");

				Если ЗначениеЗаполнено(смартДатаНачалаСерийногоУчетаВременная) Тогда
					
					ДатаОбъекта = смартПолучитьДатуОбъектаДляРасчетаСтатусовСерий(СтрокаТовары, , Объект);

					//++#1517 смарт: Лопато 02.04.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
					Если ЗначениеЗаполнено(ДатаОбъекта) 
						И НачалоДня(ДатаОбъекта) < НачалоДня(смартДатаНачалаСерийногоУчетаВременная)
						И НачалоДня(ТекущаяДатаСеанса()) > НачалоДня(смартДатаНачалаСерийногоУчетаВременная)
						Тогда
						
						МассивНоменклатурыДляПроверки.Добавить(СтрокаТовары.Номенклатура);
						
					КонецЕсли;
					//--#1517 смарт: Лопато 02.04.2024
					
				КонецЕсли;
				
			КонецЕсли;	
					
		КонецЕсли;	
		
	КонецЦикла;	
	
	МассивНоменклатурыПредупреждение = смартПолучитьНоменклатуруЗаказаБезДокументов(Объект.Ссылка, МассивНоменклатурыДляПроверки);
	
	СтрокаПредупреждениеТовары = "";
	
	Если МассивНоменклатурыПредупреждение.Количество() > 0 Тогда
	
		Для Каждого ЭлементНоменклатура ИЗ МассивНоменклатурыПредупреждение Цикл
			СтрокаПредупреждениеТовары = СтрокаПредупреждениеТовары + СокрЛП(ЭлементНоменклатура) + ", ";
		КонецЦикла;	
		
		Если Прав(СтрокаПредупреждениеТовары, 2) = ", " Тогда
			СтрокаПредупреждениеТовары = Лев(СтрокаПредупреждениеТовары, СтрДлина(СтрокаПредупреждениеТовары) - 2);
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтрокаПредупреждениеТовары) Тогда
		
		СтрокаПредупрежденияЗаказДоДатыНачалаСерийногоУчета = "
			|ВНИМАНИЕ! 
			|
			|Товар """ + СтрокаПредупреждениеТовары + """ 
			|теперь учитывается по партиям (срокам годности). 
			|
			|Для дальнейшей отгрузки товара
			|ОБЯЗАТЕЛЬНО обратитесь в ИТ отдел.
			|
			|Обратиться в поддержку можно любым удобным способом:
			|help1c@smart-t.ru
			|+7(495)993-91-11 (доб. 222)";

		СтрокаПредупреждение = СтрокаПредупреждение + СтрокаПредупрежденияЗаказДоДатыНачалаСерийногоУчета;
			
	КонецЕсли;	
	
	Возврат СтрокаПредупреждение;
	
КонецФункции //--#1547 смарт: Лопато 12.12.2023

//++#1547 смарт: Лопато 12.12.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьНоменклатуруЗаказаБезДокументов(ЗаказСсылка, МассивНоменклатурыДляПроверки)
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатурыДляПроверки);
	Запрос.УстановитьПараметр("ДокументЗаказ", ЗаказСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) КАК КОтгрузкеОстаток,
	|	СУММА(ТоварыКОтгрузкеОстатки.КОформлениюОстаток) КАК КОформлениюОстаток,
	|	СУММА(ТоварыКОтгрузкеОстатки.КСборкеОстаток) КАК КСборкеОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			Номенклатура В (&Номенклатура)
	|				И ДокументОтгрузки = &ДокументЗаказ) КАК ТоварыКОтгрузкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузкеОстатки.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) > 0
	|		ИЛИ СУММА(ТоварыКОтгрузкеОстатки.КОформлениюОстаток) > 0
	|		ИЛИ СУММА(ТоварыКОтгрузкеОстатки.КСборкеОстаток) > 0)";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");

	Возврат Результат;	

КонецФункции //--#1547 смарт: Лопато 12.12.2023

//++#1517 смарт: Лопато 02.04.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
Функция смартПолучитьНоменклатуруЗаказаОтгруженнуюИлиОформленную(ЗаказСсылка, МассивНоменклатурыДляПроверки) Экспорт
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатурыДляПроверки);
	Запрос.УстановитьПараметр("ДокументЗаказ", ЗаказСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеОбороты.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	|			,
	|			,
	|			,
	|			Номенклатура В (&Номенклатура)
	|				И ДокументОтгрузки = &ДокументЗаказ) КАК ТоварыКОтгрузкеОбороты
	|ГДЕ
	|	(ТоварыКОтгрузкеОбороты.КОтгрузкеРасход > 0
	|			ИЛИ ТоварыКОтгрузкеОбороты.КОформлениюРасход > 0)";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");

	Возврат Результат;	

КонецФункции //--#1517 смарт: Лопато 02.04.2024

//++#1547 смарт: Лопато 14.12.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказКлиента(ВыбранноеЗначение, Объект, ВыделенныеСтроки) Экспорт

	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	
	ПутиКДанным = Новый Соответствие; //Описание особенностей формы
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки"); // дату отгрузки работ необходимо брать из поля "Дата отгрузки".
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("СтатусКВыполнению", Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	ПараметрыДокумента.Вставить("ГруппаСкладов", Объект.Склад);
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыКлиентов);
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
	
	ТаблицаЗаполнениеОбеспечения = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(ВыделенныеСтроки,
																		Объект,
																		Объект.Товары,
																		ПараметрыЗаполнения,
																		ПараметрыДокумента);
	Возврат ТаблицаЗаполнениеОбеспечения;
	
КонецФункции //--#1547 смарт: Лопато 14.12.2023

//++#1547 смарт: Лопато 14.12.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказНаПеремещение(ВыбранноеЗначение, Объект, ВыделенныеСтроки) Экспорт

	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	
	ПутиКДанным = Новый Соответствие;
	ПутиКДанным.Вставить("ДатаОтгрузки", "НачалоОтгрузки");
	ПутиКДанным.Вставить("Склад", "СкладОтправитель");
	Если Объект.ОбосабливатьПоНазначениюЗаказа Тогда
		Справочники.Назначения.ЗаполнитьНазначениеОбеспечения(Объект.Товары, Объект.Назначение);
		ПутиКДанным.Вставить("Назначение", "НазначениеОбеспечения");
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыНаПеремещение);
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
	
	ТаблицаЗаполнениеОбеспечения = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(ВыделенныеСтроки,
																		Объект,
																		Объект.Товары,
																		ПараметрыЗаполнения,
																		ПараметрыДокумента);
																		
	Возврат ТаблицаЗаполнениеОбеспечения;
	
КонецФункции //--#1547 смарт: Лопато 14.12.2023

//++#1547 смарт: Лопато 14.12.2023 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказНаСборку(ВыбранноеЗначение, Объект, ВыделенныеСтроки) Экспорт

	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	
	ПутиКДанным = Новый Соответствие;
	ПутиКДанным.Вставить("ДатаОтгрузки", "НачалоСборкиРазборки");
	ПутиКДанным.Вставить("Назначение", "НазначениеШапки");
	Если Объект.ОбосабливатьПоНазначениюЗаказа Или Не Объект.ОбосабливатьПоНазначениюЗаказа И Не ЗначениеЗаполнено(Объект.Назначение) Тогда
		ПутиКДанным.Вставить("Назначение", "НазначениеТовары");
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыНаСборку);
	ПараметрыДокумента.Вставить("ОтборПоИзмерениям", Новый Структура("ТипСборки", Перечисления.ТипыДвиженияЗапасов.Отгрузка));
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
	
	ТаблицаЗаполнениеОбеспечения = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(ВыделенныеСтроки,
																		Объект,
																		Объект.Товары,
																		ПараметрыЗаполнения,
																		ПараметрыДокумента);
																		
	Возврат ТаблицаЗаполнениеОбеспечения;
	
КонецФункции //--#1547 смарт: Лопато 14.12.2023

//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
Функция смартПолучитьТаблицуЗаполнениеОбеспеченияЗаказНаВнутреннееПотребление(ВыбранноеЗначение, Объект, ВыделенныеСтроки) Экспорт

	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	
	ПутиКДанным = Новый Соответствие; //Описание особенностей формы
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки"); // дату отгрузки работ необходимо брать из поля "Дата отгрузки".
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыНаВнутреннееПотребление);
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
	
	ТаблицаЗаполнениеОбеспечения = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(ВыделенныеСтроки,
																		Объект,
																		Объект.Товары,
																		ПараметрыЗаполнения,
																		ПараметрыДокумента);
																		
	Возврат ТаблицаЗаполнениеОбеспечения;
	
КонецФункции //--#1547 смарт: Лопато 22.03.2024

//++#1517 смарт: Лопато 25.01.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
Функция смартПолучитьДатуОбъектаДляРасчетаСтатусовСерий(СтрокаТЧ, ПараметрыУказанияСерий = Неопределено, Объект = Неопределено) Экспорт
	
	ДатаОбъекта = Неопределено;
	
	//Расчет статуса указаний серий по всей ТЧ объекта
	Если Объект <> Неопределено Тогда
		
		Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") 
			ИЛИ ТипЗнч(Объект) = Тип("Структура") 
			ИЛИ ТипЗнч(Объект) = Тип("ФиксированнаяСтруктура") 
			ИЛИ Метаданные.Документы.Содержит(Метаданные.НайтиПоТипу(ТипЗнч(Объект))) Тогда
			
			Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
				ДокументОбъект = Объект;
			Иначе
				ДокументОбъект = Объект.Ссылка;
			КонецЕсли;
			
			Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

				Если ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) И НЕ ДокументОбъект.НеОтгружатьЧастями Тогда
					ДатаОбъекта = СтрокаТЧ.ДатаОтгрузки;
				ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.ДатаОтгрузки) И ДокументОбъект.НеОтгружатьЧастями Тогда
					ДатаОбъекта = ДокументОбъект.ДатаОтгрузки;
				КонецЕсли;

			ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда

				Если ЗначениеЗаполнено(СтрокаТЧ.НачалоОтгрузки) Тогда
					ДатаОбъекта = СтрокаТЧ.НачалоОтгрузки;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда

				Если ЗначениеЗаполнено(ДокументОбъект.НачалоСборкиРазборки) Тогда
					ДатаОбъекта = ДокументОбъект.НачалоСборкиРазборки;
				КонецЕсли;

			ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда

				Если ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) И НЕ ДокументОбъект.НеОтгружатьЧастями Тогда
					ДатаОбъекта = СтрокаТЧ.ДатаОтгрузки;
				ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.ДатаОтгрузки) И ДокументОбъект.НеОтгружатьЧастями Тогда
					ДатаОбъекта = ДокументОбъект.ДатаОтгрузки;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
				
				Если ЗначениеЗаполнено(ДокументОбъект.ДатаОтгрузки) Тогда
					ДатаОбъекта = ДокументОбъект.ДатаОтгрузки;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДатаОбъекта) И ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
				ДатаОбъекта = ДокументОбъект.Дата;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
		
	//Расчет статуса указаний серий по одной строке
	Если НЕ ЗначениеЗаполнено(ДатаОбъекта)
		И (Объект = Неопределено ИЛИ (ТипЗнч(Объект) = Тип("Структура") ИЛИ ТипЗнч(Объект) = Тип("ФиксированнаяСтруктура"))) Тогда
			
		Если (ТипЗнч(ПараметрыУказанияСерий) = Тип("Структура") ИЛИ ТипЗнч(ПараметрыУказанияСерий) = Тип("ФиксированнаяСтруктура")) Тогда
				
			Если ПараметрыУказанияСерий.Свойство("ПолноеИмяОбъекта") Тогда
				
				Если (ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказКлиента" ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаВнутреннееПотребление")
					И ((ТипЗнч(СтрокаТЧ) = Тип("СтрокаТаблицыЗначений") И СтрокаТЧ.Владелец().Колонки.Найти("ДатаОтгрузки") <> Неопределено)
					   ИЛИ ((ТипЗнч(СтрокаТЧ) = Тип("Структура") ИЛИ ТипЗнч(СтрокаТЧ) = Тип("ФиксированнаяСтруктура")) И СтрокаТЧ.Свойство("ДатаОтгрузки"))) Тогда
				
					Если ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) Тогда
			    		ДатаОбъекта = СтрокаТЧ.ДатаОтгрузки;
					КонецЕсли;

				КонецЕсли;	

				Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаПеремещение"
					И ((ТипЗнч(СтрокаТЧ) = Тип("СтрокаТаблицыЗначений") И СтрокаТЧ.Владелец().Колонки.Найти("НачалоОтгрузки") <> Неопределено)
					   ИЛИ ((ТипЗнч(СтрокаТЧ) = Тип("Структура") ИЛИ ТипЗнч(СтрокаТЧ) = Тип("ФиксированнаяСтруктура")) И СтрокаТЧ.Свойство("НачалоОтгрузки"))) Тогда
				
					Если ЗначениеЗаполнено(СтрокаТЧ.НачалоОтгрузки) Тогда
			    		ДатаОбъекта = СтрокаТЧ.НачалоОтгрузки;
					КонецЕсли;

				КонецЕсли;	
				
			КонецЕсли;	

		КонецЕсли;	

	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ДатаОбъекта) 
		И (ТипЗнч(ПараметрыУказанияСерий) = Тип("Структура") ИЛИ ТипЗнч(ПараметрыУказанияСерий) = Тип("ФиксированнаяСтруктура")) 
		И ПараметрыУказанияСерий.Свойство("Дата") 
		И ЗначениеЗаполнено(ПараметрыУказанияСерий.Дата) Тогда
		
		ДатаОбъекта = ПараметрыУказанияСерий.Дата;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДатаОбъекта) 
		И (ТипЗнч(Объект) = Тип("Структура") ИЛИ ТипЗнч(Объект) = Тип("ФиксированнаяСтруктура")) Тогда
		
		Если Объект.Свойство("Дата") И ЗначениеЗаполнено(Объект.Дата) Тогда
			ДатаОбъекта = Объект.Дата;
		ИначеЕсли Объект.Свойство("Ссылка") И ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ДатаОбъекта = Объект.Ссылка.Дата;
		КонецЕсли;
		
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(ДатаОбъекта) Тогда
		ДатаОбъекта = ТекущаяДатаСеанса();
	КонецЕсли;	
			
	Возврат ДатаОбъекта; 
			
КонецФункции //--#1517 смарт: Лопато 25.01.2024

#КонецОбласти  

#Область КонтактнаяИнформацияПользователей

//++ #Б-1088 смарт: Лопато 04.03.2025 //ИМ. Выгрузка КИ менеджеров в ИМ (ИТСМ 1763)
Функция ПолучитьEmailПользователя(ПользовательСсылка) Экспорт

	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Пользователь,
	|	Представление КАК Представление
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация
	|ГДЕ
	|	Ссылка = &ПользовательСсылка
	|	И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)";

	Запрос.УстановитьПараметр("ПользовательСсылка", ПользовательСсылка);
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда
		Результат = ВыборкаРезультата.Представление;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //-- #Б-1088 смарт: Лопато 04.03.2025

//++ #Б-1088 смарт: Лопато 04.03.2025 //ИМ. Выгрузка КИ менеджеров в ИМ (ИТСМ 1763)
Функция ПолучитьДействующийМобильныйПользователя(ПользовательСсылка) Экспорт

	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Пользователь,
	|	Представление КАК НомерТелефона
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация
	|ГДЕ
	|	Ссылка = &ПользовательСсылка
	|	И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя)";

	Запрос.УстановитьПараметр("ПользовательСсылка", ПользовательСсылка);
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда
		Результат = ВыборкаРезультата.НомерТелефона;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //-- #Б-1088 смарт: Лопато 04.03.2025

//++ #Б-1088 смарт: Лопато 04.03.2025 //ИМ. Выгрузка КИ менеджеров в ИМ (ИТСМ 1763)
Функция ПолучитьПредставлениеВнутреннегоНомераПользователя(ПользовательСсылка) Экспорт

	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Пользователь,
	|	ВЫБОР
	|		КОГДА Представление <> """"
	|			ТОГДА ВЫБОР
	|					КОГДА ДЛИНАСТРОКИ(Представление) > 3
	|						ТОГДА Представление
	|					ИНАЧЕ ""+7 (495) 663-91-11 (доб. "" + Представление + "")""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерТелефона
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация
	|ГДЕ
	|	Ссылка = &ПользовательСсылка
	|	И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.смартРабочийТелефон)";

	Запрос.УстановитьПараметр("ПользовательСсылка", ПользовательСсылка);
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();

	Если ВыборкаРезультата.Следующий() Тогда
		Результат = ВыборкаРезультата.НомерТелефона;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //-- #Б-1088 смарт: Лопато 04.03.2025

#КонецОбласти  

#Область РаботаСоЗначениями

//++ #Б2722 смарт: Шляпников 20.03.2025 / Заявка на разборку оборудования. Уведомления.
Функция СоздатьСтруктуруПоРегиструСведений(ИмяРегистраСведений) Экспорт
	
    // Получаем описание регистра сведений из метаданных
    РегистрСведений = Метаданные.РегистрыСведений[ИмяРегистраСведений];
    
    // Проверяем, существует ли указанный регистр сведений
    Если РегистрСведений = Неопределено Тогда
        ВызватьИсключение "Регистр сведений '" + ИмяРегистраСведений + "' не найден!";
    КонецЕсли;
    
    // Создаем новую структуру
    НоваяСтруктура = Новый Структура;
    
    // Добавляем измерения
    Для Каждого Измерение Из РегистрСведений.Измерения Цикл
        НоваяСтруктура.Вставить(Измерение.Имя, Неопределено);
    КонецЦикла;
    
    // Добавляем ресурсы
    Для Каждого Ресурс Из РегистрСведений.Ресурсы Цикл
        НоваяСтруктура.Вставить(Ресурс.Имя, Неопределено);
    КонецЦикла;
    
    // Возвращаем созданную структуру
    Возврат НоваяСтруктура;
	
КонецФункции

//++ #Б3636 смарт: Шляпников 01.07.2025 / Передача из ЗУП в УТ данных об отпусках сотрудников. 
Функция СжатьСтроку(СтрокаJSON) Экспорт

   СжатиеДанных = Новый СжатиеДанных(9);
   Значение = Новый ХранилищеЗначения(СтрокаJSON, СжатиеДанных);
   СтрокаBase64 = XMLСтрока(Значение);

   Возврат СтрокаBase64;

КонецФункции

//++ #Б3636 смарт: Шляпников 01.07.2025 / Передача из ЗУП в УТ данных об отпусках сотрудников. 
Функция ВосстановитьСтрокуИзСжатой(Стр) Экспорт

   Результат = Стр;

   Хранилище = XMLЗначение(Тип("ХранилищеЗначения"), Стр);
   СтрокаJSONизХранилища = Хранилище.Получить();
   Если НЕ СтрокаJSONизХранилища = Неопределено Тогда
       Результат = СтрокаJSONизХранилища;
   КонецЕсли;

   Возврат Результат;

КонецФункции 

#КонецОбласти

#Область ЗаказыКлиентов

//++ #1984 смарт: Фролов 13.08.2024 //Запрет на привязку более одного заказа клиента к Интересу.
Функция ПроверитьНаличиеЗаказаПоИнтересу(ВыбранныйИнтерес) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_ЖурналДокументов.Объект КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|ГДЕ
	|	CRM_ЖурналДокументов.ГлавнаяЗапись
	|	И НЕ CRM_ЖурналДокументов.Объект.ПометкаУдаления
	|	И CRM_ЖурналДокументов.Объект ССЫЛКА Документ.ЗаказКлиента
	|	И CRM_ЖурналДокументов.CRM_Интерес = &Интерес");
	
	Запрос.УстановитьПараметр("Интерес", ВыбранныйИнтерес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //-- #1984 смарт: Фролов 13.08.2024	

//++ #Б674 смарт: Шляпников 25.03.2025 / Отчет по кол-ву платных доставок, ИТСМ 1959
Функция ПолучитьВесЗаказа(ЗаказКлиента) Экспорт
	
	Результат = Новый Структура("ВесНетто,ВесБрутто", 0, 0);
	
	Запрос = Новый Запрос;
	МассивТекстов = Новый Массив;
	
	Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
		|	И НЕ ЗаказКлиентаТовары.Отменено";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Упаковка КАК Упаковка,
		|	Т.Количество КАК Количество,
		|	Т.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Т.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&ТЗ КАК Т
		|ГДЕ
		|	НЕ Т.Отменено";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ТЗ", ЗаказКлиента.Товары.Выгрузить());
		
	КонецЕсли;
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(Данные.ВесНетто) КАК ВесНетто,
	|	СУММА(Данные.ВесБрутто) КАК ВесБрутто
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ВТТовары.Номенклатура.ВесЗнаменатель = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВТТовары.Номенклатура.ВесЧислитель / ВТТовары.Номенклатура.ВесЗнаменатель
	|			КОНЕЦ * ВТТовары.Количество) КАК ВесНетто,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ВТТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) * ВТТовары.КоличествоУпаковок
	|				ИНАЧЕ ВТТовары.Упаковка.Вес * ВТТовары.КоличествоУпаковок
	|			КОНЕЦ) КАК ВесБрутто,
	|		ВТТовары.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		ВТТовары КАК ВТТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО ВТТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец
	|				И ВТТовары.Номенклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТТовары.НомерСтроки) КАК Данные";
	
	МассивТекстов.Добавить(ТекстЗапроса);
	
	Запрос.Текст = СтрСоединить(МассивТекстов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Если Результат.ВесНетто = NULL Тогда
		Результат.ВесНетто = 0;
	КонецЕсли;
	
	Если Результат.ВесБрутто = NULL Тогда
		Результат.ВесБрутто = 0;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

//++#1605 смарт: Лопато 29.01.2024 //Доработки по интернет-магазину
Процедура смартЗаполнитьФИОКонтактногоЛицаПартнера(КонтактноеЛицоОбъект, Перезаполнять = Ложь) Экспорт

	КонтактноеЛицоНаименование = СокрЛП(КонтактноеЛицоОбъект.Наименование);
	
	Если ЗначениеЗаполнено(КонтактноеЛицоНаименование) Тогда
		
		Если Перезаполнять
			ИЛИ (НЕ ЗначениеЗаполнено(КонтактноеЛицоОбъект.CRM_Имя)
				 И НЕ ЗначениеЗаполнено(КонтактноеЛицоОбъект.CRM_Фамилия) 
				 И НЕ ЗначениеЗаполнено(КонтактноеЛицоОбъект.CRM_Отчество)) Тогда
			   
			//Определеление фамилии, имени, отчества
			СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");

			ЧастиИмени = СтрРазделить(КонтактноеЛицоНаименование, " ", Ложь);
			
			Если ЧастиИмени.Количество() = 1 Тогда

				СтруктураФИО.Имя = ЧастиИмени[0];

			Иначе

				Если ЧастиИмени.Количество() >= 2 Тогда
					
					СтруктураФИО.Фамилия = ЧастиИмени[0];
					СтруктураФИО.Имя = ЧастиИмени[1];
					
				КонецЕсли;
				
				Если ЧастиИмени.Количество() >= 3 Тогда
					
					СтруктураФИО.Отчество = ЧастиИмени[2];
					
				КонецЕсли;

				Если ЧастиИмени.Количество() > 3 Тогда
					
					ДополнительныеЧастиОтчества = Новый Массив;
					
					ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'оглы'"));
					ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'улы'"));
					ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'уулу'"));
					ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'кызы'"));
					ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'гызы'"));
					ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'угли'"));
					
					Если ДополнительныеЧастиОтчества.Найти(НРег(ЧастиИмени[3])) <> Неопределено Тогда
						
						СтруктураФИО.Отчество = СтруктураФИО.Отчество + " " + ЧастиИмени[3];
						
					КонецЕсли;
					
				КонецЕсли;

			КонецЕсли;
			
			КонтактноеЛицоОбъект.CRM_Фамилия  = СтруктураФИО.Фамилия;			
			КонтактноеЛицоОбъект.CRM_Имя 	  = СтруктураФИО.Имя;
			КонтактноеЛицоОбъект.CRM_Отчество = СтруктураФИО.Отчество;
			
			//Определение пола по имени
			Если НЕ ЗначениеЗаполнено(КонтактноеЛицоОбъект.Пол) 
				И ЗначениеЗаполнено(КонтактноеЛицоОбъект.CRM_Имя) Тогда
				
				КонтактноеЛицоОбъект.Пол = CRM_КлиентыСервер.ОпределитьПол(КонтактноеЛицоОбъект.CRM_Имя);
				
			КонецЕсли;

		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры //--#1605 смарт: Лопато 29.01.2024

//++#1936 смарт: Лопато 29.07.2024 //Управление запретом изменять основного менеджера клиента  
// Определяет, был ли исходящий звонок от менеджера партнеру за определенный период в прошлое от указанной даты
//
// Параметры:
//  Ответственный - менеджер для которого выполняется поиск звонков.
//  Партнер 	  - Партнер для которого выполняется поиск звонков.
//  Дата 		  - Дата, до которой производится поиск звонков за период.
//  Период - количество секунд, за которое в прошлом идет поиск звонков.
//  Длительность - ограничение минимальной длительности звока в секундах.
//
// Возвращаемое значение:
//  Булево - Если Истина, то звонок от менеджера партнеру был.
//
Функция смартБылЗвонокОтветственногоПартнеру(Ответственный, Партнер, Дата, Период, Длительность) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("Партнер", 	   Партнер);
	Запрос.УстановитьПараметр("Дата", 		   Дата);
	Запрос.УстановитьПараметр("Период", 	   -Период);
	Запрос.УстановитьПараметр("Длительность",  Длительность);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка
	|ИЗ
	|	Документ.ТелефонныйЗвонок
	|ГДЕ
	|	НЕ ПометкаУдаления
	//|	И НЕ Входящий
	|	И Ответственный = &Ответственный
	|	И АбонентКонтакт = &Партнер 
	//|	И Дата >= ДОБАВИТЬКДАТЕ(&Дата, СЕКУНДА, &Период)
	|	И Дата >= &Дата
	|	И сфпДлительностьЗвонка >= &Длительность";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции //--#1936 смарт: Лопато 29.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
Функция ПолучитьСписокУсловийДопГарантииПоЗаказу(ТаблицаТоваров, ЗаказКлиента, Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Валюта", Валюта.Наименование);
	Запрос.УстановитьПараметр("ДатаАнализа", ТекущаяДата());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ЗаказКлиента КАК ЗаказКлиента,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТоварыЗаказа
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыЗаказа.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика
	|ПОМЕСТИТЬ ХарактеристикиГарантии
	|ИЗ
	|	ТоварыЗаказа КАК ТоварыЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыЗаказа.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК СуммаОплаты
	|ПОМЕСТИТЬ ТоварыЗаказаСОплатой
	|ИЗ
	|	ТоварыЗаказа КАК ТоварыЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ТоварыЗаказа.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК ОборудованиеКлиентов,
	|	ТоварыЗаказа.НомерСтроки КАК НомерСтроки,
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.СуммаСНДС КАК Сумма
	|ПОМЕСТИТЬ ОборудованиеНоменклатура
	|ИЗ
	|	ТоварыЗаказаСОплатой КАК ТоварыЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|		ПО ТоварыЗаказа.Номенклатура = смартОборудованиеЧернилаКлиентов.Номенклатура
	|ГДЕ
	|	ТоварыЗаказа.СуммаОплаты = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборудованиеНоменклатура.Сумма * УсловияДополнительнойГарантии.СтоимостьДопГарантииНаПервомЭтапе / 100 КАК Стоимость,
	|	ОборудованиеНоменклатура.НомерСтроки КАК НомерСтроки,
	|	ОборудованиеНоменклатура.Номенклатура КАК Номенклатура,
	|	УсловияДополнительнойГарантии.СрокГарантииНаГоловку КАК СрокГарантииНаГоловку,
	|	УсловияДополнительнойГарантии.СрокГарантииНаОборудование КАК СрокГарантииНаОборудование,
	|	ЕСТЬNULL(ХарактеристикиГарантии.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	&Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ХарактеристикиГарантии.Характеристика ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ГарантияДобавлена
	|ИЗ
	|	ОборудованиеНоменклатура КАК ОборудованиеНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартУсловияДополнительнойГарантии.СрезПоследних КАК УсловияДополнительнойГарантии
	|		ПО ОборудованиеНоменклатура.ОборудованиеКлиентов = УсловияДополнительнойГарантии.Оборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХарактеристикиГарантии КАК ХарактеристикиГарантии
	|		ПО ((ВЫРАЗИТЬ(ОборудованиеНоменклатура.Номенклатура.Наименование КАК СТРОКА(100))) = (ВЫРАЗИТЬ(ЛЕВ(ХарактеристикиГарантии.Характеристика.Наименование, ДЛИНАСТРОКИ(ОборудованиеНоменклатура.Номенклатура.Наименование)) КАК СТРОКА(100))))
	|ГДЕ
	|	УсловияДополнительнойГарантии.ДатаНачалаДействияУсловий <= &ДатаАнализа
	|	И УсловияДополнительнойГарантии.ДатаОкончанияДействияУсловий >= &ДатаАнализа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОборудованиеНоменклатура.НомерСтроки";
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции //-- #1944 смарт: Мосолов 26.07.2024 

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
Функция ПолучитьСписокУсловийДопГарантииПоИнтересу(ТаблицаТоваров, Интерес, Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Интерес", Интерес);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Валюта", Валюта.Наименование);
	Запрос.УстановитьПараметр("ДатаАнализа", ТекущаяДата()); 
	Запрос.УстановитьПараметр("ЭтоРТО", 
		ЗначениеЗаполнено(Интерес.ДокументОснование) И ТипЗнч(Интерес.ДокументОснование) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов"));
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_ЖурналДокументов.CRM_Интерес КАК Интерес,
	|	CRM_ЖурналДокументов.Объект КАК ЗаказКлиента
	|ПОМЕСТИТЬ ЗаказыИнтереса
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|ГДЕ
	|	CRM_ЖурналДокументов.ГлавнаяЗапись
	|	И CRM_ЖурналДокументов.CRM_Интерес = &Интерес
	|	И ТИПЗНАЧЕНИЯ(CRM_ЖурналДокументов.Объект) = ТИП(Документ.ЗаказКлиента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыИнтереса.Интерес КАК Интерес,
	|	СУММА(СостоянияЗаказовКлиентов.СуммаОплаты) КАК СуммаОплаты
	|ПОМЕСТИТЬ ОплатаПоЗаказамИнтереса
	|ИЗ
	|	ЗаказыИнтереса КАК ЗаказыИнтереса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказыИнтереса.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыИнтереса.Интерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Интерес КАК Интерес,
	|	ИнтересТовары.Номенклатура КАК Номенклатура,
	|	ИнтересТовары.Характеристика КАК Характеристика,
	|	ИнтересТовары.СуммаСНДС КАК СуммаСНДС,
	|	ИнтересТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТоварыИнтереса
	|ИЗ
	|	&ТаблицаТоваров КАК ИнтересТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыИнтереса.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика
	|ПОМЕСТИТЬ ХарактеристикиГарантии
	|ИЗ
	|	ТоварыИнтереса КАК ТоварыИнтереса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыИнтереса.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТоварыИнтереса.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыИнтереса.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ОплатаПоЗаказамИнтереса.СуммаОплаты, 0) КАК СуммаОплаты
	|ПОМЕСТИТЬ ТоварыИнтересаСОплатой
	|ИЗ
	|	ТоварыИнтереса КАК ТоварыИнтереса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатаПоЗаказамИнтереса КАК ОплатаПоЗаказамИнтереса
	|		ПО ТоварыИнтереса.Интерес = ОплатаПоЗаказамИнтереса.Интерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК ОборудованиеКлиентов,
	|	ТоварыИнтересаСОплатой.Номенклатура КАК Номенклатура,
	|	ТоварыИнтересаСОплатой.СуммаСНДС КАК Сумма,
	|	ТоварыИнтересаСОплатой.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ОборудованиеНоменклатура
	|ИЗ
	|	ТоварыИнтересаСОплатой КАК ТоварыИнтересаСОплатой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|		ПО ТоварыИнтересаСОплатой.Номенклатура = смартОборудованиеЧернилаКлиентов.Номенклатура
	|ГДЕ
	|	ТоварыИнтересаСОплатой.СуммаОплаты = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборудованиеНоменклатура.Сумма * ВЫБОР
	|		КОГДА &ЭтоРТО
	|			ТОГДА УсловияДополнительнойГарантии.СтоимостьДопГарантииНаВторомЭтапе / 100
	|		ИНАЧЕ УсловияДополнительнойГарантии.СтоимостьДопГарантииНаПервомЭтапе / 100
	|	КОНЕЦ КАК Стоимость,
	|	ОборудованиеНоменклатура.Номенклатура КАК Номенклатура,
	|	ОборудованиеНоменклатура.НомерСтроки КАК НомерСтроки,
	|	УсловияДополнительнойГарантии.СрокГарантииНаГоловку КАК СрокГарантииНаГоловку,
	|	УсловияДополнительнойГарантии.СрокГарантииНаОборудование КАК СрокГарантииНаОборудование,
	|	ЕСТЬNULL(ХарактеристикиГарантии.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	&Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ХарактеристикиГарантии.Характеристика ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ГарантияДобавлена
	|ИЗ
	|	ОборудованиеНоменклатура КАК ОборудованиеНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартУсловияДополнительнойГарантии.СрезПоследних КАК УсловияДополнительнойГарантии
	|		ПО ОборудованиеНоменклатура.ОборудованиеКлиентов = УсловияДополнительнойГарантии.Оборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХарактеристикиГарантии КАК ХарактеристикиГарантии
	|		ПО ((ВЫРАЗИТЬ(ОборудованиеНоменклатура.Номенклатура.Наименование КАК СТРОКА(100))) = (ВЫРАЗИТЬ(ЛЕВ(ХарактеристикиГарантии.Характеристика.Наименование, ДЛИНАСТРОКИ(ОборудованиеНоменклатура.Номенклатура.Наименование)) КАК СТРОКА(100))))
	|ГДЕ
	|	УсловияДополнительнойГарантии.ДатаНачалаДействияУсловий <= &ДатаАнализа
	|	И УсловияДополнительнойГарантии.ДатаОкончанияДействияУсловий >= &ДатаАнализа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОборудованиеНоменклатура.НомерСтроки";
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции //-- #1944 смарт: Мосолов 26.07.2024 

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
Процедура ИзменитьВидимостьЗаголовокДополнительнойГарантии(Форма, ТаблицаТоваров, СсылкаНаДокумент, Валюта) Экспорт 
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ТаблицаУсловийДопГарантии = ПолучитьСписокУсловийДопГарантииПоЗаказу(ТаблицаТоваров, СсылкаНаДокумент, Валюта); 
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		ТаблицаУсловийДопГарантии = ПолучитьСписокУсловийДопГарантииПоИнтересу(ТаблицаТоваров, СсылкаНаДокумент, Валюта); 
		
	Иначе
		
		Возврат;

	КонецЕсли;  
	
	Если ТаблицаУсловийДопГарантии.Количество() Тогда 
		
		Форма.Элементы.смартГруппаУсловияДопГарантии.Видимость = Истина; 
		
		//++ #Б-1160 смарт: Мосолов 18.10.2024 // Изменить Интерес РТО    
		Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.CRM_Интерес") 
			И СсылкаНаДокумент.ТипУслуги = ПредопределенноеЗначение("Справочник.CRM_ТипУслуги.ПоставкаРегламентноеОбслуживаниеКлиентов") Тогда
			
		Форма.Элементы.смартТекстДопУсловий.Заголовок = СформироватьЗаголовокДополнительнойГарантииРТО(ТаблицаУсловийДопГарантии); 
		
		Иначе
		//-- #Б-1160 смарт: Мосолов 18.10.2024 
		
		Форма.Элементы.смартТекстДопУсловий.Заголовок = СформироватьЗаголовокДополнительнойГарантии(ТаблицаУсловийДопГарантии);
		
		//++ #Б-1160 смарт: Мосолов 18.10.2024 // Изменить Интерес РТО    
		КонецЕсли;
		//-- #Б-1160 смарт: Мосолов 18.10.2024 
		
	Иначе
		
		Форма.Элементы.смартГруппаУсловияДопГарантии.Видимость = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
Функция СформироватьЗаголовокДополнительнойГарантии(ТаблицаУсловийДопГарантии)
	
	МассивСтрок = Новый Массив;  
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Предложите клиенту дополнительную гарантию!", 
			Новый Шрифт("Arial", 9, Истина), 
			Новый Цвет(0, 150, 70))); 
			
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Символы.ПС);

	Для Каждого СтрокаТаблицы Из ТаблицаУсловийДопГарантии Цикл
		
		УжеЕсть = СтрокаТаблицы.ГарантияДобавлена;
		ЦветТекста = ?(УжеЕсть, Новый Цвет(0, 150, 70), Новый Цвет(0, 0 , 0));
		
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("► ", Новый Шрифт("Arial", 8), Новый Цвет(0, 150, 70)));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаТаблицы.Номенклатура.Наименование, 
				Новый Шрифт("Arial", 8, Истина, , Истина), ЦветТекста));  
				
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" доп. гарантия на " 
			+ ?(СтрокаТаблицы.СрокГарантииНаГоловку = 0, "на оборудование на ", "на оборудование и головку на ")
			+ Строка(СтрокаТаблицы.СрокГарантииНаОборудование) 
			+ ?(УжеЕсть, " мес. добавлена в документ!"," мес. составит: "), 
				Новый Шрифт("Arial", 8), ЦветТекста));
				
		Если НЕ УжеЕсть Тогда
					
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(СтрокаТаблицы.Стоимость, "ЧДЦ=2"), 
					, 
					ЦветаСтиля.ЦветГиперссылки, 
					, 
					Строка(СтрокаТаблицы.НомерСтроки) 
						+ ";" 
						+ Строка(СтрокаТаблицы.СрокГарантииНаОборудование) 
						+ ";"
						+ Формат(СтрокаТаблицы.Стоимость, "ЧДЦ=2")));  
					
			//++ #2059 смарт: Мосолов 19.09.2024 // Подсказка для документов Интерес и Заказ клиента при первоначальной продажи Доп. гарантии 
			//МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" " + СтрокаТаблицы.Валюта + Символы.ПС, Новый Шрифт("Arial", 8))); 
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" " + СтрокаТаблицы.Валюта, Новый Шрифт("Arial", 8))); 
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" ?", , ЦветаСтиля.ЦветГиперссылки, , " ?"));  
			МассивСтрок.Добавить(Символы.ПС);  
			//-- #2059 смарт: Мосолов 19.09.2024  
			
		Иначе
			
			МассивСтрок.Добавить(Символы.ПС);  
		
		КонецЕсли;
		
		МассивСтрок.Добавить(Символы.ПС);  
		
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок); 

КонецФункции //-- #1944 смарт: Мосолов 26.07.2024

//++ #Б-1160 смарт: Мосолов 18.10.2024 // Изменить Интерес РТО    
Функция СформироватьЗаголовокДополнительнойГарантииРТО(ТаблицаУсловийДопГарантии)
	
	ТаблицаУсловийДопГарантии.Свернуть("СрокГарантииНаОборудование, Валюта", "Стоимость");
	СуммаГарантии = ТаблицаУсловийДопГарантии.Итог("Стоимость"); 
	
	МассивСтрок = Новый Массив;  
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Предложите клиенту дополнительную гарантию", 
		Новый Шрифт("Arial", 9, Истина), 
		Новый Цвет(0, 150, 70))); 
			
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("На данное оборудование распространяется услуга Дополнительная гарантия", 
			Новый Шрифт("Arial", 9, Ложь))); 
			
	Для Каждого СтрокаТаблицы Из ТаблицаУсловийДопГарантии Цикл
		
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" на " 
			+ Строка(СтрокаТаблицы.СрокГарантииНаОборудование) 
			+ " месяцев, в размере "
			+ Формат(СтрокаТаблицы.Стоимость, "ЧДЦ=2")
			+ СтрокаТаблицы.Валюта,
				Новый Шрифт("Arial", 9, Ложь))); 
			
	КонецЦикла;
		
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("При соответсвии оборудования техническим критериям, услуга будет доступна для предложения клиенту.
		|Для оценки необходим выезд инженера в рамках РТО.",
			Новый Шрифт("Arial", 9, Ложь))); 
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок); 

КонецФункции //-- #Б-1160 смарт: Мосолов 18.10.2024

//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования. 
Процедура СоздатьУстановкуЦенДляДопГарантии(Номенклатура, Характеристика, Цена, Дата) Экспорт

	УстановитьПривилегированныйРежим(Истина); 
	
	УстановкаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	УстановкаЦен.Дата = НачалоДня(Дата);
	УстановкаЦен.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
	
	СтрокаЦен = УстановкаЦен.ВидыЦен.Добавить();
	СтрокаЦен.ВидЦены = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяRUB");
	
	СтрокаТовара = УстановкаЦен.Товары.Добавить();
	СтрокаТовара.ВидЦены = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "РозничнаяRUB");
	СтрокаТовара.Номенклатура = Номенклатура;
	СтрокаТовара.Характеристика = Характеристика;
	СтрокаТовара.Цена = 1;
	
	УстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//++ #Б-1690 смарт: Фролов 13.12.2024 //Доработка Интереса - при выборе товара подставлять автоматом значения.
Функция ВернутьЗначениеНастройкиПредопределенногоСмарт(Наименование) Экспорт
	
	Если Метаданные.Справочники.смартПредопределенныеЗначения.Реквизиты.Найти(Наименование) = Неопределено Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Справочники.смартПредопределенныеЗначения.Настройки[Наименование];
		
	КонецЕсли;	
	
КонецФункции //-- #Б-1690 смарт: Фролов 13.12.2024	

//++ #Б-1910 смарт: Лопато 20.01.2025 //Ошибка оформления документов УПД и РО по Заказу клиента  
Процедура ПроверитьКоличествоУпаковокВТЧТовары(Ссылка, Товары, Отказ) Экспорт

	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
    Для Каждого СтрокаТовара Из Товары Цикл
		
		ПараметрыПересчета = ОбработкаТабличнойЧастиКлиентСервер.НормализоватьПараметрыПересчетаЕдиниц(СтрокаТовара, Неопределено);
		
		ДанныеУпаковки = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьКоэффициентУпаковки(
							 ПараметрыПересчета.Упаковка, КэшированныеЗначения, ПараметрыПересчета.Номенклатура);
		
		Количество = СтрокаТовара.КоличествоУпаковок * ДанныеУпаковки.Коэффициент;
		
		Если ДанныеУпаковки.НужноОкруглятьКоличество
			И ПараметрыПересчета.НужноОкруглять Тогда
			
			Количество = Окр(Количество, 0, РежимОкругления.Окр15как20);
			
		КонецЕсли;
		
		Если СтрокаТовара.Количество <> Количество Тогда
			
			СообщениеТекст = СокрЛП(Ссылка) + Символы.ПС 
							 + "В строке " + СокрЛП(СтрокаТовара.НомерСтроки) 
							 + " по номенклатуре """ + СокрЛП(СтрокаТовара.Номенклатура) + """" 
							 + " количество товара """ + СокрЛП(СтрокаТовара.Количество) + """" 
							 + " не соответствует количеству упаковок """ + СокрЛП(СтрокаТовара.КоличествоУпаковок) + """!"
							 + Символы.ПС + "Срочно обратитесь в ИТ-Департамент!";

			ОбщегоНазначения.СообщитьПользователю(СообщениеТекст, , , , Отказ);

			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка несоответствия количества и количества упаковок'", 
									 ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , СообщениеТекст);
			
		КонецЕсли;	
		
	КонецЦикла;	
		
КонецПроцедуры //-- #Б-1910 смарт: Лопато 20.01.2025	

//++ #Б-2470 смарт: Фролов 24.02.2025 //Вывод состояния Партнера в Интересе.
Функция ПолучитьНовоеСостояниеПартнера(Партнер, ТипПараметра = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда
		
		Возврат Новый Структура("Состояние, КоличествоДней", Перечисления.смартСостоянияПартнеров.Свободен, "");
		
	КонецЕсли;	
	
	Запрос = Новый Запрос(
	//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
	//Переделан запрос под универсальную схему СЦ, РМ или обычныый
	
	//++ #Б-2484 смарт: Фролов 05.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
	//Учитывается тип реквизита Партнера
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтанетСвободнымЧерез" + ТипПараметра + " КАК КоличествоДней,
	|	Состояние" + ТипПараметра + " КАК Состояние,
	//++ #Б-2852 смарт: Фролов 10.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
	|	ПричинаПереводаКлиентовВАрхив КАК ПричинаПереводаКлиентовВАрхив
	//-- #Б-2852 смарт: Фролов 10.04.2025
	|ИЗ
	|	РегистрСведений.смартСостояниеПартнеров
	|ГДЕ
	|	Партнер = &Партнер");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//++ #Б-2852 смарт: Фролов 10.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
	//Добавлена передача параметра ПричинаПереводаКлиентовВАрхив
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Состояние, КоличествоДней, ПричинаПереводаКлиентовВАрхив", 
			Выборка.Состояние, Выборка.КоличествоДней, Выборка.ПричинаПереводаКлиентовВАрхив);
	Иначе
		Возврат Новый Структура("Состояние, КоличествоДней, ПричинаПереводаКлиентовВАрхив", 
			Перечисления.смартСостоянияПартнеров.Свободен, "", "");
	КонецЕсли;
	//-- #Б-2852 смарт: Фролов 10.04.2025	
		
КонецФункции //-- #Б-2470 смарт: Фролов 18.02.2025

//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Функция ПолучитьЗначениеСправочникаПредопределенныеПоНовому(ИмяПредопределенного) Экспорт

	Возврат Справочники.смартПредопределенныеЗначения.Настройки[ИмяПредопределенного];
	
КонецФункции //-- #Б-2208 смарт: Фролов 25.02.2025	

//++ #Б-2208 смарт: Фролов 27.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Функция ПулучитьПредельныйСрокВзаимодействияПоПартнеру(Партнер) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_Интерес.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Партнер = &Партнер
	|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.ОсновнойМенеджер
	|	И НЕ CRM_Интерес.ПометкаУдаления
	|	И НЕ CRM_Интерес.Завершен");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Справочники.смартПредопределенныеЗначения.Настройки.ПредельныйСрокПланированияВзаимодействий;
	Иначе
		Возврат Справочники.смартПредопределенныеЗначения.Настройки.ПредельныйСрокПланированияВзаимодействийБезИнтереса;	
	КонецЕсли;	
	
КонецФункции //-- #Б-2208 смарт: Фролов 27.02.2025	

//++ #Б1154 смарт: Шляпников 17.10.2024 / Контроль оперативных остатков в разрезе организаций
Функция ПолучитьСтэкВызовов() Экспорт
	
	Попытка
		ВызватьИсключение "Стэк вызовов:";
	Исключение
		Возврат ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецФункции

//++ #Б-4290 смарт: Фролов 11.09.2025 //Доработки Автозадач
Функция ПолучитьРабочуюДатуОтносительноИсходной(ДатаИсходная, КоличествоДней, Направление) Экспорт
	
	НомерДня = 1;
	НужнаяДата = ДатаИсходная + ?(Направление = "Вперед", 1, (-1)) * 86400;
	Пока НомерДня < КоличествоДней Цикл
		
		Если ДатаЯвляетсяРабочей(НужнаяДата) Тогда
			
			НужнаяДата = НужнаяДата + ?(Направление = "Вперед", 1, (-1)) * 86400;
			НомерДня = НомерДня + 1;
			
		Иначе	
			
			НужнаяДата = НужнаяДата + ?(Направление = "Вперед", 1, (-1)) * 86400;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Пока НЕ ДатаЯвляетсяРабочей(НужнаяДата) Цикл
		
		НужнаяДата = НужнаяДата + ?(Направление = "Вперед", 1, (-1)) * 86400;	
		
	КонецЦикла;
		
	Возврат НужнаяДата;
	
КонецФункции //-- #Б-4290 смарт: Фролов 11.09.2025

//++ #Б-4290 смарт: Фролов 11.09.2025 //Доработки Автозадач
Функция ДатаЯвляетсяРабочей(ДатаПроверки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", КалендарныеГрафики.ОсновнойПроизводственныйКалендарь());
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ДатаПроверки));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дата
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И Дата = &ТекущаяДата
	|	И ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), 
	|				ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))";
	
	Возврат Запрос.Выполнить().Выбрать().Следующий();
	
КонецФункции //-- #Б-4290 смарт: Фролов 11.09.2025

//++ #Б4674 смарт: Шляпников 23.10.2025 / Маркировка радиоэлектронной продукции. Запрет на перемещение между складами.
Функция ЭтоПолноправныйПользователь() Экспорт
	Возврат Пользователи.ЭтоПолноправныйПользователь();
КонецФункции

//++ #Б5128 смарт: Шляпников 22.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Классификатор ТН ВЭД". 1С БП
Функция ВернутьЗначениеПеречисленияПоСинониму(ИмяПеречисления, ЗначениеСинонимаТекст) Экспорт
	
	ЭлементПеречисления = Неопределено;

	Для каждого ТекЭлемент Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл

		Если ТекЭлемент.Синоним = ЗначениеСинонимаТекст Тогда
			ЭлементПеречисления = Перечисления[ИмяПеречисления][ТекЭлемент.Имя];
			Прервать;
		КонецЕсли;

	КонецЦикла; 

	Возврат ЭлементПеречисления; // возвращаем значение перечисления или Неопределено
	
КонецФункции

//++ #Б3034 смарт: Шляпников 29.09.2025 / Изменение алгоритма заполнения менеджера в Онлайн Заказе клиента 
Функция ПолучитьТаблицуИнтересовПоЗаказуКлиента(ЗаказКлиента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CRM_ЖурналДокументов.CRM_Интерес КАК Ссылка,
	|	CRM_ЖурналДокументов.СостояниеИнтереса КАК СостояниеИнтереса,
	|	CRM_ЖурналДокументов.ОсновнойИнтерес КАК ОсновнойИнтерес,
	|	CRM_ЖурналДокументов.ИнтересЯвляетсяОснованием КАК ВведенНаОсновании
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|ГДЕ
	|	CRM_ЖурналДокументов.Объект = &Объект
	|	И НЕ CRM_ЖурналДокументов.CRM_Интерес = ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка)
	|	И CRM_ЖурналДокументов.ГлавнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнойИнтерес УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", ЗаказКлиента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область РаботаСФормами

//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
Процедура СоздатьЭлементыПризнакаVIPКлиента(Форма, ЭтоВИП, ИмяПоляПартнер = "Партнер") Экспорт
	
	ЭлементПартнер = Форма.Элементы[ИмяПоляПартнер];
	ИмяКартинки = "ДобавитьВИзбранное";
	
	ГруппаВИП = смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(Форма, "смартПартнерВИП", ЭлементПартнер.Родитель, 3,,,, ЭлементПартнер);
	Форма.Элементы.Переместить(ЭлементПартнер, ГруппаВИП);
	
	ЭлементКартинка = смартФормированиеИнтерфейса.СздДекорацияКартинка(Форма, "смартПризнакВИП", ГруппаВИП, ИмяКартинки);
	ЭлементКартинка.Видимость = ЭтоВИП;
	ЭлементКартинка.Подсказка = "Это VIP клиент";
	ЭлементКартинка.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	
КонецПроцедуры

//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
Процедура СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(Форма, ИмяТаблицы, СтрокаЗаменыДляСоединения, СтрокаЗаменыДляПоля, ИмяСписка = "Список", ИмяПоляПартнер = "Партнер", ЭтоПоследнееПоле = Истина, ИмяКолонкиПеред = "СписокПартнер") Экспорт
	
	ТекстСоединения = СтрШаблон("		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегментаВИП
							    |		ПО ПартнерыСегментаВИП.Сегмент = &СегментВИПКлиентов
							    |			И %1.%2 = ПартнерыСегментаВИП.Партнер", ИмяТаблицы, ИмяПоляПартнер);
	
	ТекстПоля = СтрШаблон("	%1НЕ(ПартнерыСегментаВИП.Сегмент ЕСТЬ NULL) КАК ЭтоВипКлиент%2",
							?(ЭтоПоследнееПоле, ",", ""),
							?(ЭтоПоследнееПоле, "", ","));
	
	ПутьКДанным = СтрШаблон("%1.ЭтоВипКлиент", ИмяСписка);
	
	Если НЕ Форма[ИмяСписка].ПроизвольныйЗапрос Тогда
		
		Форма[ИмяСписка].ПроизвольныйЗапрос = Истина;
		
		Форма[ИмяСписка].ТекстЗапроса = СтрШаблон("ВЫБРАТЬ * ИЗ %1 КАК %2", Форма[ИмяСписка].ОсновнаяТаблица, ИмяТаблицы);
		
	КонецЕсли;
	
	Форма[ИмяСписка].ТекстЗапроса = СтрЗаменить(Форма[ИмяСписка].ТекстЗапроса, СтрокаЗаменыДляСоединения, СтрШаблон("%1%2%3", СтрокаЗаменыДляСоединения, Символы.ПС, ТекстСоединения));
	Форма[ИмяСписка].ТекстЗапроса = СтрЗаменить(Форма[ИмяСписка].ТекстЗапроса, СтрокаЗаменыДляПоля, СтрШаблон("%1%2%3", СтрокаЗаменыДляПоля, Символы.ПС, ТекстПоля));
	
	Параметр = Форма[ИмяСписка].Параметры.Элементы.Найти("СегментВИПКлиентов");
	Параметр.Значение = Справочники.смартПредопределенныеЗначения.СегментВИППартнеров.Значение;
	Параметр.Использование = Истина;
	
	СвойстваЭлемента = Новый Структура("Вид,КартинкаЗначений", ВидПоляФормы.ПолеКартинки, БиблиотекаКартинок.ДобавитьВИзбранное);
	смартФормированиеИнтерфейса.СздПоле(Форма, "ЭтоВипКлиент", ИмяСписка, "VIP", 0, ПутьКДанным, СвойстваЭлемента,, ИмяКолонкиПеред);
	
КонецПроцедуры

//++ #Б4754 смарт: Шляпников 28.10.2025 / Справочник Договоры Контрагентов. Добавить новые реквизиты. 
Процедура СоздатьЭлементыНаличияФайловДляФормСпискаДоговоров(Форма) Экспорт
	
	ТекстЗамены = "Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов";
	ТекстВставки = "	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
				   |		ПО СправочникДоговорыКонтрагентов.Ссылка = НаличиеФайлов.ОбъектСФайлами";
	Форма.Список.ТекстЗапроса = СтрЗаменить(Форма.Список.ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстЗамены, Символы.ПС, ТекстВставки));
	
	ТекстЗамены = "СправочникДоговорыКонтрагентов.Ссылка,";
	ТекстВставки = "	ВЫБОР
				   |		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
				   |				ТОГДА 1
				   |			КОГДА НаличиеФайлов.ЕстьФайлы
				   |				ТОГДА 0
				   |			ИНАЧЕ 1
				   |		КОНЕЦ КАК ЕстьФайлы,";
	Форма.Список.ТекстЗапроса = СтрЗаменить(Форма.Список.ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстЗамены, Символы.ПС, ТекстВставки));
	
	Свойства = Новый Структура;
	Свойства.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	Свойства.Вставить("Вид", ВидПоляФормы.ПолеКартинки);
	Свойства.Вставить("КартинкаЗначений", БиблиотекаКартинок.Скрепка);
	Свойства.Вставить("КартинкаШапки", БиблиотекаКартинок.Скрепка);
	Свойства.Вставить("Подсказка", "Присоединенные файлы");
	смартФормированиеИнтерфейса.СздПоле(Форма, "ЕстьФайлы", "Список", "", 1, "Список.ЕстьФайлы", Свойства,, "СписокНомер");
	
КонецПроцедуры

//++ #Б-5002 смарт: Фролов 17.11.2025 //Ограничение количества планируемых взаимодействий на день.
Функция ПолучитьВзаимодействияПоОтветственному(ПлановаяДата, Ответственный) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CRM_Интерес.Партнер КАК Партнер
	|ПОМЕСТИТЬ ПартнерыСИнтересами
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	НЕ CRM_Интерес.ПометкаУдаления
	|	И НЕ CRM_Интерес.Завершен
	|	И НЕ CRM_Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И CRM_Интерес.Ответственный = &Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CRM_Взаимодействие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|	И НЕ CRM_Взаимодействие.Партнер В
	|				(ВЫБРАТЬ
	|					ПартнерыСИнтересами.Партнер
	|				ИЗ
	|					ПартнерыСИнтересами)
	|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
	|	И CRM_Взаимодействие.Ответственный = &Ответственный
	|	И CRM_Взаимодействие.ПлановаяДата МЕЖДУ &ДатаНачала И &ДатаОкончания");
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ПлановаяДата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПлановаяДата));
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции //-- #Б-5002 смарт: Фролов 17.11.2025	

#КонецОбласти