
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ смарт:ММ 615 17.09.2021 СМС инженеру 
	ОбновитьНадписьБаланс();
	//-- смарт:ММ 17.09.2021
	
	//++ #1887 смарт: Мосолов 03.07.2024 //Доработать документы сервисного центра. Затраченное время.
	//Перенес из расширения
	//++ #1560 Лопато 20.11.2023 //Подсвечивать просроченные заявки в списке
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ЭтотОбъект.Список.ТекстЗапроса);

	ПакетЗапросов  = СхемаЗапроса.ПакетЗапросов;   
	
	ЗапросСписка   = ПакетЗапросов[0];
	
	ОператорСписка = ЗапросСписка.Операторы[0];

	ТекстПоля = "ВЫБОР КОГДА (ДокументсмартЗаявкаНаРемонтныеРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.НоваяЗаявка) 
				|				ИЛИ ДокументсмартЗаявкаНаРемонтныеРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.ПолученаВРаботу)) ТОГДА
				|					ВЫБОР 
				|						КОГДА РАЗНОСТЬДАТ(ДокументсмартЗаявкаНаРемонтныеРаботы.Дата, &ТекущаяДата, ЧАС) >= 3 ТОГДА 1 
				|						КОГДА РАЗНОСТЬДАТ(ДокументсмартЗаявкаНаРемонтныеРаботы.Дата, &ТекущаяДата, ЧАС) >= 2 
				|							  И РАЗНОСТЬДАТ(ДокументсмартЗаявкаНаРемонтныеРаботы.Дата, &ТекущаяДата, ЧАС) < 3 ТОГДА 2 
				|						ИНАЧЕ 
				|							0 
				|					КОНЕЦ 
				|				ИНАЧЕ 
				|					0 
				|				КОНЕЦ";
	ПолеЗаявкаПросрочена = ОператорСписка.ВыбираемыеПоля.Добавить(ТекстПоля);
	
	//++ #Б-4116 смарт: Фролов 25.08.2025 //Добавить в форму списка документа Заявка на ремонтные работы колонку с оборудованием клиента.
	//++ #Б-1668 смарт: Ермаков 20.12.2024 //Добавить колонку Серия в журнал Заявки на ремонтные работы
	//ЗапросСписка.Колонки[42].Псевдоним = "ЗаявкаПросрочена";
	//-- #Б-1668 смарт: Ермаков 20.12.2024
	ЗапросСписка.Колонки[ЗапросСписка.Колонки.Количество() - 1].Псевдоним = "ЗаявкаПросрочена";
	//-- #Б-4116 смарт: Фролов 25.08.2025

                                    
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Документ.смартЗаявкаНаРемонтныеРаботы";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(ЭтотОбъект.Элементы.Список, СвойстваСписка);
	
	ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	смартДобавитьУсловноеОформлениеДинамическогоСписка(ЭтотОбъект.Список, 
													   Новый Структура("ЦветФона, Поле", WebЦвета.Лосось, ""), 
													   Новый Структура("ИмяСписка, Поле, Значение", "Список", "ЗаявкаПросрочена", 1));
													   
	смартДобавитьУсловноеОформлениеДинамическогоСписка(ЭтотОбъект.Список, 
													   Новый Структура("ЦветФона, Поле", WebЦвета.Оранжевый, ""), 
													   Новый Структура("ИмяСписка, Поле, Значение", "Список", "ЗаявкаПросрочена", 2));
	//-- #1560 Лопато 20.11.2023
	//-- #1887 смарт: Мосолов 03.07.2024  
	
	//++ #1940 смарт: Мосолов 18.09.2024 //Изменения статусов в Заявках на ремонт Представительствами. 
	Если НЕ ЕстьПраваНаСтатусИПредставительство() Тогда
		
		Если Элементы.Найти("ФормаСоздать") <> Неопределено Тогда
			Элементы.ФормаСоздать.Доступность = Ложь; 
		КонецЕсли;
		
		Если Элементы.Найти("ФормаСкопировать") <> Неопределено Тогда
			Элементы.ФормаСкопировать.Доступность = Ложь;   
		КонецЕсли;
		
	КонецЕсли;
	//-- #1940 смарт: Мосолов 18.09.2024  
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументсмартЗаявкаНаРемонтныеРаботы", 
																		 "И (смартЗаявкаНаРемонтныеРаботыОборудование.НомерСтроки = 1)", 
																		 "ЕСТЬNULL(смартЗаявкаНаРемонтныеРаботыОборудование.ОборудованиеКлиентов, ЗНАЧЕНИЕ(Справочник.смартОборудованиеКлиентов.ПустаяСсылка)) КАК ОборудованиеКлиента,",
																		 ,, Ложь, "Партнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
	РасширенияПоддерживающиеПредпросмотр = РаботаСФайламиСлужебный.СписокРасширенийДляПредпросмотра();
	
	Элементы.PDFДокумент.Видимость = Ложь;
	Элементы.АдресДанныхФайла.Видимость = Истина;
	//-- #Б-6426 смарт: Фролов 17.04.2026
	
КонецПроцедуры  

//++ #1940 смарт: Мосолов 18.09.2024 //Изменения статусов в Заявках на ремонт Представительствами. 
&НаСервере
Функция ЕстьПраваНаСтатусИПредставительство()

	ТекущийПользователь = ПараметрыСеанса.АвторизованныйПользователь;
	СписокПользователейСПравами = Справочники.смартПредопределенныеЗначения.ПользователиДляОповещенияОЗаявкахНаРемонтныеРаботы.Значения.Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат РольДоступна("ПолныеПрава") ИЛИ СписокПользователейСПравами.Найти(ТекущийПользователь) <> Неопределено;

КонецФункции //-- #1940 смарт: Мосолов 18.09.2024

//++ #1887 смарт: Мосолов 03.07.2024 //Доработать документы сервисного центра. Затраченное время.
//Перенес из расширения
//++ #1560 Лопато 20.11.2023 //Подсвечивать просроченные заявки в списке
&НаСервере
Процедура смартДобавитьУсловноеОформлениеДинамическогоСписка(РеквизитСписок, ПараметрыОформления, Отбор)
	
	ПолеОформления = СтрЗаменить(Отбор.ИмяСписка, "Объект.", "");
	
	НовыйЭлемент = РеквизитСписок.УсловноеОформление.Элементы.Добавить(); 
	НовыйЭлемент.Использование = Истина;
	
	Для Каждого Элемент Из ПараметрыОформления Цикл
		
		Если Элемент.Ключ = "Поле" Тогда
			
			ПолеОформления = Элемент.Значение;

			Если ПолеОформления <> "" Тогда
				ОформляемыеПоля = НовыйЭлемент.Поля.Элементы.Добавить();
				ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
			КонецЕсли;
			
		Иначе

			НовыйЭлемент.Оформление.УстановитьЗначениеПараметра(Элемент.Ключ, Элемент.Значение);
			
		КонецЕсли;	
		
	КонецЦикла;		

	ЭлементОтбор = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Отбор.Поле);
	
	Если Отбор.Свойство("ВидСравнения") Тогда
		ЭлементОтбор.ВидСравнения = Отбор.ВидСравнения;
	Иначе	
		ЭлементОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ЭлементОтбор.ПравоеЗначение = Отбор.Значение;	
	
КонецПроцедуры //-- #1560 Лопато 20.11.2023 //-- #1887 смарт: Мосолов 03.07.2024

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//++ смарт:ММ 615 17.09.2021 СМС инженеру 
Процедура ОбновитьНадписьБаланс()
	
	Баланс = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ТекущийБалансSMSRU", Ложь);
	Элементы.НадписьБалансСМС.Заголовок = "Текущий баланс sms.ru: " + Баланс;
	
КонецПроцедуры //-- смарт:ММ 17.09.2021

//++ смарт:ММ 615 18.09.2021 СМС инженеру 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЗаявкаНаРемонтныеРаботы" Тогда
		ОбновитьНадписьБаланс();
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 18.09.2021

//++ смарт:ММ 615 19.09.2021 СМС инженеру 
&НаКлиенте
Процедура ОбновитьБаланс(Команда)
	ОбновитьБалансНаСервере();
КонецПроцедуры //-- смарт:ММ 19.09.2021

//++ смарт:ММ 615 19.09.2021 СМС инженеру 
&НаСервере
Процедура ОбновитьБалансНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЛогинДляОтправкиSMS 	= НастройкиОтправкиSMS.Логин;
	ПарольДляОтправкиSMS 	= НастройкиОтправкиSMS.Пароль;
	
	Баланс = ОтправкаSMSЧерезSMSRU.смартПолучитьБаланс(ЛогинДляОтправкиSMS, ПарольДляОтправкиSMS);
	
	Если ТипЗнч(Баланс) = Тип("Число") Тогда
		смартОбщегоНазначения.ОбновитьБаланс(Баланс); // Обновление в справочнике смартПредопределенныеЗначения
		ОбновитьНадписьБаланс();
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось запросить баланс");
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 19.09.2021


&НаКлиенте
//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
Процедура СписокФайловПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И РасширенияПоддерживающиеПредпросмотр.НайтиПоЗначению(ТекущиеДанные.Расширение) <> Неопределено Тогда

		Попытка
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка, Неопределено, УникальныйИдентификатор,, АдресДанныхФайла);

			Если ДанныеФайла.Расширение = "pdf" Тогда
				
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
				Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
				ЭтаФорма.PDFДокумент.Прочитать(Поток);

				Элементы.PDFДокумент.Видимость = Истина; 
				Элементы.АдресДанныхФайла.Видимость = Ложь;
				Элементы.PDFДокумент.Документ = ЭтаФорма.PDFДокумент;
				
			Иначе
				
				Элементы.PDFДокумент.Видимость = Ложь;
				Элементы.АдресДанныхФайла.Видимость = Истина;
				АдресДанныхФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
				
			КонецЕсли;

		Исключение
			// Если файла не существует, то будет вызвано исключение.
			АдресДанныхФайла         = Неопределено;
			ТекстНевыбраннойКартинки = НСтр("ru = 'Предварительный просмотр недоступен по причине:'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

	Иначе

		АдресДанныхФайла         = Неопределено;
		ТекстНевыбраннойКартинки = НСтр("ru = 'Нет данных для предварительного просмотра'");

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресДанныхФайла) Тогда
		Элементы.АдресДанныхФайла.ТекстНевыбраннойКартинки = ТекстНевыбраннойКартинки;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
Процедура СписокПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
			
		ЭтаФорма.СписокФайлов.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ТекущиеДанные.Ссылка);
		
	Иначе
		
		ЭтаФорма.СписокФайлов.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ПредопределенноеЗначение("Документ.смартЗаявкаНаПускоНаладку.ПустаяСсылка"));
		
	КонецЕсли;
	
	Элементы.PDFДокумент.Видимость = Ложь; 
	ЭтаФорма.АдресДанныхФайла = Неопределено;
	Элементы.АдресДанныхФайла.Видимость = Истина;
	
КонецПроцедуры
