#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция - Массив типов услуг
// 
// Возвращаемое значение:
//  Массив - массив ссылок справочника CRM_ТипУслуги
//
Функция МассивТиповУслуг() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ТипУслуги.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ТипУслуги КАК CRM_ТипУслуги");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б-958 смарт: Фролов 30.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам
Функция ПолучитьМассивНоменклатурыПоТипу(ТипУслуги) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипУслуги) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура");
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	1 = 1");
		Если ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаРасходныеМатериалы Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Номенклатура.Ссылка В ИЕРАРХИИ(&Расходка)");
			Запрос.УстановитьПараметр("Расходка", Справочники.Номенклатура.НайтиПоКоду("ЦБ-00007802"));
			Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
		ИначеЕсли ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги Тогда
			
			ВидНоменклатуры = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Номенклатура.ВидНоменклатуры = &ВидНоменклатуры");
			Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
			Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
				
		Иначе
				
			СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", "СегментЗапчастиДляПланирования"); 
			ТЗНоменклатураСегмента = СегментыСервер.СписокЭлементовСКД(СегментОборудование);
			Возврат ТЗНоменклатураСегмента.ВыгрузитьКолонку("ЭлементСписка");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //-- #Б-958 смарт: Фролов 30.09.2024	

#КонецОбласти

#КонецЕсли
