#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Документ", Документ);
	ЗаполнитьТоварыПоДокументу();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытияЭлементов

&НаСервере
Функция СформироватьИОтправитьНаСервере()
	
	Результат = Новый Структура("Параметры,Файлы", Новый Структура, Новый Массив);
	Результат.Параметры.Вставить("ПапкаВыгрузкиОтгрузка", смартИнтеграцияАтлант.ПолучитьПапкуВыгрузкиДляДокумента(Документ, 1));
	Результат.Параметры.Вставить("ПапкаВыгрузкиПриемка", смартИнтеграцияАтлант.ПолучитьПапкуВыгрузкиДляДокумента(Документ, 2));
	
	//1. Документы на отгрузку
	Шапка = смартИнтеграцияАтлант.ПолучитьСтруктуруПараметровШапкиАтлант();
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		Шапка.Номер = СтрШаблон("КОМ-%1", смартИнтеграцияАтлант.НомерНаПечать(Документ.Номер, Истина, Истина));
		Шапка.ДатаОтгрузки = ТекущаяДатаСеанса();
		Шапка.Менеджер = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	Уведомление = смартИнтеграцияАтлант.СформироватьУведомлениеОбОтгрузкеАтлант(Шапка, ТоварыОтгрузка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 1, "xls");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, Уведомление, 1, Ложь, Истина, "xls"));
	
	ФайлXML = смартИнтеграцияАтлант.СформироватьXMLФайлОтгрузки(Шапка, ТоварыОтгрузка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 1, "xml");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, ФайлXML, 1, Истина, Истина, "xml"));
	
	//2. Документы на приемку
	Шапка = смартИнтеграцияАтлант.ПолучитьСтруктуруПараметровШапкиАтлант();
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		Шапка.Номер = СтрШаблон("КОМ-%1", смартИнтеграцияАтлант.НомерНаПечать(Документ.Номер, Истина, Истина));
		Шапка.ДатаОтгрузки = ТекущаяДатаСеанса();
		Шапка.Менеджер = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	Уведомление = смартИнтеграцияАтлант.СформироватьУведомлениеОПриемкеАтлант(Шапка, ТоварыПриемка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 2, "xls");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, Уведомление, 2, Ложь, Истина, "xls"));
	
	ФайлXML = смартИнтеграцияАтлант.СформироватьXMLФайлПриемки(Шапка, ТоварыПриемка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 2, "xml");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, ФайлXML, 2, Истина, Истина, "xml"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СформироватьИОтправить(Команда)
	
	Результат = СформироватьИОтправитьНаСервере();
	ОтправитьПакетДокументовНаПочтуАтлант(Результат.Файлы);
	ВыгрузитьСформированныеДокументыНаFTP(Результат.Файлы);
	ЗаписатьФайлыНаДиск(Результат);
	ВыгрузитьНоменклатуруПоДокументамНаFTP();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ВыгрузитьНоменклатуруПоДокументамНаFTP()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивНоменклатуры = ТоварыОтгрузка.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНоменклатуры, ТоварыПриемка.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	смартИнтеграцияАтлант.ВыгрузитьМассивНоменклатурыНаFTP(МассивНоменклатуры, Документ.Склад.смартНастройкаОбменомСАтлант);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайлыНаДиск(Данные)
	
	Для Каждого стрФайл Из Данные.Файлы Цикл
		
		Если стрФайл.Направление = 1 Тогда
			КаталогДляСохранения = Данные.Параметры.ПапкаВыгрузкиОтгрузка;
		Иначе
			КаталогДляСохранения = Данные.Параметры.ПапкаВыгрузкиПриемка;
		КонецЕсли;
		
		СоздатьКаталог(КаталогДляСохранения);
		
		ПолноеИмяФайла = СтрШаблон("%1\%2", КаталогДляСохранения, стрФайл.ИмяФайла);
		
		Попытка
			
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(стрФайл.Данные);
			ДвоичныеДанныеФайла.Записать(ПолноеИмяФайла);

			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл : " + ПолноеИмяФайла);
			
		Исключение
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось сохранить файл : " + ПолноеИмяФайла + Символы.ПС + ОписаниеОшибки());
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;				

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьСформированныеДокументыНаFTP(Файлы)
	
	Соединение = смартИнтеграцияАтлант.ПолучитьFTPСоединение(Документ.Склад.смартНастройкаОбменомСАтлант);
	Если Соединение = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось установить FTP соединение с сервером Атлант");
		Возврат;
	КонецЕсли;
	
	Для каждого стрФайл Из Файлы Цикл
		
		Если НЕ стрФайл.ВыгружатьНаFTP Тогда
			Продолжить;
		КонецЕсли;
		
		Если Б_ОбменССайтомСервер.смарт_ЭтоКопияБазы() Тогда
			Если стрФайл.Направление = 1 Тогда
				ПутьНаФТП = "OUT1";
			Иначе
				ПутьНаФТП = "IN1";
			КонецЕсли;
		Иначе
			Если стрФайл.Направление = 1 Тогда
				ПутьНаФТП = "OUT";
			Иначе
				ПутьНаФТП = "IN";
			КонецЕсли;
		КонецЕсли;
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(стрФайл.Расширение);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(стрФайл.Данные);
		Двоичныеданные.Записать(ИмяВременногоФайла);
		
		Если НЕ	смартИнтеграцияАтлант.ЗаписатьФайлВКаталог(Соединение, ПутьНаФТП, ИмяВременногоФайла, стрФайл.ИмяФайла) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось установить выгрузить файл %1 на FTP", стрФайл.ИмяФайла));
		КонецЕсли;
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Данные выгружены на FTP!");
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПакетДокументовНаПочтуАтлант(Файлы)
	
	Вложения = Новый Массив;
	
	Для Каждого стрФайл Из Файлы Цикл
		
		Если НЕ стрФайл.ОтправлятьПоПочте Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВложения = Новый Структура();
		ДанныеВложения.Вставить("Представление", стрФайл.ИмяФайла);
		ДанныеВложения.Вставить("АдресВоВременномХранилище", стрФайл.Данные);
		
		Вложения.Добавить(ДанныеВложения);
		
	КонецЦикла;
	
	Получатели = Новый Массив;
	Для каждого стрПолучатель Из Документ.Склад.смартАдресаДляОтправкиПакетаНаСклад Цикл
		
		Получатель = Новый Структура("Адрес,Представление", стрПолучатель.смартАдресДляОтправкиПакетаНаСклад, стрПолучатель.смартАдресДляОтправкиПакетаНаСклад);
		Получатели.Добавить(Получатель);
		
	КонецЦикла;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Получатели);
	ПараметрыПисьма.Вставить("ПолучателиСообщения", Получатели);
	ПараметрыПисьма.Вставить("Тема", СтрШаблон("Пакет документов по %1", Документ));
	ПараметрыПисьма.Вставить("Тело", "");
	
	ПараметрыПисьма.Вставить("Вложения", Вложения);
			
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
	
	ОбщегоНазначения.СообщитьПользователю("Письма отправлены !");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоДокументу()
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		ЗаполнитьДанныеПоЗаказуНаСборку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоЗаказуНаСборку()
	
	СборкаТоваров = НайтиСборкуТоваровПоЗаказуНаСборку(Документ);
	Если НЕ ЗначениеЗаполнено(СборкаТоваров) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По заказу %1 не найдена сборка товаров. Без сборки выгрузка в Атлант невозможна !", Документ));
		Возврат;
	КонецЕсли;
	
	Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		
		НоваяСтрока = ТоварыПриемка.Добавить();
		НоваяСтрока.Номенклатура = СборкаТоваров.Номенклатура;
		НоваяСтрока.Характеристика = СборкаТоваров.Характеристика;
		НоваяСтрока.Серия = СборкаТоваров.Серия;
		НоваяСтрока.Количество = СборкаТоваров.Количество;
		
		ТоварыОтгрузка.Загрузить(СборкаТоваров.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,Количество"));
		
	Иначе
		
		НоваяСтрока = ТоварыОтгрузка.Добавить();
		НоваяСтрока.Номенклатура = СборкаТоваров.Номенклатура;
		НоваяСтрока.Характеристика = СборкаТоваров.Характеристика;
		НоваяСтрока.Серия = СборкаТоваров.Серия;
		НоваяСтрока.Количество = СборкаТоваров.Количество;
		
		ТоварыПриемка.Загрузить(СборкаТоваров.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,Количество"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСборкуТоваровПоЗаказуНаСборку(ЗаказНаСборку)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СборкаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
	|	И СборкаТоваров.Проведен";
	
	Запрос.УстановитьПараметр("ЗаказНаСборку", ЗаказНаСборку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти