
Функция webhookGET(Запрос)
	
	ИмяСобытияДляЖурналаРегистрации = "/calltracking/webhook";
	
	ТекстОписание = "";
	ПараметрыСтрокой = "";
	Для Каждого ТекПараметр Из Запрос.ПараметрыЗапроса Цикл
		ПараметрыСтрокой = ПараметрыСтрокой + "&" + ТекПараметр.Ключ + "=" + ТекПараметр.Значение;
		ТекстОписание = ТекстОписание + ?(ТекстОписание = "", "", Символы.ПС) + ТекПараметр.Ключ + ": " + ТекПараметр.Значение;
	КонецЦикла;
	Если ЗначениеЗаполнено(ПараметрыСтрокой) Тогда
		сфпСофтФонПроСерверПереопределяемый.ЗаписатьЗапросВЖурналРегистрации(ИмяСобытияДляЖурналаРегистрации, ПараметрыСтрокой);
	КонецЕсли;	
	
	ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		сфпСофтФонПроСерверПереопределяемый.ЗаписатьЗапросВЖурналРегистрации(ИмяСобытияДляЖурналаРегистрации, ТелоЗапроса);
	КонецЕсли;	
	
	Если НЕ ПолучитьФункциональнуюОпцию("сфпИспользоватьCoMagic") Тогда
		Возврат СообщениеОбОшибке(
			Запрос.Заголовки,
			500,
			ИмяСобытияДляЖурналаРегистрации,
			НСтр("ru='Использование коллтрекинга отключено в настройках'"));
	КонецЕсли;
	
	ОператорКоллтрекинга = Константы.сфпОператорКоллтрекинга.Получить();
	Если ОператорКоллтрекинга <> Перечисления.CRM_CallTrakingСценарии.Mango Тогда
		Возврат СообщениеОбОшибке(
			Запрос.Заголовки,
			400,
			ИмяСобытияДляЖурналаРегистрации,
			НСтр("ru='Выбран другой оператор коллтрекинга'"));
	КонецЕсли;

	Попытка
		callId = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "callId");				// ID звонка
		uid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "uid");						// Уникальный идентификатор клиента MANGO OFFICE
		yaCid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "yaCid");					// Идентификатор клиента Яндекс Метрики
		gaCid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "gaCid");					// Идентификатор клиента Google Analytics
		rsCid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "rsCid");					// Идентификатор сеанса (визита), используемый в Roistat
		dateStart = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "dateStart");			// Время поступления звонка
		callType = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "callType");			// Тип звонка
		number = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "number");				// Номер, на который был принят звонок
		callerNumber = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "callerNumber");	// Номер звонившего
		utmSource = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmSource");			// Источник
		utmMedium = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmMedium");			// Канал
		utmCampaign = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmCampaign");		// Кампания
		utmContent = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmContent");		// Содержание объявления
		utmTerm = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmTerm");				// Ключевое слово
		countryCode = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "countryCode");		// Код ISO страны
		regionCode = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "regionCode");		// Код ISO региона
		city = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "city");					// Название города
		device = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "device");				// Тип устройства: desktop, tablet или mobile
		ip = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "ip");						// IP адрес пользователя
		url = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "url");						// Адрес страницы сайта, с которой был совершён звонок
		firstUrl = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "firstUrl");			// Адрес страницы входа пользователя на сайт
		customParam = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "customParam");		// Дополнительные параметры (не более 4000 символов)
		
		МетрикаUTM_Source = ПолучитьСвойствоМетрики("CRM_Метрика_UTM_Source", "utm_source", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
		МетрикаUTM_Medium = ПолучитьСвойствоМетрики("CRM_Метрика_UTM_Medium", "utm_medium", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
		МетрикаUTM_Campaign = ПолучитьСвойствоМетрики("CRM_Метрика_UTM_Campaign", "utm_campaign", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)));
				
		ДопРеквизиты = Новый Соответствие();
		ДопРеквизиты.Вставить(МетрикаUTM_Source, utmSource);
		ДопРеквизиты.Вставить(МетрикаUTM_Medium, utmMedium);
		ДопРеквизиты.Вставить(МетрикаUTM_Campaign, utmCampaign);
		
		УстановитьПривилегированныйРежим(Истина);
		
		СайтДомен = СтрЗаменить(СтрЗаменить(url, "http://", ""), "https://", "");
		Позиция = Найти(СайтДомен, "/");
		Если Позиция > 0 Тогда
			СайтДомен = Лев(СайтДомен, Позиция - 1);
		КонецЕсли;
		Позиция = Найти(СайтДомен, ":");
		Если Позиция > 0 Тогда
			СайтДомен = Лев(СайтДомен, Позиция - 1);
		КонецЕсли;
		СтруктураСайт = Новый Структура("id,Наименование,domain", "", СайтДомен, СайтДомен);
		Сайт = CRM_СистемаСквознойАналитикиВызовСервера.ЗаписатьИнформациюПоСайтам(СтруктураСайт);
		
		КаналПервичногоИнтереса = "";
		ИсточникПервичногоИнтереса = "";
		
		Если ЗначениеЗаполнено(utmCampaign) Тогда
			КаналПервичногоИнтереса = ОпределитьКаналРекламы(utmMedium, utmSource);
			
			ИсточникПервичногоИнтереса = Справочники.МаркетинговыеМероприятия.НайтиПоРеквизиту("CRM_UTMМетка", utmCampaign);
			Если ИсточникПервичногоИнтереса.Пустая() Тогда
				ТекОбъект = Справочники.МаркетинговыеМероприятия.СоздатьЭлемент();
				ТекОбъект.CRM_UTMМетка = utmCampaign;
				ТекОбъект.Наименование = utmCampaign;
				ТекОбъект.CRM_СквознаяАналитика = Истина;
				ТекОбъект.CRM_Неограниченно = Истина;
				ТекОбъект.Записать();
				
				ИсточникПервичногоИнтереса = ТекОбъект.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		ДатаЗвонка = ТекущаяДата();
		НомерТелефона = Прав(callerNumber, 10);
		
		МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НомерТелефона 			  = НомерТелефона;
		МенеджерЗаписи.ДатаЗвонка 				  = ДатаЗвонка;
		МенеджерЗаписи.Идентификатор 			  = "";
		МенеджерЗаписи.Сайт 					  = url;
		МенеджерЗаписи.utm_campaign				  = utmCampaign;
		МенеджерЗаписи.utm_term		 			  = "";
		МенеджерЗаписи.Оператор 				  = Перечисления.CRM_CallTrakingСценарии.Mango;
		МенеджерЗаписи.Заявка 					  = "";
		МенеджерЗаписи.КаналПервичногоИнтереса 	  = КаналПервичногоИнтереса;
		МенеджерЗаписи.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
		МенеджерЗаписи.Данные					  = ТекстОписание;
		МенеджерЗаписи.Записать();
		
		ИсточникПолучения = "";
		Ответственный = "";
		CRM_РольОтветственного = "";
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ Ссылка, CRM_РольОтветственного, ОтветственныйМенеджер
		|ИЗ Справочник.CRM_ИсточникиПолученияЛидов
		|ГДЕ НЕ ПометкаУдаления И Включено И Сценарий = &Сценарий");
		Запрос.УстановитьПараметр("Сценарий", Перечисления.CRM_CallTrakingСценарии.Mango);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИсточникПолучения = Выборка.Ссылка;
			Ответственный = Выборка.ОтветственныйМенеджер;
			CRM_РольОтветственного = Выборка.CRM_РольОтветственного;
		КонецЕсли;
		
		Тема = НСтр("ru='Звонок с номера'; en='Call From Number'") + " " + НомерТелефона;
		
		ДокументОбъект = Документы.CRM_Заявка.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаЗвонка;
		ДокументОбъект.Наименование = "";
		ДокументОбъект.Телефон = НомерТелефона;
		ДокументОбъект.ЭлектроннаяПочта = "";
		ДокументОбъект.Тема = Тема;
		ДокументОбъект.ИсточникПолучения = ИсточникПолучения;
		ДокументОбъект.Ответственный = Ответственный;
		ДокументОбъект.CRM_РольОтветственного = CRM_РольОтветственного;
		ДокументОбъект.КаналПервичногоИнтереса = КаналПервичногоИнтереса;
		ДокументОбъект.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
		ДокументОбъект.ТипЗаявки = 1;
		ДокументОбъект.Комментарий = ТекстОписание;
		
		// Запишем доп. реквизиты в Заявку
		Для Каждого ДопРеквизит Из ДопРеквизиты Цикл
			СтрокаСвойств = ДокументОбъект.ДополнительныеРеквизиты.Добавить();
			СтрокаСвойств.Свойство = ДопРеквизит.Ключ;
			СтрокаСвойств.Значение = ДопРеквизит.Значение;
		КонецЦикла;
		
		Документы.CRM_Заявка.ЗаполнитьКонтактЗаявки(ДокументОбъект);
		Справочники.CRM_ПравилаОбработкиОбращений.ПрименитьПравило(ДокументОбъект);
		
		ДокументОбъект.Записать();
						
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("CRM_Сайт", Сайт);
		СтруктураДанных.Вставить("CRM_UTM_source", utmSource);
		СтруктураДанных.Вставить("CRM_UTM_medium", utmMedium);
		СтруктураДанных.Вставить("CRM_UTM_pos", "");
		СтруктураДанных.Вставить("КаналПервичногоИнтереса", КаналПервичногоИнтереса);
		СтруктураДанных.Вставить("ИсточникПервичногоИнтереса", ИсточникПервичногоИнтереса);
		СтруктураДанных.Вставить("ИсточникПолучения", ИсточникПолучения);
		CRM_СистемаСквознойАналитики.УстановитьСсылкуВИсточникПервичногоИнтересаЗаписатьДопРеквизит(ДокументОбъект.Ссылка, СтруктураДанных);
		
		Справочники.CRM_ПравилаОбработкиОбращений.ОбработатьОбращение(ДокументОбъект);
		
		// Удалим записи старше 1 часа.
		Запрос = Новый Запрос("
		|ВЫБРАТЬ НомерТелефона
		|ИЗ РегистрСведений.сфпДанныеКоллтрекинга
		|ГДЕ ДатаЗвонка < &ДатаПроверки");
		Запрос.УстановитьПараметр("ДатаПроверки", (ТекущаяДата() - 3600));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.НомерТелефона = Выборка.НомерТелефона;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;

	Исключение
		Возврат СообщениеОбОшибке(
			Запрос.Заголовки,
			500,
			ИмяСобытияДляЖурналаРегистрации,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;

КонецФункции

Функция ПолучитьПараметрЗапроса(ПараметрыЗапроса, ИмяПараметра)
	
	Возврат "" + ПараметрыЗапроса.Получить(ИмяПараметра);
	
КонецФункции	

Функция СообщениеОбОшибке(ЗаголовкиВходящегоЗапроса, КодСостояния, ВложенноеИмяСобытия, Комментарий = Неопределено)
	
	сфпСофтФонПроСерверПереопределяемый.ЗаписатьЗапросВЖурналРегистрации(ВложенноеИмяСобытия, Комментарий, УровеньЖурналаРегистрации.Ошибка);
	Возврат НовыйHTTPСервисОтвет(ЗаголовкиВходящегоЗапроса, КодСостояния);
	
КонецФункции

Функция НовыйHTTPСервисОтвет(ЗаголовкиВходящегоЗапроса, КодСостояния)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	
	ПодписьКлюч = "Echo";
	ПодписьЗначение = ЗаголовкиВходящегоЗапроса.Получить(ПодписьКлюч);
	Если ПодписьЗначение <> Неопределено Тогда
		Ответ.Заголовки.Вставить(ПодписьКлюч, ПодписьЗначение);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОпределитьКаналРекламы(utmMedium, utmSource)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НРег(utmSource) = "organic" Тогда
		// Бесплатный поиск
		Наименование = "Переходы из поисковых систем";

	ИначеЕсли НРег(utmSource) = "internal" Тогда
		// Внутренние переходы
		Наименование = "Внутренние переходы";
		
	ИначеЕсли НРег(utmSource) = "referral" ИЛИ НРег(utmSource) = "link" Тогда
		// Переходы по ссылкам
		Наименование = "Переходы по ссылкам на сайт";
		
	ИначеЕсли НРег(utmSource) = "direct" ИЛИ НРег(utmSource) = "ya_direct" ИЛИ НРег(utmSource) = "Yandex-Direct" Тогда
		// Прямые заходы
		Наименование = "Прямые заходы";
		
	ИначеЕсли НРег(utmSource) = "email" Тогда
		// Почтовая рассылка
		Наименование = "Переходы с почтовых рассылок";
		
	ИначеЕсли НРег(utmSource) = "cpc" ИЛИ НРег(utmSource) = "ppc" ИЛИ НРег(utmSource) = "paidsearch" ИЛИ НРег(utmSource) = "ad" ИЛИ НРег(utmSource) = "paid" Тогда
		// Поисковая реклама
		Наименование = "Переходы по рекламе";
		
	ИначеЕсли НРег(utmSource) = "social" ИЛИ НРег(utmSource) = "social-network" ИЛИ НРег(utmSource) = "social-media" ИЛИ НРег(utmSource) = "sm" ИЛИ НРег(utmSource) = "social network" ИЛИ НРег(utmSource) = "social media" Тогда
		// Социальные сети
		Наименование = "Переходы из социальных сетей";
		
	ИначеЕсли НРег(utmSource) = "display" ИЛИ НРег(utmSource) = "cpm" ИЛИ НРег(utmSource) = "banner" Тогда
		// Медийная реклама
		Наименование = "Медийная реклама";
		
	ИначеЕсли НРег(utmSource) = "cpv" ИЛИ НРег(utmSource) = "cpa" ИЛИ НРег(utmSource) = "cpp" ИЛИ НРег(utmSource) = "content-text" Тогда
		// Другая реклама
		Наименование = "Прочая реклама";
		
	Иначе
		Наименование = НРег(utmSource);
	КонецЕсли;
	
	Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию(Наименование, Истина);
	Если Канал.Пустая() Тогда
		КаналОбъект = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		КаналОбъект.Наименование = Наименование;
		КаналОбъект.Записать();
		
		Канал = КаналОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Канал;

КонецФункции

Функция ПолучитьСвойствоМетрики(ИдентификаторМетрики, НаименованиеМетрики, ТипЗначенияМетрики)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Заявка;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка
	|ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения
	|ГДЕ Имя = &Имя И НЕ ПометкаУдаления И НаборСвойств = &НаборСвойств");
	Запрос.УстановитьПараметр("Имя", ИдентификаторМетрики);
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Имя", ИдентификаторМетрики);
	СтруктураРеквизитов.Вставить("Заголовок", НаименованиеМетрики);
	СтруктураРеквизитов.Вставить("НаборСвойств", НаборСвойств);
	СтруктураРеквизитов.Вставить("ТипЗначения", ТипЗначенияМетрики);
	СтруктураРеквизитов.Вставить("Доступен", Истина);
	СтруктураРеквизитов.Вставить("Виден", Ложь);
	СтруктураРеквизитов.Вставить("ЗаполнятьОбязательно", Ложь);
	
	ОбъектПВХ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектПВХ, СтруктураРеквизитов);
	
	НаименованиеНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектПВХ.НаборСвойств, "Наименование");
	ОбъектПВХ.Наименование = ОбъектПВХ.Заголовок + " (" + НаименованиеНабора + ")";
	ОбъектПВХ.Записать();
	
	Возврат ОбъектПВХ.Ссылка;
	
КонецФункции