#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// Настройки вариантов этого отчета.
//  Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
// Параметры:
//  Настройки		 -  Коллекция - Используется для описания настроек отчетов и вариантов.
//       Передается "как есть" из процедур НастроитьВариантыОтчетов и НастроитьВариантыОтчета. 
//  ОписаниеОтчета	 -  СтрокаДерева, ОбъектМетаданных - Описание настроек, метаданные или ссылка отчета. 
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	// Настройка размещения, видимости по умолчанию, важности.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Таблица");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Диаграмма");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// Возвращает строку представления переданного реквизита
//
// Параметры:
//  Реквизит - 	Строка - Реквизит для анализа.
// 
// Возвращаемое значение:
//  Строка - Представление реквизита.
// 
Функция ПолучитьПредставлениеРеквизита(Реквизит) Экспорт
	Если ТипЗнч(Реквизит) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		Возврат Строка(Реквизит);
	ИначеЕсли Реквизит = "ABCКласс" Тогда
		Возврат НСтр("ru='ABC класс';en='ABC Class'")
	ИначеЕсли Реквизит = "XYZКласс" Тогда
		Возврат НСтр("ru='XYZ класс';en='XYZ class'")
	ИначеЕсли Реквизит = "Сегмент" Тогда
		Возврат НСтр("ru='Сегмент';en='Segment'")
	Иначе
		РеквизитМд = Метаданные.Справочники.Партнеры.Реквизиты.Найти(Реквизит);
		Если РеквизитМд = Неопределено Или ПустаяСтрока(РеквизитМд.Синоним) Тогда
			Возврат Реквизит;
		Иначе
			Возврат РеквизитМд.Синоним;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли

