
#Область ДоработкиСмарт

//Смарт Фролов+ по заявке № 221 "Товары в пути"
&НаКлиенте
Процедура смартДопРасходыВнесены(Команда)
	смартДопРасходыВнесеныСервер(Элементы.СписокДокументыПоступления.ВыделенныеСтроки);
	Элементы.СписокДокументыПоступления.Обновить();
КонецПроцедуры	

//Смарт Фролов+ по заявке № 221 "Товары в пути"
&НаСервереБезКонтекста
Процедура смартДопРасходыВнесеныСервер(Знач МассивДокументов)	
	Ответственный=Пользователи.ТекущийПользователь();
	Для Каждого Док Из МассивДокументов Цикл 
		смартСервер.ИзменитьДополнительноеСвойство(Док, "смартОтветственныйЗаДопРасходы", Ответственный);
		смартСервер.ИзменитьДополнительноеСвойство(Док, "смартДопРасходыВнесены", Истина);
	КонецЦикла; 
КонецПроцедуры
// Фролов-

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаОповещения")
Процедура смарт_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = ЭтотОбъект;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "СписокДокументыПоступления";
	ПараметрыОповещенияЭДО.ЕстьОбработчикОбновленияВидимостиСостоянияЭДО = Истина;
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// ЭлектронноеВзаимодействие.БизнесСеть
	БизнесСетьКлиент.ОбновитьИнформациюОНовыхДокументахВСервисе(ЭтотОбъект, ИмяСобытия);
	// Конец ЭлектронноеВзаимодействие.БизнесСеть  
	
	#Вставка
	//Смарт Фролов+ по заявке № 221 "Товары в пути"
	Если ИмяСобытия="Запись_ПоступлениеТоваров" Тогда 
		Элементы.СписокДокументыПоступления.Обновить();
	КонецЕсли;
	// //Смарт Фролов- по заявке № 221 "Товары в пути"
	#КонецВставки

КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

#КонецОбласти