
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = Параметры.Макет;
	
	Если Параметры.Свойство("КодОшибки") Тогда
		КодОшибки = Параметры.КодОшибки;
		Секция = Макет.ПолучитьОбласть("Ошибка"+Строка(КодОшибки));
		ТабличныйДокумент.Вывести(Секция);
	Иначе
		Секция = Макет.ПолучитьОбласть("Ошибка0");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка1");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка2");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка3");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка4");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка5");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка6");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка7");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка8");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка9");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка11");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка12");
		ТабличныйДокумент.Вывести(Секция);
		Секция = Макет.ПолучитьОбласть("Ошибка13");
		ТабличныйДокумент.Вывести(Секция);
	КонецЕсли;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

#КонецОбласти
