
&После("НоменклатураОбработкаПолученияДанныхВыбора")
Процедура смарт_НоменклатураОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//++ смарт:ММ #044 224 24.05.2020
	Если ДанныеВыбора.Количество() = 0 Тогда
		
		// Получим структуру возможных полей отбора справочника номенклатуры
		СтруктураРеквизитов = ЗначениеНастроекПовтИсп.РеквизитыСправочника("Номенклатура");
		
		Запрос        = Новый Запрос;
		СтрокаПоиска  = Параметры.СтрокаПоиска;
		УсловиеОтбора = "ИСТИНА";
		
		Для Каждого КлючИЗначениеОтбора Из Параметры.Отбор Цикл
			Если СтруктураРеквизитов.Свойство(КлючИЗначениеОтбора.Ключ) Тогда
				УсловиеОтбора = УсловиеОтбора + "
				|	И СпрНоменклатура." + КлючИЗначениеОтбора.Ключ + " В (&" + КлючИЗначениеОтбора.Ключ + ")";
				Запрос.УстановитьПараметр(КлючИЗначениеОтбора.Ключ,КлючИЗначениеОтбора.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Параметры.Отбор.Свойство("ЭтоГруппа") И Параметры.Свойство("ВыборГруппИЭлементов") Тогда
			Если Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы Тогда
				УсловиеОтбора = УсловиеОтбора + "
				|	И СпрНоменклатура.ЭтоГруппа";
			ИначеЕсли Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
				УсловиеОтбора = УсловиеОтбора + "
				|	И НЕ СпрНоменклатура.ЭтоГруппа";
			КонецЕсли;
		КонецЕсли;
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	СпрНоменклатура.Ссылка,
		|	СпрНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	СпрНоменклатура.Артикул КАК ПредставлениеСовпадения,
		|	СпрНоменклатура.Качество.Порядок КАК Качество,
		|	0 КАК Порядок,
		|	СпрНоменклатура.Наименование КАК ПредставлениеНоменклатуры,
		|	NULL КАК ЭтоГруппа
		|ПОМЕСТИТЬ НоменклатураПоиск
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.Артикул ПОДОБНО &СтрокаПоиска
		|	И &УсловиеОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураПоиск.Ссылка,
		|	МИНИМУМ(НоменклатураПоиск.Порядок) КАК Порядок
		|ПОМЕСТИТЬ НоменклатураПоПорядку
		|ИЗ
		|	НоменклатураПоиск КАК НоменклатураПоиск
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураПоиск.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
		|	НоменклатураПоиск.Качество КАК Качество,
		|	НоменклатураПоиск.ПометкаУдаления КАК ПометкаУдаления,
		|	НоменклатураПоиск.Ссылка КАК Ссылка,
		|	НоменклатураПоиск.Порядок КАК Порядок,
		|	НоменклатураПоиск.ПредставлениеСовпадения КАК ПредставлениеСовпадения,
		|	НоменклатураПоиск.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		|ИЗ
		|	НоменклатураПоПорядку КАК НоменклатураПоПорядку
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПоиск КАК НоменклатураПоиск
		|		ПО НоменклатураПоПорядку.Ссылка = НоменклатураПоиск.Ссылка
		|			И НоменклатураПоПорядку.Порядок = НоменклатураПоиск.Порядок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Качество,
		|	ПредставлениеСовпадения,
		|	ПредставлениеНоменклатуры";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора" ,УсловиеОтбора);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстЗначения = СокрП(Выборка.ПредставлениеСовпадения) + " (" + Выборка.ПредставлениеНоменклатуры + ")";
			
			ЗначениеСписка = Новый Структура;
			ЗначениеСписка.Вставить("Значение", Выборка.Ссылка);
			ЗначениеСписка.Вставить("ПометкаУдаления", Выборка.ПометкаУдаления);
			
			ДанныеВыбора.Добавить(ЗначениеСписка, ТекстЗначения);
			
		КонецЦикла;
	КонецЕсли;
	//-- смарт:ММ 24.05.2020
	
КонецПроцедуры
