
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ВидСвойств") И Параметры.Отбор.Свойство("НаборСвойств") тогда
	ИначеЕсли Параметры.Отбор.Свойство("НаборСвойств") тогда
		Элементы.НаборСвойств.Видимость=Ложь;
	КонецЕсли;
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:27:14 задача 552
	Если Параметры.РежимВыбора Тогда
		КомандаПеренестиФильтр= Команды.Добавить("Выбрать");
		КомандаПеренестиФильтр.Действие = "смарт_Выбрать";
		КомандаПеренестиФильтр.Заголовок = "Выбрать";
		
		Кнопка = Элементы.Добавить("Выбрать", Тип("КнопкаФормы"),);
		Кнопка.Заголовок = "Выбрать";
		Кнопка.ИмяКоманды = "Выбрать";
	КонецЕсли; 
	//Смарт }Подкин Алексей Иванович 09.08.2021 19:27:14
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:27:37 задача 552
&НаКлиенте
Процедура смарт_Выбрать()
	Закрыть(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры
