#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//++ #1305 смарт: Ермаков 11.10.2023 // Отчет Стоимость использования оборудования
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Если в регистре есть запись с той же номенклатурой, но с другим оборудованием - отказываем
	Запрос = Новый Запрос;               
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", ЭтотОбъект.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.ОборудованиеКлиентов КАК ОборудованиеКлиентов, 
	|	Таблица.СопоставлениеСТоваром КАК СопоставлениеСТоваром
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.СопоставлениеСТоваром	
	|;
	|ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура, 
	|	Таблица.ОборудованиеКлиентов КАК ОборудованиеКлиентовЗаписываемый, 
	|	Регистр.ОборудованиеКлиентов КАК ОборудованиеКлиентовСуществующий
	|ИЗ  
	|	Таблица КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК Регистр
	|	ПО
	|		Регистр.Номенклатура = Таблица.Номенклатура
	|		И Регистр.СопоставлениеСТоваром = ИСТИНА
	|		И НЕ Регистр.ОборудованиеКлиентов = Таблица.ОборудованиеКлиентов 
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		ТекстСообщения = "Запись отклонена. Существуют некорректные связи номенклатуры и оборудования." + Символы.ПС;
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = ТекстСообщения + "Попытка записи связи:
											  | - Номенклатура:	" + Строка(Выборка.Номенклатура) + " 
											  | - Оборудование:	" + Строка(Выборка.ОборудованиеКлиентовЗаписываемый) + "
											  |
											  |Существующая связь:
											  | - Номенклатура:	" + Строка(Выборка.Номенклатура) + "
											  | - Оборудование:	" + Строка(Выборка.ОборудованиеКлиентовСуществующий) + "ы
											  |--------------------------------------------------------------------------------------
											  |
											  |";											  
			
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли;

	//++#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов  
	Если НЕ Отказ Тогда
		
		АвторИзменения = Пользователи.АвторизованныйПользователь();
		ДатаИзменения  = ТекущаяДата();
		
		Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
		
			СтрокаНабораЗаписей.АвторИзменения = АвторИзменения;
			СтрокаНабораЗаписей.ДатаИзменения  = ДатаИзменения;
		
		КонецЦикла;
		
	КонецЕсли;	
	//--#1741 смарт: Лопато 03.04.2024

КонецПроцедуры
//-- #1305 смарт: Ермаков 11.10.2023 // Отчет Стоимость использования оборудования
#КонецОбласти

#КонецЕсли

