
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьТипДляПоручения(ТипОбъекта)
	
	Возврат Метаданные.ОбщиеКоманды.CRM_СоздатьПоручение.ТипПараметраКоманды.СодержитТип(ТипОбъекта)
				ИЛИ Метаданные.БизнесПроцессы.Задание.ВводитсяНаОсновании.Содержит(Метаданные.НайтиПоТипу(ТипОбъекта));
	
КонецФункции	

Процедура ПередДобавлениемКомандСоздатьНаОсновании(КомандыСозданияНаОсновании, Параметры, СтандартнаяОбработка) Экспорт
	
	ИмяФормы = Параметры.ИмяФормы;
	МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормы,".");
	
	Попытка
	    ТипОбъекта = Тип(МассивПолей[0] + "Ссылка." + МассивПолей[1]);
	Исключение
		ТипОбъекта = Неопределено;
	КонецПопытки;
	
	Если НЕ ТипОбъекта = Неопределено Тогда
		
	   Если СтрНайти(МассивПолей[1], "CRM_") = 0 И ПроверитьТипДляПоручения(ТипОбъекта) Тогда
	       
	    	Если ПравоДоступа("Добавление", Метаданные.БизнесПроцессы.CRM_БизнесПроцесс) Тогда
				КомандаСозданияНаОсновании = КомандыСозданияНаОсновании.Добавить();
				КомандаСозданияНаОсновании.Обработчик = "CRM_БизнесПроцессыИЗадачиКлиент.СоздатьПоручение";
				КомандаСозданияНаОсновании.Идентификатор = "CRM_СоздатьПоручениеНаОсновании";
				КомандаСозданияНаОсновании.Представление = НСтр("ru = 'Поручение (задание)'");
				Если Параметры.ВидВРег = "ДОКУМЕНТ" Тогда
					МетаданныеДокумента = Метаданные.Документы[МассивПолей[1]];
					Если МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
						КомандаСозданияНаОсновании.РежимЗаписи = "Записывать";	
					Иначе	
						КомандаСозданияНаОсновании.РежимЗаписи = "Проводить";					
					КонецЕсли;					
				Иначе
					КомандаСозданияНаОсновании.РежимЗаписи = "Записывать";
				КонецЕсли;				
				КомандаСозданияНаОсновании.ФункциональныеОпции = "ИспользоватьБизнесПроцессыИЗадачи";
			   	КомандаСозданияНаОсновании.Картинка = БиблиотекаКартинок.CRM_НазначитьЗадание;
				КомандаСозданияНаОсновании.Порядок = 1;
	    	КонецЕсли;
	    	
	    КонецЕсли;
		
		Если ТипОбъекта = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
			
			//КомандаЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
			//
			//// заполним команду в соответствии с заполнением типовых команд
			//Если ЗначениеЗаполнено(КомандаЭлектронноеПисьмо) Тогда
			//	КомандаЭлектронноеПисьмо.ТипПараметра = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту");
			//	КомандаЭлектронноеПисьмо.ИмяФормы = "ФормаОбъекта";
			//	КомандаЭлектронноеПисьмо.ИмяПараметраФормы = "Основание";
			//КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 