
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадачиИКонтрольныеТочки 	= Истина;
	ОтветственныхПроектаИЭтапов = Истина;
	ТолькоОтветственныхЗадач 	= Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Выбрать(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОтветственныхПроектаИЭтапов", ОтветственныхПроектаИЭтапов);
	СтруктураПараметров.Вставить("ЗадачиИКонтрольныеТочки", ЗадачиИКонтрольныеТочки);
	СтруктураПараметров.Вставить("ВсехУчастниковЗадач", ВсехУчастниковЗадач);
	СтруктураПараметров.Вставить("ТолькоОтветственныхЗадач", ТолькоОтветственныхЗадач);
	СтруктураПараметров.Вставить("ЧекЛисты", ЧекЛисты);
	СтруктураПараметров.Вставить("КонтекстыФайловЗадач", КонтекстыФайловЗадач);
	Закрыть(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиИКонтрольныеТочкиПриИзменении(Элемент)
	Элементы.ГруппаЗависитОтЗадач.Доступность = ЗадачиИКонтрольныеТочки;
	Если НЕ ЗадачиИКонтрольныеТочки Тогда
		ВсехУчастниковЗадач = Ложь;
		ТолькоОтветственныхЗадач = Ложь;
		ЧекЛисты = Ложь;
		КонтекстыФайловЗадач = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтветственныхЗадачПриИзменении(Элемент)
	Если ТолькоОтветственныхЗадач Тогда
		ВсехУчастниковЗадач = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсехУчастниковЗадачПриИзменении(Элемент)
	Если ВсехУчастниковЗадач Тогда
		ТолькоОтветственныхЗадач = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
