
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
//++ #Б-2306 смарт: Фролов 18.03.2025 //Доработать механизм распределения Лидов для Татарстана и Башкирии
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	#Вставка
	//++ #Б-2306 смарт: Фролов 19.03.2025 //Доработать механизм распределения Лидов для Татарстана и Башкирии
	ЭлементТаблицаМенеджеры = Элементы.Добавить("смартМенежеры", Тип("ТаблицаФормы"), ЭтаФорма);
	ЭлементТаблицаМенеджеры.Заголовок = "Менеджеры";
	ЭлементТаблицаМенеджеры.ПутьКДанным = "Объект.смартМенежеры"; 
	
	НовыйЭлемент = Элементы.Добавить("Менеджер", Тип("ПолеФормы"), ЭлементТаблицаМенеджеры);
	НовыйЭлемент.Заголовок = "Менеджер";
	НовыйЭлемент.ПутьКДанным = "Объект.смартМенежеры.Менеджер";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//-- #Б-2306 смарт: Фролов 19.03.2025
	#КонецВставки
	
КонецПроцедуры //-- #Б-2306 смарт: Фролов 18.03.2025

#КонецОбласти