
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Параметры.Документ;
	
	ОписаниеОшибки = Справочники.ИСМППрисоединенныеФайлы.ТекстОшибкиИзПротокола(Параметры.Документ);
	
	Если ЗначениеЗаполнено(Параметры.ОписаниеОшибки) Тогда
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС;
		КонецЕсли;
		ОписаниеОшибки = ОписаниеОшибки + Параметры.ОписаниеОшибки;
	КонецЕсли;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
