
////////////////////////////////////////////////////////////
// Модуль смартОбеспечение предназначен для 
// хранения процедур и функций, связанных с обеспечением 
// 	потребностей, резервами и подобным
// Примеры:
//  - управление обеспечением заказов товарами
//	- переопределение резервов
//	- и подобное
// 
// Модуль создал - Ермаков, 08.05.2024
////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти