#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПеренесеноСДоработками

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	НеобходимаИнициализация = Истина;
	
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда  
		
		#Вставка
		//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
		
		//Богус++
		Если ДанныеЗаполнения.Свойство("ТоварыКЗаказу") Тогда
			смарт_ЗаполнитьДокументНаОснованииОтчета(ДанныеЗаполнения);
		Иначе
		//Богус--
		
		//-- #1671 смарт: Мосолов 18.03.2024
		#КонецВставки
		
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);  
		
	#Вставка
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
		
		//Богус++	
		КонецЕсли;
        //Богус--
	// Фролов+
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.смартПредзаказПоставщику") Тогда
		смарт_ЗаполнитьДокументНаОснованииПредзаказа(ДанныеЗаполнения);
	// Фролов-	
	
	//-- #1671 смарт: Мосолов 18.03.2024
	#КонецВставки
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Партнеры") Тогда
		
		ЗаполнитьДокументНаОснованииПартнера(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
		
		ЗаполнитьДокументНаОснованииСоглашенияСПоставщиком(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ЗаполнитьДокументНаОснованииДоговора(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда
		
		ЗаполнитьДокументНаОснованииСделки(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ЗаполнитьДокументНаОснованииЗаказа(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		ЗаполнитьДокументНаОснованииЗаявкиНаВозврат(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		ЗаполнитьДокументНаОснованииЗаказаНаПеремещение(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		
		ЗаполнитьДокументНаОснованииЗаказаНаВнутреннееПотребление(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		ЗаполнитьДокументНаОснованииЗаказаНаСборку(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИзменениеАссортимента") Тогда
		
		ИнициализироватьДокумент(ДанныеЗаполнения);
		НеобходимаИнициализация = Ложь;
		ЗаполнитьДокументНаОснованииИзмененияАссортимента(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.КоммерческоеПредложениеПоставщика") Тогда
		
		ЗаполнитьДокументНаОснованииКоммерческогоПредложенияПоставщика(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	Если НеобходимаИнициализация Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", НалогообложениеНДС, Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПорядокОплаты) Тогда
		ВалютаОплаты  = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(ФормаОплаты, БанковскийСчет, Касса);
		ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(Валюта, НалогообложениеНДС, ВалютаОплаты);
	КонецЕсли;
	
	Если НЕ ТипДанныхЗаполнения = Тип("Структура") Тогда
		СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Склад);
		СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Склад, СкладГруппа, Товары, Ложь);
	КонецЕсли;
	
	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДанныхЗаполнения);
	Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
			ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.смартЗапчастиГарантийные;
		КонецЕсли;
	КонецЕсли;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	
	//++ #Б-1458 смарт: Лопато 12.02.2025 //Заполнение поля Желаемая дата поступления в документе Заказ поставщику  
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(ЖелаемаяДатаПоступления, Груз);
	//-- #Б-1458 смарт: Лопато 12.02.2025
	//++ #Б3634 смарт: Шляпников 26.06.2025 / Проставлять галочку в поле "Поступление одной датой" автоматически 
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(ДатаПоступления, Груз);
	//-- #Б3634 смарт: Шляпников 26.06.2025
	#КонецВставки
	
КонецПроцедуры  //-- #1671 смарт: Мосолов 18.03.2024

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ЗаказПоставщику.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗаказыСервер.ОтразитьЗаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);

	ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьДвижениеТоваров(ДополнительныеСвойства, Движения, Отказ);

	ВзаиморасчетыСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);

	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьОбеспечениеЗаказовРаботами(ДополнительныеСвойства, Движения, Отказ);

	Ценообразование.ОтразитьЦеныНоменклатурыПоставщика(ДополнительныеСвойства, Движения, Отказ);
	
	#Вставка 
	//++#1894 смарт: Лопато 09.07.2024 //Процент выполнения предзаказа
	смартСервер.ОтразитьПредзаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);
	смартСервер.ОтразитьГрузыКОформлению(ДополнительныеСвойства, Движения, Отказ);
	//--#1894 смарт: Лопато 09.07.2024
	
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	смартСборкаРазборкаОборудованияСервер.ОтразитьОборудованиеКРазборке(ДополнительныеСвойства, Движения, Отказ);
	//-- #Б2138 смарт: Шляпников 19.02.2025
	#КонецВставки

	СформироватьСписокРегистровДляКонтроля();

	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);

	РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостояниеЗаказа(Ссылка, Отказ);

	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);

	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

	ЗакупкиСервер.ВыполнитьКонтрольЗаказаПослеПроведения(Ссылка, Отказ); 
	
	#Вставка 
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ,, Ссылка);
	КонецЕсли;
	//-- #Б2138 смарт: Шляпников 19.02.2025

	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
	Если Не Отказ 
		И Не РольДоступна("ПолныеПрава") 
		И Не Ссылка.смартПроводитьДокументПриВысокомСПАРКРиске 
		И Не Ссылка.Контрагент.смартНеПроверятьРиски 
		Тогда
		
		ПроверитьКонтрагентаПоРискам(Отказ); 
		
	КонецЕсли;

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.смартПредзаказПоставщику") Или ВТабличнойЧастиТоварыЕстьПредзаказы() Тогда 
		
		//++#1894 смарт: Лопато 09.07.2024 //Процент выполнения предзаказа
		//ДобавитьДвиженияПоПредзаказам(); 
		//--#1894 смарт: Лопато 09.07.2024
		
		//++ #1769 смарт: Мосолов 18.05.2024 // Доделать Предзаказы
		смартСервер.ВыполнитьКонтрольЗаказаПоставщикуПоПредзаказамПослеПроведения(Ссылка, Отказ); 
		//-- #1769 смарт: Мосолов 18.05.2024 
		
	КонецЕсли;
	
	//++ #1812 смарт: Ермаков 08.05.2024 / Проблема с авторезервированием 
	Если ДополнительныеСвойства.Свойство("смартДатаПоступленияИзменена")
		И ДополнительныеСвойства.смартДатаПоступленияИзменена = Истина 
		Тогда
		
		смартОбеспечение.РезервыКДатеПерестроитьОтгрузки(ЭтотОбъект, Отказ);	
		
	Иначе
		
		Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатков") тогда
			смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ, Истина);
		КонецЕсли;
		
	КонецЕсли;
    //-- #1812 смарт: Ермаков 08.05.2024	
	//-- #1671 смарт: Мосолов 18.03.2024 
	
	//++ #Б2766 смарт: Шляпников 24.03.2025 / Заявка на разборку оборудования. Заказ на перемещение.
	СформироватьЗаказНаПеремещениеПриНеобходимости();
	//-- #Б2766 смарт: Шляпников 24.03.2025
	
	#КонецВставки

КонецПроцедуры //-- #1671 смарт: Мосолов 18.03.2024

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)

	Статус                  = Перечисления.СтатусыЗаказовПоставщикам.ПустаяСсылка();
	ЖелаемаяДатаПоступления = Дата(1,1,1);
	ДатаПоступления         = Дата(1,1,1);
	ДатаСогласования        = Дата(1,1,1);
	МаксимальныйКодСтроки   = 0;
	Согласован              = Ложь;
	НомерПоДаннымПоставщика = "";
	ДатаПоДаннымПоставщика  = Дата(1,1,1);
	ДокументОснование       = Неопределено;
	СостояниеЗаполненияМногооборотнойТары = Перечисления.СостоянияЗаполненияМногооборотнойТары.ПустаяСсылка();
	// ИнтеграцияГИСМ
	ЕстьКиЗГИСМ             = Ложь;
	// Конец ИнтеграцияГИСМ

	Если ЗначениеЗаполнено(Соглашение) Тогда
		УсловияЗакупок = ЗакупкиСервер.ПолучитьУсловияЗакупок(Соглашение, Истина);
		Если ЗначениеЗаполнено(УсловияЗакупок.СрокПоставки) Тогда
			ДатаДокумента = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
			ЖелаемаяДатаПоступления = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаДокумента, Перечисления.Периодичность.День, УсловияЗакупок.СрокПоставки) + 1;
		КонецЕсли;
	КонецЕсли;

	Для Каждого СтрокаТЧ Из Товары Цикл

		СтрокаТЧ.КодСтроки       = 0;
		СтрокаТЧ.ДатаПоступления = Дата(1,1,1);
		СтрокаТЧ.Отменено = Ложь;
		СтрокаТЧ.ПричинаОтмены = Справочники.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка();

	КонецЦикла;

	ИнициализироватьДокумент();

	ЭтотОбъект.ЗаполнитьЭтапыГрафикаОплаты();
	
	#Вставка 
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
	
	// Фролов+
	ДокументОснование = ?(ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.смартПредзаказПоставщику"), Неопределено, ДокументОснование);
	ТЗ = Товары.Выгрузить();
	ТЗ.ЗаполнитьЗначения(ПредопределенноеЗначение("Документ.смартПредзаказПоставщику.ПустаяСсылка"), "смартПредзаказПоставщику");
	Товары.Загрузить(ТЗ);
	// Фролов-
   
    //++ смарт:Подкин #1038 27.05.2022 16:21:45
     Если ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
        ЭтотОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();  
        ЭтотОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
    КонецЕсли;
    //-- смарт:Подкин #1038 27.05.2022 16:21:45    
	
 	//-- #1671 смарт: Мосолов 18.03.2024 
	
	//++ #Б-1458 смарт: Лопато 12.02.2025 //Заполнение поля Желаемая дата поступления в документе Заказ поставщику  
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(ЖелаемаяДатаПоступления, Груз);
	//-- #Б-1458 смарт: Лопато 12.02.2025
	//++ #Б3634 смарт: Шляпников 26.06.2025 / Проставлять галочку в поле "Поступление одной датой" автоматически 
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(ДатаПоступления, Груз);
	//-- #Б3634 смарт: Шляпников 26.06.2025
	#КонецВставки

КонецПроцедуры //-- #1671 смарт: Мосолов 18.03.2024

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если (ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи)
		И Не ЗакупкиСервер.ЭтоХозяйственнаяОперацияРаздельнойЗакупки(ХозяйственнаяОперация)
		И (Не ЗначениеЗаполнено(Соглашение)
		Или Не ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов")) Тогда

		МассивНепроверяемыхРеквизитов.Добавить("Договор");

	КонецЕсли;

	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);

	// Срок действия заказа должен быть не меньше даты документа
	Если Статус = Перечисления.СтатусыЗаказовПоставщикам.НеСогласован И
		ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда

		ТекстОшибки = НСтр("ru='Дата согласования должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата, "ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаСогласования",
		,
		Отказ);

	КонецЕсли;

	ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ЭтотОбъект, "Товары", "Отменено");

	Если Не ПоступлениеОднойДатой ИЛИ 
		ПоступлениеОднойДатой И 
		НЕ(Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Или
		Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт) 
		ИЛИ ПоступлениеОднойДатой И ВсеСтрокиОтменены Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПоступления");

	КонецЕсли;

	// Желаемая дата поступления в шапке должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ЖелаемаяДатаПоступления) И ЖелаемаяДатаПоступления < НачалоДня(Дата) Тогда

		ТекстОшибки = НСтр("ru='Желаемая дата поступления должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ЖелаемаяДатаПоступления",
		,
		Отказ);

	КонецЕсли;

	// Дата поступления в шапке должна быть не меньше даты документа
	Если ПоступлениеОднойДатой И 
		ЗначениеЗаполнено(ДатаПоступления) И 
		ДатаПоступления < НачалоДня(Дата)
		И НЕ ВсеСтрокиОтменены Тогда

		ТекстОшибки = НСтр("ru='Дата поступления должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаПоступления",
		,
		Отказ);

	КонецЕсли;

	НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(ВариантПриемкиТоваров);

	ИспользуетсяНеотфактурованнаяПоставка = ПолучитьФункциональнуюОпцию("ИспользоватьНеотфактурованныеПоставки");
	ИспользуетсяНеотфактурованнаяПоставка = ИспользуетсяНеотфактурованнаяПоставка
	И ?(ЗначениеЗаполнено(Договор),
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВариантОформленияЗакупок") = Перечисления.ВариантыОформленияЗакупок.НеотфактурованныеПоставки,
	Ложь);

	Если НакладнаяЯвляетсяРаспоряжением
		И ИспользуетсяНеотфактурованнаяПоставка Тогда

		ОперацииНеотфактурованнойПоставки = Новый Массив();
		ОперацииНеотфактурованнойПоставки.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
		ОперацииНеотфактурованнойПоставки.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка);
		ОперацииНеотфактурованнойПоставки.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
		ОперацииНеотфактурованнойПоставки.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка);

		Если ОперацииНеотфактурованнойПоставки.Найти(ХозяйственнаяОперация) <> Неопределено Тогда

			ТекстОшибки = НСтр("ru='Использование варианта приемки ""по накладным"" не поддерживается для операций неотфактурованной поставки.
			|Рекомендуется использовать вариант приемки по соглашениям или по заказам.'");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			,
			,
			Отказ);
		КонецЕсли;

	КонецЕсли;

	МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаОтмены");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаПоступления");

	// Вспомогательные реквизиты для проверки учета НДС
	ПоФактИспользованию			= (ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию);
	ИзДокумента					= Перечисления.ВариантыРаздельногоУчетаНДС.ИзДокумента;
	НаНаправленияДеятельности	= Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности;
	ПартионныйУчетВключен		= РасчетСебестоимостиПовтИсп.ПартионныйУчетВключен(НачалоМесяца(Дата));
	ИспользоватьДоходыРасходы	= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов");

	СоответствиеКодовСтрок = Новый Соответствие;

	Для ТекИндекс = 0 По Товары.Количество()-1 Цикл

		АдресОшибки = " " + НСтр("ru='в строке %НомерСтроки% списка ""Товары""'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Товары[ТекИндекс].НомерСтроки);

		// Дата поступления в тч Товары обязательна к заполнению только для заказов в 
		// статусах Подтвержден, КПоступлению, Закрыт.
		Если Не ПоступлениеОднойДатой
			И (Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден
			Или Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт)
			И Не Товары[ТекИндекс].Отменено
			И Не ЗначениеЗаполнено(Товары[ТекИндекс].ДатаПоступления) Тогда

			ТекстОшибки = НСтр("ru='Не заполнена колонка ""Дата поступления""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ДатаПоступления"),
			,
			Отказ);

		КонецЕсли;

		// Дата поступления в тч Товары должна быть не меньше даты документа
		Если Не ПоступлениеОднойДатой И ЗначениеЗаполнено(Товары[ТекИндекс].ДатаПоступления) И Товары[ТекИндекс].ДатаПоступления < НачалоДня(Дата) Тогда

			ТекстОшибки = НСтр("ru='Дата поступления должна быть не меньше даты документа %Дата%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ДатаПоступления"),
			,
			Отказ);

		КонецЕсли;

		// Причина отмены обязательна для заполнения в строках без признака Отменено
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовПоставщикам")
			И Товары[ТекИндекс].Отменено
			И Не ЗначениеЗаполнено(Товары[ТекИндекс].ПричинаОтмены) Тогда

			ТекстОшибки = НСтр("ru='Необходимо указать причину отмены'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ПричинаОтмены"),
			,
			Отказ);

		КонецЕсли;

		// Статья расходов не должна ссылаться на налогообложение в документе закупки,
		// если у организации включено налогообложение по факт. использованию.
		Если ПартионныйУчетВключен
			И ПоФактИспользованию
			И Не Товары[ТекИндекс].Отменено
			И ЗначениеЗаполнено(Товары[ТекИндекс].СтатьяРасходов) Тогда

			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Товары[ТекИндекс].СтатьяРасходов,
			"ВариантРаздельногоУчетаНДС, ВариантРаспределенияРасходовРегл");

			Если (Реквизиты.ВариантРаспределенияРасходовРегл = НаНаправленияДеятельности
				)
				И Реквизиты.ВариантРаздельногоУчетаНДС = ИзДокумента Тогда

				ТекстОшибки = НСтр("ru='При использовании учета НДС по фактическому использованию, у статьи расходов должен быть выбран раздельный учет НДС по расходам: ""НДС распределяется по видам налогообложения пропорционально выручке""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "СтатьяРасходов"),
				,
				Отказ);

			КонецЕсли;

		КонецЕсли;

		Если Не ЗначениеЗаполнено(Товары[ТекИндекс].СтатьяРасходов) И Товары[ТекИндекс].СписатьНаРасходы И ИспользоватьДоходыРасходы Тогда

			ТекстОшибки = НСтр("ru='Не заполнено поле ""Статья расходов""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "СтатьяРасходов"),
			,
			Отказ);

		КонецЕсли;

		ЗаказыСервер.ПроверитьДублиКодовСтрокВТаблице(ЭтотОбъект,
		Товары[ТекИндекс].КодСтроки,
		Товары[ТекИндекс].НомерСтроки,
		СоответствиеКодовСтрок,
		Отказ);

	КонецЦикла;

	МассивНепроверяемыхРеквизитов.Добавить("Товары.Подразделение");
	ТипыНоменклатуры = Новый Массив;
	ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	ТекстОшибки = НСтр("ru='Не указан получатель работ (услуг) в строке %1 списка Товары'");
	ЗапасыСервер.ПроверитьЗаполнениеПодразделенияВТабличнойЧасти(ЭтотОбъект, Товары, ТипыНоменклатуры, ТекстОшибки, Отказ);

	// Проверим корректность заполнения этапов графика оплаты

	Если ЗначениеЗаполнено(Дата) Тогда
		ДатаДокумента = НачалоДня(Дата);
	КонецЕсли;

	ПорядокРасчетовПоДокументу = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);

	ГрафикИсполненияВДоговоре = Ложь;
	Если ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
		И ЗначениеЗаполнено(Договор) Тогда
		ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
	КонецЕсли;

	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
		И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи
		И ПорядокРасчетовПоДокументу <> Перечисления.ПорядокРасчетов.ПоНакладным
		И Не ГрафикИсполненияВДоговоре Тогда

		СуммаЗаказанныхСтрок = ПолучитьСуммуЗаказанныхСтрок();
		СуммаЗалоговойТары = ПолучитьСуммуЗаказанныхСтрок(Истина);

		ЗакупкиСервер.ПроверитьКорректностьЭтаповГрафикаОплаты(
		ЭтотОбъект,
		СуммаЗаказанныхСтрок,
		СуммаЗалоговойТары,
		Истина,
		Отказ,
		Истина);

	КонецЕсли;

	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;

	Документы.ЗаказПоставщику.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
	МассивВсехРеквизитов,
	МассивРеквизитовОперации,
	МассивНепроверяемыхРеквизитов);

	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
	ЭтотОбъект,
	Новый Структура("Товары"),
	МассивНепроверяемыхРеквизитов,
	Отказ);

	ДоставкаТоваров.ПроверитьЗаполнениеРеквизитовДоставки(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);

	Если ЗначениеЗаполнено(НаправлениеДеятельности) 
		ИЛИ НЕ НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(ХозяйственнаяОперация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаправлениеДеятельности");
	КонецЕсли;

	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным И НЕ ЗначениеЗаполнено(ПорядокОплаты) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокОплаты");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	ПроверитьИзменениеХозяйственнойОперации(Отказ);

	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;

	ЗакупкиСервер.ПроверитьКорректностьЗаполненияДокументаЗакупки(ЭтотОбъект, Отказ);

	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполнениеДокументаПоНалогообложениюНДСЗакупки();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	УчетНДСУП.ПроверитьЗаполнениеДокументаЗакупкиПоНалогообложениюНДС(ЭтотОбъект, НалогообложениеНДС, ПараметрыПроверки, Отказ);

	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(ЭтотОбъект, ЗакупкаПодДеятельность, ПараметрыПроверки, Отказ);
	
	#Вставка 
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
	
	// Фролов+
	Если Не РольДоступна("ПолныеПрава") Тогда 
		
		ПроверяемыеРеквизиты.Добавить("НомерПоДаннымПоставщика");
		ПроверяемыеРеквизиты.Добавить("ДатаПоДаннымПоставщика"); 
		
	КонецЕсли;
	// Фролов-
	
 	//-- #1671 смарт: Мосолов 18.03.2024 
	
	//++ #Б4036 смарт: Шляпников 14.08.2025 / Оприходование з/ч без документов основания в 1С УТ РФ
	Если НЕ Отказ Тогда
		Для каждого стрТовары Из Товары Цикл
			Если НЕ смартСервер.ПроверитьДоступностьНоменклатурыКПродажеИЗакупке(стрТовары.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Номенклатура %1 недоступна для продажи и закупки", стрТовары.Номенклатура),,,, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-- #Б4036 смарт: Шляпников 14.08.2025
	#КонецВставки
	
КонецПроцедуры //-- #1671 смарт: Мосолов 18.03.2024

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");

	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов     = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Документы.ЗаказПоставщику.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
	ЭтотОбъект,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);

	Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи
		Или Не ВернутьМногооборотнуюТару)
		И ТребуетсяЗалогЗаТару Тогда
		ТребуетсяЗалогЗаТару = Ложь;
	КонецЕсли;

	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();
	ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);

	ГрафикИсполненияВДоговоре = Ложь;
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
		И ЗначениеЗаполнено(Договор) Тогда
		ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
	КонецЕсли;

	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	КонецЕсли;	

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи
		Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
		Или ГрафикИсполненияВДоговоре Тогда

		ЭтапыГрафикаОплаты.Очистить();
		СуммаАвансаДоПодтверждения = 0;
		СуммаПредоплатыДоПоступления = 0;

	Иначе

		Если Не ТребуетсяЗалогЗаТару Тогда
			Для Каждого ЭтапОплаты Из ЭтапыГрафикаОплаты Цикл
				ЭтапОплаты.СуммаЗалогаЗаТару = 0;
			КонецЦикла;
		КонецЕсли;

		ТаблицаЭтапов = ЭтапыГрафикаОплаты.Выгрузить(, "ВариантОплаты, СуммаПлатежа, СуммаЗалогаЗаТару");
		ТаблицаЭтапов.Свернуть("ВариантОплаты", "СуммаПлатежа,СуммаЗалогаЗаТару");

		СтрокаАвансаДоПодтверждения = ТаблицаЭтапов.Найти(Перечисления.ВариантыОплатыПоставщику.АвансДоПодтверждения,"ВариантОплаты");

		Если СтрокаАвансаДоПодтверждения = Неопределено Тогда
			СуммаАвансаДоПодтверждения = 0;
		Иначе
			СуммаАвансаДоПодтверждения = СтрокаАвансаДоПодтверждения.СуммаПлатежа + СтрокаАвансаДоПодтверждения.СуммаЗалогаЗаТару;
		КонецЕсли;

		СтрокаПредоплатыДоПоступления = ТаблицаЭтапов.Найти(Перечисления.ВариантыОплатыПоставщику.ПредоплатаДоПоступления,"ВариантОплаты");

		Если СтрокаПредоплатыДоПоступления = Неопределено Тогда
			СуммаПредоплатыДоПоступления = 0;
		Иначе
			СуммаПредоплатыДоПоступления = СтрокаПредоплатыДоПоступления.СуммаПлатежа + СтрокаПредоплатыДоПоступления.СуммаЗалогаЗаТару;
		КонецЕсли;
	КонецЕсли;

	НоваяДатаПоступления = Дата(1,1,1);

	Если Товары.Количество() > 0 Тогда

		Если Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован
			ИЛИ Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден
			ИЛИ Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт Тогда

			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Отменено", Ложь);
			ПодтвержденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);

			Если ПодтвержденныеСтроки.Количество() > 0 Тогда

				ТаблицаПодтвержденныхСтрок = Товары.Выгрузить(ПодтвержденныеСтроки, "ДатаПоступления");
				ТаблицаПодтвержденныхСтрок.Сортировать("ДатаПоступления Возр");
				НоваяДатаПоступления = ТаблицаПодтвержденныхСтрок[0].ДатаПоступления;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ДатаПервогоПоступления = НоваяДатаПоступления;

	ДокументСогласован = Согласован;

	ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиДокумента(
	ЭтотОбъект,
	РежимЗаписи,
	Перечисления.СтатусыЗаказовПоставщикам.НеСогласован);

	// Установим дату согласования, если документ согласован
	Если Не ДокументСогласован И Согласован Тогда
		ДатаСогласования = ТекущаяДатаСеанса();
	КонецЕсли;

	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизитыФормыОплаты(ЭтотОбъект, ФормаОплаты);

	ОперацииИмпорта = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ОперацииВСтранахЕАЭС = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);

	ОперацияНеОблагаетсяНДС = (ОперацииИмпорта.Найти(ХозяйственнаяОперация) <> Неопределено
	Или ОперацииВСтранахЕАЭС.Найти(ХозяйственнаяОперация) <> Неопределено);

	Если ОперацияНеОблагаетсяНДС Тогда
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	КонецЕсли;

	НоменклатураПартнеровСервер.ЗаполнитьНоменклатуруПартнераПоНоменклатуреВТаблице(Товары, Партнер);

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураПартнеровСервер.ЗаполнитьПустоеСопоставлениеВНоменклатуреПартнераПоНоменклатуреИБ(Товары, Отказ);
	КонецЕсли;

	ЕстьНазначение = Ложь;
	Если Товары.Количество() > 0 Тогда
		Если Товары.Количество() <> Товары.НайтиСтроки(Новый Структура("Назначение", Справочники.Назначения.ПустаяСсылка())).Количество() Тогда
			ЕстьНазначение = Истина;
		КонецЕсли;
	КонецЕсли;
	// ИнтеграцияГИСМ
	ЕстьКиЗГИСМ = ИнтеграцияГИСМ_УТ.ЕстьКиЗГИСМ(Товары);
	// Конец ИнтеграцияГИСМ     
	
	#Вставка 
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
	
	//++ смарт:КМД #2_4 327 14.12.2020
	//перенесено из предыдущей разработки
	//++ смарт:ММ #059 327 02.08.2020 - Перенос даты резерва, спр. Грузы 
  
    //++ смарт:Подкин #1134 15.08.2022 16:39:54
	Если ПометкаУдаления И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда 
		
		Для каждого Стр Из Товары Цикл
			
        	Стр.Отменено = Истина;
            Стр.ПричинаОтмены = Справочники.ПричиныОтменыЗаказовПоставщикам.НайтиПоНаименованию("Мы изменили заказ");
			
		КонецЦикла;    
		
        Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт; 
		
    КонецЕсли;
     //-- смарт:Подкин #1134 15.08.2022 17:21:52
    
	//++ смарт:ММ #086 362 17.12.2020
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Если НЕ ЗначениеЗаполнено(Ссылка) ИЛИ НЕ Ссылка.Проведен Тогда 
			
			ДополнительныеСвойства.Вставить("смартПроводитсяВпервые", Истина);  
			
		КонецЕсли;  
		
	КонецЕсли;
	//++ смарт:ММ #086 362 17.12.2020\

	//++ #Б-1458 смарт: Лопато 12.02.2025 //Заполнение поля Желаемая дата поступления в документе Заказ поставщику  
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(ЖелаемаяДатаПоступления, Груз);
	//-- #Б-1458 смарт: Лопато 12.02.2025
	//++ #Б3634 смарт: Шляпников 26.06.2025 / Проставлять галочку в поле "Поступление одной датой" автоматически 
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(ДатаПоступления, Груз);
	//-- #Б3634 смарт: Шляпников 26.06.2025
	
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 26.01.2021 16:16:31 задача 434
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда 
		
		Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден; 
		
		Если Товары.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(ЖелаемаяДатаПоступления) И ЖелаемаяДатаПоступления >= Дата Тогда 
				
				ДатаПоступления = ЖелаемаяДатаПоступления;
				
			Иначе
				
				ДатаПоступления = ТекущаяДатаСеанса(); 
				
			КонецЕсли;  
			
			Для Каждого Товар Из Товары Цикл 
				
				Товар.ДатаПоступления = ДатаПоступления; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли;
	//Смарт }Подкин Алексей Иванович 26.01.2021 16:16:31
	
	
	//++ смарт:ММ #092 389 18.01.2021 - Конструктор оборудования
	Если НЕ Отказ Тогда	 
		
		Если ДополнительныеСвойства.Свойство("смартМассивСкидокДляИзменения") Тогда 
			
			смартМассивСкидокДляИзменения = ДополнительныеСвойства.смартМассивСкидокДляИзменения; 
			
			УстановитьПривилегированныйРежим(Истина); 
			
			Для Каждого Скидка Из смартМассивСкидокДляИзменения Цикл 
				
				Если НЕ Скидка.Использована Тогда
					
					СкидкаНаЗакупкуОбъект = Скидка.ПолучитьОбъект();
					СкидкаНаЗакупкуОбъект.Использована = Истина;
					СкидкаНаЗакупкуОбъект.Записать(); 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			УстановитьПривилегированныйРежим(Ложь); 
			
		КонецЕсли; 
		
	КонецЕсли;
	//-- смарт:ММ 18.01.2021
			
	//++ #1812 смарт: Ермаков 08.05.2024 / Проблема с авторезервированием 
	смартОбеспечение.РезервыКДатеНастроитьПараметры(ЭтотОбъект);
	//-- #1812 смарт: Ермаков 08.05.2024
	
	//++ смарт:КМД #2_4 327 24.12.2020
	//сбор таблицы для проверки отрицательных остатков
	Если ДополнительныеСвойства.Свойство("смартНеПроверятьДоступныеОстаткиПланируемыхПоступлений") = Ложь тогда
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Склад КАК Склад
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Склад,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика";
		
		ТаблицаДляПроверкиОтрицательныхОстатков = Запрос.Выполнить().Выгрузить();
		
		ДополнительныеСвойства.Вставить("смартТаблицаДляПроверкиОтрицательныхОстатков", ТаблицаДляПроверкиОтрицательныхОстатков);
		
	КонецЕсли;
	//-- смарт:КМД #2_4 327 24.12.2020
	
     //++ смарт:Подкин #1038 27.05.2022 21:26:34
    //++#1298 смарт: Лопато 09.01.2023 //Нет возможности поменять р/с в Заказе клиента  
	Если ЭтоНовый() Тогда  
		
		//--#1298 смарт: Лопато 09.01.2023
		смартУстановкаРС();
		//++#1298 смарт: Лопато 09.01.2023 //Нет возможности поменять р/с в Заказе клиента  
		
	КонецЕсли;
	//--#1298 смарт: Лопато 09.01.2023
    //-- смарт:Подкин #1038 27.05.2022 21:26:34 
    //-- смарт:ММ 02.08.2020
	
 	//-- #1671 смарт: Мосолов 18.03.2024 
	#КонецВставки
	
КонецПроцедуры //-- #1671 смарт: Мосолов 18.03.2024

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура смарт_ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);

	РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостояниеЗаказа(Ссылка, Отказ, Истина);

	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);

	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ, Истина, Ссылка);
	КонецЕсли;
	//-- #Б2138 смарт: Шляпников 19.02.2025
	
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику   
	
	//++ смарт:КМД #2_4 327 24.12.2020
	Если ДополнительныеСвойства.Свойство("смартТаблицаДляПроверкиОтрицательныхОстатков") тогда 
		
		//проверка на возникновение отрицательных остатков по регистру ДоступныеОстаткиПланируемыхПоступлений при пометке на удаление и отмене проведения
		//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
		смартПроверитьВозникновениеОтрицательныхОстатков(ДополнительныеСвойства.смартТаблицаДляПроверкиОтрицательныхОстатков, Отказ);
		//-- #1333 смарт: Фролов 28.03.2023 
		
    КонецЕсли;         
	
 	//-- #1671 смарт: Мосолов 18.03.2024 
	#КонецВставки
	
КонецПроцедуры //-- #1671 смарт: Мосолов 18.03.2024

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не Отказ
		И Не ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		РегистрыСведений.РеестрДокументов.ИнициализироватьИЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	КонецЕсли;  
	
	#Вставка
	//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику   
	
	//++ смарт:Подкин #1134 16.08.2022 11:14:11
	Если (ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
		ИЛИ (ПометкаУдаления  
			И Ссылка.ПометкаУдаления <> ПометкаУдаления) 
		И НЕ Справочники.смартПредопределенныеЗначения.ЗаказПоставщикуРезервыНаСкладе.Значение = Неопределено 
		И Справочники.смартПредопределенныеЗначения.ЗаказПоставщикуРезервыНаСкладе.Значение 
		Тогда      
		
		смартСдвинутьЗаказы(ЭтотОбъект.Ссылка); 
		
	КонецЕсли;   
	//-- смарт:Подкин #1134 16.08.2022 11:14:11  
	
	//-- #1671 смарт: Мосолов 18.03.2024 
	#КонецВставки

КонецПроцедуры //-- #1671 смарт: Мосолов 18.03.2024

&ИзменениеИКонтроль("СформироватьСписокРегистровДляКонтроля")
Процедура смарт_СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		Массив.Добавить(Движения.ЗаказыПоставщикам);
	КонецЕсли;

	Массив.Добавить(Движения.ОбеспечениеЗаказов);
	Массив.Добавить(Движения.ОбеспечениеЗаказовРаботами);
	#Вставка
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	Массив.Добавить(Движения.смартОборудованиеКРазборке);
	//-- #Б2138 смарт: Шляпников 19.02.2025
	#КонецВставки

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Фролов+
Функция ВТабличнойЧастиТоварыЕстьПредзаказы()
	Таб=Товары.Выгрузить(,"смартПредзаказПоставщику");
	Таб.Свернуть("смартПредзаказПоставщику");
	Для Каждого Стр Из Таб Цикл 
		Если ЗначениеЗаполнено(Стр.смартПредзаказПоставщику) Тогда 
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;	
	Возврат Ложь;
КонецФункции

Процедура ПроверитьКонтрагентаПоРискам(Отказ)
	
	Если Ссылка.Контрагент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
		
		//++ смарт:ММ #067 348 03.09.2020 - Исправление ошибки проверки ОП в СПАРК риски
		//ИндексыРисков=СПАРКРиски.ИндексыСПАРККонтрагента(Ссылка.Контрагент);
		
		КонтрагентДляПроверки = Ссылка.Контрагент;
		ВыполнятьПроверку = Истина;
		
		Если Ссылка.Контрагент.ОбособленноеПодразделение Тогда
			
			ГоловнойКонтрагент = Ссылка.Контрагент.ГоловнойКонтрагент;
			
			Если НЕ ГоловнойКонтрагент.смартНеПроверятьРиски
				И ГоловнойКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				КонтрагентДляПроверки = ГоловнойКонтрагент;
			Иначе
				ВыполнятьПроверку = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыполнятьПроверку Тогда
			
			//ВидКонтрагента из регистра СвойстваКонтрагентовСПАРКРиски
			ВидКонтрагентаДляПроверки = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентовСПАРКРиски.ЮридическоеЛицо"); //по умолчанию
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Контрагент", КонтрагентДляПроверки);
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СвойстваКонтрагентовСПАРКРиски.ВидКонтрагента КАК ВидКонтрагента
			|ИЗ
			|	РегистрСведений.СвойстваКонтрагентовСПАРКРиски КАК СвойстваКонтрагентовСПАРКРиски
			|ГДЕ
			|	СвойстваКонтрагентовСПАРКРиски.Контрагент = &Контрагент
			|";       
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				
				ВидКонтрагентаДляПроверки = Выборка.ВидКонтрагента;
			КонецЕсли;

			ИндексыРисков = СПАРКРиски.ИндексыСПАРККонтрагента(КонтрагентДляПроверки, ВидКонтрагентаДляПроверки);
		//-- смарт:ММ 03.09.2020
		
		Если ИндексыРисков.СводныйИндикатор<=0 
			Или ИндексыРисков.СводныйИндикаторГрадация=ПредопределенноеЗначение("Перечисление.ГрадацияИндексовСПАРКРиски.Высокий") Тогда 
			Текст=НСтр("ru = 'Документ не может быть проведен!
			|У контрагента высокая степень риска.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		//++ смарт:ММ #067 348 03.09.2020 - Исправление ошибки проверки ОП в СПАРК риски
		КонецЕсли;
		//-- смарт:ММ 03.09.2020
	КонецЕсли;
КонецПроцедуры
// Фролов-

//++ смарт:Подкин #1038 27.05.2022 12:27:43
&НаСервере
Процедура смартУстановкаРС() 
    
    Если (ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте 
        ИЛИ ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВВалюте)
        И НЕ ЭтотОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка()
        И ЭтотОбъект.Договор.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка() Тогда
        ЭтотОбъект.БанковскийСчет=Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация,ЭтотОбъект.Валюта);
    ИначеЕсли (ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях 
        ИЛИ ЭтотОбъект.ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях)
        И ЭтотОбъект.Договор.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка() Тогда
        ЭтотОбъект.БанковскийСчет=Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ЭтотОбъект.Организация); 
    КонецЕсли;
     
КонецПроцедуры //-- смарт:Подкин #1038 27.05.2022 12:27:43

//++ смарт:КМД #2_4 327 14.12.2020
Функция смарт_НайтиОтрицательныйОстатокДоступныеОстаткиПланируемыхПоступлений(Номенклатура, Характеристика, Склад)
	ОтрицательныйОстаток = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ДоступныеОстаткиПланируемыхПоступлений.Количество) КАК Количество
	|ИЗ
	|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ДоступныеОстаткиПланируемыхПоступлений
	|ГДЕ
	|	ДоступныеОстаткиПланируемыхПоступлений.Номенклатура = &Номенклатура
	|	И ДоступныеОстаткиПланируемыхПоступлений.Характеристика = &Характеристика
	|	И ДоступныеОстаткиПланируемыхПоступлений.Склад = &Склад
	|	И ДоступныеОстаткиПланируемыхПоступлений.Количество < 0
	|	И ДоступныеОстаткиПланируемыхПоступлений.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.Количество) тогда
			ОтрицательныйОстаток = Выборка.Количество;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтрицательныйОстаток;

КонецФункции

//++ смарт:КМД #2_4 327 14.12.2020
Функция смарт_ПолучитьМассивТиповСдвинутьДокументы()
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаСборку"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"));
	
	Возврат Массив;
КонецФункции

//++ смарт:КМД #2_4 327 14.12.2020
//++ смарт:ММ #059 327 05.10.2020 - Перенос даты резерва, спр. Грузы 
Функция ПолучитьНомерВерсииПоследний(СсылкаНаОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Максимум(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВерсииОбъектов.Объект";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.НомерВерсии;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 05.10.2020

//++ смарт:Подкин #1134 15.08.2022 17:26:45
&НаСервере
Процедура смартСдвинутьЗаказы(СсылкаДок) 
    
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);  
    МассивТиповДокументов = смарт_ПолучитьМассивТиповСдвинутьДокументы();
    Док=ЭтотОбъект.Ссылка;
    ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартФоновыеПроцессы.смартУдалениеПроведенияЗаказовКлиента",
    Новый Структура("МассивТиповДокументов, Док", МассивТиповДокументов, Док ),ПараметрыВыполнения);
    
КонецПроцедуры //-- смарт:Подкин #1134 15.08.2022 17:26:45

//++ #1333 смарт: Фролов 28.03.2023 //Перестал работать контроль остатков резерва к дате (по задаче 327)  
Функция смартПроверитьВозникновениеОтрицательныхОстатков(смартТаблицаДляПроверкиОтрицательныхОстатков,Отказ,ПриПроведении=Ложь)
	Запрос=Новый Запрос;	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|			ВходящиеДанные.Номенклатура КАК Номенклатура,
	|			ВходящиеДанные.Характеристика КАК Характеристика,
	|			ВходящиеДанные.Склад КАК Склад,
	|			ВходящиеДанные.Количество КАК Количество
	|		ПОМЕСТИТЬ ВТТовары
	|		ИЗ
	|			&ВТДанные КАК ВходящиеДанные
	|		;
    |
	|		////////////////////////////////////////////////////////////////////////////////
	|		ВЫБРАТЬ
	|			Набор.Номенклатура КАК Номенклатура,
	|			Набор.Характеристика КАК Характеристика,
	|			Набор.Склад КАК Склад,
	|			СУММА(Набор.Количество) КАК Количество
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГрафикПоступленияТоваровОбороты.Номенклатура КАК Номенклатура,
	|				ГрафикПоступленияТоваровОбороты.Характеристика КАК Характеристика,
	|				ГрафикПоступленияТоваровОбороты.Склад КАК Склад,
	|				СУММА(ГрафикПоступленияТоваровОбороты.КоличествоИзЗаказовПриход) КАК Количество
	|			ИЗ
	|				РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						(Номенклатура, Характеристика, Склад) В
	|							(ВЫБРАТЬ
	|								Отбор.Номенклатура КАК Номенклатура,
	|								Отбор.Характеристика КАК Характеристика,
	|								Отбор.Склад КАК Склад
	|							ИЗ
	|								ВтТовары КАК Отбор)) КАК ГрафикПоступленияТоваровОбороты
	|			ГДЕ
	|				НЕ ГрафикПоступленияТоваровОбороты.Регистратор = &Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикПоступленияТоваровОбороты.Номенклатура,
	|				ГрафикПоступленияТоваровОбороты.Характеристика,
	|				ГрафикПоступленияТоваровОбороты.Склад
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ГрафикОтгрузкиТоваровОбороты.Номенклатура,
	|				ГрафикОтгрузкиТоваровОбороты.Характеристика,
	|				ГрафикОтгрузкиТоваровОбороты.Склад,
	|				СУММА(-1 * ГрафикОтгрузкиТоваровОбороты.КоличествоИзЗаказовПриход)
	|			ИЗ
	|				РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|						,
	|						,
	|						Регистратор,
	|						(Номенклатура, Характеристика, Склад) В
	|							(ВЫБРАТЬ
	|								Отбор.Номенклатура КАК Номенклатура,
	|								Отбор.Характеристика КАК Характеристика,
	|								Отбор.Склад КАК Склад
	|							ИЗ
	|								ВтТовары КАК Отбор)) КАК ГрафикОтгрузкиТоваровОбороты
	|			ГДЕ
	|				НЕ ГрафикОтгрузкиТоваровОбороты.Регистратор = &Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ГрафикОтгрузкиТоваровОбороты.Номенклатура,
	|				ГрафикОтгрузкиТоваровОбороты.Склад,
	|				ГрафикОтгрузкиТоваровОбороты.Характеристика
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВТТовары.Номенклатура,
	|				ВТТовары.Характеристика,
	|				ВТТовары.Склад,
	|				СУММА(ВТТовары.Количество)
	|			ИЗ
	|				ВТТовары КАК ВТТовары
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТТовары.Номенклатура,
	|				ВТТовары.Склад,
	|				ВТТовары.Характеристика) КАК Набор
    |
	|		СГРУППИРОВАТЬ ПО
	|			Набор.Номенклатура,
	|			Набор.Характеристика,
	|			Набор.Склад
	|		ИМЕЮЩИЕ
	|		СУММА(Набор.Количество) < 0";
	Запрос.УстановитьПараметр("Регистратор",Этотобъект.Ссылка);

	смартТаблицаДляПроверкиОтрицательныхОстатков.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	Для Каждого Стр Из смартТаблицаДляПроверкиОтрицательныхОстатков Цикл 
		Количество=0;
		Если ПриПроведении Тогда
			СтрокиТовары=ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));	
			Для Каждого СтрТовары Из СтрокиТовары Цикл
				Если НЕ СтрТовары.Отменено Тогда
					Количество=Количество+СтрТовары.Количество;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		Стр.Количество=Количество;				
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("ВТДанные",смартТаблицаДляПроверкиОтрицательныхОстатков);
	Рез=Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество()>0 Тогда
		Отказ = Истина;
		Если ПриПроведении тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По плану отгрузки товара возникают отрицательные остатки: ");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По плану отгрузки товара возникают отрицательные остатки при отмене проведения / пометке на удаление документа: ");
		КонецЕсли;
		
		Для Каждого Стр Из Рез Цикл
			ТекстОшибки = "По номенклатуре """ + Строка(Стр.Номенклатура) + """";
			Если ЗначениеЗаполнено(Стр.Характеристика) тогда
				ТекстОшибки = ТекстОшибки + "(" + Строка(Стр.Характеристика) + ")";
			КонецЕсли;
			
			ТекстОшибки = ТекстОшибки + " возникает отрицательный остаток " + Формат(Стр.Количество ) + " " + Строка(Стр.Номенклатура.ЕдиницаИзмерения) + " по складу """ + Строка(Стр.Склад) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;	
	КонецЕсли;	
КонецФункции //-- #1333 смарт: Фролов 28.03.2023 

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
//Богус++
Процедура смарт_ЗаполнитьДокументНаОснованииОтчета(ДанныеЗаполнения) Экспорт
	
	Для Каждого Строка Из ДанныеЗаполнения.ТоварыКЗаказу Цикл
		
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), Строка);
		
	КонецЦикла;
	
	ЗаполнитьУсловияЗакупокПоУмолчанию();
	НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	
	СтруктураДействий = Новый Структура;
	// Фролов+
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", НалогообложениеНДС, Дата));
	// Фролов-
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
		
КонецПроцедуры  //Богус-- //-- #1671 смарт: Мосолов 18.03.2024  

//++ #1671 смарт: Мосолов 18.03.2024 // Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаказПоставщику 
// Фролов+
Процедура смарт_ЗаполнитьДокументНаОснованииПредзаказа(ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Номер, Дата");
	
	ДокументОснование = ДанныеЗаполнения;
	Дата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предзаказ", ДанныеЗаполнения);
	Запрос.Текст =
	//++ #4020 смарт: Тимофеева 12.08.2025 / Задвоение количества товара при дублях строчек из предзаказа в заказ поставщику
	//"ВЫБРАТЬ
	//|	смартПредзаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	//|	смартПредзаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	//|	смартПредзаказПоставщикуТовары.Упаковка КАК Упаковка,
	////++ #3974 смарт: Тимофеева 06.08.2025 / Создание Заказа поставщика из Предзаказа, задвоение количества
	////|	смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток КАК КоличествоУпаковок, 
	//|	смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток КАК Количество,
	////-- #3974 смарт: Тимофеева 06.08.2025 
	//|	смартПредзаказПоставщикуТовары.ВидЦеныПоставщика КАК ВидЦеныПоставщика,
	//|	смартПредзаказПоставщикуТовары.Цена КАК Цена,
	//|	смартПредзаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	//|	смартПредзаказПоставщикуТовары.НоменклатураПартнера КАК НоменклатураПоставщика,
	////++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	//|	смартПредзаказыПоставщикамОстатки.Назначение КАК Назначение,
	////-- #Б2138 смарт: Шляпников 19.02.2025
	//|	смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику КАК смартПредзаказПоставщику
	//|ИЗ
	//|	РегистрНакопления.смартПредзаказыПоставщикам.Остатки(, ПредзаказПоставщику = &Предзаказ) КАК смартПредзаказыПоставщикамОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартПредзаказПоставщику.Товары КАК смартПредзаказПоставщикуТовары
	//|		ПО смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику = смартПредзаказПоставщикуТовары.Ссылка
	//|			И смартПредзаказыПоставщикамОстатки.Номенклатура = смартПредзаказПоставщикуТовары.Номенклатура
	//|			И смартПредзаказыПоставщикамОстатки.Характеристика = смартПредзаказПоставщикуТовары.Характеристика";
	
	"ВЫБРАТЬ
	|	смартПредзаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	смартПредзаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	смартПредзаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	смартПредзаказПоставщикуТовары.Назначение КАК Назначение,
	|	МИНИМУМ(смартПредзаказПоставщикуТовары.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(смартПредзаказПоставщикуТовары.ВидЦеныПоставщика) КАК ВидЦеныПоставщика,
	|	МИНИМУМ(смартПредзаказПоставщикуТовары.Цена) КАК Цена,
	|	МАКСИМУМ(смартПредзаказПоставщикуТовары.СтавкаНДС) КАК СтавкаНДС,
	|	МАКСИМУМ(смартПредзаказПоставщикуТовары.НоменклатураПартнера) КАК НоменклатураПартнера,
	|	МИНИМУМ(смартПредзаказПоставщикуТовары.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ТоварыПредзаказа
	|ИЗ
	|	Документ.смартПредзаказПоставщику.Товары КАК смартПредзаказПоставщикуТовары
	|ГДЕ
	|	смартПредзаказПоставщикуТовары.Ссылка = &Предзаказ
	|
	|СГРУППИРОВАТЬ ПО
	|	смартПредзаказПоставщикуТовары.Ссылка,
	|	смартПредзаказПоставщикуТовары.Номенклатура,
	|	смартПредзаказПоставщикуТовары.Характеристика,
	|	смартПредзаказПоставщикуТовары.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартПредзаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	смартПредзаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|	смартПредзаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток КАК Количество,
	|	смартПредзаказПоставщикуТовары.ВидЦеныПоставщика КАК ВидЦеныПоставщика,
	|	смартПредзаказПоставщикуТовары.Цена КАК Цена,
	|	смартПредзаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	|	смартПредзаказПоставщикуТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	смартПредзаказыПоставщикамОстатки.Назначение КАК Назначение,
	|	смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику КАК смартПредзаказПоставщику
	|ИЗ
	|	РегистрНакопления.смартПредзаказыПоставщикам.Остатки(, ПредзаказПоставщику = &Предзаказ) КАК смартПредзаказыПоставщикамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыПредзаказа КАК смартПредзаказПоставщикуТовары
	|		ПО смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику = смартПредзаказПоставщикуТовары.Ссылка
	|			И смартПредзаказыПоставщикамОстатки.Номенклатура = смартПредзаказПоставщикуТовары.Номенклатура
	|			И смартПредзаказыПоставщикамОстатки.Назначение = смартПредзаказПоставщикуТовары.Назначение
	|			И смартПредзаказыПоставщикамОстатки.Характеристика = смартПредзаказПоставщикуТовары.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартПредзаказПоставщикуТовары.НомерСтроки";
	//-- #4020 смарт: Тимофеева 12.08.2025 
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	
	СтруктураДействий = Новый Структура;
	//++ #3974 смарт: Тимофеева 06.08.2025 / Создание Заказа поставщика из Предзаказа, задвоение количества
	//СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	//-- #3974 смарт: Тимофеева 06.08.2025
	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	
	Пока РезультатЗапроса.Следующий() Цикл  
		
		СтрокаТаблицы = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатЗапроса);  
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, Неопределено);  
		
	КонецЦикла;
	
КонецПроцедуры // Фролов- //-- #1671 смарт: Мосолов 18.03.2024  

//++ #Б2766 смарт: Шляпников 24.03.2025 / Заявка на разборку оборудования. Заказ на перемещение.
Процедура СформироватьЗаказНаПеремещениеПриНеобходимости()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.Ссылка.Склад КАК СкладОтправитель,
	|	смартЗаявкаНаРазборкуОборудования.Склад КАК СкладПолучатель,
	|	&Дата КАК НачалоОтгрузки,
	|	&Дата КАК ОкончаниеПоступления,
	|	смартЗаявкаНаРазборкуОборудования.Ссылка КАК ЗаявкаНаРазборкуОборудования
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРазборкуОборудования КАК смартЗаявкаНаРазборкуОборудования
	|		ПО ЗаказПоставщикуТовары.Назначение.Заказ = смартЗаявкаНаРазборкуОборудования.Ссылка
	|			И ЗаказПоставщикуТовары.Ссылка.Склад <> смартЗаявкаНаРазборкуОборудования.Склад
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|	И ЗаказПоставщикуТовары.Назначение.смартРазобранноеОборудованиеТипНазначения = ЗНАЧЕНИЕ(Перечисление.смартТипыНазначенийРазобранногоОборудования.НаЗаменуСнятойЗапаснойЧасти)
	|ИТОГИ ПО
	|	ЗаявкаНаРазборкуОборудования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаПеремещение.Ссылка КАК Ссылка,
	|	ЗаказНаПеремещение.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	|ГДЕ
	|	НЕ ЗаказНаПеремещение.ПометкаУдаления
	|	И ЗаказНаПеремещение.смартЗаказПоставщику = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Организация", ЭтотОбъект.Организация);
	СтруктураЗаполнения.Вставить("Подразделение", ЭтотОбъект.Подразделение);
	СтруктураЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
	СтруктураЗаполнения.Вставить("Статус", Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	
	ТаблицаСуществующихЗаказов = Пакет[1].Выгрузить();
	
	ВыборкаЗаявкаНаРазборку = Пакет[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаЗаявкаНаРазборку.Следующий() Цикл
		
		СтруктураЗаполнения.Вставить("ДокументОснование", ВыборкаЗаявкаНаРазборку.ЗаявкаНаРазборкуОборудования);
		
		НайденныеСтроки = ТаблицаСуществующихЗаказов.НайтиСтроки(Новый Структура("ДокументОснование", ВыборкаЗаявкаНаРазборку.ЗаявкаНаРазборкуОборудования));
		Если НайденныеСтроки.Количество() = 0 Тогда
			ДокументЗаказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		Иначе
			ДокументЗаказ = НайденныеСтроки[0].Ссылка.ПолучитьОбъект();
			ДокументЗаказ.Товары.Очистить();
			ТаблицаСуществующихЗаказов.Удалить(НайденныеСтроки[0]);
		КонецЕсли;
		
		ВыборкаТоваров = ВыборкаЗаявкаНаРазборку.Выбрать();
		
		СтруктураЗаполнения.Вставить("Товары", ДокументЗаказ.Товары.Выгрузить());
		
		Пока ВыборкаТоваров.Следующий() Цикл
		
			СтруктураЗаполнения.Вставить("СкладОтправитель", ВыборкаТоваров.СкладОтправитель);
			СтруктураЗаполнения.Вставить("СкладПолучатель", ВыборкаТоваров.СкладПолучатель);
			
			НоваяСтрокаТовары = СтруктураЗаполнения.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, ВыборкаТоваров);
			НоваяСтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
			
		КонецЦикла;
		
		ДокументЗаказ.Заполнить(СтруктураЗаполнения);
		ДокументЗаказ.смартЗаказПоставщику = Ссылка;
		ДокументЗаказ.ДокументОснование = ВыборкаЗаявкаНаРазборку.ЗаявкаНаРазборкуОборудования;
		Если НЕ ДокументЗаказ.Ссылка.Пустая() Тогда
			ДокументЗаказ.Дата = ДокументЗаказ.Ссылка.Дата;
		КонецЕсли;
		ДокументЗаказ.Ответственный = ВыборкаЗаявкаНаРазборку.ЗаявкаНаРазборкуОборудования.Ответственный;
		ДокументЗаказ.Комментарий = "#Документ создан автоматически#";
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
	КонецЦикла;
	
	Для каждого стрЗаказ Из ТаблицаСуществующихЗаказов Цикл
		стрЗаказ.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 
	
#КонецЕсли