#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидОтображения");
	РеквзитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, СтруктураРеквизитов);
	
	Если РеквзитыВладельца.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит Тогда
		ПроверяемыеРеквизиты.Добавить("ДополнительныйРеквизит");
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	// Очистим значения данных СКД
	РеквзитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "СпособФормирования,ВидОтображения");
	Если РеквзитыВладельца.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
		СхемаКомпоновкиДанных = Неопределено;
		ХранилищеНастроекКомпоновкиДанных = Неопределено; 	
	
	КонецЕсли;	
	
	Если Не РеквзитыВладельца.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит Тогда
		ДополнительныйРеквизит = Неопределено;
	
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИнициализироватьСправочник();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьСправочник()

	Ответственный = Пользователи.ТекущийПользователь();	

КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли