
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ТекстЗапросаЦенаПродажиТовара")
Функция смарт_ТекстЗапросаЦенаПродажиТовара(СоставРазделовЗапроса)
	
	Если СоставРазделовЗапроса = Неопределено Тогда
		СоставРазделовЗапроса = Новый Массив;
	КонецЕсли;
	
	СоставРазделовЗапроса.Добавить("ЦенаПродажиТовара");
	
	Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|		КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|			ТОГДА СоглашениеТовары.ВидЦены
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|				И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|				И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|				И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL 
	|					ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|				И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеШапка.ВидЦен
	|	КОНЕЦ КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА 1
	|		КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|			ТОГДА 2
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|				И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|				И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|				И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL 
	|					ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|				И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА 4
	|	КОНЕЦ КАК Описание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА СоглашениеТовары.Упаковка
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|	КОНЕЦ КАК Упаковка,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК Коэффициент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|				ТОГДА СоглашениеТовары.Цена
	|			КОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|								И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|							ТОГДА СоглашениеТовары.ВидЦены
	|						КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|								ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|								И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|								И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|							ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
	|						КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|								ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|								И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL 
	|									ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|								И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|							ТОГДА СоглашениеШапка.ВидЦен
	|					КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатуры.Цена * ВЫБОР
	|						КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Кратность, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.Курс, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
	|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
	|										ТОГДА КурсыСрезПоследнихВалютаЦены.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены.Кратность)
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.СрокПоставки, 0) > 0
	|			ТОГДА СоглашениеТовары.СрокПоставки
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(СоглашениеЦеновыеГруппы.СрокПоставки, 0) > 0
	|					ТОГДА СоглашениеЦеновыеГруппы.СрокПоставки
	|				ИНАЧЕ СоглашениеШапка.СрокПоставки
	|			КОНЕЦ
	|	КОНЕЦ КАК СрокПоставки
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	|		ПО (СоглашениеТовары.Ссылка = &Соглашение)
	|			И (СоглашениеТовары.Номенклатура = &Номенклатура)
	|			И (СоглашениеТовары.Характеристика = &Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = &Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	|		ПО (СоглашениеЦеновыеГруппы.Ссылка = &Соглашение)
	|			И (СоглашениеЦеновыеГруппы.ЦеноваяГруппа = СправочникНоменклатура.ЦеноваяГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
	|				ВидЦены В (&ВидыЦен)
	|					И Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика) КАК ЦеныНоменклатуры
	|		ПО (ЦеныНоменклатуры.ВидЦены = ВЫБОР
	|				КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|					ТОГДА СоглашениеТовары.ВидЦены
	|				КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|						И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|						И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
	|				КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL )
	|						И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL 
	|							ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|						И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					ТОГДА СоглашениеШапка.ВидЦен
	|			КОНЕЦ)
	#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыСрезПоследнихВалютаЦены
	#КонецУдаления
	#Вставка
	//++ смарт:ММ #087 424 22.12.2020 
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыСрезПоследнихВалютаЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, ) КАК КурсыСрезПоследнихВалютаЦены
	//-- смарт:ММ 22.12.2020
	#КонецВставки
	|		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта)
	#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсыСрезПоследнихВалютаДокумента
	#КонецУдаления
	#Вставка
	//++ смарт:ММ #087 424 22.12.2020 
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсыСрезПоследнихВалютаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, Валюта = &Валюта) КАК КурсыСрезПоследнихВалютаДокумента
	//-- смарт:ММ 22.12.2020
	#КонецВставки
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СоглашениеШапка.Ссылка = &Соглашение";
	
	Текст = СтрЗаменить(Текст,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатуры.Упаковка",
		"ЦеныНоменклатуры.Номенклатура"));
		
	Возврат Текст;
	
КонецФункции

&ИзменениеИКонтроль("ПриСозданииФормыПодбораНаСервере")
Процедура смарт_ПриСозданииФормыПодбораНаСервере(Форма) Экспорт
	
	Параметры = Форма.Параметры;
	Элементы = Форма.Элементы;
	ЭтоФормаПодбораВДокументыПродажи = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыПродажи(Форма);
	ЭтоФормаПодбораВДокументыЗакупки = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыЗакупки(Форма);
	АвторизованВнешнийПользователь = ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь();
	
#Область ПолучитьЗначенияФункциональныхОпций
	
	Форма.ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	Форма.ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	Форма.ИспользоватьСтандартныйПоискПриПодбореТоваров = Константы.ИспользоватьСтандартныйПоискПриПодбореТоваров.Получить();
		
	Если ЭтоФормаПодбораВДокументыПродажи Тогда
		Форма.ИспользоватьРучныеСкидкиВПродажах = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах")
		                                          И НЕ АвторизованВнешнийПользователь;
		Форма.ИспользоватьНоменклатуруПродаваемуюСовместно = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПродаваемуюСовместно");
		Если Не Форма.РежимПодбораБезСоглашенийСКлиентами	Тогда	
			Форма.ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		КонецЕсли;
		Форма.ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения = ПолучитьФункциональнуюОпцию("ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения");
	ИначеЕсли ЭтоФормаПодбораВДокументыЗакупки Тогда
		Форма.ИспользоватьРучныеСкидкиВЗакупках = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВЗакупках");
		Форма.ИспользоватьНоменклатуруПартнеров = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров");
	КонецЕсли;
#КонецОбласти

	
#Область УстановитьСвойстваФормыПоПараметрам
	
	#Область УстановитьСкладскиеНастройкиПоПараметрам
	
	ЭтоГруппаСкладов = Справочники.Склады.ЭтоГруппа(Параметры.Склад);
	
	Если ЗначениеЗаполнено(Параметры.Склад)
		И ЭтоГруппаСкладов Тогда
		
		ЗапросПоСкладам = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка В ИЕРАРХИИ(&Склад)
		|	И Склады.ВыборГруппы В(&ВыборГруппыСкладов)
		|	И НЕ Склады.ЭтоГруппа");
		
		ВыборГруппыСкладов = Новый Массив();
		ВыборГруппыСкладов.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных);
		
		Если Не Параметры.РежимПодбораИсключитьГруппыДоступныеВЗаказах Тогда
			
			ВыборГруппыСкладов.Добавить(Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказах);
			
		КонецЕсли;
		
		
		ЗапросПоСкладам.УстановитьПараметр("Склад", Параметры.Склад);
		ЗапросПоСкладам.УстановитьПараметр("ВыборГруппыСкладов", ВыборГруппыСкладов);
		
		Форма.Склады.ЗагрузитьЗначения(ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад"));
		
	Иначе
		
		Если ЗначениеЗаполнено(Параметры.Склад) Тогда
			Форма.Склады.Добавить(Параметры.Склад);
		КонецЕсли;
		
	КонецЕсли;
	
	// Если склад не выбран, то заполнить список складов всеми разрешенными складами.
	Если Форма.Склады.Количество() = 0
		#Удаление
		И Параметры.Свойство("ОстаткиПоВсемСкладам")
		И Параметры.ОстаткиПоВсемСкладам Тогда
		#КонецУдаления
		#Вставка
		//++ смарт:ММ #072 311 14.09.2020 - Доработка подбора товаров 
		//И Параметры.Свойство("ОстаткиПоВсемСкладам")
		//И Параметры.ОстаткиПоВсемСкладам Тогда
		Тогда
		//-- смарт:ММ 14.09.2020
		#КонецВставки
		
		Форма.ОстаткиПоВсемСкладам = Истина;
		
		ЗапросПоСкладам = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		#Вставка
		//++ смарт:ММ #072 311 14.09.2020 - Доработка подбора товаров 
		|	Склады.Ссылка НЕ В (&ИсключаемыеИзОстатковСклады)
		|	И
		//-- смарт:ММ 14.09.2020
		#КонецВставки
		|	(Не Склады.ЭтоГруппа)");
		
		#Вставка
		//++ смарт:ММ #072 311 14.09.2020 - Доработка подбора товаров 
		СсылкаНаПредопределеноеЗначение = Справочники.смартПредопределенныеЗначения.СкладыИсключаемыеИзПодбораПоОстаткам;
		ИсключаемыеИзОстатковСклады = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СсылкаНаПредопределеноеЗначение);
		ЗапросПоСкладам.УстановитьПараметр("ИсключаемыеИзОстатковСклады", ИсключаемыеИзОстатковСклады);
		//-- смарт:ММ 14.09.2020
		#КонецВставки
		Форма.Склады.ЗагрузитьЗначения(ЗапросПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад"));
		
	КонецЕсли;
	
	Если Форма.Склады.Количество() = 0 Тогда
		СкладПараметр = Справочники.Склады.ПустаяСсылка();
	ИначеЕсли Форма.Склады.Количество() = 1 Тогда
		СкладПараметр = Форма.Склады[0].Значение;
	Иначе
		СкладПараметр = Форма.Склады.ВыгрузитьЗначения();
	КонецЕсли;
	
	КоличествоСкладов = Форма.Склады.Количество();
	НесколькоСкладов = (КоличествоСкладов > 1);
	
	// Заполнить список выбора доступных складов в корзине.
	Элементы.КорзинаСклад.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.КорзинаСклад, "Ссылка", Форма.Склады.ВыгрузитьЗначения());
	Элементы.КорзинаСклад.Видимость = (НесколькоСкладов И Параметры.РежимПодбораИспользоватьСкладыВТабличнойЧасти);
	
	Если КоличествоСкладов = 0 Тогда
		
		Форма.ТолькоВНаличии = Ложь;
		Форма.ОтображатьОстатки = Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Склад) Тогда 
		
		Форма.ТолькоВНаличии = Ложь;
		
	КонецЕсли;
	
	Форма.ОтображатьОстаткиНадпись = ?(Форма.ОтображатьОстатки, 
	#Удаление
	НСтр("ru = 'Подробная информация об остатках (скрыть)'"),
	НСтр("ru = 'Подробная информация об остатках (показать)'"));
	#КонецУдаления
	#Вставка
    //++ смарт:Подкин #1099 20.07.2022 11:13:25
    //НСтр("ru = 'Подробная информация об остатках (скрыть)'"),
    //НСтр("ru = 'Подробная информация об остатках (показать)'"));
    НСтр("ru = 'Подробная информация об остатках (скрыть) - Расшифровка доступности по складам'"),
    НСтр("ru = 'Подробная информация об остатках (показать) - Расшифровка доступности по складам'"));
    //-- смарт:Подкин #1099 20.07.2022 11:13:25
	#КонецВставки
	
	Элементы.КорзинаСклад.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.КорзинаСклад, "Ссылка", СкладПараметр);
	
	#КонецОбласти
	
	#Область УстановитьСвойстваФормыПодбораПоНалогообложениюНДС
		Если Параметры.Свойство("НалогообложениеНДС")
			И ЗначениеЗаполнено(Параметры.НалогообложениеНДС) Тогда
			Ограничения = УчетНДСУП.ОграничениеТоваровПоНалогообложению(Параметры.НалогообложениеНДС);
			Для Каждого Ограничение Из Ограничения Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокНоменклатура,
																						"Номенклатура." + Ограничение.Реквизит,
																						Ограничение.Значение,
																						Ограничение.ВидСравнения,
																						"ОтборПоУмолчанию",
																						Истина);
				Если Ограничение.Реквизит = "ПодакцизныйТовар" Тогда
					Элементы.ДекорацияПодакцизныйТовар.Видимость = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	#КонецОбласти
	
	Если ЭтоФормаПодбораВДокументыЗакупки Тогда
		
		#Область УстановитьСвойстваФормыПодбораВДокументыЗакупкиПоПараметрам
		
		ЗаполнитьЗначенияСвойств(Форма, Параметры,
		"Валюта, Дата, Соглашение, Партнер,
		|РежимПодбораИспользоватьСкладыВТабличнойЧасти,
		|ПроверятьЗаполнение");
		Форма.ПоставщикПартнер = Параметры.Партнер;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Параметры, "ЦенаВключаетНДС") Тогда
			Форма.Объект.ЦенаВключаетНДС = Параметры.ЦенаВключаетНДС;
		КонецЕсли;
		
		Форма.ЕстьЦеныНоменклатурыПартнеровВБудущем = ЕстьЗначенияЦенНоменклатурыПозжеДатыПодбора(Форма.Дата);
		
		Форма.Объект.Склад = Параметры.Склад;
		Форма.Объект.Соглашение = Параметры.Соглашение;
		Форма.Объект.Партнер = Параметры.Партнер;
		
		// Установить свойства элементов формы по переданным параметрам.
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.ИерархияНоменклатурыПартнера, "Владелец", Форма.ПоставщикПартнер);
		
		// Заполнить значения реквизитов формы и объекта по переданным параметрам.
		Элементы.КорзинаСклад.Видимость = Форма.РежимПодбораИспользоватьСкладыВТабличнойЧасти И (Форма.Склады.Количество() > 1);
		
		Если Не (Параметры.РежимПодбораБезКоличественныхПараметров = Неопределено) Тогда
			Форма.РежимПодбораБезКоличественныхПараметров = Параметры.РежимПодбораБезКоличественныхПараметров;
		КонецЕсли;
		
		Если Не (Параметры.РежимПодбораБезСуммовыхПараметров = Неопределено) Тогда
			Форма.РежимПодбораБезСуммовыхПараметров = Параметры.РежимПодбораБезСуммовыхПараметров;
		КонецЕсли;
		
		Если Не (Параметры.СкрыватьРучныеСкидки = Неопределено) Тогда
			Форма.СкрыватьРучныеСкидки = Параметры.СкрыватьРучныеСкидки;
		КонецЕсли;
		
		Если Не Форма.РежимПодбораБезСуммовыхПараметров И Не ЗначениеЗаполнено(Форма.Валюта)  Тогда
			ВызватьИсключение НСтр("ru = 'Параметр ""Валюта"" не заполнен.'");
		КонецЕсли;
		
		// Установить свойства элементов формы по переданным параметрам.
		Элементы.КорзинаЦена.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цена (%1)'"), Форма.Валюта);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатураПартнера, "Владелец", Параметры.Партнер, 
		ВидСравненияКомпоновкиДанных.Равно, "ОтборПоУмолчанию", ЗначениеЗаполнено(Параметры.Партнер));
		
		Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			Форма.АвтоЗаголовок = Ложь;
			Форма.Заголовок = Параметры.Заголовок;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиПеренести) Тогда
			Форма.Команды["ПеренестиВДокумент"].Заголовок = Параметры.ЗаголовокКнопкиПеренести;
			Форма.Команды["ПеренестиВДокумент"].Подсказка = Параметры.ЗаголовокКнопкиПеренести;
			Форма.Элементы.КоманднаяПанельПеренести.Ширина = 24;
		КонецЕсли;
		
		Если Параметры.РежимПодбораБезКоличественныхПараметров Тогда
			Элементы.КорзинаКоличественныеПараметры.Видимость = Ложь;
		КонецЕсли;
		
		ОтображатьОстаткиНаСкладах = Не Параметры.СкрыватьКомандуОстаткиНаСкладах И Не (Форма.Склады.Количество() = 0);
		Форма.СкрыватьКомандуОстаткиНаСкладах = Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Форма.ОтображатьОстаткиНаСкладах = ОтображатьОстаткиНаСкладах;
		
		Элементы.ОтображатьОстаткиНадпись.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.ОтображатьОстаткиНоменклатурыПоставщикаНадпись.Видимость = ОтображатьОстаткиНаСкладах;
		
		Если ПервоеОткрытиеФормы(Форма.КодФормы) Тогда
			УстановитьПараметрыДереваОтбораКачествоНовый(Форма);
			Форма.ОтображатьОстатки = Истина;
		КонецЕсли;
		
		Элементы.ОстаткиТоваров.Видимость = Форма.ОтображатьОстатки И ОтображатьОстаткиНаСкладах И Не Форма.РежимПодбораБезКоличественныхПараметров;
		Элементы.ОстаткиТоваровПоставщика.Видимость = Форма.ОтображатьОстатки И ОтображатьОстаткиНаСкладах И Не Форма.СкрыватьКомандуОстаткиНаСкладах;
		
		// Установить видимость элементов отображения остатков.
		
		Элементы.ТолькоВНаличии.Видимость = ОтображатьОстаткиНаСкладах;
		
		Элементы.СписокСтандартныйПоискНоменклатураВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискНоменклатураВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		
		Элементы.СписокСтандартныйПоискНоменклатураДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискНоменклатураДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискХарактеристикиДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискХарактеристикиДоступно.Видимость = ОтображатьОстаткиНаСкладах;
		
		// Установить видимость элементов отображения цен.
		ВидимостьЭлементовОтображенияЦен = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		
		Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокСтандартныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокРасширенныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокСтандартныйПоискНоменклатураПартнераКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		Элементы.СписокРасширенныйПоискНоменклатураПартнераКонтекстноеМенюПерейтиКЦенамНоменклатуры.Видимость = ВидимостьЭлементовОтображенияЦен;
		
		Если Параметры.РежимПодбораБезСуммовыхПараметров Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость                         = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость                       = Ложь;
			Элементы.КорзинаСумма.Видимость                                     = Ложь;
			Элементы.КорзинаЦена.Видимость                                      = Ложь;
			Элементы.СписокСтандартныйПоискНоменклатураЦена.Видимость           = Ложь;
			Элементы.СписокРасширенныйПоискНоменклатураЦена.Видимость           = Ложь;
			Элементы.СписокРасширенныйПоискХарактеристикиЦена.Видимость         = Ложь;
			Элементы.СписокСтандартныйПоискХарактеристикиЦена.Видимость         = Ложь;
			Элементы.СписокСтандартныйПоискНоменклатураПартнераЦена.Видимость = Ложь;
			Элементы.СписокРасширенныйПоискНоменклатураПартнераЦена.Видимость = Ложь;
			Элементы.ГруппаФильтрПоЦене.Видимость                               = Ложь;
			Элементы.ВидЦеныПоставщикаНоменклатура.Видимость                    = Ложь;
			Элементы.ВидЦеныПоставщика.Видимость                                = Ложь;
			Элементы.КорзинаВидЦеныПоставщика.Видимость                         = Ложь;
		КонецЕсли;
		
		Если Параметры.СкрыватьРучныеСкидки Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость = Ложь;
		КонецЕсли;
		
		Если Не (Параметры.ЗапрашиватьКоличество = Неопределено) Тогда
			Форма.ЗапрашиватьКоличество = Параметры.ЗапрашиватьКоличество;
		КонецЕсли;
		
		Элементы.ЗапрашиватьКоличествоЦену.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество;
		Элементы.ЗапрашиватьКоличествоЦену.Пометка = Форма.ЗапрашиватьКоличество;
		
		Если Не Форма.ИспользоватьНоменклатуруПартнеров Или Не ЗначениеЗаполнено(Параметры.Партнер) Тогда
			Элементы.СтраницаНоменклатураПартнера.Видимость = Ложь;
			Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			Элементы.НоменклатураПартнера.Видимость = Ложь;
		КонецЕсли;
		
		Форма.ВидНоменклатурыДоИзменения = Форма.ВидНоменклатуры;
		
		Элементы.СтраницаСоздатьНоменклатуру.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.Номенклатура);
		Элементы.СтраницаСоздатьХарактеристику.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ХарактеристикиНоменклатуры);
		
		#КонецОбласти
		
	ИначеЕсли ЭтоФормаПодбораВДокументыПродажи Тогда
		
		#Область УстановитьСвойстваФормыПодбораВДокументыПродажиПоПараметрам
		
		ПервоеОткрытиеФормы = ПервоеОткрытиеФормы(Форма.КодФормы);
		Если ПервоеОткрытиеФормы Тогда
			УстановитьПараметрыДереваОтбораКачествоНовый(Форма);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Соглашение) Тогда
			СегментНоменклатуры = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Параметры.Соглашение, "СегментНоменклатуры");
			Форма.СегментНоменклатуры = СегментНоменклатуры;
		Иначе 
			Форма.СегментНоменклатуры = Справочники.СегментыНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		Элементы.СегментНоменклатуры.Доступность = ПравоДоступа("Просмотр", Метаданные.Справочники.СегментыНоменклатуры); 
		
		Элементы.КорзинаНоменклатура.ТолькоПросмотр = Параметры.СкрыватьВыборНоменклатуры;
		
		Форма.Валюта = Параметры.Валюта;
		Форма.Дата = Параметры.Дата;
		Форма.Объект.Склад = Параметры.Склад;
		Форма.Соглашение = Параметры.Соглашение;
		Форма.Объект.Соглашение = Параметры.Соглашение;
		Форма.Объект.НалогообложениеНДС = Параметры.НалогообложениеНДС;
		Форма.Объект.ЦенаВключаетНДС = Параметры.ЦенаВключаетНДС;
		Форма.РежимПодбораИспользоватьСкладыВТабличнойЧасти = Параметры.РежимПодбораИспользоватьСкладыВТабличнойЧасти;
		Форма.ВозвращатьМногооборотнуюТару = Параметры.ВозвращатьМногооборотнуюТару;
		
		Форма.ВидЦены = Параметры.ВидЦены;
		
		Форма.РежимПодбораБезКоличественныхПараметров = Параметры.РежимПодбораБезКоличественныхПараметров;
		
		Форма.РежимПодбораБезСуммовыхПараметров = Параметры.РежимПодбораБезСуммовыхПараметров;
		
		Форма.РежимПодбораБезСоглашенийСКлиентами = Параметры.РежимПодбораБезСоглашенийСКлиентами;
		
		Форма.СкрыватьРучныеСкидки = Параметры.СкрыватьРучныеСкидки;
		
		Форма.ИспользоватьДатыОтгрузки = Параметры.ИспользоватьДатыОтгрузки;
		
		Форма.НеРазбиватьНаборыПоКомплектующим = Параметры.НеРазбиватьНаборыПоКомплектующим;
		
		Форма.ТолькоСЦенами = Параметры.ТолькоСЦенами;
		
		Форма.ВариантАнализаНоменклатурыПродаваемойСовместно = Параметры.ВариантАнализаНоменклатурыПродаваемойСовместно;
				
		Если Форма.РежимПодбораБезСуммовыхПараметров Тогда
			ВидыЦен = Новый Массив();	
		ИначеЕсли Форма.РежимОтбораПоАссортименту Тогда
			Форма.ОбъектПланированияАссортимента = АссортиментСервер.ОбъектПланирования(СкладПараметр, Форма.Дата);
			
			ОтборВидовЦен = Новый Структура;
			ОтборВидовЦен.Вставить("РазрешеныПродажи", Истина);
			
			ВидыЦен = АссортиментСервер.ВидыЦенПоАссортименту(Форма.ОбъектПланированияАссортимента, Форма.Дата, ОтборВидовЦен);
			Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен);
		ИначеЕсли Форма.РежимПодбораБезСоглашенийСКлиентами Тогда
			ВидыЦен = Новый Массив();
			ВидыЦен.Добавить(Форма.ВидЦены);
			Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен);
		ИначеЕсли Не Форма.ИспользоватьСоглашенияСКлиентами Тогда
			ВидыЦен = ВидыЦенПоУмолчанию(Форма.Объект.ЦенаВключаетНДС);
			Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен);
		Иначе
			ВидыЦен = ВидыЦенПоСоглашениюСКлиентом(Форма.Соглашение);
			Форма.ЕстьЦеныВБудущем = ЕстьЗначенияЦенПозжеДатыПодбора(Форма.Дата, ВидыЦен);
		КонецЕсли;
		
		Форма.ВидыЦен.ЗагрузитьЗначения(ВидыЦен);
		
		Если Форма.РежимПодбораБезСуммовыхПараметров Тогда
			Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен;	
		ИначеЕсли НЕ Форма.ИспользоватьСоглашенияСКлиентами
			Или Форма.РежимПодбораБезСоглашенийСКлиентами Тогда	
			Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапке;
		Иначе
			Форма.ВариантРасчетаЦен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Соглашение, "ВариантРасчетаЦен");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Форма.ВариантРасчетаЦен) Тогда
			Форма.ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Форма.ВариантАнализаНоменклатурыПродаваемойСовместно) Тогда
			Форма.ВариантАнализаНоменклатурыПродаваемойСовместно = Перечисления.ВариантыАнализаНоменклатурыПродаваемойСовместно.ОптоваяТорговля;
		КонецЕсли;
		
		Элементы.КорзинаДатаОтгрузки.Видимость = Форма.ИспользоватьДатыОтгрузки;
		
		Если Не Форма.РежимПодбораБезСуммовыхПараметров Тогда
			Если Не ЗначениеЗаполнено(Форма.Валюта) Тогда
				ВызватьИсключение НСтр("ru = 'Параметр ""Валюта"" не заполнен.'");
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.РежимПодбораБезКоличественныхПараметров Тогда
			Элементы.КорзинаКоличественныеПараметры.Видимость = Ложь;
		КонецЕсли;
		
		УстановкаЦенНоменклатуры = Ложь;
		Если Параметры.Свойство("Документ") Тогда
			Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
				УстановкаЦенНоменклатуры = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.НаправлениеДеятельности) Тогда
			Форма.ОтборПоНазначению = НаправленияДеятельностиСервер.ТолкающееНазначение(Параметры.НаправлениеДеятельности);
		КонецЕсли;
		
		ОтображатьОстаткиНаСкладах = Не Параметры.СкрыватьКомандуОстаткиНаСкладах И Не (Форма.Склады.Количество() = 0);
		Форма.СкрыватьКомандуОстаткиНаСкладах = Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Форма.ОтображатьОстаткиНаСкладах = ОтображатьОстаткиНаСкладах;
		
		Если ПервоеОткрытиеФормы Тогда
			Форма.ОтображатьОстатки = Истина;
		КонецЕсли;
		
		Элементы.ОтображатьОстаткиНадпись.Видимость = ОтображатьОстаткиНаСкладах
			И Не ЗначениеЗаполнено(Параметры.НаправлениеДеятельности)
			И (Не Форма.ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения
				Или АвторизованВнешнийПользователь);
		Элементы.ОстаткиТоваров.Видимость = Форма.ОтображатьОстатки
			И ОтображатьОстаткиНаСкладах
			И Не ЗначениеЗаполнено(Параметры.НаправлениеДеятельности)
			И (Не Форма.ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения
				Или АвторизованВнешнийПользователь);;
		
		Элементы.СписокСтандартныйПоискНоменклатураВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискНоменклатураВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискНоменклатураДоступно.Видимость = ОтображатьОстаткиНаСкладах И Не ЗначениеЗаполнено(Форма.ОтборПоНазначению);
		Элементы.СписокРасширенныйПоискНоменклатураДоступно.Видимость = ОтображатьОстаткиНаСкладах И Не ЗначениеЗаполнено(Форма.ОтборПоНазначению);
		Элементы.СписокСтандартныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокСтандартныйПоискХарактеристикиДоступно.Видимость = ОтображатьОстаткиНаСкладах И Не ЗначениеЗаполнено(Форма.ОтборПоНазначению);
		Элементы.СписокРасширенныйПоискХарактеристикиВНаличииОстаток.Видимость = Не Параметры.СкрыватьКомандуОстаткиНаСкладах;
		Элементы.СписокРасширенныйПоискХарактеристикиДоступно.Видимость = ОтображатьОстаткиНаСкладах И Не ЗначениеЗаполнено(Форма.ОтборПоНазначению);
		
		Элементы.ТолькоВНаличии.Видимость = ОтображатьОстаткиНаСкладах;
		
		Если ПраваПользователяПовтИсп.ЭтоПартнер() Тогда
			Элементы.ТолькоВНаличии.Видимость = Ложь;
		КонецЕсли;
		
		Если Параметры.РежимПодбораБезСуммовыхПараметров Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаСумма.Видимость = Ложь;
			Элементы.КорзинаЦена.Видимость = Ложь;
			Элементы.СписокСтандартныйПоискНоменклатураЦена.Видимость = Ложь;
			Элементы.СписокРасширенныйПоискНоменклатураЦена.Видимость = Ложь;
			Элементы.СписокРасширенныйПоискХарактеристикиЦена.Видимость = Ложь;
			Элементы.СписокСтандартныйПоискХарактеристикиЦена.Видимость = Ложь;
			Элементы.ГруппаФильтрПоЦене.Видимость = Ложь;
			
			Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныПоСоглашению.Видимость            = Ложь;
			Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныВыделенныхСтрокПоВидуЦен.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидку.Видимость                = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидкуВыделенныхСтрок.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюОтменитьРучныеСкидки.Видимость                 = Ложь;
		КонецЕсли;
		
		Если Параметры.СкрыватьРучныеСкидки Тогда
			Элементы.КорзинаСуммаРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаПроцентРучнойСкидки.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидку.Видимость                = Ложь;
			Элементы.КорзинаКонтекстноеМенюНазначитьРучнуюСкидкуВыделенныхСтрок.Видимость = Ложь;
			Элементы.КорзинаКонтекстноеМенюОтменитьРучныеСкидки.Видимость                 = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			Форма.АвтоЗаголовок = Ложь;
			Форма.Заголовок = Параметры.Заголовок;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиПеренести) Тогда
			Форма.Команды["ПеренестиВДокумент"].Заголовок = Параметры.ЗаголовокКнопкиПеренести;
			Форма.Команды["ПеренестиВДокумент"].Подсказка = Параметры.ЗаголовокКнопкиПеренести;
		КонецЕсли;
		
		Если Параметры.ЗапрашиватьКоличество <> Неопределено Тогда
			Форма.ЗапрашиватьКоличество = Параметры.ЗапрашиватьКоличество;
		КонецЕсли;
		
		Элементы.НеЗапрашиватьКоличество.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество И Не Форма.РежимПодбораБезСуммовыхПараметров;
		Элементы.ЗапрашиватьКоличествоЦену.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество И Не Форма.РежимПодбораБезСуммовыхПараметров;
		Элементы.ЗапрашиватьКоличество.Видимость = Не Параметры.СкрыватьКнопкуЗапрашиватьКоличество;
		
		Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.СписокРасширенныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.СписокСтандартныйПоискХарактеристикиКонтекстноеМенюЦеныНоменклатуры.Видимость = Не Параметры.СкрыватьКомандуЦеныНоменклатуры;
		Элементы.КорзинаВидЦены.Видимость = Не Параметры.СкрыватьКолонкуВидЦены;
		
		Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныПоСоглашению.Видимость            = Не Параметры.СкрыватьКолонкуВидЦены;
		Элементы.КорзинаКонтекстноеМенюЗаполнитьЦеныВыделенныхСтрокПоВидуЦен.Видимость = Не Параметры.СкрыватьКолонкуВидЦены;
		
		Элементы.КорзинаИндексСовместноПродаваемыеТовары.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПродаваемуюСовместно");
		
		Форма.ВидНоменклатурыДоИзменения = Форма.ВидНоменклатуры;
		
		Элементы.СтраницаСоздатьНоменклатуру.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.Номенклатура);
		Элементы.СтраницаСоздатьХарактеристику.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ХарактеристикиНоменклатуры);
		
		Форма.ЗапретРедактированияСоставаНабора = Параметры.ЗапретРедактированияСоставаНабора;
		Форма.ЗапретРедактированияЦеныНабора    = Параметры.ЗапретРедактированияЦеныНабора;
		
		Форма.БезОтбораПоВключениюНДСВЦену = Параметры.БезОтбораПоВключениюНДСВЦену;
		Форма.ЗапретРедактированияСоставаНабора = Параметры.ЗапретРедактированияСоставаНабора;
		Форма.ЗапретРедактированияЦеныНабора    = Параметры.ЗапретРедактированияЦеныНабора;
		
		#КонецОбласти
		
	КонецЕсли;
	
#КонецОбласти
	УстановитьЗначенияПоНастройкамФормы(Форма);
	
#Область УстановитьЗначенияПоНастройкамФормыПодбора
	
	Форма.ТолькоВНаличии = Ложь;
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Форма.КодФормы,  "");
	
	Если Не (Настройки = Неопределено) Тогда
		
		Если Настройки.Свойство("ТолькоВНаличии") Тогда
			Форма.ТолькоВНаличии = Настройки.ТолькоВНаличии И Форма.ОтображатьОстаткиНаСкладах;
		КонецЕсли;
		
		Если Форма.СкрыватьКомандуОстаткиНаСкладах Тогда
			Форма.ТолькоВНаличии = Ложь;
		КонецЕсли; 
		
		Если Настройки.Свойство("ОтображатьОстатки") Тогда
			Форма.ОтображатьОстатки = Настройки.ОтображатьОстатки;
			Форма.ОтображатьОстаткиНадпись = ?(Форма.ОтображатьОстатки,
				НСтр("ru = 'Подробная информация об остатках (скрыть)'"),
				НСтр("ru = 'Подробная информация об остатках (показать)'"));
			
			Элементы.ОстаткиТоваров.Видимость = Форма.ОтображатьОстатки
				И Не (Форма.РежимПодбораБезКоличественныхПараметров
					Или Форма.СкрыватьКомандуОстаткиНаСкладах)
				И Форма.ОтображатьОстаткиНаСкладах
				И (Не Форма.ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения
					Или АвторизованВнешнийПользователь)
				И (ЭтоФормаПодбораВДокументыЗакупки Или Не ЗначениеЗаполнено(Параметры.НаправлениеДеятельности));
			
			Если ЭтоФормаПодбораВДокументыЗакупки Тогда
				Элементы.ОстаткиТоваровПоставщика.Видимость = Форма.ОтображатьОстатки
					И Не Форма.СкрыватьКомандуОстаткиНаСкладах;
			КонецЕсли;
		КонецЕсли;
		
		Если Настройки.Свойство("ПоказыватьПодобранныеТовары") Тогда
			
			Форма.ПоказыватьПодобранныеТовары = Настройки.ПоказыватьПодобранныеТовары;
			
		КонецЕсли;
		
		Если ЭтоФормаПодбораВДокументыПродажи Тогда
			Если Настройки.Свойство("ЗапрашиватьКоличество") Тогда
				Форма.ЗапрашиватьКоличество = Настройки.ЗапрашиватьКоличество;
			Иначе
				Форма.ЗапрашиватьКоличество = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
			КонецЕсли;
			
			Если Настройки.Свойство("ЗапрашиватьЦену") Тогда
				Форма.ЗапрашиватьЦену = Настройки.ЗапрашиватьЦену;
			Иначе
				Форма.ЗапрашиватьЦену = Истина;
			КонецЕсли;
		Иначе
			Если Настройки.Свойство("ЗапрашиватьКоличество") Тогда
				Форма.ЗапрашиватьКоличество = Настройки.ЗапрашиватьКоличество;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоФормаПодбораВДокументыЗакупки Тогда
		Элементы.ЗапрашиватьКоличествоЦену.Пометка = Форма.ЗапрашиватьКоличество;
	Иначе
		Элементы.НеЗапрашиватьКоличество.Пометка = Не Форма.ЗапрашиватьКоличество;
		Элементы.ЗапрашиватьКоличество.Пометка = Форма.ЗапрашиватьКоличество И (Не Форма.ЗапрашиватьЦену Или Форма.РежимПодбораБезСуммовыхПараметров);
		Элементы.ЗапрашиватьКоличествоЦену.Пометка = Форма.ЗапрашиватьКоличество И Форма.ЗапрашиватьЦену;
	КонецЕсли;

#КонецОбласти	

	УстановитьОтборТолькоВНаличии(Форма);

	#Область УстановитьЗаголовкиЭлементовФормыПоПараметрам
	ИмяСпискаНоменклатуры = ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма);
	ИмяСпискаХарактеристик = ПодборТоваровКлиентСервер.ИмяСпискаХарактеристикПоВариантуПоиска(Форма);
		
	ТекстЗаголовка = НСтр("ru = 'Цена'");
	
	Если ЗначениеЗаполнено(Форма.Валюта) Тогда
		#Удаление
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цена (%1)'"), Форма.Валюта);
		#КонецУдаления
		#Вставка
		 //++ смарт:Подкин #984 18.04.2022 17:33:01 добавил "согл."
        ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цена (%1) согл.'"), Форма.Валюта);
        //-- смарт:Подкин #984 18.04.2022 17:33:01
		#КонецВставки
	КонецЕсли;
	
	Форма.Элементы[ИмяСпискаНоменклатуры].ПодчиненныеЭлементы[ИмяСпискаНоменклатуры+"Цена"].Заголовок = ТекстЗаголовка;
	Форма.Элементы[ИмяСпискаХарактеристик].ПодчиненныеЭлементы[ИмяСпискаХарактеристик+"Цена"].Заголовок = ТекстЗаголовка;
	
	Элементы.КорзинаЦена.Заголовок = ТекстЗаголовка;
	ВыбранаГруппаСкладов = Справочники.Склады.ЭтоГруппа(Параметры.Склад);
	
	ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		?(ВыбранаГруппаСкладов,
		НСтр("ru = 'Только в наличии на группе складов ""%1""'"),
		?(ЗначениеЗаполнено(Параметры.Склад), НСтр("ru = 'Только в наличии на складе ""%1""'"), НСтр("ru = 'Только в наличии'"))), 
		Параметры.Склад);
	
	Если Параметры.Свойство("Документ") Тогда
		Если ТипЗнч(Параметры.Документ) <> Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
			Элементы.ТолькоВНаличии.Заголовок = ТекстЗаголовка;
		КонецЕсли;
	Иначе
		Элементы.ТолькоВНаличии.Заголовок = ТекстЗаголовка;
	КонецЕсли;
#КонецОбласти

	УстановитьЭлементыСпискаЗначенийКачества(Форма);
	УстановитьОтборПоТипуНоменклатурыПоПараметрам(Форма);
	
#Область УстановитьОтборПоВариантуРасчетаЦенНаборов
	
	Если ЭтоФормаПодбораВДокументыПродажи Тогда
		
		Если Параметры.ОтборПоВариантуРасчетаЦенНаборов <> Неопределено Тогда
			ОтборПоВариантуРасчетаЦенНаборов = Параметры.ОтборПоВариантуРасчетаЦенНаборов;
			Отбор = Новый СписокЗначений;
			Отбор.ЗагрузитьЗначения(ОтборПоВариантуРасчетаЦенНаборов);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.СписокНоменклатура, "ВариантРасчетаЦеныНабора", Отбор, 
				ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоВариантуРасчетаЦенНаборов", (Отбор.Количество() > 0));
				
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.СписокХарактеристики, "ВариантРасчетаЦеныНабора", Отбор, 
				ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоВариантуРасчетаЦенНаборов", (Отбор.Количество() > 0));
		КонецЕсли;
	КонецЕсли;
	
#КонецОбласти

#Область УстановитьОтборОсобенностьУчета
	Если Параметры.Свойство("ОсобенностьУчета") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатура, "Ссылка.ОсобенностьУчета", Параметры.ОсобенностьУчета,, 
			"ОтборОсобенностьУчета",ЗначениеЗаполнено(Параметры.ОсобенностьУчета));
	КонецЕсли;

#КонецОбласти

#Область УстановитьОтборОсобенностьУчета

	Если Параметры.Свойство("КоллекцияНоменклатуры") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатура, "Ссылка.КоллекцияНоменклатуры", Параметры.КоллекцияНоменклатуры, 
			ВидСравненияКомпоновкиДанных.Равно, "ОтборКоллекцияНоменклатуры",ЗначениеЗаполнено(Параметры.КоллекцияНоменклатуры));
	КонецЕсли;

#КонецОбласти

	Форма.ТекущаяСтрокаНоменклатуры = ПодборТоваровКлиентСервер.СтруктураСтрокиНоменклатуры();
	Форма.ТекущаяСтрокаХарактеристик = ПодборТоваровКлиентСервер.СтруктураСтрокиХарактеристик();
	
	ОбщегоНазначенияУТ.ИнициализироватьРеквизитыФормыДляПолнотекстовогоПоиска(Форма, "ИспользоватьПолнотекстовыйПоискПриПодбореТоваров");
	
	УстановитьТекстыЗапросовСписковФормыПодбора(Форма);

	#Область УстановитьПараметрыСписковФормыПодбора
	
	СписокНоменклатура = Форма.СписокНоменклатура;
	СписокХарактеристики = Форма.СписокХарактеристики;
	
	Если ЭтоФормаПодбораВДокументыЗакупки Тогда
		СписокНоменклатураПартнера = Форма.СписокНоменклатураПартнера;
	КонецЕсли;
	
	Если ЭтоФормаПодбораВДокументыПродажи Тогда
					
		Если Форма.РежимОтбораПоАссортименту Тогда
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ОбъектПланирования", Форма.ОбъектПланированияАссортимента);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ОбъектПланирования", Форма.ОбъектПланированияАссортимента);
		КонецЕсли;
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "СегментНоменклатуры", Форма.СегментНоменклатуры, ЗначениеЗаполнено(Форма.СегментНоменклатуры));
		Если Форма.ИспользоватьСоглашенияСКлиентами
			И Не Форма.РежимПодбораБезСоглашенийСКлиентами Тогда
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Соглашение", Форма.Соглашение);
		КонецЕсли;
			
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Валюта", Форма.Валюта);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Дата", Форма.Дата);
		
		Если Форма.ВидыЦен.Количество() = 0 Тогда
			ВидыЦенПараметр = Справочники.ВидыЦен.ПустаяСсылка();
		ИначеЕсли Форма.ВидыЦен.Количество() = 1 Тогда
			ВидыЦенПараметр = Форма.ВидыЦен[0].Значение;
		Иначе
			ВидыЦенПараметр = Форма.ВидыЦен.ВыгрузитьЗначения();
		КонецЕсли;
			
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидыЦен", ВидыЦенПараметр);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Назначение", Форма.ОтборПоНазначению);
		
		Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "СегментНоменклатуры", Справочники.СегментыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "НоменклатураСегмента", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВладелецХарактеристик", Справочники.Номенклатура.ПустаяСсылка());
			Если Форма.ИспользоватьСоглашенияСКлиентами
				И Не Форма.РежимПодбораБезСоглашенийСКлиентами Тогда
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Соглашение", Форма.Соглашение);
			КонецЕсли;
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Валюта", Форма.Валюта);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Дата", Форма.Дата);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидыЦен", ВидыЦенПараметр);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ЦеноваяГруппа", Справочники.ЦеновыеГруппы.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Назначение", Форма.ОтборПоНазначению);
			
		КонецЕсли;
		
		Если Не ПраваПользователяПовтИсп.ЭтоПартнер() Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Склад", СкладПараметр);
			
			Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Склад", СкладПараметр);
			КонецЕсли;
			
		КонецЕсли;
				
	ИначеЕсли ЭтоФормаПодбораВДокументыЗакупки Тогда
				
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Дата", Форма.Дата);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Склад", СкладПараметр);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Валюта", Форма.Валюта);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Соглашение", Форма.Соглашение);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидЦеныПоставщика", Форма.ВидЦеныПоставщика);
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "СегментНоменклатуры", Форма.СегментНоменклатуры, ЗначениеЗаполнено(Форма.СегментНоменклатуры));
		
		Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидЦеныПоставщика", Форма.ВидЦеныПоставщика);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "СегментНоменклатуры", Форма.СегментНоменклатуры);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "НоменклатураСегмента", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Соглашение", Форма.Соглашение);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Валюта", Форма.Валюта);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Дата", Форма.Дата);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВладелецХарактеристик", Справочники.Номенклатура.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка());
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Склад", СкладПараметр);
			
		КонецЕсли;
		
		Если Форма.ИспользоватьНоменклатуруПартнеров Тогда
			
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "ВидЦеныПоставщика", Форма.ВидЦеныПоставщика);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "Соглашение", Форма.Параметры.Соглашение);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "Валюта", Форма.Параметры.Валюта);
			ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатураПартнера, "Дата", Форма.Параметры.Дата);
			
		КонецЕсли;
		
	КонецЕсли;
#КонецОбласти

	ПодборТоваровКлиентСервер.УстановитьТекущиеСтраницыПоВариантуПоиска(Форма);
	
	#Вставка
	//++#1873 смарт: Лопато 25.06.2024 //Убрать произвольную цену в помощнике продаж и подборе товара (прод 914)
	Если Элементы.Найти("КорзинаВидЦены") <> Неопределено Тогда

		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый ПараметрВыбора("ВыводитьПроизвольныйВидЦен",   Ложь));
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ИспользоватьПриПродаже", Истина));
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Статус", 				   Перечисления.СтатусыДействияВидовЦен.Действует));
	
		Элементы.КорзинаВидЦены.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	КонецЕсли;	
	//--#1873 смарт: Лопато 25.06.2024
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("УстановитьТекстыЗапросовСписковФормыПодбора")
Процедура смарт_УстановитьТекстыЗапросовСписковФормыПодбора(Форма)
	
	ЭтоФормаПодбораВДокументыЗакупки = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыЗакупки(Форма);
	
	Форма.СписокНоменклатура.ТекстЗапроса = ТекстЗапросаСпискаФормыПодбора(Форма, "СписокНоменклатура");
	
	Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
		Форма.СписокХарактеристики.ТекстЗапроса = ТекстЗапросаСпискаФормыПодбора(Форма, "СписокХарактеристики");
	КонецЕсли;
	
	Если ЭтоФормаПодбораВДокументыЗакупки И Форма.ИспользоватьНоменклатуруПартнеров Тогда
		Форма.СписокНоменклатураПартнера.ТекстЗапроса = ТекстЗапросаСпискаФормыПодбора(Форма, "СписокНоменклатураПартнера");
	КонецЕсли;
	
	#Вставка
	//++#1216 смарт: Лопато 11.10.2022 //Ошибка в форме "Подбор товара"
	Если СтрНайти(Форма.СписокНоменклатура.ТекстЗапроса, "КАК Резерв") = 0 Тогда  
		
		//++#1795 смарт: Мосолов 24.04.2024 //Исправление ошибки подбора товаров из Действие скидок (наценок) по номенклатуре
	    Если СтрНайти(Форма.СписокНоменклатура.ТекстЗапроса, "КАК РегистрНакопления.СвободныеОстатки") > 0 Тогда
		//--#1795 смарт: Мосолов 24.04.2024 
		
		Форма.СписокНоменклатура.ТекстЗапроса = СтрЗаменить(Форма.СписокНоменклатура.ТекстЗапроса," КАК Доступно"," КАК Доступно, 
	    | ВЫРАЗИТЬ((ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0)) КАК ЧИСЛО(15, 3)) КАК Резерв"); 
		
		//++#1795 смарт: Мосолов 24.04.2024 //Исправление ошибки подбора товаров из Действие скидок (наценок) по номенклатуре
		Иначе 
			
		Форма.СписокНоменклатура.ТекстЗапроса = СтрЗаменить(Форма.СписокНоменклатура.ТекстЗапроса,
			" КАК Доступно",
			" КАК Доступно, 
	    	| ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК Резерв"); 

		КонецЕсли;
		//--#1795 смарт: Мосолов 24.04.2024 
		
	КонецЕсли;	
	//--#1216 смарт: Лопато 11.10.2022
	
	//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
	Форма.СписокНоменклатура.ТекстЗапроса = РегистрыСведений.смартАналогиНоменклатуры.МодифицироватьЗапросСпискаНоменклатуры(Форма.СписокНоменклатура.ТекстЗапроса);
	//-- #Б3742 смарт: Шляпников 20.08.2025
	
	//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
	смартМаркировка.МодифицироватьФормуСпискаНоменклатуры(Форма);
	//-- #Б4670 смарт: Шляпников 21.10.2025
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ТекстЗапросаПоискаПоОбласти")
//++ #Б-1378 смарт: Фролов 19.11.2024 //Добавить в Подборщик товара, в шапку, возможность отбора
Функция смарт_ТекстЗапросаПоискаПоОбласти(ОбластьПоиска, ТочноеСоответствие)

	МаксКоличество = МаксимальноеКоличествоЭлементовПоиска() + 1;
	ТекстЗапроса = "";

	Если ОбластьПоиска = Метаданные.Справочники.Номенклатура Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
		|	СправочникНоменклатура.Ссылка КАК Значение,
		|	""Номенклатура"" КАК Метаданные
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	НЕ СправочникНоменклатура.ЭтоГруппа И
		|	(СправочникНоменклатура.Наименование %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		|			ИЛИ СправочникНоменклатура.НаименованиеПолное %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		|			ИЛИ СправочникНоменклатура.Код %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		|			ИЛИ СправочникНоменклатура.КодДляПоиска %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		#Вставка 
		//++ #Б-1378 смарт: Фролов 19.11.2024 //Добавить в Подборщик товара, в шапку, возможность отбора
		|			ИЛИ СправочникНоменклатура.Описание %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		//-- #Б-1378 смарт: Фролов 19.11.2024
		#КонецВставки
		|			ИЛИ СправочникНоменклатура.Артикул %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%)";

	КонецЕсли;

	Если ОбластьПоиска = Метаданные.Справочники.НоменклатураКонтрагентов Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %МаксКоличество%
		|	НоменклатураКонтрагентов.Ссылка КАК Значение,
		|	""НоменклатураКонтрагентов"" КАК Метаданные
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НЕ НоменклатураКонтрагентов.ЭтоГруппа И
		|	(НоменклатураКонтрагентов.Артикул %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		|		ИЛИ НоменклатураКонтрагентов.Наименование %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%)
		|	И НоменклатураКонтрагентов.Владелец = &Партнер";

	КонецЕсли;

	Если ОбластьПоиска = Метаданные.Справочники.ХарактеристикиНоменклатуры Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
		|	ХарактеристикиНоменклатуры.Ссылка КАК Значение,
		|	""ХарактеристикиНоменклатуры"" КАК Метаданные
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Наименование %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%
		|	ИЛИ ХарактеристикиНоменклатуры.НаименованиеПолное %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%";

	КонецЕсли;

	Если ОбластьПоиска = Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Значение,
		|	""ШтрихкодыНоменклатуры"" КАК Метаданные
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &СтрокаПоискаПоШтрихкоду";

	КонецЕсли;

	Если ОбластьПоиска = Метаданные.Справочники.ОбщероссийскийКлассификаторПродукции Тогда

		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
		|	ОбщероссийскийКлассификаторПродукции.Ссылка КАК Значение,
		|	""ОбщероссийскийКлассификаторПродукции"" КАК Метаданные
		|ИЗ
		|	Справочник.ОбщероссийскийКлассификаторПродукции КАК ОбщероссийскийКлассификаторПродукции
		|ГДЕ
		|	ОбщероссийскийКлассификаторПродукции.Код %ВидСравнения% &СтрокаПоиска %СПЕЦСИМВОЛ%";

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%МаксКоличество%", Формат(МаксКоличество, "ЧЦ=10; ЧГ=0"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВидСравнения%", ?(ТочноеСоответствие, "=", "ПОДОБНО"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СПЕЦСИМВОЛ%", ?(ТочноеСоответствие, "", "СПЕЦСИМВОЛ ""~"""));

	Возврат ТекстЗапроса;

КонецФункции //-- #Б-1378 смарт: Фролов 19.11.2024 

&ИзменениеИКонтроль("ТекстЗапросаСпискаФормыПодбора")
Функция смарт_ТекстЗапросаСпискаФормыПодбора(Форма, ТипСписка)

	ЭтоФормаПодбораВДокументыПродажи = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыПродажи(Форма);
	ЭтоФормаПодбораВДокументыЗакупки = ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыЗакупки(Форма);

	Если ЭтоФормаПодбораВДокументыПродажи Тогда

		ЭтоПартнер = ПраваПользователяПовтИсп.ЭтоПартнер();

		Если ТипСписка = "СписокНоменклатура" Тогда

			Если ЭтоПартнер Тогда
				ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаНоменклатурыДляВнешнихПользователей();
			ИначеЕсли Форма.РежимОтбораПоАссортименту Тогда
				ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаНоменклатурыСОтборомПоАссортименту();
			Иначе
				ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрамСоглашенияСПокупателем(Форма);
			КонецЕсли;

		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда

			Если ЭтоПартнер Тогда
				ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаХарактеристикДляВнешнихПользователей();
			ИначеЕсли Форма.РежимОтбораПоАссортименту Тогда
				ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаХарактеристикСОтборомПоАссортименту();
			Иначе
				ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаХарактеристикПоПараметрамСоглашенияСПокупателем(Форма);
			КонецЕсли;

		КонецЕсли;

	ИначеЕсли ЭтоФормаПодбораВДокументыЗакупки Тогда

		ВариантРасчетаЦенПоставщика = "ЦеныПоСоглашению";
		Если ЗначениеЗаполнено(Форма.Объект.Соглашение) Тогда
			Форма.ВидЦеныПоставщика = Форма.Объект.Соглашение.ВидЦеныПоставщика;
		Иначе
			ВариантРасчетаЦенПоставщика = "БезЦен";
		КонецЕсли;

		Если ТипСписка = "СписокНоменклатура" Тогда
			ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрамСоглашенияСПоставщиком(ВариантРасчетаЦенПоставщика);
		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
			ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаХарактеристикПоПараметрамСоглашенияСПоставщиком(ВариантРасчетаЦенПоставщика);
		ИначеЕсли ТипСписка = "СписокНоменклатураПартнера" Тогда
			ШаблонТекстЗапроса = ШаблонТекстаЗапросаСпискаНоменклатурыПартнераПоПараметрамСоглашенияСПоставщиком(ВариантРасчетаЦенПоставщика);
		КонецЕсли; 

	КонецЕсли;

	#Область ПодставитьЗначенияПараметровВШаблонТекстаЗапроса
	НесколькоСкладов = (Форма.Склады.Количество() > 1);

	Соглашение = Форма.Соглашение;
	ДатаПодбора = Форма.Дата;

	Если ЭтоФормаПодбораВДокументыПродажи Тогда

		ЕстьЦеныНоменклатурыПартнеровВБудущем = Ложь;
		ЕстьЦеныВБудущем = Форма.ЕстьЦеныВБудущем;
		НесколькоВидовЦен = Форма.ВидыЦен.Количество() > 1;
		ТолькоСЦенами = Форма.ТолькоСЦенами;
		ОтображатьОстаткиПоНазначению = ЗначениеЗаполнено(Форма.ОтборПоНазначению);
		Если Форма.ОтборПоТипуНоменклатуры.НайтиПоЗначению(Перечисления.ТипыНоменклатуры.Набор) <> Неопределено
			ИЛИ Форма.ОтборПоТипуНоменклатуры.Количество() = 0 Тогда
			ИспользоватьКомплекты = ПолучитьФункциональнуюОпцию("ИспользоватьНаборы");
		Иначе
			ИспользоватьКомплекты = Ложь;
		КонецЕсли;

	Иначе

		ЕстьЦеныНоменклатурыПартнеровВБудущем = Форма.ЕстьЦеныНоменклатурыПартнеровВБудущем;
		ЕстьЦеныВБудущем = Ложь;
		НесколькоВидовЦен = Ложь;
		ТолькоСЦенами = Ложь;
		ОтображатьОстаткиПоНазначению = Ложь;
		ИспользоватьКомплекты = Ложь;

	КонецЕсли; 

	ИспользоватьХарактеристикиНоменклатуры = Ложь;
	Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
		Если Форма.ИспользоватьФильтры
			И (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) 
			И ЗначениеЗаполнено(Форма.ВидНоменклатуры) Тогда	
			ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ВидНоменклатуры,"ИспользованиеХарактеристик");
			Если ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда	
				ИспользоватьХарактеристикиНоменклатуры = Истина;
			КонецЕсли;
		Иначе	
			ИспользоватьХарактеристикиНоменклатуры = Истина;
		КонецЕсли;	
	КонецЕсли;		

	ПараметрыЗамены = Новый Структура;
	ПараметрыЗамены.Вставить("ТипСписка",ТипСписка);
	ПараметрыЗамены.Вставить("НесколькоСкладов",НесколькоСкладов);
	ПараметрыЗамены.Вставить("НесколькоВидовЦен",НесколькоВидовЦен);
	ПараметрыЗамены.Вставить("ЕстьЦеныВБудущем",ЕстьЦеныВБудущем);
	ПараметрыЗамены.Вставить("ЕстьЦеныНоменклатурыПартнеровВБудущем", ЕстьЦеныНоменклатурыПартнеровВБудущем);
	ПараметрыЗамены.Вставить("ТолькоСЦенами",ТолькоСЦенами);
	ПараметрыЗамены.Вставить("ИспользоватьХарактеристикиНоменклатуры",ИспользоватьХарактеристикиНоменклатуры);
	ПараметрыЗамены.Вставить("ОтображатьОстаткиПоНазначению",ОтображатьОстаткиПоНазначению);
	ПараметрыЗамены.Вставить("РежимПодбораБезСуммовыхПараметров", Форма.РежимПодбораБезСуммовыхПараметров);
	ПараметрыЗамены.Вставить("ОтображатьОстаткиНаСкладах", Форма.ОтображатьОстаткиНаСкладах);
	ПараметрыЗамены.Вставить("ИспользоватьКомплекты", ИспользоватьКомплекты);

	МассивПодстрокПоиска = ПараметрыШаблонаТекстаЗапроса();

	#Вставка
	//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
	смартЗапчастиГарантийныеСуществует = Ложь;
	МассивРеквизитов = Форма.ПолучитьРеквизиты();
	
	Для каждого стрРеквизит Из МассивРеквизитов Цикл
		Если стрРеквизит.Имя = "смартЗапчастиГарантийные" Тогда
			смартЗапчастиГарантийныеСуществует = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ смартЗапчастиГарантийныеСуществует Тогда
		
		НовыйРеквизит = Новый РеквизитФормы("смартЗапчастиГарантийные", Новый ОписаниеТипов("Булево"));
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Если Форма.Параметры.Свойство("Документ") И ЗначениеЗаполнено(Форма.Параметры.Документ) Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", Форма.Параметры.Документ.Метаданные()) Тогда
				Форма.смартЗапчастиГарантийные = Форма.Параметры.Документ.смартЗапчастиГарантийные;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б1480 смарт: Шляпников 03.12.2024
	#КонецВставки
	
	Для каждого ПодстрокаПоиска Из МассивПодстрокПоиска Цикл

		#Вставка
		//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
		Если Форма.смартЗапчастиГарантийные Тогда
			ПодстрокаЗамены = смарт_ПодстрокаЗаменыПараметраШаблонаТекстаЗапросаГарантийные(ПодстрокаПоиска, ПараметрыЗамены);
			Если ПодстрокаЗамены = Неопределено Тогда
				ПодстрокаЗамены = ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса(ПодстрокаПоиска, ПараметрыЗамены);
			КонецЕсли;
		Иначе
			ПодстрокаЗамены = ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса(ПодстрокаПоиска, ПараметрыЗамены);
		КонецЕсли;
		//-- #Б1480 смарт: Шляпников 03.12.2024
		#КонецВставки
		
		#Удаление //++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
		ПодстрокаЗамены = ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса(ПодстрокаПоиска, ПараметрыЗамены);
		#КонецУдаления
		ШаблонТекстЗапроса = СтрЗаменить(ШаблонТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);

	КонецЦикла;
	#КонецОбласти	

	Возврат ШаблонТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
Процедура смартСкорректироватьЗапросПоОстаткамСУчетомФалагаГарантийныхЗапчастей(Форма) Экспорт
	
КонецПроцедуры

//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
Функция смарт_ПодстрокаЗаменыПараметраШаблонаТекстаЗапросаГарантийные(ПодстрокаПоиска, ПараметрыЗамены)
	
	ТипСписка = ПараметрыЗамены.ТипСписка;
	НесколькоСкладов = ПараметрыЗамены.НесколькоСкладов;
	НесколькоВидовЦен = ПараметрыЗамены.НесколькоВидовЦен;
	ЕстьЦеныВБудущем = ПараметрыЗамены.ЕстьЦеныВБудущем;
	ТолькоСЦенами = ПараметрыЗамены.ТолькоСЦенами;
	ИспользоватьХарактеристикиНоменклатуры = ПараметрыЗамены.ИспользоватьХарактеристикиНоменклатуры;
	ОтображатьОстаткиПоНазначению = ПараметрыЗамены.ОтображатьОстаткиПоНазначению;
	РежимПодбораБезСуммовыхПараметров = ПараметрыЗамены.РежимПодбораБезСуммовыхПараметров;
	ОтображатьОстаткиНаСкладах = ПараметрыЗамены.ОтображатьОстаткиНаСкладах;
	ЕстьЦеныНоменклатурыПартнеровВБудущем = ПараметрыЗамены.ЕстьЦеныНоменклатурыПартнеровВБудущем;
	ИспользоватьКомплекты = ПараметрыЗамены.ИспользоватьКомплекты;
	
	ПодстрокаЗамены = Неопределено;
	
	Если ПодстрокаПоиска = "{СвободныеОстаткиВНаличии}" Тогда
		
		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "0";
		Иначе
			
			Если ОтображатьОстаткиПоНазначению Тогда
				ПодстрокаЗамены = "ЕСТЬNULL(СвободныеОстатки.смартНаличиеПодЗаказГарантийныеОстаток, 0)";
			Иначе
				ПодстрокаЗамены = "ЕСТЬNULL(СвободныеОстатки.смартВНаличииГарантийныеОстаток, 0)";
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "{ВсеОстаткиДоступно}" Тогда
		
		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "0";
		Иначе
			
			Если ОтображатьОстаткиПоНазначению Тогда
				ПодстрокаЗамены = "0";
			Иначе
				ПодстрокаЗамены = "(ЕСТЬNULL(СвободныеОстатки.смартВНаличииГарантийныеОстаток, 0) - ЕСТЬNULL(СвободныеОстатки.смартВРезервеПодЗаказГарантийныеОстаток, 0) -
				|ЕСТЬNULL(СвободныеОстатки.смартВРезервеСоСкладаГарантийныеОстаток, 0) + ЕСТЬNULL(ОстаткиИзЗаказов.Количество, 0))";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПодстрокаЗамены;
	
КонецФункции
	
#КонецОбласти