
#Область ПеренесеноСДоработками

// Фролов+
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовКнопка=ЭтаФорма.Элементы.Добавить("НеОтгруженныеТовары",Тип("КнопкаФормы"),Элементы.ПодменюОтчетыСмТакже);
	НовКнопка.ИмяКоманды="НеОтгруженныеТоварыПоставщика";
	НовКнопка=ЭтаФорма.Элементы.Добавить("СоставГруза",Тип("КнопкаФормы"),Элементы.ПодменюОтчетыСмТакже);
	НовКнопка.ИмяКоманды="СоставГруза";
	
	ОтображениеДанныхПоПредзаказам();
	
	ДоступностьЭлементаГруз();
	
	//++ смарт:ММ #006 144 04.12.2019
	НастроитьВидимостьДоступностьЭлементов();
	//-- смарт:ММ 04.12.2019
	//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
	ДобавитьЭлементыПрограммно();
	//-- смарт:ММ 17.01.2021
	
	//++ #Б7206 смарт: Шляпников 30.06.2026 / Реквизит Повышенный таможенный сбор в документах Предзаказ поставщику и Заказ поставщику. Доработка.
	УстановитьУсловноеОформлениеПовышенногоТаможенногоСбора();
	//-- #Б7206 смарт: Шляпников 30.06.2026
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ТоварыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)	
	ОтображениеДанныхПоПредзаказам();
КонецПроцедуры
// Фролов-

&НаКлиенте
Процедура РасшСмарт_ТоварыКоличествоУпаковокПриИзмененииПеред(Элемент)
	
	Строка = Элементы.Товары.ТекущиеДанные;
	
	Если НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура) Тогда		
		Если Не ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка.ПолучитьИдентификатор()) Тогда 			
			ВывестиСообщениеОбОшибкеПользователю(Строка.НомерСтроки);	
		КонецЕсли;			
	КонецЕсли;
	// Фролов+
	Если ЗначениеЗаполнено(Строка.смартПредзаказПоставщику) Тогда
		Данные=Новый Структура("ПредзаказПоставщику,Номенклатура,Характеристика,Требуется,Заказано",
			   Строка.смартПредзаказПоставщику,Строка.Номенклатура,Строка.Характеристика,Строка.КоличествоУпаковок,ТоварыКешТекущейСтроки.КоличествоУпаковок);
		ДанныеПоПредзаказу=ПревышеноКоличествПоПредзаказу(Данные);
		Если ДанныеПоПредзаказу.Превышено Тогда
			Строка.КоличествоУпаковок=Макс(ДанныеПоПредзаказу.Остаток,ТоварыКешТекущейСтроки.КоличествоУпаковок);
			ПересчитатьСтроку(Строка);
			
			Стр=Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Строка,"НоменклатураПартнера,Номенклатура,Характеристика,ВидЦеныПоставщика,СтавкаНДС,Цена");
			Стр.КоличествоУпаковок=Данные.Требуется-Строка.КоличествоУпаковок;
			ПересчитатьСтроку(Стр);
		КонецЕсли;	
	КонецЕсли;
	//РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	// Фролов-
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если Не ТЧТоварыЗаполненаКорректно(Объект.Товары) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смарт_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если смартИспользуютсяКонтейнеры() Тогда
		Если Поле.ГиперссылкаЯчейки и Поле.Имя = "Контейнеры" Тогда
			СтандартнаяОбработка = Ложь;              
			ТекДанные = Элементы.Товары.ТекущиеДанные;
			ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(ТекДанные.смартКонтейнер);
			СписокКонтейнеров = смартЗаполнитьСписокНаСервере(ЗначениеДляКонтейнера);
			смартОткрытьФормуВыбораКонтейнеров(СписокКонтейнеров);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ)
	Если смартИспользуютсяКонтейнеры() Тогда
		Для Каждого СтрТовары Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(СтрТовары.смартКонтейнер) Тогда
				ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(СтрТовары.смартКонтейнер);
				СтрТовары.Контейнеры = смартОбщегоНазначения.смартКонтейнерыВСтроку(ЗначениеДляКонтейнера);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смарт_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Для Каждого СтрТовары Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(СтрТовары.смартКонтейнер) Тогда
			
			ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(СтрТовары.смартКонтейнер);
			Если СтрТовары.Свойство("Контейнеры") Тогда 
				СтрТовары.Контейнеры = смартОбщегоНазначения.смартКонтейнерыВСтроку(ЗначениеДляКонтейнера);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	//++ #Б3790 смарт: Шляпников 12.08.2025 / Маркировка радиоэлектронной продукции. Доработка документов
	смартМаркировкаКлиент.ВывестиПредупреждениеОНаличииТоваровСМаркировкой(Объект);
	//-- #Б3790 смарт: Шляпников 12.08.2025
	
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(Объект);
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
	//++ #Б6822 смарт: Шляпников 26.05.2026 / Маркировка. Приемка товара в 1С УТ РФ.
	смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСОбязательнойМаркировкой(Объект);
	//-- #Б6822 смарт: Шляпников 26.05.2026

	//++ #Б6948 смарт: Шляпников 11.06.2026 / Маркировка. Алгоритм действий системы и БП при заказе нового товара при наличии остатков на складах.
	смартМаркировкаКлиент.ВывестиСообщениеОБудущейМаркировкеНоменклатурыПоДокументу(Объект);
	//-- #Б6948 смарт: Шляпников 11.06.2026

	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023

//++#1374 смарт: Балашов 04.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смарт_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДанныхПТУ" Тогда
		
		ЭтотОбъект.Прочитать();
		СписокСтрок = Объект.Товары;
		
		Для Каждого Строка_ТЧ Из СписокСтрок Цикл
			
			ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(Строка_ТЧ.смартКонтейнер);
			//++ исправлен в рабочей базе Балашов 27.07.2023
			Если Строка_ТЧ.Свойство("Контейнеры") Тогда
				Строка_ТЧ.Контейнеры  = смартОбщегоНазначения.смартКонтейнерыВСтроку(ЗначениеДляКонтейнера);
			КонецЕсли;	
			//-- исправлен в рабочей базе Балашов 27.07.2023
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры
//--#1374 смарт: Балашов 04.07.2023

&НаКлиенте
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
Процедура смарт_ТоварыНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	#Вставка
	//++ #3942 смарт: Шляпников 01.08.2025 / Запрет выбора в документах закупки (Предзаказ, Заказ поставщика) номенклатуры из папки Архив (только запчасти!)
	Если НЕ смартСервер.ПроверитьДоступностьИспользованияНоменклатурыВДокументеЗакупки(ТекущаяСтрока.Номенклатура) Тогда
		ТекущаяСтрока.Номенклатура = Неопределено;
	КонецЕсли;
	//-- #3942 смарт: Шляпников 01.08.2025
	#КонецВставки
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
	СтруктураДействий.Вставить("ПроверитьСтатьюАналитикуРасходов", ТекущаяСтрока.Номенклатура);
	СтруктураДействий.Вставить(
		"ПроверитьЗаполнитьСклад",
		ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(
			Объект,
			СкладГруппа));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	Если ИспользоватьСоглашенияСПоставщиками И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияЗакупок", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	//
	Если КонтролироватьАссортимент Тогда
		СтруктураПроверкиАссортимента = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента();
		СтруктураПроверкиАссортимента.Ссылка = Объект.Ссылка;
		СтруктураПроверкиАссортимента.Склад = Объект.Склад;
		СтруктураПроверкиАссортимента.Дата = ?(ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления), Объект.ЖелаемаяДатаПоступления, Объект.Дата);
		СтруктураПроверкиАссортимента.ТекстСообщения = НСтр("ru = 'Товар %1 не включен в ассортимент магазина. Заказывать его не рекомендуется.'");
		СтруктураПроверкиАссортимента.ИмяРесурсаАссортимента = "РазрешеныЗакупки";
		СтруктураПроверкиАссортимента.ПровереноМожноДобавлять = Истина;
		СтруктураПроверкиАссортимента.РазрешатьДобавление = Истина;
		//
		СтруктураДействий.Вставить("ПроверитьАссортиментСтроки", СтруктураПроверкиАссортимента);
	КонецЕсли;
	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	Если ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Или
		ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Или 
		ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор")
			Или ЗначениеЗаполнено(ТекущаяСтрока.Назначение) Тогда
		ТекущаяСтрока.СписатьНаРасходы = Ложь;
		ТекущаяСтрока.СтатьяРасходов = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
		ТекущаяСтрока.АналитикаРасходов = Неопределено;
		ТекущаяСтрока.Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	ИначеЕсли ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		ТекущаяСтрока.СписатьНаРасходы = Истина;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	УстановитьПризнакЗаполненияСклада();
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработкаВыбораПодборНаСервере")
Процедура смарт_ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();

	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл

		#Вставка
		//++ #3942 смарт: Шляпников 01.08.2025 / Запрет выбора в документах закупки (Предзаказ, Заказ поставщика) номенклатуры из папки Архив (только запчасти!)
		Если НЕ смартСервер.ПроверитьДоступностьИспользованияНоменклатурыВДокументеЗакупки(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		//-- #3942 смарт: Шляпников 01.08.2025
		#КонецВставки
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "НоменклатураПартнера, Номенклатура, Характеристика, Упаковка, Склад, ВидЦеныПоставщика, Цена, КоличествоУпаковок, ПроцентРучнойСкидки");

		Если Объект.ПоступлениеОднойДатой Тогда
			ТекущаяСтрока.ДатаПоступления = Объект.ДатаПоступления;
		КонецЕсли;

		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);

		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		#Вставка
		//++ #Б-6768 смарт: Фролов 01.06.2026 //Заказ поставщику. Доработка документа.
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ПолучитьЗначенияПошлиныИТаможенногоСбора(ТекущаяСтрока.Номенклатура));
		//-- #Б-6768 смарт: Фролов 01.06.2026
		#КонецВставки

	КонецЦикла;

	Если КонтролироватьАссортимент Тогда
		АссортиментСервер.ПроверитьАссортиментТаблицыПодобранныхТоваров(Объект, "Склад", ТаблицаТоваров);
	КонецЕсли;


	СтруктураХарактеристикиНоменклатуры = Новый Структура;
	СтруктураХарактеристикиНоменклатуры.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));

	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, СтруктураХарактеристикиНоменклатуры);

	ЗаполнитьПризнакСписанияНаРасходыДляУслуг();
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПриИзмененииСкладаВТабличнойЧастиСервер();
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура смарт_УстановитьУсловноеОформление()

	ИспользоватьТоварыВПутиОтПоставщиков  = ПолучитьФункциональнуюОпцию("ИспользоватьТоварыВПутиОтПоставщиков");
	ИспользоватьНеотфактурованныеПоставки = ПолучитьФункциональнуюОпцию("ИспользоватьНеотфактурованныеПоставки");

	ХозяйственныеОперацииРаздельнойЗакупки = ХозяйственныеОперацииРаздельнойЗакупки(ИспользоватьТоварыВПутиОтПоставщиков, ИспользоватьНеотфактурованныеПоставки);
	СписокОперацийТребующихДоговор = Новый СписокЗначений();
	СписокОперацийТребующихДоговор.ЗагрузитьЗначения(ХозяйственныеОперацииРаздельнойЗакупки);
	СписокОперацийТребующихДоговор.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);

	УсловноеОформление.Элементы.Очистить();

	ПланыВидовХарактеристик.СтатьиРасходов.УстановитьУсловноеОформлениеАналитик(УсловноеОформление, Новый Структура("Товары"));

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеПросрочено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовПоставщикам.Закрыт;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

	//

	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
	Элементы.Товары,
	Элементы.ТоварыОтменено.Имя,
	Элементы.ТоварыПричинаОтмены.Имя);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаРучнойСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПроцентРучнойСкидки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Отменено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатураПартнера.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Партнер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатураПартнера.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Партнер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<выберите поставщика>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДатаПоступления.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ДатаПоступления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Отменено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	//

	УчетНДСУП.УстановитьУсловноеОформлениеСуммНДСПоНалогообложениюЗакупки(ЭтаФорма);

	//

	Ценообразование.УстановитьУсловноеОформлениеЦенаВключаетНДС(ЭтаФорма);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);

	//

	ОбщегоНазначенияУТ.УстановитьУсловноеОформлениеПриоритета(ЭтаФорма);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);

	//

	СкладыСервер.УстановитьУсловноеОформлениеСкладаВТЧ(ЭтаФорма);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСклад.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСклад.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Склад");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для товаров>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСклад.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Склад");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Договор.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Соглашение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокОперацийТребующихДоговор;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Договор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Договор.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Соглашение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Договор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ГруппаОтбора3 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокОперацийТребующихДоговор;

	ОтборЭлемента = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Договор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
	УсловноеОформление, "ТоварыСклад", "Склад", "Товары", "СкладОбязателен");

	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
	УсловноеОформление, "Склад", "Склад", "", "СкладОбязателен");

	// ДатаПоступления, установить отметку

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаПоступления.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаПоступления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВсеСтрокиОтменены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	// ДатаПоступления, снять отметку

	СкладыСервер.УстановитьУсловноеОформлениеСкладаВШапке(ЭтаФорма);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаПоступления.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаПоступления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВсеСтрокиОтменены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеНазначенияНоменклатуры(ЭтаФорма);

	//
	ПараметрыУстановки = МногооборотнаяТараСервер.ПараметрыУстановкиУсловногоОформленияДляСтрокСМногооборотнойТарой();

	ПараметрыУстановки.Форма                 = ЭтаФорма;
	ПараметрыУстановки.ЭтоПоступление        = Истина;

	МногооборотнаяТараСервер.УстановитьУсловноеОформлениеДляСтрокСМногооборотнойТарой(ПараметрыУстановки);

	// оформление статей и аналитики расходов

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСписатьНаРасходы.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСтатьяРасходов.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихУслуги();

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// только просмотр, если товар

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСписатьНаРасходы.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСтатьяРасходов.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// только просмотр, если работа под назначение

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСписатьНаРасходы.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСтатьяРасходов.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Назначение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// только просмотр, если услуга

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСписатьНаРасходы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Услуга;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// поясняющая надпись, если товар

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСтатьяРасходов.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для работ/услуг без назначения>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// поясняющая надпись, если работа под назначение

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСтатьяРасходов.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Назначение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для работ/услуг без назначения>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// поясняющая надпись, если работа и на расходы не списываем

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СписатьНаРасходы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Назначение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<при списании на расходы>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// отметка незаполненного статьи расходов, если списываем на расходы

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСтатьяРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СписатьНаРасходы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СтатьяРасходов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	// отметка незаполненного подразделения, если Товар

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПодразделение.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// текст аналитики расходов, если статья не выбрана

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыАналитикаРасходов.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СтатьяРасходов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.АналитикаРасходов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СписатьНаРасходы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<выберите статью расходов>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформление склада и подразделения
	// отключение видимости склада, если работа или услуга.

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСклад.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладГруппа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихУслуги();

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// отключение видимости подразделения, если товар или тара или операция комиссии

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПодразделение.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихУслуги();

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладГруппа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// поясняющая надпись для подразделения, если склады не в табличной части

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПодразделение.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладГруппа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для работ/услуг>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// только просмотр СуммыНДС, если СтавкаНДС = БезНДС или НДС0%

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаНДС.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СтавкаНДС");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.СтавкиНДС.БезНДС);
	СписокЗначений.Добавить(Перечисления.СтавкиНДС.НДС0);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	НаправленияДеятельностиСервер.УстановитьУсловноеОформлениеНаправленияДеятельности(ЭтаФорма);

	#Вставка
	//++ #Б7206 смарт: Шляпников 30.06.2026 / Реквизит Повышенный таможенный сбор в документах Предзаказ поставщику и Заказ поставщику. Доработка.
	УстановитьУсловноеОформлениеПовышенногоТаможенногоСбора();
	//-- #Б7206 смарт: Шляпников 30.06.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
Процедура УстановитьУсловноеОформлениеПовышенногоТаможенногоСбора()
	
	Если Элементы.Найти("смартТоварыПовышенныйТаможенныйСбор") <> Неопределено Тогда
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.смартТоварыПовышенныйТаможенныйСбор.Имя);

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.смартПовышенныйТаможенныйСбор");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
		
		////////////////////////////////////////////////////
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.смартТоварыПовышенныйТаможенныйСбор.Имя);

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.смартПовышенныйТаможенныйСбор");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТЧТоварыЗаполненаКорректно(ТчТовары)
	
	ТЧЗаполненаКорректно = Истина;
	
	ТЧТоварыЗаполненаКорректноНаСервере(ТчТовары);
	
	Возврат ТЧЗаполненаКорректно;
	
КонецФункции

&НаСервере
Функция ТЧТоварыЗаполненаКорректноНаСервере(ТчТовары)

	Для Каждого Строка Из ТчТовары Цикл
		Если НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура) 
			И УпаковкаСоответствуетЕдиницеИзмерения(Строка.Номенклатура, Строка.Упаковка) Тогда
			Если Не ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка) Тогда
				ТЧЗаполненаКорректно = Ложь;
				ВывестиСообщениеОбОшибкеПользователю(Строка.НомерСтроки);				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;

	Возврат ТЧЗаполненаКорректно;
	
КонецФункции // ТЧТоварыЗаполненаКорректноНаСервере()

&НаСервере
Функция ПроверитьПравильностьЗаполненияКоличестваВСтроке(ИД)
	Строка=Объект.Товары.НайтиПоИдентификатору(ИД);
	Намотка = СтрокуВЧисло(Строка.Характеристика);
	КоличествоКОтгрузке = Строка.Количество;
	
	Если Не УпаковкаСоответствуетЕдиницеИзмерения(Строка.Номенклатура, Строка.Упаковка) Тогда
		Возврат Истина;
	Иначе
		Возврат ОтгрузкаВРулонахКратнаНамотке(Намотка, КоличествоКОтгрузке);
	КонецЕсли;
	
КонецФункции

Процедура ВывестиСообщениеОбОшибкеПользователю(НомерСтроки);
	
	ТекстСообщения = "Строка №" + НомерСтроки + Символы.ПС
								+ "Количество погонных метров должно быть кратно намотке рулона!" + Символы.ПС
								+ "Укажите другое количество погонных метров.";
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				,,,); 
	
КонецПроцедуры	

&НаСервере
Функция ОтгрузкаВРулонахКратнаНамотке(Намотка, КоличествоКОтгрузке)
	
	Возврат (КоличествоКОтгрузке%Намотка) = 0;
	
КонецФункции

&НаСервере
Функция УпаковкаСоответствуетЕдиницеИзмерения(Номенклатура, Упаковка)
	
	ЕдиницаХранения = Номенклатура.ЕдиницаИзмерения;
	
	Возврат ЕдиницаХранения = Упаковка;
	
КонецФункции

&НаСервере
Функция НоменклатураВРулонахПоХарактеристикам(Номенклатура)

	Возврат Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварРулоныХарактеристики", Истина)

КонецФункции // НоменклатураВРулонахПоХарактеристикам()

// Превращает строку в число без вызова исключений. Стандартная функция преобразования.
//   Число() строго контролирует отсутствие каких либо символов кроме числовых.
//
&НаСервере
Функция СтрокуВЧисло(ИсходнаяСтрока, ЗначениеПоУмолчанию = 0)
	//СтрокаВЧисло = Новый Соответствие;
	//Для Значение = 0 По 9 Цикл
	//	СтрокаВЧисло.Вставить(Строка(Значение), Значение);
	//КонецЦикла;
	//
	//Результат = 0;
	//Для Индекс = 1 По СтрДлина(ИсходнаяСтрока) Цикл
	//	ПоследнийРазряд = СтрокаВЧисло.Получить(Сред(ИсходнаяСтрока, Индекс, 1));
	//	Если ПоследнийРазряд <> Неопределено Тогда
	//		Результат = Результат * 10 + ПоследнийРазряд;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Возврат ?(Результат = 0, ЗначениеПоУмолчанию, Результат);
	
	СтрокаДляПреобразования = Строка(ИсходнаяСтрока);
	
	Попытка		
		Возврат Число(СтрокаДляПреобразования);
	Исключение
		ТекстСообщения = "не удалось перевести стору в число";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,);
	КонецПопытки;
	
КонецФункции

// Фролов+
&НаКлиенте
Процедура смарт_НеОтгруженныеТоварыПоставщикаВместо(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");

	ПараметрыФормы.Отбор = Новый Структура("Партнер", Объект.Партнер);
	
	ПараметрыФормы.КлючВарианта = "ПоЗаказу";
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
			
	ОткрытьФорму("Отчет.смартНеОтгруженныеТоварыПоставщика.Форма", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура смарт_СоставГрузаВместо(Команда)
    ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
    
    //++ смарт:Подкин #966 07.04.2022 13:03:16
   // ПараметрыФормы.Отбор = Новый Структура("ЗаказПоставщику,Груз", Объект.Ссылка, Объект.Груз);
    //-- смарт:Подкин #966 07.04.2022 13:03:16
    
    ПараметрыФормы.КлючВарианта = "ПоЗаказу";
    ПараметрыФормы.СформироватьПриОткрытии = Ложь;
    
    ОткрытьФорму("Отчет.смартСоставГрузов.Форма", ПараметрыФормы, ЭтаФорма); 
    
КонецПроцедуры

&НаКлиенте
Процедура смарт_ДокументыОснованияНажатиеВместо(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;  
	
	Параметры = Новый Структура("Отбор", Новый Структура("Ссылка", ЭтаФорма.СписокПредзаказов)); 
	
	ОткрытьФорму("Документ.смартПредзаказПоставщику.ФормаСписка", Параметры, ЭтотОбъект); 
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаполнитьПоПредзаказамВместо(Команда)
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен 'Партнер'",,"Объект.Партнер");
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.ЗаказПоставщику.Форма.смартФормаЗаполненияПоПредзаказам",
	Новый Структура("Партнер",Объект.Партнер),ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеВыбораИзПредзаказов",ЭтотОбъект),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзПредзаказов(РезультатВыбора,ДопПараметры)Экспорт 
	Если ТипЗнч(РезультатВыбора)=Тип("Структура") И РезультатВыбора.Свойство("Товары") И РезультатВыбора.Товары.Количество()>0 Тогда
		Если Объект.Партнер=РезультатВыбора.Партнер Тогда 
			Для Каждого Эл Из РезультатВыбора.Товары Цикл
				Стр=Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,Эл);
				ПересчитатьСтроку(Стр);
			КонецЦикла;
			ОтображениеДанныхПоПредзаказам();
			//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
			ЭтаФорма.Модифицированность = Истина;	
			//--#1227 смарт: Лопато 31.10.2022
		Иначе	
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопроса",ЭтотОбъект,РезультатВыбора),"Табличная часть 'Товары' буде очищена
			|Продолжить?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопроса(Результат,ДопПараметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Да Тогда
		Если Не ДопПараметры.Партнер=Объект.Партнер Тогда 
			Объект.Партнер=ДопПараметры.Партнер;
			ПартнерПриИзменении(Неопределено);
		КонецЕсли;	
		Объект.Товары.Очистить();
		Для Каждого Эл Из ДопПараметры.Товары Цикл
			Стр=Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Эл);
			ПересчитатьСтроку(Стр);
		КонецЦикла;
		ОтображениеДанныхПоПредзаказам();
		//++#1227 смарт: Лопато 31.10.2022 //Групповое заполнение Заказа поставщику по предзаказам
		ЭтаФорма.Модифицированность = Истина;	
		//--#1227 смарт: Лопато 31.10.2022
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтображениеДанныхПоПредзаказам()
	
	Предзаказы = Объект.Товары.Выгрузить(, "смартПредзаказПоставщику");
	Предзаказы.Свернуть("смартПредзаказПоставщику");
	ПустаяСтр = Предзаказы.Найти(ПредопределенноеЗначение("Документ.смартПредзаказПоставщику.ПустаяСсылка"));  
	
	Если Не ПустаяСтр = Неопределено Тогда 
		Предзаказы.Удалить(ПустаяСтр);
	КонецЕсли;
	
	ЭтаФорма.СписокПредзаказов.ЗагрузитьЗначения(Предзаказы.ВыгрузитьКолонку("смартПредзаказПоставщику"));
	
	ИспользоватьЗаказПоНесколькимПредзаказам = ЭтаФорма.СписокПредзаказов.Количество() > 1;
	
	Объект.ДокументОснование = ?(ИспользоватьЗаказПоНесколькимПредзаказам, Неопределено, Объект.ДокументОснование);
	ЭтаФорма.НадписьДокументыОснования = СтрСоединить(ЭтаФорма.СписокПредзаказов.ВыгрузитьЗначения(), ", ");

	//Элементы.ТоварысмартПредзаказПоставщику.Видимость=ИспользоватьЗаказПоНесколькимПредзаказам;
	Элементы.ГруппаОснования.Видимость = ИспользоватьЗаказПоНесколькимПредзаказам;
	Элементы.ГруппаОснование.Видимость = Не ИспользоватьЗаказПоНесколькимПредзаказам;
КонецПроцедуры	

&НаСервере
Процедура ДоступностьЭлементаГруз()
	Элементы.ДекорацияГруз.Заголовок=Объект.Груз.СтатусГруза;
	Если Объект.Груз.СтатусГруза=ПредопределенноеЗначение("Перечисление.СтатусыГрузов.Принят") Тогда 
		Элементы.Груз.ТолькоПросмотр=Не РольДоступна("ПолныеПрава");
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.Зеленый;
	Иначе
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.ТемноОранжевый;
	КонецЕсли;    
КонецПроцедуры	

&НаКлиенте
Процедура смарт_ГрузПриИзменении(Элемент)
	ДоступностьЭлементаГруз();

	//++#1374 смарт: Балашов 13.07.2023 //Разработать учет закупок в разрезе Контейнеров
	смартПриИзмененииГрузаИКонтейнеров();
	//--#1374 смарт: Балашов 13.07.2023
	
	//++ #Б-1458 смарт: Лопато 12.02.2025 //Заполнение поля Желаемая дата поступления в документе Заказ поставщику  
	ЗаполнитьЖелаемуюДатуПоступленияИзГруза();
	//-- #Б-1458 смарт: Лопато 12.02.2025
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПревышеноКоличествПоПредзаказу(Данные)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ПредзаказПоставщику",Данные.ПредзаказПоставщику);
	Запрос.УстановитьПараметр("Номенклатура",Данные.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Данные.Характеристика);
	Запрос.УстановитьПараметр("Требуется",Данные.Требуется);
	Запрос.УстановитьПараметр("Заказано",Данные.Заказано);
	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ЕСТЬNULL(смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток, 0) + ЕСТЬNULL(смартПредзаказыПоставщикамОбороты.ЗаказаноРасход, 0) < &Требуется КАК Превышено,
	             |	ЕСТЬNULL(смартПредзаказыПоставщикамОстатки.ЗаказаноОстаток, 0) + ЕСТЬNULL(смартПредзаказыПоставщикамОбороты.ЗаказаноРасход, 0) КАК Остаток
	             |ИЗ
	             |	РегистрНакопления.смартПредзаказыПоставщикам.Остатки(
	             |			,
	             |			ПредзаказПоставщику = &ПредзаказПоставщику
	             |				И Номенклатура = &Номенклатура
	             |				И Характеристика = &Характеристика) КАК смартПредзаказыПоставщикамОстатки
	             |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.смартПредзаказыПоставщикам.Обороты(
	             |				,
	             |				,
	             |				,
	             |				ПредзаказПоставщику = &ПредзаказПоставщику
	             |					И Номенклатура = &Номенклатура
	             |					И Характеристика = &Характеристика) КАК смартПредзаказыПоставщикамОбороты
	             |		ПО (смартПредзаказыПоставщикамОбороты.ПредзаказПоставщику = смартПредзаказыПоставщикамОстатки.ПредзаказПоставщику)
	             |			И (смартПредзаказыПоставщикамОбороты.Номенклатура = смартПредзаказыПоставщикамОстатки.Номенклатура)
	             |			И (смартПредзаказыПоставщикамОбороты.Характеристика = смартПредзаказыПоставщикамОстатки.Характеристика)";
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() И Рез.Превышено Тогда 
		Возврат Новый Структура("Превышено,Остаток",Истина,Рез.Остаток);
	КонецЕсли;	
	Возврат Новый Структура("Превышено",Ложь);
КонецФункции

&НаСервереБезКонтекста
//++ #Б-6768 смарт: Фролов 01.06.2026 //Заказ поставщику. Доработка документа.
Функция ПолучитьЗначенияПошлиныИТаможенногоСбора(Номенклатура)
	Результат = Новый Структура("смартСтавкаПошлины, смартПовышенныйТаможенныйСбор", "", Ложь);
	
	КодТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "КодТНВЭД");
	Если ЗначениеЗаполнено(КодТНВЭД) Тогда
		ЗначенияРеквизитов 					= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодТНВЭД, "смартБазоваяСтавка,смартПовышенныйТаможенныйСбор");
		Результат.смартСтавкаПошлины 			= ЗначенияРеквизитов.смартБазоваяСтавка;
		Результат.смартПовышенныйТаможенныйСбор 	= ЗначенияРеквизитов.смартПовышенныйТаможенныйСбор;
	КонецЕсли;
	Возврат Результат;
КонецФункции //-- #Б-6768 смарт: Фролов 01.06.2026

&НаКлиенте
Процедура ПересчитатьСтроку(Стр)	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
	СтруктураДействий.Вставить("ПроверитьСтатьюАналитикуРасходов", Стр.Номенклатура);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить(
		"ПроверитьЗаполнитьСклад",
		ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(
			Объект,
			СкладГруппа));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Стр,СтруктураДействий,Неопределено);
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры	

&НаКлиенте
Процедура смарт_КонтрагентПриИзмененииПосле(Элемент)
	ДанныеКонтранента=ПолучитьДанныеКонтрагента(Объект.Контрагент);
	Если ДанныеКонтранента.НеПровенятьРиски Тогда Возврат КонецЕсли;
	
	Если Не ИндексыСПАРКРиски=Неопределено И (ИндексыСПАРКРиски.СводныйИндикаторГрадация=ПредопределенноеЗначение("Перечисление.ГрадацияИндексовСПАРКРиски.Высокий") 
		 Или ИндексыСПАРКРиски.СводныйИндикатор=-1) И ДанныеКонтранента.ЮрЛицо Тогда 
		Текст="У выбранного контрагента высокая степень риска!
					|Документ не будет проведен.";
		ПоказатьПредупреждение(,Текст);	
    КонецЕсли;  
   
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОВыбореКонтрагент(Результат,ДопПараметры)Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда  
		
		Элементы.ГруппаРазрешениеСПАРКРисков.Видимость = Истина; 
		
	Иначе
		
		Объект.Контрагент = ЭтаФорма.смартКонтрагентКешированноеЗначение;  
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СброситьПроведениеПриВысокомСПАРКРиске(Реквизит)
	УстановитьПривилегированныйРежим(Истина);
	Реквизит=Ложь;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура смарт_смартПроводитьДокументПриВысокомСПАРКРискеПриИзмененииВместо(Элемент)
	Объект.смартОтветственныйЗаСПАРКРиски=?(Объект.смартПроводитьДокументПриВысокомСПАРКРиске,ПользователиКлиентСервер.ТекущийПользователь(),Неопределено);
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьДанныеКонтрагента(Контрагент)
	Возврат Новый Структура("ЮрЛицо,НеПровенятьРиски",Контрагент.ЮрФизЛицо=ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо"),Контрагент.смартНеПроверятьРиски);		
КонецФункции
// Фролов-

//++ смарт:ММ #006 144 04.12.2019
Процедура НастроитьВидимостьДоступностьЭлементов()
	
	смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(ЭтаФорма);	
	
КонецПроцедуры //-- смарт:ММ 04.12.2019

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
Процедура ДобавитьЭлементыПрограммно()
	
	Команда = ЭтаФорма.Команды.Добавить("смартЗаполнитьТоварыПоСпецификацииIECHO");
    Команда.Действие = "смартЗаполнитьПоСпецификацииIECHO";
	
	КнопкаЗаполнитьПоСпецификации = Элементы.Вставить("ТоварыЗаполнитьПоСпецификацииIECHO", Тип("КнопкаФормы"), Элементы.ГруппаТоварыЗаполнить, Элементы.ТоварыЗаполнитьПоПредзаказам);
	КнопкаЗаполнитьПоСпецификации.ИмяКоманды = "смартЗаполнитьТоварыПоСпецификацииIECHO";
	КнопкаЗаполнитьПоСпецификации.Заголовок = "Заполнить по спецификации IECHO";
	
	ДобавляемыеРеквизиты = Новый Массив;
    Реквизит_смартСкидкаНаЗакупку = Новый РеквизитФормы("смартСкидкаНаЗакупку",	Новый ОписаниеТипов("СправочникСсылка.смартIECHOСкидкиНаЗакупку"), "Объект.Товары", "Скидка на закупку (смарт)");
    ДобавляемыеРеквизиты.Добавить(Реквизит_смартСкидкаНаЗакупку);	
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//++ смарт:ММ 221 19.07.2021
	смартЗапчастиГарантийные = Элементы.Вставить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	смартЗапчастиГарантийные.Вид = ВидПоляФормы.ПолеФлажка;
	смартЗапчастиГарантийные.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	смартЗапчастиГарантийные.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
	смартЗапчастиГарантийные.Заголовок = "Запчасти гарантийные (смарт)";
	//-- смарт:ММ 19.07.2021 
	
	//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
	Если Не Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		Реквизит_Контейнер = Новый РеквизитФормы("Контейнеры", Новый ОписаниеТипов("Строка"),"Объект.Товары", "Контейнеры");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит_Контейнер); 

		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 

		ЭлементХарактеристика = Элементы.Товары.ПодчиненныеЭлементы.Найти("ТоварыХарактеристика");
		
		НоваяКолонка = Элементы.Вставить("Контейнеры", Тип("ПолеФормы"), Элементы.Товары, ЭлементХарактеристика); 
		НоваяКолонка.Заголовок = "Контейнеры"; 
		НоваяКолонка.ПутьКДанным = "Объект.Товары.Контейнеры"; 
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ГиперссылкаЯчейки = истина;
		НоваяКолонка.ТолькоПросмотр = истина;
		НоваяКолонка.АвтоВысотаЯчейки = истина; 

		Команда = ЭтаФорма.Команды.Добавить("ЗаполнитьКонтейнеры");
	   	Команда.Действие = "смартЗаполнитьКонтейнеры";

		НовЭлемент = Элементы.Добавить("ЗаполнитьКонтейнеры", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
		НовЭлемент.Заголовок = "Заполнить контейнеры";
	   	НовЭлемент.ИмяКоманды = "ЗаполнитьКонтейнеры";
		
	КонецЕсли;	
	//--#1374 смарт: Балашов 15.06.2023	
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	Элементы.Товары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
	//++ #Б-6768 смарт: Фролов 01.06.2026 //Заказ поставщику. Доработка документа.
	НоваяКолонка = Элементы.Вставить("смартТоварыСтавкаПошлины", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "Объект.Товары.смартСтавкаПошлины";
	НоваяКолонка.Заголовок = "Ставка пошлины, %"; 
	
	НоваяКолонка = Элементы.Вставить("смартТоварыПовышенныйТаможенныйСбор", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	НоваяКолонка.ПутьКДанным = "Объект.Товары.смартПовышенныйТаможенныйСбор";
	НоваяКолонка.Заголовок = "Повышенный таможенный сбор";
	//-- #Б-6768 смарт: Фролов 01.06.2026
	
КонецПроцедуры //-- смарт:ММ 17.01.2021                        

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
&НаКлиенте
Процедура смартЗаполнитьПоСпецификацииIECHO()
	
	ПараметрыФормы = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("ПометкаУдаления", Ложь);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("смартОбработкаВыбораСпецификации", ЭтотОбъект);
	ОткрытьФорму("Документ.смартIECHOСпецификация.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
	
КонецПроцедуры //-- смарт:ММ 17.01.2021

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
&НаКлиенте
Процедура смартОбработкаВыбораСпецификации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) И ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.смартIECHOСпецификация") Тогда	
		
		СкидкаНаЗакупку = Неопределено;
		СкидкаНаЗакупкуИспользована = смартСкидкаНаЗакупкуИспользована(РезультатЗакрытия, СкидкаНаЗакупку);
		
		Если СкидкаНаЗакупкуИспользована И ЗначениеЗаполнено(СкидкаНаЗакупку) Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Спецификация", РезультатЗакрытия);
			Оповещение = Новый ОписаниеОповещения("смартВопросВыборСкидкиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			ТекстВопроса = НСтр("ru = 'Нет свободных скидок " + СкидкаНаЗакупку + ". Выбрать другую скидку?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);	
			
		Иначе
			смартЗаполнитьТоварыПоСпецификацииНаКлиенте(РезультатЗакрытия, СкидкаНаЗакупку);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 17.01.2021

//++ смарт:ММ #092 389 18.01.2021 - Конструктор оборудования
&НаКлиенте
Процедура смартВопросВыборСкидкиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ИсключаемыеЭлементы = Новый Массив;
		Для Каждого Строка Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(Строка.смартСкидкаНаЗакупку) 
				И ИсключаемыеЭлементы.Найти(Строка.смартСкидкаНаЗакупку) = Неопределено Тогда
				ИсключаемыеЭлементы.Добавить(Строка.смартСкидкаНаЗакупку);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("Использована", Ложь);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("смартИсключаемыеЭлементы", ИсключаемыеЭлементы);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("смартОбработкаВыбораСкидкиНаЗакупку", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.смартIECHOСкидкиНаЗакупку.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
	Иначе
		смартЗаполнитьТоварыПоСпецификацииНаКлиенте(ДополнительныеПараметры.Спецификация, Неопределено);
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 18.01.2021

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
&НаКлиенте
Процедура смартОбработкаВыбораСкидкиНаЗакупку(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) И ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.смартIECHOСкидкиНаЗакупку") Тогда	
		
		СкидкаНаЗакупку = РезультатЗакрытия;
		смартЗаполнитьТоварыПоСпецификацииНаКлиенте(ДополнительныеПараметры.Спецификация, СкидкаНаЗакупку);
			
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 17.01.2021

//++ смарт:ММ #092 389 18.01.2021 - Конструктор оборудования
&НаСервереБезКонтекста
Функция смартСкидкаНаЗакупкуИспользована(Спецификация, СкидкаНаЗакупку)
	
	СкидкаНаЗакупку = Спецификация.СкидкаНаЗакупку;
	
	Если НЕ ЗначениеЗаполнено(СкидкаНаЗакупку) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СкидкаНаЗакупку.Использована;
	
КонецФункции //-- смарт:ММ 18.01.2021

//++ смарт:ММ #092 389 18.01.2021 - Конструктор оборудования
&НаКлиенте
Процедура смартЗаполнитьТоварыПоСпецификацииНаКлиенте(Спецификация, СкидкаНаЗакупку)
	
	смартЗаполнитьТоварыПоСпецификацииНаСервере(Спецификация, СкидкаНаЗакупку);
	
КонецПроцедуры //-- смарт:ММ 18.01.2021

//++ смарт:ММ #092 389 17.01.2021 - Конструктор оборудования
&НаСервере
Процедура смартЗаполнитьТоварыПоСпецификацииНаСервере(Спецификация, СкидкаНаЗакупку)
		
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Спецификация.Номенклатура;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.КоличествоУпаковок = 1;
	НоваяСтрока.Цена = Спецификация.Итого;
	НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
	
	СкидкаПроцент = Ложь;
	СкидкаСумма = Ложь;
	Если ЗначениеЗаполнено(СкидкаНаЗакупку) И ЗначениеЗаполнено(СкидкаНаЗакупку.Размер) Тогда
		Если СкидкаНаЗакупку.ЕдиницаИзмерения = Перечисления.смартСпособыПредоставленияСкидок.Сумма Тогда
			НоваяСтрока.СуммаРучнойСкидки = СкидкаНаЗакупку.Размер;
			СкидкаСумма = Истина;
		ИначеЕсли СкидкаНаЗакупку.ЕдиницаИзмерения = Перечисления.смартСпособыПредоставленияСкидок.Процент Тогда
			НоваяСтрока.ПроцентРучнойСкидки = СкидкаНаЗакупку.Размер;
			СкидкаПроцент = Истина;
		КонецЕсли;
		
		НоваяСтрока.смартСкидкаНаЗакупку = СкидкаНаЗакупку;
	КонецЕсли;
	
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("ПересчитыватьСуммуРучнойСкидки", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

	КэшированныеЗначения = Неопределено;
	Если СкидкаСумма Тогда
		ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьПроцентРучнойСкидкиВСтрокеТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
	КонецЕсли;
	Если СкидкаПроцент Тогда
		ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
	КонецЕсли;

	НоваяСтрока.Склад = Объект.Склад;
	НоваяСтрока.БезВозвратнойТары = Истина;
	НоваяСтрока.Сумма = НоваяСтрока.Сумма - НоваяСтрока.СуммаРучнойСкидки;
	НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	//ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);

	//ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуСУчетомРучнойСкидкиВСтрокеТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
	НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		НоваяСтрока.Сумма,
		УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
		Объект.ЦенаВключаетНДС,
		Объект.НалогообложениеНДС);
	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);

	НоваяСтрока.СуммаСНДСБезВозвратнойТары = НоваяСтрока.СуммаСНДС;
	ОбработкаТабличнойЧастиКлиентСервер.ЗаполнитьДубликатыЗависимыхРеквизитов(НоваяСтрока, СтруктураДействий);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры //-- смарт:ММ 17.01.2021

//++ смарт:ММ #092 389 18.01.2021 - Конструктор оборудования
&НаСервере
Процедура смарт_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МассивСкидокДляИзменения = Новый Массив;
	
	Для Каждого Строка Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Строка.смартСкидкаНаЗакупку) Тогда			
			МассивСкидокДляИзменения.Добавить(Строка.смартСкидкаНаЗакупку);			
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСкидокДляИзменения.Количество() > 0 Тогда
		// Запись перенесена в модуль объекта, чтобы при неудачной попытки записи справочник не менялся (перенесено в транзакцию)
		ТекущийОбъект.ДополнительныеСвойства.Вставить("смартМассивСкидокДляИзменения", МассивСкидокДляИзменения);
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 18.01.2021

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартЗаполнитьКонтейнеры(Элемент)
	Если смартИспользуютсяКонтейнеры() Тогда 
		Если Элементы.Товары.ВыделенныеСтроки.Количество() > 1 Тогда
			СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);
		Иначе	
			ТекДанные = Элементы.Товары.ТекущиеДанные;
			Если Не ТекДанные = Неопределено Тогда
				Если ЗначениеЗаполнено(ТекДанные.смартКонтейнер) Тогда
					ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(ТекДанные.смартКонтейнер);
					СписокКонтейнеров = смартЗаполнитьСписокНаСервере(ЗначениеДляКонтейнера)
				Иначе
					СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	    смартОткрытьФормуВыбораКонтейнеров(СписокКонтейнеров);
	КонецЕсли;	
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023 

//++#1374 смарт: Балашов 04.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартПроверитьВозможностьИзмененияКонтейнеров()
	//проверим есть ли ПТУ по данному документу
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслуг.Ссылка КАК ПТУ
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	               |ГДЕ
	               |	ПриобретениеТоваровУслуг.ЗаказПоставщику = &СсылкаЗаказ  И ПриобретениеТоваровУслуг.Проведен
				   |";
	Запрос.УстановитьПараметр("СсылкаЗаказ",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ПТУ;
	Иначе
		Результат = Неопределено;
	КонецЕсли;	          
	Возврат Результат;
КонецФункции//--#1374 смарт: Балашов 04.07.2023	

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартОткрытьФормуВыбораКонтейнеров(СписокКонтейнеров)
   	ПТУ = смартПроверитьВозможностьИзмененияКонтейнеров();
	Если ПТУ = Неопределено Тогда
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
		Если Не СписокКонтейнеров = Неопределено Тогда
		    ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.Использование  = Истина;
			ЭлементОтбора.ПравоеЗначение = СписокКонтейнеров;
		КонецЕсли;	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СписокКонтейнеров", СписокКонтейнеров);
	 	ПараметрыФормы.Вставить("МножественныйВыбор", истина);

		ОбработкаВыбора = Новый ОписаниеОповещения("смартПриЗакрытииФормыВыбораКонтейнеров", ЭтаФорма,"Подбор");
		ОткрытьФорму("Справочник.смартКонтейнеры.Форма.ФормаВыбораКонтейнеров", ПараметрыФормы,
		        ЭтаФорма, , , , ОбработкаВыбора);
	Иначе
		
		ТекстСообщения = Новый ФорматированнаяСтрока("По данному документу создан: ", 
	    Новый ФорматированнаяСтрока(Строка(ПТУ),,,,ПолучитьНавигационнуюСсылку(ПТУ)), 
	    " Изменение контейнеров возможно только в нем");		
			
		ПоказатьПредупреждение(, ТекстСообщения,, "Предупреждение");
		
	КонецЕсли;			
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023	

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартПриЗакрытииФормыВыбораКонтейнеров(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СтрокаJSON = смартОбщегоНазначения.смартЗаписатьВыбраныеКонтейнерыВJSON(Значение);
	
	ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(СтрокаJSON);

	СписокСтрок = Элементы.Товары.ВыделенныеСтроки;
	Для Каждого Строка_ТЧ Из СписокСтрок Цикл
		ТекСтрока = Объект.Товары.НайтиПоИдентификатору(Строка_ТЧ);
		ТекСтрока.смартКонтейнер = СтрокаJSON;
		ТекСтрока.Контейнеры = смартОбщегоНазначения.смартКонтейнерыВСтроку(ЗначениеДляКонтейнера);
	КонецЦикла;
    ЭтотОбъект.Модифицированность = истина;
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023                                                   

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартПолучитСписокКонтейнеров(Груз)
	Запрос = Новый Запрос;	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	смартСобытияКонтейнеров.Груз КАК Груз,
		|	смартСобытияКонтейнеров.Контейнер КАК Контейнер
		|ИЗ
		|	РегистрСведений.смартСобытияКонтейнеров КАК смартСобытияКонтейнеров
		|ГДЕ
		|	смартСобытияКонтейнеров.Груз = &Груз
		|";
	Запрос.УстановитьПараметр("Груз",Груз);
	СписокКонтейнеров = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКонтейнеров.Добавить(Выборка.Контейнер,,ложь);
	КонецЦикла;	                           
	Возврат СписокКонтейнеров;
КонецФункции//--#1374 смарт: Балашов 15.06.2023

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартЗаполнитьСписокНаСервере(ЗначениеДляКонтейнера)
	СписокКонтейнеров = Новый СписокЗначений;
	Если ЗначениеДляКонтейнера.Количество() = 0 Тогда
		СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);	
	Иначе	
		Для Каждого СтрКонтейнера Из ЗначениеДляКонтейнера Цикл
			НовыйGUID = Новый УникальныйИдентификатор(СтрКонтейнера.Ссылка);
			СсылкаКонтейнер = Справочники.смартКонтейнеры.ПолучитьСсылку(НовыйGUID);
			СписокКонтейнеров.Добавить(СсылкаКонтейнер,,СтрКонтейнера.Пометка);
		КонецЦикла;
	КонецЕсли;	  
	Возврат СписокКонтейнеров;
КонецФункции//--#1374 смарт: Балашов 15.06.2023

//++#1374 смарт: Балашов 13.07.2023 //Разработать учет закупок в разрезе Контейнеров
// надо перенести в смартОбщегоНазначения если его когда нибудь освободят...
&НаСервере
Функция смартИспользуютсяКонтейнеры()
	Результат = ложь;
	Если Не Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
		// проверим наличие груза
		Если ЗначениеЗаполнено(Объект.Груз) Тогда 
			СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);
			Если СписокКонтейнеров.Количество() <> 0 Тогда
				Результат = истина;                      
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	          
	Возврат Результат;
КонецФункции//--#1374 смарт: Балашов 13.07.2023	

//++#1374 смарт: Балашов 13.07.2023 //Разработать учет закупок в разрезе Контейнеров
// надо перенести в смартОбщегоНазначения если его когда нибудь освободят...
&НаСервере
Процедура смартПриИзмененииГрузаИКонтейнеров()
	Если смартИспользуютсяКонтейнеры() Тогда
		Для Каждого СтрТовары Из Объект.Товары Цикл
			СтрТовары.смартКонтейнер = "";
			СтрТовары.Контейнеры = "";
		КонецЦикла;	
	КонецЕсли;
    ЭтотОбъект.Модифицированность = истина;
КонецПроцедуры//--#1374 смарт: Балашов 13.07.2023

//++ #Б-1458 смарт: Лопато 12.02.2025 //Заполнение поля Желаемая дата поступления в документе Заказ поставщику  
&НаСервере
Процедура ЗаполнитьЖелаемуюДатуПоступленияИзГруза()

	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(Объект.ЖелаемаяДатаПоступления, Объект.Груз);
	//++ #Б3634 смарт: Шляпников 26.06.2025 / Проставлять галочку в поле "Поступление одной датой" автоматически 
	Документы.ЗаказПоставщику.ЗаполнитьЖелаемуюДатуПоступленияИзГруза(Объект.ДатаПоступления, Объект.Груз);
	//-- #Б3634 смарт: Шляпников 26.06.2025
	
КонецПроцедуры //-- #Б-1458 смарт: Лопато 12.02.2025

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументЗакупки.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда

		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда

		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СтруктураПредприятия.Форма.ФормаВыбора" Тогда

		ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;

		Для Каждого Строка Из ВыделенныеСтроки Цикл

			ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(Строка);

			Если ДанныеСтроки.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Или
				ДанныеСтроки.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Тогда
				Продолжить;
			КонецЕсли;

			ДанныеСтроки.Подразделение = ВыбранноеЗначение;

		КонецЦикла;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия" Тогда

		СкорректироватьСтрокиЗаказа(ВыбранноеЗначение);

	КонецЕсли;

	УстановитьПризнакЗаполненияСклада();
	
	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки

КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	
	//++ #Б-6768 смарт: Фролов 01.06.2026 //Заказ поставщику. Доработка документа.
	Если НЕ Элемент.ТекущийЭлемент.Имя = "смартТоварыСтавкаПошлины" И НЕ Элемент.ТекущийЭлемент.Имя = "смартТоварыПовышенныйТаможенныйСбор" Тогда
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьЗначенияПошлиныИТаможенногоСбора(ТекущиеДанные.Номенклатура));
		
	КонецЕсли;	
	//-- #Б-6768 смарт: Фролов 01.06.2026

КонецПроцедуры

#КонецОбласти    
