
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка
		ИЛИ РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	#Вставка
	//++ #1544 смарт: Ермаков 11.01.2024 / Оптимизация отчетов
	// При записи регистра, переопределяем измерения ДатаЗакрытияЗаказа, Менеджер и Подразделение.
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Заказы.Ссылка 				КАК ЗаказКлиента, 
	|	Заказы.ДатаЗакрытия 		КАК смартДатаЗакрытияЗаказа,
	|	Заказы.Менеджер 			КАК Менеджер,
	|	Заказы.Статус	 			КАК смартСтатусЗаказаКлиента,	
	|	Пользователи.Подразделение 	КАК Подразделение,
	|	Партнеры.БизнесРегион		КАК смартБизнесРегионКлиента
	|ИЗ 
	|	Документ.ЗаказКлиента КАК Заказы 
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|	ПО
	|		Пользователи.Ссылка = Заказы.Менеджер 
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|	ПО
	|		Партнеры.Ссылка = Заказы.Партнер 
	|
	|ГДЕ 
	|	Заказы.Ссылка В (&МассивЗаказов)";	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивЗаказов", ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЭтотОбъект.ВыгрузитьКолонку("ЗаказКлиента")));
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		Если ЗаписьНабора.ЗаказКлиента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЗаписьНабора.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") 
			 И ЗначениеЗаполнено(ЗаписьНабора.ЗаказКлиента)
			Тогда
			
			НайденнаяСтрокаСДатойЗакрытия = ТаблицаЗаказов.Найти(ЗаписьНабора.ЗаказКлиента, "ЗаказКлиента");
			
			Если Не НайденнаяСтрокаСДатойЗакрытия = Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(ЗаписьНабора, НайденнаяСтрокаСДатойЗакрытия, "смартДатаЗакрытияЗаказа, Менеджер, Подразделение, смартСтатусЗаказаКлиента, смартБизнесРегионКлиента");	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	//-- #1544 смарт: Ермаков 11.01.2024 / Оптимизация отчетов
	#КонецВставки
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда

		// Сохраним неизмененные первичные движения.
		СохранитьНеИзмененныеПервичныеДвижения();

		// Сохраним расчетные движения за периоды, в которых есть первичные движения.
		РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);

	КонецЕсли;

	Если ПланыОбмена.ГлавныйУзел() <> Неопределено
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		Возврат;
	КонецЕсли;

	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.

	ТекстыЗапросовДляПолученияТаблицыИзменений = 
	ЗакрытиеМесяцаСервер.ТекстыЗапросовДляПолученияТаблицыИзмененийРегистра(ЭтотОбъект.Метаданные(), ЭтотОбъект.Отбор);

	Запрос = Новый Запрос;
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиНачальныхДанных;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);

	Запрос.Выполнить();

	ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	ДополнительныеСвойства.Вставить("ТекстВыборкиТаблицыИзменений", ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиТаблицыИзменений);

КонецПроцедуры
