
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно открыть АРМ ""Мои дела"". Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)';en='It is impossible to open the workstation ""My work"". Subsystem 1C: CRM is not used! (see Personal settings of the user)'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Попытка
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Элементы.ДекорацияДобавитьНовыйВиджет.Видимость = Истина;
	
	ТекущаяДатаВремя = ТекущаяДатаСеанса();

	ВидАРМ = "Канбан";
	CRM_Теги.ОбновитьЗначенияОтбораПериодов(ЭтотОбъект, Истина);
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -Рабочий стол

	ПоказыватьВиджетыПриОткрытии = Ложь;
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		ВидимостьВиджетов = ХранилищеОбщихНастроек.Загрузить(ЭтотОбъект.ИмяФормы, "ПоказыватьПанельВиджетов");
		ПоказыватьВиджетыПриОткрытии = ?(ВидимостьВиджетов <> Неопределено, ВидимостьВиджетов, Ложь);
		Элементы.ГруппаВиджеты.Видимость = ПоказыватьВиджетыПриОткрытии;
		Элементы.СкрытьОтобразитьВиджеты.Пометка = ПоказыватьВиджетыПриОткрытии;
		Элементы.СкрытьОтобразитьВиджеты.Видимость = Ложь;
	Иначе
		ВидимостьВиджетов = Ложь;
		ПоказыватьВиджетыПриОткрытии = Ложь;
		//Элементы.СкрытьОтобразитьВиджеты.Видимость = Ложь;
		Элементы.ГруппаВиджеты.Видимость = Ложь;
	КонецЕсли;
	ТекущийПользовательПриИзмененииНаСервере();
	
	СоздатьКнопкиВидАРМ();
	СоздатьКнопиОтборПросроченные();
	
	СписокПериодов.Добавить("ПроизвольныйПериод", НСтр("ru='Произвольный период';en='Custom Period'"));
	СписокПериодов.Добавить("Сегодня", НСтр("ru='Сегодня';en='Today'"));
	СписокПериодов.Добавить("3 дня", НСтр("ru='3 дня';en='3 days'"));
	СписокПериодов.Добавить("Неделя", НСтр("ru='Неделя';en='Week'"));
	СписокПериодов.Добавить("Месяц", НСтр("ru='Месяц';en='Month'"));
	
	//ШиринаКолонокКанбан = 30;
	//Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
	//	Элементы.ГруппаПолосаРегулированияВсплывающая.Поведение = ПоведениеОбычнойГруппы.Обычное;
	//	Элементы.ДекорацияСкрытьПолосуРегулирования.Видимость 	= Истина;
	//КонецЕсли;
	//
	//Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
	//	Элементы.НастроитьШиринуКолонок.Видимость = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыМоиДелаНаВебКлиенте");
	#Иначе
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыМоиДелаНаКлиенте");
	#КонецЕсли	
	#Область Виджеты
	Если ПоказыватьВиджетыПриОткрытии Тогда
		Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
			Если Число(ЭлементСписка.Представление) <= 4 Тогда
				ПериодОбновленияВиджета = ПолучитьПериодОбновленияВиджетаНаСервере(ЭлементСписка.Значение, ЭлементСписка.Представление);
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление, ПериодОбновленияВиджета);
			ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти
	
	ОбновитьОтборы();
	
	// обновление реквизита "ТекущаяДатаВремя"
	ПодключитьОбработчикОжидания("ОбновлениеТекущаяДатаВремя", 60);
	УстановитьШиринуКолонокКанбанСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ Открыта() Тогда Возврат; КонецЕсли;
	
	Если Источник = ЭтотОбъект Тогда Возврат; КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьВиджеты" Тогда
		ОбновитьВиджетыФормы();
	ИначеЕсли ИмяСобытия = "CRM_УстановленФлагОбработано" Тогда
		ОбновитьОтборы();
	ИначеЕсли ИмяСобытия = "ОбновитьАРМ" ИЛИ ИмяСобытия = "ЗадачаВыполнена" Тогда
		ОбновитьОтборы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицыСервер()
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("ТаблицаОтложенные");
	МассивТаблиц.Добавить("ТаблицаТекущие");
	МассивТаблиц.Добавить("ТаблицаСписок");
	
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		ЭлементыПользовательскихНастроек = ЭтотОбъект[ИмяТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		Для Каждого Элемент Из ЭлементыПользовательскихНастроек Цикл
			Если ТипЗнч(Элемент) = ТипЗнч(ЭтотОбъект[ИмяТаблицы].КомпоновщикНастроек.Настройки.Порядок) Тогда
				Элемент.Элементы.Очистить();
				
				Если ОтборВключатьПросроченные <> -1 Тогда
					УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
					УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
					УсловиеСортировки.ТипУпорядочивания = ?(ОтборВключатьПросроченные = 1, НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировкиКомпоновкиДанных.Убыв);
					УсловиеСортировки.Использование = Истина;
				КонецЕсли;
				
				УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
				УсловиеСортировки.Использование = Истина;
				УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаДляСортировки");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	МассивТаблиц.Добавить("ТаблицаВходящие");
	МассивТаблиц.Добавить("ТаблицаЗавершенные");
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы[ИмяТаблицы].Обновить();
		Элементы[ИмяТаблицы].ВыделенныеСтроки.Очистить();
	КонецЦикла;
	Заголовок = НСтр("ru='Мои дела';en='My Affairs'")+" / "+ ТекущийПользователь +" / " + ПредставлениеПериода;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ВариантПериода = Настройки.Получить("ВариантПериода");
	ПериодОтбора =  Настройки.Получить("ПериодОтбора");
	Если ОтборСозданы.НайтиПоЗначению(ПериодОтбора) = Неопределено Тогда
		ОтборСозданы[0].Значение = ПериодОтбора;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВариантПериода) Тогда
		ВариантПериода = "Неделя"
	КонецЕсли;
	
	ОтборВключатьПросроченные = Настройки.Получить("ОтборВключатьПросроченные");
	
	Если НЕ ЗначениеЗаполнено(ОтборВключатьПросроченные) Тогда
		ОтборВключатьПросроченные = 2;
	КонецЕсли;
	ПокраситьКнопкиПросроченныеНаСервере();
	
	СформироватьПредставлениеПериода();

	ОценкаПроизводительности.ЗакончитьЗамерВремени("ОткрытиеФормыМоиДелаНаСервере", ВремяНачалаЗамера, 1);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаЗавершенныеНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Выполнение = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		ПараметрыПеретаскивания.Значение = Элемент.ТекущаяСтрока;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтложенныеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Строка") Тогда Возврат КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат КонецЕсли;
	ОбъектДействия = ПолучитьОбъектДействия(ПараметрыПеретаскивания.Значение);
	НовыйКлюч = ПроверкаПеретаскиванияНаСервере(ПараметрыПеретаскивания.Значение, "Отложенные", Строка);
	ОбновитьДанные(ПолучитьИмяИзмерения(ПараметрыПеретаскивания.Значение), "Отложенные");
	Элементы.ТаблицаОтложенные.ТекущаяСтрока = НовыйКлюч;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТекущиеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Строка") Тогда Возврат КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат КонецЕсли;
	ОбъектДействия = ПолучитьОбъектДействия(ПараметрыПеретаскивания.Значение);
	НовыйКлюч = ПроверкаПеретаскиванияНаСервере(ПараметрыПеретаскивания.Значение, "Текущие", Строка);
	ОбновитьДанные(ПолучитьИмяИзмерения(ПараметрыПеретаскивания.Значение), "Текущие");
	Элементы.ТаблицаТекущие.ТекущаяСтрока = НовыйКлюч;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗавершенныеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Строка") Тогда Возврат КонецЕсли;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат КонецЕсли;
	// обработать завершение задачи
	ОбъектДействия = ПолучитьОбъектДействия(ПараметрыПеретаскивания.Значение);
	Если ТипЗнч(ОбъектДействия) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ОбъектДействия, "CRM_Личная") И ТипЗнч(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ОбъектДействия, "Предмет"))<>Тип("ДокументСсылка.CRM_Интерес") Тогда
			ЗавершитьЗадачу(ОбъектДействия);
			Оповестить("ОбновитьАРМ",, ЭтотОбъект);
		Иначе
			ТекущаяАктивность = ОбъектДействия;
			ПодключитьОбработчикОжидания("ОткрытьФормуТекущейАктивности",0.1, Истина);
			Возврат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектДействия) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
		ТекущаяАктивность = ОбъектДействия;
		ПодключитьОбработчикОжидания("ОткрытьФормуТекущейАктивности",0.1, Истина);
		Возврат;
	ИначеЕсли ТипЗнч(ОбъектДействия) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда
		Если ПроверитьВозможностьПеретаскивания(ПараметрыПеретаскивания.Значение, "Завершенные") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаРезультата", ЭтотОбъект, ПараметрыПеретаскивания.Значение);
			ПоказатьВводСтроки(ОписаниеОповещения, CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ОбъектДействия, "Результат"), НСтр("ru='Введите результат';en='Enter result'"), , Истина);
		КонецЕсли;
		Возврат;
	Иначе		
		ПроверкаПеретаскиванияНаСервере(ПараметрыПеретаскивания.Значение, "Завершенные", Строка);
	КонецЕсли;
	ОбновитьДанные(ПолучитьИмяИзмерения(ПараметрыПеретаскивания.Значение), "Завершенные");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТекущиеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтложенныеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗавершенныеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВходящиеПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТекущиеПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗавершенныеПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат КонецЕсли;
	СтруктураСтроки = ПолучитьСтруктуруОбъекта(ВыбраннаяСтрока);
	ПоказатьЗначение(,СтруктураСтроки.Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВходящиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанныеОбъект = ПолучитьОбъектСтроки(ВыбраннаяСтрока);
	СтандартнаяОбработка = Ложь;
	Если ТекущиеДанныеОбъект <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанныеОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСкрытьПолосуРегулированияНажатие(Элемент)
	Элементы.ГруппаПолосаРегулированияВсплывающая.Видимость = Ложь;
КонецПроцедуры

// +Рабочий стол
#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ПолеHTMLНапоминанийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLНапоминанийПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLНапоминанийПриНажатии()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти
// -Рабочий стол

#Область Виджеты

&НаКлиенте
Процедура ДобавитьВиджет(Элемент)
	
	Если КоличествоВиджетовНаФорме = 99 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВиджетЗавершение", ЭтотОбъект, Новый Структура);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокОткрытыхВиджетов", СписокВиджетовПользователя);
	ПараметрыФормы.Вставить("ФормаВиджеты", Истина);
	
	ОткрытьФорму("Справочник.CRM_Виджеты.ФормаВыбора",
		ПараметрыФормы, ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВиджетЗавершение(ВыбранныйВиджет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйВиджет = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ДанныеВиджета = ДобавитьВиджетФормы(ВыбранныйВиджет);
	
	Если ДанныеВиджета <> Неопределено Тогда
		Если Число(ДанныеВиджета.ИндексВиджета) <= 4 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДанныеВиджета.ИндексВиджета, ДанныеВиджета.ПериодОбновленияВиджета);
		ИначеЕсли Число(ДанныеВиджета.ИндексВиджета) = 5 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ТекущийЭлемент) <> Тип("ПолеФормы")
		И ТипЗнч(ТекущийЭлемент) <> Тип("ДекорацияФормы") Тогда
		Возврат;
	КонецЕсли;
	
	ИндексВиджета = Прав(ТекущийЭлемент.Имя,2);
	Виджет = Неопределено;
	
	Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
		Если ЭлементСписка.Представление = ИндексВиджета Тогда
			Виджет = ЭлементСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Виджет) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "УдалитьВиджет") Тогда
		УдалитьВиджетФормы(Виджет);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "ОткрытьПоказатель") Тогда
		ПоказатьЗначение( ,Виджет);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "НастройкаВиджета") Тогда
		ОповещениеНастройкаВиджета = Новый ОписаниеОповещения("НастройкаВиджетаЗавершение", ЭтотОбъект, Новый Структура("Виджет, ИндексВиджета", Виджет, ИндексВиджета));
		ПараметрыФормы = Новый Структура("Виджет, ИндексВиджета, ТекущийПользователь", Виджет, ИндексВиджета, ТекущийПользователь);
		ОткрытьФорму("Справочник.CRM_Виджеты.Форма.ФормаНастройки", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеНастройкаВиджета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "Расшифровать") Тогда
		Показатель = ПолучитьИсточникДанныхВиджета(Виджет);
		ЗначениеАналитики = CRM_РаботаСВиджетамиВызовСервера.ПолучитьЗначениеАналитикиИзНастроекВиджета(Виджет, ИндексВиджета, ТекущийПользователь);
		Если ТипЗнч(ЗначениеАналитики) = Тип("СправочникСсылка.Пользователи") Тогда
			МассивПользователей = Новый Массив;
			МассивПользователей.Добавить(ЗначениеАналитики);
		Иначе
			МассивПользователей = CRM_УправлениеЦелевымиПоказателямиСервер.ДоступныеПользователи(Истина);
		КонецЕсли;
		CRM_УправлениеЦелевымиПоказателямиКлиент.ОткрытьРасшифровкуПоказателя(Показатель, МассивПользователей);
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "Обновить") Тогда
		ОбновитьВиджетыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВиджетаЗавершение(НовыеНастройки, ДополнительныеПараметры) Экспорт
	
	Если НовыеНастройки <> Неопределено Тогда
		Если НовыеНастройки = Ложь Тогда
			УдалитьВиджетФормы(ДополнительныеПараметры.Виджет);
			Возврат;
		КонецЕсли;
		ОбновитьВиджетНаСервере(ДополнительныеПараметры.ИндексВиджета);
		Если Число(ДополнительныеПараметры.ИндексВиджета) <= 4 Тогда
			ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДополнительныеПараметры.ИндексВиджета);
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДополнительныеПараметры.ИндексВиджета, НовыеНастройки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВид(Команда)
	УстановитьПараметрыФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПисьмоИзАРМПланировщик(Команда)
	ЕстьЛиды = ЕстьЛидыВВыбранныхСтроках();
	Если ЕстьЛиды Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СкрытьПисьмоИзАРМПланировщикЗавершение", ЭтотОбъект, ЕстьЛиды);
		ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения",, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
			ЗадатьВопросПриПереносеВОбработанные();
		Иначе
			ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтобразитьВиджеты(Команда)
	ПоказыватьВиджетыПриОткрытии = НЕ ПоказыватьВиджетыПриОткрытии;
	Элементы.ГруппаВиджеты.Видимость = ПоказыватьВиджетыПриОткрытии;
	СохранитьНастройкуПоказыватьВиджеты(ЭтотОбъект.ИмяФормы, ПоказыватьВиджетыПриОткрытии);
	
	Элементы.СкрытьОтобразитьВиджеты.Пометка = ПоказыватьВиджетыПриОткрытии;
	
	Если ПоказыватьВиджетыПриОткрытии Тогда
		ОбновитьВиджетыФормы();
		Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
			Если Число(ЭлементСписка.Представление) <= 4 Тогда
				ПериодОбновленияВиджета = ПолучитьПериодОбновленияВиджетаНаСервере(ЭлементСписка.Значение, ЭлементСписка.Представление);
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление, ПериодОбновленияВиджета);
			ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
				ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе	
		Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
			Если Число(ЭлементСписка.Представление) <= 4 Тогда
				ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление);
			ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
				ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("АРММоиДела"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛичнуюЗадачу(Команда)
	ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачиКраткая",, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачуПроекта(Команда)
	ДобавитьЭтапКонтрольнуюТочку(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКТПроекта(Команда)
	ДобавитьЭтапКонтрольнуюТочку(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтр(Команда)
	ОписаниеОповещенияФильтра = Новый ОписаниеОповещения("ОткрытьФильтрЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый структура;
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("ОтборВключен", ОтборВключен);
	СтруктураФильтра.Вставить("ОтображатьЗвонки", ОтображатьЗвонки);
	СтруктураФильтра.Вставить("ОтображатьПисьма", ОтображатьПисьма);
	СтруктураФильтра.Вставить("ОтображатьСообщенияЧатов", ОтображатьСообщенияЧатов);
	СтруктураФильтра.Вставить("ВариантПериода", ВариантПериода);
	СтруктураФильтра.Вставить("ПоискКлиент", ПоискКлиент);
	СтруктураФильтра.Вставить("ТекущийПользователь", ТекущийПользователь);
	ПараметрыОткрытия.Вставить("СтруктураФильтра", СтруктураФильтра);
	ОткрытьФорму("Обработка.CRM_АРМ_МоиДела.Форма.ФормаФильтра", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияФильтра, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	//ОткрытьФорму("ВнешняяОбработка.CRM_АРМ_МоиДела.Форма.ФормаФильтра", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияФильтра, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрНаСервере(Результат)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
	СформироватьПредставлениеПериода();	
	
	ОбновитьОтборыНаСервере("Все");
	ОбновитьВиджетыФормы();
	ОбновитьЗаголовкиТаблиц();
	Заголовок = НСтр("ru='Мои дела';en='My Affairs'")+" / "+ ТекущийПользователь +" / " + ПредставлениеПериода;
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеПериода()
	Если ВариантПериода = "" Тогда
		ПериодОтбора = Новый СтандартныйПериод;
		ОтборСозданы[0].Значение = ПериодОтбора;
		ПредставлениеПериода = ПредставлениеПериода(ПериодОтбора.ДатаНачала, ПериодОтбора.ДатаОкончания, );
	Иначе
		Если ВариантПериода = "ПроизвольныйПериод" Тогда
			НомерПериода = 0;
		ИначеЕсли ВариантПериода = "Сегодня" Тогда
			НомерПериода = 1;
		ИначеЕсли ВариантПериода = "3 дня" Тогда
			НомерПериода = 2;
		ИначеЕсли ВариантПериода = "Неделя" Тогда
			НомерПериода = 3;
		ИначеЕсли ВариантПериода = "Месяц" Тогда
			НомерПериода = 4;
		КонецЕсли;
		
		Период = ОтборСозданы[НомерПериода];
		ПериодОтбора = ОтборСозданы[НомерПериода].Значение;
		ЗначениеПериода = СписокПериодов.НайтиПоЗначению(ВариантПериода);
		Если ЗначениеПериода<>Неопределено Тогда
			ПредставлениеПериода = ЗначениеПериода.Представление;
		КонецЕсли;
		Если НомерПериода = 0 Тогда
			Если ЗначениеЗаполнено(Период.Значение.ДатаНачала) Или ЗначениеЗаполнено(Период.Значение.ДатаОкончания) Тогда
				Период.Пометка = Истина;
			Иначе
				Период.Пометка = Ложь;
			КонецЕсли;
		Иначе
			Период.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтр(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаСервере
Функция ОчиститьНаСервере()
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("ОтборВключен", Ложь);
	СтруктураФильтра.Вставить("ВариантПериода", "");
	СтруктураФильтра.Вставить("ПоискКлиент", Справочники.Партнеры.ПустаяСсылка());
	СтруктураФильтра.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
	УстановитьФильтрНаСервере(СтруктураФильтра)
		
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьЗаголовок()
	
	Заголовок = НСтр("ru='Мои дела';en='My Affairs'")+" / "+ ТекущийПользователь +" / " + ПредставлениеПериода;
	ОбновитьЗаголовкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьВыделенныестроки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяТаблица = Элемент.Имя; 
	ПодключитьОбработчикОжидания("АРМПриАктивизацииСтрокиОбработка", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АРМПриАктивизацииСтрокиОбработка()
	
	МассивТаблиц = Новый Массив;
	МассивТаблиц.Добавить("ТаблицаВходящие");
	МассивТаблиц.Добавить("ТаблицаЗавершенные");
	МассивТаблиц.Добавить("ТаблицаОтложенные");
	МассивТаблиц.Добавить("ТаблицаТекущие");
	МассивТаблиц.Добавить("ТаблицаСписок");
	
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		
		Если АктивнаяТаблица = ИмяТаблицы Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы[ИмяТаблицы].ВыделенныеСтроки.Очистить();
		Элементы[ИмяТаблицы].ТекущаяСтрока = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиТаблиц()
	
	КоличествоОбъектов = CRM_ОбщегоНазначенияСервер.ВернутьКоличествоЭлементовВДинамическомСписке(ЭтотОбъект, "ТаблицаВходящие");
	Если КоличествоОбъектов > 0 Тогда
		Элементы["ЗаголовокВходящие"].Заголовок = НСтр("ru='Входящие';en='Incoming'")+": "+КоличествоОбъектов;
		Элементы["ГруппаСтраницаВходящие"].Заголовок = НСтр("ru='Входящие';en='Incoming'")+": "+КоличествоОбъектов;
	Иначе	
		Элементы["ЗаголовокВходящие"].Заголовок = НСтр("ru='Входящие';en='Incoming'");
		Элементы["ГруппаСтраницаВходящие"].Заголовок = НСтр("ru='Входящие';en='Incoming'");
	КонецЕсли;	
	КоличествоОбъектов = CRM_ОбщегоНазначенияСервер.ВернутьКоличествоЭлементовВДинамическомСписке(ЭтотОбъект, "ТаблицаОтложенные");
	Если КоличествоОбъектов > 0 Тогда
		Элементы["ЗаголовокОтложенные"].Заголовок = НСтр("ru='Отложенные';en='Deferred'")+": "+КоличествоОбъектов;
		Элементы["ГруппаСтраницаОтложенные"].Заголовок = НСтр("ru='Отложенные';en='Deferred'")+": "+КоличествоОбъектов;
	Иначе	
		Элементы["ЗаголовокОтложенные"].Заголовок = НСтр("ru='Отложенные';en='Deferred'");
		Элементы["ГруппаСтраницаОтложенные"].Заголовок = НСтр("ru='Отложенные';en='Deferred'");
	КонецЕсли;
	КоличествоОбъектов = CRM_ОбщегоНазначенияСервер.ВернутьКоличествоЭлементовВДинамическомСписке(ЭтотОбъект, "ТаблицаТекущие");
	Если КоличествоОбъектов > 0 Тогда
		Элементы["ЗаголовокТекущие"].Заголовок = НСтр("ru='Текущие';en='Current'")+": "+КоличествоОбъектов;
		Элементы["ГруппаСтраницаТекущие"].Заголовок = НСтр("ru='Текущие';en='Current'")+": "+КоличествоОбъектов;
	Иначе	
		Элементы["ЗаголовокТекущие"].Заголовок = НСтр("ru='Текущие';en='Current'");
		Элементы["ГруппаСтраницаТекущие"].Заголовок = НСтр("ru='Текущие';en='Current'");
	КонецЕсли;
	КоличествоОбъектов = CRM_ОбщегоНазначенияСервер.ВернутьКоличествоЭлементовВДинамическомСписке(ЭтотОбъект, "ТаблицаЗавершенные");
	Если КоличествоОбъектов > 0 Тогда
		Элементы["ЗаголовокЗавершенные"].Заголовок = НСтр("ru='Завершенные';en='Completed'")+": "+КоличествоОбъектов;
		Элементы["ГруппаСтраницаЗавершенные"].Заголовок = НСтр("ru='Завершенные';en='Completed'")+": "+КоличествоОбъектов;
	Иначе	
		Элементы["ЗаголовокЗавершенные"].Заголовок = НСтр("ru='Завершенные';en='Completed'");
		Элементы["ГруппаСтраницаЗавершенные"].Заголовок = НСтр("ru='Завершенные';en='Completed'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьПисьмоИзАРМНаСервере(ПричинаОтказа=Неопределено, Комментарий="", ПереноситьПисьмаВОбработанные = Истина)
	Если Элементы.ТаблицаВходящие.ВыделенныеСтроки.Количество() > 0 Тогда
		
		Для Каждого  ТекСтрока Из Элементы.ТаблицаВходящие.ВыделенныеСтроки Цикл
			Если ТекСтрока <> Неопределено Тогда
				Если ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.ТелефонныйЗвонок") ИЛИ ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
					ИЛИ ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") ИЛИ ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.CRM_Заявка") Тогда
					
					СостояниеЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(ТекСтрока.Объект);
					
					Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(ТекСтрока.Объект) Тогда
						РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(ТекСтрока.Объект, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа, Комментарий); 
					ИначеЕсли СостояниеЛида <> Неопределено и СостояниеЛида.Состояние = Справочники.CRM_СостоянияЛидов.Повторный Тогда
							РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(ТекСтрока.Объект,
																						Справочники.CRM_СостоянияЛидов.ПовторныйОбработанный,
																						СостояниеЛида.СконвертированВОбъект);
					КонецЕсли;
					Об = ТекСтрока.Объект.ПолучитьОбъект();
					Об.CRM_СкрытьВАРМ = Истина;
					Об.Записать();
					
					Если ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
						
						// Перенос в обработанные осуществляется, если учетная запись конкретного письма разрешает данное действие,
						// а при наличии необходимости задавать вопрос о переносе - на него был дан утвердительный ответ ранее на стороне Клиента:
						Если Об.УчетнаяЗапись.CRM_ПереноситьВОбработанные И ПереноситьПисьмаВОбработанные Тогда						
							Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Об.УчетнаяЗапись, "Обработанные");
							Взаимодействия.УстановитьПапкуЭлектронногоПисьма(Об.Ссылка, Папка, Ложь);
							
							ПрочитанныеПисьма = Новый Массив;
							ПрочитанныеПисьма.Добавить(Об.Ссылка);
							CRM_УправлениеЭлектроннойПочтой.УстановитьСнятьПометкуОПрочтении(ПрочитанныеПисьма, Истина);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЕстьЛидыВВыбранныхСтроках()
	МассивСсылок = Новый Массив;
	Для Каждого  ТекСтрока Из Элементы.ТаблицаВходящие.ВыделенныеСтроки Цикл
		МассивСсылок.Добавить(ТекСтрока.Объект);
	КонецЦикла;
	Возврат РегистрыСведений.CRM_СостоянияЛидов.ЕстьЛидыВМассивеСсылок(МассивСсылок, Истина);
КонецФункции

&НаКлиенте
Процедура СкрытьПисьмоИзАРМПланировщикЗавершение(Результат, ЕстьЛиды) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("ПричинаОтказа")
			И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
		
		Если НеобходимоЗадатьВопросПриПереносеВОбработанные() Тогда
			ЗадатьВопросПриПереносеВОбработанные(Результат);
		Иначе
			ВопросПриПереносеВОбработанныеЗавершение(КодВозвратаДиалога.Да, Результат);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриПереносеВОбработанныеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПереноситьПисьмаВОбработанные = (Результат = КодВозвратаДиалога.Да);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		СкрытьПисьмоИзАРМНаСервере(ДополнительныеПараметры.ПричинаОтказа, ДополнительныеПараметры.Комментарий, ПереноситьПисьмаВОбработанные);
	Иначе
		СкрытьПисьмоИзАРМНаСервере(,,ПереноситьПисьмаВОбработанные);
	КонецЕсли;
	
	Оповестить("ОбновитьАРМ",, ЭтотОбъект);
	Элементы.ТаблицаВходящие.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПриПереносеВОбработанные(ДополнительныеПараметры = Неопределено)
	ТекстВопроса = НСтр("ru = 'Перенести письмо в папку обработанные?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриПереносеВОбработанныеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,,);
КонецПроцедуры

&НаСервере
Функция НеобходимоЗадатьВопросПриПереносеВОбработанные()
		
	Для Каждого ТекСтрока Из Элементы.ТаблицаВходящие.ВыделенныеСтроки Цикл
		Если ТекСтрока <> Неопределено Тогда
			Если ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
				УчетнаяЗапись = ТекСтрока.Объект.УчетнаяЗапись;
				Если УчетнаяЗапись.CRM_ЗадаватьВопросПриПереносеВОбработанные Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
					
КонецФункции

&НаКлиенте
Процедура ОбновитьДанные(Откуда, Куда)
	
	Элементы["Таблица"+Откуда].Обновить();
	//Элементы["Таблица"+Куда].Обновить();
	ОбновитьЗаголовкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовуюЛичнуюЗадачуВФоне(ЗвонокПисьмо, НовоеИзмерение)
	
	ОбъектЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	ОбъектЗадача.Автор						= ТекущийПользователь;
	ОбъектЗадача.Исполнитель				= ОбъектЗадача.Автор;
	ОбъектЗадача.ПринятаКИсполнению			= Истина;
	ОбъектЗадача.Наименование				= ЗвонокПисьмо.Тема;
	ОбъектЗадача.Дата						= ТекущаяДатаСеанса();
	ОбъектЗадача.ДатаНачала					= ТекущаяДатаСеанса();
	ОбъектЗадача.Выполнена 					= Ложь;
	ОбъектЗадача.ДатаИсполнения				= ТекущаяДатаСеанса();
	ОбъектЗадача.СрокИсполнения				= ТекущаяДатаСеанса();
	ОбъектЗадача.CRM_Личная					= Истина;
	ОбъектЗадача.Предмет					= ЗвонокПисьмо;
	ОбъектЗадача.ПредметСтрокой				= CRM_БизнесПроцессыИЗадачиСервер.ПредметСтрокой(ЗвонокПисьмо);
	ОбъектЗадача.Описание = "Тема: " + ЗвонокПисьмо.Тема + "
											|Введено на основании: " + ЗвонокПисьмо.Ссылка;
	Если ТипЗнч(ЗвонокПисьмо) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Если ЗначениеЗаполнено(ЗвонокПисьмо.ОтправительКонтакт)	Тогда
			Если ТипЗнч(ЗвонокПисьмо.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				ОбъектЗадача.CRM_КонтактноеЛицо		= ЗвонокПисьмо.ОтправительКонтакт;
				ОбъектЗадача.CRM_Партнер			= ОбъектЗадача.CRM_КонтактноеЛицо.Владелец;
			ИначеЕсли ТипЗнч(ЗвонокПисьмо.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
				ОбъектЗадача.CRM_Партнер			= ЗвонокПисьмо.ОтправительКонтакт;
				ОбъектЗадача.CRM_КонтактноеЛицо		= ОбъектЗадача.CRM_Партнер.CRM_ОсновноеКонтактноеЛицо;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗвонокПисьмо) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		Если ЗначениеЗаполнено(ЗвонокПисьмо.Контакт)	Тогда
			Если ТипЗнч(ЗвонокПисьмо.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				ОбъектЗадача.CRM_КонтактноеЛицо		= ЗвонокПисьмо.Контакт;
				ОбъектЗадача.CRM_Партнер			= ОбъектЗадача.CRM_КонтактноеЛицо.Владелец;
			ИначеЕсли ТипЗнч(ЗвонокПисьмо.Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
				ОбъектЗадача.CRM_Партнер			= ЗвонокПисьмо.Контакт;
				ОбъектЗадача.CRM_КонтактноеЛицо		= ОбъектЗадача.CRM_Партнер.CRM_ОсновноеКонтактноеЛицо;
			КонецЕсли;
		КонецЕсли;
		ОбъектЗадача.Описание = "Сообщение: " + ЗвонокПисьмо.ТекстСообщения;
	Иначе
		Если ЗначениеЗаполнено(ЗвонокПисьмо.АбонентКонтакт)	Тогда
			Если ТипЗнч(ЗвонокПисьмо.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				ОбъектЗадача.CRM_КонтактноеЛицо		= ЗвонокПисьмо.АбонентКонтакт;
				ОбъектЗадача.CRM_Партнер			= ОбъектЗадача.CRM_КонтактноеЛицо.Владелец;
			ИначеЕсли ТипЗнч(ЗвонокПисьмо.АбонентКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
				ОбъектЗадача.CRM_Партнер			= ЗвонокПисьмо.АбонентКонтакт;
				ОбъектЗадача.CRM_КонтактноеЛицо		= ОбъектЗадача.CRM_Партнер.CRM_ОсновноеКонтактноеЛицо;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//
	ОбъектЗадача.Записать();
	
	Менеджер = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
	Менеджер.Объект = ОбъектЗадача.Ссылка;
	Менеджер.НаименованиеАРМ = "МоиДела";
	Менеджер.ИзмерениеАРМ = "Текущие";
	Менеджер.Пользователь = ТекущийПользователь;
	Менеджер.Прочитать();
	Менеджер.ИзмерениеАРМ = НовоеИзмерение;
	Менеджер.Записать(Истина);
	
	ЗвонокПисьмоОбъект = ЗвонокПисьмо.ПолучитьОбъект();
	ЗвонокПисьмоОбъект.CRM_СкрытьВАРМ = Истина;
	ЗвонокПисьмоОбъект.ДополнительныеСвойства.Вставить("НеЗапускатьТриггер", Истина);
	Если Не ЗначениеЗаполнено(ЗвонокПисьмоОбъект.Ответственный) Тогда
		ЗвонокПисьмоОбъект.Ответственный = ТекущийПользователь;
	КонецЕсли;
	ЗвонокПисьмоОбъект.Записать();

КонецПроцедуры

&НаСервере
Функция ПроверкаПеретаскиванияНаСервере(Строка, НовоеИзмерение, СтрокаПереноса = Неопределено, Результат = "")
	Если ТипЗнч(Строка) = Тип("Массив") Тогда
		Строка =  Строка[0];
	КонецЕсли;	
	Если ТипЗнч(Строка.Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") ИЛИ ТипЗнч(Строка.Объект) = Тип("ДокументСсылка.ТелефонныйЗвонок") ИЛИ ТипЗнч(Строка.Объект) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		СоздатьНовуюЛичнуюЗадачуВФоне(Строка.Объект, НовоеИзмерение);
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрокаПереноса = Неопределено Тогда
		ДатаПереноса = Неопределено;
	ИначеЕсли ТипЗнч(СтрокаПереноса) = Тип("РегистрСведенийКлючЗаписи.CRM_ОбъектыАРМ") Тогда
		
		ДатаПереноса = ПолучитьДатуЗаписи(СтрокаПереноса);
	Иначе	
		ДатаПереноса = СтрокаПереноса.Ключ;
	КонецЕсли;
	Если ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат Неопределено КонецЕсли;
	Если ТипЗнч(Строка.Объект) = Тип("ДокументСсылка.удалитьCRM_Мероприятие") Тогда
		Если Строка.Объект.Ответственный <> Пользователи.АвторизованныйПользователь() И НовоеИзмерение = "Завершенные" Тогда
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	Пользователь = Строка.Пользователь;
	Если Строка.ИзмерениеАРМ = "Входящие" И ТипЗнч(Строка.Объект) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
		И НЕ Строка.Объект.ПринятаКИсполнению И Не ЗначениеЗаполнено(Строка.Объект.Исполнитель) Тогда
		МассивЗадач = Новый Массив;
		МассивЗадач.Добавить(Строка.Объект);
		CRM_БизнесПроцессыИЗадачиВызовСервера.ПринятьЗадачиКИсполнению(МассивЗадач);
		Пользователь = Строка.Объект.Исполнитель
	КонецЕсли;	
	Если ТипЗнч(Строка.Объект) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда
		ДанныеЭтапаКалендарногоПлана = Новый Структура;
		Если НовоеИзмерение = "Завершенные" Тогда
				
			Если НЕ ЗначениеЗаполнено(Строка.Объект.ФактическаяДатаНачала) Тогда
				ДанныеЭтапаКалендарногоПлана.Вставить("ФактическаяДатаНачала", Строка.Объект.ПлановаяДатаНачала);
				ФактическаяДатаНачала = Строка.Объект.ПлановаяДатаНачала;
			Иначе
				ФактическаяДатаНачала = Строка.Объект.ФактическаяДатаНачала;
			КонецЕсли;
			ДанныеЭтапаКалендарногоПлана.Вставить("ФактическаяДатаОкончания", ТекущаяДатаСеанса());
			ДанныеЭтапаКалендарногоПлана.Вставить("ФактическаяДлительность", (КонецДня(ТекущаяДатаСеанса()) - НачалоДня(ФактическаяДатаНачала)+1)/86400);
			Если Пользователи.ЭтоПолноправныйПользователь() ИЛИ Строка.Объект.Проект.Ответственный = ТекущийПользователь Тогда
				ДанныеЭтапаКалендарногоПлана.Вставить("Статус", Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Проверена);
			Иначе
				ДанныеЭтапаКалендарногоПлана.Вставить("Статус", Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Выполнена);
			КонецЕсли;
			Если ЗначениеЗаполнено(Результат) Тогда
				ДанныеЭтапаКалендарногоПлана.Вставить("Результат", Результат);
			КонецЕсли;
			ИзменитьЭтапКалендарногоПлана(Строка.Объект, ДанныеЭтапаКалендарногоПлана);
			Прогноз = CRM_УправлениеПроектамиВызовСервера.ПолучитьПрогноз(Строка.Объект.Проект);
			Если Строка.Объект.Проект.CRM_ПрогнозЗавершенияПроекта <> Прогноз Тогда
				ПроектОбъект = Строка.Объект.Проект.ПолучитьОбъект();
				ПроектОбъект.CRM_ПрогнозЗавершенияПроекта = Прогноз;
				ПроектОбъект.Записать();
			КонецЕсли;
			
		ИначеЕсли НовоеИзмерение = "Текущие" Тогда
			
			Если Строка.Объект.Проект.CRM_Статус <> Перечисления.CRM_СтатусыПроектов.ВРаботе Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для смены статуса проект должен иметь статус ""В работе""';en='Project must have the status ""In progress"" to change status'"));
				Возврат Неопределено;
			КонецЕсли;
			ДанныеЭтапаКалендарногоПлана.Вставить("ФактическаяДатаНачала", ТекущаяДатаСеанса());
			Если Строка.Объект.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована Тогда
				ДанныеЭтапаКалендарногоПлана.Вставить("Статус", Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе);
			КонецЕсли;
			ИзменитьЭтапКалендарногоПлана(Строка.Объект, ДанныеЭтапаКалендарногоПлана);
			
		КонецЕсли;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Строка.Объект);
	НаборЗаписей.Отбор.НаименованиеАРМ.Установить(Строка.НаименованиеАРМ);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей[0].ИзмерениеАРМ = НовоеИзмерение;
	НаборЗаписей.Записать(Истина);
	
	СтруктураНовогоКлюча = Новый Структура("НаименованиеАРМ,ИзмерениеАРМ,Пользователь,СостояниеИнтереса,Объект");
	ЗаполнитьЗначенияСвойств(СтруктураНовогоКлюча, Строка);
	СтруктураНовогоКлюча.ИзмерениеАРМ = НовоеИзмерение;
	
	Возврат РегистрыСведений.CRM_ОбъектыАРМ.СоздатьКлючЗаписи(СтруктураНовогоКлюча);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьЭтапКалендарногоПлана(Этап, ДанныеЭтапаКалендарногоПлана);
	
	ЭтапКалендарногоПлана = Этап.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(ЭтапКалендарногоПлана, ДанныеЭтапаКалендарногоПлана);
	ЭтапКалендарногоПлана.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗадачу(СсылкаИлиСтруктура, СнятьСКонтроля = Ложь)
	
	Если ТипЗнч(СсылкаИлиСтруктура) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если СсылкаИлиСтруктура.CRM_Личная Тогда
			тОбъект = СсылкаИлиСтруктура.ПолучитьОбъект();
			тОбъект.Выполнена = Истина;
			тОбъект.Записать();
		Иначе
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(СсылкаИлиСтруктура) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
	ИначеЕсли ТипЗнч(СсылкаИлиСтруктура) = Тип("Структура") И СсылкаИлиСтруктура.Свойство("Успех") И НЕ СсылкаИлиСтруктура.Успех Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СсылкаИлиСтруктура.Сообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуЗаписи(СтрокаЗаписи)
	
	Менеджер = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
	Менеджер.Объект = СтрокаЗаписи.Объект;
	Менеджер.НаименованиеАРМ = СтрокаЗаписи.НаименованиеАРМ;
	Менеджер.ИзмерениеАРМ = СтрокаЗаписи.ИзмерениеАРМ;
	Менеджер.Пользователь = СтрокаЗаписи.Пользователь;
	Менеджер.Прочитать();
	Возврат Менеджер.ДатаДляСортировки;
	
КонецФункции	

&НаСервере
Функция ПолучитьИмяИзмерения(Значение)
	
	Возврат Значение.ИзмерениеАРМ;
	
КонецФункции

&НаСервере
Функция ПолучитьОбъектДействия(СтрокаСписка)
	Если ТипЗнч(СтрокаСписка) = Тип("Массив") Тогда
		Возврат СтрокаСписка[0].Объект;;
	Иначе
		Возврат СтрокаСписка.Объект;
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуТекущейАктивности()
	Если ТипЗнч(ТекущаяАктивность) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущаяАктивность);
		ОткрытьФорму("Задача.ЗадачаИсполнителя.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, , );
	ИначеЕсли ТипЗнч(ТекущаяАктивность) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущаяАктивность);
		ОткрытьФорму("Документ.CRM_Взаимодействие.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, , );
	КонецЕсли;
	ТекущаяАктивность = Неопределено;
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьПеретаскивания(Строка, НовоеИзмерение)
	Если ТипЗнч(Строка.Объект) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда
		Если НовоеИзмерение = "Завершенные" Тогда
			Если Строка.Объект.Проект.CRM_Статус <> Перечисления.CRM_СтатусыПроектов.ВРаботе 
				ИЛИ Строка.Объект.Статус <> Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для смены статуса проект и этап должны иметь статус ""В работе""';en='Project and stage must be in status ""In progress"" to change it'"));
				Возврат Ложь;
			КонецЕсли;
			
			УстановкаРазрешена = Истина;
		
			// Проверим наличие файлов с необходимым контекстом
			СписокНедостающихКонтекстов = Новый СписокЗначений;
				
			CRM_УправлениеПроектамиВызовСервера.ПроверитьНаличиеФайловСНужнымКонтекстом(Строка.Объект, СписокНедостающихКонтекстов);
				
			Если СписокНедостающихКонтекстов.Количество() > 0 Тогда
				УстановкаРазрешена = Ложь; 
			КонецЕсли;
				
			Если НЕ УстановкаРазрешена Тогда
				Если Строка.Объект.ТипЭтапа = ПредопределенноеЗначение("Перечисление.CRM_ТипыЭтапов.Этап") Тогда
					Сообщение = НСтр("ru='Для завершения задачи необходимо присоединить файл(ы) следующего контекста:';en='It is necessary to attach the file(s) to complete task in following context:'");
				Иначе
					Сообщение = НСтр("ru='Для завершения контрольной точки необходимо присоединить файл(ы) следующего контекста:';en='To complete checkpoint, attach file(s) of following context:'");
				КонецЕсли;
				Для каждого ЭлементСписка Из СписокНедостающихКонтекстов Цикл
					Сообщение  = Сообщение + Символы.ПС + "  - " + ЭлементСписка.Значение;
				КонецЦикла;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПослеВводаРезультата(Результат, Строка) Экспорт
	Если Результат <> Неопределено Тогда
		ПроверкаПеретаскиванияНаСервере(Строка, "Завершенные",, Результат);
		ОбновитьДанные(ПолучитьИмяИзмерения(Строка), "Завершенные");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОбъекта(ВыбраннаяСтрока)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Объект", ВыбраннаяСтрока.Объект);
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаСервере
Процедура ТекущийПользовательПриИзмененииНаСервере()
	
	РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь).ВыгрузитьЗначения();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "Измерение", "Входящие", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ОтображатьЗвонки", НЕ ОтображатьЗвонки, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ОтображатьПисьма", НЕ ОтображатьПисьма, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "Пользователь", ТекущийПользователь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "РолиПользователя", РолиПользователя, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ПустаяДата", Дата('00010101'), Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЗавершенные, "Измерение", "Завершенные", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЗавершенные, "Пользователь", ТекущийПользователь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЗавершенные, "РолиПользователя", РолиПользователя, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаОтложенные, "Измерение", "Отложенные", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаОтложенные, "Пользователь", ТекущийПользователь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаОтложенные, "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаОтложенные, "ПустаяДата", Дата('00010101'), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаОтложенные, "РолиПользователя", РолиПользователя, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТекущие, "Измерение", "Текущие", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТекущие, "Пользователь", ТекущийПользователь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТекущие, "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТекущие, "ПустаяДата", Дата('00010101'), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТекущие, "РолиПользователя", РолиПользователя, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаСписок, "Пользователь", ТекущийПользователь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаСписок, "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаСписок, "ПустаяДата", Дата('00010101'), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаСписок, "РолиПользователя", РолиПользователя, Истина);
	
	// +Виджеты
	Если ПоказыватьВиджетыПриОткрытии Тогда
		ОбновитьВиджетыФормы();
	КонецЕсли;	
	// -Виджеты
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыФормы(Форма)
	Форма.Элементы.ГруппаАРМ.Видимость = (Форма.ВидАРМ = "Канбан");
	Форма.Элементы.ГруппаСписок.Видимость = НЕ Форма.Элементы.ГруппаАРМ.Видимость;
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектСтроки(СтрокаРС)
	Если СтрокаРС <> Неопределено Тогда
		Возврат СтрокаРС.Объект;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции	

&НаКлиенте
Процедура ОбновитьТаблицы()
	
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("ТаблицаОтложенные");
	МассивТаблиц.Добавить("ТаблицаТекущие");
	МассивТаблиц.Добавить("ТаблицаСписок");
	
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		ЭлементыПользовательскихНастроек = ЭтотОбъект[ИмяТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		Для Каждого Элемент Из ЭлементыПользовательскихНастроек Цикл
			Если ТипЗнч(Элемент) = ТипЗнч(ЭтотОбъект[ИмяТаблицы].КомпоновщикНастроек.Настройки.Порядок) Тогда
				Элемент.Элементы.Очистить();
				
				Если ОтборВключатьПросроченные <> -1 Тогда
					УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
					УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("Просрочено");
					УсловиеСортировки.ТипУпорядочивания = ?(ОтборВключатьПросроченные = 1, НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировкиКомпоновкиДанных.Убыв);
					УсловиеСортировки.Использование = Истина;
				КонецЕсли;
				
				УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
				УсловиеСортировки.Использование = Истина;
				УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаДляСортировки");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	МассивТаблиц.Добавить("ТаблицаВходящие");
	МассивТаблиц.Добавить("ТаблицаЗавершенные");
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы[ИмяТаблицы].Обновить();
		Элементы[ИмяТаблицы].ВыделенныеСтроки.Очистить();
	КонецЦикла;
	
	СформироватьЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыНаСервере(ВидОтборов)
	
	РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь).ВыгрузитьЗначения();
	
	ТекущаяДатаВремя = ТекущаяДатаСеанса();
	
	МассивТаблиц = Новый Массив;
	МассивТаблиц.Добавить("ТаблицаВходящие");
	МассивТаблиц.Добавить("ТаблицаЗавершенные");
	МассивТаблиц.Добавить("ТаблицаОтложенные");
	МассивТаблиц.Добавить("ТаблицаТекущие");
	МассивТаблиц.Добавить("ТаблицаСписок");
	
	Период = ОтборСозданы.НайтиПоЗначению(ПериодОтбора);
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "КрайнийСрокОкончание", Период.Значение.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , Период.Пометка, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
		ГруппаОтборСтрокаПоиска = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭтотОбъект[ИмяТаблицы].Отбор.Элементы, "ОтборСтрокаПоиска", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ЭлементОтбора = ГруппаОтборСтрокаПоиска.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заголовок");
		ЭлементОтбора = ГруппаОтборСтрокаПоиска.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекстОснования");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "Заголовок", "%"+СтрокаПоискаОтбор+"%", ВидСравненияКомпоновкиДанных.Подобно, ,  ЗначениеЗаполнено(СтрокаПоискаОтбор), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	  
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "ТекстОснования", "%"+СтрокаПоискаОтбор+"%", ВидСравненияКомпоновкиДанных.Подобно, ,  ЗначениеЗаполнено(СтрокаПоискаОтбор), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	  
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "Пользователь", ТекущийПользователь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "РолиПользователя", РолиПользователя, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "ПустаяДата", Дата('00010101'), Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "ПериодПросроченных", НачалоДня(ТекущаяДатаСеанса()), Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект[ИмяТаблицы], "Клиент", ПоискКлиент, ВидСравненияКомпоновкиДанных.Равно, ,  ЗначениеЗаполнено(ПоискКлиент), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	  
	КонецЦикла;

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "Измерение", "Входящие", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ОтображатьЗвонки", НЕ ОтображатьЗвонки, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ОтображатьПисьма", НЕ ОтображатьПисьма, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаВходящие, "ОтображатьСообщенияЧатов", НЕ ОтображатьСообщенияЧатов, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЗавершенные, "Измерение", "Завершенные", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаОтложенные, "Измерение", "Отложенные", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТекущие, "Измерение", "Текущие", Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборы()
	
	ОбновитьОтборыНаСервере("все");
	
	ОбновитьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеТекущаяДатаВремя()
	ТекущаяДатаВремя = ВернутьДатуСеанса();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ОткрытьФильтрЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьФильтрНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры


#Область РаботаСЭлементамиФормы

&НаСервере
Процедура СоздатьКнопкиВидАРМ()
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "ГруппаГруппаВидАРМ");
	СтруктураКоманднаяПанель.Вставить("Родитель", "ГруппаВидАРМ");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "ЭлементГруппаВидАРМ");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидКанбан";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Канбан';en='Kanban'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ВидКанбан");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	СтруктураКнопка.Вставить("Пометка", Истина);

	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидСписок";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Список';en='List'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ВидСписок");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопиОтборПросроченные()
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "ГруппаОтборВключатьПросроченные");
	СтруктураКоманднаяПанель.Вставить("Родитель", "ГруппаОтборПросроченные");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "ЭлементГруппаОтборВключатьПросроченные");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВнизу";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Внизу';en='Down'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ПросроченныеВнизу");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВверху";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru='Вверху';en='Up'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", "ПросроченныеВверху");
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
КонецПроцедуры	

&НаСервере
Процедура ПокраситьКнопкиВидАРМНаСервере(ВидАрм)
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидКанбан";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(ВидАрм = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ВидСписок";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(ВидАрм = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
КонецПроцедуры	

&НаСервере
Процедура ПокраситьКнопкиПросроченныеНаСервере()
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВнизу";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(ОтборВключатьПросроченные = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "ПросроченныеВверху";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(ОтборВключатьПросроченные = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
КонецПроцедуры	

&НаКлиенте
Процедура ПросроченныеВнизу(Команда)
	ОтборВключатьПросроченные = 1;
	ОбновитьОтборы();
	ПокраситьКнопкиПросроченныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеВверху(Команда)
	ОтборВключатьПросроченные = 2;
	ОбновитьОтборы();
	ПокраситьКнопкиПросроченныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидКанбан(Команда)
	Элементы.ГруппаАРМ.Видимость = Истина;
	Элементы.ГруппаСписок.Видимость = Ложь;
	Элементы.НастроитьШиринуКолонок.Видимость = Истина;
	ПокраситьКнопкиВидАРМНаСервере(1);
КонецПроцедуры

&НаКлиенте
Процедура ВидСписок(Команда)
	Элементы.ГруппаАРМ.Видимость = Ложь;
	Элементы.ГруппаСписок.Видимость = Истина;
	Элементы.НастроитьШиринуКолонок.Видимость = Ложь;
	Элементы.ГруппаПолосаРегулированияВсплывающая.Скрыть();
	Элементы.ГруппаПолосаРегулированияВсплывающая.Видимость = Ложь;
	Элементы.ДекорацияРазделительРегулировки.Видимость = Истина;
	ПокраситьКнопкиВидАРМНаСервере(2);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьШиринуКолонокКанбан()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	Иначе
		ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	КонецЕсли;
	
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("Входящие");
	МассивТаблиц.Добавить("Отложенные");
	МассивТаблиц.Добавить("Текущие");
	МассивТаблиц.Добавить("Завершенные");

	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы["Таблица" + ИмяТаблицы].Ширина   = ШиринаКолонокКанбан;
		Элементы["Заголовок" + ИмяТаблицы].Ширина = ШиринаКолонокКанбан;
		Элементы["ЗаголовокЧерта" + ИмяТаблицы].Ширина = ШиринаКолонокКанбан;
		Элементы["ТаблицаЗаголовок_Этап_" + ИмяТаблицы].Ширина = ШиринаЭлемента;
		
		//Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		//	Элементы["ТаблицаТекстОснования_Этап_" + ИмяТаблицы].Ширина = 4;
		//Иначе
			Элементы["ТаблицаТекстОснования_Этап_" + ИмяТаблицы].Ширина = ШиринаЭлемента;
			Элементы["ТаблицаЗаголовок_Этап_" + ИмяТаблицы].Ширина = ШиринаЭлемента;
		//КонецЕсли;
	КонецЦикла;
	
	ТекущийЭлемент = Элементы.ШиринаКолонокКанбан;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьШиринуКолонокКанбанСервер()
	Возврат;
	ШиринаКолонокКанбан = 30;
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	Иначе
		ШиринаЭлемента = ШиринаКолонокКанбан - 8;
	КонецЕсли;
	
	МассивТаблиц = Новый Массив;
	
	МассивТаблиц.Добавить("Входящие");
	МассивТаблиц.Добавить("Отложенные");
	МассивТаблиц.Добавить("Текущие");
	МассивТаблиц.Добавить("Завершенные");

	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		Элементы["Таблица" + ИмяТаблицы].Ширина   = ШиринаКолонокКанбан;
		Элементы["Заголовок" + ИмяТаблицы].Ширина = ШиринаКолонокКанбан;
		Элементы["ЗаголовокЧерта" + ИмяТаблицы].Ширина = ШиринаКолонокКанбан;
		Элементы["ТаблицаЗаголовок_Этап_" + ИмяТаблицы].Ширина = ШиринаЭлемента;
		
		//Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		//	Элементы["ТаблицаТекстОснования_Этап_" + ИмяТаблицы].Ширина = 4;
		//Иначе
			Элементы["ТаблицаТекстОснования_Этап_" + ИмяТаблицы].Ширина = ШиринаЭлемента;
			Элементы["ТаблицаЗаголовок_Этап_" + ИмяТаблицы].Ширина = ШиринаЭлемента;
		//КонецЕсли;
	КонецЦикла;
	
	//ТекущийЭлемент = Элементы.ШиринаКолонокКанбан;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаКолонокКанбанПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ИзменениеШириныКолонокКанбан", 0.5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеШириныКолонокКанбан()
	УстановитьШиринуКолонокКанбан();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьШиринуКолонок(Команда)
	
	Если НЕ Элементы.ГруппаПолосаРегулированияВсплывающая.Видимость Тогда
		Элементы.ДекорацияРазделительРегулировки.Видимость	= Ложь;
		Элементы.ГруппаПолосаРегулированияВсплывающая.Видимость = Истина;
		ПодключитьОбработчикОжидания("ВывестиПанельРегулирования", 0.1, Истина);
		ПодключитьОбработчикОжидания("ЗакрытьПанельРегулирования", 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПанельРегулирования()
	Элементы.ГруппаПолосаРегулированияВсплывающая.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельРегулирования()
	
	Если Элементы.ГруппаПолосаРегулированияВсплывающая.Скрыта() Тогда
		Если Элементы.ГруппаПолосаРегулированияВсплывающая.Видимость Тогда
			Элементы.ГруппаПолосаРегулированияВсплывающая.Видимость = Ложь;
			Элементы.ДекорацияРазделительРегулировки.Видимость 		= Истина;
			ОтключитьОбработчикОжидания("ЗакрытьПанельРегулирования");
			#Если ВебКлиент Тогда
				ПодключитьОбработчикОжидания("ЗакрытьПанельРегулирования", 0.1, Истина);
			#КонецЕсли
		Иначе	
			ШиринаКолонокКанбан = ШиринаКолонокКанбан-1;
			УстановитьШиринуКолонокКанбан();
			ШиринаКолонокКанбан = ШиринаКолонокКанбан + 1;
			УстановитьШиринуКолонокКанбанСервер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭтапКонтрольнуюТочку(ИмяКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	Если ИмяКоманды = "СоздатьКТПроекта" Тогда
		ТипЭтапа = ПредопределенноеЗначение("Перечисление.CRM_ТипыЭтапов.КонтрольнаяТочка");
	Иначе
		ТипЭтапа = ПредопределенноеЗначение("Перечисление.CRM_ТипыЭтапов.Этап");
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипЭтапа", ТипЭтапа);
	
	//Если ЗначениеЗаполнено(ОтборПроект) Тогда
	//	ЗначенияЗаполнения.Вставить("Проект", ОтборПроект);
	//КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.CRM_ЭтапКалендарногоПлана.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры // ДобавитьЭтапКонтрольнуюТочку()

#КонецОбласти // РаботаСЭлементамиФормы

#Область Виджеты

&НаСервере
Процедура ОбновитьВиджетыФормы()
	//Если РаботаВМоделиСервиса.РазделениеВключено() Тогда Возврат КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		CRM_РаботаСВиджетамиВызовСервера.ОбновитьВиджетыФормы(ЭтотОбъект, "ГруппаВиджеты");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьВиджетФормы(Виджет)
	
	Возврат CRM_РаботаСВиджетамиВызовСервера.ДобавитьВиджетФормы(ЭтотОбъект, "ГруппаВиджеты", Виджет);
	
КонецФункции

&НаСервере
Процедура УдалитьВиджетФормы(Виджет)
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		CRM_РаботаСВиджетамиВызовСервера.УдалитьВиджетФормы(ЭтотОбъект, "ГруппаВиджеты", Виджет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_01()
	
	ОбновитьВиджетНаСервере("01");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_02()
	
	ОбновитьВиджетНаСервере("02");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_03()
	
	ОбновитьВиджетНаСервере("03");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_04()
	
	ОбновитьВиджетНаСервере("04");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_Прочие()
	
	ОбновитьВиджетНаСервере("Прочие");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетНаСервере(ИндексВиджета)
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоказатели") Тогда
		CRM_РаботаСВиджетамиВызовСервера.ОбновитьВиджет(ЭтотОбъект, ИндексВиджета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИсточникДанныхВиджета(Виджет)
	
	Возврат Виджет.ИсточникДанных;
	
КонецФункции

&НаСервере
Функция ПолучитьПериодОбновленияВиджетаНаСервере(Виджет, Индекс)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиВиджетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь 	= ТекущийПользователь;
	МенеджерЗаписи.Виджет 			= Виджет;
	МенеджерЗаписи.ИндексВиджета 	= Индекс;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат ?(ЗначениеЗаполнено(МенеджерЗаписи.ПериодОбновления), МенеджерЗаписи.ПериодОбновления, 3600);
	Иначе
		Если Виджет.ИсточникДанных.КонтролируемыйПоказатель = "" Тогда
			Возврат 3600;
		Иначе	
			Возврат Виджет.ИсточникДанных.ПериодОбновления;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкуПоказыватьВиджеты(КлючОбъекта, Настройка)
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "ПоказыватьПанельВиджетов", Настройка);  
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
