///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ #Б-2208 смарт: Фролов 26.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
Перем смартЭтоНоваяЗадача;
//-- #Б-2208 смарт: Фролов 26.02.2025
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// +CRM не включать в инструкцию модуля
	ЗадачаБылаВыполнена = ?(ЗначениеЗаполнено(Ссылка), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Выполнена"), Ложь);
	// -CRM не включать в инструкцию модуля
	
	ЗадачаБылаВыполнена = ?(ЗначениеЗаполнено(Ссылка), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Выполнена"), Ложь);
	Если Выполнена И ЗадачаБылаВыполнена <> Истина И НЕ РеквизитыАдресацииЗаполнены() Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Укажите исполнителя задачи.'"),,,
			"Объект.Исполнитель", Отказ);
		Возврат;
			
	КонецЕсли;
	
	Если СрокИсполнения <> '00010101' И ДатаНачала > СрокИсполнения Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата начала исполнения не должна превышать крайний срок.'"),,,
			"Объект.ДатаНачала", Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Ссылка.Пустая() Тогда
		ИсходныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
			"Выполнена, ПометкаУдаления, СостояниеБизнесПроцесса");
	Иначе
		ИсходныеРеквизиты = Новый Структура(
			"Выполнена, ПометкаУдаления, СостояниеБизнесПроцесса",
			Ложь, Ложь, Перечисления.СостоянияБизнесПроцессов.ПустаяСсылка());
	КонецЕсли;
		
	Если ИсходныеРеквизиты.ПометкаУдаления <> ПометкаУдаления Тогда
		БизнесПроцессыИЗадачиСервер.ПриПометкеУдаленияЗадачи(Ссылка, ПометкаУдаления);
	КонецЕсли;
	
	Если НЕ ИсходныеРеквизиты.Выполнена И Выполнена Тогда
		
		Если СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Остановлен Тогда
			ВызватьИсключение НСтр("ru = 'Нельзя выполнять задачи остановленных бизнес-процессов.'");
		КонецЕсли;
		
		// Если задача выполнена, то запишем в реквизит Исполнитель того
		// пользователя, который фактически выполнил задачу. Это нам потом
		// потребуется для отчетов. Такую запись делаем только в том
		// случае, если в базе было не выполнено, а в объекте стало выполнено.
		Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
			Исполнитель = Пользователи.АвторизованныйПользователь();
		КонецЕсли;
		Если ДатаИсполнения = Дата(1, 1, 1) Тогда
			ДатаИсполнения = ТекущаяДатаСеанса();
		КонецЕсли;
	// +CRM
	//ИначеЕсли НЕ ПометкаУдаления И ИсходныеРеквизиты.Выполнена И Выполнена Тогда
	// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	// НСтр("ru='Эта задача уже была выполнена ранее.';en='This task was already fulfilled earlier.'"),,,, Отказ);
	// Возврат;
	ИначеЕсли ИсходныеРеквизиты.ПометкаУдаления = ПометкаУдаления И ИсходныеРеквизиты.Выполнена И Выполнена Тогда
		Если ЗначениеЗаполнено(БизнесПроцесс) Тогда // Для личных задач разрешено изменять выполненные.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Эта задача уже была выполнена ранее.';en='This task was already fulfilled earlier.'"),,,, Отказ);
			Возврат;
		КонецЕсли;
	// -CRM
	КонецЕсли;
	
	Если Важность.Пустая() Тогда
		Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СостояниеБизнесПроцесса) Тогда
		СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
	КонецЕсли;
	
	ПредметСтрокой = ОбщегоНазначения.ПредметСтрокой(Предмет);
	
	Если НЕ Ссылка.Пустая() И ИсходныеРеквизиты.СостояниеБизнесПроцесса <> СостояниеБизнесПроцесса Тогда
		УстановитьСостояниеПодчиненныхБизнесПроцессов(СостояниеБизнесПроцесса);
	КонецЕсли;
	
	Если Выполнена И Не ПринятаКИсполнению Тогда
		ПринятаКИсполнению = Истина;
		ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УстановитьПривилегированныйРежим(Истина);
	ГруппаИсполнителейЗадач = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(РольИсполнителя, 
		ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации);
	УстановитьПривилегированныйРежим(Ложь);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Заполнение реквизита ДатаПринятияКИсполнению.
	Если ПринятаКИсполнению И ДатаПринятияКИсполнению = Дата('00010101') Тогда
		ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// +CRM
	CRM_БизнесПроцессыИЗадачиВызовСервера.ЗадачаИсполнителяМодульОбъектаОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	Возврат;
	// -CRM
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, 
			"БизнесПроцесс,ТочкаМаршрута,Наименование,Исполнитель,РольИсполнителя,ОсновнойОбъектАдресации," 
			+ "ДополнительныйОбъектАдресации,Важность,ДатаИсполнения,Автор,Описание,СрокИсполнения," 
			+ "ДатаНачала,РезультатВыполнения,Предмет");
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Важность) Тогда
		Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СостояниеБизнесПроцесса) Тогда
		СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСостояниеПодчиненныхБизнесПроцессов(НовоеСостояние)
	
	НачатьТранзакцию();
	Попытка
		ПодчиненныеБизнесПроцессы = БизнесПроцессыИЗадачиСервер.БизнесПроцессыГлавнойЗадачи(Ссылка, Истина);
		Для Каждого ПодчиненныйБизнесПроцесс Из ПодчиненныеБизнесПроцессы Цикл
			БизнесПроцессОбъект = ПодчиненныйБизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.Заблокировать();
			БизнесПроцессОбъект.Состояние = НовоеСостояние;
			БизнесПроцессОбъект.Записать(); // АПК:1327 Блокировка установлена в БизнесПроцессыИЗадачиСервер.БизнесПроцессыГлавнойЗадачи.
		КонецЦикла;	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Определяет, заполнены ли реквизиты адресации: исполнитель или роль исполнителя
// 
// Возвращаемое значение:
//  Булево - возвращает Истина, если в задаче указан исполнитель или роль исполнителя.
//
Функция РеквизитыАдресацииЗаполнены()
	
	Возврат ЗначениеЗаполнено(Исполнитель) ИЛИ НЕ РольИсполнителя.Пустая();

КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
Процедура ПриЗаписи(Отказ)
	
	//++ #Б-2208 смарт: Фролов 26.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	УстановитьПривилегированныйРежим(Истина);
	//-- #Б-2208 смарт: Фролов 26.02.2025
	
	НаборЗаписей = РегистрыСведений.смартЖурналЗадачИВзаимодействий.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Ссылка;
	Запись.Дата = ?(ЗначениеЗаполнено(ДатаНачала), ДатаНачала, Дата);
	Запись.Время = ?(ЗначениеЗаполнено(СрокИсполнения), СрокИсполнения, ДатаИсполнения);
	Запись.Предмет = Предмет;
	Запись.Партнер = CRM_Партнер;
	Запись.Контакт = CRM_КонтактноеЛицо;
	Запись.Исполнитель = Исполнитель;
	Запись.Автор = Автор;
	Запись.Состояние = ?(Выполнена, Справочники.CRM_СостоянияСобытий.Завершено, Справочники.CRM_СостоянияСобытий.ВРаботе);
	
	Если ЗначениеЗаполнено(Ссылка.БизнесПроцесс) И ТипЗнч(Ссылка.БизнесПроцесс) = Тип("БизнесПроцессСсылка.смартIECHOПродажа") Тогда
		Запись.Вид = Справочники.смартВидыЗадач.ПродажаIECHO;
	Иначе	
		Запись.Вид = смартВидЗадачи;
	КонецЕсли;
	
	Запись.ДатаЗавершения = ДатаИсполнения;
	Запись.Тип = Перечисления.смартТипыДелСотрудников.Задача;
	Запись.РучноеДобавление = смартРучноеДобавление;
	НаборЗаписей.Записать(Истина);
	
	//++ #1935 смарт: Фролов 03.09.2024 //Удаление оповещений по выполненным задачам
	Если Выполнена ИЛИ ПометкаУдаления Тогда
		
		//++ #2054 смарт: Фролов 13.09.2024 //Ошибка в проведении интереса
		УстановитьПривилегированныйРежим(Истина);
		//-- #2054 смарт: Фролов 13.09.2024	
		
		НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Источник.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	//-- #1935 смарт: Фролов 03.09.2024
	
	//++ #Б-2208 смарт: Фролов 26.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	Если ЗначениеЗаполнено(Ссылка.БизнесПроцесс) И ТипЗнч(Ссылка.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		
		Если Ссылка.БизнесПроцесс.КартаМаршрута = Справочники.смартПредопределенныеЗначения.Настройки.КартаМаршрутаСогласованиеВзаимодействия Тогда
			
			//++ #Б-3794 смарт: Лопато 16.07.2025 //Объединение карточек партнеров  
			Если ДополнительныеСвойства.Свойство("смартЭтоНоваяЗадача")
				И ДополнительныеСвойства.смартЭтоНоваяЗадача Тогда
			//-- #Б-3794 смарт: Лопато 16.07.2025
				
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	Исполнитель КАК Исполнитель
				|ИЗ
				|	РегистрСведений.ИсполнителиЗадач
				|ГДЕ
				|	РольИсполнителя = &РольИсполнителя");
				Запрос.УстановитьПараметр("РольИсполнителя", Ссылка.РольИсполнителя);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					УчетнаяЗаписьПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
					ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
					ТестовыеАдресаСтрока = "";
					ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
					АдресаДляОтправкиСтрокой = "";
					МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(Выборка.Исполнитель, АдресаДляОтправкиСтрокой);
					
					ОбВзаимодействие = Предмет.ПолучитьОбъект();
					НавСсылка = ПолучитьНавигационнуюСсылку(ОбВзаимодействие);
					ТекстПисьма = "";
					
					ТемаПисьма = "Согласуйте дату взаимодействия!";
					
					ТекстПисьма = Символы.ПС + "Менеджер: " + Предмет.Ответственный + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Клиент: " + Предмет.Партнер + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Вид взаимодействия: " + Предмет.ВидВзаимодействия + Символы.ПС;
					//++ #Б-2600 смарт: Фролов 07.03.2025 //Доработка планирования взаимодействий.
					ТекстПисьма = ТекстПисьма + "Плановая дата взаимодействия: " + Формат(Предмет.ПлановаяДата, "ДФ=dd.MM.yyyy") + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Дата документа: " + Формат(Предмет.Дата, "ДФ=dd.MM.yyyy") + Символы.ПС;
					//-- #Б-2600 смарт: Фролов 07.03.2025
					//++ #Б-5476 смарт: Фролов 28.01.2026 //Добавить проверку на максимальный срок взаимодействия в другие формы
					//ТекстПисьма = ТекстПисьма + "Дней до взаимодействия: " + (НачалоДня(Предмет.ПлановаяДата) + 3600 * 24
					ТекстПисьма = ТекстПисьма + "Дней до взаимодействия: " + (НачалоДня(Предмет.ПлановаяДата)
					//-- #Б-5476 смарт: Фролов 28.01.2026
						- НачалоДня(ТекущаяДата())) / (60 * 60 * 24) + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Причина превышения стандартного срока взаимодействия: " + Предмет.Содержание + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Навигационная ссылка на документ: " + НавСсылка;
					
					Если ЗначениеЗаполнено(УчетнаяЗаписьПочты)
						И (ТестовыеАдресаМассив.Количество() > 0
						ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
						
						ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
						ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
						
						Попытка
							ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьПочты, ПараметрыПисьма);
						Исключение
							ТекстСообщения = "Не удалось отправить письмо, согласующему " + Выборка.Исполнитель + " по взаимодействию " + Предмет + Символы.ПС + ОписаниеОшибки(); 
							ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли Выполнена	Тогда
				
				УчетнаяЗаписьПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
				ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
				ТестовыеАдресаСтрока = "";
				ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
				АдресаДляОтправкиСтрокой = "";
				МассивАдресовДляОтправки = смартОбщегоНазначения.ПолучитьАдресаПользователей(Предмет.Ответственный, АдресаДляОтправкиСтрокой);
				
				ОбВзаимодействие = Предмет.ПолучитьОбъект();
				НавСсылка = ПолучитьНавигационнуюСсылку(ОбВзаимодействие);
				ТекстПисьма = "";
				
				Если Предмет.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Тогда
					ТемаПисьма = "Дата взаимодействия НЕ согласована!";	
				Иначе	
					ТемаПисьма = "Дата взаимодействия согласована!";
				КонецЕсли;	
				
				ТекстПисьма = ТекстПисьма + "Клиент: " + Предмет.Партнер + Символы.ПС;
				ТекстПисьма = ТекстПисьма + "Вид взаимодействия: " + Предмет.ВидВзаимодействия + Символы.ПС;
				ТекстПисьма = ТекстПисьма + "Дата взаимодействия: " + Формат(Предмет.ПлановаяДата, "ДФ=dd.MM.yyyy") + Символы.ПС;
				ТекстПисьма = ТекстПисьма + "Дней до взаимодействия: " + (НачалоДня(Предмет.ПлановаяДата) + 3600 * 24 - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) + Символы.ПС;
				ТекстПисьма = ТекстПисьма + "Комментарий руководителя: " + Ссылка.РезультатВыполнения + Символы.ПС + Символы.ПС;
				ТекстПисьма = ТекстПисьма + "Навигационная ссылка на документ: " + НавСсылка;
				
				Если ЗначениеЗаполнено(УчетнаяЗаписьПочты)
					И (ТестовыеАдресаМассив.Количество() > 0
					ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
					
					ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
					ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, , ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
					
					Попытка
						ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьПочты, ПараметрыПисьма);
					Исключение
						ТекстСообщения = "Не удалось отправить письмо, согласующему " + Предмет.Ответственный + " по взаимодействию " + Предмет + Символы.ПС + ОписаниеОшибки(); 
						ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
					КонецПопытки;
					
				КонецЕсли;
				
				ОбВзаимодействие.смартСогласованоУвеличенияПлановогоСрока = Истина;
				ОбВзаимодействие.ОбменДанными.Загрузка = Истина;
				ОбВзаимодействие.Записать(РежимЗаписиДокумента.Запись);
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-2208 смарт: Фролов 26.02.2025
	
	//++ #Б-3430 смарт: Фролов 01.06.2025 //Документ "Заказ клиента". Ограничение продажи СНПЧ
	Если Ссылка.Выполнена И Ссылка.смартВидЗадачи = Справочники.смартВидыЗадач.СогласоватьСНПЧ Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.Выполнена
		|	И ЗадачаИсполнителя.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.СогласоватьСНПЧ)
		|	И ЗадачаИсполнителя.Предмет = &Предмет");
		Запрос.УстановитьПараметр("Предмет", Ссылка.Предмет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбъектЗадача = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектЗадача.Выполнена = Истина;
			ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
			ОбъектЗадача.Записать();
			
		КонецЦикла;	
		
	КонецЕсли;
	//-- #Б-3430 смарт: Фролов 02.06.2025 

	//++ #Б-3532 смарт: Фролов 16.06.2025 //Оптимизация прохождения по этапам воронки для документов ЗРР и ЗНП
	Если Ссылка.Выполнена И Ссылка.смартВидЗадачи = Справочники.смартВидыЗадач.ОформлениеКомандировки Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.Выполнена
		|	И ЗадачаИсполнителя.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ОформлениеКомандировки)
		|	И ЗадачаИсполнителя.Предмет = &Предмет");
		Запрос.УстановитьПараметр("Предмет", Ссылка.Предмет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбъектЗадача = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектЗадача.Выполнена = Истина;
			ОбъектЗадача.ДатаИсполнения = ТекущаяДата();
			ОбъектЗадача.Записать();
			
		КонецЦикла;	
		
	КонецЕсли;
	//-- #Б-3532 смарт: Фролов 16.06.2025
	
КонецПроцедуры //-- #1929 смарт: Фролов 23.07.2024

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли