
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
//++ #1739 смарт: Фролов 04.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = Элементы.Вставить("смартОтветственоеПодразделение", Тип("ПолеФормы"), ЭтаФорма, Элементы.ДекорацияПояснение); 	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОтветственоеПодразделение";
	НовыйЭлемент.Заголовок = "Ответственое подразделение (смарт)";

	//++ #Б-2296 смарт: Лопато 12.02.2025 //Справочник "Бизнес-регионы". Добавить реквизит "Обслуживающее подразделение СЦ"  
	НовыйЭлемент = Элементы.Вставить("смартОбслуживающееПодразделениеСЦ", Тип("ПолеФормы"), ЭтаФорма, Элементы.ДекорацияПояснение); 	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОбслуживающееПодразделениеСЦ";
	НовыйЭлемент.Заголовок = "Обслуживающее подразделение СЦ (смарт)";
	//-- #Б-2296 смарт: Лопато 12.02.2025
	
	//++ #Б-2306 смарт: Фролов 18.03.2025 //Доработать механизм распределения Лидов для Татарстана и Башкирии
	НовыйЭлемент = Элементы.Вставить("смартОфисКомпании", Тип("ПолеФормы"), ЭтаФорма, Элементы.смартОтветственоеПодразделение); 	
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОфисКомпании";
	НовыйЭлемент.Заголовок = "Офис компании (смарт)";
	//-- #Б-2306 смарт: Фролов 18.03.2025
	
КонецПроцедуры //-- #1739 смарт: Фролов 04.04.2024

#КонецОбласти