//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
// 1. Справочник сделан иерархическим. Иерархия групп и элементов
// 2. Установлен уровень иерархии = 2
// 3. Для реквизита Ответственный признак использование установлен в "Для группы и элемента"
//-- смарт:ММ 15.02.2020

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Получает контакты для документов взаимодействий согласно списку участников 
//
// Параметры :
//  Ссылка  - СправочникСсылка.ПретензииКлиентов - претензия по которой получаются контакты.
//
// Возвращаемое значение:
//   Массив   - массив, содержащий контакты.
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Возврат СделкиСервер.ПолучитьУчастниковПоТабличнойЧастиПредметаВзаимодействия(Ссылка);
	
КонецФункции

#КонецОбласти

#КонецЕсли
