
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ЗаполнитьДополнительныеТребования(); 
	
	СтруктураДанных = Параметры.СтруктураДанных;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураДанных);
	
	Если ЭтоОтгрузка Тогда			
		
		Элементы.ГруппаТарифОсновнаяВерх.Видимость = Ложь;
		Элементы.ГруппаТарифОсновнаяНиз.Видимость = Ложь;
		Элементы.ГруппаДоставка.Видимость = Ложь;
		Элементы.ГруппаОтгрузка.Видимость = (СпособОтгрузки = 0);
		
	Иначе 		
		
		Элементы.ГруппаОтгрузка.Видимость = Ложь;
		Элементы.ГруппаДоставка.Видимость = (СпособДоставки = 0);
		
		Если СтруктураДанных.МассивДополнительныеУслуги.Количество() > 0 Тогда 
			
			Для Каждого ЭлементМассива Из СтруктураДанных.МассивДополнительныеУслуги Цикл
				
				СтрДопУслуги = ДополнительныеУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(СтрДопУслуги, ЭлементМассива);
				
			КонецЦикла;
			
		Иначе	
		
			ЗаполнитьДополнительныеУслуги();
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеУслуги()	
	
	НаименованияИсключаемыхУслуг = Новый Массив;
	НаименованияИсключаемыхУслуг.Добавить("заезд на второй адрес");  
	НаименованияИсключаемыхУслуг.Добавить("страхование груза и срока"); 
	НаименованияИсключаемыхУслуг.Добавить("страхование груза");
	НаименованияИсключаемыхУслуг.Добавить("доставка груза до дверей получателя");  
	НаименованияИсключаемыхУслуг.Добавить("погрузка у отправителя"); 
	НаименованияИсключаемыхУслуг.Добавить("разгрузка у получателя");	
	НаименованияИсключаемыхУслуг.Добавить("отправка сопроводительных документов");
	НаименованияИсключаемыхУслуг.Добавить("возврат сопроводительных документов");	
	НаименованияИсключаемыхУслуг.Добавить("забор груза от дверей отправителя");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованияИсключаемыхУслуг", НаименованияИсключаемыхУслуг);
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_ДополнительныеУслуги.Ссылка КАК Услуга,
	|	ЛОЖЬ КАК Использовать,
	|	1 КАК Количество,
	|	(ВЫРАЗИТЬ(ВРЕГ(ЛЕВ(ДЛ_ДополнительныеУслуги.Наименование, 1)) КАК СТРОКА(1))) + (ВЫРАЗИТЬ(НРЕГ(ПРАВ(ДЛ_ДополнительныеУслуги.Наименование, ДЛИНАСТРОКИ(ДЛ_ДополнительныеУслуги.Наименование) - 1)) КАК СТРОКА(254))) КАК Наименование
	|ИЗ
	|	Справочник.ДЛ_ДополнительныеУслуги КАК ДЛ_ДополнительныеУслуги
	|ГДЕ
	|	НЕ ДЛ_ДополнительныеУслуги.Наименование В (&НаименованияИсключаемыхУслуг)"; 				   
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеУслуги.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда) 
	
	ПараметрыЗакрытияФормы = Новый Структура; 
	ПараметрыЗакрытияФормы.Вставить("Результат", "");
	
	РезультатСтруктура = Новый Структура();
	
	ЕстьДанные = Ложь;
	
	Если ЭтоОтгрузка Тогда                                                                                    
		
		РезультатСтруктура.Вставить("ОтгрузкаДополнительныеТребованияТС", ОтгрузкаДополнительныеТребованияТС);
		РезультатСтруктура.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботы", ОтгрузкаПогрузочноРазгрузочныеРаботы);
		РезультатСтруктура.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыДоЭтажа", ОтгрузкаПогрузочноРазгрузочныеРаботыДоЭтажа);
		РезультатСтруктура.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыЛифт", ОтгрузкаПогрузочноРазгрузочныеРаботыЛифт);
		РезультатСтруктура.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса", ОтгрузкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса);
		РезультатСтруктура.Вставить("ОтгрузкаПогрузочноРазгрузочныеРаботыПлательщик", ОтгрузкаПогрузочноРазгрузочныеРаботыПлательщик);
		
		Если ЗначениеЗаполнено(ОтгрузкаДополнительныеТребованияТС) Тогда
			
			ЕстьДанные = Истина;		
			
		КонецЕсли; 
		
		Если ОтгрузкаПогрузочноРазгрузочныеРаботы Тогда
			
			ЕстьДанные = Истина;				
			
		КонецЕсли;
		
	Иначе 
		
		РезультатСтруктура.Вставить("ДоставкаДополнительныеТребованияТС", ДоставкаДополнительныеТребованияТС);
		РезультатСтруктура.Вставить("ДоставкаПогрузочноРазгрузочныеРаботы", ДоставкаПогрузочноРазгрузочныеРаботы);
		РезультатСтруктура.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыДоЭтажа", ДоставкаПогрузочноРазгрузочныеРаботыДоЭтажа);
		РезультатСтруктура.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыЛифт", ДоставкаПогрузочноРазгрузочныеРаботыЛифт);
		РезультатСтруктура.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса", ДоставкаПогрузочноРазгрузочныеРаботыРасстояниеПроноса);
		РезультатСтруктура.Вставить("ДоставкаПогрузочноРазгрузочныеРаботыПлательщик", ДоставкаПогрузочноРазгрузочныеРаботыПлательщик);
		РезультатСтруктура.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
		РезультатСтруктура.Вставить("СопроводительныеДокументы", СопроводительныеДокументы);
		РезультатСтруктура.Вставить("СопроводительныеДокументыПлательщик", СопроводительныеДокументыПлательщик); 
		РезультатСтруктура.Вставить("ДополнительныеУслугиПлательщик", ДополнительныеУслугиПлательщик);
		
		МассивДополнительныеУслуги = Новый Массив;
		
		Для Каждого СтрТЗ Из ДополнительныеУслуги Цикл
			
			ЭлементМассива = Новый Структура("Услуга, Использовать, Количество, Наименование");
			ЗаполнитьЗначенияСвойств(ЭлементМассива, СтрТЗ); 			
			МассивДополнительныеУслуги.Добавить(ЭлементМассива);	
			
		КонецЦикла;
		
		РезультатСтруктура.Вставить("МассивДополнительныеУслуги", МассивДополнительныеУслуги);
		
		Если ЗначениеЗаполнено(ДоставкаДополнительныеТребованияТС) Тогда
			
			ЕстьДанные = Истина;	
			
		КонецЕсли; 
		
		Если ДоставкаПогрузочноРазгрузочныеРаботы Тогда
			
			ЕстьДанные = Истина;				
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДополнительнаяИнформация) Тогда
			
			ЕстьДанные = Истина;		
			
		КонецЕсли; 
		
		Если Не ОпределитьВозможностьИзменятьПлательщикаЗаДопУслуги() Тогда  
			
			ЕстьДанные = Истина;		
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЕстьДанные Тогда
		
		ПараметрыЗакрытияФормы.Результат = "Присутствуют"; 	
		
	КонецЕсли;
	
	ПараметрыЗакрытияФормы.Вставить("Значение", РезультатСтруктура);
	
	Закрыть(ПараметрыЗакрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыПриИзменении(Элемент)	 
	
	Элементы.СопроводительныеДокументыПлательщик.ТолькоПросмотр = Не ЗначениеЗаполнено(СопроводительныеДокументы);
	
КонецПроцедуры 

&НаКлиенте
Процедура СопроводительныеДокументыОчистка(Элемент, СтандартнаяОбработка)	
	
	Элементы.СопроводительныеДокументыПлательщик.ТолькоПросмотр = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДополнительныеУслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеУслугиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеУслугиИспользоватьПриИзменении(Элемент) 	
	
	Элементы.ДополнительныеУслугиПлательщик.ТолькоПросмотр = ОпределитьВозможностьИзменятьПлательщикаЗаДопУслуги();
	
КонецПроцедуры

&НаСервере
Функция ОпределитьВозможностьИзменятьПлательщикаЗаДопУслуги() 
	
	Если ДополнительныеУслуги.Количество() = 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ПромТЗ = ДополнительныеУслуги.Выгрузить(, "Использовать");
	ПромТЗ.Сортировать("Использовать УБЫВ");
	
	Возврат Не ПромТЗ[0].Использовать;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДополнительныеТребования()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_СпециальныеТребования.Наименование КАК Наименование,
	|	ДЛ_СпециальныеТребования.UID КАК UID
	|ИЗ
	|	Справочник.ДЛ_СпециальныеТребования КАК ДЛ_СпециальныеТребования
	|ГДЕ
	|	ДЛ_СпециальныеТребования.Наименование <> ""Растентовка""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДЛ_ВидыЗагрузки.Наименование,
	|	ДЛ_ВидыЗагрузки.UID
	|ИЗ
	|	Справочник.ДЛ_ВидыЗагрузки КАК ДЛ_ВидыЗагрузки";  
	
	Результат = Запрос.Выполнить().Выгрузить();              
	
	ЗаполнитьСписокВыбораДополнительныеТребования("Отгрузка", Результат);  
	ЗаполнитьСписокВыбораДополнительныеТребования("Доставка", Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДополнительныеТребования(Префикс, ТЗ_Требования) 
	
	Элементы[Префикс + "ДополнительныеТребованияТС"].СписокВыбора.Добавить("", "Отсутствуют");
	
	Для Каждого СтрТЗ Из ТЗ_Требования Цикл
		
		Элементы[Префикс + "ДополнительныеТребованияТС"].СписокВыбора.Добавить(СтрТЗ.UID, СтрТЗ.Наименование);	
		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПогрузочноРазгрузочныеРаботыПриИзменении(Элемент)
	
	Элементы.ГруппаОтгрузкаПогрузочноРазгрузочныеРаботы.Видимость = ОтгрузкаПогрузочноРазгрузочныеРаботы И СпособОтгрузки = 0;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПогрузочноРазгрузочныеРаботыПриИзменении(Элемент)
	
	Элементы.ГруппаДоставкаПогрузочноРазгрузочныеРаботы.Видимость = ДоставкаПогрузочноРазгрузочныеРаботы И СпособДоставки = 0;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПогрузочноРазгрузочныеРаботыПриИзменении(Неопределено);
	ДоставкаПогрузочноРазгрузочныеРаботыПриИзменении(Неопределено); 
	СопроводительныеДокументыПриИзменении(Неопределено); 
	ДополнительныеУслугиИспользоватьПриИзменении(Неопределено);
	
КонецПроцедуры
